[
  {
    "title": "Tax season is here—4 reasons to file your return early",
    "url": "https://www.cnbc.com/2026/01/26/why-you-should-file-tax-return-early.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108252542-1768416442547-gettyimages-2166284308-dsc_8317-edit.jpeg?v=1768416523&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T19:02:02.000Z",
    "description": "If you're someone who doesn't rush to file your taxes, you're not alone. Nearly 1 in 4 Americans say they wait until the last minute to file, accordin",
    "body": "If you're someone who doesn't rush to file your taxes, you're not alone. Nearly 1 in 4 Americans say they wait until the last minute to file, according to a 2025 survey by IPX1031, a financial services firm.But there are practical reasons to consider filing early, starting Jan. 26, when the Internal Revenue Service opens the federal tax filing season.And this year, timing could matter more than usual, as IRS staffing cuts have added operational strain, according to the National Taxpayer Advocate Service, an independent watchdog within the IRS.Here are four reasons tax experts say filing well ahead of the April 15 deadline may be worth considering, plus one reason why you might want to wait. While these are general guidelines, you may want to consult a tax professional to determine what's right for you.1. You get your refund soonerOne of the most straightforward reasons to file early is speed. Most refunds for electronically filed returns are issued within about 21 days of acceptance if you choose direct deposit, the fastest method for receiving funds. If you file a paper return or receive your refund by mail, expect it to take at least six to eight weeks, per the IRS.That matters, considering the average federal tax refund runs into the thousands, with IRS filing-season data showing the average refund for the 2024 tax year was just over $3,000.\"Even with IRS staffing issues, early filers are typically first in the queue once processing begins,\" Joon Um, an IRS enrolled agent and certified financial planner in Los Angeles, tells CNBC Make It.2. Extra time to pay taxes you oweFiling early doesn't mean you have to pay your tax bill early. Even if you submit your return in January or February, taxes aren't due until the filing deadline in April.That buffer can be especially helpful if your return shows a balance due. Preparing early gives you time to plan how you'll cover the bill rather than scrambling at the last minute. This can matter even more for freelancers, gig workers or anyone whose tax withholding didn't fully cover the amount of taxes they will owe, says Randy Bruns, a certified financial planner in Illinois. 3. Advantages when applying for financial aid, loans or housingA completed tax return is often required to move forward with major financial steps, including qualifying for a mortgage, applying for income-restricted housing lotteries or verifying eligibility for health insurance subsidies.In those situations, a filed return can serve as income verification because it reflects what you actually earned over the year, rather than an estimate. That can be especially helpful for people with variable income, including self-employed workers or freelancers, says Bruns. In some cases, a year-over-year drop in earnings can make you eligible for certain income-based programs, including health insurance subsidies and some housing programs. Having a recently filed return can help document that lower income when proof is required and allow eligibility to be reviewed sooner, Bruns says.For Affordable Care Act coverage, eligibility is based on projected income, but a recently filed return can still help support a claimed income drop if an application is flagged for verification. \"It doesn't override projections, but it can support them and speed up resolution when questions arise,\" says Bruns.4. Head off scammersFiling early can reduce the risk of tax-related identity theft, which often happens at the start of the filing season, according to Turbo Tax.Criminals can use stolen Social Security numbers to submit fraudulent returns and claim refunds before the legitimate taxpayers file. When that happens, the real return can be delayed or flagged while the IRS sorts out the discrepancy.To reduce the chance of getting scammed, the IRS offers an optional identity protection PIN, which blocks anyone from filing a tax return using your Social Security number unless they have the correct six-digit code.In some cases, you may want to wait before filingFiling early can make sense for many taxpayers, but it isn't the right move for everyone.Early filing tends to work best for people with relatively simple, salary-based income and complete paperwork. Taxpayers with investment income, side gigs or pass-through business income may benefit from waiting, because key tax forms can arrive late or be revised, says Um.Those taxpayers may want to delay filing until they receive all expected Form W-2s, Form 1099s or Schedule K-1s, since filing before all documents arrive can increase the risk of errors and amended returns, Um says. \"Filing too early and then amending later usually creates more problems than it solves,\" he adds.Want to get ahead at work with AI? Sign up for CNBC's new online course, Beyond the Basics: How to Use AI to Supercharge Your Work. Learn advanced AI skills like building custom GPTs and using AI agents to boost your productivity today.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tax season is here—4 reasons to file your return early",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108252542-1768416442547-gettyimages-2166284308-dsc_8317-edit.jpeg?v=1768416523&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T19:02:02.000Z",
      "dateModified": "2026-01-26T19:02:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Olympian Alysa Liu's training cost up to $1 million, her dad says—how experts say to approach spending on extracurriculars",
    "url": "https://www.cnbc.com/2026/01/26/how-much-to-spend-on-kids-extracurriculars.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108252612-1768421559348-gettyimages-2255485700-ogpm5365_sb2peyqs.jpeg?v=1768421581&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T18:48:29.000Z",
    "description": "From rising education costs to the price of essentials and extracurriculars, raising kids can be expensive — especially if they want to be an elite at",
    "body": "From rising education costs to the price of essentials and extracurriculars, raising kids can be expensive — especially if they want to be an elite athlete one day.Arthur Liu, father of Olympian and 2025 world champion figure skater Alysa Liu, estimates he's spent a total of $500,000 to $1 million on her training alone, he told CBS' \"60 Minutes\" earlier this month. \"I spared no money, no time,\" on the now 20-year-old skater's training, Arthur Liu said.Certainly not everyone is going to spend as much as Liu did — the average U.S. family spent $1,016 on their child's primary sport in 2024, according to a report by The Aspen Institute — but paying for your child's extracurriculars adds up, says Joe Piszczor, a certified financial planner and founder of Washington Family Wealth in Washington, Pennsylvania. Given the cost of international travel, coaching, equipment and entry fees at an elite level, six to seven figures not a wildly outrageous amount to spend on a child's activities, and footing that bill is OK, Piszczor says, as long as you are aware of your goals and financial situation first.\"I just stress that if they want to do it correctly, let's make sure our house is in order first and we know what our actual discretionary budget is,\" Piszczor says. \"Just know your limits.\"Paying for an extracurricular can produce positive outcomesIt's not wrong to spend money on your child's activities, says Tom Balcom, a CFP and founder of 1650 Wealth Management in Lighthouse Point, Florida. In fact, \"for those who spend money on dance, sports, band — they will say that every penny is worth it because of what their child learns along the way,\" Balcom says.Because Balcom is paying for lessons, practice and tournaments, he says his daughter — a high school sophomore who aspires to play Division I golf one day — is not only improving as a golfer, but learning about the importance of teamwork, discipline and time management.Plus, the benefits will spill over into her future, even if she chooses not to play golf at the collegiate level, Balcom says. Dedication to an activity can be a positive differentiator in the college application process itself, especially in a competitive environment where many students have good grades and test scores, he says.There's no guarantee you'll make your money backHowever, if you're investing thousands of dollars in your child's extracurricular activities, make sure you're not banking on any monetary returns, such as an athletic scholarship in college or your child becoming a professional, says Piszczor. According to the NCAA, the primary governing body for college sports in the U.S., just under 7% of students who participate in high school athletics will compete in an NCAA sport in college, and only about 2% of high school athletes are awarded athletics scholarships.Furthermore, career-ending injuries can happen, or your child can decide to quit or focus on a different passion, Balcom says. Alysa Liu, for example, retired from figure skating at age 16 due to burnout, before ultimately returning to the sport competitively in 2024, he says.\"For families hoping elite extracurriculars lead to college money, the odds are long,\" Piszczor says. \"The most reliable return on investment for college funding is academics and overall financial preparedness, not assuming a passion will pay for itself.\"Protect your financial futureWhen spending money on your child's activities, stick to discretionary money you can afford to lose, both Piszczor and Balcom say. Keep enough money to cover essential monthly expenditures like food and housing, as well as a cash reserve worth three to six months of expenses to cover emergencies, Piszczor says. While tradeoffs can be made, like eating out less or skipping a yearly vacation to cut back on expenses, never tap into your own retirement savings or go into debt to finance your child's dreams, Balcom says.\"People want to see their kids happy, and there's nothing wrong with that,\" Piszczor says. \"Just having that balance is important.\"Want to get ahead at work with AI? Sign up for CNBC's new online course, Beyond the Basics: How to Use AI to Supercharge Your Work. Learn advanced AI skills like building custom GPTs and using AI agents to boost your productivity today. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Olympian Alysa Liu's training cost up to $1 million, her dad says—how experts say to approach spending on extracurriculars",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108252612-1768421559348-gettyimages-2255485700-ogpm5365_sb2peyqs.jpeg?v=1768421581&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T18:48:29.000Z",
      "dateModified": "2026-01-26T18:48:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "GameStop shares move higher after Michael Burry says he's been buying the stock",
    "url": "https://www.cnbc.com/2026/01/26/gamestop-shares-move-higher-after-michael-burry-says-hes-been-buying-the-stock.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107427914-17182060842024-06-12t152637z_1382351200_rc2p98aobi4z_rtrmadp_0_usa-stocks.jpeg?v=1743006674&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T19:16:12.000Z",
    "description": "Traders work at the post where GameStop is traded on the floor at the New York Stock Exchange on June 12, 2024.Brendan McDermid | ReutersMichael Burry",
    "body": "Traders work at the post where GameStop is traded on the floor at the New York Stock Exchange on June 12, 2024.Brendan McDermid | ReutersMichael Burry, the investor made famous by his bet against the U.S. housing market ahead of the financial crisis, disclosed that he has been buying shares of one-time meme darling GameStop.\"I own GME. I have been buying recently. I expect I am buying at what may soon be 1x tangible book value / 1x net asset value,\" Burry said in a Substack post published Monday. \"And getting a young [GameStop CEO] Ryan Cohen investing and deploying the company's capital and cash flows. Perhaps for the next 50 years.\"Shares of GameStop surged more than 6% on Monday following the news.Stock Chart IconStock chart iconGameStop shares in the past dayBurry, who recently closed his hedge fund Scion Asset Management, said his investment is a long-term value play rather than a wager on renewed meme stock speculation. GameStop was at the center of a meme stock frenzy that erupted roughly five years ago, when retail traders coordinating on online forums drove the shares to extraordinary heights and forced massive short-covering by hedge funds.\"I am not counting on a short squeeze to realize long-term value,\" he wrote. \"I believe in Ryan, I like the setup, the governance, the strategy as I see it. I am willing to hold long-term, and I am excited to see where this goes. I am fifteen years his senior, but not too old to be patient.\"The stock has since given back most of those gains as trading activity normalized and speculative interest waned. It last traded around $25 apiece.Still, GameStop has taken advantage of periods of elevated investor interest to raise billions of dollars through equity offerings, leaving it with a substantial cash pile.  \"Ryan is making lemonade out of lemons,\" Burry wrote. \"He has a crappy business, and he is milking it best he can while taking advantage of the meme stock phenomenon to raise cash and wait for an opportunity to make a big buy of a real growing cash cow business.\"The video game retailer began buying bitcoin last year in a similar move made famous by MicroStrategy, now known as Strategy. Cohen said at the time that the decision to buy bitcoin is driven by macro concerns as the digital coin, with its fixed supply and decentralized nature, could serve as protection against certain risks.\"I do not know about this Bitcoin thing, but I cannot argue with what has been done so far,\" Burry said.Burry isn't the only notable investor betting on the company as of late. Just last week, Cohen snapped up 1 million shares of GameStop, according to disclosures filed with the Securities and Exchange Commission. In a Jan. 21 SEC filing, he noted that it's \"essential\" for the CEO of a public company to buy shares with his or her own personal funds \"in order to further strengthen alignment with stockholders.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "GameStop shares move higher after Michael Burry says he's been buying the stock",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107427914-17182060842024-06-12t152637z_1382351200_rc2p98aobi4z_rtrmadp_0_usa-stocks.jpeg?v=1743006674&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T19:16:12.000Z",
      "dateModified": "2026-01-26T19:16:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zoom's 'hidden gem' investment in Anthropic could be worth $2 billion to $4 billion, analysts say",
    "url": "https://www.cnbc.com/2026/01/26/zoom-anthropic-investment.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107418542-1716392447718-gettyimages-2151457699-20090101240508-99-961744.jpeg?v=1769448494&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T21:00:46.000Z",
    "description": "Silas Stein | Picture Alliance | Getty ImagesShares of Zoom closed up 11% on Monday after analysts at Baird estimated that the company's investment in",
    "body": "Silas Stein | Picture Alliance | Getty ImagesShares of Zoom closed up 11% on Monday after analysts at Baird estimated that the company's investment in artificial intelligence startup Anthropic could be worth between $2 billion to $4 billion, depending on dilution assumptions. In May 2023, Anthropic announced a partnership with Zoom and revealed that Zoom Ventures had invested in the company. The companies did not disclose the value of the investment, but Zoom reported making $51 million in \"strategic investments\" that quarter, according to a filing with the U.S. Securities and Exchange Commission. Baird's analysts estimate that all, or at least the \"vast majority,\" of that investment went to Anthropic. The startup is currently valued at $350 billion, suggesting Zoom could see a return of roughly 78 times its investment, the analysts said. \"While we (and the market) have been primarily focused on ZM's ability to gradually reaccelerate revenue growth and capture AI opportunities, the quieter, hidden gem might be its $51 million investment in Anthropic in 2023,\"  the analysts wrote in a Monday note. Zoom exploded in popularity at the start of the Covid-19 pandemic as workers turned to the video-conferencing platform to stay in touch with colleagues, friends and family. But as the pandemic subsided and many workers returned to in-person roles, Zoom's stock has tumbled from its highs.The company's investment in Anthropic could prove to be a bright spot, Baird's analysts said.\"ZM is literally invested in Anthropic's Claude success, and as Anthropic IPO rumors accelerate, the investment could become even more meaningful,\" the analysts wrote.WATCH: Anthropic CEO Dario Amodei on AI race: Focused on making our models as smart and capable as possiblewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zoom's 'hidden gem' investment in Anthropic could be worth $2 billion to $4 billion, analysts say",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107418542-1716392447718-gettyimages-2151457699-20090101240508-99-961744.jpeg?v=1769448494&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T21:00:46.000Z",
      "dateModified": "2026-01-26T21:00:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How the USA Rare Earth deal with the Trump administration came together",
    "url": "https://www.cnbc.com/2026/01/26/how-the-usa-rare-earth-deal-with-the-trump-administration-came-together.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257204-1769456507311-108257204-1769456365873-gettyimages-2240823312-IMF_WORLD_BANK.jpg?v=1769456517&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T20:59:39.000Z",
    "description": "USA Rare Earth CEO Barbara Humpton spoke with Secretary of Commerce Howard Lutnick one month after taking the helm at the critical minerals startup, p",
    "body": "USA Rare Earth CEO Barbara Humpton spoke with Secretary of Commerce Howard Lutnick one month after taking the helm at the critical minerals startup, pitching its assets to the federal government. Humpton's November 2025 conversation with Lutnick would ultimately lead to a proposed deal that will provide USA Rare Earth with about $1.6 billion in funding, subject to certain conditions, and a U.S. government equity stake in the company. The CEO, in an exclusive interview with CNBC's Brian Sullivan on Monday, gave rare insight into how the federal government plans equity stakes in mining companies and aims to reduce U.S. dependence on China. \"One of my first objectives was to make sure the U.S. government understood the assets we have under management, so they could begin to see how that fits into the various issues they are so urgently working on,\" Humpton told CNBC in the interview. Seasoned executive Humpton, who took the reins at USA Rare Earth in October, is a seasoned executive who led Siemens USA for seven years. She was also an executive at defense contractors Booz Allen Hamilton and Lockheed Martin earlier in her career. The deal disclosed on Monday briefly sent USA Rare Earth's stock soaring 29% before it settled back to about a 7% gain.  The agreement could turn USA Rare Earth into a second leg of the rare earth supply chain that the Trump administration is building. The Pentagon struck a landmark deal with MP Materials last summer that included an equity stake, price floor and long-term agreement to buy a specific amount of rare earth minerals and magnets. The proposed deal with USA Rare Earth does not include a price floor or offtake agreement. USA Rare Earth is planning to commission a magnet manufacturing facility in the first quarter of 2026 in Stillwater, Oklahoma and start commercial mining at a rare earth deposit called Round Top, in Sierra Blanca, Texas, in late 2028.  Lutnick asked during the November conversation what would it take for USA Rare Earth to go faster and widen its plans, Humpton said. An interagency meeting was then held with the company, she said.\"We went to work immediately,\" the CEO said. \"Actually, the Department of Commerce led an all-of-government effort. We had a really first-of-its-kind meeting at the Pentagon with both the Department of War, the Department of Energy and Commerce themselves.\" The Commerce Department's Chips and Science Act team then \"switched into high gear to make sure that we moved at warp speed to understand how to scale up this business and to see the transformative opportunity ahead of us,\" Humpton said. The U.S. is \"taking an economic interest in the business, not a governance interest,\" said Humpton, a Wake Forest math major. The Commerce Department has tied the deal to USA Rare Earth achieving key milestones. USA Rare Earth first had to secure at least $500 million in funding from private sources. The company ended up surpassing that goal with $1.5 billion of private investment in public equity (PIPE) funding, Humpton said. The federal government will closely track USA Rare Earth's progress on its business plan as it disburses the money in stages, she said. \"If we don't progress with our business, then we won't receive funding, but as we do progress, we'll be supported by the American people to ensure we quickly build these assets that are needed for our economic security,\" Humpton told CNBC. Manufacturing challengesBut USA Rare Earth will face challenges in ramping up its manufacturing facility and building a mine. Round Top has been a target of investor speculation for decades but has never been developed into a commercial facility.USA Rare Earth cautioned investors on Monday that there is a risk it may not be able to turn Round Top \"into a producing mine.\" The project \"may be delayed, or may not result in the commercial extraction of minerals,\" the company said in a filing to the Securities and Exchange Commission. Humpton, however, was confident during the interview in the eventual development of Round Top. She said the mineral extraction method has advanced, and USA Rare Earth's team has progressed from simulation to bench testing to piloting, she said. \"We know that the chemistry works, and now we are building up our demonstration facility,\" the CEO said. \"So through the early part of this year, you'll be able to see the results as we bring samples from the mountain and actually process them,\" she said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How the USA Rare Earth deal with the Trump administration came together",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257204-1769456507311-108257204-1769456365873-gettyimages-2240823312-IMF_WORLD_BANK.jpg?v=1769456517&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T20:59:39.000Z",
      "dateModified": "2026-01-26T20:59:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI spending wasn't the biggest engine of U.S. economic growth in 2025, despite popular assumptions",
    "url": "https://www.cnbc.com/2026/01/26/ai-wasnt-the-biggest-engine-of-us-gdp-growth-in-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256656-1769211369860-Met_Hyperion_Louisiana_data_center_Jan_9_2026.png?v=1769216172&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T21:02:08.000Z",
    "description": "Meta's 5-gigawatt \"Hyperion\" data center under construction in Richland Parish, Louisiana, on January 9, 2026.MetaThe popular narrative that artificia",
    "body": "Meta's 5-gigawatt \"Hyperion\" data center under construction in Richland Parish, Louisiana, on January 9, 2026.MetaThe popular narrative that artificial intelligence is the engine keeping the U.S. economy alive appears to be overstated, according to recent analyses. The AI boom has reshaped market valuations, driven large investments and record bond issuance to finance data centers, and heavily influenced gross domestic product, or GDP, especially in early 2025. This led many economists and market participants to suggest AI investment was the savior of an otherwise-stagnant domestic economy. However, a January report from MRB Partners U.S. economic strategist Prajakta Bhide reveals that consumption was the most crucial driver of U.S. GDP growth last year, which is usually the case in periods of economic expansion. AI-related capital expenditures were the second-biggest driver, she said. \"AI is an important part of the growth story, but it's not the only part of the growth story. That's a narrative that's out there, that if we didn't have the AI capex, GDP would have slumped last year. And that's simply not true,\" Bhide said in an interview with CNBC. \"Still, it's the U.S. consumer that continues to drive the expansion.\" Given that a lot of high-tech equipment is imported, AI's GDP value is smaller than one might suspect, Bhide said. GDP is comprised of four components: consumption, investment, government spending and net exports. Imports don't count given that GDP measures domestic production.Bhide found that without making any adjustment for imports, AI-related components seem to have added around 90 basis points, or 0.9%, to real GDP growth on average between the first quarter to the third quarter of 2025, or a little under 40% of average real GDP growth over the period. When adjusted for the real imports of computers, peripherals and parts, semiconductors and related devices, and telecom equipment — considered AI-related equipment — then the net average contribution of AI-related investments is smaller, between 40 and 50 basis points, or about 20%-25% of real GDP growth between the first and third quarters, her research shows.Also, even though data centers get a lot of headline attention, Bhide said that it was investments in software and computers that were AI's most important contributions to GDP growth in 2025.\"Although a negative shock to the optimism around A.I. implies a risk to GDP growth, the more realistic (and smaller) estimate of A.I.'s growth impact after adjusting for imports dispels the popular notion that the U.S. economy would falter without it,\" Bhide wrote in the Jan. 8 report. \"Without an A.I. boom, there would have certainly been less GDP growth last year, but there would also be fewer imports, so that overall real growth would still have been decent, above 1.5%, due to solid personal consumption.\" Bespoke Investment Group in December similarly dispelled notions of AI contributions to GDP in a post on X, publishing a chart titled: \"A unique Q1 created vastly over-stated 'AI share of Economy' perceptions.\" The firm found that in the second and third quarters of 2025, categories linked to artificial intelligence spending accounted for just 15% of quarterly GDP growth, with their share of overall GDP coming out less than 5% overall.There is not yet an official final number for 2025 U.S. GDP growth given that annual revisions come out later, and the quarterly results show a mixed picture in a year dominated by strong AI investment, consumer demand and headwinds such as volatile U.S. tariff policies. Real GDP increased at a much higher-than-expected annual rate of 4.3% in the third quarter of 2025. GDP rose at a 3.3% annualized pace in the second quarter, also stronger than estimated. Meanwhile, first-quarter GDP shrank at a 0.3% annualized pace, marking the first negative quarterly growth since the start of 2022.Support for a resilient economy aheadBhide's research underscores the importance of consumer spending as a major leg of economic expansion. Looking ahead, she expects resilient consumption to continue in 2026 despite slower income growth and rising wealth concentration among top U.S. earners. \"You do have the support coming from the fiscal side, and that gives you a little bit of an offset for the aggregate income growth being not as maybe as strong as last year. ... The U.S. consumer's still, in our view, in good shape,\" Bhide told CNBC. \"The argument that only the rich are driving consumption and that somehow makes consumption vulnerable ... we don't find a lot of evidence for that. I don't think the hollowing out of consumption is that much of a cyclical risk,\" she added.Bhide expects economic growth this year also will be supported by further AI investments, Federal Reserve rate cuts and a stabilization in the U.S. unemployment rate that has been aided by a collapse in immigration. She remains watchful of quarterly productivity statistics and the pace of job creation. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI spending wasn't the biggest engine of U.S. economic growth in 2025, despite popular assumptions",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256656-1769211369860-Met_Hyperion_Louisiana_data_center_Jan_9_2026.png?v=1769216172&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T21:02:08.000Z",
      "dateModified": "2026-01-26T21:02:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "American AI coding agents are impressive. But so are China’s",
    "url": "https://www.cnbc.com/2026/01/26/american-ai-coding-agents-are-impressive-but-so-are-chinas.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257110-1769448456827-gettyimages-2254532744-CHINA_ZHIPU.jpeg?v=1769449574&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T20:16:42.000Z",
    "description": "watch nowThere's a new Chinese model gaining buzz among developers: Zhipu AI's GLM 4.7. That in itself is not new, but what did catch our attention wa",
    "body": "watch nowThere's a new Chinese model gaining buzz among developers: Zhipu AI's GLM 4.7. That in itself is not new, but what did catch our attention was where it's becoming popular: the U.S., our own turf.I first spotted Zhipu's post on WeChat, announcing that the new coding tool was seeing so much demand, it would start limiting access. A year after DeepSeek's R1 model shook the artificial intelligence landscape in the U.S., AI experts are saying that they're seeing Chinese AI models spreading around the world. I wanted to see if that was also true for Zhipu.I reached out to the company, with no expectations of hearing back, just as DeepSeek has never responded to our requests. But Zhipu recently went public in Hong Kong, and its investor relations team is on top of the ball. They replied almost immediately, telling me that \"the user base of Zhipu GLM Coding Plan is primarily concentrated in the United States and China.\"American developers have always told us of the bias against using Chinese models — so for Zhipu to be gaining traction here suggested a real DeepSeek-like breakout moment.Just last week, we were floored by the apps that Replit and Claude Code were able to produce in minutes. They felt like the frontier of AI, an example of how American innovation is leading the way. It's also creating a tangible shift, leading to a 60% surge in new app releases. But if a model out of China is just as powerful and easy to use, are they really six months behind like Google DeepMind's Demis Hassabis says? And if they're cheaper and open source, what real moats do the American AI coding agents have? CNBC's Deirdre Bosa and I jumped on the chance to experiment with Zhipu, to see if the hype would match our successes with Replit and Claude. I've always found Chinese stock exchanges difficult to navigate and get data from, so we asked it to build a tracker for the biggest public companies in China. Zhipu whipped up an app more quickly than its American counterparts could, but its results were less polished.We're naturally skeptical of claims from companies that tout usage without publishing metrics, so we checked in with some sources — people building in AI that would come across Zhipu if it really was making inroads here. It was quickly clear that Zhipu's GLM 4.7 is indeed a model gaining recognition in the U.S., though reviews are mixed.One of the builders testing it is Tuhin Srivastava of Baseten, a platform that sits underneath AI applications and sees real-world model usage across enterprises. That matters even more now that Baseten just raised a new round with Nvidia participating, a signal that it's plugged into real, large-scale AI workloads. A conversation with Srivastava and Bosa was livestreamed here at 2:30 p.m. ET on Monday. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "American AI coding agents are impressive. But so are China’s",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257110-1769448456827-gettyimages-2254532744-CHINA_ZHIPU.jpeg?v=1769449574&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T20:16:42.000Z",
      "dateModified": "2026-01-26T20:16:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok users are deleting the app, with removals up 150% following U.S. joint venture",
    "url": "https://www.cnbc.com/2026/01/26/tiktok-uninstalls-are-up-150percent-following-us-joint-venture.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256209-1769170863807-gettyimages-2257704713-img_6794.jpeg?v=1769170916&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T22:58:54.000Z",
    "description": "Cheng Xin | Getty ImagesTikTok users have been deleting the app at a higher rate since the company announced that its U.S. operations would be housed ",
    "body": "Cheng Xin | Getty ImagesTikTok users have been deleting the app at a higher rate since the company announced that its U.S. operations would be housed in a new joint venture.The daily average of U.S. users deleting the TikTok app has increased nearly 150% over the past five days compared with the previous three months, market intelligence firm Sensor Tower told CNBC.Last Thursday, TikTok said it had formed a joint venture to keep the video-sharing app operating in the U.S. under new American leadership. The company named Adam Presser, formerly TikTok's head of operations, as CEO of the joint venture. Some users took to social media to voice their skepticism about the new joint venture after being prompted to agree to an updated privacy policy on Thursday.Several social media posts pointed to language in the new policy that describes the types of data TikTok may collect, including sensitive information such as \"your racial or ethnic origin\" as well as \"sexual life or sexual orientation, status as transgender or nonbinary, citizenship or immigration status, or financial information.\"Despite the social media uproar, that language does not appear to be new. An archived version of the policy from August 2024 includes the same provisions.Those concerns appear to have weighed on sentiment around the app after the announcement of the joint venture, contributing to a spike in uninstalls over the past several days.watch now\"If I can delete my biggest platform because their terms of agreement and censorship have gotten out of control, so can you!\" creator Dre Ronayne posted on Threads, the micro-blogging service owned by Meta. Ronayne said she had nearly 400,000 followers on TikTok before deleting her account on Sunday.Other creators have also reported problems posting to the app, with users complaining about outages and video uploads failing to go through.The social media company hasn't communicated to its creators what the joint venture means for them, Nadya Okamoto, a TikTok creator with over 4 million followers, told CNBC. \"That's why there is so much paranoia, because we're all kind of looking at this platform and we just don't know what's happening,\" she said. Okamoto told CNBC she has experienced issues with the app over the past several days and has been unable to upload videos for roughly 24 hours. During the uncertainty, she is continuing to post her content on Instagram and Google's YouTube.\"Online there's a lot of conversation about — is this all coincidence or censorship, and what does this look like?\" Okamoto said. \"For everything to be happening at once, it is very scary.\"An X account associated with the TikTok joint venture said on Monday that the services issue was caused by a power outage at a U.S. data center.\"We're working with our data center partner to stabilize our service. We're sorry for this disruption and hope to resolve it soon,\" the account wrote.However, the increase in uninstalls has not translated into a meaningful drop in U.S. usage. TikTok's active user levels in the U.S. have remained relatively flat compared with the previous week, according to Sensor Tower.Competing apps, however, have seen a bump in interest. Sensor Tower data shows U.S. downloads for UpScrolled increased more than tenfold compared with the prior week, while Skylight Social rose 919% and Chinese-owned Rednote climbed 53% week over week.TikTok did not respond to request for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok users are deleting the app, with removals up 150% following U.S. joint venture",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256209-1769170863807-gettyimages-2257704713-img_6794.jpeg?v=1769170916&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T22:58:54.000Z",
      "dateModified": "2026-01-26T22:58:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Target's incoming CEO calls Minneapolis violence 'incredibly painful,' does not mention Trump or shootings by federal agents",
    "url": "https://www.cnbc.com/2026/01/26/alex-pretti-shooting-target-incoming-ceo-fiddelke.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108215229-1761133987103-gettyimages-2242151899-McGregor251021FloridaBusinesses02.jpeg?v=1761134018&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T17:26:02.000Z",
    "description": "Sign at the entrance to a Target store in Venice, Florida. Erik Mcgregor | Lightrocket | Getty ImagesTarget's incoming CEO, Michael Fiddelke, told emp",
    "body": "Sign at the entrance to a Target store in Venice, Florida. Erik Mcgregor | Lightrocket | Getty ImagesTarget's incoming CEO, Michael Fiddelke, told employees Monday that the \"violence and loss of life in our community is incredibly painful,\" following the second fatal shooting by federal agents in the company's hometown of Minneapolis in recent weeks.\"I know it's weighing heavily on many of you across the country, as it is with me,\" he said in a video message sent to the big-box retailer's workforce. \"What's happening affects us not just as a company, but as people, as neighbors, friends and family members within Target.\"In the video, Fiddelke did not name the two U.S. citizens killed in the shootings, Renee Good or Alex Pretti, describe the actions of U.S. Immigration and Customs Enforcement agents during the enforcement surge in Minneapolis or call for any specific policy changes. He also did not mention President Donald Trump or his administration.Corporations and CEOs largely stayed silent throughout the deployment of thousands of federal agents in Minneapolis and the killing of Good by an ICE agent earlier this month. Yet even before Saturday's deadly shooting, public opinion polls reflected concerns about the Trump administration's tactics, with 61% of respondents to a New York Times/Siena poll taken after Good's death saying ICE's tactics had gone too far.Thousands of people have marched in the streets of Minneapolis in subzero winter temperatures to protest ICE actions. And on Friday, many local businesses shuttered for an event called \"Day of Truth and Freedom,\" which was organized and backed by local faith leaders.More than 60 Minnesota business leaders, including Fiddelke, signed a letter Sunday calling for an \"immediate deescalation of tensions\" after Pretti's killing. That message also did not specifically mention the shootings or Trump.Target's Chief Operating Officer Michael Fiddelke will take over as CEO from Brian Cornell.Courtesy of TargetFiddelke, Target's chief operating officer, will step into the CEO role on Feb. 1. In the video message to employees, he said he's looking forward to starting the job in a week and \"this isn't the first message I imagined I'd send.\"He said he's \"been meeting with a range of leaders and this weekend added my signature to a statement using our collective voice to call for calm, constructive dialogue and deescalation to reduce tension and keep people safe as that work continues.\"Read the full transcript of Fiddelke's video here:Hi team. In one week I will officially start as CEO. We're about to step into a new chapter for Target, and I've been looking forward to starting this work with you for some time, but this isn't the first message I imagined I'd send. We'll have time to talk very soon about our plans to move Target forward, but right now, as someone who is raising a family here in the Twin Cities and as a leader of this hometown company, I want to acknowledge where we are. The violence and loss of life in our community is incredibly painful. I know it's weighing heavily on many of you across the country, as it is with me. What's happening affects us not just as a company, but as people, as neighbors, friends and family members within Target. We are doing everything we can to manage what's in our control, always keeping the safety of our team and guests our top priority. During my more than 20 years at Target, one of the things I've loved is how we are part of the communities where we operate. Since the beginning, we've given 5% of our profits and millions of volunteer hours to make them strong and vibrant places to live and work. In line with that, I've been meeting with a range of leaders and this weekend added my signature to a statement using our collective voice to call for calm, constructive dialogue and deescalation to reduce tension and keep people safe.As that work continues, looking ahead to next week, I'll spend my first days in the field listening and learning alongside our teams, and then we'll come together for an all-team huddle to talk about how we're moving our business forward. Our leadership team is activated, HR is equipped, and our resources remain ready to give you the care and support you need. Thank you for everything you do for each other, our guests, and our communities.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Target's incoming CEO calls Minneapolis violence 'incredibly painful,' does not mention Trump or shootings by federal agents",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108215229-1761133987103-gettyimages-2242151899-McGregor251021FloridaBusinesses02.jpeg?v=1761134018&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T17:26:02.000Z",
      "dateModified": "2026-01-26T17:26:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Health insurers tumble after Trump administration proposes keeping Medicare Advantage rates flat next year",
    "url": "https://www.cnbc.com/2026/01/26/health-insurers-tumble-after-trump-proposes-keeping-medicare-rates-flat.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107280605-1690984357528-gettyimages-1569285206-HUMANA_EARNS.jpeg?v=1769465068&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T00:43:00.000Z",
    "description": "watch nowStock Chart IconStock chart iconHumana shares in the past dayThe proposal entails a net average payment increase of 0.09% for Medicare Advant",
    "body": "watch nowStock Chart IconStock chart iconHumana shares in the past dayThe proposal entails a net average payment increase of 0.09% for Medicare Advantage plans in 2027, according to a release from the Centers for Medicare & Medicaid Services on Monday. That number is significantly less than Wall Street analysts' expectations that the agency would propose a rate increase of between 4% to 6% for next year. CMS typically finalizes Medicare Advantage rates in early April. If the current proposal holds, the rate increase would result in more than $700 million in payments to Medicare Advantage plans in 2027, according to the agency's release. The closely watched government payment rate determines how much insurers can charge for monthly premiums and plan benefits they offer, and ultimately, their profits. The Wall Street Journal first reported about the government's rate proposal on Monday. Medicare Advantage is a privately run health insurance plan contracted by Medicare. More than half of Medicare beneficiaries are enrolled in such plans, enticed by lower monthly premiums and extra benefits not covered by traditional Medicare, according to health policy research firm KFF.CMS said it is also looking to slash a moneymaking industry billing practice. Part of the proposal aims to improve payment accuracy and ensure Medicare insurers get adequately reimbursed, the Journal reported. \"These proposed payment policies are about making sure Medicare Advantage works better for the people it serves,\" said CMS Administrator Dr. Mehmet Oz in the release. \"By strengthening payment accuracy and modernizing risk adjustment, CMS is helping ensure beneficiaries continue to have affordable plan choices and reliable benefits, while protecting taxpayers from unnecessary spending that is not oriented towards addressing real health needs.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Health insurers tumble after Trump administration proposes keeping Medicare Advantage rates flat next year",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107280605-1690984357528-gettyimages-1569285206-HUMANA_EARNS.jpeg?v=1769465068&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T00:43:00.000Z",
      "dateModified": "2026-01-27T00:43:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USA Rare Earth shares rally as Commerce Department takes equity stake",
    "url": "https://www.cnbc.com/2026/01/26/usa-rare-earth-shares-jump-20percent-as-commerce-department-takes-equity-stake.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207467-1769434790873-108207467-1759494536898-gettyimages-2227931369-TFSPI_04082025-9278.jpg?v=1769434805&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T21:07:00.000Z",
    "description": "watch nowUSA Rare Earth shares rallied Monday after the critical minerals startup announced that the Department of Commerce will take an equity stake.",
    "body": "watch nowUSA Rare Earth shares rallied Monday after the critical minerals startup announced that the Department of Commerce will take an equity stake. Commerce has issued a letter of intent that would provide USA Rare Earth with a $1.3 billion loan and $277 million in federal funding. USA Rare Earth will issue Commerce 16.1 million shares of common stock and 17.6 million in warrants. The U.S. government will have an 8% to 16% stake in the company depending on whether the warrants are exercised, according to a filing with the Securities and Exchange Commission. USA Rare Earth will also raise $1.5 billion from private investors. The proposed deal with Commerce is subject to the finalization of certain conditions.CEO Barbara Humpton said the deal with the U.S. government will turn USA Rare Earth into an industry leader. Its stock soared 29% at its high Monday before closing with a gain of about 8% at $26.72 per share.\"This is a watershed moment in our work to secure and grow a resilient and independent rare earth value chain based in this country,\" Humpton told analysts on a call Monday. \"We have long said that meeting the urgent call to reassure the rare earth and critical minerals industry will require a multiplayer solution, and this establishes our company as one of the leaders,\" she said. USA Rare Earth is the latest in a series of mining companies that the Trump administration has taken equity stakes in as it builds a Western rare earth and critical minerals supply chain to reduce dependence on China. Rare earths are a subset of critical minerals that are crucial inputs in strategic industries like defense, robotics, electric vehicles and semiconductor manufacturing.Magnet plant and mineThe capital infusion from the Trump administration will help USA Rare Earth advance its plan to build a magnet manufacturing plant in Stillwater, Oklahoma, and a mine at a rare earth deposit in Sierra Blanca, Texas, called Round Top. Commerce will disburse the funding from 2026 through 2028 based on milestones as USA Rare Earth implements its business plan, Chief Financial Officer Rob Steele told analysts on the call.USA Rare Earth is on track to commission its magnet manufacturing plant in the first quarter of 2026, Steele said. It aims to start commercial mining operations at Round Top in late 2028, he said. The company needs about about $4.1 billion to execute its plan, Steele said. It will have about $3.5 billion between its current cash and the government financing as well as private funding announced Monday, he said. This leaves $600 million in additional capital that USA Rare Earth needs to raise. \"We believe we can raise the remaining capital from attractive sources, and you should assume that's equity capital but that can come from strategic investments as well as institutional investors,\" Steele said. Funding conditions But USA Rare Earth has to satisfy several conditions before the agreement with Commerce is finalized. This includes raising at least $500 million from sources other than the federal government, which it will satisfy with the private funding announced Monday. It also has to secure two memorandums of understanding with semiconductor end or midstream users, obtain feedstock supply agreements through 2027, and define a power plan for its magnet facility among other conditions, according to its SEC filing. The planned investment in USA Rare Earth comes after the Defense Department struck a landmark deal last summer with rare earth miner MP Materials that included an equity stake, price floor and offtake agreement. The Trump administration also took stakes in Lithium Americas and Trilogy Metals last year.The agreement with USA Rare Earth does not include price floors or offtake agreements. The U.S. has been dependent on rare earth imports from China, which dominates the global supply chain. Beijing tried to cut off rare earth exports last year during trade disputes with the Trump administration.\"USA Rare Earth's heavy critical minerals project is essential to restoring U.S. critical mineral independence,\" Commerce Secretary Howard Lutnick said in a statement. \"This investment ensures our supply chains are resilient and no longer reliant on foreign nations.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USA Rare Earth shares rally as Commerce Department takes equity stake",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207467-1769434790873-108207467-1759494536898-gettyimages-2227931369-TFSPI_04082025-9278.jpg?v=1769434805&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T21:07:00.000Z",
      "dateModified": "2026-01-26T21:07:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shutdown odds grow as Senate Republicans say they won't remove DHS funding after Pretti killing",
    "url": "https://www.cnbc.com/2026/01/25/minneapolis-shooting-government-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242516-1765907996538-gettyimages-2251650126-schumer_BC_152_121625JPG.jpeg?v=1765908136&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T19:07:01.000Z",
    "description": "watch nowChances for a partial shutdown of the U.S. government by the end of this week grew Sunday due to outrage over federal immigration agents fata",
    "body": "watch nowChances for a partial shutdown of the U.S. government by the end of this week grew Sunday due to outrage over federal immigration agents fatally shooting Alex Pretti in Minnesota, the second such incident this month.A growing chorus of Democratic senators warned that they will not vote for a massive $1.2 trillion package to fund federal government operations if it includes appropriations for the Department of Homeland Security, which oversees immigration enforcement efforts.On Sunday, a Senate GOP spokesperson told CNBC that Republicans will not remove the DHS funding portion, despite that warning.\"Government funding expires at the end of the week, and Republicans are determined to not have another government shutdown,\" the spokesperson said.\"We will move forward as planned and hope Democrats can find a path forward to join us,\" the spokesperson said.The House of Representatives on Thursday approved the funding package.Without Senate approval of the deal by Friday, the federal government will begin a partial shutdown.The funding package needs 60 votes to overcome the filibuster and pass the Senate. Republicans hold a 53-47 vote majority in the Senate, meaning Democratic support will be needed to pass the measure.The deadly shooting of Pretti, a 37-year-old ICU nurse who was a U.S. citizen, in Minneapolis on Saturday morning ignited already simmering concern among members of the Democratic caucuses in Congress about funding DHS. Democrats already were angry about the fatal shooting of Minneapolis resident Renee Good by an Immigration and Customs Enforcement, or ICE, officer in that city on Jan. 7.\"Senate Democrats will not allow the current DHS funding bill to move forward,\" Senate Minority Leader Chuck Schumer, D-N.Y., said in a statement Sunday.\"Senate Republicans have seen the same horrific footage that all Americans have watched of the blatant abuses of Americans by ICE in Minnesota,\" Schumer said. \"The appalling murders of Renee Good and Alex Pretti on the streets of Minneapolis must lead Republicans to join Democrats in overhauling ICE and CBP to protect the public,\" he said. \"People should be safe from abuse by their own government.\"Sen. Angus King of Maine told CBS' \"Face the Nation\" on Sunday, \"I can't vote for a bill that includes ICE funding under these circumstances.\"\"Take up DHS by itself, let's have an honest negotiation, put some guardrails on what's going on, some accountability, and that would solve this problem,\" said King, one of two independents who caucus with Democrats. \"We don't have to have a shutdown,\" he said.Read more CNBC politics coverageAlex Pretti killing: Minnesota CEOs, including UnitedHealth, Target, call for 'immediate deescalation'After Minneapolis shooting, government hurtles toward shutdown over DHS fundingTrump threatens to impose 100% tariff if Canada makes deal with ChinaTrump withdraws 'Board of Peace' invitation to Carney in widening riftHouse passes final funding bills 8 days before shutdown, Senate now will considerGreenland PM: Trump-NATO deal framework unclear, sovereignty is a red lineTrump sues Jamie Dimon, JPMorgan Chase over debanking the suit calls 'political'Trump says he reached Greenland deal 'framework' with NATO, backs off tariffsTrump interview live updates: CNBC's Joe Kernen sits down with the president at DavosKing played a key role in ending last year's 43-day shutdown. He voted repeatedly to open the government during the last shutdown as his Democratic colleagues pushed for an extension of Obamacare subsidies.Members of the House, which went into a pre-scheduled recess after passing the bill, would have to return to approve any changes the Senate makes before the shutdown deadline. It is unclear whether Republicans who control the House can or would do so. Some Democrats were already opposed to the funding measure, which, in addition to DHS, includes appropriations for the departments of Defense, Health and Human Services, Labor, Housing and Urban Development, Transportation, Education, State, and Treasury. \"No, I am not voting for this funding,\" said Minnesota Democratic Sen. Amy Klobuchar on NBC's \"Meet the Press\" on Sunday. \"Our Republican colleagues have to stand up and stop this.\"The top Democrat on the Senate Appropriations Committee, Sen. Patty Murray of Washington, has also said she will oppose the package if it includes DHS funding. Murray warned earlier last week that the \"suggestion that a shutdown in this moment might curb the lawlessness of this administration is not rooted in reality.\"\"Federal agents cannot murder people in broad daylight and face zero consequences,\" Murray said on X Saturday.\"I will NOT support the DHS bill as it stands. The DHS bill needs to be split off from the larger funding package before the Senate — Republicans must work with us to do that,\" she said.It was unclear if the Senate could split the DHS portion off from the rest of the funding bill to minimize a partial shutdown. While the House passed the DHS bill separately from the rest of the bills, they were all tied together into one bill to be sent to the Senate, meaning the majority of Republicans would need to support splitting the bill up. It remains possible that enough Democrats join with Republicans to pass the funding bill and avoid a shutdown. Many of the other agencies in the package are important to Democrats. DHS may also be less hindered during a shutdown if it taps the hundreds of billions of dollars that congressional Republicans injected into the agency as part of their \"big beautiful bill\" law passed last summer. But that is far from a guaranteed outcome. Several Democrats who joined with Republicans last year to end the record 43-day government shutdown have warned they will oppose the bill if it includes funding for DHS.\"I will not support the current Homeland Security funding bill,\" said Sen. Catherine Cortez Masto, D-Nev., who is one of the Democrats who joined Republicans to end the last shutdown.\"Let's pass the remaining five bipartisan bills and fund essential agencies while we continue to fight for a Department of Homeland Security that respects Americans' constitutional rights and preserves federal law enforcement's essential role to keep us safe.\"  Complicating matters further is a massive snowstorm over Washington, D.C., and wide stretches of the U.S. The Senate canceled votes on Monday due to the storm, shortening an already tight timeline to avoid a shutdown. — CNBC's Emily Wilkins contributed to this article.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shutdown odds grow as Senate Republicans say they won't remove DHS funding after Pretti killing",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242516-1765907996538-gettyimages-2251650126-schumer_BC_152_121625JPG.jpeg?v=1765908136&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T19:07:01.000Z",
      "dateModified": "2026-01-26T19:07:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Carney says Canada not pursuing free trade deal with China as Trump threatens 100% tariffs  ",
    "url": "https://www.cnbc.com/2026/01/26/canada-china-trade-deal-tariffs-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256778-1769387549866-gettyimages-2257017848-CANADA_CARNEY.jpeg?v=1769387562&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T15:27:31.000Z",
    "description": "watch nowCanada has \"no intention\" of pursuing a free trade deal with China, Prime Minister Mark Carney said, after U.S. President Donald Trump threat",
    "body": "watch nowCanada has \"no intention\" of pursuing a free trade deal with China, Prime Minister Mark Carney said, after U.S. President Donald Trump threatened to slap punitive tariffs on Ottawa.Speaking to reporters on Sunday, Carney said that the country respects its obligations under the Canada-U.S.-Mexico trade agreement, known as CUSMA in Canada and the USMCA in the U.S., and will not pursue a free trade agreement without notifying the other two parties. Carney's remarks come after Trump threatened to put a 100% tariff on Canadian exports if Ottawa \"makes a deal\" with Beijing. \"If Governor Carney thinks he is going to make Canada a 'Drop Off Port' for China to send goods and products into the United States, he is sorely mistaken,\" Trump posted on Truth Social Saturday.The remarks come against the backdrop of rising tensions between the U.S. and Canada, with Trump last week withdrawing the invitation to Ottawa to join his \"Board of Peace,\" after Carney in his address at the World Economic Forum in Davos warned against economic coercion by the world's superpowers.While Carney did not name any country, Trump said on the sidelines of the WEF that \"Canada lives because of the United States. Remember that, Mark, the next time you make your statements.\"    Trump's fiery rhetoric on Truth Social contrasts with what he said after the agreement between Ottawa and Beijing earlier this month, \"that's what he [Carney] should be doing. It's a good thing for him to sign a trade deal. If you can get a deal with China, you should do that.\" Treasury Secretary Scott Bessent also echoed Trump's sentiments on Canada and China, telling ABC News on Sunday that the U.S could not \"let Canada become an opening that the Chinese pour their cheap goods into the U.S.\"On Jan. 16, Ottawa and Beijing concluded a \"preliminary agreement,\"  with both sides lowering tariffs on select goods. Under the agreement, Canada will allow 49,000 Chinese electric vehicles into the market annually at a lowered tariff rate of 6.1%, after raising tariffs on such vehicles to 100% in October 2024 in conjunction with the U.S. In return, Beijing will cut duties on Canadian agricultural exports, including on canola seed oil, which will see tariffs drop to 15% from March 1, down from the current 85%. Other exports, such as Canadian canola meal, lobsters, crabs, and peas will also not be subject to Chinese anti-discrimination tariffs until at least the end of 2026.Carney said Sunday: \"What we have done with China is to rectify some issues that have developed in the last couple of years,\" adding that the deal was \"entirely consistent with CUSMA.\"In August 2025, Trump raised tariffs on Canadian goods to 35% from 25%. Duties aren't imposed on most Canadian exports under CUSMA, but some goods, including steel, copper and certain autos and auto parts, are subject to U.S. tariffs.— CNBC's Terri Cullen contributed to this report. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Carney says Canada not pursuing free trade deal with China as Trump threatens 100% tariffs  ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256778-1769387549866-gettyimages-2257017848-CANADA_CARNEY.jpeg?v=1769387562&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T15:27:31.000Z",
      "dateModified": "2026-01-26T15:27:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hyundai shares fall after Trump says tariffs on South Korean autos, pharma to rise to 25%",
    "url": "https://www.cnbc.com/2026/01/26/trump-south-korea-tariffs-trade-autos-pharma.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218465-17617385592025-10-29t043800z_151672746_rc2glha17rkq_rtrmadp_0_usa-trump-southkorea-speech.jpeg?v=1761738591&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T00:21:09.000Z",
    "description": "U.S. President Donald Trump speaks at the 2025 Asia-Pacific Economic Cooperation (APEC) CEO Summit in Gyeongju, South Korea, October 29, 2025. Tyrone ",
    "body": "U.S. President Donald Trump speaks at the 2025 Asia-Pacific Economic Cooperation (APEC) CEO Summit in Gyeongju, South Korea, October 29, 2025. Tyrone Siu | ReutersPresident Donald Trump said Monday that he was increasing tariffs on imported autos, pharmaceuticals, and lumber from South Korea from 15% to 25% because of a delay in that country's legislature approving a trade deal with the United States reached last summer.Hyundai Motor shares fell by more than 4% on the heels of the news. The South Korean-based is the largest importer of new vehicles from that country into the United States.The share price of Hyundai's subsidiary Kia dropped nearly 3.5%, and the affiliated Hyundai Mobis was down 5%, Reuters reported.\"South Korea's Legislature is not living up to its Deal with the United States,\" Trump said in a Truth Social post.\"President Lee [Jae Myung] and I reached a Great Deal for both Countries on July 30, 2025, and we reaffirmed these terms while I was in Korea on October 29, 2025. Why hasn't the Korean Legislature approved it?\" Trump asked.\"Because the Korean Legislature hasn't enacted our Historic Trade Agreement, which is their prerogative, I am hereby increasing South Korean TARIFFS on Autos, Lumber, Pharma, and all other Reciprocal TARIFFS, from 15% to 25%,\" he wrote.CNBC has requested comment from South Korea's embassy in Washington, D.C., on Trump's announcement.Reuters reported that South Korea's presidential Blue House said that the U.S government had not officially notified South Korea of the tariff hike. The news outlet also reported that South Korea's presidential adviser would hold a meeting with related ministries to discuss measures related to the increase.South Korea is one of the biggest exporters of goods to the United States.The U.S. imported $131.6 billion in goods from South Korea in 2024, according to the Office of the U.S. Trade Representative.Read more CNBC politics coverageAlex Pretti killing: Minnesota CEOs, including UnitedHealth, Target, call for 'immediate deescalation'After Minneapolis shooting, government hurtles toward shutdown over DHS fundingTrump threatens to impose 100% tariff if Canada makes deal with ChinaTrump withdraws 'Board of Peace' invitation to Carney in widening riftHouse passes final funding bills 8 days before shutdown, Senate now will considerGreenland PM: Trump-NATO deal framework unclear, sovereignty is a red lineTrump sues Jamie Dimon, JPMorgan Chase over debanking the suit calls 'political'Trump says he reached Greenland deal 'framework' with NATO, backs off tariffsTrump interview live updates: CNBC's Joe Kernen sits down with the president at DavosIn the trade deal announced in July, Trump said the U.S. would impose blanket tariffs of 15% on imports from South Korea, 10 percentage points lower than the level he had threatened earlier that same month.Trump also said at the same time that South Korea had agreed to \"give to the United States $350 Billion Dollars for Investments owned and controlled by the United States, and selected by myself, as President.\"The U.S. Supreme Court in November heard arguments in a case challenging the legality of Trump's unilaterally imposed tariffs, with justices expressing skepticism that he had the power to levy such duties without authorization of Congress.The Supreme Court has yet to issue its decision in that case.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hyundai shares fall after Trump says tariffs on South Korean autos, pharma to rise to 25%",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218465-17617385592025-10-29t043800z_151672746_rc2glha17rkq_rtrmadp_0_usa-trump-southkorea-speech.jpeg?v=1761738591&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T00:21:09.000Z",
      "dateModified": "2026-01-27T00:21:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CoreWeave stock jumps 6% as Nvidia invests $2 billion to expand AI data center capacity",
    "url": "https://www.cnbc.com/2026/01/26/3coreweave-nvidia-stock-ai-data-centers.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108254427-1768930561016-kuGZxrH8.jpg?v=1769448961&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-26T21:02:48.000Z",
    "description": "watch nowShares of CoreWeave closed up nearly 6% on Monday after Nvidia announced it has invested $2 billion in the artificial intelligence infrastruc",
    "body": "watch nowShares of CoreWeave closed up nearly 6% on Monday after Nvidia announced it has invested $2 billion in the artificial intelligence infrastructure provider.Nvidia purchased CoreWeave Class A common stock at $87.20 per share, according to a release, a discount from Friday's closing price of $92.98. The investment will help CoreWeave accelerate its buildout of \"5 gigawatts of AI factories by 2030,\" the companies said. \"This deal allows us to accelerate our build, which will lead to continued diversification and reducing dependency on any particular client as we scale into this additional data center capacity,\" CoreWeave CEO Mike Intrator told CNBC's \"Squawk on the Street\" on Monday.A gigawatt is a measure of power that's becoming an increasingly common metric for describing AI data center capacity. Five gigawatts is roughly equivalent to the annual power consumption of 4 million U.S. households, according to a CNBC analysis of data from the Energy Information Administration.\"The thing to remember is we've invested $2 billion into CoreWeave, but recognize that the amount of funding that needs to be raised yet to support that five gigawatts is really quite significant,\" Nvidia CEO Jensen Huang told CNBC during the interview. \"We're investing a small percentage of the amount that ultimately has to go and be provided.\"CoreWeave primarily generates revenue by building and renting out data centers that are full of Nvidia's graphics processing units, which are key for training models and running large AI workloads. The company, which some investors have classified as a \"neocloud,\" has become a crucial player in an increasingly interconnected web of AI infrastructure partners.Prior to Monday's announcement, Nvidia was already a major CoreWeave backer. Read more CNBC tech newsNvidia set to supplant Apple as TSMC's top customer, signaling chip industry's 'changing dynamic'Nvidia and Alphabet VC arms back AI startup Synthesia at $4 billion valuationMeta's Reality Labs cuts sparked fears of a 'VR winter'Musk's $1 trillion pay package renews focus on soaring CEO compensationIn September, CoreWeave disclosed an order worth at least $6.3 billion from Nvidia in a filing with the U.S. Securities and Exchange Commission. Nvidia has an obligation to buy the \"residual unsold capacity through April 2032, according to the agreement. CoreWeave went public on the Nasdaq in March, and the company raised billions of dollars in debt and equity, including from Nvidia.\"We're in the beginning of the AI infrastructure build-out, and the demand is just extraordinary,\" Huang said on Monday.As AI startups race to build out their computing infrastructure, CoreWeave has been on a deal-making blitz. The company announced in September that it agreed to provide Meta with $14.2 billion of AI cloud infrastructure, just days after expanding its contract with OpenAI to $22.4 billion.But CoreWeave's stock has been shaky in recent months as some investors worry that the company is taking on high levels of debt to finance those multibillion-dollar deals. Intrator told CNBC earlier this month that AI will eventually be embedded into \"absolutely everything we do\" and that the technology will \"continue to pay dividends over the next 100 years.\" \"What you're seeing is the base-load infrastructure being built right now at what has historically been a pace that wasn't even considered,\" he said. \"Companies like CoreWeave, and there are others, are out there building the infrastructure to be able to deliver that for these clients.\"PRO: Watch CNBC's full interview with Nvidia CEO Jensen Huang and CoreWeave CEO Mike Intrator",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CoreWeave stock jumps 6% as Nvidia invests $2 billion to expand AI data center capacity",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108254427-1768930561016-kuGZxrH8.jpg?v=1769448961&w=1920&h=1080"
      ],
      "datePublished": "2026-01-26T21:02:48.000Z",
      "dateModified": "2026-01-26T21:02:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]