[
  {
    "title": "Warren to call for reversal of Trump's UAE chip sales after 'Spy Sheikh' revelations",
    "url": "https://www.cnbc.com/2026/02/05/warren-trump-chip-sales-spy-sheikh.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261999-1770309505372-Untitled-2.jpg?v=1770313340&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T18:58:45.000Z",
    "description": "Sen. Elizabeth Warren (D-MA) (L), and Sheikh Tahnoon bin Zayed Al NahyanGetty Image | ReutersSen. Elizabeth Warren, D-Mass., will ask the Senate on Th",
    "body": "Sen. Elizabeth Warren (D-MA) (L), and Sheikh Tahnoon bin Zayed Al NahyanGetty Image | ReutersSen. Elizabeth Warren, D-Mass., will ask the Senate on Thursday to condemn and call for the reversal of the sale of 500,000 advanced artificial intelligence chips to the United Arab Emirates. Warren's resolution, shared exclusively with CNBC, comes after a report in The Wall Street Journal last week that Sheikh Tahnoon bin Zayed Al Nahyan of the United Arab Emirates, also known as the \"Spy Sheikh,\" purchased a secret 49% stake in the Trump family’s World Liberty Financial days before President Donald Trump's inauguration. The stake reportedly saw roughly $187 million flow to Trump family entities.The chip deal came just months after Tahnoon's purchase in World Liberty Financial, prompting allegations of bribery. Prior U.S. administrations have warned against selling chips to the UAE, citing concern that they will fall into the hands of China. Tahnoon's own AI enterprise, G42, will receive chips as part of the deal. \"Why in the world was Donald Trump trying to ship off our state-of-the-art chips to the UAE — and China — when American startups, universities, and small businesses need them here at home?\" Warren is expected to ask on the floor when she introduces her resolution. A draft of it has been viewed by CNBC. \"Well, now we know that the UAE greased the skids months earlier when it secretly agreed to pour hundreds of millions of dollars into a Trump family crypto venture just four days before President Trump's inauguration.\"President Donald Trump shakes hands with Tahnoun bin Zayed Al Nahyan, National Security Advisor of UAE, next to UAE President Mohammed bin Zayed Al Nahyan, left, after arriving on Air Force One at Abu Dhabi International Airport, Thursday, May 15, 2025, in Abu Dhabi, United Arab Emirates.Alex Brandon | APIf agreed to on the Senate floor, the resolution would resolve that the Senate \"Condemns Donald Trump's decision to allow the sale of advanced AI chips to the United Arab Emirates and calls for the reversal of this decision.\"The chip deal would send 500,000 of Nvidia's chips to the UAE annually, including the most advanced silicon the U.S. company makes. The U.S. is battling with China over AI dominance, and tightly guards its technology.Warren's push for a vote on the resolution is likely to be blocked on the Senate floor, where any senator could object to the measure. But it could put Republicans — who have also warned about AI chips reaching China — in a difficult spot. \"Trump is profiting from decisions that make it easier for countries like China to get their hands on some of our most sensitive and advanced technology,\" Warren, the top Democrat on the Senate banking committee, is expected to say. \"Congress needs to grow a spine. We cannot allow American national security to be sold to the highest bidder,\" she's expected to add. The Trump administration has denied wrongdoing related to Tahnoon's purchase and the chip deal. Trump, asked about the deal this week, said, \"Well, I don't know about it.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Warren to call for reversal of Trump's UAE chip sales after 'Spy Sheikh' revelations",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261999-1770309505372-Untitled-2.jpg?v=1770313340&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T18:58:45.000Z",
      "dateModified": "2026-02-05T18:58:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hillary Clinton wants testimony on Jeffrey Epstein in public: 'Let's stop the games'",
    "url": "https://www.cnbc.com/2026/02/05/jeffrey-epstein-hillary-clinton-public-hearing-congress.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108260481-1770075484026-108260481-17700753502025-01-20t185718z_1619722364_rc2sdcaq4kwk_rtrmadp_0_usa-trump-inauguration.jpeg?v=1770324250&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T21:03:40.000Z",
    "description": "Former President Bill Clinton and former Secretary of State Hillary Clinton arrive ahead of the 60th inaugural ceremony on Jan. 20, 2025, at the Capit",
    "body": "Former President Bill Clinton and former Secretary of State Hillary Clinton arrive ahead of the 60th inaugural ceremony on Jan. 20, 2025, at the Capitol in Washington.Melina Mara | Via ReutersFormer Secretary of State Hillary Clinton on Thursday challenged Republicans on the House Oversight Committee to take the testimony of her and former President Bill Clinton about sex offender Jeffrey Epstein in public and not in a closed session as those lawmakers plan.Hillary Clinton made the demand after she and Bill Clinton dropped their efforts to resist subpoenas to testify before that committee, whose Republican leadership had threatened a vote on holding them in contempt of Congress if they refused to appear.\"For six months, we engaged Republicans on the Oversight Committee in good faith,\" Hillary Clinton said in a post on X. \"We told them what we know, under oath. They ignored all of it. They moved the goalposts and turned accountability into an exercise in distraction.\"\"So let's stop the games. If you want this fight, @RepJamesComer, let's have it — in public,\" Clinton wrote, naming the panel's chairman. \"You love to talk about transparency. There's nothing more transparent than a public hearing, cameras on.\"House Oversight Committee Chairman James Comer, R-Ky., told reporters on Tuesday that the Clintons would not be \"treated differently than everyone else,\" and said the subpoenas for them called for depositions to be taken by the committee, not for a public hearing.\"If they get through the depositions and they still want a public hearing, we'll try to do something,\" Comer said that day.A spokeswoman for the Oversight Committee, in a statement Thursday to CNBC when asked about Hillary Clinton's X post, said, \"The Clintons are going to Clinton and try to spin the facts since no one is buying their claims. The only ones moving the goalposts are, as usual, the Clintons and their attorneys.\"\"The Clintons were issued bipartisan subpoenas for depositions — not a hearing. Republicans and Democrats on the Oversight Committee voted to recommend the House hold the Clintons in contempt of Congress for defying duly issued subpoenas for six months,\" the statement said.\"In the wake of facing contempt of Congress proceedings, the Clintons' attorney finally agreed to filmed, transcribed depositions on February 26 and 27,\" the spokeswoman said.\"These depositions are in accordance with House and Committee rules. All witnesses appearing for interviews as part of our Epstein investigation are being treated fairly and consistently. The Committee has filmed interviews with all witnesses, including former U.S. Attorney General Bill Barr and U.S. Labor Secretary Alex Acosta — both of whom are Republican witnesses.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hillary Clinton wants testimony on Jeffrey Epstein in public: 'Let's stop the games'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108260481-1770075484026-108260481-17700753502025-01-20t185718z_1619722364_rc2sdcaq4kwk_rtrmadp_0_usa-trump-inauguration.jpeg?v=1770324250&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T21:03:40.000Z",
      "dateModified": "2026-02-05T21:03:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Peloton shares plunge 26% on weak holiday quarter, sluggish demand for splashy new products",
    "url": "https://www.cnbc.com/2026/02/05/peloton-pton-earnings-q2-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107327243-1698864973814-gettyimages-1757875748-PELOTON_EARNS.jpeg?v=1770291808&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T21:02:40.000Z",
    "description": "A Peloton Bike inside a showroom in New York, US, on Wednesday, Nov. 1, 2023. Peloton Interactive Inc. is scheduled to release earnings figures on Nov",
    "body": "A Peloton Bike inside a showroom in New York, US, on Wednesday, Nov. 1, 2023. Peloton Interactive Inc. is scheduled to release earnings figures on November 2.Michael Nagle | Bloomberg | Getty ImagesPeloton posted a worse-than-expected holiday quarter on Thursday after shoppers failed to shell out for its new AI-driven product line and turned away from higher subscription prices, sending shares down 26%.The connected fitness company missed Wall Street's estimates on the top and bottom lines and fell short of its own internal sales targets in the three months ended Dec. 31 – typically the strongest for Peloton's hardware revenue. The company said it expects sluggish sales to continue in the current quarter. Peloton forecasts revenue between $605 million and $625 million, below expectations of $638 million, according to LSEG. The weak results, coupled with soft guidance, are the first clues investors have that Peloton's product overhaul may not be the sales driver the company hoped it would be. The revamped assortment, which came with artificial intelligence-powered tracking cameras, speakers, 360-degree swivel screens and hands-free control, was designed to grow sales and bring in new customers. But Peloton's results show demand has been sluggish. \"I will not be satisfied until this company is back to healthy, sustained top line growth,\" CEO Peter Stern said on a call with analysts. He said the company has seen improvement in the sense that its revenue declines are getting less steep, but he acknowledged that is \"not enough.\"While Peloton's top line might be disappointing to investors, the company is still making gains in improving its profitability. Over the holiday quarter, the company generated $81 million in adjusted earnings before interest, taxes, depreciation and amortization, better than the $73 million analysts had expected, according to StreetAccount. After it announced plans to lay off 11% of its staff last week, the company expects to generate between $120 million and $135 million in adjusted EBITDA in the current quarter, better than the $119 million analysts had expected, according to StreetAccount.It raised its full-year adjusted EBITDA guidance to between $450 million and $500 million, up from a prior range of between $425 million and $475 million. That's welcome news to investors because it shows Peloton was able to innovate its product line without draining profitability. Also on Thursday, the company announced CFO Liz Coddington is leaving Peloton to \"pursue an opportunity outside the industry.\" She's staying on through March as the company searches for its next finance chief.Here's how Peloton did in its fiscal second quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:Loss per share: 9 cents vs. 6 cents expectedRevenue: $657 million vs. $674 million expectedThe company's net loss for the quarter was $38.8 million, or 9 cents per share, a significant improvement from the $92 million, or 24 cents per share, it lost in the year ago period. Sales fell to $656.5 million, down about 3% from $673.9 million a year earlier.Since Peter Stern took over as Peloton's CEO, he's worked to generate new revenue streams and build on the company's progress of improving its profitability. The revamped product assortment was one of his first big moments as CEO and included new prices for both subscriptions and hardware. Despite higher prices, revenue for both hardware and subscription came in lower than expected, indicating unit sales have been weak. Hardware sales drove $244 million in revenue during the quarter while subscriptions saw $413 million in sales, both below expectations of $253 million and $424 million, respectively, according to StreetAccount. Part of the issue was Peloton had expected more of its current members to swap out their old hardware. \"We simply overestimated the rate with which existing members would want to upgrade their existing equipment to new equipment. The only historical data point we had as a company on this was when we launched Bike Plus a few years ago, and that was a really fundamental reinvention of the entire frame of the Bike,\" said Stern. \"And so we did not, as it turns out, see the same rate of upgrade from existing members.\" Looking ahead, investors want to see if Stern can bring the company back to growth now that expenses have stabilized and profitability is improving. In an economy where value is more important than ever, it's been tough to convince shoppers to spend thousands on stationary bikes and treadmills. One glimmer could be the company's growing commercial business unit, which includes commercial versions of its Bike+, Tread+ and Row+ that will be marketed to places that have small gyms, like hotels, apartment buildings, corporate wellness centers and country clubs. During the quarter, revenue in Peloton's commercial business unit was up 10%.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Peloton shares plunge 26% on weak holiday quarter, sluggish demand for splashy new products",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107327243-1698864973814-gettyimages-1757875748-PELOTON_EARNS.jpeg?v=1770291808&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T21:02:40.000Z",
      "dateModified": "2026-02-05T21:02:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bob's Discount Furniture closes flat in NYSE trading debut after pricing at $17 a share",
    "url": "https://www.cnbc.com/2026/02/05/bobs-discount-furniture-bobs-to-start-trading-on-nyse-after-ipo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108262005-1770309980404-BOBS-OB-Photo-20260205-CC-PRESS-14.jpg?v=1770310177&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T21:04:24.000Z",
    "description": "CEO Bill Barton of Bob’s Discount Furniture rings the Opening Bell at the New York Stock Exchange on Feb. 5, 2026. NYSEShares of Bob's Discount Furnit",
    "body": "CEO Bill Barton of Bob’s Discount Furniture rings the Opening Bell at the New York Stock Exchange on Feb. 5, 2026. NYSEShares of Bob's Discount Furniture barely budged on the New York Stock Exchange on Thursday after the company priced its initial public offering at $17 per share.That price was within Bob's expected range of $17 to $19 per share and valued the company at about $2.22 billion. The stock, trading on the NYSE under the ticker symbol BOBS, closed the day at $17.02, roughly flat. The Manchester, Connecticut-based company, which was founded in 1991, has grown to 206 showrooms across 26 states, as of Sept. 28, according to its S-1 filing. It plans to more than double that store count to over 500 locations by 2035, the filing said.In an interview with CNBC, CEO Bill Barton said that even in a slow housing market and during a time when consumers have hesitated to splurge on some big-ticket items, Bob's has seen demand for buying furniture across all incomes. \"People still need furniture, but in challenging times they are often looking for good value and we are the value leader,\" he said.Many of its customers are motivated by life changes, such as setting up a new apartment, buying a home, having a child or downsizing for retirement, he said.Barton said Bob's has seen more significant customer gains among higher-income households in recent years. About 27% of its customers have an annual household income of more than $150,000, and that part of the customer base is growing the fastest. He said that group is up by about 3% as a share of Bob's shoppers in the past two years.About half of its customers have an annual household income of more than $100,000, he said.Bob's is known for selling lower-priced couches, rugs, dining room tables and other furniture. It has an average order value of about $1,400 per transaction, excluding sales at its outlets, according to its S-1 filing. The retailer estimates its prices are on average about 10% lower than its value-focused furniture competitors' lowest promoted prices or about 20% to 25% below their listed prices.To keep prices low, the company said it relies on a \"curated merchandising strategy, longstanding sourcing relationships and efficient supply chain,\" according to the filing. It carries roughly one-third fewer items than value-oriented competitors, but orders in larger quantities, the filing said.It's also tried to stand apart from other furniture retailers with quicker deliveries. Instead of customers waiting for weeks or months, most purchases can be delivered in as few as three days, the company said in the filing. With its new locations, Bob's plans to add to both existing and new markets, Chief Financial Officer Carl Lukach told CNBC. It plans to open stores in regions where it already has high density, such as in the Midwest and the New England area, but also expand to new states this year, including South Carolina and Tennessee. Initial public offerings in the U.S. are expected to gain momentum this year, as waning inflation and interest rate cuts are expected to nudge late-stage private companies off the sidelines, according to a report by consulting firm PwC. They'll build on a decent past year for IPOs, too. Traditional IPOs raised $33.6 billion in 2025, which represented the best year since 2021.This year, IPO activity may be led by artificial intelligence infrastructure, insurance and specialty risk companies, and AI-enabled software platforms, according to PwC. Industrials and manufacturing, including reshoring, aerospace and defense, and energy or grid-related infrastructure have gotten higher interest, too.One of the widely anticipated IPOs this year is of Elon Musk's company SpaceX. News of the potential IPO broke in December and Musk called reports about the planned offering \"accurate.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bob's Discount Furniture closes flat in NYSE trading debut after pricing at $17 a share",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108262005-1770309980404-BOBS-OB-Photo-20260205-CC-PRESS-14.jpg?v=1770310177&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T21:04:24.000Z",
      "dateModified": "2026-02-05T21:04:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kalshi expands surveillance, enforcement efforts ahead of Super Bowl 60",
    "url": "https://www.cnbc.com/2026/02/05/kalshi-expands-surveillance-enforcement-efforts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108141257-1746480026270-gettyimages-2198224769-CRYPTOCOM_KALSHI.jpeg?v=1770309102&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T16:51:40.000Z",
    "description": "Gabby Jones | Bloomberg | Getty ImagesKalshi on Thursday announced efforts to expand its surveillance and enforcement frameworks as skepticism builds ",
    "body": "Gabby Jones | Bloomberg | Getty ImagesKalshi on Thursday announced efforts to expand its surveillance and enforcement frameworks as skepticism builds around the booming prediction market industry. The announcement comes days before Super Bowl 60, which has already drawn more than $160 million in prediction market trading volume, according to Kalshi. The platform and its peers allow users to buy event contracts for outcomes in politics, pop culture, financial markets and sports. Prediction trades on predetermined outcomes — for example, on which companies will air Super Bowl ads on Sunday — have prompted questions of possible insider trading. New York Attorney General Letitia James on Monday issued a warning about what she called \"unregulated prediction markets.\" \"Being federally regulated means that Kalshi bans market manipulation, insider trading, has limits on the types of markets it lists, runs Know-Your-Customer (KYC) and Anti-Money Laundering (AML) checks on every user before they can trade, and publicly reports all trades to the CFTC daily,\" the company said in a release. \"Kalshi also spent years building custom prediction market trade surveillance and enforcement systems that are similar to those used in the stock market.\"Kalshi said Thursday it has taken further steps, forming an independent surveillance advisory committee, which will provide quarterly analysis to the company's outside counsel and publish statistics on investigations into suspicious activity on its platform. The company also announced surveillance partnerships with Solidus Labs and the director of the Wharton Forensic Analytics Lab.The prediction market will also now work with a former undersecretary of the Treasury for terrorism and financial intelligence to advise Kalshi on \"market integrity, trading surveillance and financial compliance matters.\" Kalshi lawyer Robert DeNault has been appointed to the role of head of enforcement, where he will work with the advisory committee to identify insider trading and market manipulation, the company said.Kalshi said it has also created hubs on its website to provide resources for consumers on responsible trading and market integrity.In a post on X, CEO Tarek Mansour said if the company finds any wrongdoing, the penalties include fines and referrals to the Commodity Futures Trading Commission — which regulates event contracts in the U.S. — and the Department of Justice for prosecution. \"In the past year, we ran over 200 investigations and froze relevant accounts,\" Mansour wrote. \"Of these, over a dozen have become active cases and several have been referred to law enforcement.\"Mansour said Kalshi has based its market surveillance system on those used by the New York Stock Exchange and the Nasdaq, flagging suspicious behavior by running trades through pattern recognition models. \"All industries have bad actors and no system is perfect, Kalshi's included,\" Mansour wrote. \"But we are committed to improving daily. Lots of work ahead!\"Disclosure: CNBC and Kalshi have a commercial relationship that includes customer acquisition and a minority investment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kalshi expands surveillance, enforcement efforts ahead of Super Bowl 60",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108141257-1746480026270-gettyimages-2198224769-CRYPTOCOM_KALSHI.jpeg?v=1770309102&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T16:51:40.000Z",
      "dateModified": "2026-02-05T16:51:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "White House launches direct-to-consumer drug site TrumpRx. Here's what to know",
    "url": "https://www.cnbc.com/2026/02/05/trump-rx-white-house-launches-direct-to-consumer-drug-site.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222503-17624494782025-11-06t171514z_896296407_rc24rharutfb_rtrmadp_0_usa-trump.jpeg?v=1770327931&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T00:59:57.000Z",
    "description": "President Donald Trump makes an announcement from the Oval Office at the White House in Washington, Nov. 6, 2025.Jonathan Ernst | ReutersPresident Don",
    "body": "President Donald Trump makes an announcement from the Oval Office at the White House in Washington, Nov. 6, 2025.Jonathan Ernst | ReutersPresident Donald Trump on Thursday announced the launch of TrumpRx — a direct-to-consumer website that is key to his administration's efforts to lower prescription drug costs in the U.S. The president said millions of Americans would save money through the platform. But it's still unclear if all patients — particularly those with insurance coverage — will see more cost savings from using that site to buy their medicines than they would through existing methods. TrumpRx targets people who are willing to pay with cash and forgo insurance, which suggests that patients without or with limited coverage may benefit the most. \"You're going to save a fortune and this is also so good for overall health care,\" Trump said at an event Thursday night unveiling the website.The site does not sell drugs directly to American patients, but acts as a central hub that points them to drugmakers that are offering discounts on certain products on their own direct-to-consumer sites, or gives them discount coupons to take to pharmacies. For example, Eli Lilly and Novo Nordisk were already offering their blockbuster obesity drugs at hefty discounts to cash-paying patients, even before the reductions Trump touted on Thursday.Clicking on the platform's offer for Lilly's popular Zepbound weight loss injection sends consumers to the company's LillyDirect platform, where they can order the treatment and submit prescription details.A screenshot of a Zepbound order on the TrumpRx website.\nPreview\nFilters\nSource InfoIn recent months, Lilly, Novo and at least 14 other drugmakers have negotiated agreements with the Trump administration to participate on the platform and voluntarily sell certain medicines at a discount to Medicaid patients. Those landmark deals are part of Trump's broader \"most favored nation\" policy, which pushes to link U.S. drug prices to the lowest ones abroad.At launch, the site features only medications from the first five companies to strike pricing deals with the administration: AstraZeneca, Lilly, EMD Serono, Novo Nordisk and Pfizer, according to a White House fact sheet. It will list drugs from other companies \"in the coming months,\" the administration said.The platform is the government's latest effort to try to rein in U.S. prescription drug prices, which are two to three times higher on average than those in other developed nations — and up to 10 times more than in certain countries, according to the Rand Corp., a public policy think tank.But TrumpRx \"doesn't seem like it is the only solution\" to that issue for most Americans, said Juliette Cubanski, deputy director of the program on Medicare Policy at KFF, a health policy research organization. The cash-pay offerings could be better deals for patients without insurance, but it's difficult to assess exactly how many people stand to benefit from TrumpRx, she added. \"If they're able to get a drug covered by their insurance at a relatively affordable copay, then there's not a great upside to using the TrumpRx website,\" Cubanski said. She said people with insurance coverage who buy through direct-to-consumer platforms may also not have their purchases count toward their benefits, which means it doesn't help them meet their deductible or out-of-pocket maximum. But Cubanski said there's potential for TrumpRx to be helpful in expanding access to certain drugs at more affordable prices, particularly medicines not covered widely by insurance in the U.S., such as obesity drugs. Medicare will start covering weight loss treatments for the first time later this year as part of the deals Lilly and Novo struck with Trump, but many employers are still hesitant to cover those drugs. Still, many of the other products expected to be listed on TrumpRx are already widely covered through insurance, and some are available as cheaper generics from competing drugmakers. Questions about savingsQuestions remain about how much savings people can expect if they buy their medicines at direct-to-consumer prices. The announced price reductions for certain drugs are framed as steep cuts from their so-called retail list prices. For example, under Novo Nordisk's agreement with the administration, some doses of its diabetes drug Ozempic will be priced at $350 per month on TrumpRx, which is less than half of its roughly $1,000 monthly list price. But those list prices are often far higher than what private insurers and government programs ultimately pay for medicines after rebates, discounts and other concessions, according to researchers at Georgetown's Medicare Policy Initiative. That suggests some payers may already be securing prices comparable to — or lower than — the newly announced discounts on medications under the Trump deals. The Georgetown researchers cited one study that found that average discounts on brand-name drugs in Medicare Part D run around 40% of list prices. Meanwhile, discounts in Medicaid exceed 75%, according to a Congressional Budget Office study. In the private sector, \"we've got insurers and pharmacy benefit managers negotiating lower prices and designing an insurance benefit that enables people to benefit from those price negotiations,\" said KFF's Cubanski. \"My guess is that for most drugs, at least most brand-name medications, people are likely to get a better deal using their insurance rather than purchasing a drug through a direct-to-consumer website,\" she said. Drugs on TrumpRxAt the launch of the site, the administration listed a range of major drugs as available for discounts, with a particular emphasis on popular GLP-1 products:Ozempic injection for diabetes, made by Novo Nordisk: Starting at $199 per month, down from around $1,000Wegovy injection for obesity, made by Novo Nordisk: Starting at $199 per month, down from around $1,350Wegovy pill for obesity, made by Novo Nordisk: $149 per month for the starting dosesZepbound injection for obesity, made by Eli Lilly: starting at $299 per month, down from $1,086The White House also put an emphasis on cash-pay discounts for fertility drugs like Gonal-F from EMD Serono, which was listed at $168. Dozens of other drugs that companies expected to be be listed on the platform were not as of Thursday night. Those include key treatments from companies including Amgen, Merck and Gilead, among others.In an interview with CNBC at a conference in January, Bristol Myers Squibb CEO Chris Boerner said the company has multiple products on its existing direct-to-consumer platform, which first offered a cash-pay discount on its blood thinner Eliquis. That platform will eventually link to TrumpRx, he said. The company is going to examine ways to put additional products in its portfolio on its own platform, \"where it makes sense,\" Boerner added. He said Bristol Myers is \"aligned with the administration\" on the issue of the U.S. health care system being too complex, and said several middlemen can increase costs. \"What we like about these [direct-to-consumer models], where they make sense from a business standpoint, is you're able to circumvent some of that,\" Boerner said. Meanwhile, in an exclusive interview with CNBC last week, Eli Lilly CEO Dave Ricks said the company was the first drugmaker to sell obesity treatments directly to patients, and that TrumpRx is \"taking that and expanding it across the industry\" to other medicines.\"We're all for that,\" Ricks said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White House launches direct-to-consumer drug site TrumpRx. Here's what to know",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222503-17624494782025-11-06t171514z_896296407_rc24rharutfb_rtrmadp_0_usa-trump.jpeg?v=1770327931&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T00:59:57.000Z",
      "dateModified": "2026-02-06T00:59:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Novo Nordisk says it will take legal action after Hims & Hers reveals $49 copy of Wegovy pill",
    "url": "https://www.cnbc.com/2026/02/05/eli-lilly-novo-nordisk-stock-wegovy-hims-hers-pill.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261298-17702146372026-02-04t141023z_346821360_rc20fjakic3w_rtrmadp_0_novo-nordisk-results.jpeg?v=1770311641&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T19:35:54.000Z",
    "description": "The logo of pharmaceutical company Novo Nordisk is displayed in front of its offices in Bagsvaerd, Copenhagen, Denmark, Feb. 4, 2026.Tom Little | Reut",
    "body": "The logo of pharmaceutical company Novo Nordisk is displayed in front of its offices in Bagsvaerd, Copenhagen, Denmark, Feb. 4, 2026.Tom Little | ReutersNovo Nordisk said Thursday it will take legal action against Hims & Hers after the telehealth provider announced it would launch a cheaper copycat version of Novo's Wegovy weight loss pill.\"The action by Hims & Hers is illegal mass compounding that poses a significant risk to patient safety,\" Novo said in a statement. \"Novo Nordisk will take legal and regulatory action to protect patients, our intellectual property and the integrity of the US gold-standard drug approval framework. \"This is another example of Hims & Hers' historic behaviour of duping the American public with knock-off GLP-1 products, and the FDA has previously warned them about their deceptive advertising of GLP-1 knock-offs,\" the statement said. Shares of Novo Nordisk as well as rival Eli Lilly each fell roughly 7% after Hims announced the cheaper Wegovy copy for $49, far less than the $149 Novo sells the branded pill for. Hims stock initially spiked on the announcement, but pared gains after Novo said it would fight the rollout. Novo launched its Wegovy pill in the U.S. in early January, and CEO Mike Doustdar told CNBC on Wednesday that 170,000 people were already taking the medication. Hims & Hers had previously been offering compounded semaglutide, the active ingredient in Novo's blockbuster drugs Ozempic and Wegovy, in an injectable format, and is now extending the offering to include the oral version. Hims said the Wegovy pill copy would cost $49 for the first month and $99 thereafter with a 5-month plan.Semaglutide's patent is protected in the U.S. until 2032, but Hims says its copies are \"personalized,\" and therefore legal.\"This compounded product uses a different formulation and delivery system than FDA-approved oral semaglutide,\" Hims said.\"This once-a-day pill has the same active ingredient as Wegovy and empowers providers to tailor treatment plans specifically for those who prefer to avoid needles or need smaller doses to help to balance side-effects,\" it said. Novo highlighted that it manufactures its Wegovy pill using so-called SNAC technology, which facilitates absorption when administered orally. It's not clear exactly how Hims' copy formula could match the level of absorption.As recently as last year, Novo and Hims partnered to offer discounted weight loss jabs to the telehealth company's customers. Novo, however, ended the collaboration just two months later and said Hims used \"deceptive\" marketing that put patient safety at risk.Lilly doesn't yet have an oral GLP-1 option on the market but is expected to launch a rival pill, orforglipron, in the first half of this year, pending Food and Drug Administration approval.\"With the ... current legal backdrop, there is no reason why HIMS shouldn't evaluate these launches for every subsequent weight loss product as the market continues to evolve,\" Leerink analyst Michael Cherny said in a note to clients. Eli Lilly didn't immediately respond to a request for comment.Mounting challengesThursday's news from Hims adds to the pressure Novo has been facing over the past year. In 2025, the stock fell nearly 50% in its worst year ever as investors lost confidence in the Danish drugmaker's ability to keep sales growing amid ever-increasing competition. Shares are down another 15% year to date.Stock Chart IconStock chart iconNovo Nordisk shares have trailed Eli Lilly stock over the past year. Hims' announcement comes days after Novo forecast sales and profits declining between 5% and 13% in 2026, mainly due to pricing pressures in the U.S. and loss of exclusivity for semaglutide in certain markets outside of the U.S., like Canada and China, this year.In contrast, Lilly sees sales growing by about 25% this year.Doustdar explained Novo's worse-than-expected outlook as an indication that things will get worse before they get better. \"We are creating affordability for the patients, millions of patients that are right now in need of GLP-1 products but simply could not afford it. To do that short term, you have to take a headwind. But of course, there's a very long tail wind for years to come,\" he told CNBC. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Novo Nordisk says it will take legal action after Hims & Hers reveals $49 copy of Wegovy pill",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261298-17702146372026-02-04t141023z_346821360_rc20fjakic3w_rtrmadp_0_novo-nordisk-results.jpeg?v=1770311641&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T19:35:54.000Z",
      "dateModified": "2026-02-05T19:35:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI launches new enterprise platform in bid to win more business customers",
    "url": "https://www.cnbc.com/2026/02/05/open-ai-frontier-enterprise-customers.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108254535-1768938570729-gettyimages-2236933448-250925_FBER_PHT001.jpeg?v=1770296609&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T16:29:07.000Z",
    "description": "Sam Altman, CEO of OpenAI, is pictured on Sept. 25, 2025, in Berlin.Florian Gaertner | Photothek | Getty ImagesOpenAI on Thursday announced a new ente",
    "body": "Sam Altman, CEO of OpenAI, is pictured on Sept. 25, 2025, in Berlin.Florian Gaertner | Photothek | Getty ImagesOpenAI on Thursday announced a new enterprise platform called Frontier, its latest launch as part of its ongoing effort to win more business customers.Frontier acts as an intelligence layer that stitches together disparate systems and data within an organization. OpenAI said the platform will make it easier for companies to manage, deploy and build artificial intelligence agents, which are tools that can independently complete tasks on behalf of a user.\"Frontier is really a recognition that we're not going to build everything ourselves,\" Fidji Simo, OpenAI's CEO of Applications, told reporters during a briefing. \"We are going to be working with the ecosystem to build alongside them, and we embrace the fact that enterprises are going to need a lot of different partners.\"OpenAI has been making an aggressive push into enterprises in recent years, and announced in November that more than 1 million business customers around the world are using the company's technology.Last month, OpenAI CFO Sarah Friar told CNBC that enterprise customers account for roughly 40% of OpenAI's business, though she expects that figure to reach closer to 50% by the end of the year.OpenAI's new Frontier platform is \"complementary\" to its existing business offerings, including ChatGPT Enterprise, the company said.\"What's really missing still, for most companies, is just a simple way to unleash the power of agents as teammates that can operate inside the business without the need to rework everything underneath,\" Denise Dresser, OpenAI's chief revenue officer, said during the briefing. \"That's exactly why we've built Frontier.\"Read more CNBC tech newsAlphabet resets the bar for AI infrastructure spendingSoftware experiencing 'most exciting moment' as AI fears hammer the stocksSnap shares rise on fourth-quarter earnings that beat on salesQualcomm stock sinks as memory shortage drags on forecastOpenAI declined to share the pricing details for the platform.Frontier is compatible with agents that OpenAI has built, agents that enterprises build themselves, as well as agents from third parties like Google, Microsoft and Anthropic. Simo said it's simply not possible for OpenAI to \"build every single AI agent that companies need.\"The platform provides agents access to a \"shared business context\" within an organization by connecting siloed internal applications, ticketing tools and data warehouses, OpenAI said. With this context, AI agents will be able to handle complex tasks and reason over data within an open agent execution environment, according to a blog post. This means employees at a company could have agents use tools on a computer, run code and work with files, for instance. Frontier also includes built-in tools for evaluating and optimizing agents' performance, which should help them improve over time, OpenAI said. \"What we're fundamentally doing is basically transitioning agents into true AI co-workers,\" Barret Zoph, OpenAI's general manager of business-to-business, told reporters. Zoph rejoined OpenAI in January after abruptly departing Thinking Machines Lab, an AI startup he co-founded alongside OpenAI's former CTO, Mira Murati.OpenAI said Frontier is initially launching to a small set of customers. Initial users include organizations like Uber, State Farm, Intuit and Thermo Fisher Scientific. The company said broader availability is coming over the next several months. WATCH: Watch CNBC’s full interview with OpenAI CFO Sarah Friar",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI launches new enterprise platform in bid to win more business customers",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108254535-1768938570729-gettyimages-2236933448-250925_FBER_PHT001.jpeg?v=1770296609&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T16:29:07.000Z",
      "dateModified": "2026-02-05T16:29:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How exposed are software stocks to AI tools? We put vibe-coding to the test",
    "url": "https://www.cnbc.com/2026/02/05/how-exposed-are-software-stocks-to-ai-tools-we-tested-vibe-coding.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108184664-1754999709333-gettyimages-2214520187-img_1248.jpeg?v=1754999753&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T20:59:50.000Z",
    "description": "watch nowSoftware, legal services and video games stocks have been selling off in recent weeks on fears that new AI features and tools could wipe them",
    "body": "watch nowSoftware, legal services and video games stocks have been selling off in recent weeks on fears that new AI features and tools could wipe them out. But how real is that threat? We decided to find out.CNBC's Deidre Bosa and I used Anthropic's AI coding tool \"Claude Code\" with the goal of creating a replacement for Monday.com, a project management platform with a $5 billion market cap. We didn't expect to get anywhere — we're not developers and we don't have any coding experience. But we have become adept at vibe-coding tools, which are AI tools that can build functioning apps based on commands in plain English from users, including those with limited technical chops. We started out simple, telling Claude to build a project management dashboard similar to Monday, with features like multiple project boards, assigned team members and a status dropdown. It spit out a working prototype in minutes. We then asked Claude to research Monday on its own, identify main features and recreate them. It added a number of other features, including a calendar.The real magic happened when we connected the clone to an email account, essentially spinning up a customized project manager for our personal lives. The AI found Dee's forgotten calendar invite for a kid's birthday party (which she definitely didn't have a gift for yet) and it added reminders to book tickets for an upcoming trip and sign a waiver for another kid's birthday party. It took us under an hour, and had we been paying users, it would have cost something like $5 to $15 in compute credits, depending on how much we went back and forth with the AI agent. As more data centers get built out, that cost could start to come down. So which companies should investors worry about? Silicon Valley insiders we talk to say the most exposed names are the ones that \"sit on top of the work\" — tools like Atlassian, Adobe, HubSpot, Zendesk, and Smartsheet, that aren't core to businesses. They say cybersecurity stocks like CrowdStrike and Palo Alto are harder to disrupt since they have network effects that no one would want to try to replicate and maintain. Systems of record may be safer, but not immune. Salesforce, for instance, anchors a business with enterprise data, making it harder to clone with a weekend coding project. With the wholesale sell-off in software this year, that may be a chance for investors to separate between the need-to-haves and nice-to-haves. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How exposed are software stocks to AI tools? We put vibe-coding to the test",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108184664-1754999709333-gettyimages-2214520187-img_1248.jpeg?v=1754999753&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T20:59:50.000Z",
      "dateModified": "2026-02-05T20:59:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Layoffs in January were the highest to start a year since 2009, Challenger says",
    "url": "https://www.cnbc.com/2026/02/05/layoff-and-hiring-announcements-hit-their-worst-january-levels-since-2009-challenger-says.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257746-1769538385929-gettyimages-2257950756-AMAZON_STORES.jpeg?v=1769538452&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T15:57:40.000Z",
    "description": "An Amazon Go store in New York, US, on Tuesday, Jan. 27, 2026. Michael Nagle | Bloomberg | Getty ImagesLayoff plans hit their highest January total si",
    "body": "An Amazon Go store in New York, US, on Tuesday, Jan. 27, 2026. Michael Nagle | Bloomberg | Getty ImagesLayoff plans hit their highest January total since the global financial crisis while hiring intentions reached their lowest since the same period, outplacement firm Challenger, Gray & Christmas reported Thursday.U.S. employers announced 108,435 layoffs for the month, up 118% from the same period a year ago and 205% from December 2025. The total marked the highest for any January since 2009, while the economy was in the final months of its steepest downturn since the Great Depression.At the same time, companies announced just 5,306 new hires, also the lowest January since 2009, which is when Challenger began tracking such data. The crisis recession officially ended in March 2009.With the recent narrative centering on a no-hire, no-fire labor market, the Challenger data suggests that the layoff part of the equation could be stepping up.\"Generally, we see a high number of job cuts in the first quarter, but this is a high total for January,\" said Andy Challenger, workplace expert and chief revenue officer for the firm. \"It means most of these plans were set at the end of 2025, signaling employers are less-than-optimistic about the outlook for 2026.\"To be sure, if employers are stepping up plans to furlough workers, it hasn't been showing up much in official government data. watch nowHowever, initial jobless claims for the week ended Jan. 31 totaled a seasonally adjusted 231,000, the highest since early December though the spike likely had something to do with a brutal winter storm that hit large parts of the country. The longer-term trend still was at its lowest since October 2024.Some high-profile layoff announcements have boosted fears of wider damage in the labor market. Amazon, UPS and Dow Inc. recently have announced sizeable job cuts. Indeed, transportation had the highest level from a sector standpoint in January, due largely to plans from UPS to cut more than 30,000 workers. Technology was second on the back of Amazon's announcement to shed 16,000 mostly corporate level jobs.Planned hiring dropped 13% from January 2025 and was off 49% from December.Challenger data also can be volatile and not correlated to official statistics. However, filings with the Labor Department in January under Worker Adjustment and Retraining Notification regulations indicate more than 100 companies have given notice of significant layoffs.In a separate report Thursday, the Bureau of Labor Statistics reported that job openings fell sharply in December to 6.54 million, a slide of 386,000 on a monthly basis and down more than 900,000 from the October level. Openings are now at their lowest since September 2020.The decrease in available positions put the ratio of available jobs to unemployed workers at 0.87 to 1, down from more than 2 to 1 at its peak in mid-2022.  On Wednesday, ADP reported that private employers added just 22,000 jobs in January.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Layoffs in January were the highest to start a year since 2009, Challenger says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257746-1769538385929-gettyimages-2257950756-AMAZON_STORES.jpeg?v=1769538452&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T15:57:40.000Z",
      "dateModified": "2026-02-05T15:57:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cheaper tequila and canned cocktails were the only bright spots for booze during a rough 2025",
    "url": "https://www.cnbc.com/2026/02/05/tequila-canned-cocktails-top-selling-liquors-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261842-1770295724004-gettyimages-1922423647-dsc_2390_4nhe8rnt.jpeg?v=1770315573&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T19:32:27.000Z",
    "description": "Various cans of alcoholic ready-to-drink beverages, including Captain Morgan's rum and cola; Bacardi's mango mojito; Archers' schnapps and lemonade; M",
    "body": "Various cans of alcoholic ready-to-drink beverages, including Captain Morgan's rum and cola; Bacardi's mango mojito; Archers' schnapps and lemonade; Malibu's pineapple and piña colada cocktails; and Gordon's gin and tonic cocktails, are displayed for sale in a supermarket on Jan. 10, 2024.John Keeble | Getty ImagesThe U.S. alcohol industry had another sobering year in 2025.Spirits supplier revenue fell 2.2% to $36.4 billion for the year, according to new data by industry trade group the Distilled Spirits Council of the United States, or Discus. The decline came as economic pressure and weaker consumer confidence weighed on discretionary spending.\"While total U.S. spirits sales edged down 2.2% in 2025, the spirits industry remains resilient,\" said Chris Swonger, Discus CEO and president, in a statement.Overall volumes for the year rose 1.9% to 318.1 million 9-liter cases, indicating growing demand. But the revenue decline suggests that while Americans are still drinking, they are also trading down — opting for lower-priced spirits and pulling back on premium purchases.Nearly every major spirits category posted revenue declines. Vodka sales fell 3% to $7 billion. Sales of tequila and mezcal — the industry's fastest-growing segment for several years now — slipped 4.1% to $6.4 billion. American whiskey and cordials revenue dipped 0.9% and 3.2%, respectively.The exception was in convenience and value.Last call for optimismSales of premixed cocktails, including spirits-based ready-to-drink beverages, surged over 16% compared to the year prior, reaching $3.8 billion. The category, known as RTD, has more than doubled its market share since 2021 as consumers gravitate toward a lower price point.Within tequila, the shift has also been toward more affordable bottles, as macro headwinds make consumers rethink splurges on premium brands. Volume in the lowest tequila/mezcal price point the trade group tracks grew 6.5% in 2025, along with a 2.8% climb in the next tier higher. Volume for whiskey, vodka, rum and gin all fell at those price points.As consumers move toward more-affordable spirits, companies like Diageo and Brown-Forman may be best positioned, as they have the most exposure to lower-priced tequila and the fast-growing RTD category. Diageo owns Casamigos tequila and has built out a sizable portfolio of spirit-based RTDs, while Brown-Forman controls key mixed-price tequila brands like El Jimador. On the other hand, beer-heavy players like AB InBev and Molson Coors have minimal tequila exposure, although they have been expanding their RTD portfolios. Modelo and Corona owner Constellation Brands is in a unique position with both beer and tequila exposure, but a smaller RTD footprint. Overall, the beverage alcohol market has softened after years of pandemic-fueled growth, and Discus' new data reinforces that normalization is now turning into contraction.\"The companies that have started to report are posting weak numbers but no worse than expected,\" said Trevor Stirling, Bernstein European and American beverages analyst. \"The rate of decline is not getting worse, might be slowing and one can dream of a return to volume growth.\"Lingering trade tensionsDistillers have also been navigating headwinds abroad. American spirits exports fell 9% year over year in the second quarter of 2025, amid lingering trade tensions and the removal of U.S. products from many Canadian retail shelves following President Donald Trump's tariff hikes on the U.S. neighbor last year.Industry leaders say tariff uncertainty is making it difficult to plan long term. \"The unpredictability surrounding global trade issues continues to weigh heavily on the U.S. spirits sector,\"  Swonger said. \"Reinstating zero-for-zero tariffs on distilled spirits must be a priority to get our American distillers back on a path to growth and prosperity.\"Despite the revenue pullback, spirits actually maintained its market share lead of the total beverage alcohol market at 42.4%, compared to beer and wine at 41.8% and 15.7%, respectively. Still, the message from 2025 is clear: Consumers are drinking less, but those who are still drinking are being more selective. In a tougher economic environment, cheaper tequila and canned cocktails are winning out over premium bottles behind the bar. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cheaper tequila and canned cocktails were the only bright spots for booze during a rough 2025",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261842-1770295724004-gettyimages-1922423647-dsc_2390_4nhe8rnt.jpeg?v=1770315573&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T19:32:27.000Z",
      "dateModified": "2026-02-05T19:32:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Roblox shares rocket on earnings beat, strong forecast",
    "url": "https://www.cnbc.com/2026/02/05/roblox-shares-rocket-20percent-on-earnings-beat-strong-forecast.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261074-1770161243142-gettyimages-2259268949-ROBLOX_EARNS.jpeg?v=1770331638&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T23:20:03.000Z",
    "description": "Roblox Corp. headquarters in San Mateo, California, Feb. 3, 2026.David Paul Morris | Bloomberg | Getty ImagesRoblox shares surged as much as 20% in ex",
    "body": "Roblox Corp. headquarters in San Mateo, California, Feb. 3, 2026.David Paul Morris | Bloomberg | Getty ImagesRoblox shares surged as much as 20% in extended trading Thursday after the company reported results for the fourth fiscal quarter that beat consensus estimates.Here's how the gaming company did, compared with estimates from analysts polled by LSEG:Losses per share: 45 cents vs. 48 cents expected by analystsBookings: $2.22 billion vs. $2.05 billion expected by analystsThe company said it expects first-quarter bookings to come in between $1.69 billion and $1.74 billion, which is higher than Wall Street expectations of $1.68 billion.Roblox's fourth-quarter bookings increased 63% from a year ago, while the company reported $316 million in net loss for the quarter, a nearly 44% increase from $220 million the year prior.The company reported 144 million average daily active users, or DAUs, for the fourth quarter, up 69% year over year. Analysts expected 138 million DAUs.Roblox announced in its letter to shareholders that it no longer plans to issue annual guidance starting in 2027 due to \"inherent variability\" in the company's business. Instead, Roblox said it will focus on providing quarterly guidance. Roblox has faced criticism for putting underage users at risk, with multiple lawsuits on behalf of children who were sexually exploited on the gaming platform.The company said that late in the fourth quarter it began a mandatory age check for users looking to access communication features in Australia, New Zealand and the Netherlands. Roblox said 60% of its daily users in those markets had age checked while 45% of global daily users had done so.Roblox said the age-check rollout, which was completed globally in January, has caused \"a mid-single-digit headwind to engagement growth and a low-single-digit headwind to bookings growth.\" But the company added that \"the strategic upside is significant.\"\"Accurate age data unlocks a long-term opportunity to tailor features and content, increasing safety and civility, which in turn drives organic engagement growth,\" the company wrote.Roblox said it has found that the age checking has revealed its user base is younger than indicated by self-reported data. Among daily users, 38% are between the ages of 13 and 17, 35% are under the age of 13 and 27% are over 18. The company said it views its scale with young users as a \"valuable strategic asset.\"WATCH: Gaming stocks plunge on news of Google AI gaming toolwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Roblox shares rocket on earnings beat, strong forecast",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261074-1770161243142-gettyimages-2259268949-ROBLOX_EARNS.jpeg?v=1770331638&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T23:20:03.000Z",
      "dateModified": "2026-02-05T23:20:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reddit shares rise on reveals strong guidance, $1 billion buyback",
    "url": "https://www.cnbc.com/2026/02/05/reddit-rddt-q4-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108215754-1761194640336-gettyimages-2221794806-avdtnmyjune25lot12o.jpeg?v=1770314614&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T23:55:02.000Z",
    "description": "Sopa Images | Lightrocket | Getty ImagesReddit shares rose 5% in after-hours trading Thursday after the company reported fourth-quarter earnings that ",
    "body": "Sopa Images | Lightrocket | Getty ImagesReddit shares rose 5% in after-hours trading Thursday after the company reported fourth-quarter earnings that beat on the top and bottom lines and gave strong guidance for the start of 2026.Here's how the company did compared with LSEG estimates:Earnings per share: $1.24 vs. 94 cents expectedRevenue: $726 million vs. $665 million expectedThe company said it expects first-quarter sales to come in the range of $595 million to $605 million, which is higher than Wall Street expectations of $577 million. Adjusted earnings in the first quarter are projected to come in between $210 million and $220 million, ahead of StreetAccount's estimates of $203 million.Reddit also announced a $1 billion share repurchase program.The company's fourth-quarter revenue rose 70% year over year, while net income was $252 million, up nearly 255% from the same period a year ago.Reddit's sales in the U.S. market came in at $583 million in the fourth quarter, topping analyst estimates of $529 million.The company's global daily active uniques, or DAUq, grew 19% year over year to 121.4 million in the fourth quarter, ahead of the 120 million that Wall Street was expecting.Fourth-quarter U.S. DAUq grew 9% year over year to 52.5 million, slightly ahead of the 52.3 million that analysts were projecting.The company said that logged-in DAUq for the U.S., which refers to users who have registered for Reddit accounts, rose 5% year over year to 23 million. That was slower than the 7% year over year growth Reddit said it recorded during the third quarter when its logged-in DAUq for the U.S. came in at 23.1 million. This is the sixth straight quarter in which Reddit's U.S. logged-in user growth has slowed.Investors have been monitoring Reddit's logged-in DAUq metric because users who have created accounts are more lucrative to the company's online advertising business. These Reddit account holders generally use the platform and engage with other users more frequently than those who may have stumbled into Reddit via Google search, which the company refers to as logged-out DAUq.In an investor letter, Reddit CEO Steve Huffman said the company plans to \"phase out reporting on logged-in and logged-out later this year\" because there's now less of a distinction between the two metrics than in the past. That's because the company has been working on features intended to keep both logged-in users and logged-out users glued to the platform, Huffman said.\"As the industry evolves, how we think about our product and users must evolve too,\" Huffman wrote. \"We've historically reported logged-in vs. logged-out users, but as some of our work to streamline onboarding — instant personalization, for example — blurs the line between these states, the distinction between them makes less sense.\"Reddit finance chief Drew Vollero told analysts during an earnings call that the company will continue to report both metrics for the first two quarters of 2026.Regarding the company's data-licensing deals with Google and OpenAI, Huffman said during the earnings call that \"relationships with both companies are very healthy\" and that \"the conversation is shifting from a purely business deal to more of a product partnership.\"\"Specifically, what we're looking for in any relationship like this is can we bring users into the community parts of Reddit,\"  Huffman said. Regarding Reddit's efforts to unify its traditional search tool with its more recent generative AI search feature, Huffman said that the company has learned that \"the GenAI search results will just be better for most queries.\"Unlike traditional search, cutting-edge GenAI search and chat tools excel at providing results that contain \"multiple perspectives from lots of people,\" he said.WATCH: Snap CEO Evan Spiegel discusses social media and well-being.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reddit shares rise on reveals strong guidance, $1 billion buyback",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108215754-1761194640336-gettyimages-2221794806-avdtnmyjune25lot12o.jpeg?v=1770314614&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T23:55:02.000Z",
      "dateModified": "2026-02-05T23:55:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthropic launches Claude Opus 4.6 as AI moves toward a 'vibe working' era",
    "url": "https://www.cnbc.com/2026/02/05/anthropic-claude-opus-4-6-vibe-working.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108254389-17689275282026-01-20t124808z_1149863023_rc205jas0xak_rtrmadp_0_davos-meeting.jpeg?v=1770313306&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T17:53:50.000Z",
    "description": "Dario Amodei, CEO and co-founder of Anthropic, speaks during the 56th annual World Economic Forum meeting in Davos, Switzerland, Jan. 20, 2026.Denis B",
    "body": "Dario Amodei, CEO and co-founder of Anthropic, speaks during the 56th annual World Economic Forum meeting in Davos, Switzerland, Jan. 20, 2026.Denis Balibouse | ReutersAnthropic on Thursday announced the launch of Claude Opus 4.6, its latest artificial intelligence model that's better at coding, sustaining tasks for longer and creating higher-quality professional work products and outputs, the company said. Claude Opus 4.6 marks Anthropic's first major model launch of the year, but it comes just months after the company released three others — Claude Opus 4.5, Claude Sonnet 4.5 and Claude Haiku 4.5 — late last year. Anthropic's models are particularly popular with enterprise customers, which make up roughly 80% of Anthropic's business, CEO Dario Amodei told CNBC last month. The company's AI coding tool, Claude Code, as well as advancements within its productivity tool, Claude Cowork, have also started to spook software investors, many of whom are growing worried about the potential for disruption within the sector. The WisdomTree Cloud Computing Fund is down more than 20% year to date. \"Everybody has seen this transformation happen with software engineering in the last year and a half, where vibe coding started to exist as a concept, and people could now do things with their ideas,\" Scott White, Anthropic's head of product for enterprise, told CNBC in an interview. \"I think that we are now transitioning almost into vibe working.\"Read more CNBC tech newsAlphabet resets the bar for AI infrastructure spendingSoftware experiencing 'most exciting moment' as AI fears hammer the stocksSnap shares rise on fourth-quarter earnings that beat on salesQualcomm stock sinks as memory shortage drags on forecastAnthropic was founded by a group of former OpenAI researchers and executives in 2021, and it's best known for developing a family of AI models called Claude. The company assigns new numbers to the models as they advance across generations, but the largest model in the family is typically called Opus, the midsize model is called Sonnet and the smallest model is Haiku.Anthropic said Claude Opus 4.6 builds on its predecessor's coding skills and is better at planning, code review and debugging and operating reliably within large codebases. The model is also better at pulling relevant information from large sets of documents, doing research and running financial analyses, the company said. Claude Opus 4.6 now holds the top spot on the Finance Agent benchmark, for instance, which evaluates how well agents perform on core financial analyst tasks.Anthropic said the model is available through its chatbot interface at claude.ai, its application programming interface and across all major cloud platforms. \"If I think about the last year, Claude went from a model that you can sort of talk to to accomplish a very small task or get an answer, to something that you can actually hand real significant work to,\" White said. \"Opus 4.6 is a model that makes that shift really concrete for our users.\"WATCH: The software sector lost about 30% of its value in three months. Here’s what’s behind the sell-offwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthropic launches Claude Opus 4.6 as AI moves toward a 'vibe working' era",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108254389-17689275282026-01-20t124808z_1149863023_rc205jas0xak_rtrmadp_0_davos-meeting.jpeg?v=1770313306&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T17:53:50.000Z",
      "dateModified": "2026-02-05T17:53:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bitcoin drops 15%, briefly breaking below $61,000 as sell-off intensifies, doubts about crypto grow",
    "url": "https://www.cnbc.com/2026/02/05/bitcoin-price-today-70000-in-focus.html",
    "image": "https://image.cnbcfm.com/api/v1/image/105496652-1740495612547-105496652-1539107947284gettyimages-917296340-1.jpg?v=1770315543&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T00:39:45.000Z",
    "description": "Cheng Xin | Getty ImagesBitcoin briefly sank below $61,000 on Thursday evening as investor confidence continued to falter in the asset once hailed as ",
    "body": "Cheng Xin | Getty ImagesBitcoin briefly sank below $61,000 on Thursday evening as investor confidence continued to falter in the asset once hailed as \"digital gold\" and a unique store of value. At one point, the token slid to $60,062.00, as the crypto sell-off intensified in overnight trading. Bitcoin was last down about 15% at 7:37 p.m. ET, trading at $62,448.00.Digital assets, including bitcoin, have fallen deeper into the red as investors re-assess the practical utility of a token that has been championed not only as a hedge against inflation and macroeconomic uncertainties but also as an alternative to fiat currencies and traditional safe-havens such as gold.That hasn't panned out lately, since bitcoin peaked just north of $126,000 in early October.The cryptocurrency broke below the key level of $70,000 earlier in the session Thursday and then the selling increased, bringing the asset closer in line with its pre-election level. The cryptocurrency is down almost 30% this week alone.Stock Chart IconStock chart iconBitcoin, 1 day\"This steady selling in our view signals that traditional investors are losing interest, and overall pessimism about crypto is growing,\" Deutsche Bank analyst Marion Laboure  said Wednesday in a note to clients.Growing investor caution comes as many of the sensationalized claims about bitcoin have failed to materialize. The token has largely traded in the same direction as other risk-on assets, such as stocks,  particularly during recent geopolitical and macroeconomic flare ups in Venezuela, the Middle East and Europe, and its adoption as a form of payment for goods and services has been minimal.Bitcoin underperforming gold Bitcoin is down nearly 40% over the past year, while gold futures have gained 61% in the same period. Other cryptocurrencies are cratering, too. Ether has pulled back 33% this week. Solana hit $88.42 on Thursday, about a two-year low. That cryptocurrency is off nearly 40% on the week.Some traders have suggested $70,000 is a key level to watch for bitcoin, and a break below that could trigger further declines. James Butterfill, head of research at Coinshares, said $70,000 is shaping up as a \"key psychological level,\" adding that \"if we fail to hold it, a move toward\" the $60,000 to $65,000 range \"becomes quite likely.\"Stock Chart IconStock chart iconThe price of bitcoin over the last year. The latest move in bitcoin comes amid a worsening sell-off in U.S. tech stocks. The State Street Technology Select Sector SPDR ETF (XLK) dropped 1.8% on Thursday, marking its third straight losing day.Meanwhile, precious metals continue to be volatile too, with silver plunging again on Thursday and gold under pressure. Forced liquidations — when traders' positions are automatically sold as bitcoin hits a set price — continue to weigh on markets. As of Thursday, more than $2 billion in long and short positions in cryptocurrencies have been liquidated this week, according to data from Coinglass.Bitcoin has been on a steady decline for more than three months, and is now more than 50% below its October high. Other cryptocurrencies, including ether and XRP, have fallen even more. \"[The] straight line bull run that a lot of people expected hasn't really materialized yet. Bitcoin isn't trading on hype anymore, the story has lost a bit of that plot, it is trading on pure liquidity and capital flows,\" Maja Vujinovic, CEO of digital assets at FG Nexus, told CNBC's \"Worldwide Exchange.\"watch nowInstitutional demand reversesWhile many in the crypto market have previously credited large institutional investors with supporting the price of bitcoin, now it is those same participants who appear to be selling.\"Institutional demand has reversed materially,\" CryptoQuant said in a report on Wednesday. U.S. exchange-traded funds, which purchased 46,000 bitcoin this time last year, are net sellers in 2026, CryptoQuant said.The report notes other worrying signs. \"Bitcoin has broken below its 365-day moving average for the first time since March 2022 and has declined 23% in the 83 days since the breakdown — worse than the early 2022 bear phase,\" CryptoQuant analysts said. A moving average tracks the price of an asset over a set number of periods, smoothing out short-term price fluctuations to identify trends.The latest leg lower in bitcoin suggests \"potential downside toward the $70K–$60K range,\" CryptoQuant said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bitcoin drops 15%, briefly breaking below $61,000 as sell-off intensifies, doubts about crypto grow",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/105496652-1740495612547-105496652-1539107947284gettyimages-917296340-1.jpg?v=1770315543&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T00:39:45.000Z",
      "dateModified": "2026-02-06T00:39:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]