[
  {
    "title": "YouTube’s CEO limits his kids’ social media use — other tech bosses do the same ",
    "url": "https://www.cnbc.com/2025/12/13/youtubes-ceo-is-latest-tech-boss-limiting-his-kids-social-media-use.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108087244-1736969815167-gettyimages-1478183732-_m010657_yjubphnn.jpeg?v=1757971759&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-13T07:08:15.000Z",
    "description": "Neal Mohan, the CEO of YouTube speaks during a panel for the Summit for Democracy on March 30, 2023 in Washington, DC.Anna Moneymaker | Getty ImagesYo",
    "body": "Neal Mohan, the CEO of YouTube speaks during a panel for the Summit for Democracy on March 30, 2023 in Washington, DC.Anna Moneymaker | Getty ImagesYouTube's CEO Neal Mohan is the latest in a line of tech bosses who have admitted to limiting their children's social media use, as the harms of being online for young people have become more evident. Mohan, who took the helm of YouTube's leadership in 2023, was just named Time's 2025 CEO of the Year. He said in an interview with the magazine that his children's use of media platforms is controlled and restricted. \"We do limit their time on YouTube and other platforms and other forms of media. On weekdays we tend to be more strict, on weekends we tend to be less so. We're not perfect by any stretch,\" Mohan said in one TikTok video posted by Time Magazine on Thursday. He stressed \"everything in moderation\" is what works best for him and his wife, and that extends to other online services and platforms. Mohan has three children: two sons and one daughter. Experts have continued to sound the alarm on how excessive smartphones and social media use has harmed children and teenagers. Jonathan Haidt, NYU professor and author of \"The Anxious Generation,\" has advocated for children to not have smartphones before the age of 14 and no access to social media before the age of 16.\"Let them have a flip phone, but remember, a smartphone isn't really a phone. They could make phone calls on it, but it's a multi-purpose device by which the world can get to your children,\" Haidt said in an interview with CNBC's Tania Bryer earlier this year.This week, Australia became the first country to formally bar users under the age of 16 from accessing major social media platforms. Ahead of the legislation's passage last year, a YouGov survey found that 77% of Australians backed the under-16 social media ban. Still, the rollout has faced some resistance since becoming law.Mohan said in a more extensive interview with Time on Wednesday that he feels a \"paramount responsibility\" to young people and giving parents greater control over how their kids use the platform. YouTube Kids was launched in 2015 as a child-friendly version of the Google-owned platform. He said his goal is  \"to make it easy for all parents\" to manage their children's YouTube use \"in a way that is suitable to their household,\" especially as every parent has a different approach. Bill Gates, Mark Cuban Several tech bosses have taken a similar approach. YouTube's former CEO Susan Wojcicki, also barred her children from browsing videos on the app, unless they were using YouTube Kids. She also limited the amount of time they spent on the platform. \"I allow my younger kids to use YouTube Kids, but I limit the amount of time that they're on it,\" Wojcicki told CNBC in 2019. \"I think too much of anything is not a good thing.\"Bill Gates, Microsoft's co-founder, is amongst the tech titans who are against allowing young people too much screen time. With three children, now adults, Gates openly talked about not giving them cell phones until they were in their teens. \"We don't have cell phones at the table when we are having a meal, we didn't give our kids cell phones until they were 14 and they complained other kids got them earlier,\" Gates said years ago. Meanwhile, billionaire Mark Cuban would even resort to installing Cisco routers and using management software to monitor which apps his children were on and shut off their phone activity.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube’s CEO limits his kids’ social media use — other tech bosses do the same ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108087244-1736969815167-gettyimages-1478183732-_m010657_yjubphnn.jpeg?v=1757971759&w=1920&h=1080"
      ],
      "datePublished": "2025-12-13T07:08:15.000Z",
      "dateModified": "2025-12-13T07:08:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "25-year-old certified nutrition and health coach's go-to breakfast: 'It sets me up for success, it makes me feel good'",
    "url": "https://www.cnbc.com/2025/12/14/certified-nutrition-and-health-coachs-go-to-breakfast.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241448-1765572519944-gettyimages-1277723081-1028_29_nbr8807.jpeg?v=1765572580&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-14T15:00:01.000Z",
    "description": "From how much energy you have first thing in the morning, to how your mood ebbs and flows throughout the day, the foods you eat have a significant imp",
    "body": "From how much energy you have first thing in the morning, to how your mood ebbs and flows throughout the day, the foods you eat have a significant impact on how you feel. It's why doctors and nutritionists alike consider the first meal of the day to be most important. Hunter Stoler, a NYC-based certified nutrition and health coach, has a go-to breakfast that he eats just about every day to feel his best. Known as \"Health with Hunter\" on social media, the 25-year-old also recommends this breakfast to his more than 400,000 followers on Instagram and 300,000+ followers on TikTok. \"I'll say six out of every seven days a week, I have a yogurt bowl just because I know it's balanced,\" Stoler tells CNBC Make It.His yogurt bowl recipe is high in fiber and protein.\"It sets me up for success, it makes me feel good and I'm full for a few hours after that,\" he says.The breakfast allows him to up his fiber intake, which, research shows, many people often lack in their diets. Less than 10% of U.S. adults get the recommended daily intake of fiber, according to a study which was presented at Nutrition 2021 Live Online.Here are the key ingredients in Stoler's daily yogurt bowl. Plus, some of his other healthy breakfast options.Health with Hunter's go-to high-fiber, high-protein breakfastJust about every morning, Stoler mixes together these five ingredients:Non-fat Greek yogurtHalf a serving of protein powderFrozen organic wild blueberriesHealthy cereal or granolaSpices (cinnamon, pumpkin spice or a pinch of salt)\"There's flexibility in that, but the structure of the meal is the same,\" Stoler says. \"That combination of protein from the protein powder and Greek yogurt, fiber from the blueberries, and potentially a little bit from the cereal or granola, is what's going to keep me really full and just satisfied.\"Research shows that the antioxidants found in blueberries can help reduce inflammation, improve your brain health and lead to more positive health outcomes.The opportunities are endless, but remember, it's about the structure with flexibility.Hunter StolerNutrition and health coachOne of Stoler's other go-to morning meals that's high in fiber and protein is overnight oatmeal. He mixes together almond milk or whole milk with a cup of glyphosate-free oats and a scoop of protein powder. He stores it in his fridge until the following day.\"Then the next morning, you have delicious oats that you could top with fruit, a nut butter, which is really great, cinnamon and maybe a little bit of Greek yogurt for more protein,\" Stoler says.If he's craving a warm, healthy breakfast, he toasts high-fiber bread and tops it with savory foods like scrambled eggs and avocado, or yogurt for a sweet option. \"The opportunities are endless, but remember, it's about the structure with flexibility,\" he says.Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future. Use coupon code EARLYBIRD for 30% off. Offer valid from Dec. 8 to Dec. 22, 2025. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "25-year-old certified nutrition and health coach's go-to breakfast: 'It sets me up for success, it makes me feel good'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241448-1765572519944-gettyimages-1277723081-1028_29_nbr8807.jpeg?v=1765572580&w=1920&h=1080"
      ],
      "datePublished": "2025-12-14T15:00:01.000Z",
      "dateModified": "2025-12-14T15:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says Kevin Warsh is at top of Fed chair candidate list, president should be consulted on rates",
    "url": "https://www.cnbc.com/2025/12/12/trump-kevin-warsh-fed-chair-rates.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108173286-1752755185354-Kevin4.jpg?v=1765577367&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-12T22:10:15.000Z",
    "description": "Kevin Warsh, former governor of the US Federal Reserve, speaks with CNBC on July 17, 2025.CNBCPresident Donald Trump said Friday that Kevin Warsh has ",
    "body": "Kevin Warsh, former governor of the US Federal Reserve, speaks with CNBC on July 17, 2025.CNBCPresident Donald Trump said Friday that Kevin Warsh has moved to the top of his list as the next Federal Reserve chair, though others remain in contention, according to the Wall Street Journal.Previously considered on Trump's short list but not the favorite, Warsh, a former Fed governor himself, apparently ingratiated himself further following an interview Wednesday with the president.\"Yes, I think he is,\" Trump told the paper when asked if Warsh was at the top, according to an account posted Friday afternoon.Referring to National Economic Council Director Kevin Hassett, whom prediction markets previously had projected as the favorite, Trump said, \"I think you have Kevin and Kevin. They're both — I think the two Kevins are great.\"\"I think there are a couple of other people that are great,\" the president added.Hassett emerged as the lead candidate following a Bloomberg News report. Publicly, he has been demure when asked about the prospect of taking the job, saying only he would serve if asked. Sen. Elizabeth Warren (D-Mass.), said Thursday on CNBC that she worried Trump would appoint a \"sock puppet\" as Fed chair to do his bidding.In addition to putting heavier weight on Warsh getting the job, Trump repeated an assertion he has made in the past that the Fed chair ought to consult the president about interest rate decisions.\"Typically, that's not done anymore. It used to be done routinely. It should be done,\" he said. \"I'm a smart voice and should be listened to.\"Trump has been at odds with the current chair, Jerome Powell, almost from the moment he nominated him for the position in 2017. Often resorting to name-calling and personal insults, Trump has badgered the Fed to lower interest rates, dissatisfied even with the current pace of cuts that has seen the central bank lop off three-quarters of a percentage point from its key rate since September. The Fed most recently cut Wednesday, taking the benchmark federal funds rate down to a range of 3.5%-3.75%, which Trump thinks should be even lower.Trump noted that Warsh largely agrees with his stance on monetary policy.\"He thinks you have to lower interest rates,\" Trump said. \"And so does everybody else that I've talked to.\"Prediction markets moved following the Journal report. Previously giving Hassett about a 71% chance of the nomination, that slipped to 62%, with Warsh at 36%, according to Kalshi.Trump did leave enough space to change his mind, noting that he has several good candidates in front of him.\"I think I have somebody that I like the best,\" he said. \"I like all of them, but I want to be careful because I was given a bad recommendation\" when he named Powell to the spot.Over the year, Trump repeatedly has blamed former Treasury Secretary Steve Mnuchin for recommending Powell. Current Treasury Secretary Scott Bessent has led the current search. Trump has made no secret that he'd prefer Bessent to take on the role, but the Treasury chief has said repeatedly he is not interested.Other candidates considered included current Governors Christopher Waller and Michelle Bowman along with Rick Rieder, who runs the fixed income operation at money management giant BlackRock. They were the last of a group of 11 candidates considered for the post.Powell's term expires in May, having been reappointed to the position by former President Joe Biden.Asked at his Wednesday news conference about his legacy, Powell said, \"I really want to turn this job over to whoever replaces me ... with the economy in really good shape. That's what I want to do.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says Kevin Warsh is at top of Fed chair candidate list, president should be consulted on rates",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108173286-1752755185354-Kevin4.jpg?v=1765577367&w=1920&h=1080"
      ],
      "datePublished": "2025-12-12T22:10:15.000Z",
      "dateModified": "2025-12-12T22:10:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MacKenzie Scott announced another $7.1 billion in 2025 charitable donations—she's now given away $26.3 billion since 2019",
    "url": "https://www.cnbc.com/2025/12/13/mackenzie-scott-revealed-her-total-charitable-donations-for-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108105888-1740168765345-gettyimages-2100039841-927403324_scott2.jpeg?v=1740168819&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-13T14:15:01.000Z",
    "description": "Billionaire philanthropist MacKenzie Scott has unveiled the final tally for her 2025 charitable donations, which totaled $7.17 billion in gifts to rou",
    "body": "Billionaire philanthropist MacKenzie Scott has unveiled the final tally for her 2025 charitable donations, which totaled $7.17 billion in gifts to roughly 225 organizations, she wrote in a blog post published on Tuesday.\"This dollar total will likely be reported in the news, but any dollar amount is a vanishingly tiny fraction of the personal expressions of care being shared into communities this year,\" Scott wrote.Scott's 2025 giving brings her total donation amount since 2019 to $26.3 billion, based on her past public announcements of her charitable giving. This year's donations went to a wide range of nonprofits including several historically Black colleges and universities, and organizations focused on issues including poverty, social injustice and climate change.Scott's updated philanthropic tally puts her behind only fellow billionaires Warren Buffett and Bill Gates in terms of lifetime giving, according to Forbes. Forbes still estimates a $29.9 billion net worth for Scott, who became one of the world's wealthiest women following her 2019 divorce from Amazon founder Jeff Bezos.DON'T MISS: The ultimate guide to teaching your kids about moneyFollowing her divorce, Scott signed The Giving Pledge, committing to giving away the bulk of her wealth in her lifetime. She tasked a team of advisors with helping her step up her philanthropic giving by identifying \"organizations with strong leadership teams and results\" across a wide range of areas of societal need, she wrote in a 2020 blog post.Specifically, she wanted to pay \"special attention to those operating in communities facing high projected food insecurity, high measures of racial inequity, high local poverty rates and low access to philanthropic capital,\" she wrote.In her Tuesday essay, Scott wrote about putting her giving into perspective, citing data from Giving USA, which reported in June that Americans donated more than $590 billion in charitable giving in 2024. Much of the country's philanthropy — whether monetary or otherwise — happens on a relatively small scale, Scott wrote.\"Over 70% of Americans reported giving both labor and money to people they know, and half reported doing the same for strangers,\" wrote Scott, adding: \"It's easy to focus on the methods of civic participation that make news, and hard to imagine the importance of the things we do each day with our own minds and hearts.\"Scott mentioned multiple examples of generosity she received before she became wealthy, helping inspire her more recent philanthropy. She wrote about a \"local dentist who offered me free dental work when he saw me securing a broken tooth with denture glue in college,\" and her college roommate at Princeton University \"who found me crying, and acted on her urge to loan me a thousand dollars to keep me from having to drop out in my sophomore year.\"That roommate, Jeannie Ringo Tarkenton, went on to found Funding U, a student lender that offers loans to low-income students without requiring a co-signer, Scott noted.Scott highlighted those examples while encouraging civic participation in myriad forms, from financial gifts to random acts of kindness: \"Respect, understanding, insight, empathy, forgiveness, inspiration – all of these are meaningful contributions to others.\"Scott's blog post did not break down how or why she chose any of the hundreds of organizations she supported in 2025. A long-standing aspect of her giving does stand out in contrast to many other billionaire philanthropists: Her donations typically come without any strings, meaning organizations are free to use the money however they see fit.Her goal has been to \"de-emphasize privileged voices\" like her own, \"and cede focus to others,\" she wrote in a 2021 blog post.\"People struggling against inequities deserve center stage in stories about change they are creating,\" Scott wrote in that post. \"This is equally — perhaps especially — true when their work is funded by wealth.\"Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future. Use coupon code EARLYBIRD for 30% off. Offer valid from Dec. 8 to Dec. 22, 2025. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MacKenzie Scott announced another $7.1 billion in 2025 charitable donations—she's now given away $26.3 billion since 2019",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108105888-1740168765345-gettyimages-2100039841-927403324_scott2.jpeg?v=1740168819&w=1920&h=1080"
      ],
      "datePublished": "2025-12-13T14:15:01.000Z",
      "dateModified": "2025-12-13T14:15:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TSA is giving airline passenger data to ICE for deportation push: NYT",
    "url": "https://www.cnbc.com/2025/12/12/ice-deportation-airline-passengers-tsa.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108206637-17593433092025-10-01t182732z_1931325613_rc253haorize_rtrmadp_0_usa-shutdown.jpeg?v=1765575306&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-12T22:08:22.000Z",
    "description": "An employee with the Transportation Security Administration (TSA) checks the documents of a traveler at the Hollywood Burbank Airport in Burbank, Cali",
    "body": "An employee with the Transportation Security Administration (TSA) checks the documents of a traveler at the Hollywood Burbank Airport in Burbank, California, U.S., Oct. 1, 2025.Daniel Cole | ReutersThe Transportation Security Administration is giving U.S. immigration officials the names of every airline traveler as part of the Trump administration's widespread deportation program, The New York Times reported Friday.TSA, several times per week, gives Immigration and Customs Enforcement a list of travelers expected to be passing through airports, the Times reported.\"ICE can then match the list against its own database of people subject to deportation and send agents to the airport to detain those people,\" the newspaper said.ICE and TSA are both divisions of the Homeland Security Department.A Homeland Security spokesperson, in a statement to CNBC, said of the Times report, \"This is nothing new.\"\"Back in February, Secretary [Kristi] Noem reversed the horrendous Biden-era policy that allowed aliens in our country illegally to jet around our country and do so without identification,\" the spokesperson said. \"Under President Trump, TSA and DHS will no longer tolerate this. This administration is working diligently to ensure that aliens in our country illegally can no longer fly unless it is out of our country to self-deport.\"The Times said that it is not known how many people have been arrested as a result of TSA's information sharing.But the newspaper said it had obtained documents that indicate the program led to the Nov. 20 arrest at Boston's Logan Airport of a college student, Any Lucía López Belloza, who was deported to Honduras two days later. López had been on her way to visit her family in Texas for the Thanksgiving holiday.The Times previously reported that López was brought to the United States from Honduras at age 7, and that her family said neither they nor she knew she was subject to a deportation order.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TSA is giving airline passenger data to ICE for deportation push: NYT",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108206637-17593433092025-10-01t182732z_1931325613_rc253haorize_rtrmadp_0_usa-shutdown.jpeg?v=1765575306&w=1920&h=1080"
      ],
      "datePublished": "2025-12-12T22:08:22.000Z",
      "dateModified": "2025-12-12T22:08:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ServiceNow in talks to acquire cybersecurity startup Armis in potential $7 billion deal, Bloomberg reports",
    "url": "https://www.cnbc.com/2025/12/14/servicenow-reportedly-in-talks-to-acquire-cybersecurity-startup-armis.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108194579-1757019770569-gettyimages-2233043798-SERVICENOW_HQ.jpeg?v=1757019790&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-14T15:11:33.000Z",
    "description": "Software company ServiceNow is in advanced talks to buy cybersecurity startup Armis, which was last valued at $6.1 billion, Bloomberg reported. The de",
    "body": "Software company ServiceNow is in advanced talks to buy cybersecurity startup Armis, which was last valued at $6.1 billion, Bloomberg reported. The deal, which could reach $7 billion in value, would be ServiceNow's largest acquisition, the outlet said, citing people familiar with the situation who asked not to be identified because the talks are private. The acquisition could be announced as soon as this week, but could still fall apart, according to the report. Armis and ServiceNow did not immediately return a CNBC request for comment.Armis, which helps companies secure and manage internet-connected devices and protect them against cyber threats, raised $435 million in a funding round just over a month ago and told CNBC about its eventual plans for an IPO.Armis CEO Yevgeny Dibrov and CTO Nadir Izrael.Courtesy: ArmisCEO and co-founder Yevgeny Dibrov said Armis was aiming for a public listing at the end of 2026 or early 2027, pending \"market conditions.\" Armis's decision to be acquired rather than wait for a public listing is a common path for startups at the moment. The IPO markets remain choppy and many startups are choosing to remain private for longer instead of risking a muted debut on the public markets. Founded in 2016, Armis said in August it had surpassed $300 million in annual recurring revenues, a milestone it achieved less than a year after reaching $200 million in ARR.Its latest funding round was led by Goldman Sachs Alternatives' growth equity fund, with participation from CapitalG, a venture arm of Alphabet. Previous backers have included Sequoia Capital and Bain Capital Ventures.Read the complete Bloomberg article here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ServiceNow in talks to acquire cybersecurity startup Armis in potential $7 billion deal, Bloomberg reports",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108194579-1757019770569-gettyimages-2233043798-SERVICENOW_HQ.jpeg?v=1757019790&w=1920&h=1080"
      ],
      "datePublished": "2025-12-14T15:11:33.000Z",
      "dateModified": "2025-12-14T15:11:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hoda Kotb: The No. 1 question to ask yourself before making a career change—it's about 'what you think you deserve'",
    "url": "https://www.cnbc.com/2025/12/13/hoda-kotb-best-question-to-ask-yourself-before-making-career-change.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108039565-1727354464828-gettyimages-2147750388-NUP_204189_00008JPG.jpeg?v=1765469978&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-13T14:05:01.000Z",
    "description": "Hoda Kotb knows what it's like to completely overhaul a career and start fresh in a brand-new industry.The longtime journalist left NBC's \"TODAY\" in J",
    "body": "Hoda Kotb knows what it's like to completely overhaul a career and start fresh in a brand-new industry.The longtime journalist left NBC's \"TODAY\" in January after 26 years with the organization, and launched her own company — a wellness brand called Joy 101 — in May. Becoming a first-time CEO at age 60 felt somewhat impossible to her, which is exactly why she decided to do it, she said on a Dec. 8 episode of \"The Mel Robbins Podcast.\"Whether you're \"20 or 40 or 60 or 80,\" you can determine whether such a drastic career change is right for you by asking yourself one important question, said Kotb, now 61: Is this job giving me what I deserve?In Kotb's case, she was ready for a new challenge, and realized during an on-air 60th birthday celebration that continuing her journalism career probably wouldn't fulfill that need, she said. \"I was almost having an out of body [experience],\" she said. \"I kept thinking ... This is the top of the wave. I could feel it ... This is the best it's ever going to be.\"Other people may come to a similar conclusion through more a frustrating process: Maybe you've worked a job where you didn't receive enough positive feedback, or the company lacked opportunities for you to learn and grow.DON'T MISS: The ultimate guide to teaching your kids about moneyIf you feel like you're hitting a professional roadblock, you should sit down and figure out what it is that you feel like you deserve, said Kotb. That self-audit shouldn't come from a place of envy or \"FOMO\" around what someone else has, she noted. And it won't always prompt a total career reset — maybe you'll seek a raise or promotion at work instead, for example.\"Look at your life, just look at it from 35,000 feet and then decide, do I want to change it?\" she said. \"And I'm here to tell you, I feel like I'm living, breathing proof that you can change it at any time. Things you thought were impossible are not impossible.\"Kotb has previously said that her decision to leave \"TODAY\" was also influenced by a desire to spend more time with her family. This was made difficult by her daily 3:15 a.m. wakeup to get to work on time, she told People in May.Entrepreneurship now presents Kotb with a different kind of challenge, she's said. \"Being an entrepreneur is hard,\" Kotb told Variety in May. \"I didn't realize how many hats you wear as an entrepreneur ... I'm learning how to be a boss.\"To make building a new career from scratch feel less intimidating, you can start small, Kotb recommended: Spend 30 minutes per day doing something that'll help you make progress, from working on your resume to creating a business plan or learning a new skill. After a month, for example, you'll have 900 minutes of groundwork, rather than making a spur-of-the-moment decision to quit your job without a plan.\"Baby steps toward the jump,\" said Kotb. \"Sometimes we think we want it and you're like, 'I'm going to run and jump off the cliff' ... Don't do that. We're not idiots. We need our paychecks. We need our insurance. We need these things, but we can explore possibilities at the same time.\"Disclosure: NBC and CNBC are divisions of NBCUniversal.Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future. Use coupon code EARLYBIRD for 30% off. Offer valid from Dec. 8 to Dec. 22, 2025. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hoda Kotb: The No. 1 question to ask yourself before making a career change—it's about 'what you think you deserve'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108039565-1727354464828-gettyimages-2147750388-NUP_204189_00008JPG.jpeg?v=1765469978&w=1920&h=1080"
      ],
      "datePublished": "2025-12-13T14:05:01.000Z",
      "dateModified": "2025-12-13T14:05:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I'm a psychologist who studies couples: People in the happiest relationships do 7 things on weeknights—that most neglect",
    "url": "https://www.cnbc.com/2025/12/14/psychologist-people-in-the-happiest-relationships-do-5-things-on-weeknights.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240739-1765474859865-CNBC_Happy_Couples_Weeknights_Purple_v2.jpg?v=1765563564&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-14T14:22:42.000Z",
    "description": "Between long office days, late dinners and endless to-dos, many working couples slip into a routine of coexisting instead of really connecting. The ex",
    "body": "Between long office days, late dinners and endless to-dos, many working couples slip into a routine of coexisting instead of really connecting. The excuses feel valid: \"We're exhausted,\" or, \"We'll catch up this weekend.\" The problem is that they both end up missing the everyday moments that keep a relationship alive.As a psychologist who studies couples and as a husband, I've found that people in the happiest, most resilient relationships treat their weeknights as opportunities that don't go wasted.Here are the seven things these couples consistently do before bedtime.1. They start with decompression timeYou can't always expect your partner to walk through the door ready to cook, talk, or be cheerful. Healthy couples build in 15 to 30 minutes of guilt-free alone time for each partner — one decompresses while the other handles a light task, then they switch.It's not glamorous, but it's a huge kindness. By protecting each other's battery early in the evening, they preserve the bandwidth they'll need to connect later on.2. They 'silent sync' when they're drainedSome nights, even after a decompression session, you may still feel drained. Happy couples don't force it. They start their evening together, but quietly: sitting on the balcony, lying side by side, taking a slow walk.In psychological research, this is a form of co-regulation: the process of two people syncing up emotionally, allowing the emotions of the day to rise and fall until they feel like themselves again. A few minutes of shared quiet can reset your rhythm better than a forced conversation.3. They do a quick daily recapNot every weeknight has room for deep emotional check-ins. So the happiest couples keep it simple: each person shares one thing about their day, good or bad. It could be venting some frustration, sharing a little win they had at the office or even just something funny that happened. No advice. No solutions. Just listening. This light, consistent sharing keeps them emotionally updated without draining what's left of their workweek energy.4. They keep one honored ritual, no matter whatEven on nights when both partners want to zone out, they stick to one small shared ritual they never skip. For most, it's something ridiculously simple: eating dinner together without their phones, making a nightly cup of tea, or doing a word game together. The ritual becomes a daily anchor — something predictable, comforting, and theirs alone.5. They cuddle before sleepIf I had to choose just one nightly habit to keep, this would be it. Research shows that partners who cuddle regularly report higher relationship satisfaction and commitment, even compared with couples who emphasize \"quality time\" together.Cuddling triggers oxytocin (the bonding hormone) and lowers cortisol (the stress hormone). It's the easiest, fastest biological boost your relationship can get.6. They 'close the kitchen' as a teamEven the happiest couples feel the low-level resentment of uneven household work. That's why they end the evening with 5 to 10 minutes of shared tidying, wiping counters, packing tomorrow's lunches, loading the dishwasher.The point isn't actually about cleaning, but rather to prove that they're committed to keeping things fair.7. They check in about tomorrowInstead of rehashing the day, heathy and happy couples look ahead. They share one small thing they're looking forward to tomorrow, or even one small thing they're dreading.This is a brief, gentle way for working couples to stay in sync without needing to fully rehash the emotional weight of their day. You get a sense of what your partner might need tomorrow, whether it's encouragement, space, or just a little extra support. And they get the same from you.Mark Travers, PhD, is a psychologist who specializes in relationships. He holds degrees from Cornell University and the University of Colorado Boulder. He is the lead psychologist at Awake Therapy, a telehealth company that provides online psychotherapy, counseling, and coaching. He is also the curator of the popular mental health and wellness website, Therapytips.org.Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future. Use coupon code EARLYBIRD for 30% off. Offer valid from Dec. 8 to Dec. 22, 2025. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I'm a psychologist who studies couples: People in the happiest relationships do 7 things on weeknights—that most neglect",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240739-1765474859865-CNBC_Happy_Couples_Weeknights_Purple_v2.jpg?v=1765563564&w=1920&h=1080"
      ],
      "datePublished": "2025-12-14T14:22:42.000Z",
      "dateModified": "2025-12-14T14:22:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oracle says there have been 'no delays' in OpenAI arrangement after stock slide",
    "url": "https://www.cnbc.com/2025/12/12/oracle-says-there-have-been-no-delays-in-openai-arrangement.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241389-1765566253538-gettyimages-2236546557-STARGATE_DATA_CENTER.jpeg?v=1765566403&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-12T21:08:23.000Z",
    "description": "Oracle CEO Clay Magouyrk appears on a media tour of the Stargate AI data center in Abilene, Texas, on Sept. 23, 2025.Kyle Grillot | Bloomberg | Getty ",
    "body": "Oracle CEO Clay Magouyrk appears on a media tour of the Stargate AI data center in Abilene, Texas, on Sept. 23, 2025.Kyle Grillot | Bloomberg | Getty ImagesOracle on Friday pushed back against a report that said the company will complete data centers for OpenAI, one of its major customers, in 2028, rather than 2027.The delay is due to a shortage of labor and materials, according to the Friday report from Bloomberg, which cited unnamed people. Oracle shares closed down more than 4% on Friday. \"Site selection and delivery timelines were established in close coordination with OpenAI following execution of the agreement and were jointly agreed,\" an Oracle spokesperson said in an email to CNBC. \"There have been no delays to any sites required to meet our contractual commitments, and all milestones remain on track.\"The Oracle spokesperson did not specify a timeline for turning on cloud computing infrastructure for OpenAI. In September, OpenAI said it had a partnership with Oracle worth more than $300 billion over the next five years. \"We have a good relationship with OpenAI,\" Clay Magouyrk, one of Oracle's two newly appointed CEOs, said at an October analyst meeting.Doing business with OpenAI is relatively new to 48-year-old Oracle. Historically, Oracle grew through sales of its database software and business applications. Its cloud infrastructure business now contributes over one-fourth of revenue, although Oracle remains a smaller hyperscaler than Amazon, Microsoft and Google. OpenAI has also made commitments to other companies as it looks to meet expected capacity needs. In September, Nvidia said it had signed a letter of intent with OpenAI to deploy at least 10 gigawatts of Nvidia equipment for the San Francisco artificial intelligence startup. The first phase of that project is expected in the second half of 2026.Nvidia and OpenAI said in a September statement that they \"look forward to finalizing the details of this new phase of strategic partnership in the coming weeks.\"But no announcement has come yet.In a November filing, Nvidia said \"there is no assurance that we will enter into definitive agreements with respect to the OpenAI opportunity.\"OpenAI has historically relied on Nvidia graphics processing units to operate ChatGPT and other products, and now it's also looking at designing custom chips in a collaboration with Broadcom. On Thursday, Broadcom CEO Hock Tan laid out a timeline for the OpenAI work, which was announced in October. Broadcom and OpenAI said they had signed a term sheet.\"It's more like 2027, 2028, 2029, 10 gigawatts, that was the OpenAI discussion,\" Tan said on Broadcom's earnings call. \"And that's, I call it, an agreement, an alignment of where we're headed with respect to a very respected and valued customer, OpenAI. But we do not expect much in 2026.\"OpenAI declined to comment.WATCH: Oracle says there have been 'no delays' in OpenAI arrangement after stock slidewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oracle says there have been 'no delays' in OpenAI arrangement after stock slide",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241389-1765566253538-gettyimages-2236546557-STARGATE_DATA_CENTER.jpeg?v=1765566403&w=1920&h=1080"
      ],
      "datePublished": "2025-12-12T21:08:23.000Z",
      "dateModified": "2025-12-12T21:08:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hassett Fed chair odds fall, Warsh chances surge on Kalshi after Trump comments",
    "url": "https://www.cnbc.com/2025/12/12/hassett-fed-chair-odds-fall-warsh-chances-surge-on-kalshi-after-trump-comments.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108169517-1752067675343-gettyimages-2211325596-IMF_WORLD_BANK.jpeg?v=1765577298&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-12T21:54:59.000Z",
    "description": "Kevin Warsh, former governor of the US Federal Reserve, during the International Monetary Fund (IMF) and World Bank Spring meetings at the IMF headqua",
    "body": "Kevin Warsh, former governor of the US Federal Reserve, during the International Monetary Fund (IMF) and World Bank Spring meetings at the IMF headquarters in Washington, DC, US, on Friday, April 25, 2025.Tierney L. Cross | Bloomberg | Getty ImagesPrediction markets swung sharply Friday after President Donald Trump said Kevin Warsh has risen to the top of his list to be the next chair of the Federal Reserve.On Kalshi, Warsh's odds jumped to as high as 40% from about 15% after Trump told the Wall Street Journal that Warsh is a top contender. Meanwhile, the implied probability of National Economic Council Director Kevin Hassett becoming the next Fed chair dropped below 60% briefly from 80% not long ago.Asked directly whether Warsh was now his leading choice, Trump responded, \"Yes, I think he is,\" according to the paper. The comments quickly reverberated through prediction markets.Trump did imply that Hassett is still very much in the running as well and the NEC director is still leading the race on Kalshi.\"I think you have Kevin and Kevin. They're both — I think the two Kevins are great,\" Trump said.Hassett had been the clear market favorite for months, but by Friday afternoon his odds dipped as investors priced in Trump's latest signal.Other candidates considered included current Governors Christopher Waller and Michelle Bowman along with Rick Rieder, who runs the fixed income operation at money management giant BlackRock. They were the last of a group of 11 candidates considered for the post. Kalshi has essentially eliminated their chances for getting the top job.Trump also on Friday reiterated his long-held view that the Fed chair should consult the president on rate policy. Trump has been at odds with the current chair, Jerome Powell, as he continued to urge for lower interest rates. The Fed has reduced the fed funds rates by three-quarters of a percentage point since September.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hassett Fed chair odds fall, Warsh chances surge on Kalshi after Trump comments",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108169517-1752067675343-gettyimages-2211325596-IMF_WORLD_BANK.jpeg?v=1765577298&w=1920&h=1080"
      ],
      "datePublished": "2025-12-12T21:54:59.000Z",
      "dateModified": "2025-12-12T21:54:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Altman and Musk launched OpenAI as a nonprofit 10 years ago. Now they’re rivals in a trillion-dollar market",
    "url": "https://www.cnbc.com/2025/12/11/openai-began-decade-ago-as-nonprofit-lab-musk-and-altman-now-rivals.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236135-1764788503612-gettyimages-2197366908-dsc00472_mof5bjgn.jpeg?v=1764788585&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-12T02:31:35.000Z",
    "description": "Open AI CEO Sam Altman speaks during a talk session with SoftBank Group CEO Masayoshi Son at  an event titled \"Transforming Business through AI\" in To",
    "body": "Open AI CEO Sam Altman speaks during a talk session with SoftBank Group CEO Masayoshi Son at  an event titled \"Transforming Business through AI\" in Tokyo, Japan, on February 03, 2025. Tomohiro Ohsumi | Getty ImagesOn Dec. 11, 2015, OpenAI launched as a nonprofit research lab after Elon Musk and a group of prominent techies, including Peter Thiel and Reid Hoffman, pledged $1 billion to develop artificial intelligence for the benefit of humanity. The idea was for the project to be be free of commercial pressures and the pursuit of money. A decade later, that founding mission is all but forgotten. Musk, now the world's richest person, is long gone, having created rival startup xAI. And he's been engaged in a heated legal and public relations fight with OpenAI CEO and co-founder Sam Altman. Far from the nonprofit realm, OpenAI has emerged as one of the fastest-growing commercial entities on the planet, zooming to a $500 billion private market valuation, with almost all of that value accruing since the company's launch of ChatGPT three years ago. More than 800 million people now use the chatbot every week. Musk's xAI, meanwhile, is expected to close a $15 billion round at a $230 billion pre-money valuation this month, sources familiar with the matter told CNBC's David Faber in late November.OpenAI and xAI are two of the main companies, along with Google, Anthropic and Meta, pouring money into AI models, as the market rapidly evolves from text-based chatbots to AI-generated videos and more advanced compute-intensive forms of content, as well as into agentic AI, with large enterprises customizing tools to enhance productivity. For OpenAI, the price tag is almost incomprehensible: $1.4 trillion and growing. That's primarily for the mammoth data centers and high-powered chips required to meet what the company sees as insatiable demand for its technology. For now, OpenAI is a cash-burning machine going up against tech's megacaps and their chip suppliers, drawing comparisons to earlier waves of high-growth tech firms that spent heavily for years to challenge behemoth incumbents, but to mixed results.\"OpenAI has a very big role in the in the history of the development of artificial intelligence, and will forever have that role,\" said Gil Luria, an equity analyst at D.A. Davidson, in an interview. \"Now, will that role be Netscape, or will it be Google? We've yet to find out.\" Nvidia CEO Jensen Huang speaks at an event ahead of the COMPUTEX forum, in Taipei, Taiwan, June 2, 2024.Ann Wang | ReutersIt's a position that would've been hard to imagine in 2016, when Nvidia CEO Jensen Huang hauled a black DGX-1 supercomputer up to OpenAI's offices in San Francisco's Mission District. The $300,000 machine had cost Nvidia \"a few billion dollars\" to develop, and there were no other buyers, Huang recalled recently on Joe Rogan's podcast.  Musk, at OpenAI, was the only one who wanted it.When Musk told him it was for \"a nonprofit company,\" Huang said all the blood drained from his face at the thought of parking such a costly box inside an organization that wasn't meant to make money.Behind the scenes, though, the nonprofit ideal was already under intense strain, and Musk didn't like what he saw. \"Guys, I've had enough. This is the final straw,\" Musk wrote in an email to his co-founders in 2017. He warned that he would \"no longer fund OpenAI\" if it turned into a tech startup instead of a nonprofit. Altman wrote back the next morning: \"i remain enthusiastic about the non-profit structure!\"Altman vs. MuskIn February of the following year, Musk left the OpenAI board, and said at the time the move was to avoid a potential conflict of interest as his car company, Tesla, dove deeper into AI. The story was more complicated.Musk sued OpenAI and Altman in early 2024, alleging they abandoned the company's founding mission to develop AI \"for the benefit of humanity broadly,\" and he's regularly criticized OpenAI's close ties to Microsoft, its principal backer. He also went to court to try and keep OpenAI from converting into a for-profit entity and, earlier this year, went so far as to try and acquire the AI lab for $97.4 billion. In October, OpenAI announced it had completed a recapitalization, cementing its structure as a nonprofit with a controlling stake in its for-profit business, which is now a public benefit corporation called OpenAI Group PBC.watch nowMusk isn't the only early OpenAI team member who's turned into a bitter rival. Siblings Dario and Daniela Amodei left OpenAI in late 2020 to form Anthropic, which said last month that Microsoft and Nvidia would invest in the company. The valuation from the funding round could reach as high as $350 billion.Anthropic's Claude family of large language models is one of the biggest competitors to OpenAI's GPT models. Altman is wagering that he can win the race by outspending the competition. While his company has sketched out plans for a trillion-dollar-plus AI infrastructure outlay, Anthropic has made roughly $100 billion in recent compute commitments, spaced out at various intervals over the next few years.It all amounts to a giant bet that demand for AI services will continue apace. \"We've got all the various AI vendors making these huge capital investments,\" said David Menninger, executive director of software research at ISG. \"There's a question as to how long those capital investments continue and whether or not they all pan out.\"Luria says Anthropic and others are making reasonable commitments based on their current growth trajectory and the funding they've already secured. But he said OpenAI's approach has been based on a \"fantastical set of commitments\" with a \"faint belief that those numbers are even possible.\" 'Pretty extreme'Altman told CNBC in an interview on Thursday that OpenAI is already seeing enough demand to justify its spending plans, which \"makes us confident that we will be able to significantly ramp revenue.\"\"It's obviously unusual to be growing this fast at this kind of scale, but it is what we see in our current data,\" Altman said, adding that \"the demand in the market is pretty extreme.\" Altman said last month that he expects annualized revenue to hit $20 billion by the end of this year and to reach hundreds of billions by 2030. Its historic pace of growth has been a big boon for major tech companies. Oracle signed a roughly $500 billion deal to sell infrastructure services to OpenAI over five years. Chipmakers Advanced Micro Devices and Broadcom have woven OpenAI-linked demand into multi-year forecasts. But Oracle's shares plunged 11% on Thursday after the software vendor reported weaker-than-expected revenue, a miss that dragged down Nvidia, CoreWeave and other AI-related stocks. Despite a surge in long-term contract commitments from companies like OpenAI, Meta, and Nvidia, investors are growing concerned about Oracle's debt load that's fueling its buildout. watch nowStill, venture capitalist Matt Murphy of Menlo Ventures, said that in his 25 years in the venture business, \"this is the mother of all waves.\"Murphy, an early investor in Anthropic, said the combination of AI models, custom chips and hyperscale data centers adds up to the potential for trillion-dollar outcomes. That explains the eye-popping level of capital expenditures and the astronomical valuations, he said.Altman recently declared a \"code red\" inside his company, and shuffled resources to focus on making ChatGPT faster, more reliable and more personal, while delaying work on ads, health and shopping agents and a personal assistant called Pulse. His declaration came after Google released its Gemini 3 model last month, further accelerating the search giant's ascent in the market. On Thursday, OpenAI unveiled ChatGPT-5.2, a faster, more capable reasoning model that the company says is its best system yet for everyday professional use. It also struck a three-year, $1 billion content and equity deal with Disney around the Sora AI video generator.Altman downplayed the threat from Google, telling CNBC that Gemini had less of an impact on the company's metrics than OpenAI initially feared. \"I believe that when a competitive threat happens, you want to focus on it, deal with it quickly,\" Altman said.He said he expects the company to exit code red by January.— CNBC's Kif Leswing contributed to this report.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Altman and Musk launched OpenAI as a nonprofit 10 years ago. Now they’re rivals in a trillion-dollar market",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236135-1764788503612-gettyimages-2197366908-dsc00472_mof5bjgn.jpeg?v=1764788585&w=1920&h=1080"
      ],
      "datePublished": "2025-12-12T02:31:35.000Z",
      "dateModified": "2025-12-12T02:31:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump sued by preservation group seeking to halt White House ballroom construction",
    "url": "https://www.cnbc.com/2025/12/12/trump-lawsuit-ballroom-white-house-east-wing.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108226197-1763137778268-gettyimages-2246106310-a1_05129.jpeg?v=1765568375&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-12T21:16:23.000Z",
    "description": "PoliticsPublished Fri, Dec 12 20251:17 PM ESTUpdated Fri, Dec 12 20254:16 PM ESTKey PointsPresident Donald Trump and his administration were sued over",
    "body": "PoliticsPublished Fri, Dec 12 20251:17 PM ESTUpdated Fri, Dec 12 20254:16 PM ESTKey PointsPresident Donald Trump and his administration were sued over the construction of a massive White House ballroom in place of the demolished East Wing.The National Trust for Historic Preservation in the United States asked a federal judge to block the construction until the project receives federal review.\"No president is legally allowed to tear down portions of the White House without any review whatsoever — not President Trump, not President Biden, and not anyone else,\" the suit says. Construction crews continue to remove the East Wing of the White House and prepare for construction of the new ballroom, as seen from the newly reopened Washington Monument, Nov. 14, 2025.Andrew Leyden | Getty ImagesA nonprofit group tasked with preserving U.S. historical sites sued President Donald Trump on Friday, seeking to halt construction of his massive White House ballroom until the project receives the proper federal approvals.\"No president is legally allowed to tear down portions of the White House without any review whatsoever — not President Trump, not President Biden, and not anyone else,\" the National Trust for Historic Preservation in the United States said in the lawsuit in Washington federal court.\"And no president is legally allowed to construct a ballroom on public property without giving the public the opportunity to weigh in,\" the suit said.The suit argues that Trump was legally required to secure reviews and approvals before demolishing the historic East Wing of the White House and beginning to build the 90,000-square-foot ballroom.Read more CNBC politics coverageTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationTrump announces $12 billion aid package for farmers caught up in trade warTrump says Netflix, WBD deal could be 'problem' as son-in-law backs Paramount bidSupreme Court to hear case on Trump birthright citizenship orderTrump can fire labor, employment board members without cause: Appeals courtTrump administration views Netflix, Warner Bros. deal with 'heavy skepticism'Costco adds Biden Commerce Sec. Raimondo to board after Trump tariff lawsuitNew York Times sues Pentagon, Hegseth over media access policyCongressional watchdog probes Trump FHFA chief Bill PulteJan. 6 pipe bomb suspect Brian Cole arrested, faces explosives charges, DOJ saysJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'Those reviews \"should have taken place before the Defendants demolished the East Wing, and before they began construction of the Ballroom,\" the suit says.The trust is asking a judge to declare that the project violates multiple laws, including the Administrative Procedure Act. The group also seeks a court-ordered work stoppage \"until the necessary federal commissions have reviewed and approved the project's plans; adequate environmental review has been conducted; and Congress has authorized the Ballroom's construction.\"Later Friday, Judge Richard Leon set a hearing for Tuesday at 3:30 p.m. ET on the trust's motion for a temporary restraining order and preliminary injunction that would block further development on the ballroom.In addition to Trump, other defendants in the case are the National Park Service, the Department of the Interior, the General Services Administration and their respective agency heads.White House spokesman David Ingle told CNBC in a statement, \"President Trump has full legal authority to modernize, renovate, and beautify the White House — just like all of his predecessors did.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump sued by preservation group seeking to halt White House ballroom construction",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108226197-1763137778268-gettyimages-2246106310-a1_05129.jpeg?v=1765568375&w=1920&h=1080"
      ],
      "datePublished": "2025-12-12T21:16:23.000Z",
      "dateModified": "2025-12-12T21:16:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI order from Trump might be ‘illegal,’ Democrats and consumer advocacy groups claim",
    "url": "https://www.cnbc.com/2025/12/12/trumps-ai-order-democrats-consumers.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240990-17654963712025-12-11t233824z_952678150_rc2neia0jlqy_rtrmadp_0_usa-trump.jpeg?v=1765496418&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-12T21:44:19.000Z",
    "description": "U.S. President Donald Trump shows a signed executive order on AI next to Sriram Krishnan, Senior White House Policy Advisor on Artificial Intelligence",
    "body": "U.S. President Donald Trump shows a signed executive order on AI next to Sriram Krishnan, Senior White House Policy Advisor on Artificial Intelligence, U.S. Senate Commerce Committee Chairman Ted Cruz (R-TX), U.S. Commerce Secretary Howard Lutnick, David O. Sacks, Chair of the President's Council of Advisors on Science and Technology, and U.S. Treasury Secretary Scott Bessent, in the Oval Office at the White House in Washington, D.C., U.S. Dec. 11, 2025. Al Drago | Reuters\"This is the wrong approach — and most likely illegal,\" Sen. Amy Klobuchar, D-Minn., said in a post on X Thursday. \"We need a strong federal safety standard, but we should not remove the few protections Americans currently have from the downsides of AI,\" Klobuchar said.Trump's executive order directs Attorney General Pam Bondi to create a task force to challenge state laws regulating AI.The Commerce Department was also directed to identify \"onerous\" state regulations aimed at AI. The order is a win for tech companies such as OpenAI and Google and the venture firm Andreessen Horowitz, which have all lobbied against state regulations they view as burdensome. Read more CNBC politics coverageTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationTrump announces $12 billion aid package for farmers caught up in trade warTrump says Netflix, WBD deal could be 'problem' as son-in-law backs Paramount bidSupreme Court to hear case on Trump birthright citizenship orderTrump can fire labor, employment board members without cause: Appeals courtTrump administration views Netflix, Warner Bros. deal with 'heavy skepticism'Costco adds Biden Commerce Sec. Raimondo to board after Trump tariff lawsuitNew York Times sues Pentagon, Hegseth over media access policyCongressional watchdog probes Trump FHFA chief Bill PulteJan. 6 pipe bomb suspect Brian Cole arrested, faces explosives charges, DOJ saysJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'It follows a push by some Republicans in Congress to impose a moratorium on state AI laws. A recent plan to tack on that moratorium to the National Defense Authorization Act was scuttled.Collin McCune, head of government affairs at Andreessen Horowitz, celebrated Trump's order, calling it \"an important first step\" to boost American competition and innovation. But McCune urged Congress to  codify a national AI framework.\"States have an important role in addressing harms and protecting people, but they can't provide the long-term clarity or national direction that only Congress can deliver,\" McCune said in a statement.Sriram Krishnan, a White House AI advisor and former general partner at Andreessen Horowitz, during an interview Friday on CNBC's \"Squawk Box,\" said that Trump was looking to partner with Congress to pass such legislation.\"The White House is now taking a firm stance where we want to push back on 'doomer' laws that exist in a bunch of states around the country,\" Krishnan said.He also said that the goal of the executive order is to give the White House tools to go after state laws that it believes make America less competitive, such as recently passed legislation in Democratic-led states like California and Colorado. The White House will not use the executive order to target state laws that protect the safety of children, Krishnan said.Robert Weissman, co-president of the consumer advocacy group Public Citizen, called Trump's order \"mostly bluster\" and said the president \"cannot unilaterally preempt state law.\"\"We expect the EO to be challenged in court and defeated,\" Weissman said in a statement. \"In the meantime, states should continue their efforts to protect their residents from the mounting dangers of unregulated AI.\"Weissman said about the order, \"This reward to Big Tech is a disgraceful invitation to reckless behavior by the world's largest corporations and a complete override of the federalist principles that Trump and MAGA claim to venerate.\"In the short term, the order could affect a handful of states that have already passed legislation targeting AI. The order says that states whose laws are considered onerous could lose federal funding.One Colorado law, set to take effect in June, will require AI developers to protect consumers from reasonably foreseeable risks of algorithmic discrimination.Some say Trump's order will have no real impact on that law or on other state regulations.\"I'm pretty much ignoring it, because an executive order cannot tell a state what to do,\" said Colorado state Rep. Brianna Titone, a Democrat who co-sponsored the anti-discrimination law.In California, Gov. Gavin Newsom recently signed a law that, starting in January, will require major AI companies to publicly disclose their safety protocols.  That law's author, state Sen. Scott Wiener, said that Trump's stated goal of having the United States dominate the AI sector is undercut by his recent moves. \"Of course, he just authorized chip sales to China & Saudi Arabia: the exact opposite of ensuring U.S. dominance,\" Wiener wrote in an X post on Thursday night. The Bay Area Democrat is seeking to succeed  Speaker-emerita Nancy Pelosi in the U.S. House of Representatives. Trump on Monday said he will Nvidia to sell its advanced H200 chips to \"approved customers\" in China, provided that the U.S. gets a 25% cut of revenues.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI order from Trump might be ‘illegal,’ Democrats and consumer advocacy groups claim",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240990-17654963712025-12-11t233824z_952678150_rc2neia0jlqy_rtrmadp_0_usa-trump.jpeg?v=1765496418&w=1920&h=1080"
      ],
      "datePublished": "2025-12-12T21:44:19.000Z",
      "dateModified": "2025-12-12T21:44:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Activist Starboard reveals 5% stake in Clearwater as tech company reviews its options",
    "url": "https://www.cnbc.com/2025/12/13/activist-starboard-reveals-5percent-stake-in-clearwater-as-tech-company-reviews-its-options.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106947175-1632509597147CWAN-OB-Photo-210924-PRESS-11.jpg?v=1755008861&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-13T14:21:36.000Z",
    "description": "Sandeep Sahai, CEO of Clearwater Analytics, at the New York Stock Exchange on Sept. 24, 2021.Source: NYSECompany: Clearwater Analytics Holdings (CWAN)",
    "body": "Sandeep Sahai, CEO of Clearwater Analytics, at the New York Stock Exchange on Sept. 24, 2021.Source: NYSECompany: Clearwater Analytics Holdings (CWAN)Business: Clearwater Analytics Holdings is a provider of comprehensive cloud-native platforms for institutional investors across global public and private markets. The company's single-instance, multi-tenant architecture delivers real-time data and artificial intelligence-driven insights throughout the investment lifecycle. The platform eliminates information silos by integrating portfolio management, trading, investment accounting, reconciliation, regulatory reporting, performance, compliance, and risk analytics in one unified system. The company serves insurers, asset managers, hedge funds, banks, corporations and governments. The company is also a provider of enterprise risk analytics and developer infrastructure. Its capabilities in complex portfolio management across both public and private markets include structured products, private credit, and derivatives.Stock Market Value: $6.37 billion ($21.76 per share)Stock Chart IconStock chart iconClearwater Analytics Holdings shares year to date.Activist: Starboard ValueOwnership: ~4.9%Average Cost: n/aActivist Commentary: Starboard is a very successful activist investor and has extensive experience helping companies focus on operational efficiency and margin improvement. They are known for their excellent diligence and for running many of the most successful campaigns. Starboard has initiated activist campaigns at 59 prior information technology companies and their average return on these situations is 36.92% versus an average of 20.01% for the Russell 2000 during the same time periods. Additionally, Starboard has taken a total of 163 prior activist campaigns in their history and has an average return of 21.26% versus 14.34% for the Russell 2000 over the same period.What's happeningOn Dec. 9, Starboard announced a nearly 5% position in Clearwater Analytics and is urging the company to run a robust sales process if it has received in-bound interest from potential buyers.Behind the scenesClearwater Analytics is a provider of front-to-back, cloud-based investment accounting solutions. The company has steadily taken share from legacy solutions, such as BlackRock, State Street and SS&C, as they are widely viewed as the premium modern platform. In 2016, private equity firm Welsh, Carson, Anderson & Stowe became the majority investor in the company. In 2020, Warburg Pincus and Permira made minority investments, and, about a year later, these three firms took the company public at $18 per share. Clearwater performed fairly well from its IPO through 2024, supported by consistent growth and historically strong margins that drove a premium valuation relative to peers, and these sponsors were rewarded accordingly. Warburg and Permira, which owned 22%, each sold their positions entirely and WCAS, which owned 56%, reduced its stake to roughly 1% by November 2024, at prices as high as $29.11 per share.Shortly thereafter, the company started making a string of acquisitions — a public company, Enfusion, and two private businesses, Beacon and Bistro. All of these transactions were announced between January and March of this year and closed within the following few months. The consequence of this is that Clearwater shifted from being a clean high-growth vertical software story with strong margins, a premium valuation, and a net cash balance, to a riskier, less certain integration story with leverage around 3x EBITDA. Unsurprisingly, the market questioned the company's decision to change course so sharply as well as its ability to integrate these three acquisitions while continuing to maintain its core organic growth story, and the stock sold off sharply, ultimately reaching a low of $15.73 per share after its third-quarter earnings report last month. Shortly thereafter, it was reported that Clearwater had engaged advisers to evaluate strategic options after receiving a bevy of unsolicited offers from firms like Thoma Bravo and even Warburg Pincus and Permira, both of whom still had representatives on the board. These announcements prompted Starboard to disclose its nearly 5% position in Clearwater and urge the company to run a robust sales process if it has received in-bound interest from potential buyers. But don't misunderstand Starboard's motive or thesis. They are not short-term strategic investors jumping on an opportunity for a quick return. They have likely been looking at Clearwater for many months and had owned it because they like the standalone story and see an opportunity to create long term value. But, to paraphrase the overused quote attributed to Mike Tyson (but really said by Cus D'Amato), everyone has a plan until they get hit. And Starboard is as good as anyone with rolling with the punches. So, when news surfaces that the company is considering a sale and that two of its board members may be bidders, Starboard is doing what any good activist would do and making sure there is a fair process to maximize value for shareholders. Starboard will then decide whether that price is better than the risk adjusted value shareholders could receive from a standalone plan of integrating the acquisitions and growing the core business. Moreover, a credible and fair process could likely attract additional bidders, including strategics such as BlackRock and Nasdaq. While the leveraged buyout math works in the high $20s per share, strategics could push it to a 3 handle.  There could be a quick resolution here if the board decides to sell to the company and receives a bid that is good for everyone. But that is a risky activist thesis on its own. What makes this a good activist campaign for Starboard is that they are a believer in the company as a standalone entity and see a path to create shareholder value. If the standalone path is ultimately pursued, it would make a lot of sense for the private equity investors who no longer own any material position to resign from the board and be replaced with industry experts and a shareholder representative who can guide management through a standalone plan. Essentially, there are three potential outcomes to Clearwater's current inflection point: (i) a standalone plan where the company integrates its acquisitions and grows its core; (ii) a sale of the company for a satisfactory premium following a real and competitive review process; or (iii) an abbreviated sale process orchestrated in part by Warburg and Permira resulting in a sale to Warburg and Permira. Starboard would likely be happy with (i) or (ii) and we expect them to do everything within their power to prevent (iii).Ken Squire is the founder and president of 13D Monitor, an institutional research service on shareholder activism, and the founder and portfolio manager of the 13D Activist Fund, a mutual fund that invests in a portfolio of activist investments.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Activist Starboard reveals 5% stake in Clearwater as tech company reviews its options",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106947175-1632509597147CWAN-OB-Photo-210924-PRESS-11.jpg?v=1755008861&w=1920&h=1080"
      ],
      "datePublished": "2025-12-13T14:21:36.000Z",
      "dateModified": "2025-12-13T14:21:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Korea stocks lead losses in Asia-Pacific ahead of key data from China",
    "url": "https://www.cnbc.com/2025/12/15/asia-markets-live-nikkei-kospi-hang-seng.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108189952-1755938264412-gettyimages-1288284423-vcg111308320551.jpeg?v=1764545862&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T00:32:11.000Z",
    "description": "Aerial view of vehicles being driven on the road through the central business district in Beijing, China. Vcg | Visual China Group | Getty ImagesAsia-",
    "body": "Aerial view of vehicles being driven on the road through the central business district in Beijing, China. Vcg | Visual China Group | Getty ImagesAsia-Pacific markets fell Monday, after Wall Street declined Friday stateside as investors took a breather from the AI trade. \"[Friday] is a value-outperforms-growth day,\" said Jed Ellerbroek, portfolio manager at Argent Capital Management. \"Investors are definitely skittish as it relates to AI — not outright pessimistic, but just kind of, I think, cautious and nervous and hesitant.\"Traders in Asia will also look toward key data from China, which will release its retail sales, fixed asset investment and industrial output numbers for November. South Korea's Kospi fell 2.16% while the small-cap Kosdaq was 1.17% lower. Index heavyweights memory chipmaker SK Hynix was down over 4%, while Samsung Electronics declined 3.3%.Japan announced its fourth-quarter Tankan numbers. The index for business optimism among large Japanese manufacturers increased to +15 for the fourth quarter, hitting the highest level in four years. The latest reading compared  to the +14 increase in the previous quarter, and matched expectations of economists polled by Reuters. The non-manufacturing index for the fourth quarter came in at +34.The Tankan survey, conducted by the Bank of Japan, measures business sentiment among companies in the world's fourth largest economy. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Korea stocks lead losses in Asia-Pacific ahead of key data from China",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108189952-1755938264412-gettyimages-1288284423-vcg111308320551.jpeg?v=1764545862&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T00:32:11.000Z",
      "dateModified": "2025-12-15T00:32:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]