[
  {
    "title": "FAA prohibits most private jets at 12 major airports amid shutdown's air traffic staffing problems",
    "url": "https://www.cnbc.com/2025/11/10/government-shutdown-private-jets.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108020336-1762786883714-108020336-1723645951005-gettyimages-2157473807-20240612-202513.jpg?v=1762786902&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T14:09:59.000Z",
    "description": "A Gulfstream G-IV private jet flies past clouds at sunset on approach to Washington's Reagan National Airport on June 12, 2024, in Arlington, Virginia",
    "body": "A Gulfstream G-IV private jet flies past clouds at sunset on approach to Washington's Reagan National Airport on June 12, 2024, in Arlington, Virginia.J. David Ake | Getty ImagesThe Federal Aviation Administration on Monday will \"effectively prohibit business aviation\" at a dozen major U.S. airports, adding to flight restrictions for commercial airlines as air traffic controller shortages snarl travel in the government shutdown, a trade group said.Last week, the Trump administration ordered U.S. commercial airlines to cut their schedules to ease strains on air traffic controllers who are working without their regular paychecks in the shutdown. Government officials at first didn't curb private flights the same way they did for commercial aviation, though the air traffic controller staffing shortages have slowed travel broadly.The first commercial airline flight cuts of 4% went into affect on Friday and are set to rise to 10% of flights by this coming Friday.More than 4,500 commercial flights were canceled over the weekend and over 17,000 were delayed as staffing shortages worsened around the country, according to FlightAware. Aviation industry members applauded the Senate's progress toward ending the shutdown late Sunday, though a solution for the longest-ever such impasse hasn't been finalized.\"Safety is the cornerstone of business aviation, and NBAA is fully committed to ensuring the safety of the NAS,\" said National Business Aviation Association President and CEO Ed Bolen in a statement late Sunday. \"Among the ways we will do that is to ensure business aviation operators have an understanding of these restrictions and their implications.\"Most business jet operators don't use the busiest commercial airports, said the NBAA. The FAA didn't immediately comment.Here are the airports included in the new restrictions, according to the NBAA:Chicago O'Hare International Airport (ORD)Dallas Fort Worth International Airport (DFW)Denver International Airport (DEN)General Edward Lawrence Logan International Airport (BOS)George Bush Intercontinental Airport (IAH)Hartsfield-Jackson Atlanta International Airport (ATL)John F. Kennedy International Airport (JFK)Los Angeles International Airport (LAX)Newark Liberty International Airport (EWR)Phoenix Sky Harbor International Airport (PHX)Ronald Reagan Washington National Airport (DCA)Seattle-Tacoma International Airport (SEA)Read more CNBC airline newsBoeing stems cash burn for first time since 2023 but takes $4.9 billion charge on 777X delaysAmerican Airlines is late to the luxury travel boom. Can it catch up?American Airlines hires industry veteran to lead commercial team as profits trail rivals",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FAA prohibits most private jets at 12 major airports amid shutdown's air traffic staffing problems",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108020336-1762786883714-108020336-1723645951005-gettyimages-2157473807-20240612-202513.jpg?v=1762786902&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T14:09:59.000Z",
      "dateModified": "2025-11-10T14:09:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nuclear power will get the most Energy Department loans, Chris Wright says",
    "url": "https://www.cnbc.com/2025/11/10/nuclear-power-energy-department-chris-wright-loan-westinghouse-ai-data-center.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108056631-1749047141621-108056631-1730555120683-IMG_5239.jpg?v=1749047154&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T20:17:19.000Z",
    "description": "Cooling towers at the Three Mile Island nuclear power plant in Middletown, Pennsylvania, Oct. 30, 2024.Danielle DeVries | CNBCNuclear power will recei",
    "body": "Cooling towers at the Three Mile Island nuclear power plant in Middletown, Pennsylvania, Oct. 30, 2024.Danielle DeVries | CNBCNuclear power will receive most of the money from the Energy Department's loan office as the Trump administration pushes to quickly break ground on new reactors, Secretary Chris Wright said on Monday.\"We have significant lending authority at the loan program office,\" the Secretary of Energy said at a conference hosted by the American Nuclear Society in Washington D.C. \"By far the biggest use of those dollars will be for nuclear power plants — to get those first plants built.\"President Trump signed an executive order in May that called for the U.S. to break ground on 10 large nuclear reactors by 2030. Alphabet, Amazon, Meta Platforms and Microsoft are investing billions of dollars to restart old nuclear plants, upgrade existing ones, and deploy new reactor technology to meet the electricity demand from artificial intelligence data centers.Wright said he expects electricity demand from AI to attract billions of dollars in equity capital to build new nuclear capacity from \"very creditworthy providers.\" The Energy Department could match those private dollars by as much as four to one with low cost debt financing from the loan office, he said.\"When we leave office three years and three months from now, I want to see hopefully dozens of nuclear plants under construction,\" Wright said.Westinghouse dealThe Trump administration struck a deal last month with the owners of Westinghouse to invest $80 billion to build nuclear plants across the U.S. Westinghouse is owned by uranium miner Cameco and Brookfield Asset Management.Westinghouse has designed a modern reactor called the AP1000 that can power more than 750,000 homes. CEO Dan Sumner said in July that Westinghouse would meet Trump's call to build large new plants with the AP1000 design.Cameco Chief Operating Officer Grant Isaac said last week that the U.S. government has a number of options available to facilitate the financing of Westinghouse reactors, including the Energy Department's loan office.\"We're assured that there is a lot of interest in investing this minimum $80 billion in order to begin the process,\" Isaac told investors on Cameco's third-quarter earnings call.Under the terms of the October deal, Westinghouse could spin out as a separate, publicly-traded company with the U.S. government as a shareholder.But Westinghouse has struggled in the past to build the AP1000 on time and on budget. It went bankrupt in 2017 from cost overruns at big nuclear projects in Georgia and South Carolina.Two AP1000 reactors entered service at Plant Vogtle in Georgia in 2023 and 2024, years behind schedule and billions of dollars over budget. The South Carolina project was cancelled.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nuclear power will get the most Energy Department loans, Chris Wright says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108056631-1749047141621-108056631-1730555120683-IMG_5239.jpg?v=1749047154&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T20:17:19.000Z",
      "dateModified": "2025-11-10T20:17:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Asia-Pacific markets rise, tracking Wall Street gains, on revived AI trade",
    "url": "https://www.cnbc.com/2025/11/11/asia-pacific-markets-tuesday-ai-trade-nikkei-225-hang-seng-index.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223979-1762817121661-gettyimages-1250359232-img_3510.jpeg?v=1762817131&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-11T02:12:30.000Z",
    "description": "A landscaped Sunset shot over Osaka toward the Dojima River, we see the modern city skyline of Osaka in the shot, this is a beautiful shot of the suns",
    "body": "A landscaped Sunset shot over Osaka toward the Dojima River, we see the modern city skyline of Osaka in the shot, this is a beautiful shot of the sunset with beautiful orange colors, over the modern city.©Fitopardo | Moment | Getty ImagesAsia-Pacific markets rose Tuesday after Wall Street gains on revived artificial intelligence optimism and growing hopes that the U.S. government shutdown will end soon.On Monday stateside, Nvidia stocks jumped 5.8% to lead gains on the S&P 500. Other tech stocks rallied, including Google parent Alphabet, which advanced 4%, and Microsoft, which added 1.9% to end its eight-day losing streak.Japan's benchmark Nikkei 225 index climbed 0.91%, while the Topix index was 0.52% higher. AI-related stocks were among the top movers, with conglomerate SoftBank adding 3.57% and chipmaker Renesas Electron jumping 4.35%.Shares of Orix rose 0.49% after the Japanese financial conglomerate announced Tuesday a partnership with Qatar's sovereign wealth fund, Qatar Investment Authority, to launch a $2.5 billion private equity fund.The fund will invest in Japanese companies, \"primarily targeting business succession, privatization of listed companies, and carve-outs,\" valued at least 30 billion yen (about $200 million), Orix said in a press release. Orix and QIA will contribute 60% and 40%, respectively.South Korea's Kospi index rose 1.94%, extending gains for a second straight day after leading an AI recovery rally across the region Monday. Index heavyweights Samsung Electronics added 4.97% while SK Hynix soared 4.62%. The small-cap Kosdaq was up 1.38%.Australia's S&P/ASX 200 rose 0.25%.Hong Kong's Hang Seng Index climbed 0.4%, while the mainland's CSI 300 index was flat.Shares of Chinese electric vehicle maker Xpeng skyrocketed more than 13%, soaring for the second straight day, after it launched robotaxis and humanoid robots with self-developed AI chips at its event last Wednesday. The company's shares had jumped more than 16% in Monday's session.U.S. equity futures were little changed in early Asian hours.Overnight, the Dow Jones Industrial Average climbed 381.53 points, or 0.81%, to end at 47,368.63. The S&P 500 gained 1.54% to settle at 6,832.43, while the Nasdaq Composite advanced 2.27% to finish at 23,527.17.— CNBC's Sean Conlon and Liz Napolitano contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Asia-Pacific markets rise, tracking Wall Street gains, on revived AI trade",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223979-1762817121661-gettyimages-1250359232-img_3510.jpeg?v=1762817131&w=1920&h=1080"
      ],
      "datePublished": "2025-11-11T02:12:30.000Z",
      "dateModified": "2025-11-11T02:12:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump proposes 50-year mortgage, but some say homeowner savings would be minimal",
    "url": "https://www.cnbc.com/2025/11/10/trump-proposes-50-year-mortgage-but-homeowner-savings-could-be-minimal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223684-1762792798653-gettyimages-2244387388-hc100125realestateshift30.jpeg?v=1762792923&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T23:04:55.000Z",
    "description": "In another attempt to make homebuying more affordable, President Donald Trump floated the idea of a 50-year mortgage in a social media post. In respon",
    "body": "In another attempt to make homebuying more affordable, President Donald Trump floated the idea of a 50-year mortgage in a social media post. In response, Federal Housing Finance Agency director Bill Pulte, who oversees Fannie Mae and Freddie Mac, posted that they are \"working on it,\" and that it would be, \"a complete game-changer.\"The purpose of a longer-term mortgage would be to lower the monthly payment for homeowners. The longer the term of the loan, the smaller the principal needed each month to pay it off in full. But such a plan has other trade-offs.Using the latest median sale price of a home from September, $415,200, according to the National Association of Realtors, and the current interest rate of about 6.3%, according to Mortgage News Daily, on a 30-year fixed loan with a 20% down payment, the monthly payment of just principal and interest would be $2,056. If you raise the length to 50 years, at the same interest rate, that payment would be $1,823, a savings of $233 per month.Homeowners, however, would not build equity as quickly because their principal payments would be smaller. The amount of interest paid to lenders would be 40% higher.How it might workThe real question is can Fannie and Freddie do this. Analysts say it is possible, but a 50-year mortgage does not currently meet the definition of a qualified mortgage under the Dodd-Frank Act, which provides investors with a backup from Fannie and Freddie if a loan goes bad. But regulators were given the authority to change that in order to insure mortgage affordability. That, however, could take up to a year, given the need for congressional approval, according to Jaret Seiberg, a financial services and housing policy analyst at TD Cowen.\"Fannie and Freddie could establish a secondary market for 50-year mortgages in advance of policy changes. They even could buy mortgages for their retained portfolios. Yet this would not alter the legal liability for lenders. It is why we believe lenders will not originate 50-year mortgages absent QM [qualified mortgage] policy changes,\" wrote Seiberg in a note to clients.Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.How it would impact ratesThen there is the question of the mortgage rate. The average rate on the 15-year fixed mortgage is currently 66 basis points lower than the rate on the 30-year fixed, according to the Mortgage Bankers Association. This would imply that the rate on the 50-year fixed would be higher. It all depends on investor demand for the product.\"There is not currently a secondary market for such loans, nor would a robust secondary market be cultivated any time soon,\" said Matthew Graham, chief operating officer at Mortgage News Daily. \"That means that, in addition to the extremely low amount of principal paid down in earlier years of the loan, the interest rates would also be quite a bit higher than 30-year loans — a double whammy for those with any hope of building equity.\"Graham said that for all practical purposes, the loan would be more akin to an interest-only loan, because very few people would keep a home for 50 years. Homeowners could still gain equity through home price appreciation, but prices have been softening swiftly across the nation this year, with nowhere near the appreciation seen in the years previous.How it impacts affordabilityEven realtors agree that the savings to homeowners would be minimal.\"This is not the best way to solve housing affordability. The administration would do better to reverse tariff-induced inflation, which is keeping the rates on existing mortgages high,\" wrote Joel Berner, senior economist at Realtor.com in a release.Others note that this new mortgage product would likely depend on Fannie Mae and Freddie Mac remaining under government conservatorship. The Trump administration has said that the two will be taken private and then have an initial public offering sometime in the near future.\"Adoption of a 50-year mortgage product might complicate the path to privatization for Fannie Mae and Freddie Mac,\" analysts at Evercore ISI wrote in a note to clients. \"That said, we understand that the Administration is expecting the GSEs to remain under conservatorship after it sells roughly a 5% stake to the public. This would allow the Administration to maintain control of the GSEs for the foreseeable future.\"Home affordability has been a major pressure point for the Trump administration. Historically low interest rates resulting from pandemic-driven economic policy caused an historic run on housing that catapulted home prices more than 50% higher in just five years. As a result, home sales have weakened dramatically, as has mortgage demand.The average age of a typical first-time buyer in 1991 was 28. By 2024, it had reached 38, according to a report from the National Association of Realtors, whose deputy chief economist called the number, \"shocking.\"The Trump administration has been pressuring builders to put up more homes in order to ease prices, claiming they are sitting on an oversupply of empty lots. Builders contest that claim and continue to cite high costs for land, labor and materials.On the company's latest earnings call, PulteGroup CEO Ryan Marshall said he agreed with the president's perspectives as it pertains to an undersupply of roughly 4 million homes for sale, but added, \"While this supply deficit certainly has an impact on affordability generally, the complexities of the new home construction industry dictate that tackling a problem of this scale requires a coordinated and comprehensive approach that brings together federal, state, and local leaders working in partnership with the new home construction industry.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump proposes 50-year mortgage, but some say homeowner savings would be minimal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223684-1762792798653-gettyimages-2244387388-hc100125realestateshift30.jpeg?v=1762792923&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T23:04:55.000Z",
      "dateModified": "2025-11-10T23:04:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jim Cramer unpacks Monday's market action: 'It's back to business as usual'",
    "url": "https://www.cnbc.com/2025/11/10/jim-cramer-monday-market-action-its-back-to-business-as-usual.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107090862-1658245457554-NUP_198367_01079_copy.jpg?v=1692298238&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T23:09:37.000Z",
    "description": "watch nowCNBC's Jim Cramer analyzed Monday's session, saying stocks — especially tech names — managed to rebound from last week as Wall Street sees an",
    "body": "watch nowCNBC's Jim Cramer analyzed Monday's session, saying stocks — especially tech names — managed to rebound from last week as Wall Street sees an end to the government shutdown.\"With the government potentially about to reopen, it's back to business as usual, and that means the data center stocks come roaring back,\" he said.The indexes climbed during the session, with the Dow Jones Industrial Average finishing up 0.81%, the S&P 500 adding 1.54% and the tech-heavy Nasdaq Composite gaining 2.27%. After weeks of deadlock, lawmakers took steps towards reaching a deal that would pass a federal funding bill and end the shutdown.The market suffered last week in part because investors worried about the ongoing government shutdown, Cramer suggested, which was crippling air travel and weakening consumer confidence. The shutdown could wreck GDP growth during the holidays, he added, which is large part of the economy. But at the first sign of a deal, Cramer continued, money came \"pouring back into the stock market.\"Cramer also noted that many investors last week grew wary of the enormous valuations of certain artificial intelligence stocks, including industry leaders Nvidia and Palantir. But stocks related to the data center popped on Monday, with Nvidia jumping 5.79% and Palantir adding 8.81%. Cramer suggested some of these companies saw gains because it seems that hyperscalers won't stop AI buildout for fear \"they'll be left in the dust by competition.\"\"As much as the stock market seems nuts, it's not as nuts as you think,\" he said. \"That's what everyone who shorted the AI plays found out today.\"watch nowSign up now for the CNBC Investing Club to follow Jim Cramer's every move in the market.Disclaimer The CNBC Investing Club Charitable Trust owns shares of Nvidia.Questions for Cramer? Call Cramer: 1-800-743-CNBCWant to take a deep dive into Cramer's world? Hit him up! Mad Money Twitter - Jim Cramer Twitter - Facebook - InstagramQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jim Cramer unpacks Monday's market action: 'It's back to business as usual'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107090862-1658245457554-NUP_198367_01079_copy.jpg?v=1692298238&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T23:09:37.000Z",
      "dateModified": "2025-11-10T23:09:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Warren Buffett to step up giving away fortune to his children’s foundations, while supporting successor Abel",
    "url": "https://www.cnbc.com/2025/11/10/warren-buffett-to-step-up-giving-away-fortune-to-his-childrens-foundations-while-supporting-successor-abel.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108140466-1746282269761-Screenshot_2025-05-03_at_102321_AM.jpg?v=1746282310&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T18:32:55.000Z",
    "description": "Warren Buffett laid out a plan to \"step up\" the pace of giving away his $149 billion estate to his children's foundations, while still allowing for a ",
    "body": "Warren Buffett laid out a plan to \"step up\" the pace of giving away his $149 billion estate to his children's foundations, while still allowing for a short period that lets Berkshire Hathaway shareholders gain confidence in incoming CEO Greg Abel.Buffett, in a Thanksgiving letter that will become an annual tradition, said he needs to accelerate the disbursement of his Berkshire stock to his three children's foundations because of their own advanced ages and that by doing so it will \"improve the probability that they will dispose of what will essentially be my entire estate before alternate trustees replace them.\"Abel, 63, is set to take over for Buffett, 95, as Berkshire CEO at the start of the new year with the \"Oracle of Omaha\" remaining chairman.\"I would like to keep a significant amount of 'A' shares until Berkshire shareholders develop the comfort with Greg that Charlie and I long enjoyed,\" wrote Buffett, referring to longtime Berkshire vice chairman and his cherished business partner, Charlie Munger, who died two years ago.  \"That level of confidence shouldn't take long. My children are already 100% behind Greg as are the Berkshire directors,\" said Buffett.Buffett owns about $149 billion worth of Berkshire based on shares held at the end of the second quarter, making him far and away the largest shareholder. Most of his wealth is in the original A shares which trade for around $751,480 a share.He said 1,800 of those Berkshire A shares were converted into 2.7 million B shares and given Monday to four family foundations: The Susan Thompson Buffett Foundation, The Sherwood Foundation, The Howard G. Buffett Foundation and the NoVo Foundation. This donation is worth more than $1.3 billion.\"The acceleration of my lifetime gifts to my children's foundations in no way reflects any change in my views about Berkshire's prospects,\" added Buffett.The note marks Buffett's first major communication since announcing plans to step down as CEO, signaling the close of a six-decade run that made him a household name and one of the most successful investors in history.\"As the British would say, I'm 'going quiet.'... sort of,\" Buffett wrote in the letter.'I Generally Feel Good'Abel, currently vice chairman of noninsurance operations, will take over writing Berkshire's annual shareholder letters — a tradition that Buffett began in 1965 and that has become essential reading across Wall Street — while Buffett said he will continue this Thanksgiving message.In one of the most personal passages of the letter, Buffett gave a rare update on his health.\"To my surprise, I generally feel good. Though I move slowly and read with increasing difficulty, I am at the office five days a week where I work with wonderful people,\" he wrote. \"I was late in becoming old ... but once it appears, it is not to be denied.\"The Berkshire FortressSince taking control of Berkshire in 1965, Buffett has transformed a struggling textile mill into a $1 trillion conglomerate spanning insurance, railroads, utilities and consumer brands.He devoted part of his letter to reaffirming Berkshire's durability, saying it is designed to withstand nearly any economic environment.\"Berkshire has less chance of a devastating disaster than any business I know,\" he said.Berkshire held a record $381.6 billion in cash at the end of September, underscoring its unmatched balance sheet and cautious investing approach. It has also been selling equities for 12 straight quarters, reflecting Buffett's caution in a richly valued market.The company's underlying businesses remain strong with operating profit jumping 34% in the third quarter. Still, Buffett acknowledged that Berkshire's sheer scale has become both its strength and its limitation.\"In aggregate, Berkshire's businesses have moderately better-than-average prospects, led by a few non-correlated and sizable gems. However, a decade or two from now, there will be many companies that have done better than Berkshire; our size takes its toll,\" he wrote.Berkshire's stock has risen roughly 10% in 2025, outpacing many defensive names but lagging the S&P 500 amid a tech-driven rally.\"Our stock price will move capriciously, occasionally falling 50% or so as has happened three times in 60 years under present management,\" Buffett said. \"Don't despair; America will come back and so will Berkshire shares.\"— With reporting by Becky Quick.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Warren Buffett to step up giving away fortune to his children’s foundations, while supporting successor Abel",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108140466-1746282269761-Screenshot_2025-05-03_at_102321_AM.jpg?v=1746282310&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T18:32:55.000Z",
      "dateModified": "2025-11-10T18:32:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sony raises profit forecast after earnings beat, lifted by music and imaging divisions",
    "url": "https://www.cnbc.com/2025/11/11/sony-group-second-quarter-september-quarter-profits-expectations-kpop-demon-hunter-playstation.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108145179-1747201501384-gettyimages-2178094207-JAPAN_CEATEC.jpeg?v=1762823635&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-11T04:12:08.000Z",
    "description": "The Sony Group Corp. logo displayed on a screen at the Combined Exhibition of Advanced Technologies (Ceatec) in Chiba, Japan, on Wednesday, Oct. 16, 2",
    "body": "The Sony Group Corp. logo displayed on a screen at the Combined Exhibition of Advanced Technologies (Ceatec) in Chiba, Japan, on Wednesday, Oct. 16, 2024. Bloomberg | Bloomberg | Getty ImagesSony Group on Tuesday reported an increase in its second-quarter operating profit that beat expectations, while announcing a share buyback of up to 100 billion Japanese yen ($648 million).Here are Sony's second-quarter results compared with LSEG SmartEstimates, which are weighted toward forecasts from analysts who are more consistently accurate: Revenue: 3.108 trillion Japanese yen vs. 2.985 trillion yen expectedOperating profit: 429 billion yen vs. 398.44 billion yen expectedSony's operating profit jumped 10% compared to the same period last year, while revenues were up 5%.Following the earnings announcement, Sony's shares were trading up 4%.Stock Chart IconStock chart iconThe Japanese technology giant raised its full-year outlook, expecting operating profit to climb by 100 billion yen, or 8% from its previous forecast,  driven by gains from its Imaging & Sensing Solutions and Music segments. The company also lifted its annual revenue projection by 300 billion yen, or 3%, while trimming its estimate of tariff-related losses to 50 billion yen from 70 billion yen.Profit from Sony's music business increased 27.65% year over year to 115.4 billion yen. Meanwhile, its imaging business earned 138.3 billion in profits, up nearly 50% from last year, making it the company's most profitable segment in the quarter.Sony's Imaging & Sensing Solutions segment develops and manufactures advanced semiconductor products for a wide range of applications, from smartphones to automotive and industrial systems.Sony also reported strong sales in its game and network services division, which houses its popular PlayStation home console brand. The segment represents Sony's top revenue driver, but posted a decrease in profits in the September quarter, falling 13.26% to 120.4 billion yen.Game and network services have performed well in recent quarters thanks to a shift to digital game purchases and the PlayStation Plus subscription service. Growth in hardware shipments has been comparably muted.KPop Demon HuntersDespite Sony's strong showing, its picture business sales shrank about 2.75% year over year. That was despite Sony Pictures Animation being behind this year's smash hit production, KPop Demon Hunters, which premiered on June 20. The film, which was produced by Sony, has reportedly become the most popular Netflix film ever, and continues to break streaming records, even for its original soundtrack. Despite the success, Sony has missed much of this upside due to selling the film's exclusive rights to Netflix.While the exact details of the deal are unknown, it was reported that Sony made an initial $25 million profit from producing the film for Netflix.Netflix saw KPop Demon Hunters drive significant viewership and even contribute to its 17% revenue jump in its September quarter.However, in a bright spot for Sony, a sequel to the movie has already been confirmed, with Netflix reportedly providing the Japanese company a $15 million cash bonus for the first film's performance. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sony raises profit forecast after earnings beat, lifted by music and imaging divisions",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108145179-1747201501384-gettyimages-2178094207-JAPAN_CEATEC.jpeg?v=1762823635&w=1920&h=1080"
      ],
      "datePublished": "2025-11-11T04:12:08.000Z",
      "dateModified": "2025-11-11T04:12:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Restaurant Brands International to form joint venture for Burger King China to accelerate expansion",
    "url": "https://www.cnbc.com/2025/11/10/restaurant-brands-international-to-form-burger-king-china-joint-venture-with-cpe.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223560-1762781938680-gettyimages-2176944185-img_3356_1iul3vkx.jpeg?v=1762781967&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T14:19:45.000Z",
    "description": "People walk past a Burger King restaurant with Chinese national flags displayed on a street during the National Day Golden Week holiday on October 5, ",
    "body": "People walk past a Burger King restaurant with Chinese national flags displayed on a street during the National Day Golden Week holiday on October 5, 2024, in Chongqing, China. Cheng Xin | Getty ImagesRestaurant Brands International on Monday announced that it will form a joint venture with CPE, a Chinese alternative asset manager, to run Burger King's restaurants in China.Earlier this year, a subsidiary of Restaurant Brands acquired its equity interests from its previous Burger King China partners, Turkish-based operator TFI and U.S.-based private equity firm Cartesian Capital, for roughly $158 million in cash. At the time, the company said it planned to find a local operator as a partner.Under the terms of the deal, CPE will own roughly 83% of Burger King China. Restaurant Brands will hold a minority stake of about 17%, along with a seat on the board of directors.When the deal closes, CPE plans to invest $350 million into the joint venture. That investment will go toward a number of areas, from marketing to menu innovation, as well as restaurant expansion. Over the next decade, the joint venture aims to more than double the burger chain's footprint in the market, from about 1,250 locations today to more than 4,000 by 2035.\"CPE is a well-capitalized, proven operator with exceptional leadership and extensive consumer and restaurant experience, making them an ideal partner to fuel the next chapter of Burger King China's growth,\" Restaurant Brands CEO Josh Kobza said in a statement.The deal is expected to close in the first quarter of 2026, pending regulatory approval.For decades, China's massive population and fast-growing economy have made it an attractive market for U.S. companies, including restaurant chains. But in recent years, an economic slowdown have made some companies rethink their strategies. A week ago, Starbucks announced plans to form its own joint venture for its China business with Boyu Capital, a local alternative asset management firm.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Restaurant Brands International to form joint venture for Burger King China to accelerate expansion",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223560-1762781938680-gettyimages-2176944185-img_3356_1iul3vkx.jpeg?v=1762781967&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T14:19:45.000Z",
      "dateModified": "2025-11-10T14:19:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kia previews next-gen Telluride SUV as 'new benchmark' for brand",
    "url": "https://www.cnbc.com/2025/11/10/kia-telluride-suv.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222414-1762444817459-Telluride.png?v=1762444833&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T17:00:01.000Z",
    "description": "2027 Kia TellurideKiaDETROIT – Kia on Monday previewed its next-generation Telluride SUV that the company is describing as a \"new benchmark for the br",
    "body": "2027 Kia TellurideKiaDETROIT – Kia on Monday previewed its next-generation Telluride SUV that the company is describing as a \"new benchmark for the brand's design and ambition.\"The first-generation Telluride has been a standout success for the South Korean car brand since it launched in 2019, at many times ranking as one of the most highly in-demand vehicles in the U.S., based on inventory levels. It's a crucial vehicle for the company in the U.S.Kia said the 2027 Telluride, which is expected to arrive in U.S. showrooms during the first quarter, has a larger, boxier and more modern design overall compared with the current model.The new front end features a large front grille encompassed by vertical headlamps, while the rear of the vehicle features a sleek design and silhouette reminiscent of a Range Rover.2027 Kia TellurideKiaThe company on Monday released images of a Telluride X-Pro model ahead of the three-row midsize SUV's official debut later this month at the Los Angeles Auto Show, where more trims and details of the vehicle will be released.Sales of the Telluride have increased every year since its launch in 2019, with Kia selling more than 444,000 units in total, according to the company. The vehicle's sales are up 11% year to date through October, according to Kia.Kia offers the current Telluride in 10 trim levels, with starting pricing between $36,000 and $54,000.A new version of the Hyundai Palisade, which is a sibling vehicle to the Kia Telluride, was released earlier this year and starts between $39,000 and $55,000, depending on trim.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kia previews next-gen Telluride SUV as 'new benchmark' for brand",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222414-1762444817459-Telluride.png?v=1762444833&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T17:00:01.000Z",
      "dateModified": "2025-11-10T17:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paramount Skydance expects another $1B in merger savings as David Ellison resets spending",
    "url": "https://www.cnbc.com/2025/11/10/paramount-skydance-psky-earnings-merger-savings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222322-17624361382025-10-23t100344z_254581015_rc27rbao75rn_rtrmadp_0_warner-bros-dis-sale-paramount-skydance.jpeg?v=1762436194&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T22:45:28.000Z",
    "description": "Paramount Global and Skydance logos are seen in this illustration taken December 17, 2024. Dado Ruvic | ReutersParamount Skydance said on Monday it ex",
    "body": "Paramount Global and Skydance logos are seen in this illustration taken December 17, 2024. Dado Ruvic | ReutersParamount Skydance said on Monday it expects $1 billion more in merger savings than it previously forecast as it outlines CEO David Ellison's ambitions for the company.The update came in Paramount's third-quarter earnings report — the company's first since its merger closed in early August. Ellison has been investing heavily in streaming and content, including live sports rights, and paying for it in part with cuts to other parts of the business.Paramount on Monday announced a new round of layoffs, affecting roughly 1,600 employees, tied to divestitures of assets in Argentina and Chile. Those cuts come weeks after Paramount began the process to lay off approximately 1,000 employees.At the same time, Paramount said it plans to increase prices for its flagship streaming service, Paramount+, in the first quarter of next year as it looks to beef up its content slate and improve its the technology of the platform.Paramount last raised its streaming prices in June 2024, after a previous hike in early 2023.Shares of the company were up about 6% in extended trading Monday.Cutting to growIn Monday's letter to shareholders, Ellison mapped out the combined company's initiatives, which he referred to as Paramount Skydance's \"North Star priorities.\" Those include investing in its growth businesses, growing its streaming business globally and identifying savings that would lead to \"long-term free cash flow generation.\"While Paramount Skydance management told investors in August they planned $2 billion in cost savings, that was upped to \"at least $3 billion in run-rate efficiencies\" as of Monday's report. More than $1.4 billion of those savings will be done by the end of the year and an additional $1 billion by the end of 2026, according to the letter.The company has been shedding staff. Less than a month after the merger was completed, the company alerted employees that it would be mandating a five-day work week beginning in January and would offer employees a buyout if they didn't want to make the transition. According to Monday's letter, about 600 employees chose to exit the company rather than return to an office full-time.The company also identified parts of its South American business to cut and said Monday it divested Television Federal, the operator of TV stations in Buenos Aires and other markets in Argentina. It's also in the process of exiting Chilevision in Chile, which is expected to be completed in the first quarter of 2026.These divestitures, which were deemed \"non-core\" to the company's future growth, according to the letter, would result in the 1,600 workforce reductions.Streaming, content in focusParamount Skydance CEO David Ellison speaks during the Bloomberg Screentime conference in Los Angeles on October 9, 2025. Patrick T. Fallon | Afp | Getty ImagesWhile Paramount Skydance's restructuring efforts, layoffs and cost savings have been a top priority for the company, Ellison has also wasted no time in making acquisitions to build up its content slate.Most notably, the company has reportedly been looking to acquire Warner Bros. Discovery in a deal that would see it gain the Warner Bros. film studio, the HBO Max streaming service, and a portfolio of cable TV networks including CNN and TNT Sports. Warner Bros. Discovery recently put itself up for sale, and has rebuffed three offers from Ellison in recent weeks, CNBC reported.Ellison wouldn't comment on his aspirations for WBD on Monday, but said the company was in build mode, which may or may not include mergers and acquisitions.\"I think it's important to know there's no must-haves for us,\" he said. \"We really look at this as buy versus build, and we absolutely have the ability to build to get to where we want to go.\" On the sports front, Paramount Skydance has added TKO Group's UFC to its slate in a 7-year, $7.7 billion deal. Paramount+ also became the exclusive long-term home for Zuffa Boxing, a new professional boxing promotion formed by TKO and the Saudi-backed Sela, in the U.S., Canada and Latin America.The company also inked a deal with Activision to develop content off of its Call of Duty video game franchise; signed a 5-year exclusive agreement with the creators of \"South Park;\" and brought on Matt and Ross Duffer, the creative team behind Netflix's hit \"Stranger Things,\" beginning in mid-2026.The additions to its content slate are geared at boosting Paramount+ streaming subscribers. Paramount Skydance President Jeff Shell said during a call with investors that the service had experienced notable customer losses over the summer, but they returned in the fall at the start of the NFL season.On Monday, the company said Paramount+ had more than 79 million global subscribers. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paramount Skydance expects another $1B in merger savings as David Ellison resets spending",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222322-17624361382025-10-23t100344z_254581015_rc27rbao75rn_rtrmadp_0_warner-bros-dis-sale-paramount-skydance.jpeg?v=1762436194&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T22:45:28.000Z",
      "dateModified": "2025-11-10T22:45:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo announces new CFO Steve Fieler",
    "url": "https://www.cnbc.com/2025/11/10/waymo-announces-new-cfo-steve-fieler.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107415588-1715806913957-gettyimages-2152551972-AFP_34RN64Z.jpeg?v=1762798148&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T19:10:38.000Z",
    "description": "A Waymo autonomous self-driving Jaguar electric vehicle sits parked at an EVgo charging station in Los Angeles, California, on May 15, 2024.Patrick T.",
    "body": "A Waymo autonomous self-driving Jaguar electric vehicle sits parked at an EVgo charging station in Los Angeles, California, on May 15, 2024.Patrick T. Fallon | AFP | Getty ImagesWaymo has tapped Google executive Steve Fieler as its new chief financial officer, the self-driving company announced on Monday.The new CFO comes as the Alphabet-owned company has been bringing its robotaxi service to more markets in the past year, with plans for further expansion in 2026. Fieler's appointment also comes as Waymo looks toward its next phase, which could include seeking additional outside investment.\"Steve's extensive experience will be instrumental in guiding us through this next chapter,\" Waymo co-CEO Tekedra Mawakana said in a LinkedIn post.Mawakana also thanked previous Waymo finance chief Elisa de Martel for serving in the role since her appointment in 2022. Waymo declined to elaborate on de Martel, and de Martel did not respond to a request for comment. \"We're wishing her the best as she embarks on her next chapter,\" Mawakana wrote. Fieler was a key member of Google's CFO leadership team, where he served as vice president of planning, investments and investor relations, according to Waymo. Prior to that, Fieler worked as business finance officer for Google's \"Platforms and Ecosystems\" unit, responsible for products including Android and Chrome.Prior to Google, Fieler served as finance chief at HP. He's also held various positions at various early-stage companies and at General Electric, according to his LinkedIn profile.Alphabet's segment \"Other Bets,\" which includes the Waymo unit, reported revenue of $344 million during the third quarter, down from $388 million the year prior. Losses also grew from $1.12 billion last year in the third quarter to $1.43 billion in the same period this year.Waymo now offers a commercial service in the Los Angeles area, Phoenix, San Francisco, Atlanta and Austin. The company has also announced plans to start robotaxi services in Miami and Washington, D.C., in 2026, and Waymo said in August that it obtained permits to begin testing its autonomous vehicles with trained safety drivers in New York City.WATCH: Exclusive: Amazon just launched its Zoox robotaxis in Las Vegas and we took a ridewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo announces new CFO Steve Fieler",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107415588-1715806913957-gettyimages-2152551972-AFP_34RN64Z.jpeg?v=1762798148&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T19:10:38.000Z",
      "dateModified": "2025-11-10T19:10:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tesla investor support for Elon Musk's massive pay plan was lower in 2025 than in 2018",
    "url": "https://www.cnbc.com/2025/11/10/tesla-investor-support-for-musk-pay-plan-declined-from-2018-package.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222736-1762470015629-Screenshot_2025-11-06_at_51201_PM.png?v=1762470059&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-11T02:53:27.000Z",
    "description": "Elon Musk, CEO of Tesla, speaks during the 2025 Annual Shareholder Meeting on Nov. 6, 2025.Courtesy: TeslaTesla shareholders voted last week to give C",
    "body": "Elon Musk, CEO of Tesla, speaks during the 2025 Annual Shareholder Meeting on Nov. 6, 2025.Courtesy: TeslaTesla shareholders voted last week to give CEO Elon Musk a record pay package, one that could net him about $1 trillion in company stock over the next decade. But Musk received less support than he did for an earlier pay plan in 2018.Setting aside holdings owned by board members and executives, about 66.9% of shares tabulated in the vote were in favor of the package, according to a filing on Friday. When shareholders voted on the 2018 plan, that number was 73%, according to an analysis by Andrew Droste, head of corporate governance at investment firm Columbia Threadneedle.In announcing the preliminary results on Thursday at the company's annual shareholders meeting, Tesla said the plan received 75% support among voting shares. The company count included insiders like Musk, who held around a 15% stake in Tesla going into the proxy and was allowed to vote his shares.The decline from the prior vote follows a tumultuous stretch for Musk and Tesla. Sales slumped in the first half of the year, in part because of Musk's inflammatory political rhetoric and his work for the Trump administration, slashing the size of the federal government. Tesla's brand value has also deteriorated.Still, Droste said in an email that even at just under 70%, the vote represents \"broad support for Elon among Tesla's shareholder base.\" Most investors recognize that Tesla and Elon Musk are \"inextricably linked,\" he wrote, and were \"unwilling to risk his potential departure by allowing this vote to fail.\"Board members recommended shareholders approve the pay plan, which they introduced in September. Top proxy advisors Glass Lewis and ISS had recommended that investors vote against it.The pay package for Musk, already the world's richest person, consists of 12 tranches of shares to be granted if Tesla hits certain milestones over the next decade. The first tranche of stock gets paid out if Tesla hits a market capitalization of $2 trillion, about $500 billion more than the current valuation. Awards tied to market cap gains are paired with operational achievements.Musk could still collect more than $50 billion by hitting a handful of the more attainable goals laid out for him by the board in the new pay plan. There are also a list of \"covered events\" in the award terms that would allow him to earn his shares without meeting required operational milestones.Tesla didn't immediately respond to a request for comment.Correction: A prior version of this story had an incorrect figure for the vote in support of the pay package.WATCH: Key milestones behind Musk's pay packagewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tesla investor support for Elon Musk's massive pay plan was lower in 2025 than in 2018",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222736-1762470015629-Screenshot_2025-11-06_at_51201_PM.png?v=1762470059&w=1920&h=1080"
      ],
      "datePublished": "2025-11-11T02:53:27.000Z",
      "dateModified": "2025-11-11T02:53:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Senate passes bill to end government shutdown, sending it to House",
    "url": "https://www.cnbc.com/2025/11/10/government-shutdown-republicans-senate-house-snap.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223634-1762789134228-gettyimages-2245498756-AFP_83LQ9GD.jpeg?v=1762789149&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-11T03:06:46.000Z",
    "description": "US Speaker of the House Mike Johnson, Republican from Louisiana, speaks during a news conference on day 41 of the federal government shutdown, at the ",
    "body": "US Speaker of the House Mike Johnson, Republican from Louisiana, speaks during a news conference on day 41 of the federal government shutdown, at the US Capitol on November 10, 2025, in Washington, DC. Saul Loeb | Afp | Getty ImagesThe Senate on Monday night passed a bill to fund the government and end the longest shutdown in U.S. history.The bill, which passed 60-40 with the support of a handful of Democratic senators and nearly all Republicans, will be sent to the House of Representatives.If it passes the House, the deal will head to President Donald Trump to be signed into law. Trump said earlier Monday that he approves the funding deal, which was negotiated between Republicans and a gang of moderate Senate Democrats.But House Speaker Mike Johnson, R-La., added uncertainty to the fate of the deal when he refused to commit to a key guarantee in the deal, of assuring Democrats that Congress will hold a separate vote in December on potentially extending enhanced Affordable Care Act subsidies.\"I'm not committing to it or not committing to it,\" Johnson said on CNN.Johnson on Monday called for House members to begin traveling to Washington, D.C., so that they can vote as soon as possible on the Senate deal.Johnson spoke to reporters a day after the Senate narrowly approved the first stage of the deal to reopen the government, which shut down on Oct. 1.Johnson indicated to reporters that he expected votes in the House to occur this week, but he did not state a specific day. He later told the Republican House conference during a call that he would like the vote to occur on Wednesday, according to a person familiar with the situation.The speaker said he would issue an official 36-hour notice before the House votes.Johnson said, \"There'll be long days and long nights here for the foreseeable future to make up for all this lost time that was imposed upon us.\"Johnson has kept the House out of session since it passed a continuing resolution in September to fund the government through mid-November.A vote to advance the Senate deal, forged over the weekend, drew support from seven Democrats and one independent who caucuses with Democrats. Those votes, combined with the support of 52 Republican senators, was enough to reach a 60-vote threshold to pass.The deal does not include what had been the key demand for Democrats: an extension of enhanced Affordable Care Act tax credits, which are due to expire at the end of December.But the agreement, for the first time since the shutdown began, includes a guarantee by Republicans of a vote in December on a bill chosen by Democrats to extend those subsidies, which more than 20 million Americans use to reduce the cost of health insurance plans purchased on ACA marketplaces.Read more CNBC government shutdown coverageDuffy warns air travel will be ‘reduced to a trickle’ as the shutdown drags onTrump tells Republicans to send health insurance money 'directly to the people'Food banks in ‘disaster response mode’ due to shutdown, SNAP cuts, leaders saySenate Republicans reject Democrat deal to reopen governmentDemocratic leader offers deal to reopen government but Republicans sneerTrump admin asks Supreme Court to block order it pay full SNAP benefitsSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key racesThe Senate deal would fund the government through the end of January; reverse all shutdown-related layoffs of federal employees; and guarantee that all federal workers will be paid their normal salaries during the shutdown.The deal also includes provisions for a bipartisan budget process and prevents the White House from using continuing resolutions to fund the government. CRs have been repeatedly used to avoid government shutdown, but are controversial because they frequently avoid lawmakers having to make decisions about long-term funding of the government that a normal budget would resolve.The deal would also fund, through September, the SNAP program, which helps feed 42 million Americans through food stamps.Under a federal law passed in 2019, government employees who are furloughed during a shutdown must be paid for the time they were out of work at their standard rate of pay \"at the earliest date possible, regardless of scheduled pay dates.\"— CNBC's Emily Wilkins contributed to this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Senate passes bill to end government shutdown, sending it to House",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223634-1762789134228-gettyimages-2245498756-AFP_83LQ9GD.jpeg?v=1762789149&w=1920&h=1080"
      ],
      "datePublished": "2025-11-11T03:06:46.000Z",
      "dateModified": "2025-11-11T03:06:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SNAP: Trump admin tells Supreme Court it still wants to block full food stamp payments",
    "url": "https://www.cnbc.com/2025/11/10/snap-benefits-appeals-trump-food-stamps-supreme-court.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223582-1762784676567-gettyimages-2244643566-ah809768.jpeg?v=1762784703&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T15:36:36.000Z",
    "description": "Police officers stand guard outside the Supreme Court on November 5, 2025 in Washington, DC. Andrew Harnik | Getty ImagesThe Trump administration told",
    "body": "Police officers stand guard outside the Supreme Court on November 5, 2025 in Washington, DC. Andrew Harnik | Getty ImagesThe Trump administration told the Supreme Court on Monday morning that it still wants a block on a Rhode Island federal judge's order mandating that it pay 42 million Americans their full SNAP benefits for November.The message came a day after the 1st Circuit U.S. Court of Appeals in Boston, for a second time, flatly rejected a request by the Trump administration to stay that order pending its full appeal of the decision.That judge's order remains temporarily paused as a result of a prior ruling by Supreme Court Justice Ketanji Brown Jackson.But Jackson on Monday told the Trump administration to inform the Supreme Court by 11 a.m. ET whether it intends to continue to seek a stay of the order. The administration quickly did so, and said it would comply with her directive to file a supplemental brief on the request by 4 p.m. Monday. Plaintiffs in the case were told to respond by 8 a.m. on Tuesday.Separately on Monday, a federal judge in Massachusetts issued an order blocking the Trump administration's memo over the weekend telling states that they had to \"undo\" any full SNAP benefits payments to recipients, or face financial penalties.The ruling Sunday night by a three-judge panel of the 1st Circuit Court of Appeals came a day after the U.S. Department of Agriculture issued that memo.And it came hours after the Senate narrowly passed the first step of a bipartisan deal that might reopen the government within days, and fully fund the Supplemental Nutrition Assistance Program through next September.\"In reviewing the district court's balancing of the equities, we also cannot ignore the particular events preceding this litigation,\" wrote Circuit Court Judge Julie Rikelman in the panel's decision Sunday. \"As the district court found, 'this is a problem that could have been avoided.'\"\"The record here shows that the government sat on its hands for nearly a month, unprepared to make partial payments, while people who rely on SNAP received no benefits a week into November and counting,\" Rikelman wrote.\"In light of these unique facts, we cannot conclude that the district court abused its discretion in requiring full payment of November SNAP benefits to effectuate the October 31 [temporary restraining order] after the government had failed to comply with it.\"The Trump administration on Oct. 24 broke decades of precedent when it said it would not pay SNAP benefits in November because Congress had not appropriated money for the program, or any other government program, past the date the shutdown began, Oct. 1. Past administrations had paid SNAP benefits in full during other shutdowns.Read more CNBC government shutdown coverageDuffy warns air travel will be ‘reduced to a trickle’ as the shutdown drags onTrump tells Republicans to send health insurance money 'directly to the people'Food banks in ‘disaster response mode’ due to shutdown, SNAP cuts, leaders saySenate Republicans reject Democrat deal to reopen governmentDemocratic leader offers deal to reopen government but Republicans sneerTrump admin asks Supreme Court to block order it pay full SNAP benefitsSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key racesThe administration rejected the idea of using the remaining $4.6 billion in a contingency fund that Congress had specifically allocated to backstop SNAP.A group of plaintiffs, comprised of nonprofits, local governments, a union and a food retailer, sued the administration in U.S. District Court in Rhode Island seeking a judicial order forcing the administration to use the contingency fund and other pools of money to fully fund SNAP benefits.Judge Jack McConnell, who is overseeing the case, ordered the administration to make at least partial benefits as soon as possible by tapping the contingency fund, and to investigate if other money could be used.McConnell on Thursday ordered that the administration pay full benefits, days after the administration told him it would pay only partial benefits — but that it would take some time to do so — and told him that it had ruled out using so-called Section 32 funds.McConnell ordered that the administration use Section 32 funds to make up the difference between the 65% of benefits the administration planned to pay by using the contingency fund and the full value of the benefits. SNAP benefits cost about $8 billion each month.The administration then asked the 1st Circuit for a temporary stay of McConnell's order on an emergency basis, which the appeals court rejected Friday.But the appeals court at the same time also said it was still considering the \"government's motion for a stay pending appeal [of McConnell's order] ... and we intend to issue a decision on that motion as quickly as possible.\"On Friday night, Jackson, acting on a request by the administration, paused McConnell's order from taking effect and told the 1st Circuit to quickly rule on the request for the stay pending appeal.Jackson's order paused for 48 hours any ruling by the 1st Circuit from taking effect.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SNAP: Trump admin tells Supreme Court it still wants to block full food stamp payments",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223582-1762784676567-gettyimages-2244643566-ah809768.jpeg?v=1762784703&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T15:36:36.000Z",
      "dateModified": "2025-11-10T15:36:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Democratic senators blame White House, AI data centers for rising electricity prices",
    "url": "https://www.cnbc.com/2025/11/10/democratic-senators-blame-white-house-ai-data-centers-for-rising-electricity-prices.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223939-1762812728666-gettyimages-2238189324-ah804143.jpeg?v=1762812770&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T23:36:00.000Z",
    "description": "Sen. Richard Blumenthal (D-CT) speaks to reporters outside the Senate Chamber of the U.S. Capitol Building on Oct. 1, 2025 in Washington, DC.Andrew Ha",
    "body": "Sen. Richard Blumenthal (D-CT) speaks to reporters outside the Senate Chamber of the U.S. Capitol Building on Oct. 1, 2025 in Washington, DC.Andrew Harnik | Getty ImagesDemocratic senators on Monday blamed the White House push to fast track artificial intelligence data centers and its attacks on renewable energy for rising electricity prices in certain parts of the U.S.Sen. Richard Blumenthal of Connecticut, Sen. Bernie Sanders of Vermont and others demanded that the White House and Commerce Department detail what actions they have taken to shield consumers from the impact of massive data centers in a letter sent Monday.Voters are increasingly feeling the pinch of rising electricity prices. Democrats Mikie Sherrill and Abigail Spanberger campaigned on the issue in the New Jersey and Virgina governors' races, which they won in landslides last week.The senators took aim at the White House's relationship with companies like Meta, Alphabet, Oracle, and OpenAI, and the support the administration has shown for the companies' data center plans.The Trump administration \"has already failed to prevent those new data centers from driving up electricity prices from a surge of new commercial demand,\" the senators wrote. They accused the White House of making the problem worse by opposing the expansion of solar and wind power.The White House blamed the Biden administration and its renewable energy policies for driving up electricity prices in a statement.President Donald Trump \"declared an energy emergency to reverse four years of Biden's disastrous policies, accelerate large-scale grid infrastructure projects, and expedite the expansion of coal, natural gas, and nuclear power generation,\" White House spokeswoman Taylor Rogers said.The tech sector's AI plans have ballooned in size. OpenAI and Nvidia, for example, struck a deal in September to build 10 gigawatts of data centers to train and run AI applications. This is equivalent to New York City's peak baseline summer demand in 2024.The scale of these plans have raised questions about whether enough power is available to meet the demand and who will pay for the new generation that is needed. Renewable energy, particularly solar and energy storage, is the power source that can be deployed the quickest right now to meet demand.Retail electricity prices in the U.S. increased about 6% on average through August 2025 compared with the same period in 2024, according to the Energy Information Administration. Prices, however, can vary widely by region.Download the full letter here. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Democratic senators blame White House, AI data centers for rising electricity prices",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223939-1762812728666-gettyimages-2238189324-ah804143.jpeg?v=1762812770&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T23:36:00.000Z",
      "dateModified": "2025-11-10T23:36:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]