[
  {
    "title": "In a one-sided relationship with an AI chatbot? Here's 2025's Word of the Year ",
    "url": "https://www.cnbc.com/2025/11/22/ai-chatbot-relationships-influences-2025s-word-of-the-year-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229171-1763651654504-gettyimages-1506736146-miriamchatbot.jpeg?v=1763658474&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-22T07:16:18.000Z",
    "description": "Cambridge Dictionary named \"parasocial\" as Word of the Year for 2025.Francesco Carta Fotografo | Moment | Getty ImagesAI chatbots, Taylor Swift, and s",
    "body": "Cambridge Dictionary named \"parasocial\" as Word of the Year for 2025.Francesco Carta Fotografo | Moment | Getty ImagesAI chatbots, Taylor Swift, and social media influencers all played a part in deciding Cambridge Dictionary's Word of the Year, 2025: \"parasocial.\" Parasocial — revealed by the global dictionary on Tuesday as its word of the year — refers to the connection a person feels to an online personality ranging from celebrities to podcasters, and even artificial intelligence. \"Parasocial relationship is when we think we know someone, or we feel very close to someone who's in fact, a person we've never met, like a celebrity, an influencer, or somebody in public life who's famous for some reason,\" Simone Schnall, professor of experimental social psychology at the University of Cambridge, told CNBC Make It. \"In reality, of course, it's only a one-sided, so-called relationship,\" she added. The term originated in 1956 when University of Chicago sociologists Donald Horton and Richard Wohl found that people who watched television were treating the actors on-screen like friends or family. Schnall explained that the \"phenomenon\" is well-known in our culture, but it's only now that people are using the term more commonly. \"It's been there forever, but I think in our culture, we now see parasocials on steroids, simply because there are so many opportunities for it. There are so many people who, for whatever reason, we can be interested in and fascinated by, inspired by,\" she said. One example is singer and billionaire Taylor Swift who has an intense global fanbase due to her relatable songs. Many of her fan report having a deep, emotional connection with her and keep up with her personal life and romantic relationships. Other examples include social media influencer and Youtuber Logan Paul who has around 27 million followers on Instagram and 23 million subscribers on YouTube. In 2018, Paul posted a video showing a deceased person in Japan's Aokigahara \"suicide forest,\" sparking global outrage. Many of his die‑hard fans defended him, showing fierce loyalty despite the seriousness of the content. Paul later apologized for the video. Schnall warned there are \"dangers\" in following celebrities and social media influencers who might share incorrect medical advice, sell bad products, or promote unethical behaviour.  \"They [influencers] could do some serious harm to their followers. The people who feel they're in that parasocial relationship, they could really be harmed by that,\" Schnall warned. AI chatbots and loneliness culture Cambridge Dictionary referenced that part of the increasing popularity of the word \"parasocial\" stems from relationships being formed with AI chatbots. A 2025 report by Common Sense Media, which surveyed 1,060 U.S. teens, found that 72% of teenagers aged 13 to 17 had used an AI companion at least once. This was for a range of reasons from emotional or mental health support or as a friend or best friend. \"They're called chatbots because we feel like we're chatting with someone already,\" Schnall said. \"People can develop certain relationships, like a friendship or even romantic relationship, or at least, that's how they feel about it, when of course in reality, there is no one else involved.\" And it's not just teens. A recent survey by Vantage Point Counselling of over 1,000 American adults found that 28% said they have had a romantic or intimate relationship with an AI. Schnall offered two reasons why people are turning to parasocial relationships: a global loneliness epidemic and increased screentime. On phones and screens, parasocial relationships are \"just a click away\" so it's easier to get immediate social approval. Meanwhile, chatbots are designed to flatter you, per Schnall. \"People tend to be more lonely than in previous generations, and they spend so much time on their screens where these parasocial relationships are very easy to establish,\" she said.The antidote, Schnall said is investing in real-life relationships because the more time you spend online, the less time you spend pursuing in-person connections. \"The more time I spend chatting with a chatbot, the less time I probably spent chatting with a real life person,\" she added. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "In a one-sided relationship with an AI chatbot? Here's 2025's Word of the Year ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229171-1763651654504-gettyimages-1506736146-miriamchatbot.jpeg?v=1763658474&w=1920&h=1080"
      ],
      "datePublished": "2025-11-22T07:16:18.000Z",
      "dateModified": "2025-11-22T07:16:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump praises NYC Mayor-elect Mamdani after White House meeting, shrugs off being called 'fascist'",
    "url": "https://www.cnbc.com/2025/11/21/trump-mamdani-meeting-white-house-nyc.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108230204-17637585472025-11-21t205337z_1143851817_rc271ia6cvye_rtrmadp_0_usa-trump-mamdani.jpeg?v=1763758583&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T22:18:45.000Z",
    "description": "President Donald Trump offered praise for New York City Mayor-elect Zohran Mamdani on Friday after the two men met for the first time at the White Hou",
    "body": "President Donald Trump offered praise for New York City Mayor-elect Zohran Mamdani on Friday after the two men met for the first time at the White House to discuss the growing issue of affordability.While the Republican president and the Democratic mayor-elect have hurled searing attacks at each other in the recent past, they repeatedly shrugged off those words while appearing side by side in the Oval Office. At one point, when Mamdani was asked for the second time about having called Trump a \"fascist,\" the president gave him cover.\"That's OK, you can just say yes,\" Trump said after Mamdani began to respond. \"It's easier than explaining it.\"Trump also appeared to backtrack on his prior threat to withhold federal funding for New York City if Mamdani became its mayor. \"I don't think that's going to happen,\" Trump said.Instead of rehashing their feud, they talked up their areas of agreement on broad issues, especially focusing on lowering the cost of living.But they also found common ground on some more specific matters, such as getting NYC-based energy giant Con Edison to lower prices. \"We've gotten fuel prices way down, but it hasn't shown up in Con Edison, and we're going to have to talk to them ... to start lowering the rates,\" Trump said. \"Absolutely,\" Mamdani added.U.S. President Donald Trump and New York City Mayor-elect Zohran Mamdani speak to members of the media as they meet in the Oval Office at the White House in Washington, D.C., U.S., Nov. 21, 2025. Jonathan Ernst | ReutersTrump gave more praise than Mamdani returned, but the two did trade some compliments.\"I think you're going to have, hopefully, a really great mayor,\" Trump said. \"The better he does, the happier I am.\"\"I appreciated the meeting with the president,\" said Mamdani, who stood while Trump sat at the Resolute Desk. \"And as he said, it was a productive meeting focused on a place of shared admiration and love, which is New York City and the need to deliver affordability to New Yorkers.\"The conciliatory tone was brand new. Mamdani had laced into the president on the campaign trail and in his electoral victory speech, saying, \"If anyone can show a nation betrayed by Donald Trump how to defeat him, it is the city that gave rise to him.\"And just two days earlier, Trump had called Mamdani the \"Communist Mayor of New York City.\" The mayor-elect is a self-described democratic socialist who denies being a communist.The Oval Office meeting was requested by Mamdani, the 34-year-old whose stunning triumph in the mayoral race over former New York Gov. Andrew Cuomo has put him at the center of American politics.\"I will work with anyone to make life more affordable for the more than eight-and-a-half million people who call the city home,\" Mamdani said Thursday.Mamdani and other Democrats who won a bevy of elections this month had focused relentlessly on affordability — a word that Trump has chafed at, while insisting that prices are broadly down already.Meanwhile, the president's approval ratings have fallen precipitously in numerous polls, with respondents consistently pointing to the high cost of living as a main concern.Subscribe to CNBC on YouTube.     ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump praises NYC Mayor-elect Mamdani after White House meeting, shrugs off being called 'fascist'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108230204-17637585472025-11-21t205337z_1143851817_rc271ia6cvye_rtrmadp_0_usa-trump-mamdani.jpeg?v=1763758583&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T22:18:45.000Z",
      "dateModified": "2025-11-21T22:18:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rep. Marjorie Taylor Greene will resign after fallout with Trump",
    "url": "https://www.cnbc.com/2025/11/21/marjorie-taylor-greene-resign-trump-epstein-mtg.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108038458-17271945472024-09-24t161459z_182061008_rc227aabhv9k_rtrmadp_0_usa-election-trump.jpeg?v=1727194576&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-22T05:19:56.000Z",
    "description": "U.S. Rep. Marjorie Taylor Greene (R-GA) speaks, at a campaign event for Republican presidential nominee and former U.S. President Donald Trump, at the",
    "body": "U.S. Rep. Marjorie Taylor Greene (R-GA) speaks, at a campaign event for Republican presidential nominee and former U.S. President Donald Trump, at the Johnny Mercer Theatre Civic Center in Savannah, Georgia, U.S. September 24, 2024. Megan Varner | ReutersRepublican Rep. Marjorie Taylor Greene of Georgia announced on Friday that she will resign her seat in the House of Representatives in early January, after a dramatic falling out with President Donald Trump over the  Jeffrey Epstein files and other issues.Greene cited Trump's recent attacks on her — which included calling her a \"traitor\" and a \"lunatic\" — in a video and statement posted on X that said her last day in Congress will be Jan. 5. \"Loyalty should be a two way street and we should be able to vote our conscience and represent our district's interest because our job title is literally, 'Representative,'\" wrote Greene, who is in the middle of a third term representing Georgia's 14th District.After her announcement, Trump told an ABC News reporter, \"I think it's great news for the country. It's great.\"Greene, 51, had been a leading supporter of Trump and a prominent figure in the Republican's Make America Great Again, or MAGA, movement, while sparking controversy for promoting conspiracy theories and using extreme rhetoric.But in recent weeks, Trump has blasted her for backing a bill to compel the Department of Justice to release investigative files about the notorious sex offender Epstein.Greene also has drawn Trump's ire for criticizing him for prioritizing meeting with foreign leaders at the expense of paying attention to the needs of Americans.Trump last week said that he was withdrawing his support and endorsement of Greene, who was first elected in 2020, the year he lost a re-election bid to former President Joe Biden. He said that he would fully support \"the right person\" if they challenged her in the Republican primary next year. In her statement on Friday night, Greene wrote, \"I have too much self respect and dignity, love my family too much, and do not want my sweet district to have to endure a hurtful and hateful primary against me by the President we all fought for, only to fight and win my election while Republicans will likely lose the midterms.\"\"And in turn, be expected to defend the President against impeachment after he hatefully dumped tens of millions of dollars against me and tried to destroy me,\" Greene said.\"It's all so absurd and completely unserious,\" she wrote. \"I refuse to be a 'battered wife' hoping it all goes away and gets better.\"Greene wrote that she had \"fought harder than almost any other elected Republican to elect Donald Trump and Republicans to power,\" and that she had left her mother's side as her father had brain surgery to vote against Trump's second impeachment by the House in 2021.She said that her voting record \"has been solidly with my party and the President,\" with the exceptions of \"a few areas\" such as her stance against H1B visa recipients replacing American jobs, U.S. involvement in foreign wars, \"and demanding the release of the Epstein files.\"\"Standing up for American women who were raped at 14, trafficked and used by rich powerful men, should not result in me being called a traitor and threatened by the President of the United States of America, whom I fought for.\"US Representative Marjorie Taylor Greene (R) speaks alongside former US President and 2024 presidential hopeful Donald Trump at a campaign event in Rome, Georgia, on March 9, 2024. Elijah Nouvelage | AFP | Getty ImagesGreene's resignation from her seat could set the stage for her to seek to replace Trump in the White House in the 2028 election, and possibly become the next leader of the MAGA movement once he exits political life.But Greene's statement conceded that her resignation might end not only her congressional career but also her role in MAGA.\"If I am cast aside by MAGA Inc and replaced by Neocons, Big Pharma, Big Tech, Military Industrial War Complex, foreign leaders, and the elite donor class that can't even relate to real Americans, then many common Americans have been cast aside and replaced as well.\"Greene's resignation will reduce the Republican caucus's already extremely narrow majority in the House.Currently, there are 219 Republican House members and 213 Democratic members.But the 14th District is very conservative and is likely to elect a Republican to replace Greene whenever a special election for her seat is called.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rep. Marjorie Taylor Greene will resign after fallout with Trump",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108038458-17271945472024-09-24t161459z_182061008_rc227aabhv9k_rtrmadp_0_usa-election-trump.jpeg?v=1727194576&w=1920&h=1080"
      ],
      "datePublished": "2025-11-22T05:19:56.000Z",
      "dateModified": "2025-11-22T05:19:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Air traffic controllers, technicians with perfect attendance in shutdown to get $10,000 bonuses, FAA says",
    "url": "https://www.cnbc.com/2025/11/21/air-traffic-controllers-government-shutdown-bonus.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223092-17625335852025-11-07t162748z_1309129180_rc2srha2atcp_rtrmadp_0_usa-shutdown-air-travel.jpeg?v=1762533612&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T19:54:20.000Z",
    "description": "An airplane takes off from New York's Laguardia Airport after the FAA ordered flight cuts at 40 major airports amid the ongoing U.S. government shutdo",
    "body": "An airplane takes off from New York's Laguardia Airport after the FAA ordered flight cuts at 40 major airports amid the ongoing U.S. government shutdown in the Queens borough of New York City, U.S., November 7, 2025. Ryan Murphy | ReutersAir traffic controllers and technicians with perfect attendance during the government shutdown will receive $10,000 bonuses, the Department of Transportation and Federal Aviation Administration said this week.The bonuses will go to 776 controllers and technicians, who will receive notification next week with payments going out by Dec. 9, the FAA and DOT said. There are about 11,000 fully certified air traffic controllers in the U.S., according to their union.\"These patriotic men and women never missed a beat and kept the flying public safe throughout the shutdown,\" Transportation Secretary Sean Duffy said in a release late Thursday.The DOT and FAA didn't immediately say whether preplanned vacation time or fatigue calls would disqualify controllers and technicians from the bonus.An increase in absences of air traffic controllers, who were required to work without their regular paychecks during the more than 40-day shutdown, the longest ever, forced airlines to slow or cancel flights. The shutdown ended Nov. 12 with a bill to fund the government through January.The shutdown's disruptions and additional strain on air traffic controllers, many of whom are already required to work six-day weeks, sparked an outcry from the aviation industry, which urged lawmakers to ensure critical workers aren't left without pay if there's another shutdown.Read more CNBC airline newsThe government shutdown is over. The air traffic controller shortage is notPrivate-jet demand is on the rise amid government shutdown, says Flexjet CEOBoeing stems cash burn for first time since 2023 but takes $4.9 billion charge on 777X delaysAmerican Airlines is late to the luxury travel boom. Can it catch up?The National Air Traffic Controllers Association, which represents the country's air traffic controllers, said it was informed of the decision on cash bonuses hours before the announcement. It said that 311 employees represented by NATCA qualify for the payments.\"We look forward to working with the Administration to provide the appropriate recognition to those not covered by the Secretary's announcement,\" the union said in a statement.The Professional Aviation Safety Specialists, the union that represents 11,000 FAA and Defense Department workers including technicians, said it is \"reviewing the information that has been provided by the FAA and is evaluating how best to ensure that all employees who worked during the shutdown are recognized.\"Last week, Homeland Security Secretary Kristi Noem said Transportation Security Administration officers who screen passengers at airports would also receive $10,000 bonuses for perfect attendance.\"Despite tremendous personal, operational, and financial challenges, these dedicated officers showed up to work every day for more than a month, without pay, ensuring the American people could travel safely,\" DHS said in a press release.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Air traffic controllers, technicians with perfect attendance in shutdown to get $10,000 bonuses, FAA says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223092-17625335852025-11-07t162748z_1309129180_rc2srha2atcp_rtrmadp_0_usa-shutdown-air-travel.jpeg?v=1762533612&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T19:54:20.000Z",
      "dateModified": "2025-11-21T19:54:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bitcoin continues slide that's roiling markets, threatens to break below $80,000 ",
    "url": "https://www.cnbc.com/2025/11/21/bitcoin-continues-slide-thats-roiling-markets-threatens-to-break-below-80000.html",
    "image": "https://image.cnbcfm.com/api/v1/image/105496652-1740495612547-105496652-1539107947284gettyimages-917296340-1.jpg?v=1763738884&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T16:13:53.000Z",
    "description": "Bitcoin fell sharply after a sell-off of major U.S. stock indices. Bitcoin has been correlated closely to the price movement of the Nasdaq index.Luke ",
    "body": "Bitcoin fell sharply after a sell-off of major U.S. stock indices. Bitcoin has been correlated closely to the price movement of the Nasdaq index.Luke MacGregor  | Bloomberg | Getty ImagesBitcoin tumbled as much as 6% early Friday, hovering just above its critical $80,000 support level at one point, as investors continued their flight from risk-on assets to more defensive plays. The largest cryptocurrency by market capitalization hit $80,548 at around 7:30 a.m. ET. The token's plunge to that price — its lowest since April 11— marks a steepening of bitcoin's decline following widespread cascading liquidations of highly leveraged crypto positions in October. \"Price action has been unimpressive across the large tokens, BTC dipping below the year-start price as long-time and larger holders of the token have become more active,\" Citi analyst Alex Saunders said Friday in a note to clients. \"ETF flows, the main driver of BTC prices, are also drying up, adding to the short-term performance worries.\"Bitcoin has since regained some of its losses to trade down 4% to $82,939.59, according to Coin Metrics. The cryptocurrency has fallen 12% since the beginning of the week and roughly 26% over the last month.Stock Chart IconStock chart iconBitcoin value year to dateThe token's slide follows mounting pressure in the U.S. stock market, which has led investors to rotate out of volatile assets like crypto and artificial intelligence stocks into safe-havens such as gold. The Nasdaq Composite fell 2% on Thursday, as a rally sparked by Nvidia's blockbuster earnings on Wednesday lost steam. Its fizzling underscores investors' increasing scrutiny of sky-high AI valuations. Investors in AI also often hold bitcoin, linking the two trades.Cryptocurrency stocks were also in the red. Strategy, a bitcoin treasury firm, has fallen 2% on the day and is now down 42% over the past month. American Bitcoin and Riot Platforms shed 7% and 4% in Thursday's session, respectively.  Bitcoin is now down 9% since the beginning of the year, despite smashing several price records following President Donald Trump's inauguration in January. Amid the administration's pro-crypto policies, it last sailed to a record price just north of $126,000 in early October.  But, it's now more than 30% off that high. \"We're in very oversold territory for bitcoin right now,\" Sebastian Pedro Bea, chief investment officer at crypto asset management firm ReserveOne, told CNBC.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bitcoin continues slide that's roiling markets, threatens to break below $80,000 ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/105496652-1740495612547-105496652-1539107947284gettyimages-917296340-1.jpg?v=1763738884&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T16:13:53.000Z",
      "dateModified": "2025-11-21T16:13:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fed won't get key inflation data before next rate decision as BLS cancels October CPI release",
    "url": "https://www.cnbc.com/2025/11/21/fed-wont-get-key-inflation-data-before-next-rate-decision-as-bls-cancels-october-cpi-release.html",
    "image": "https://image.cnbcfm.com/api/v1/image/104307385-BLS.jpg?v=1763742571&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T17:59:54.000Z",
    "description": "The U.S. Bureau of Labor Statistics is the principal Federal agency responsible for measuring labor market activity, working conditions, and price cha",
    "body": "The U.S. Bureau of Labor Statistics is the principal Federal agency responsible for measuring labor market activity, working conditions, and price changes in the economy.Bill Clark | Getty ImagesThe Bureau of Labor Statistics said it was canceling the release of the October consumer price index, leaving the Federal Reserve without a key piece of inflation data to ponder when it next decides on interest rates on Dec. 10.The CPI data, previously scheduled to be released on Nov. 7, was canceled because the government shutdown made it impossible for the BLS to \"retroactively collect\" certain parts of survey data, the agency said on its website.November's CPI data, previously scheduled to be released on Dec. 10, will now be released on Dec. 18 after the Fed decision, the BLS said.Bureau data collectors compile the index through several methods, including personal visits and phone calls that were not possible during the shutdown. The BLS also uses online data and household surveys that also would make it difficult to retroactively collect information. In addition to the Fed announcement, the Commerce Department's Bureau of Economic Analysis said another key inflation measure, the personal consumption expenditures price index, \"is to be rescheduled\" though no firm date has been announced. The Fed uses the PCE price index as its main inflation forecasting tool. The gauge had been set for release Nov. 26.Fed officials have voiced concerns about being in a data fog as they try to formulate monetary policy. The central bank's Federal Open Market Committee approved a quarter percentage point rate cut in late October, but minutes from the meeting reflected worries over getting an incomplete picture.\"This is a temporary state of affairs. And we're going to do our jobs, we're going to collect every scrap of data we can find, evaluate it, and think carefully about it,\" Fed Chair Jerome Powell said after the October meeting. \"What do you do if you're driving in the fog? You slow down. ... There's a possibility that it would make sense to be more cautious about moving.\"However, New York Fed President John Williams said Friday he thinks the Fed probably has \"room for a further adjustment in the near term,\" implying the likelihood of a cut sometime soon.Other Fed officials, such as Governor Christopher Waller, have said policymakers still have enough information to make informed decisions, even with the data drought from the shutdown.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fed won't get key inflation data before next rate decision as BLS cancels October CPI release",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/104307385-BLS.jpg?v=1763742571&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T17:59:54.000Z",
      "dateModified": "2025-11-21T17:59:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump plans huge oil drilling expansion off California and Alaska coasts",
    "url": "https://www.cnbc.com/2025/11/20/trump-offshore-oil-alaska-pacific-california-gulf-mexico.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229518-1763674963295-gettyimages-2245510909-ALASKA_PERMAFROST.jpeg?v=1763675001&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-20T21:53:21.000Z",
    "description": "Oil drilling rigs and support equipment stand on the tundra in Deadhorse, Alaska, on Friday, Sept. 5, 2025. Nathaniel Wilder | Bloomberg | Getty Image",
    "body": "Oil drilling rigs and support equipment stand on the tundra in Deadhorse, Alaska, on Friday, Sept. 5, 2025. Nathaniel Wilder | Bloomberg | Getty ImagesThe Trump administration unveiled plans Thursday for a huge oil drilling expansion off the coasts of Alaska, California and in the Gulf of Mexico. The Department of Interior proposed 34 lease sales to drill in those waters through 2031, a big expansion compared to the Biden administration program that allowed just three lease sales and only in the Gulf. The Trump program would include lease sales in 21 areas off Alaska's coast, six off the Pacific coast and seven in the Gulf of Mexico. It would mark the first time since 1984 that Interior has allowed a new lease in the Pacific, according to the Congressional Research Service.  Interior's proposal is not a final program. It still must undergo further review. Interior Secretary Doug Burgum accused the Biden administration \"crippling the long-term pipeline of America’s offshore production\" by slamming the brakes on oil and gas leasing. More than 100 Democratic lawmakers expressed their opposition to the plan in an Oct. 30 letter addressed to President Donald Trump and Burgum. \"Expanded oil and gas leasing poses risks to the health and livelihoods of our constituents, jeopardizes our tourism, fishing, and recreation economies, and threatens the marine life that inhabits our coastlines,\" the lawmakers wrote. The Natural Resources Defense Council condemned the Trump plan as egregious and reckless in a post Thursday. \"The proposal would open up untouched waters of Alaska to drilling, attempt to resurrect the offshore oil and gas industry in California, and offer up waters off the coast of Florida that haven't been put up for leasing in decades — in addition to adding even more leasing in the Gulf of Mexico,\" the NRDC said. \"This plan would damage these places, and the people who rely on them, for generations,\" the environmental group said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump plans huge oil drilling expansion off California and Alaska coasts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229518-1763674963295-gettyimages-2245510909-ALASKA_PERMAFROST.jpeg?v=1763675001&w=1920&h=1080"
      ],
      "datePublished": "2025-11-20T21:53:21.000Z",
      "dateModified": "2025-11-20T21:53:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Govini founder Eric Gillespie released on $1 million bond with Pentagon probe 'ongoing'",
    "url": "https://www.cnbc.com/2025/11/21/govini-eric-gillespie-bond-pentagon-defense.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108132334-17447457472025-03-21t152931z_1089295807_rc2qhday7xzp_rtrmadp_0_usa-trump-musk-china.jpeg?v=1744745785&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-22T00:40:27.000Z",
    "description": "Mug shot of Eric Gillespie, Govini Founder and Chairman.Courtesy: Pennsylvania Attorney GeneralGovini founder Eric Gillespie, who is charged with four",
    "body": "Mug shot of Eric Gillespie, Govini Founder and Chairman.Courtesy: Pennsylvania Attorney GeneralGovini founder Eric Gillespie, who is charged with four felonies, including multiple counts of unlawful contact with a minor, was released on bail.Gillespie, who lives in Pittsburgh, posted a $1 million bond after his court appearance Thursday. He is not allowed to travel, and his passport has been revoked.He was initially denied bail following his arrest on Nov. 7, with the judge citing flight risk and public safety concerns.David Shrager of Shrager Defense Attorneys, who represents Gillespie, insisted that his client did not break any laws.\"Mr. Gillespie has never contacted a minor, either online or in person, and the facts clearly prove that,\" Shrager said after the hearing on Thursday.\"Completely false statements, including the use of artificial intelligence between adults made in the context of an online fantasy chat, are not illegal,\" he added. Gillespie's next court date is Dec. 18.The Pennsylvania Attorney General's Office said Gillespie sent lewd photos to an agent posing as a father offering his daughter to be abused, and made graphic comments about sexual acts with children.Gillespie, 57, commented on the security of the encrypted platforms being used in the chats between him and the undercover agent, according to a criminal complaint obtained by CNBC.Gillespie is the founder of defense contractor Govini.He was listed on the company's website on the leadership page as a board member on Aug. 17, according to an archived version of the page available on the Wayback Machine. The company said it removed him from the website on Nov. 10 when he was placed on administrative leave.Govini terminated Gillespie on Nov. 12.Earlier this year, Govini landed a nearly $1 billion contract with the Department of Defense. The company's suite of artificial intelligence-enabled applications is used by every department of the U.S. military and other federal agencies.Following his arrest, Pentagon officials said they were looking into Gillespie and possible security issues.CNBC has repeatedly asked the Department of Defense about updates on the status of the probe and potential security concerns with Govini or Gillespie.\"We don't comment on ongoing investigations,\" a Pentagon spokesperson said Thursday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Govini founder Eric Gillespie released on $1 million bond with Pentagon probe 'ongoing'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108132334-17447457472025-03-21t152931z_1089295807_rc2qhday7xzp_rtrmadp_0_usa-trump-musk-china.jpeg?v=1744745785&w=1920&h=1080"
      ],
      "datePublished": "2025-11-22T00:40:27.000Z",
      "dateModified": "2025-11-22T00:40:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Air cargo impact from post-crash MD-11 grounding seen as 'minimal,' analysts say",
    "url": "https://www.cnbc.com/2025/11/21/holiday-shipping-air-cargo-ups-crash.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108221485-1762297489505-gettyimages-1237975327-UPS_EARNS.jpeg?v=1762297557&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T20:01:21.000Z",
    "description": "A UPS logo on the tail of a cargo jet parked at the UPS Worldport facility in Louisville, Kentucky, U.S.Luke Sharrett | Bloomberg | Getty ImagesThe gr",
    "body": "A UPS logo on the tail of a cargo jet parked at the UPS Worldport facility in Louisville, Kentucky, U.S.Luke Sharrett | Bloomberg | Getty ImagesThe grounding of MD-11 aircraft after the deadly crash of a UPS plane earlier this month could boost air cargo rates during the peak holiday shipping season, with some capacity out of the market, but analysts aren't expecting a big impact.The Federal Aviation Administration on Nov. 8 prohibited flights of MD-11 planes, less than a week after a Honolulu-bound UPS aircraft crashed moments after takeoff from Louisville Muhammad Ali International Airport in Kentucky, killing the three crew members and 11 people on the ground.Earlier this week, the TAC Index, which tracks air freight rates around the world, said the Baltic Air Freight Index gained more than 4% in the week ended Nov. 17 and that was it up 2.4% last week compared with the same period last year. \"While it is normal for rates to rise ahead of the Thanksgiving holiday in the US and Christmas in Europe, sources suggested they had been given an added boost after the grounding of all MD-11 freighters following a fatal crash in Louisville earlier this month,\" it said in a note.UPS and FedEx each said they were grounding the aircraft, which make up 9% and 5% of their fleets, respectively, according to a Bank of America note.FedEx said the company is working with the FAA to ensure its 28 MD-11 jets are up to standards. \"We are flexing our integrated air-ground network in the most efficient manner possible to deliver outstanding service, which includes the use of contingency options such as utilizing service recovery spare aircraft in the network, leveraging ground service where feasible, and strategically leveraging limited commercial line haul and charter opportunities,\" the company said in a statement to CNBC.UPS said after the crash that it has contingency plans in place to continue providing service.\"We made this decision proactively at the recommendation of the aircraft manufacturer,\" UPS said on Nov. 7. \"Nothing is more important to us than the safety of our employees and the communities we serve.\"In a Friday statement to CNBC, UPS said the company has not instituted any additional peak season surcharges as a result of the grounding of its 26 MD-11s. Instead, the company said it has secured additional aircraft for its fleet, similar to the leased planes that it procures for the peak season, and has consolidated flight routes to maximize air capacity.\"We have reconfigured our ground network, adding additional capacity to move more packages,\" a UPS spokesperson told CNBC. \"Our contingency plans give us assurance that we'll continue to effectively move volume and deliver for our customers now and throughout peak season.\"On the company's most recent earnings call, which occurred before the fatal crash, CEO Carol Tomé said early forecasts from its top 100 customers signaled the peak season would have a \"considerable surge in volume.\" Still, because UPS has begun to phase out its work with Amazon, previously its largest customer, Tomé added that the decrease in Amazon volumes means the total peak season average daily volume in the U.S. will be down year-over-year.Stifel predicted in a note on Wednesday that the operational and financial impact of the grounding would be \"minimal.\"\"Importantly, aircraft will be back flying once approved individually, rather than the entire MD-11 fleet awaiting a singular ruling, and the FAA can effectively deputize outside parties to effectuate the inspections, which have already begun, according to management,\" the Stifel analysts wrote. Air cargo volumes in October rose 4% year-over-year, with cargo supply growing an average of 3% year-over-year in the past four weeks, Bank of America said in a note Monday. The analysts said any potential disruption from the grounding was not immediately clear, but that, overall, it expected a more muted holiday shipping season compared with the past two years.The National Transportation Safety Board, which is leading the investigation into the UPS crash, said the left engine of the jet detached from the wing during takeoff before the plane crashed into a series of businesses just outside of the airport.In its preliminary report it released Thursday, the NTSB said it found evidence of fatigue cracks in the jet, as well as areas of overstress failure.Though UPS is headquartered in Atlanta, the Louisville airport is home to its largest global package handling facility.The crash occurred during the country's longest government shutdown, which promoted disruptions to air travel due to shortages of air traffic controllers. It also limited some cargo flights. Both commercial and dedicated freight companies carry packages and other goods.During the shutdown, Treasury Secretary Scott Bessent told ABC News that the slowdown in cargo could lead to shortages around the holiday. The shutdown officially ended last week, and air travel disruptions have largely dissipated.Correction: The key points of this story have been updated to reflect the number of people who were killed in the UPS cargo plane crash.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Air cargo impact from post-crash MD-11 grounding seen as 'minimal,' analysts say",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108221485-1762297489505-gettyimages-1237975327-UPS_EARNS.jpeg?v=1762297557&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T20:01:21.000Z",
      "dateModified": "2025-11-21T20:01:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gap comparable sales surge after viral 'Milkshake' denim ad with Katseye",
    "url": "https://www.cnbc.com/2025/11/20/gap-q3-2025-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108228531-1763578666817-gettyimages-2244757053-dsc_0809_vz2rmztg.jpeg?v=1763578708&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-20T21:23:11.000Z",
    "description": "Shoppers walk past a GAP fashion retail store on Oxford Street on October 30, 2025 in  London, United Kingdom.  John Keeble | Getty Images News | Gett",
    "body": "Shoppers walk past a GAP fashion retail store on Oxford Street on October 30, 2025 in  London, United Kingdom.  John Keeble | Getty Images News | Getty ImagesApparel retailer Gap said Thursday its comparable sales rose 5% during the fiscal third quarter, driven by strong revenue at its namesake brand after its viral \"Better in Denim\" campaign with girl group Katseye. Putting aside pandemic-related spikes, the rise in comparable sales is the strongest growth for Gap since its fiscal 2017 holiday quarter and is well ahead of Wall Street expectations of 3.1%, according to StreetAccount. In an interview with CNBC, CEO Richard Dickson said the company hasn't needed to discount as often to sell products, it's winning customers from all income cohorts and it's seeing a \"great start\" to the holiday shopping season. \"While external data points to macro pressure, particularly on the low-income consumer, our customers are finding our price value, [and] our styles are breaking through the competitive landscape,\" said Dickson. \"Our product is resonating. So we're very confident as we head into the holiday season.\" Shares of Gap rose 5% in extended trading Thursday. Here's how the largest specialty apparel company in the U.S. performed during the quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:Earnings per share: 62 cents vs. 59 cents expectedRevenue: $3.94 billion vs. $3.91 billion expectedThe company's net income during the three months ended Nov. 1 declined nearly 14% to $236 million, or 62 cents per share, compared with $274 million, or 72 cents per share, a year earlier. Sales rose to $3.94 billion, up 3% from $3.83 billion a year earlier. For Gap's fiscal year, which is slated to end around early February, the company is now guiding to the high end of its previously released sales forecast, expecting sales to rise between 1.7% and 2%, in line with analyst expectations. It previously expected sales to rise between 1% and 2%.The company is now expecting its full-year operating margin to be around 7.2%, compared to its previous range of between 6.7% and 7%. The forecast includes the impact of tariffs, estimated to be between 1 and 1.1 percentage points. Comparable sales across Gap, which owns its namesake banner, Old Navy, Athleta and Banana Republic, have been positive now for seven straight quarters. Under Dickson, the company has been as focused on boosting profitability and fixing operations as it has been on reigniting cultural relevance, which has led to sustained sales growth across the portfolio. Gap's profitability had been growing, too, as a result, but now that it's facing tariffs, the retailer's gross margin and net income are both taking a hit. During the quarter, Gap's gross margin fell 0.3 percentage points to 42.4% but still came in higher than expectations of 41.2%, according to StreetAccount. The 14% decline in Gap's net income was primarily related to tariffs, finance chief Katrina O'Connell said in an interview. Gap's better-than-expected results come as apparel sales remain generally soft across the industry and consumers pull back on nice-to-have items like new clothes in favor of necessities. Aside from clear value players like Walmart and TJX Companies, earnings so far this season have been muted, with some companies blaming macroeconomic conditions and expressing caution about the holiday season. Dickson said Gap's varied portfolio gives it a hedge in uncertain economic times because it can capture shoppers in a variety of different places. \"Our portfolio appeals to a wide range of consumers, which is giving us great flexibility in today's environment,\" said Dickson. Here's a closer look at how each of the company's brands performed: Gap Gap's namesake brand has been the focus of Dickson's turnaround strategy since he took the helm as CEO just over two years ago. During the quarter, comparable sales rose a staggering 7% – more than double the 3.2% gain analysts had expected, according to StreetAccount. Revenue rose 6% to $951 million. During the quarter, Gap released its viral \"Milkshake\" campaign, featuring the early-aughts Kelis song and members of the Katseye pop group. The campaign helped sales, but Dickson said Gap brand's growth is \"a story about consistency\" and a mix of better product, marketing and partnerships. Old Navy Sales at Old Navy, Gap's largest brand by revenue, rose 5% to $2.3 billion with comparable sales up 6%, far better than the 3.8% that analysts surveyed by StreetAccount expected. The company said it saw growth in key categories like denim, activewear, kids and baby. Banana Republic The elevated, work-friendly brand is still in turnaround mode but saw sales grow 1% to $464 million during the quarter with comparable sales up 4%, better than the 3.2% gain analysts had expected, according to StreetAccount. This was the second quarter in a row Banana reported positive comparable sales, which the company attributed to better marketing and product. Athleta Both revenue and comparable sales at Athleta were down a whopping 11% to $257 million, an eyesore on Gap's otherwise better-than-expected results. Dickson has repeatedly said Athleta is in a reset year, but how long that reset will take remains unclear. \"We have been disappointed in the trend. We understand there's a lot of work to do, but I really do believe in the brand,\" said Dickson. \"I believe in the leadership and we will continue to build this brand for the long term. It does deserve it.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gap comparable sales surge after viral 'Milkshake' denim ad with Katseye",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108228531-1763578666817-gettyimages-2244757053-dsc_0809_vz2rmztg.jpeg?v=1763578708&w=1920&h=1080"
      ],
      "datePublished": "2025-11-20T21:23:11.000Z",
      "dateModified": "2025-11-20T21:23:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The senior population is booming. Caregiving is struggling to keep up",
    "url": "https://www.cnbc.com/2025/11/21/senior-caregiving-labor.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108144069-1747057358144-gettyimages-2170862979-ma111468.jpeg?v=1762536020&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T14:38:21.000Z",
    "description": "Maskot | Maskot | Getty ImagesIn November 2022, Beth Pinsker's 76-year-old mother began to get sick.Ann Pinsker, an otherwise healthy woman, had elect",
    "body": "Maskot | Maskot | Getty ImagesIn November 2022, Beth Pinsker's 76-year-old mother began to get sick.Ann Pinsker, an otherwise healthy woman, had elected to have a spinal surgery to preserve her ability to walk after having back issues. What Ann and Beth had thought would be a straightforward recovery process instead yielded complications and infections, landing Ann in one assisted living facility after another as her daughter navigated her care.Eventually, by July of the following year, Ann died.\"We thought she'd be back up to speed a few weeks after hospital stay, rehab, home, but she had complications, and it was all a lot harder than she thought,\" Beth Pinsker, a certified financial planner and financial planning columnist at MarketWatch who has written a book on caregiving, told CNBC.It wasn't Pinsker's first time navigating senior care. Five years before her mother's death, she took care of her father, and before that, her grandparents.But throughout each of those processes, Pinsker said she noticed a significant shift in the senior caregiving sector.\"From the level of care that my grandparents received to the level of care that my mom received, prices skyrocketed and services decreased,\" she said.It's evocative of a larger trend across the sector as the senior population in the U.S. booms and the labor force struggles to keep up.Recent data from the U.S. Census Bureau found that the population of people ages 65 and older in the country grew from 12.4% in 2004 to 18% in 2024, and the number of older adults outnumbered children in 11 states — up from just three states in 2020.Along with that population change came other shifts, including increased demand for care for older people.According to the U.S. Bureau of Labor Statistics, the prices for senior care services are rising faster than the price of inflation. In September, the Consumer Price Index rose 3% annually, while prices for nursing homes and adult day services rose more than 4% over the same period.But the labor force hasn't necessarily kept up with the surge.The demand for home care workers is soaring as the gap widens, with a projected 4.6 million unfulfilled jobs by 2032, according to Harvard Public Health. And McKnight's Senior Living, a trade publication that caters to senior care businesses, found that the labor gap for long-term care is more severe than any other sector in health care, down more than 7% since 2020.'A critical labor shortage'That shortage is primarily driven by a combination of low wages, poor job quality and difficulty climbing the ranks, according to experts.\"This is coming for us, and we are going to have this create an enormous need for long-term care,\" Massachusetts Institute of Technology economist Jonathan Gruber told CNBC.Gruber said the country is entering a period of \"peak demand\" for aging baby boomers, creating a situation where rising demand and pay do not sufficiently match up, leading to a \"critical labor shortage.\"On top of that, the jobs at nursing homes are often strenuous and vary in skills depending on the specific needs of each senior, he said, leading nursing assistants to be staffed in difficult jobs that often only pay slightly more than a retail job, despite requiring more training.According to the BLS' most recent wage data from May 2024, the average base salary for home health and personal care aides was $16.82 per hour, compared with $15.07 per hour for fast food and counter workers.\"If we can create a better caring system with an entitlement to all care for those who need it, that will free millions of workers to make our economy grow, so this is a drag on economic growth,\" Gruber said.Pinsker said she saw that shortage play out firsthand. At one of the assisted living facilities she toured for her mother, she noticed nurses wheeling residents into the dining hall for lunch at 10:30 a.m., an hour and a half before lunch would be served, because the home did not have enough caregivers to retrieve them at noon.\"They were bringing them in one at a time, whoever was available, seating them in rows at their tables, and just leaving them there to sit and wait,\" Pinsker said. \"This was their morning activity for these people in this nursing home. … They just don't have enough people to push them around. That's what a staffing shortage looks like in real time.\"Pinsker said her mother was placed in a nursing rehab facility, unable to walk or get out of bed, and that her facility had zero doctors on the premises. Most often, she said the facility was just staffed with business-level caretakers who change bedpans and clothing.\"They don't have enough doctors and registered nurses and physical therapists and occupational therapists and people to come and check blood pressure and take blood samples and that sort of stuff,\" she said. \"They're short on all ends of the staffing spectrum.\"Filling the gapGruber said there are three directions he thinks the country could go in to solve the labor gap: Pay more for these jobs, allow more immigration to fill the jobs or set up better career ladders within the sector.\"It's not rocket science — you've either got to pay more, or you've got to let in way more people. … There are wonderful, caring people all over the world who would like to come care for our seniors at the wages we're willing to pay, and we just have to let them in,\" Gruber said.He's also part of an initiative in Massachusetts focused on making training more affordable for nurses to be able to climb the career ladder and pipelines to fill the shortages, which he said helps staff more people.For Care.com CEO Brad Wilson, an overwhelming demand for senior care made it clear to the company that it needed to set up a separate category of job offerings. Care.com, which is most known for listing child care service jobs, met the demand and rolled out additional senior care options, as well as a tool for families trying to navigate what would work best for their situations and households.Wilson said the company sees senior care as a $200 billion to $300 billion per year category. Now, it's the company's fastest-growing segment.\"We've heard from families that it's an enormous strain as they go through the senior care aspect of these things, because child care can be a little bit more planned, but sometimes your adult or senior care situation is sudden, and there's a lot to navigate,\" he said.Care.com is also increasingly seeing demand rise for \"house managers,\" Wilson said, who can help multiple people in a single household, as caregiving situations evolve.\"I can't underscore enough ... this is the most unforeseen part of the caregiving journey, and it's increasingly prevalent,\" he added.And as the senior population booms, so too does the so-called sandwich generation, whose members are taking care of both their aging parents and their young children. Wilson said his family is in the thick of navigating caring for older family members while also raising three children.\"By 2034, there will actually be more seniors in this country than children,\" Wilson said, citing Census Bureau statistics. \"Senior care is in a crisis. It's actually the very much unseen part of the caregiving crisis today, and we're really trying to bring some visibility to it and share that we have solutions that can help people.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The senior population is booming. Caregiving is struggling to keep up",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108144069-1747057358144-gettyimages-2170862979-ma111468.jpeg?v=1762536020&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T14:38:21.000Z",
      "dateModified": "2025-11-21T14:38:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Treasury yields slide after Williams suggests Fed could cut again in December",
    "url": "https://www.cnbc.com/2025/11/21/us-treasury-yields-edge-lower-as-fed-rate-cut-bets-fall.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229871-1763730470574-gettyimages-2233025865-WILLIAMS_ECNY.jpeg?v=1763730492&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T21:01:58.000Z",
    "description": "Treasury yields were lower on Friday after New York Federal Reserve President John Williams offered some hope to investors that the Fed may lower its ",
    "body": "Treasury yields were lower on Friday after New York Federal Reserve President John Williams offered some hope to investors that the Fed may lower its key interest rate at its final meeting of 2025 next month.The yield on the benchmark 10-year Treasury fell more than 4 basis points to trade at 4.063%. Yields across the maturity curve ticked lower, with the 2-year Treasury yield shedding more than 5 basis points to 3.507% and the longer-term 30-year Treasury's yield being down more than 1 basis point at 4.715%.One basis point equals 0.01% and yields and prices move in opposite directions.In remarks for a speech in Santiago, Chile, Williams said that he thinks the Fed is able to cut rates again, adding that \"modestly restrictive\" monetary policy has become \"somewhat less so\" since the central bank approved cuts at its October and September meetings.\"I still see room for a further adjustment in the near term to the target range for the federal funds rate to move the stance of policy closer to the range of neutral, thereby maintaining the balance between the achievement of our two goals,\" he said in remarks for a speech in Santiago, Chile.Fed funds futures traders increased their bets for a December cut following Williams' remarks, pricing in a more than 70% likelihood, the CME's FedWatch tool showed.Expectations had fallen drastically in recent weeks. In the day prior to Williams' comments, money markets were pricing in a 39.1% chance of a cut next month.The Bureau of Labor Statistics on Friday made it even more difficult for the data-dependent Fed to make a decision next month, saying it canceled the release of the October reading for the consumer price index.Yields had taken a dive earlier Friday following Thursday's sell-off in U.S. equities, a move spurred by increasing pessimism toward the rate outlook and concerns over valuation levels in the artificial intelligence trade.Global markets are also digesting Thursday's delayed nonfarm payrolls report, which showed the economy added more jobs than expected in September, but the unemployment rate also rose to 4.4% — its highest level since Oct. 2021.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Treasury yields slide after Williams suggests Fed could cut again in December",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229871-1763730470574-gettyimages-2233025865-WILLIAMS_ECNY.jpeg?v=1763730492&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T21:01:58.000Z",
      "dateModified": "2025-11-21T21:01:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robinhood shares drop 12% this week amid losses in bitcoin, AI stocks",
    "url": "https://www.cnbc.com/2025/11/21/robinhood-heads-for-brutal-weekly-loss-as-bitcoin-ai-stocks-are-hit-hard.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108058864-1730901410581-gettyimages-2182410725-omarques_05112024_phone_technews-6.jpeg?v=1763735672&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T21:22:52.000Z",
    "description": "Omar Marques | Lightrocket | Getty ImagesRobinhood shares suffered brutal weekly loss as the once-red-hot trades in bitcoin and AI stocks that powered",
    "body": "Omar Marques | Lightrocket | Getty ImagesRobinhood shares suffered brutal weekly loss as the once-red-hot trades in bitcoin and AI stocks that powered its growth lost momentum.The popular brokerage platform saw the stock decline 12.4% this week. The stock tumbled 10.1% on Thursday and rebounded 1% Friday. November alone has erased 27% of its market value.The latest slide reflects a sharp reversal in the risk-hungry investment activity Robinhood relies on. The company's core business is closely tied to retail investors pouring into speculative corners of the market, particularly cryptocurrency and buzzy artificial intelligence stocks. Those trades helped fuel a resurgence in Robinhood revenue and user engagement earlier this year as bitcoin hit fresh highs and anything tied to artificial intelligence soared. But the recent rout in crypto and high-growth tech stock leaders is exposing Robinhood's sensitivity to sentiment swings. Bitcoin has fallen about 12% this week alone, hitting a fresh low of $80,548.09 on Friday, the lowest level since April. Shares of AI enabler Nvidia are down 6% this week. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robinhood shares drop 12% this week amid losses in bitcoin, AI stocks",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108058864-1730901410581-gettyimages-2182410725-omarques_05112024_phone_technews-6.jpeg?v=1763735672&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T21:22:52.000Z",
      "dateModified": "2025-11-21T21:22:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eli Lilly hits $1 trillion market value, a first for a health-care company",
    "url": "https://www.cnbc.com/2025/11/21/eli-lilly-hits-1-trillion-market-value-first-for-health-care-company.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107388672-1710764847941-gettyimages-2092473213-dsc01895copy_8zcnfedn.jpeg?v=1761820877&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T17:51:45.000Z",
    "description": "A sign with the company logo sits outside of the headquarters of Eli Lilly in Indianapolis, Indiana, on March 17, 2024.Scott Olson | Getty ImagesEli L",
    "body": "A sign with the company logo sits outside of the headquarters of Eli Lilly in Indianapolis, Indiana, on March 17, 2024.Scott Olson | Getty ImagesEli Lilly reached a $1 trillion market capitalization on Friday, the first health-care company in the world to join the exclusive club dominated by tech firms.Eli Lilly briefly hit the $1 trillion mark in morning trading before retreating. It was last trading around $1,048 a share. Eli Lilly is the second nontechnology company to reach the coveted $1 trillion mark in the U.S. after Warren Buffett's Berkshire Hathaway.The drugmaker's stock has climbed more than 36% this year as investors applaud the gains it has made over chief rival Novo Nordisk in the GLP-1 drug space. The Indianapolis-based company's stock has been riding the skyrocketing popularity of its weight loss injection Zepbound and diabetes treatment Mounjaro. Stock Chart IconStock chart iconEli Lilly's stock has soared on the back of the success of its drugs Mounjaro and Zepbound.Demand is only expected to grow as approvals for the treatments' uses and insurance coverage expand.The two drugs have driven eye-popping sales growth for Eli Lilly. Last month, the company said Mounjaro drew in $6.52 billion in revenue in the third quarter, a 109% increase from the previous year. Meanwhile, Zepbound posted $3.59 billion in sales during the period, a 184% spike from the prior-year period.Demand for the treatments will only grow as approvals for their use and insurance coverage expand. In addition, Eli Lilly expects an oral version of its popular drugs to hit the market next year, which could give patients a more convenient option than a shot that is easier for the company to produce.Eli Lilly will likely remain a dominant player in the weight loss drug market, which some analysts believe could be worth more than $150 billion by the early 2030s. But despite its recent struggles and leadership shake-ups, Novo Nordisk remains a formidable rival for Eli Lilly in the space. Pfizer also made a push forward in the market, as well, when it won a $10 billion bidding war with Novo Nordisk for obesity drugmaker Metsera earlier this month.The runaway success of Zepbound, MounjaroEli Lilly, a pharmaceutical chemist and Union veteran of the U.S. Civil War, founded his namesake company in 1876. It has long been at the forefront of the diabetes treatment space, introducing the world's first commercial insulin in 1923. Eli Lilly became a publicly traded company on the New York Stock Exchange by 1952, and for decades relied on a slate of widely successful products to drive much of its profits and revenue. That included insulins, the antidepressant pill Prozac and the earliest polio vaccine. An Eli Lilly & Co. Zepbound injection pen, March 28, 2024.Bloomberg | Bloomberg | Getty ImagesEli Lilly hit the jackpot with the May 2022 approval of tirzepatide for diabetes, which is sold as Mounjaro. It started to compete with Novo Nordisk's diabetes injection Ozempic, which had entered the market a few years earlier. But Eli Lilly brought a new way to treat diabetes and eventually, obesity. Tirzepatide works by imitating two hormones produced in the gut called GLP-1 and GIP. GLP-1 helps reduce food intake and appetite. GIP, which also suppresses appetite, may also improve how the body breaks down sugar and fat.Meanwhile, Novo Nordisk's semaglutide, the active ingredient in Ozempic and its weight loss drug Wegovy, only targets GLP-1. Mounjaro achieved \"blockbuster\" status — meaning it generated more than $1 billion in annual sales — during its first full year on the market. Eli Lilly then won approval in late 2023 for tirzepatide as a treatment for obesity, which is sold as Zepbound and now competes with Novo Nordisk's Wegovy. By 2024, Mounjaro pulled in $11.54 billion in sales, while Zepbound posted $4.93 billion in revenue.More CNBC health coverageThe Trump administration is changing Covid, childhood vaccine recommendations – here's what it means for youU.S. to impose 100% tariff on branded, patented drugs unless firms build plants locally, Trump saysEli Lilly to build $6.5 billion Texas manufacturing facility for obesity pill, other drugs",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eli Lilly hits $1 trillion market value, a first for a health-care company",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107388672-1710764847941-gettyimages-2092473213-dsc01895copy_8zcnfedn.jpeg?v=1761820877&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T17:51:45.000Z",
      "dateModified": "2025-11-21T17:51:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House Democratic leader gets in fiery clash as he defends ACA tax credit extension plan",
    "url": "https://www.cnbc.com/2025/11/21/hakeem-jeffries-obamacare-tax-credit.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108206774-1759356520759-gettyimages-2238202021-US_GOV_FUNDING.jpeg?v=1759356542&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T16:31:44.000Z",
    "description": "watch nowHouse Minority Leader Hakeem Jeffries on Friday rejected as \"ridiculous\" an accusation that Democrats want to let pivotal Obamacare subsidies",
    "body": "watch nowHouse Minority Leader Hakeem Jeffries on Friday rejected as \"ridiculous\" an accusation that Democrats want to let pivotal Obamacare subsidies lapse in order to deal a political blow to Republicans.\"Shame on you,\" Jeffries, D-N.Y., said at one point as he pushed back on that notion in a fiery exchange with CNBC's Becky Quick on \"Squawk Box.\"The clash came less than six weeks before those subsidies — enhanced tax credits that reduce health-insurance premiums under the Affordable Care Act for millions of enrollees — are set to expire.Quick had questioned why House Democrats are seeking a three-year extension of those subsidies, which Republicans won't support, instead of a one- or two-year deal, which some might.When Jeffries noted that Senate Minority Leader Chuck Schumer, D-N.Y., had offered a one-year extension of the tax credits during the government shutdown, Quick interjected, pressing him not to \"go back to what's done in the past.\"Jeffries said he was providing the necessary context that \"Republicans have repeatedly refused to take yes for an answer.\"Quick replied, \"It's important context to make me realize that I don't think you want to get a deal done. I think this is something where you'd like to see the rates go higher and allow the Republicans to hang themselves with that.\"Jeffries shot back: \"That's absolutely a ridiculous assertion ... shame on you for saying that.\"\"It's not a partisan issue for us. In fact, the states that are most impacted as it relates to an Affordable Care Act tax credit expiration are all Republican states.\"The fight over the tax credits was at the center of the 43-day shutdown, which ended last week without a clear solution on health care.Democrats wanted to permanently extend the credits, which were imposed under the Biden administration during the Covid-19 pandemic, and had refused to agree to fund the government without that guarantee. Republicans, who hold slim majorities in the House and Senate and have long criticized Obamacare, said they also wanted to address health care policy. But they balked at negotiating without reopening the government first.\"Republicans said in the House they were willing to deal with the Affordable Care Act tax credit issue after the government funding agreement was reached,\" Jeffries said on CNBC. \"Well, now the government shutdown is over and there's still been no conversations with House Republican leaders.\"The funding deal ultimately signed by President Donald Trump, which drew enough Democratic support to pass in the Senate, merely guaranteed that the upper chamber would hold a vote in December on a bill of Democrats' choosing.There is no guarantee that Senate Republicans will back that measure, or that House Speaker Mike Johnson, R-La., will take it up if it passes.Read more CNBC politics coverageTrump calls to revoke ABC's license over reporter's Epstein files questionAI could be causing ‘quiet time’ in labor market, top Trump economic aide Hassett saysTrump reverses stance on Epstein records, presses Republicans to support releaseFormer Fed Gov. Adriana Kugler violated trading rules while at central bank: ethics reportWoman pleads guilty to lying about astronaut wife accessing bank account from Space Station",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House Democratic leader gets in fiery clash as he defends ACA tax credit extension plan",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108206774-1759356520759-gettyimages-2238202021-US_GOV_FUNDING.jpeg?v=1759356542&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T16:31:44.000Z",
      "dateModified": "2025-11-21T16:31:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]