[
  {
    "title": "Elon Musk is telling his followers to cancel Netflix subscriptions. Here's what's happening",
    "url": "https://www.cnbc.com/2025/10/02/elon-musk-calls-for-canceling-netflix-whats-happening.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108152705-17486289872025-05-30t181538z_798494356_rc2iseae2w85_rtrmadp_0_usa-trump.jpeg?v=1748633566&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-02T20:46:49.000Z",
    "description": "<div><div><p>Elon Musk stands in the Oval Office to attend a press event with U.S. President Donald Trump, at the White House in Washington, D.C., U.S",
    "body": "<div><div><p>Elon Musk stands in the Oval Office to attend a press event with U.S. President Donald Trump, at the White House in Washington, D.C., U.S., May 30, 2025. </p><p>Nathan Howard | Reuters</p></div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/elon-musk/\">Elon Musk</a> this week urged his followers to cancel their <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NFLX/\">Netflix</a><span><span></span></span></span> subscriptions over a controversy surrounding an animated show and its creator.</p><p>Musk on Wednesday <a href=\"https://x.com/elonmusk/status/1973292474375479556\" target=\"_blank\">posted</a> on his X platform saying, \"Cancel Netflix for the health of your kids.\" The post was in response to an image accusing Netflix of carrying out a \"transgender woke agenda.\"</p><p>The controversy seems to stem from conservative backlash over an animated Netflix show, \"Dead End: Paranormal Park,\" which features a transgender character. The show was canceled in 2023 after two seasons.</p><p>In addition to several anti-trans posts, Musk also <a href=\"https://x.com/elonmusk/status/1973101319222165785?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1973101319222165785%7Ctwgr%5E6bb1e8bac213d47b901b22d6ba65042b371c9caf%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.firstpost.com%2Fexplainers%2Felon-musk-netflix-boycott-charlie-kirk-controversy-13938760.html\" target=\"_blank\">responded</a> to a post criticizing alleged statements made by the show's creator, Hamish Steele, that a prominent conservative X account said \"mocked\" the murder of conservative activist Charlie Kirk.</p><p>Steele responded to Musk's callout on rival social media platform Bluesky saying, \"It's probably going to be a very odd day.\" Steele also shared a post by TV writer Jack Bernhardt that called \"Dead End\" a \"brilliant show about kind, wonderful characters.\"</p><p>Netflix did not respond to CNBC's request for comment.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108206766-17593554481759355445-41906018363-1080pnbcnews.jpg?v=1759355447&w=750&h=422&vtcrop=y\" alt=\"‘Fast Money’ traders talk Netflix shares dropping after Elon Musk tells people to cancel\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>Analysts say the backlash might not pose as big of a threat to Netflix as Musk may be hoping for.</p><p>Netflix reported 301.63 million subscribers as of the fourth quarter of 2024, the last time it reported the metric before shifting priority to revenue over user growth. The company has a roughly $490 billion market cap, and its stock is up more than 60% in the past year.</p><p>Shares are down 4% so far this week.</p><p>\"Is that going to move the needle necessarily? ... You're going to see people sign up on the back of that to counter it,\" CNBC contributor Guy Adami said Wednesday on \"Fast Money.\"</p><p>\"I don't think this is a reason to sell the stock,\" he added.</p><p>Wedbush Securities' Alicia Reese told CNBC that the comments came too late in the third quarter to make any meaningful impact on subscriber counts. </p><p>Still, she said she believes the backlash won't make a major dent and that any impact will be offset by an increase in ad revenue.</p><p>\"Their numbers should come out just fine,\" Reese said. \"I think that shares haven't been hit too hard.\"</p><p>Seymour Asset Management's Tim Seymour said though a day of headlines may move the stock around, Netflix shares are ultimately too expensive to be significantly affected by internet backlash.</p><p>\"We've had these moments in time where, whether it was an ad campaign that went wrong or whether it was some sense that a company was aligned in a particular political channel... I don't think that that's going to be the reason to sell Netflix here,\" Seymour said Wednesday.</p><p>The calls for a boycott mirror those against <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/BUD/\">Anheuser-Busch InBev</a><span><span></span></span></span> in 2023 after it <a target=\"_blank\" href=\"https://www.cnbc.com/2023/06/14/bud-light-beer-sales-trail-modelo-in-may-following-anti-lgbtq-backlash.html\">released</a> an ad campaign with transgender influencer Dylan Mulvaney. But the boycott of Bud Light, CNBC contributor Karen Finerman noted on Wednesday, yielded \"far greater\" destruction than any other recent examples.</p><p>\"I feel like this will be very fleeting,\" Finerman said.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elon Musk is telling his followers to cancel Netflix subscriptions. Here's what's happening",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108152705-17486289872025-05-30t181538z_798494356_rc2iseae2w85_rtrmadp_0_usa-trump.jpeg?v=1748633566&w=1920&h=1080"
      ],
      "datePublished": "2025-10-02T20:46:49.000Z",
      "dateModified": "2025-10-02T20:46:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Report shows hiring at lowest since 2009 as economists turn to alternative data during shutdown blackout",
    "url": "https://www.cnbc.com/2025/10/02/report-shows-hiring-at-lowest-since-2009-as-economists-turn-to-alternative-data-during-shutdown-blackout.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108206736-1759352725609-gettyimages-2238210966-US_JOBS.jpeg?v=1759352801&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-02T15:18:10.000Z",
    "description": "<div><div><p>Job fair signage as job seekers arrive at the Appalachian State University internship and job fair in Boone, North Carolina, US, on Wedne",
    "body": "<div><div><p>Job fair signage as job seekers arrive at the Appalachian State University internship and job fair in Boone, North Carolina, US, on Wednesday, Oct. 1, 2025. </p><p>Allison Joyce | Bloomberg | Getty Images</p></div><div><p>Unemployment changed little in September, while layoff and hiring rates both slowed, according to separate labor market reports Thursday.</p><p>The jobless level barely moved at 4.34%, according to a relatively <a href=\"https://www.chicagofed.org/research/data/chicago-fed-labor-market-indicators/latest-release\" target=\"_blank\">new set of data indicators</a> compiled by the Chicago Federal Reserve. That represented little change from August, though was just 0.01 percentage point away from moving up to 4.4%, the highest level since October 2021.</p><p>In September, the central bank district announced it would be releasing its own dashboard of labor market indicators that also includes the layoff rate, which was little changed monthly at 2.1%, and the hiring rate, which moved lower to 45.2%, down 0.4 percentage point from August.</p><p>Elsewhere in the labor market, outplacement firm Challenger, Gray & Christmas reported that layoff announcements declined 37% in September and were down 26% from the same month a year ago.</p><p>However, the year-to-date level of planning furloughs is the highest since 2020, the year of the Covid pandemic. Challenger said announced cuts have totaled 946,426 through the first three quarters. The figure already is 24% higher than all of 2024.</p></div><h2><a></a>Lowest new hirings since 2009</h2><div><p>At the same time, the firm said hiring plans have receded sharply.</p><p>New hirings totaled just 204,939 so far in 2025, off 58% from the same period a year ago and the lowest level since 2009, when the U.S. economy was still in the throes of the financial crisis.</p><p>\"Previous periods with this many job cuts occurred either during recessions or, as was the case in 2005 and 2006, during the first wave of automations that cost jobs in manufacturing and technology,\" said Andy Challenger, the firm's senior vice president and labor expert.</p><p>Together, the data points fill in some gaps on information that usually comes from the Labor Department.</p><p>However, with the government shutdown entering its second day and no indications of a resolution anytime soon, economists and Fed policymakers will have to rely on data that doesn't come from the government.</p><p>The department normally would have released its weekly count of initial jobless claims on Thursday. Friday's nonfarm payrolls count from the Bureau of Labor Statistics also will be delayed.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Report shows hiring at lowest since 2009 as economists turn to alternative data during shutdown blackout",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108206736-1759352725609-gettyimages-2238210966-US_JOBS.jpeg?v=1759352801&w=1920&h=1080"
      ],
      "datePublished": "2025-10-02T15:18:10.000Z",
      "dateModified": "2025-10-02T15:18:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Corporate borrowers face funding trade-off as PIMCO flags debt market 'cracks'",
    "url": "https://www.cnbc.com/2025/10/02/borrowers-face-funding-trade-off-as-pimco-flags-debt-market-cracks.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108206405-1759329133009-gettyimages-2238127963-AFP_77DK7UB.jpeg?v=1759329199&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-02T09:21:06.000Z",
    "description": "<div><div><p>A trader works on the floor of the New York Stock Exchange (NYSE) at the opening bell on October 1, 2025, in New York City.</p><p>Timothy",
    "body": "<div><div><p>A trader works on the floor of the New York Stock Exchange (NYSE) at the opening bell on October 1, 2025, in New York City.</p><p>Timothy A. Clary | Afp | Getty Images</p></div><div><p>PIMCO President Christian Stracke is upbeat on the asset-based finance segment of the private credit market, but warns of \"cracks\" in corporate direct lending, which makes up the bulk of the sector.</p><p><a target=\"_blank\" href=\"https://www.cnbc.com/chery-kang/\">Speaking with CNBC's </a>Chery Kang at the annual Milken Asia Summit in Singapore Wednesday, Stracke highlighted the widening gap between the two lending spheres.</p><p>\"There are problems [in corporate private credit] where borrowers are going to their lenders and saying, 'Can I not pay you cash interest now, but basically borrow the interest from you and pay it later?' It's called Payment-in-Kind [PIK], and it's fairly prevalent right now,\" Stracke said.</p></div><h2><a></a>Balance sheet divergence</h2><div><p>He referred to asset-based financing as a \"much healthier\" credit environment.</p><p>\"In asset-based financing — residential mortgages, consumer loans, student loans and auto loans — the economy is strong, households are strong, the consumer is strong, and we really aren't seeing cracks that way,\" he added.</p><p>The widening gap stems from the aftermath of the 2008 Global Financial Crisis, which saw consumer borrowers scale back their borrowing and deleverage their household balance sheets, which has helped boost asset-based financing activity. Corporate borrowers, in contrast, have built up their leverage and have \"less clean\" balance sheets.</p><p>In October last year, PIMCO raised more than $2 billion for asset-based specialty financing strategy as part of its continued push into private credit.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108206130-17592796421759279639-41893235216-1080pnbcnews.jpg?v=1759279641&w=750&h=422&vtcrop=y\" alt=\"'Real cracks' showing in the direct lending market within private credit: PIMCO\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>Corporate borrowers also face a trade-off in public versus private debt markets, according to Stracke.</p><p>The smaller number of lenders in private markets means it can be easier for borrowers to renegotiate loan terms in the event of loan pressure — albeit with higher costs.</p></div><h2><a></a>Unfolding opportunities</h2><div><p>More liquid bank debt, on the other hand, comes at a much lower cost, though the refinancing process can be trickier.</p><p>\"It's more difficult with a broadly syndicated bank loan or bond,\" Stracke said. \"We're seeing some real problems in the credit markets. There have been some high-profile defaults in the credit markets — in the public markets — where it's very difficult for the company to negotiate with the lenders to preserve value in the company.\"</p><p>Looking ahead, Stracke said that as the Federal Reserve continues on its path of interest rate cuts, and the overall all-in cost of borrowing comes down, particularly in mortgage rates, there will be more opportunities for PIMCO to take advantage of that demand for credit.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108206122-17592776821759277679-41892888085-1080pnbcnews.jpg?v=1759277682&w=750&h=422&vtcrop=y\" alt=\"We are going to see more IPOs in the first half of next year: Hostplus CEO\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>Meanwhile, David Elia, CEO of Australian superannuation fund Hostplus, said institutional investors in search of portfolio diversification are increasingly drawn to the private markets space – but said regulation should be focused on the retail wealth space.</p><p>Elia told CNBC at the Milken Asia summit that any push for tougher regulation of private markets should center around \"mom-and-dad\" investors who are attracted to the diversifying benefits of the asset class, rather than sophisticated institutional investors.</p><p>\"There are probably about 19,000 companies that are listed on global markets. There are 140,000 private companies who generate in excess of $100 million in U.S. revenue,\" Elia said.</p><p>\"As long-term institutional investors, you will not see the level of concentration, if you're genuine about diversification, in listed markets. Therefore, it's going to drive you towards the unlisted sector, largely around private equity-style types of investments.\"</p><p>He also predicted more IPOs in the coming months.</p><p><em>— CNBC's Nicole Teo and Asriel Chua contributed to this report.</em></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Corporate borrowers face funding trade-off as PIMCO flags debt market 'cracks'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108206405-1759329133009-gettyimages-2238127963-AFP_77DK7UB.jpeg?v=1759329199&w=1920&h=1080"
      ],
      "datePublished": "2025-10-02T09:21:06.000Z",
      "dateModified": "2025-10-02T09:21:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney's image tanks among Republicans, Democrats after Jimmy Kimmel controversy",
    "url": "https://www.cnbc.com/2025/10/02/disney-brand-kimmel-kirk.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203041-1758662527940-IMG_7230.jpg?v=1759420304&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-02T15:48:11.000Z",
    "description": "<div><div><p>Gregg Donovan displays a sign at the El Capitan Entertainment Centre, where \"Jimmy Kimmel Live!\" is recorded to celebrate the show's retu",
    "body": "<div><div><p>Gregg Donovan displays a sign at the El Capitan Entertainment Centre, where \"Jimmy Kimmel Live!\" is recorded to celebrate the show's return on Hollywood Boulevard in Los Angeles, California, U.S. on Sept 23, 2025.</p><p>Gabriel Cortes | CNBC</p></div><div><p>The image for <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/DIS/\">Disney</a><span><span></span></span></span> and its streaming service plunged to multiyear lows after pulling comedian <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/jimmy-kimmel-disney-investors-politics-fiduciary-duty.html\">Jimmy Kimmel</a> temporarily off air, a move that managed to alienate members of both political parties, according to analysis by investment bank Jefferies.</p><p>The firm, using Morning Consult data, shows sentiment for the company and its Disney+ platform have fallen to levels not seen in at least two years. Sentiment from Democrats, who had typically had better views of Disney before the past two weeks, soured more strongly than Republicans. Though both groups showed significant declines.</p><p>\"The last two weeks for Disney have been as eventful to say the least, and have been equally controversial,\" analyst James Heaney wrote in a Thursday note to clients. The analyst noted a recent price hike for Disney+ added to the plunging mood around the brand.</p><p>Disney became a cultural flashpoint after taking Kimmel's late-night comedy show <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/17/charlie-kirk-jimmy-kimmel-abc-disney.html\">briefly off the air</a> in the wake of his comments about slain conservative activist <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/11/who-was-trump-ally-and-conservative-influencer-charlie-kirk.html\">Charlie Kirk</a> last month. ABC made the move after Federal Communications Commission Chair Brendan Carr hinted the network's broadcast license could be yanked. Local ABC-affiliated stations owned by <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NXST/\">Nexstar Media Group</a><span><span></span></span></span> and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/SBGI/\">Sinclair</a><span><span></span></span></span> preempted the show in their areas before Disney's decision.</p></div><div><div><svg width=\"256\" height=\"256\">Stock Chart IconStock chart icon</svg><p><img src=\"https://static-redesign.cnbcfm.com/dist/a54b41835a8b60db28c2.svg\" alt=\"hide content\" /></p></div><p>Disney shares, 1-month</p></div><div><p>Heaney noted that the entertainment giant faced backlash for both Kimmel's original comments and the subsequent move to halt his show's production. And then bring him back.</p><p>Critics of Disney's decision — including Democratic-leaning Hollywood power players — argued that the company was acquiescing to appease President Donald Trump's administration rather than stand up for the First Amendment right of free speech. Kimmel's show returned to <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/jimmy-kimmel-return-ratings-abc-disney.html\">much higher viewership</a> than is typical.</p><p>A chart Heaney shared with clients of the bank's research showed the readings of positive Disney sentiment divided by negative sentient among Democrats, Republicans and all consumers plunging to near zero, the lowest readings going back to before 2024.</p><p>Disney also announced late last month it was <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/disney-plus-new-pricing-streaming-kimmel.html\">upping prices</a> for many of its subscriptions by $2 to $3. The new cost tiers take effect Oct. 21.</p><p>Heaney noted that Disney as a whole saw its highest brand awareness in the past two years. For Disney+ specifically, the jump was much smaller, which the analyst said bodes well from a business perspective for CEO Bob Iger.</p><p>\"This is clearly a PR hit for Disney,\" Heaney said. \"But the data implies a smaller impact on Disney+ than the brand as a whole, which may limit the amount of streaming churn.\"</p><p>Disney shares have dropped 6% over the last month, pulling the stock into the red for 2025. But Heaney reaffirmed his buy rating and $144 price target, which implies nearly 30% upside over Wednesday's close.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney's image tanks among Republicans, Democrats after Jimmy Kimmel controversy",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108203041-1758662527940-IMG_7230.jpg?v=1759420304&w=1920&h=1080"
      ],
      "datePublished": "2025-10-02T15:48:11.000Z",
      "dateModified": "2025-10-02T15:48:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple removes ICE tracking apps after Trump AG pressure",
    "url": "https://www.cnbc.com/2025/10/03/apple-ice-app-trump-bondi.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108196394-1757443834595-108196394-1757443767676-gettyimages-2234532848-_75a6516_i92nrc83.jpg?v=1757443864&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T02:16:40.000Z",
    "description": "<div><div><p>Apple CEO Tim Cook holds a next generation iPhone 17 during an Apple special event at Apple headquarters on September 09, 2025 in Cuperti",
    "body": "<div><div><p>Apple CEO Tim Cook holds a next generation iPhone 17 during an Apple special event at Apple headquarters on September 09, 2025 in Cupertino, California.</p><p>Justin Sullivan | Getty Images</p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AAPL/\">Apple</a><span><span></span></span></span> on Thursday night said that it was removing ICEBlock and other apps from its <a target=\"_blank\" href=\"https://www.cnbc.com/2025/06/04/apple-appeal-epic-games-app-store.html\">App Store</a> that can be used to anonymously report sightings of <a href=\"https://www.ice.gov/\" target=\"_blank\">U.S. Immigration and Customs Enforcement</a> agents.</p><p>The move came after pressure on Apple from <a target=\"_blank\" href=\"https://www.cnbc.com/2025/02/04/senate-confirms-trumps-nominee-pam-bondi-as-attorney-general.html\">Attorney General Pam Bondi</a>, and amid controversy over the Trump administration's aggressive enforcement of immigration law with ICE agents and other authorities.</p><p>The FBI said last week that a gunman whose <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/ice-shooting-dallas-noem.html\">attack on a Dallas ICE facility</a> led to the deaths of two detained immigrants and the wounding of a third detainee had recently searched apps tracking the presence of ICE agents.</p><p>The gunman, Joshua Jahn, <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/dallas-ice-shooter-charlie-kirk-fbi.html\">intended to kill ICE agents</a> in the attack, which ended with him fatally shooting himself, authorities said.</p><p>\"We created the App Store to be a safe and trusted place to discover apps,\" Apple said in a statement to NBC News on Thursday.</p><p>\"Based on information we've received from law enforcement about the safety risks associated with <a href=\"https://www.nbcnews.com/tech/tech-news/iceblock-app-ice-agent-sightings-tops-app-store-white-house-backlash-rcna216327\" target=\"_blank\">ICEBlock</a>, we have removed it and similar apps from the App Store,\" the company said.</p><p><a href=\"https://www.foxbusiness.com/politics/apple-takes-down-ice-tracking-app-after-pressure-from-ag-bondi\" target=\"_blank\">Fox Business</a> first reported Apple's booting of ICEBlock and other similar apps.</p><p>ICEBlock has been downloaded more than 1 million times since it was introduced this year, according to data provided to NBC News by the app tracking firm Appfigures. The app hit a high of nearly 114,000 downloads in a single day on July 1, a day after a CNN article about the app sparked criticism from the Trump administration. </p></div><div><p>Federal agents confront protesters outside of the U.S. Immigration and Customs Enforcement building on September 28, 2025 in Portland, Oregon. </p><p>Mathieu Lewis-rolland | Getty Images</p></div><div><p>Bondi, in a statement to Fox News Digital on Thursday, said, \"We reached out to Apple today demanding they remove the ICEBlock app from their App Store — and Apple did so.\"</p><p>\"ICEBlock is designed to put ICE agents at risk just for doing their jobs, and violence against law enforcement is an intolerable red line that cannot be crossed,\" Bondi said in the statement.</p><p>\"This Department of Justice will continue making every effort to protect our brave federal law enforcement officers, who risk their lives every day to keep Americans safe,\" she said.</p><p>Trump administration border czar Tom Homan, in an interview Thursday night with Fox News' Sean Hannity, said, \"They're gonna investigate these people who put these apps up — because it puts law enforcement at great risk.\"</p><p>CNBC has reached out for comment from ICEBlock's creator, Joshua Aaron.</p><p>ICEBlock, which was introduced on the App Store in April, is free.</p><p>White House Press Secretary Karoline Leavitt, <a href=\"https://x.com/PressSec/status/1971237548711203195\" target=\"_blank\">in a post on X last week</a>, noted that the man who opened fire at the ICE facility in Dallas on Sept. 24 \"was using one of these apps\" to track ICE agents.</p><p>ICEBlock became the top social networking app in the App Store shortly after Leavitt condemned the app during a White House press briefing on June 30.</p><p><a href=\"https://www.cnn.com/2025/06/30/tech/iceblock-app-trump-immigration-crackdown\" target=\"_blank\">CNN, that same day</a>, had published an article on the app that quoted Aaron as saying that he developed ICEBlock after seeing the Trump administration's deportation efforts escalate.</p><p>\"When I saw what was happening in this country, I wanted to do something to fight back,\" Aaron said at the time, suggesting that the immigration enforcement efforts were reminiscent of Nazi Germany.</p><p>\"We're literally watching history repeat itself.\"</p><p><a href=\"https://www.ice.gov/news/releases/statement-ice-acting-director-todd-m-lyons-news-coverage-ice-spotting-app\" target=\"_blank\">ICE's acting director, Todd Lyons</a>, on June 30 said, \"Advertising an app that basically paints a target on federal law enforcement officers' backs is sickening.\"</p><p>\"My officers and agents are already facing a 500% increase in assaults, and going on live television to announce an app that lets anyone zero in on their locations is like inviting violence against them with a national megaphone,\" Lyons said.</p><p>But Aaron, in <a href=\"https://www.nbcnews.com/tech/tech-news/iceblock-app-ice-agent-sightings-tops-app-store-white-house-backlash-rcna216327\" target=\"_blank\">an NBC interview days later</a>, called the Trump administration's criticism of ICEBlock \"another right-wing fearmongering scare tactic.\"</p><p>He said he designed the app to help immigrants who are afraid of being deported.</p><p>\"I grew up in a Jewish household, and being part of the Jewish community, I had the chance to meet Holocaust survivors and learn the history of what happened in Nazi Germany, and the parallels that we can draw between what's happening right now in our country and Hitler's rise to power are undeniable,\" Aaron said.</p><p><em><strong>— CNBC's </strong></em><a target=\"_blank\" href=\"https://www.cnbc.com/lora-kolodny/\"><em><strong>Lora Kolodny</strong></em></a><em><strong> contributed to this story.</strong></em></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple removes ICE tracking apps after Trump AG pressure",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108196394-1757443834595-108196394-1757443767676-gettyimages-2234532848-_75a6516_i92nrc83.jpg?v=1757443864&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T02:16:40.000Z",
      "dateModified": "2025-10-03T02:16:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump touts shutdown as 'unprecedented opportunity' to cut more Democratic priorities",
    "url": "https://www.cnbc.com/2025/10/02/trump-government-shutdown-updates-vought.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108197825-17576244342025-09-11t205631z_365662535_rc2wpga0d46c_rtrmadp_0_usa-trump.jpeg?v=1757624489&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-02T21:38:33.000Z",
    "description": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108205778-1759245879157-gettyimages-2237901832-dems_shutdown_068_093025.jpeg?v=1759424008",
    "body": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108205778-1759245879157-gettyimages-2237901832-dems_shutdown_068_093025.jpeg?v=1759424008&w=750&h=422&vtcrop=y\" alt=\"Why health care is at the center of the U.S. government shutdown\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> on Thursday said Democrats have given him an \"unprecedented opportunity\" to slash federal agencies, signaling plans to harm his political opponents during the 2-day-old <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/government-shutdown-trump-live-updates.html\">government shutdown</a> while blaming them for causing it.</p><p>Trump's warning came a day after his administration froze about $18 billion for two major <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/trump-new-york-funding-infrastructure-vought.html\">infrastructure projects in New York City</a> and <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/energy-department-cancels-green-projects-in-united-states.html\">canceled roughly $8 billion</a> more for <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/trump-green-new-deal-funding-states-vought.html\">climate-related projects</a> in Democratic-leaning states.</p><p>The top Democrats leading the shutdown fight, Sen. Chuck Schumer and Rep. Hakeem Jeffries, both represent New York.</p><p>Both of the funding halts were first announced by <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-government-shutdown-layoffs-omb.html\">Russell Vought</a>, the director of the White House's Office of Management and Budget, not by the departments that have oversight of the projects.</p><p>Trump said he will soon meet with Vought \"to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut.\"</p><p>The two men will also weigh \"whether or not those cuts will be temporary or permanent,\" Trump wrote <a href=\"https://truthsocial.com/@realDonaldTrump/posts/115304455138824245\" target=\"_blank\">on Truth Social</a>.</p><p>\"I can't believe the Radical Left Democrats gave me this unprecedented opportunity,\" he added.</p><p>The Trump administration, in a memo released by Vought's OMB, had warned federal agencies last week to prepare for <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-government-shutdown-layoffs-omb.html\">mass firings</a> in the event of a shutdown.</p><p>Trump, asked about that memo, said, \"there could be firings and that's their fault.\"</p><p>\"We could cut projects that they wanted, favorite projects, and they'd be permanently cut,\" he said in a recent <a href=\"https://x.com/OANN/status/1973542010373189709\" target=\"_blank\">interview</a> with conservative news outlet OAN.</p><p>Top White House officials — including Vought and Vice President <a target=\"_blank\" href=\"https://www.cnbc.com/jd-vance-us-vice-president/\">JD Vance</a> — said Wednesday that those firings would begin within days.</p><p>And White House press secretary Karoline Leavitt said Thursday that the number of federal layoffs is \"likely going to be in the thousands.\"</p><p>It was unclear when Trump and Vought were scheduled to meet. The White House responded to a request for details about the meeting with an automated message blaming Democrats for the shutdown and warning that its correspondence with the press may be delayed as a result.</p><p>Vought was a key author of Project 2025, the conservative blueprint for massively reforming the U.S. government.</p><p>Trump repeatedly disavowed Project 2025 while running for president, saying he and his campaign had \"nothing to do with it.\"</p><p>But in Thursday's post, Trump touted Vought as \"he of PROJECT 2025 Fame.\"</p></div><div><h2>Read more CNBC government shutdown coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/government-shutdown-trump-live-updates.html\">Government shutdown live updates: Senate set to vote again on funding bills</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-meeting-democrats-government-shutdown.html\">'We're headed to a shutdown,' Vance says after Trump meeting with leaders ends</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-health-government-shutdown-jeffries-schumer.html\">Democrats refuse to cave on health care before meeting with Trump on government shutdown</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/trump-mass-firings-government-shutdown.html\">Trump threatens mass firings of federal workers if shutdown isn't averted, NBC News reports</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/government-shutdown-trump-democrats-republicans-health-care.html\">GOP leaders say Obamacare tax credit fight can wait until after shutdown is averted</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/trump-government-shutdown-golf-jeffries-ryder-cup.html\">Top Democrat slams Trump for attending Ryder Cup golf event as shutdown looms</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/government-shutdown-jobs-economy-trump.html\">Here's what to know about a federal government shutdown</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/health-aca-obamacare-federal-government-shutdown.html\">Health providers could lose $32 billion if ACA credits at center of shutdown fight expire</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-healthcare-government-shutdown-congress.html\">Democrats dig in on health care demands with government shutdown days away</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-government-shutdown-layoffs-omb.html\">Trump OMB orders prep for mass firings of federal workers if government shuts down</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-democrats-shutdown-schumer-jeffries.html\">Trump cancels meeting with top Democrats as government shutdown looms</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/trump-schumer-jeffries-government-funding-.html\">Trump to meet top Dems as their health care demands fuel government shutdown risk</a></li></ul></div></div><div><p>The federal shutdown began Wednesday after a divided Congress could not pass a bill to keep the government fully funded past the fiscal year that ended Tuesday.</p><p>Republicans, who hold the White House and slim majorities in the House and Senate, wanted to pass a stopgap bill to maintain funding at current levels until late November.</p><p>Democrats, whose support is needed to overcome the 60-vote Senate filibuster, want any short-term funding to include an extension of enhanced Obamacare tax credits, which are due to lapse at year's end. The enhanced subsidies reduce the costs of health insurance premiums for a wider swath of Affordable Care Act enrollees.</p><p>Treasury Secretary Scott Bessent said Thursday morning on CNBC's \"<a target=\"_blank\" href=\"https://www.cnbc.com/squawk-box-us/\">Squawk Box</a>\" that Democrats are negotiating like \"terrorists.\"</p><p>Bessent also said he \"can guarantee there's not going to be an agreement\" with regard to the dispute over the ACA credits.</p><p>Past government shutdowns have cause hundreds of thousands of federal workers to be furloughed, meaning placed on unpaid leave. But they generally are guaranteed back pay upon their return once the government reopens.</p><p>Vance, asked Wednesday why the Trump administration is gearing up to fire workers instead of merely furlough them, said, \"We haven't made any final decisions about what we're going to do with certain workers.\"</p><p>\"What we're saying is that we might have to take extraordinary steps, especially the longer this goes on,\" he said.</p><p>Competing short-term funding bills that were reintroduced by Republicans and Democrats both failed to pass the Senate on Wednesday.</p><p>No votes were scheduled for Thursday due to the Jewish holiday Yom Kippur, meaning the shutdown will last until at least Friday.</p><p>Senate Majority Leader John Thune, R-S.D., said his chamber will vote again on Republicans' stopgap measure on Friday.</p><p><strong>This is developing news. Please refresh for updates.</strong></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump touts shutdown as 'unprecedented opportunity' to cut more Democratic priorities",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108197825-17576244342025-09-11t205631z_365662535_rc2wpga0d46c_rtrmadp_0_usa-trump.jpeg?v=1757624489&w=1920&h=1080"
      ],
      "datePublished": "2025-10-02T21:38:33.000Z",
      "dateModified": "2025-10-02T21:38:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FICO provider is shaking up its credit score business. Its stock is surging",
    "url": "https://www.cnbc.com/2025/10/02/fico-provider-is-shaking-up-its-credit-score-business-its-stock-is-surging.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107407128-1714158389666-gettyimages-1232974880-PGONCHAR_W4833.jpeg?v=1759419823&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-02T20:30:03.000Z",
    "description": "<div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/FICO/\">Fair Isaac</a><span><span></span></span></span>, the creator of the FIC",
    "body": "<div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/FICO/\">Fair Isaac</a><span><span></span></span></span>, the creator of the FICO score, saw shares rally more than 20% on Thursday after it unveiled a new pricing model that will allow mortgage lenders to bypass credit bureaus for credit scores.</p><p>The Montana-based data analytics company said it would license its credit scores directly to mortgage resellers who can then distribute FICO scores directly to borrowers. The score is used by nearly 90% of lenders to evaluate a borrower's credit risk. <a href=\"https://www.ficoscore.com/faqs-about-fico-scores-us\" target=\"_blank\">FICO scores</a> generally range from 300 to 850, with higher scores reflecting lower credit risk.</p><p>The pop in Fair Isaac's stock is its largest percent increase since Nov. 22. The shares are down about 9% this year.</p><p>Under the <a href=\"https://www.fico.com/en/newsroom/fico-launches-cost-cutting-direct-license-program-mortgage-lending\" target=\"_blank\">new plan</a>, lenders will have the option of choosing between two pricing models. \"This change eliminates unnecessary mark-ups on the FICO Score and puts pricing model choice in the hands of those who use FICO Scores to drive mortgage decisions,\" Fair Isaac CEO Will Lansing said in the release.</p><p>Shares of credit bureaus <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/EXPN-GB/\">Experian</a><span><span></span></span></span>, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/TRU/\">TransUnion</a><span><span></span></span></span> and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/EFX/\">Equifax</a><span><span></span></span></span> fell between 4% and 10% each as investors saw Fair Isaac's announcement as possibly lessening the importance of their businesses. Fair Isaac plans to offer both of its mortgage score pricing models to the three credit bureaus on the same terms.</p></div><div><div><svg width=\"256\" height=\"256\">Stock Chart IconStock chart icon</svg><p><img src=\"https://static-redesign.cnbcfm.com/dist/a54b41835a8b60db28c2.svg\" alt=\"hide content\" /></p></div><p>Fair Isaac stock performance over the past year.</p></div><div><p>\"The new pricing scheme will offer lenders a choice of both pricing model and distribution model, the former of which we think will improve FICO's economics and the latter of which we think will ultimately disintermediate credit bureaus from their current ~100% mark-up on the FICO score,\" Patrick O'Shaughnessy, a Raymond James analyst, said in a note, reiterating Fair Isaac's outperform rating.</p><p>Bill Pulte, Federal Housing Finance Agency director, said in a Thursday morning X post that Fair Isaac's move marks an effort to \"generate Creative Solutions to help the American consumer.\"</p><p>Pulte, who in late July <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/31/fico-ceo-defends-credit-score-pricing-amid-fhfa-criticism.html\">had criticized Fair Isaac as a \"monopoly\" with unfair credit score price hikes</a>, added \"I encourage the Credit Bureau's to also take similar creative and constructive actions to make our markets safer, stronger, and more competitive.\"</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FICO provider is shaking up its credit score business. Its stock is surging",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107407128-1714158389666-gettyimages-1232974880-PGONCHAR_W4833.jpeg?v=1759419823&w=1920&h=1080"
      ],
      "datePublished": "2025-10-02T20:30:03.000Z",
      "dateModified": "2025-10-02T20:30:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Intel stock is up 50% over the last month, putting U.S. stake at $16 billion",
    "url": "https://www.cnbc.com/2025/10/02/intel-stock-us-trump-stake.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108201303-1758295013956-gettyimages-2235610710-INTEL_NVIDIA.jpeg?v=1759422910&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-02T19:33:51.000Z",
    "description": "<div><div><p>Signage outside the Intel headquarters in San Jose, California, US, on Thursday, Sept. 18, 2025.</p><p>David Paul Morris | Bloomberg | Ge",
    "body": "<div><div><p>Signage outside the Intel headquarters in San Jose, California, US, on Thursday, Sept. 18, 2025.</p><p>David Paul Morris | Bloomberg | Getty Images</p></div><div><p>Shares of U.S. chipmaker <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/INTC/\">Intel</a><span><span></span></span></span> climbed 3% Thursday, putting the monthly gain over 50%.</p><p>The surge pushed the stock past $37, hiking the value of the U.S. government's <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/22/intel-goverment-equity-stake.html\">10% stake</a> in Intel to roughly $16 billion.</p><p>The Trump administration negotiated an $8.9 billion investment in Intel common stock in August, purchasing 433.3 million shares at $20.47 per share.</p><p>Press secretary <a href=\"https://x.com/PressSec/status/1973781670072660219\" target=\"_blank\">Karoline Leavitt</a> celebrated the surge with a post on X from the Association of Mature American Citizens, a conservative organization.</p><p>The equity stake is being funded by grants previously awarded to Intel under former President Joe Biden's U.S. CHIPS and Science Act, according to a <a href=\"https://www.intc.com/news-events/press-releases/detail/1748/intel-and-trump-administration-reach-historic-agreement-to\" target=\"_blank\">release</a>.</p><p>The company has already received $2.2 billion from CHIPS grants and is set to receive another $5.7 billion. An additional $3.2 billion from a separate government program will also be awarded.</p><p>\"President Trump's focus on U.S. chip manufacturing is driving historic investments in a vital industry that is integral to the country's economic and national security,\" CEO Lip Bu-Tan said in a release.</p></div><div><h2>Read more CNBC tech news</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/openai-share-sale-500-billion-valuation.html\">OpenAI wraps $6.6 billion share sale at $500 billion valuation</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/tokenization-of-assets-is-freight-train-coming-to-markets-robinhood-ceo.html\">Tokenization of real world assets is an unstoppable 'freight train' coming to major markets: Robinhood CEO</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/taiwan-us-chip-production-tsmc-trade-tariffs.html\">Taiwan rejects U.S. proposal for '50-50′ chip production, says trade talks focused on tariffs</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/nasa-employees-on-spacex-artemis-missions-to-work-through-shutdown.html\">NASA employees on Artemis missions with SpaceX, Blue Origin to work through shutdown</a></li></ul></div></div><div><p>Along with the government, Intel has been collecting other major investors, including <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/18/intel-is-getting-a-2-billion-investment-from-softbank.html\">Softbank</a> and, more recently, Nvidia. The GPU giant <a href=\"https://nvidianews.nvidia.com/news/nvidia-and-intel-to-develop-ai-infrastructure-and-personal-computing-products\" target=\"_blank\">announced</a> in September that it would invest $5 billion in Intel as part of a collaboration to co-develop data centers and PC products.</p><p>The company's multiple backings have helped the troubled chipmaker bounce back after shares hit the lowest in over a decade earlier this year.</p><p>Intel's difficult fiscal 2024 saw shares drop 60% in value, their worst year on record, which was followed by then-CEO <a target=\"_blank\" href=\"https://www.cnbc.com/2024/12/02/intel-ceo-pat-gelsinger-is-out.html\">Pat Gelsinger's exit</a> in December.</p><p>Some confidence is being restored as Intel shares are currently trading at their highest level in 18 months under Bu-Tan's leadership.</p><p>Intel shares also <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/intel-stock-amd-chips.html\">jumped 7%</a> on Wednesday after news that the company is in early talks with <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AMD/\">AMD</a><span><span></span></span></span> to add the hardware-maker as a customer.</p></div><div><div><svg width=\"256\" height=\"256\">Stock Chart IconStock chart icon</svg><p><img src=\"https://static-redesign.cnbcfm.com/dist/a54b41835a8b60db28c2.svg\" alt=\"hide content\" /></p></div><p>Intel year-to-date stock chart.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Intel stock is up 50% over the last month, putting U.S. stake at $16 billion",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108201303-1758295013956-gettyimages-2235610710-INTEL_NVIDIA.jpeg?v=1759422910&w=1920&h=1080"
      ],
      "datePublished": "2025-10-02T19:33:51.000Z",
      "dateModified": "2025-10-02T19:33:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration cancels nearly $8 billion in climate funding to blue states: Vought",
    "url": "https://www.cnbc.com/2025/10/01/trump-green-new-deal-funding-states-vought.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108206621-1759342648593-gettyimages-2237801812-US_GOV_FUNDING.jpeg?v=1759351765&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-01T20:58:45.000Z",
    "description": "<div><div><p>U.S. House Speaker Mike Johnson, a Republican from Louisiana, from left; Russell Vought, director of the Office of Management and Budget;",
    "body": "<div><div><p>U.S. House Speaker Mike Johnson, a Republican from Louisiana, from left; Russell Vought, director of the Office of Management and Budget; Senate Majority Leader John Thune, a Republican from South Dakota; and U.S. Vice President JD Vance speak to members of the media following a meeting at the White House in Washington, D.C., on Sept. 29, 2025.</p><p>Annabelle Gordon | Bloomberg | Getty Images</p></div><div><p>The <a target=\"_blank\" href=\"https://www.cnbc.com/2025/05/27/harvard-trump-administration-cut-federal-contracts.html\">Trump administration</a> has canceled nearly $8 billion in funding for climate-related projects in primarily Democratic-controlled states, a top administration official said on Wednesday.</p><p>The move came hours after the same official, <a href=\"https://www.whitehouse.gov/omb/\" target=\"_blank\">Office of Management and Budget</a> Director <a target=\"_blank\" href=\"https://www.cnbc.com/video/2025/06/03/omb-director-russell-vought-reacts-on-elon-musks-budget-bill-comments.html\">Russell Vought</a>, revealed that the Trump administration <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/trump-new-york-funding-infrastructure-vought.html\">had frozen about $18 billion in federal funding</a> to two major infrastructure projects in New York City.</p><p>\"Nearly $8 billion in Green New Scam funding to fuel the Left's climate agenda is being cancelled,\" Vought wrote in a <a href=\"https://x.com/russvought/status/1973450301236715838\" target=\"_blank\">post</a> on the social media site X, on the same day the federal government shut down after Congress did not pass a stopgap funding bill.</p></div><div><h2>Read more CNBC politics coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-israel-gaza-hamas-peace-plan.html\">Watch: Trump details plan to end Israel war with Hamas in Gaza</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-health-government-shutdown-jeffries-schumer.html\">Democrats refuse to cave on health care before Trump government shutdown meeting</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-zohran-mamdani-eric-adams-new-york-mayor.html\">Trump bashes Zohran Mamdani after Eric Adams drops out of New York mayor's race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-movie-furniture-tariffs.html\">Trump 'Truths' about tariffs on films and furniture raise questions on details</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/trump-mass-firings-government-shutdown.html\">Trump threatens mass firings if shutdown isn't averted: NBC News</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/government-shutdown-trump-democrats-republicans-health-care.html\">Republicans say Obamacare tax credit fight can wait until after shutdown averted</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/jd-vance-trump-tiktok-china-bytedance.html\">JD Vance on Tiktok: U.S. 'successfully separated' TikTok from China's ByteDance</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/eric-adams-new-york-city-mayor-race-trump-.html\">Eric Adams drops out of New York City mayoral race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/27/trump-cartoon-firing-powell-fed.html\">President Trump posts cartoon image depicting him firing Fed Chief Powell</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/trump-fed-cook-scotus-markets.html\">Markets won't care if Trump fires Fed Governor Cook, DOJ tells Supreme Court</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/howard-rubin-sex-trafficking-new-york-investment.html\">Money manager Howard Rubin detained on sex trafficking charges</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/james-comey-indicted-fbi-trump.html\">Former FBI Director James Comey indicted after Trump called for charges</a></li></ul></div></div><div><p>\"More info to come from @ENERGY,\" wrote Vought, referring to the U.S. Department of Energy.</p><p>Vought said the projects affected by the decision are in California, Colorado, Connecticut, Delaware, Hawaii, Illinois, Maryland, Massachusetts, Minnesota, New Hampshire, New Jersey, New Mexico, New York, Oregon, Vermont and Washington state.</p><p>In the 2024 election, President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> lost those states to then-Vice President Kamala Harris, the Democratic nominee whom he defeated in the Electoral College.</p><p>CNBC has requested comment from the DOE.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration cancels nearly $8 billion in climate funding to blue states: Vought",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108206621-1759342648593-gettyimages-2237801812-US_GOV_FUNDING.jpeg?v=1759351765&w=1920&h=1080"
      ],
      "datePublished": "2025-10-01T20:58:45.000Z",
      "dateModified": "2025-10-01T20:58:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "With S&P 500 near record highs, it's time to reconsider the set-it-and-forget-it strategy, some experts say",
    "url": "https://www.cnbc.com/2025/10/02/sp-500-set-it-and-forget-it-strategy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106819384-1609876116428-gettyimages-1169704952-tdp03777.jpeg?v=1759257255&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-02T14:44:17.000Z",
    "description": "<div><div><p>Trevor Williams | DigitalVision | Getty Images</p></div><div><p>The <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/.SPX/\">S&P",
    "body": "<div><div><p>Trevor Williams | DigitalVision | Getty Images</p></div><div><p>The <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/.SPX/\">S&P 500 index</a><span><span></span></span></span> closed at a new <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/stock-market-today-live-updates.html\">all-time high</a> on Wednesday amid a federal government shutdown. It rose to a new intraday high early Thursday.</p><p>Prior to that, the index — which is focused on large-cap U.S. equities — had risen almost 90% since the equity bull market began three years ago, thanks in large part to new AI developments, <a href=\"https://www.morganstanley.com/pub/content/dam/mscampaign/wealth-management/wmir-assets/gic-weekly.pdf\" target=\"_blank\">Morgan Stanley Wealth Management</a> noted in Sept. 29 research.</p><p>Nevertheless, experts say it may be time to reconsider the set-it-and-forget-it S&P 500-focused strategy, <a target=\"_blank\" href=\"https://www.cnbc.com/2024/10/09/warren-buffetts-sp-500-bet-paid-off-some-experts-say-it-may-be-time-to-diversify.html\">famously touted</a> by legendary investor Warren Buffett.</p><p>\"The S&P 500 is broken,\" said Michael DeMassa, who is a certified financial planner and chartered financial analyst, and the founder of Forza Wealth Management in Sarasota, Florida.</p><p>Many investors assume investing in the S&P 500 index — through ETF ticker symbols <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/SPY/\">SPY</a><span><span></span></span></span>, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/VOO/\">VOO</a><span><span></span></span></span> or <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/IVV/\">IVV</a><span><span></span></span></span> — is synonymous with diversification, DeMassa said.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108205169-17591634351759163432-41873519157-1080pnbcnews.jpg?v=1759163434&w=750&h=422&vtcrop=y\" alt=\"Year-end rally or a reversal ahead?\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>Yet that sense of safety is an illusion, he said, since the market capitalization-weighted index means companies with bigger allocations may drag down the fund if their performance suffers. Or the index's heavy concentration in the technology sector may prompt volatility to ripple through the entire index, DeMassa said.</p><p>If you can invest in the S&P 500 index for a long time, you will probably do well, said Deva Panambur, a CFP and CFA, and founder of Sarsi LLC in West New York, New Jersey.</p><p>But occasionally the index suffers long periods of underperformance, he said. For example, between 2000 and 2008, the S&P 500 was down by more than 30%.</p><p>Wall Street <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/goldman-sachs-raises-sp-500-target-for-year-end.html\">forecasts</a> generally see the index continuing to go up for the foreseeable future.</p><p>Still, experts say it's best to choose a broader investment mix in case there is a pullback.</p></div><h2><a></a>How to best diversify your investments now</h2><div><p>For investors who are seeking a simple approach, it may make sense to opt for a total market index fund instead of an S&P 500 index fund, according to Brendan McCann, associate manager research analyst at Morningstar.</p><p>Unlike S&P 500 index funds, total market funds also provide exposure to small- and mid-cap stocks in addition to large-cap companies.</p><p>Alternatively, investors may opt to broaden the exposure an S&P 500 index fund already provides in their portfolio. One example may be a fund that tracks a total market index that excludes S&P 500 index stocks, or the Vanguard Extended Market ETF, according to McCann.</p></div><div><p>The trick with that strategy is to buy the funds in the right proportion, McCann said.</p><p>For investors who don't want to worry about changing their asset allocations over time, buying a total market index fund may be a better approach, according to McCann. Switching to a total market index fund strategy may be particularly attractive for investors who don't have to worry about the tax implications of changing funds, such as 401(k) investors, he said.</p><p>Other experts have recommended opting for equal-weighted S&P 500 index funds, which hold an equal proportion of each stock. However, the downside with those strategies is that there may be more transaction costs when rebalancing, McCann said.</p><p>When the S&P 500's returns were down between 2002 and 2009, areas like small cap, value, international and even bonds performed better than stocks, Panambur said.</p><p>Today, the portfolios he creates for clients have allocations to those areas.</p><p>\"When I look at the overall allocation, my goal is to make sure it's more balanced than the S&P 500,\" Panambur said.</p></div><div><p>The set-it-and-forget-it S&P 500 strategy was intended to provide broad market exposure. \"That's no longer the case,\" DeMassa said.</p><p>As investors seek to diversify, it is important to pay attention to the holdings of each of the funds they own, he said.</p><p>If a portfolio has funds tracking both the S&P 500 and Vanguard Growth indexes, for example, the exposure to large-cap technology names will be increased rather than limited, he said.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "With S&P 500 near record highs, it's time to reconsider the set-it-and-forget-it strategy, some experts say",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106819384-1609876116428-gettyimages-1169704952-tdp03777.jpeg?v=1759257255&w=1920&h=1080"
      ],
      "datePublished": "2025-10-02T14:44:17.000Z",
      "dateModified": "2025-10-02T14:44:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shutdown fallout: Energy Dept. axes billions for green projects in blue states",
    "url": "https://www.cnbc.com/2025/10/02/energy-department-cancels-green-projects-in-united-states.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108188096-17556190142025-08-19t155613z_1525802786_rc2fagafsx3b_rtrmadp_0_usa-trump.jpeg?v=1755619057&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T00:38:47.000Z",
    "description": "<div><div><p>U.S. Department of Energy Secretary Chris Wright walks near the West Wing of the White House in Washington, D.C., U.S., August 19, 2025. ",
    "body": "<div><div><p>U.S. Department of Energy Secretary Chris Wright walks near the West Wing of the White House in Washington, D.C., U.S., August 19, 2025. </p><p>Nathan Howard | Reuters</p></div><div><p>The <a href=\"https://www.energy.gov/articles/energy-department-announces-termination-223-projects-saving-over-75-billion\" target=\"_blank\">Energy Department</a>'s cancellation of more than 300 funding awards to projects in 16 states won by <a target=\"_blank\" href=\"https://www.cnbc.com/2024/10/25/jeff-bezos-killed-washington-post-endorsement-of-kamala-harris-.html\">Democratic nominee Kamala Harris</a> in the 2024 presidential election slammed the brakes on efforts to reduce carbon emissions, air and water pollution, and strengthen electrical grids.</p><p>The<a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/trump-green-new-deal-funding-states-vought.html\"> elimination of nearly $8 billion in funding</a> for more than 200 projects could result in the loss of tens of thousands of jobs that would have been created by the projects, and undercut the Trump administration's own stated goals of boosting American manufacturing competitiveness, critics said.</p><p>The cuts were announced on Wednesday, the first day of the federal <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/government-shutdown-trump-live-updates.html\">government shutdown</a>. Earlier Wednesday, the Trump administration froze a whopping <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/trump-green-new-deal-funding-states-vought.html\">$18 billion in funding for two massive infrastructure projects in New York City</a> — the home of Congress's two top Democrats.</p><p>President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> and congressional Republicans have blamed Democrats for the shutdown.</p><p>Senate Minority Leader Chuck Schumer, D-N.Y., on Thursday, referring to the Energy Department's funding cancellations, said, \"Instead of playing politics with the shutdown, President Trump should be working on bipartisan solutions to lower Americans' costs and create jobs.\"</p><p>\"This goes beyond targeting blue states. It's taking a wrecking ball to working families' lives: putting construction workers out of a job and raising families' electric bills for political gain,\" Schumer said.</p><p>While some of the department's cancellations first announced by <a href=\"https://www.whitehouse.gov/omb/\" target=\"_blank\">Office of Management and Budget</a> Director <a target=\"_blank\" href=\"https://www.cnbc.com/video/2025/10/01/omb-director-russell-vought-govt-shutdown-means-layoffs-are-coming-in-1-2-days.html\">Russell Vought</a> were new, others had been previously announced in May by the department.</p><p>Vought likewise trumpeted the funding freeze for a project to build a new rail tunnel connecting New Jersey to New York under the Hudson River, and to extend the Second Avenue subway in Manhattan, before the Department of Transportation formally announced the move.</p></div><div><p>A list circulated by the Energy Department on Capitol Hill on Thursday of all the cuts it was touting included some, but not all, of the May cuts. Cuts from May that affected projects in states that Trump won in the 2024 election were not included in the list, and none of the new cuts were in such states.</p><p>The rescinded awards had been issued by the Energy Department's Offices of Clean Energy Demonstrations, Energy Efficiency and Renewable Energy, Grid Deployment, Manufacturing and Energy Supply Chains, Advanced Research Projects Agency-Energy, and Fossil Energy.</p><p>\"There would have been significant emissions reductions from these projected,\" said Ian Wells, a senior advocate at the <a href=\"https://action.nrdc.org/donation/3568-trump-ads-11727?initms=MRDAFGO_c3-FR_SE&ms=MRDAFGO_c3-FR_SE&utm_medium=cpc&utm_source=google&utm_campaign=fundraising&gclsrc=aw.ds&gad_source=1&gad_campaignid=688996079\" target=\"_blank\">National Resources Defense Counci</a>l, an advocacy group. \"Not only greenhouse emissions, but things that would lead to green air and water,\" Wells said.</p><p>Wells noted that another large funding grant, which was cancelled in May, was $500 million earmarked for the <a href=\"https://www.nationalcement.com/news-main/lebec-net-zero-project\" target=\"_blank\">Lebec Net-Zero</a> project in Lebec, California, which aimed to produce carbon-neutral cement.</p><p>A similar, smaller project in Holyoke, Massachusetts, had awarded $87 million to <a href=\"https://sublime-systems.com/sublime-systems-selects-site-in-holyoke-massachusetts-for-first-commercial-kiloton-scale-manufacturing-of-its-low-carbon-cement/\" target=\"_blank\">Sublime Systems</a> to build low-carbon cement manufacturing, which would have created between 70 and 90 jobs, Wells said.</p><p>Those projects \"seemed to be in line with the administration's priorities\" of reinvigorating American manufacturing and competing with overseas competitors, with the benefit of helping the environment, he said.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108207251-5ED4-REQ-100225-EmilyWilkinsGovtShutdown-V2.jpg?v=1759438076&w=750&h=422&vtcrop=y\" alt=\"Why government shutdowns cost taxpayers money\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>\"It's potentially a 'win-win-win,' and that is potentially now being thrown out,\" Wells said.</p><p>The Energy Department did not release the details of the 223 projects affected by the funding termination.</p><p>But Democrats on the House Appropriations Committee <a href=\"https://democrats-appropriations.house.gov/sites/evo-subsites/democrats-appropriations.house.gov/files/evo-media-document/doe-project-terminations-oct-2025.pdf\" target=\"_blank\">compiled a list of affected projects</a> and released it on Thursday afternoon.</p><p>\"The termination of these critical energy projects will increase energy prices, eliminate jobs, and make the energy grid less reliable,\" the group said.</p></div><div><p>The terminated funding included $1.2 billion for a hydrogen hub in California under the so-called ARCHES program — <a href=\"https://archesh2.org/arches-ceo-angelina-galiteva-on-does-decision-to-cut-federal-funding-for-california-hydrogen-hub/\" target=\"_blank\">The Alliance for Renewable Clean Hydrogen Energy Systems</a>.</p><p>\"Today's decision to withdraw federal funding for ARCHES ignores the critical benefits our projects will deliver – including 220,000 American jobs and stronger national energy security and resilience,\" said ARCHES CEO Angelina Galiteva in a statement.</p><p>\"The ARCHES Ecosystem and Marketplace will continue to advance in collaboration with state leaders and private sector innovators – building on our strong foundation to create a reliable, future-focused domestic hydrogen network for California and beyond.\"  </p><p>Another $1.1 billion in grants for energy projects across Washington state, including the <a href=\"https://pnwh2.com/\" target=\"_blank\">Pacific Northwest Hydrogen Hub</a>, were cancelled by the Energy Department, according to Washington state officials.</p></div><div><h2>Read more CNBC politics coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-israel-gaza-hamas-peace-plan.html\">Watch: Trump details plan to end Israel war with Hamas in Gaza</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-health-government-shutdown-jeffries-schumer.html\">Democrats refuse to cave on health care before Trump government shutdown meeting</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-zohran-mamdani-eric-adams-new-york-mayor.html\">Trump bashes Zohran Mamdani after Eric Adams drops out of New York mayor's race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-movie-furniture-tariffs.html\">Trump 'Truths' about tariffs on films and furniture raise questions on details</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/trump-mass-firings-government-shutdown.html\">Trump threatens mass firings if shutdown isn't averted: NBC News</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/government-shutdown-trump-democrats-republicans-health-care.html\">Republicans say Obamacare tax credit fight can wait until after shutdown averted</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/jd-vance-trump-tiktok-china-bytedance.html\">JD Vance on Tiktok: U.S. 'successfully separated' TikTok from China's ByteDance</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/eric-adams-new-york-city-mayor-race-trump-.html\">Eric Adams drops out of New York City mayoral race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/27/trump-cartoon-firing-powell-fed.html\">President Trump posts cartoon image depicting him firing Fed Chief Powell</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/trump-fed-cook-scotus-markets.html\">Markets won't care if Trump fires Fed Governor Cook, DOJ tells Supreme Court</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/howard-rubin-sex-trafficking-new-york-investment.html\">Money manager Howard Rubin detained on sex trafficking charges</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/james-comey-indicted-fbi-trump.html\">Former FBI Director James Comey indicted after Trump called for charges</a></li></ul></div></div><div><p>\"That hub will create a clean hydrogen economy across our region,\" Washington Gov. Bob Ferguson said in a statement to CNBC.</p><p>\"It is outrageous that this administration is using a government shutdown to punish blue states like Washington,\" Ferguson said. \"We're working with the Attorney General's Office to fight this illegal action.\"</p><p>Chris Green, president of the Pacific Hydrogen Association, called the cancellation of federal funds for the hub \"a gut punch.\"</p><p>\"We are, of course, very disappointed in that,\" Green told CNBC, noting that the project could have led to tens of thousands or even hundreds of thousands of jobs.</p><p>He said that companies involved in the hub \"were spending lots of their own money,\" with about 80% of the committed funds being provided by private companies, with federal funds providing the remaining 20% or so of the costs.</p><p>\"Can we still do this project now that we've lost 20% of our planned revenue?\" Green asked. \"It remains to be seen if some of these projects can persevere.\"</p><p>The Colorado Energy Office said that more than 30 grants totalling more than $500 million \"are being illegally terminated in Colorado alone.</p><p>Two of those grants each provide $2.5 million to support reduced energy use and create cost savings through building energy codes and building performance standards through decarbonization, the office said.</p><p>\"Other terminated grants in Colorado range from oil and gas methane reduction projects and investments in grid resilience to support for utility programs in low-income communities,\" the office said.</p><p>\"This clearly politically motivated targeting of grants by the Administration will balloon energy costs, threaten grid reliability, increase pollution, and create instability in our business community,\" the office said.</p><p>In New Mexico, 10 projects had more than $135 million of Energy Department funding cancelled. </p><p>Four of them were under the auspices of the New Mexico Institute of Mining and Technology, including one with $42.7 million from the Energy Department to \"develop a storage hub at a commercial scale within San Juan basin to verify these sites can securely store 50 million tons of CO2,\" according to the office of Sen. Martin Heinrich, D-N.M.</p><p>Heinrich, the ranking Democrat on the Senate Energy and Natural Resources Committee, said Thursday, \"Minutes before the news of these cancelled projects broke, I had just left lunch with [Energy] Secretary [Chris] Wright and he had neither the courtesy nor the care to mention that this was coming, and that it included ten projects in my state — projects that affect real jobs and real families.\"</p><p>\"That tells you everything you need to know about how this Administration operates: in the dark and with no respect for the people hurt by their decisions,\" Heinrich said in a statement.</p><p>\"The American people deserve a government that works for them, not one that plays politics with their lives,\" he said. This Administration is choosing to punish ordinary families just to settle scores — and that is as dangerous as it is un-American.\"</p><p>The Energy Department, in a statement, said that the cancellations followed \" a thorough, individualized financial review,\" which \"determined that these projects did not adequately advance the nation's energy needs, were not economically viable, and would not provide a positive return on investment of taxpayer dollars.\"</p><p>Energy Secretary Wright said that many of the awards were \"rushed through in the final months of the Biden administration with inadequate documentation by any reasonable business standard.\"</p><p>\"President Trump promised to protect taxpayer dollars and expand America's supply of affordable, reliable, and secure energy,\" Write said, adding that the cancellations \"deliver on that commitment.\"</p><p>The department said that of the 321 financial awards terminated, \"26% were awarded between Election Day and Inauguration Day,\" with those awards alone valued at more than $3.1 billion.</p><p>But Wells, the NRDC advocate, said that despite the Energy Department's claims, \"there's been a confusing lack of transparency in this process of cancelling\" funding.</p><p>Wells contrasted that to the Biden administration's vetting of the projects before they were approved. He noted that the department itself had not publicly released a list of the cancelled projects.</p><p>The Energy Department did not respond to CNBC's request for that list.</p><p>Wells pointed out that several Democratic members of Congress, including New Mexico's Heinrich, in early September had raised concerns about the influence of political appointees in the Energy Department to cancel funding of projects in May.</p><p>\"This is highly unusual and counter to longstanding DOE precedent,\" Heinrich and two other Democrats, Representative Zoe Lofgren of California, and New Jersey Rep. Frank Pallone, Jr., wrote in a letter to Wright. \"It also stands in stark contrast to the rigorous, merit-based process that the Department followed in selecting each of the awards.\"</p><p>\"These programs are not optional,\" the lawmakers wrote. \"These programs were enshrined into law by bipartisan majorities and they represent the will of Congress. You have no legal authority to sabotage them.\"</p><p>Ken Lovett, the senior communications advisor on energy and environment for New York Gov. Kathy Hochul, said that the funding cuts \"come as no surprise given the Trump administration's full-on assault on clean energy.\"</p><p>\"Whether it's blocking offshore wind, cutting federal incentives for electric vehicles and solar energy, or rolling back clean air and clean water standards, the Trump administration's attempt to rollback the progress we have made puts New Yorkers' well-being and safety at risk,\" Lovett said in a statement.</p><p>\"We will not go back.\"</p><p><em><strong>— CNBC's </strong></em><a target=\"_blank\" href=\"https://www.cnbc.com/emily-wilkins/\"><em><strong>Emily Wilkins</strong></em></a><em><strong>, Ashlee Trujillo and </strong></em><a target=\"_blank\" href=\"https://www.cnbc.com/mary-catherine-wellons/\"><em><strong>MC Wellons</strong></em></a><em><strong> contributed to this story.</strong></em></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shutdown fallout: Energy Dept. axes billions for green projects in blue states",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108188096-17556190142025-08-19t155613z_1525802786_rc2fagafsx3b_rtrmadp_0_usa-trump.jpeg?v=1755619057&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T00:38:47.000Z",
      "dateModified": "2025-10-03T00:38:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What the government shutdown means for federal workers—hundreds of thousands are required to keep working without pay",
    "url": "https://www.cnbc.com/2025/10/02/what-the-government-shutdown-means-for-federal-workers.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108206692-1759346864058-gettyimages-2237907376-TRUMP_ARRIVE_WH.jpeg?v=1759347014&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-02T14:04:23.000Z",
    "description": "<div><div><p>The U.S. government <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/government-shutdown-trump-live-updates.html\">shut down Wedne",
    "body": "<div><div><p>The U.S. government <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/government-shutdown-trump-live-updates.html\">shut down Wednesday</a>, putting hundreds of thousands of federal workers at risk of losing pay.</p><p>About 750,000 federal employees are expected to be furloughed each day, <a href=\"https://www.cbo.gov/system/files/2025-09/61773-Government-Shutdown.pdf\" target=\"_blank\">according to the Congressional Budget Office</a>. Hundreds of thousands more are required to keep working without pay until funding resumes, based on federal agency estimates, including essential staff like air traffic controllers and border patrol agents.</p><p>The shutdown was triggered early Wednesday after the Senate failed to pass a short-term funding bill. The measure, which would have kept the government open through Nov. 20, fell short in a 55-45 vote, below the 60 needed.</p><p>All but two Democratic senators opposed the bill. Led by Senate Minority Leader Chuck Schumer, D-N.Y., <a href=\"https://www.washingtonpost.com/business/2025/09/29/shutdown-democrats-republicans-funding/\" target=\"_blank\">Democrats have been pushing</a> for an extension of expiring Affordable Care Act subsidies and the reversal of about $1 trillion in Medicaid cuts included in President Donald Trump's One Big Beautiful Bill.</p><p>In turn, Trump and Vice President J.D Vance have <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/government-shutdown-trump-live-updates.html\">threatened permanent job cuts</a>. Last week, the Office of Management and Budget sent a memo directing federal agencies to prepare layoff plans for programs \"not consistent with the president's priorities\" if funding lapses, according to the memo <a href=\"https://www.pbs.org/newshour/politics/read-the-full-memo-directing-federal-agencies-to-weigh-mass-layoffs-if-the-government-shuts-down\" target=\"_blank\">published by PBS</a>.</p><p>Labor unions have <a href=\"https://www.politico.com/news/2025/09/30/labor-unions-sue-omb-opm-00589170\" target=\"_blank\">already sued</a> over the move, arguing it violates federal law.</p></div><h2><a></a>What a shutdown means and who is affected</h2><div><p>Each year, Congress must approve funding for the government's new fiscal year, which begins Oct. 1. A shutdown occurs when lawmakers miss that deadline. The last time it happened was a <a href=\"https://www.npr.org/2025/10/01/nx-s1-5559267/government-shutdown-length-history\" target=\"_blank\">34-day shutdown in 2018</a>, during Trump's first term.</p><p>In a shutdown, agencies pause many operations and split workers into two categories:</p><ul><li><strong>Excepted employees</strong> who must keep working without pay, commonly in roles tied to safety and national security.</li><li><strong>Non-excepted employees</strong> who are placed on unpaid leave and told not to report to work.</li></ul><p>Federal employees are guaranteed back pay once the shutdown ends, but <a href=\"https://www.poynter.org/fact-checking/2025/government-shutdown-who-gets-paid\" target=\"_blank\">contractors are not</a>.</p><p>The shutdown's effects will be most visible in the government's largest agencies. At the Department of Homeland Security, more than 250,000 employees are required to keep working without pay, including border patrol officers and TSA agents, according to its contingency plan. </p><p>The Department of Health and Human Services expects to furlough about 32,460 workers, or 41% of its staff,<a href=\"https://www.reuters.com/legal/litigation/us-government-shutdown-furlough-41-health-agency-workers-2025-09-29/\" target=\"_blank\"> Reuters reports</a>. And at the FAA, more than 11,000 employees are being sent home while about 13,000 air traffic controllers <a href=\"https://www.reuters.com/business/world-at-work/faa-would-furlough-11000-employees-us-government-shutdown-2025-09-30/\" target=\"_blank\">continue working without pay</a>.</p><p>Most social programs will continue because they're funded outside the annual budget process. Social Security and Medicare benefits will still go out, the Postal Service will keep running and veterans' health care and disability payments will continue. SNAP food assistance is not expected to be affected immediately, though a prolonged shutdown could strain USDA's reserves,<a href=\"https://www.aarp.org/advocacy/government-shutdown-snap-benefits/\" target=\"_blank\"> AARP</a> reports.</p></div><h2><a></a>Guidance for federal workers</h2><div><p>Shutdowns are a considerable disruption, especially for federal employees whose pay status can be unclear. To help them, the Office of Personnel Management maintains the government-wide<a href=\"https://www.opm.gov/policy-data-oversight/pay-leave/furlough-guidance/\" target=\"_blank\"> shutdown guidance</a> that applies to all federal employees.</p><p>Federal agencies have also posted contingency plans that outline who is furloughed, who must keep working without pay and the procedures employees are expected to follow while operations are scaled back. Below is guidance from some of the agencies with the most employees affected:</p><ul><li>Department of Defense <a href=\"https://media.defense.gov/2025/Sep/27/2003809363/-1/-1/1/CONTINGENCY-PLAN-GUIDANCE-FOR-CONTINUATION-OF-OPERATIONS-IN-THE-ABSENCE-OF-APPROPRIATIONS.PDF\" target=\"_blank\">contingency plan</a></li><li>Department of Veterans Affairs <a href=\"https://department.va.gov/contingency-planning/\" target=\"_blank\">contingency plan</a></li><li>Department of Homeland Security <a href=\"https://www.dhs.gov/sites/default/files/2025-09/2025_0929_dhs_procedures_related_to_a_lapse_in_appropriations.pdf\" target=\"_blank\">shutdown procedures</a></li><li>Department of Justice <a href=\"https://www.justice.gov/jmd/media/1377216/dl\" target=\"_blank\">contingency plan</a></li><li>Health and Human Services<a href=\"https://www.hhs.gov/about/budget/fy-2026-hhs-contingency-staffing-plan/index.html\" target=\"_blank\"> contingency staffing plan</a></li><li>Department of Transportation <a href=\"https://www.transportation.gov/lapse\" target=\"_blank\">shutdown guidance</a></li><li>State Department<a href=\"https://www.state.gov/wp-content/uploads/2025/09/DOS-Lapse-Guidance-updated-29-September-2025.pdf\" target=\"_blank\"> guidance</a></li></ul><p>For contract workers wondering if they'll get paid, the National Law Review <a href=\"https://natlawreview.com/article/how-government-contractors-should-prepare-and-deal-shutdown\" target=\"_blank\">offers advice</a> on confirming contract status and possible recourse on compensation.</p><p>Beyond that, out-of-work federal workers and contractors might qualify for <a href=\"https://www.dol.gov/general/topic/unemployment-insurance\" target=\"_blank\">state unemployment insurance</a>. Furloughed federal employees access it through the <a href=\"https://oui.doleta.gov/unemploy/docs/factsheet/UCFE_FactSheet.pdf\" target=\"_blank\">Unemployment Compensation for Federal Employees program</a>.</p><p>Unfortunately, excepted employees have fewer options and often need to rely on personal savings until the shutdown ends.</p><p><em><strong>Want to be your own boss?</strong> Sign up for CNBC's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108205727-250829-mi-07-mm-poirel-switzerland-rough-v400_00_16_16Still006.jpg?v=1759242363&w=750&h=422&vtcrop=y\" alt=\"I quit my $390,000 a year job at Google for a mini retirement in Switzerland\" /><span></span><span><span></span></span></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What the government shutdown means for federal workers—hundreds of thousands are required to keep working without pay",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108206692-1759346864058-gettyimages-2237907376-TRUMP_ARRIVE_WH.jpeg?v=1759347014&w=1920&h=1080"
      ],
      "datePublished": "2025-10-02T14:04:23.000Z",
      "dateModified": "2025-10-02T14:04:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Silicon Valley’s new defense tech ‘neoprimes’ are pulling billions in funding to challenge legacy giants",
    "url": "https://www.cnbc.com/2025/10/03/silicon-valley-defense-tech-startups-war-lockheed-boeing-raytheon-anduril-palantir-mva-milvet.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203096-1758680752113-gettyimages-1273601403-_r0a0074.jpeg?v=1758680796&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T02:09:17.000Z",
    "description": "<div><div><p>Guvendemir | E+ | Getty Images</p></div><div><p>A wave of defense tech startups in Silicon Valley is drawing billions in funding and resh",
    "body": "<div><div><p>Guvendemir | E+ | Getty Images</p></div><div><p>A wave of defense tech startups in Silicon Valley is drawing billions in funding and reshaping America's national security.</p><p><a target=\"_blank\" href=\"https://www.cnbc.com/2025/06/10/anduril-cnbc-disruptor-50.html\">Anduril Industries</a>, recently <a target=\"_blank\" href=\"https://www.cnbc.com/2025/06/05/anduril-valuation-founders-fund.html\">valued</a> at $30.5 billion following its latest funding round, is among the so-called \"neoprimes\" — companies challenging the dominance of legacy contractors, dubbed \"<a href=\"https://www.congress.gov/crs-product/IF10600#:~:text=While%20DOD%20contracts%20with%20many,year%20(see%20Table%201).\" target=\"_blank\">primes</a>,\" such as <a target=\"_blank\" href=\"https://www.cnbc.com/quotes/LMT/\">Lockheed Martin</a>, <a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NOC/\">Northrop Grumman</a>, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/BA/\">Boeing</a><span><span></span></span></span>, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/GD/\">General Dynamics</a><span><span></span></span></span>, and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/RTX/\">RTX</a><span><span></span></span></span> (formerly Raytheon).</p><p>\"There's more money than ever going to what we call the 'neoprimes'\" Jameson Darby, co-founder and director of autonomy at investment syndicate MilVet Angels, or <a href=\"https://www.mvafoundation.org/\" target=\"_blank\">MVA</a>, told <a target=\"_blank\" href=\"https://www.cnbc.com/world/?region=world\">CNBC</a>. \"It's still a fraction of the overall budget, but the trend is all positive.\"</p><p>Other examples of defense tech startups challenging the incumbents include SpaceX and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/PLTR/\">Palantir Technologies</a><span><span></span></span></span>, said Darby, who is also a founding member of the U.S. Department of Defense's Defense Innovation Unit.</p><p>Unlike the primes, these startups are faster, leaner and software-first — with many of them building things that can help close \"critical technology gaps that are really important to national security,\" said Ernestine Fu Mak, co-founder of MVA and founder of Brave Capital, a venture capital firm.</p><p>Venture funding for U.S.-based defense tech startups totaled about $38 billion through the first half of 2025, and could exceed its 2021 peak if the pace remains constant for the rest of the year, according to <a href=\"https://www.jpmorgan.com/insights/business-planning/defense-tech-innovation-and-the-role-of-startups#:~:text=Combination%20chart%20showing%20U.S.%20Defense,significantly%20outpaced%20the%20broader%20market.\" target=\"_blank\">JPMorgan</a>.</p></div><h2><a></a>'The battlefield is changing'</h2><div><p>As the global war landscape changed over the past decades, the <a href=\"https://www.cto.mil/osc/critical-technologies/\" target=\"_blank\">U.S. Department of Defense</a> has identified <a href=\"https://www.cto.mil/osc/critical-technologies/#:~:text=Advanced%20computing%20and%20software%20technologies,establish%20confidence%20in%20its%20performance.\" target=\"_blank\">several technologies</a> that are critical to national security, including hypersonics, energy resilience, space technology, integrated sensing and cyber.</p><p>\"In a post-9/11 world, the entire Department of Defense effectively focused on ... the global war on terrorism. It was our military versus insurgents, guerrillas, asymmetric warfare, relatively low-tech fighters in most cases,\" said Darby.</p><p>But war today is more focused on \"great power competition,\" said Mak.</p></div><blockquote><div><p>The battlefield is changing and new technologies are needed ... warfare no longer being limited to land, sea, air. There's also cyber and space domains that have become contested.</p><div><p>Ernestine Fu Mak</p><p>Co-founder, MilVet Angels</p></div></div></blockquote><div><p>\"The focus is more on deterring and competing with [adversaries] in these very high-tech, multi-domain conflicts,\" Mak added. \"The battlefield is changing and new technologies are needed... warfare no longer being limited to land, sea, air. There's also cyber and space domains that have become contested.\"</p><p>Today, some of these Silicon Valley \"neoprimes\" are developing not just weapons, but also dual-use technologies that can be applied both commercially and by militaries.</p><p>\"So things like artificial intelligence and autonomy have broad, sweeping commercial applications, but they're also clearly a force multiplier in a military context,\" said Darby. \"[The] Department of War is rapidly assessing and adopting these dual-use technologies ... they're sending signals to the investment world, to the defense industrial base, that the U.S. government needs these things.\"</p><p>That direction from the government has, in turn, provided a clear and strategic roadmap for both investors and entrepreneurs, said Mak.</p></div><h2><a></a>The 'new guard'</h2><div><p>On Sept. 17, MVA came out of stealth mode after quietly backing some leading defense tech startups since 2021.</p><p>Today, Mak says the syndicate's roughly 250 members include tech founders, Wall Street financiers, company executives, intelligence officials, former military leaders and Navy SEALs. Together, they've <a href=\"https://www.thecipherbrief.com/defense-neoprime-innovation\" target=\"_blank\">invested in companies</a> like Anduril Industries, Shield AI, Hermeus, Ursa Major and Aetherflux.</p><p>\"Overall, we believe that 'neoprimes' cannot exist in the abstract. They require people — individuals who bring technical expertise, who carry a deep sense of mission, and who contribute complementary voices and talents. Together, this coalition forms what we are convening and calling the 'new guard,'\" said Mak.</p><p>She added that modern national security requires both the \"warrior's insight on the battlefield\" and the \"builder's drive for innovation\".</p><p>\"Working together with engaged, informed patriots whose participation strengthens our defense ecosystem and reinforces the very fabric of national security,\" Mak said.</p><p>Mak and Darby both agree that as new technologies develop and make their way onto battlefields globally, it's changing the way militaries fight, which can also pose new threats.</p><p>\"You're seeing these technologists, these builders ... building defense tech, and the reason why they're doing so, is not to initiate conflict, but rather to create a credible deterrent that discourages aggression,\" said Mak.</p><p>\"No one in defense tech is looking to wage war, rather, it's looking to deter it and wanting adversaries to think twice before threatening peace and stability,\" Mak added.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Silicon Valley’s new defense tech ‘neoprimes’ are pulling billions in funding to challenge legacy giants",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108203096-1758680752113-gettyimages-1273601403-_r0a0074.jpeg?v=1758680796&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T02:09:17.000Z",
      "dateModified": "2025-10-03T02:09:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "EA’s $55 billion deal delivers a win for investors, but raises uncertainty for gamers",
    "url": "https://www.cnbc.com/2025/10/03/eas-55-billion-deal-delivers-a-win-for-investors-but-raises-uncertainty-for-gamers.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108206143-1759286501069-gettyimages-2238131707-img_7665_xrmaxsa7.jpeg?v=1759286521&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T03:06:10.000Z",
    "description": "<div><div><p>COLMA, CALIFORNIA - SEPTEMBER 29: Electronic Arts video games are displayed at a Target store on September 29, 2025 in Colma, California.",
    "body": "<div><div><p>COLMA, CALIFORNIA - SEPTEMBER 29: Electronic Arts video games are displayed at a Target store on September 29, 2025 in Colma, California. Video game maker Electronic Arts is being acquired in a $55 billion deal with private equity firm Silver Lake Partners, Affinity Partners, and Saudi Arabia’s sovereign wealth fund PIF. The deal could become the largest private equity-funded buyout in history. (Photo by Justin Sullivan/Getty Images)</p><p>Justin Sullivan | Getty Images News | Getty Images</p></div><div><p>As video game giant Electronic Arts (EA) begins its transition to becoming a private company, analysts are optimistic about the $55 billion deal — with one even <a href=\"https://global.morningstar.com/en-gb/stocks/ea-acquisition-gives-shareholders-big-win\" target=\"_blank\">calling it \"a big win\"</a> for shareholders.</p><p>On Monday, EA announced it will be <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/electronic-arts-buyout.html\">acquired</a> in an all-cash deal by the Public Investment Fund of Saudi Arabia, Silver Lake, and Affinity Partners. <a href=\"https://news.ea.com/press-releases/press-releases-details/2025/EA-Announces-Agreement-to-be-Acquired-by-PIF-Silver-Lake-and-Affinity-Partners-for-55-Billion/default.aspx\" target=\"_blank\">Shareholders</a> will receive $210 per share, a 17% premium over EA's all-time high in August.</p><p>Though there is a 45-day window <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/ea-shareholders-will-get-210-per-share-in-deal-to-take-company-private.html\">to allow for other proposals</a>, Morningstar Senior Equity Analyst Matthew Dolgin wrote in a Tuesday note that the deal is \"all but certain to close\" without any regulatory hurdles, given the Saudi government's favorable relationship with the current U.S. administration, and a favourable premium for shareholders.</p><p>But while Wall Street may be celebrating, the gaming community might not share the same sentiment. For years, gamers have criticized EA's lack of innovation and aggressive monetization tactics.</p></div><h2><a></a>Poor gaming street cred</h2><div><p>EA's portfolio includes blockbuster franchises like EA Sports FC (formerly FIFA), The Sims, and Battlefield. But despite strong financials — EA has posted operational profits every year since 2015 — it has often drawn criticism from gamers.</p><p>In 2012 and 2013, EA was voted \"Worst Company in America\" by the now-defunct consumer advocacy website, Consumerist.com. In 2018, <em>USA Today</em> ranked it the fifth most hated company in the U.S. Much of the backlash stemmed from its <a href=\"https://in.ign.com/tech/173674/news/former-ea-ceo-apologizes-for-his-comments-about-pushing-microtransactions-on-video-games\" target=\"_blank\">reliance on live-service models, microtransactions</a>, and controversial mechanics like loot boxes.</p><div><div><p><strong>Gaming glossary:</strong></p><p><strong>Live service games:</strong> Games that are released and updated continuously, sometimes with limited time updates. Updates may be paid or free.</p></div><p><strong>Microtransactions:</strong> Purchases of in-game items that users make with real money. Items can be either purely cosmetic or allow players to advance more quickly through a game.</p><p><strong>Loot boxes:</strong> A container of random virtual items that are unknown to the player before opening them, and can be purchased with in-game currency or real money.</p></div><p>EA has also faced criticism for prioritizing sequels over new intellectual property. In a 2024 internal note <a href=\"https://www.ign.com/articles/ea-to-lay-off-around-670-to-advance-the-way-we-work\" target=\"_blank\">reported by IGN</a>, CEO Andrew Wilson stated that EA would \"double down on owned IP, sports, and massive online communities.\"</p><p>That same year, <a href=\"https://www.inverse.com/gaming/mirrors-edge-15-year-anniversary\" target=\"_blank\">online magazine Inverse</a> wrote: \"Perhaps the most common complaint is that EA fails to innovate,\" citing overpriced Sims 4 content packs, repetitive sports titles, and underwhelming sequels to legacy franchises.</p><p>The company also had the <a href=\"https://www.guinnessworldrecords.com/world-records/503152-most-downvoted-comment-on-reddit\" target=\"_blank\">most downvoted comment on Reddit</a>, after it tried to defend its stance over the long time taken to unlock content and characters in the 2017 Star Wars Battlefront II, even after buying the deluxe edition of the game.</p><p>The game's loot box mechanics — while not exclusive to EA — also led to backlash from gamers, <a href=\"https://www.gamespot.com/articles/star-wars-battlefront-2s-loot-box-controversy-expl/1100-6455155/\" target=\"_blank\">triggering European regulators to investigate </a>whether the feature constituted gambling.</p><p>In November 2017, <a href=\"https://www.youtube.com/watch?v=_akwfRuL4os\" target=\"_blank\">U.S. Senator Chris Lee</a> called it a \"predatory practice\" from EA. \"This game is a Star Wars-themed online casino designed to lure kids into spending money. It's a trap,\" he said in a press conference.</p></div><h2><a></a>A creative reset or more of the same?</h2><div><p>With EA no longer beholden to quarterly earnings reports, gamers may hope the company will take more creative risks. But analysts are divided.</p><p>\"Of course, the company will be in a position to explore more creative games,\" said Michael Pachter, managing director at Wedbush Securities. \"But that isn't really something they are particularly good at — especially if current management remains in place.\"</p><p>Pachter expects EA to double down on its live-service model and significantly grow its mobile gaming business under the PIF.</p><p>\"I suspect the Saudis will roll out new mobile games for all EA Sports, Sims and Battlefield titles,\" Patcher said, highlighting that the PIF, through Savvy Games Group, owns Scopely and Niantic, \"two of the best mobile game publishers in the business.\"</p><p>Michael Futter, founder of video game industry consultancy F-Squared, echoed this view. He noted that the deal will saddle EA with $20 billion in debt, pushing it to lean harder on stable revenue streams like \"microtransactions, battle passes, FOMO-style [fear of missing out] rotating inventory [of] in [game] storefronts.\"</p><p>A rotating inventory in a game storefront usually refers to sales of items or battle passes within a limited time, enticing players to buy them quickly or miss out.</p><div><p><strong>Gaming glossary:</strong></p><p><strong>Battle pass</strong>: A tiered system which rewards players with virtual items for completing various objectives in gameplay, and may be offered in a limited time period. Some battle passes can be bought with real money.</p></div><p>Futter believes EA will consolidate around its safest franchises, such as The Sims, Battlefield, and sports titles, rather than experiment with new IPs.</p><p>\"The debt hanging over their head isn't likely to create a shift in strategy. Instead, it will likely see leadership entrench themselves in the titles they think have the largest revenue potential, even if those also carry the largest risk.\"</p><p>He added, \"I don't know how EA is going to service this debt without significant layoffs, studio closures, and possibly IP sell-off.\"</p></div><blockquote><div><p>I don't know how EA is going to service this debt without significant layoffs, studio closures, and possibly IP sell-off.</p><div><p>Michael Futter</p><p>Founder, F-Squared</p></div></div></blockquote><div><p>But not all analysts are pessimistic. Nick McKay of investment banking platform Freedom Capital Markets believes the buyout could improve the long-term quality of EA's games.</p><p>\"It provides EA with the opportunity to step back from the public spotlight and invest in games they're passionate about,\" McKay said. It would allow for EA to try new things without being \"penalized\" by shareholders if a game didn't do well, he pointed out. <br /><strong><br /></strong>\"You don't have to worry about a significant drop in your valuation, because... one of your new titles hasn't worked. So actually, I think it could be a good thing for the long term quality of the release slate,\" McKay said.</p><p>David Cole, CEO of DFC Intelligence, added that in the short term, EA may consider selling off some of its IPs to manage its debt. He cited the \"Command and Conquer\" series as an example of a franchise with historical value but limited commercial scale.</p><p>The last mainline Command and Conquer entry came out in 2012, with only a mobile game after that in 2018.</p><p>But in the long term, the company will have the freedom to explore some more options and take some more risk, he said.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108205043-17591534031759153399-41871716393-1080pnbcnews.jpg?v=1759153402&w=750&h=422&vtcrop=y\" alt=\"Electronic Arts to be taken private by PIF, Silver Lake and Affinity Partners for $55B\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EA’s $55 billion deal delivers a win for investors, but raises uncertainty for gamers",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108206143-1759286501069-gettyimages-2238131707-img_7665_xrmaxsa7.jpeg?v=1759286521&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T03:06:10.000Z",
      "dateModified": "2025-10-03T03:06:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Singapore's F1 race boosts tourism to the island — and other parts of Asia-Pacific",
    "url": "https://www.cnbc.com/2025/10/03/singapores-f1-race-boosts-tourism-to-other-countries-in-asia-pacific.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108206167-1759291456090-gettyimages-2171781738-AFP_36GJ2CZ.jpeg?v=1759389108&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T05:04:03.000Z",
    "description": "<div><div><p>From <a target=\"_blank\" href=\"https://www.cnbc.com/video/2023/09/11/watch-a-hotel-room-transform-into-a-84000-suite-for-the-singapore-gra",
    "body": "<div><div><p>From <a target=\"_blank\" href=\"https://www.cnbc.com/video/2023/09/11/watch-a-hotel-room-transform-into-a-84000-suite-for-the-singapore-grand-prix.html\">$62,000 hotel suites</a> to <a href=\"https://www.marinabaysands.com/campaign/singapore-night-race.html\" target=\"_blank\">race packages with six-figure price tags</a>, the Singapore Grand Prix is a windfall for businesses near the Marina Bay track.</p><p>But the money isn't staying in Singapore. Data shows travelers are also spending across Asia before and after the three-day Formula One race, which begins Friday.</p><p>Flight bookings analyzed by marketing platform Sojern indicate that, among those with onward trips, a quarter of Americans and Canadians are adding trips to Japan, 18% of Europeans are also visiting Thailand, and nearly one-third of Australians are tacking on trips to Indonesia, overwhelmingly to Bali.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108207306-17594590081759459005-41923429655-1080pnbcnews.jpg?v=1759459007&w=750&h=422&vtcrop=y\" alt=\"Singapore's Formula One race boosts tourism beyond its borders\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>Other travelers are pairing this year's event in Singapore with side trips to China, South Korea, India, the Maldives and Fiji, Sojern said.</p><p>Samer Elhajjar, a<strong> </strong>senior lecturer at the National University of Singapore, said that travel websites in other countries are bundling trips to Singapore's night race with stops at popular island destinations in Southeast Asia.</p></div><div><p>\"Visitors will come to Singapore, enjoy the F1, and then they move to Bali for two or three days,\" he said. \"That's actually amazing for the economy of the region.\"</p><p><a target=\"_blank\" href=\"https://www.cnbc.com/cnbc-travel/\">CNBC Travel</a> found travel packages to the 2025 Singapore Grand Prix coupled with trips to Langkawi and Borneo in Malaysia, and a<a href=\"https://www.planetcruise.com/en/royal-caribbean-cruises/ovation-of-the-seas/01-october-2025/387169\" target=\"_blank\"> cruise</a> that combines the race with stops in Japan, Hong Kong and Vietnam.</p></div><h2><a></a>Pitstop, not full stop</h2><div><p>Sojern's data comports with a <a href=\"https://www.visa.com.sg/about-visa/stories/2025/the-inside-track-how-tourism-in-melbourne-and-suzuka-extend-beyond-the-chequered-flag.html\" target=\"_blank\">Visa report</a> published in May, which showed that other Formula One races in Asia-Pacific generated tourism revenue outside of host cities too.</p><p>Around 25% of foreigners who attended the 2025 Australian Grand Prix stayed around Melbourne's suburbs after the race, while 10% remained in the city itself, according to Visa's data. Yet some ventured to the Yarra Valley wine region, and 5% traveled to Sydney, some 500 miles away<strong>.</strong></p></div><p>At April's Japan Grand Prix in Suzuka, international attendees ventured even farther away, according to the report. Data showed around 10% went to Osaka, another 5% to Kyoto; however, the most popular destination to visit after the race was Okinawa (20%), more than 700 miles from the circuit.</p><h2><a></a>Switching gears</h2><div><p>The three-day Singapore Grand Prix has evolved into a week-long event for many, drawing global leaders and business travelers to trade forums scheduled around the race, such as crypto conference <a href=\"https://www.token2049.com/\" target=\"_blank\">Token2049</a> and the <a href=\"https://milkeninstitute.org/events/asia-summit-2025\" target=\"_blank\">Milken Institute Asia Summit</a>.</p><p>Travelers from North America and Europe collectively account for around a quarter of arrivals ahead of this year's race in Singapore, and they tend to arrive earlier and stay longer than those coming from Asia, according to Sojern's data.</p><p>Australians still have the largest share of inbound flight bookings; however, arrivals from South Korea and China increased this year, breaking into the top 5, surpassing the United Kingdom, it showed.</p></div><div><p>The 2025 race is also attracting more families, up 6.6% from last year, while solo travelers fell 8%, indicating a rise in leisure travelers attending the race.</p><p>\"This means that the stays will be extended,\" said National University of Singapore's Elhajjar. \"That's great for the economy of Singapore ... [and] the economy of the region.\"</p><p>A separate survey from Hilton published Thursday found that some 40% of travelers in Asia-Pacific plan to book an international trip to attend a sporting or music event, led by 59% of respondents in China and 57% in India.</p><p>\"The findings reinforce a broader consumer shift, with customers increasingly prioritizing spend on experiences over physical goods,\" said Ben George, senior vice president and commercial director, Asia Pacific, Hilton.</p><p>The survey, which polled 5,000 respondents from China, India, Japan, Australia and Singapore, also revealed that travelers are spending more money <a href=\"https://experiences.hiltonhonors.com/\" target=\"_blank\">and loyalty points</a> on experiences at these events, such as meet-and-greets with drivers and behind-the-scenes tours, he said.</p><p>George said Hilton members spent more than 9 million loyalty points on six Singapore Grand Prix experience packages this year, which was \"a 23% increase compared with last year — the highest total to date for this race.\"</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Singapore's F1 race boosts tourism to the island — and other parts of Asia-Pacific",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108206167-1759291456090-gettyimages-2171781738-AFP_36GJ2CZ.jpeg?v=1759389108&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T05:04:03.000Z",
      "dateModified": "2025-10-03T05:04:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]