[
  {
    "title": "Refinance demand for FHA loans jumps 24%, as homeowners seek the most savings they can",
    "url": "https://www.cnbc.com/2025/12/10/refinance-demand-for-fha-loans-jumps-24percent-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108199239-1758024579924-gettyimages-2184891430-dsc00355.jpeg?v=1765323992&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T12:52:42.000Z",
    "description": "Manusapon Kasosod | Moment | Getty ImagesCurrent homeowners are looking for any savings they can get, and with mortgage rates on conventional loans no",
    "body": "Manusapon Kasosod | Moment | Getty ImagesCurrent homeowners are looking for any savings they can get, and with mortgage rates on conventional loans not moving much, that isn't easy. Loans from the Federal Housing Administration, or FHA, which require mortgage insurance, however, are providing an outlet.Total applications to refinance a home loan rose 14% last week compared with the previous week, according to the Mortgage Bankers Association's seasonally adjusted index. Volume was 88% higher than the same week one year ago. The refinance share of mortgage activity increased to 58.2% of total applications from 53.0% the previous week. Demand for FHA refinances was up 24% for the week, as the FHA interest rate for 30-year fixed-rate loans fell to 6.08% the lowest level since September 2024. In contrast, the average rate for 30-year fixed-rate mortgages with conforming loan balances, $806,500 or less, increased to 6.33% from 6.32%, with points rising to 0.60 from 0.58, including the origination fee, for loans with a 20% down payment.Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.Applications for a mortgage to purchase a home dropped 2% for the week and were 19% higher than the same week one year ago. Potential buyers are also turning to the FHA for additional savings.\"Conventional purchase applications were down for the week, but there was a 5 percent increase in FHA purchase applications as prospective homebuyers continue to seek lower downpayment loans,\" said Joel Kan, an MBA economist, in a release. Mortgage rates on conventional loans moved even higher to start this week, according to a separate survey from Mortgage News Daily. Markets are now waiting for commentary from the Federal Reserve's chair after Wednesday's meeting. It is widely expected the Fed will cut its overnight borrowing rate, but the last two times it did that mortgage rates rose sharply. \"The cut itself is not the news the market is waiting for. Rather, traders are interested to see each Fed member's rate outlook via the quarterly release of the Fed's economic projections,\" wrote Matthew Graham, chief operating officer at Mortgage News Daily. \"In addition, every Fed meeting includes a press conference with the Fed Chair, and bonds have often made the biggest moves in response.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Refinance demand for FHA loans jumps 24%, as homeowners seek the most savings they can",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108199239-1758024579924-gettyimages-2184891430-dsc00355.jpeg?v=1765323992&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T12:52:42.000Z",
      "dateModified": "2025-12-10T12:52:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. to mandate checks of some tourists' social media history from past 5 years ",
    "url": "https://www.cnbc.com/2025/12/10/us-to-inspect-tourists-social-media-history-from-past-5-years-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108192460-1756478484249-gettyimages-2232701526-mms28947_lak3ud4x.jpeg?v=1765376360&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T14:28:00.000Z",
    "description": "People wait in the security check in line in Terminal 5 at JFK Airport on Aug. 29, 2025 in New York, New York.Michael M. Santiago | Getty ImagesThe U.",
    "body": "People wait in the security check in line in Terminal 5 at JFK Airport on Aug. 29, 2025 in New York, New York.Michael M. Santiago | Getty ImagesThe U.S. is planning to impose social media inspections on some tourists as President Donald Trump continues to ramp up travel restrictions for foreign visitors. Tourists — including those from Britain, Australia, France, and Japan — will be mandated to provide five years of their social media history as part of their applications to visit the U.S., according to a notice posted by the U.S. Customs and Border Protection (CBP) on Wednesday. The proposal, which has been given a 60 day-notice with requests for comments from the public, is not final and may see some revisions. Tourists from nations that are included in the U.S.' Visa Waiver Program can apply to the Electronic System for Travel and Authorization (ESTA), to visit the country for 90 days or less, with a fee of $40. The social media check will now form a \"mandatory data element\" as part of the ESTA application.The border force said it will also collect \"several high value data fields,\" including applicants' email addresses from the past 10 years, their telephone numbers used in the past five years, and names and details of family members. In addition to social media checks, applicants will also be expected to upload \"selfies\" which the CBP said will improve their screening processes and better identify whether a person is the rightful possessor of the documents being used to secure an ESTA authorization. The plan is an escalation of a series of measures Trump has implemented in recent months to restrict the movement of foreign travelers, after a man from Afghanistan was accused of shooting two National Guard Members near the White House. The president said at the time that he would tighten immigration rules, including \"permanently\" pausing all  migration from \"third world countries,\" as he cast blame on his predecessor Joe Biden for admitting \"millions.\" watch nowMore recently, the Trump administration said it is expanding its travel ban to more than 30 countries, which was initially announced in June and previously blocked travel to the U.S. from 12 countries and restricted access from seven others. Some of the countries included are Afghanistan, Somalia, Iran, and Haiti. \"If they don't have a stable government there, if they don't have a country that can sustain itself and tell us who those individuals are and help us vet them, why should we allow people from that country to come here to the United States?\" Homeland Security Secretary Kristi Noem said at the time. U.S. Customs and Border Protection hasn't yet responded to a request for comment from CNBC. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. to mandate checks of some tourists' social media history from past 5 years ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108192460-1756478484249-gettyimages-2232701526-mms28947_lak3ud4x.jpeg?v=1765376360&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T14:28:00.000Z",
      "dateModified": "2025-12-10T14:28:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump trade rep changes China soybean purchase timeline, cites 'discrepancy'",
    "url": "https://www.cnbc.com/2025/12/09/trump-trade-rep-changes-china-soybean-purchase-timeline-cites-discrepancy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108239407-1765319667874-gettyimages-2250345551-AFP_87LT8EJ.jpeg?v=1765319705&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T15:17:51.000Z",
    "description": "US Trade Representative Jamieson Greer testifies during a US Senate Appropriations Subcommittee on Commerce, Justice, Science, and Related Agencies he",
    "body": "US Trade Representative Jamieson Greer testifies during a US Senate Appropriations Subcommittee on Commerce, Justice, Science, and Related Agencies hearing on 2026 funding priorities, on Capitol Hill in Washington, DC, Dec. 9, 2025.Saul Loeb | AFP | Getty ImagesU.S. Trade Representative Jamieson Greer told a Senate Appropriations subcommittee on Tuesday that the deadline for China to buy 12 million metric tons of soybeans from American farmers was not the end of December as the White House has said, but the end of the \"growing season.\"Greer's comment at the hearing came on the heels of a report by NBC News showing that the pace of China's purchases of soybeans in recent weeks was well short of reaching the agreed amount by the end of the calendar year.China, which in October agreed to end its monthslong boycott of American soybeans amid a trade war, to date has bought only about 3 million metric tons, the trade representative told members of the  Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Subcommittee.Greer said there was a \"discrepancy\" in what the White House has described as the deadline and the actual deadline for the purchases to be completed.The most recent growing season for soybeans ended in November, according to the U.S. Department of Agriculture.CNBC has asked Greer's office whether there is a hard or rough deadline for China to reach 12 million metric tons of purchases, as agreed to as part of a trade deal with President Donald Trump in October.Greer's disclosure came in response to a question by Sen. Deb Fischer, R-Neb.\"There remains anxiety about if and when China will fully follow through on those purchase commitments that were made,\" Fischer said.She noted that the White House fact sheet on the trade deal said China would purchase 12 million metric tons by the end of the calendar year -- contradicting recent comments from Greer.Read more CNBC politics coverageTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationTrump announces $12 billion aid package for farmers caught up in trade warTrump says Netflix, WBD deal could be 'problem' as son-in-law backs Paramount bidSupreme Court to hear case on Trump birthright citizenship orderTrump can fire labor, employment board members without cause: Appeals courtTrump administration views Netflix, Warner Bros. deal with 'heavy skepticism'Costco adds Biden Commerce Sec. Raimondo to board after Trump tariff lawsuitNew York Times sues Pentagon, Hegseth over media access policyCongressional watchdog probes Trump FHFA chief Bill PulteJan. 6 pipe bomb suspect Brian Cole arrested, faces explosives charges, DOJ saysJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'The fact sheet says, \"China will purchase at least 12 million metric tons (MMT) of U.S. soybeans during the last two months of 2025 and also purchase at least 25 MMT of U.S. soybeans in each of 2026, 2027, and 2028.\"Greer told Fischer, \"It is for this growing season, so, thank you for highlighting that.\"'\"We've heard from a couple farmers, they wanted to know about that discrepancy, and it is a discrepancy, it's through the growing season,\" he said.Joe Glauber, a former U.S. Department of Agriculture chief economist during the Obama administration, told CNBC in an interview he doesn't know what the administration means when it refers to the growing season.\"It's not a term that USDA means by any chance,\" Glauber said. \"Does that mean at harvests or does that mean actually the end of the marketing year, which is the more common way?\"Treasury Secretary Scott Bessent last week said he expected China to reach the 12 million metric ton mark by \"the end of the season.\"\"So I think that'll be Feb. 28,\" Bessent said, during an interview with Andrew Ross Sorkin at The New York Times DealBook Summit in New York. \"They are in a perfect cadence to complete that goal,\" Bessent said, after Sorkin said data from the U.S. Department of Agriculture as of Nov. 14 showed that China had only purchased 330,000 metric tons.Bessent called the figure Sorkin cited \"bad information.\"Glauber said the marketing year for soybeans is September, when the soybeans are harvested and ready to sell, through August of the next year. China would be more likely to hit buying targets from the U.S. by next August, since Brazil dominates the soybean market in the early months of the new year that coincides with its harvest season and cheap prices. The U.S. typically exports more to China later in the year, when its soybeans are cheaper.But that's a far longer time than the initial two-month window the White House pitched when it announced the China framework.\"That's a long time,\" Glauber said. \"This is not any sort of immediate relief.\"CNBC has asked the USDA for comment on Greer's remarks. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump trade rep changes China soybean purchase timeline, cites 'discrepancy'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108239407-1765319667874-gettyimages-2250345551-AFP_87LT8EJ.jpeg?v=1765319705&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T15:17:51.000Z",
      "dateModified": "2025-12-10T15:17:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI hires Slack CEO Denise Dresser to lead global revenue strategy",
    "url": "https://www.cnbc.com/2025/12/09/openai-slack-ceo-denise-dresser-chief-revenue-officer.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108054456-1730227996732-gettyimages-2181105069-TECHCRUNCH_DISRUPT.jpeg?v=1765311152&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T21:07:11.000Z",
    "description": "Slack CEO Denise Dresser during TechCrunch Disrupt in San Francisco, Oct. 29, 2024.David Paul Morris | Bloomberg | Getty ImagesOpenAI on Tuesday annou",
    "body": "Slack CEO Denise Dresser during TechCrunch Disrupt in San Francisco, Oct. 29, 2024.David Paul Morris | Bloomberg | Getty ImagesOpenAI on Tuesday announced that it's tapped Slack CEO Denise Dresser as its chief revenue officer. Dresser will oversee the artificial intelligence startup's global revenue strategy across both customer success and enterprise, OpenAI said in a release. After spending more than a decade as an executive at Salesforce, Dresser was named Slack's chief executive in 2023. Salesforce acquired the messaging company for more than $27 billion in 2020.\"I've spent my career helping scale category-defining platforms, and I'm looking forward to bringing that experience to OpenAI as it enters its next phase of enterprise transformation,\" Dresser said in a statement.OpenAI kickstarted the generative AI boom with the launch of its chatbot ChatGPT three years ago, and it has quickly ballooned into one of the fastest-growing commercial entities on the planet. Read more CNBC tech newsAustralia is trying to enforce the first teen social media ban. Governments worldwide are watchingOracle's AI-fueled debt load has investors on edge ahead of quarterly earningsTrump's blessing of Nvidia AI chip sales to China gets a chilly reception from GOPMeta's multibillion-dollar AI overhaul has created a culture clashThe startup said in November that it is on track to reach more than $20 billion in annualized revenue run rate this year, with plans to grow to hundreds of billions in sales by 2030.But as competition heats up from rivals like Google and Anthropic, OpenAI is facing pressure to deliver. The company has made more $1.4 trillion in infrastructure commitments as it works to scale up its technology, and the immense sum has raised eyebrows and sparked concerns about a potential AI bubble.More than 800 million people use ChatGPT every week, and OpenAI supports more than 1 million business customers. Dresser will help more companies integrate AI into their daily operations, OpenAI said. \"We're on a path to put AI tools into the hands of millions of workers, across every industry,\" Fidji Simo, OpenAI's CEO of Applications said in a statement. \"Denise has led that kind of shift before, and her experience will help us make AI useful, reliable and accessible for businesses everywhere.\"WATCH: Sam Altman hits reset at OpenAI, pausing side bets to defend ChatGPT’s AI leadwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI hires Slack CEO Denise Dresser to lead global revenue strategy",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108054456-1730227996732-gettyimages-2181105069-TECHCRUNCH_DISRUPT.jpeg?v=1765311152&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T21:07:11.000Z",
      "dateModified": "2025-12-09T21:07:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Fed meeting is likely to feature a rate cut and a lot more. Here's what to expect",
    "url": "https://www.cnbc.com/2025/12/09/the-fed-decision-is-expected-to-feature-a-rate-cut-and-a-lot-more-heres-what-to-expect.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218924-17617663402025-10-29t193112z_39828278_rc2vlhadyph9_rtrmadp_0_usa-fed.jpeg?v=1761831457&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T15:16:33.000Z",
    "description": "watch nowThe Federal Reserve is poised to deliver its third straight interest rate cut Wednesday, while simultaneously firing a warning shot about wha",
    "body": "watch nowThe Federal Reserve is poised to deliver its third straight interest rate cut Wednesday, while simultaneously firing a warning shot about what's ahead.Following a period of remarkable indecision about which way central bank policymakers would lean, markets have settled on a quarter-percentage point reduction. If that's the case, it will take the Fed's key interest rate down to a range of 3.5% to 3.75%.However, there are complications.The rate-setting Federal Open Market Committee is split between members who favor cuts as a way to head off further weakness in the labor market and those who think easing has gone far enough and threatens to aggravate inflation.That's why the term \"hawkish cut\" has become the buzzy term for this meeting. In market parlance, it refers to a Fed that will reduce, but deliver a message that no one should be holding their breath for the next one.\"The likeliest outcome is a kind of hawkish cut where they cut, but the statement and the press conference suggesting that they may be done cutting for now,\" said Bill English, the Fed's former director of monetary affairs and now a Yale professor. English expects the message to be \"that they've made an adjustment and they're comfortable where they are, and they don't see a need to do anything more in the near term, as long as things play out more or less as they expect.\"Where the full committee falls will be expressed in the post-meeting statement and Chair Jerome Powell's news conference. Wall Street economic commentary anticipates a tweak in the statement to harken back to a year ago, with language regarding \"the extent and timing of additional adjustments\" that Goldman Sachs expects to reflect that \"the bar for any further cuts will be somewhat higher.\"In addition to the rate decision and the statement, investors will be watching an update to the \"dot plot\" of individual officials' rate expectations; expectations for gross domestic product, unemployment and inflation; and a possible update of the Fed's asset purchase intentions, with some expecting the committee to pivot from ceasing the runoff of maturing bond proceeds back to purchases.Many moving partsAs for Powell, his tone \"will also likely get across that the bar has risen in his press conference and will likely again make a point of explaining the views of participants who opposed a cut,\" Goldman economist David Mericle said in a note.About that dissent: The October meeting saw two \"no\" votes on the final statement, one from each side of the rate debate. Mericle said that is likely to happen again, accompanied by multiple other \"soft dissents\" who will represent divergent views on the \"dot plot\" that indicates, anonymously, the rate outlook for each of 19 individual meeting participants, a group that includes 12 voters.While Mericle added that there is a \"solid case\" for a third cut, there are arguments to be made for both sides.\"It's a tough meeting, and so they'll presumably be a few dissents,\" English said. \"It's often hard to get the committee together. You have people who just have very different views about how the economy works and how policy works and so on. But this moment for the economy is particularly fraught.\"Even with the dearth of official government data due to the since-settled shutdown, hiring has shown signs of flattening, with sporadic signals that layoffs are accelerating. A Bureau of Labor Statistics report Tuesday showed job openings little changed in October but hiring down by 218,000 and layoffs rising by 73,000.On the inflation side, the most recent reading of the Fed's preferred gauge showed the annual rate at 2.8% in September, slightly below the Wall Street forecast but still well above the central bank's 2% goal.Inflation worriesDespite President Donald Trump's protestations that inflation has disappeared, it has at best stabilized and at worst is holding above the Fed's target in part due to the tariffs implemented under his watch. While Fed officials mostly have said they expect the duties to provide a temporary boost to prices, the gap between the current level and the central bank goal is enough to give some economists and policymakers pause.\"Inflation is not back to 2% so they're going to need to keep policy somewhat restrictive if they are going to put downward pressure on inflation,\" former Cleveland Fed President Loretta Mester said Tuesday on CNBC. \"Right now, inflation is pretty well above the goal, and it's not just all tariff-driven.\"Still, Mester thinks the FOMC will approve one more cut Wednesday. Like market participants, Mester saw a Nov. 21 speech from New York Fed President John Williams as the pivotal sign \"quite clearly\" that another reduction was coming. Prior to that, markets had been betting against a cut, particularly after Powell said explicitly at his October news conference that a December move was not a \"foregone conclusion. Far from it.\"\"I think they're going to follow through with that last cut,\" Mester said. \"I do hope that they signal that they think the economy has gotten to a place where policy is in a good place and they are going to slow down the cuts, because I am more concerned about the inflation risk, the stickiness.\"Aside from rate questions and the dot plot update, the committee may signal its next step regarding management of its balance sheet.The committee in October signaled that it would halt the process of \"quantitative tightening,\" or allowing maturing bond proceeds to roll off. With pressures ongoing in the overnight funding markets, some market participants expect the Fed will announce it will resume bond purchases, though not at a pace that would suggest \"quantitative easing,\" or QT's opposite.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Fed meeting is likely to feature a rate cut and a lot more. Here's what to expect",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218924-17617663402025-10-29t193112z_39828278_rc2vlhadyph9_rtrmadp_0_usa-fed.jpeg?v=1761831457&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T15:16:33.000Z",
      "dateModified": "2025-12-10T15:16:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon pledges massive $35 billion worth of investments in India with focus on AI",
    "url": "https://www.cnbc.com/2025/12/10/amazon-pledges-35-billion-investments-in-indias-ai-space-through-2030-million-jobs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108239551-1765346575714-gettyimages-1163037004-AFP_1JN8T6.jpeg?v=1765346587&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T08:33:02.000Z",
    "description": "Employees stand near an The Amazon Inc. logo is displayed above the reception counter at the company's campus in Hyderabad, India, on Friday, Sept. 6,",
    "body": "Employees stand near an The Amazon Inc. logo is displayed above the reception counter at the company's campus in Hyderabad, India, on Friday, Sept. 6, 2019.Bloomberg | Bloomberg | Getty ImagesAmazon on Wednesday committed to investing over $35 billion in India's cloud and artificial intelligence space by 2030, as hyperscalers race to get a foothold in the market. The commitment, unveiled at the Amazon Smbhav Summit in New Delhi, builds on nearly $40 billion already invested in the country. In a press release, Amazon said the new funds will target AI-driven digitization, export growth and job creation, aligning with India's national priorities to build up its local AI environment.By 2030, Amazon said the plan is expected to generate an additional 1 million direct, indirect, induced and seasonal jobs in India, quadruple exports to $80 billion and deliver AI benefits to 15 million small businesses.India is one of the fastest‑growing regions for AI spending within Asia Pacific, Deepika Giri, IDC's regional head of research for big data & AI, told CNBC.\"A major gap, and therefore a significant opportunity, lies in the shortage of suitable compute infrastructure for running AI models,\" Giri said.She added that countries across Asia are accelerating efforts to build sovereign AI capabilities as the technology becomes more regionalized due to trade tensions and tariffs, with infrastructure as a central pillar of those strategies.The investment highlights Amazon's bet on India's booming digital economy, where it has been building fulfillment centers, as well as data centers and payments infrastructure under its Amazon Web Services subsidiary. It also comes soon after Microsoft announced plans to invest $17.5 billion in India's AI infrastructure as Big Tech players accelerate their push into the market. \"We are humbled to have been a part of India's digital transformation journey over the past 15 years,\" said Amit Agarwal, senior vice president for emerging markets at Amazon. \"Looking ahead, we're excited to continue being a catalyst for India's growth, as we democratize access to AI for millions of Indians.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon pledges massive $35 billion worth of investments in India with focus on AI",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108239551-1765346575714-gettyimages-1163037004-AFP_1JN8T6.jpeg?v=1765346587&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T08:33:02.000Z",
      "dateModified": "2025-12-10T08:33:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pfizer adds to obesity bet with up to $2.1 billion deal to develop Chinese company's pill ",
    "url": "https://www.cnbc.com/2025/12/09/pfizer-deal-yaopharma-obesity-pill.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107364661-17062120762021-04-23t143705z_84240954_rc2q1n97o4om_rtrmadp_0_health-coronavirus-eu-pfizer.jpeg?v=1706212117&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T17:20:56.000Z",
    "description": "Pfizer CEO Albert Bourla talks during a press conference with European Commission President Ursula von der Leyen after a visit to oversee the producti",
    "body": "Pfizer CEO Albert Bourla talks during a press conference with European Commission President Ursula von der Leyen after a visit to oversee the production of the Pfizer-BioNtech COVID-19 vaccine at the factory of U.S. pharmaceutical company Pfizer in Puurs, Belgium April 23, 2021. John Thys | ReutersPfizer on Tuesday said it has struck an up to $2.1 billion licensing deal with YaoPharma to develop and commercialize its obesity pill, furthering the pharmaceutical company's push into the weight loss space. Pfizer will pay YaoPharma, a subsidiary of Chinese drugmaker Shanghai Fosun Pharmaceutical, an up-front payment of $150 million. YaoPharma could also receive up to $1.94 billion in milestone payments, along with tiered royalties on sales if the drug is approved. YaoPharma's drug works by targeting the same gut hormone, GLP-1, as Novo Nordisk's blockbuster weight loss injection Wegovy. But the pill is still in early-stage development, which means it will take several years to reach patients. The deal will help Pfizer beef up and diversify its obesity drug pipeline after a string of setbacks, including its decisions to scrap two different pills over the past two years. The drugmaker boosted its prospects in the competitive space with its up to $10 billion acquisition of the obesity biotech Metsera last month, following a fierce bidding war with Novo Nordisk. \"We look forward to contributing our expertise and resources to continue the development of this investigational GLP-1 small molecule which complements and strengthens our growing portfolio of novel candidates for treating obesity and its adjacent diseases,\" said Chris Boshoff, Pfizer's chief scientific officer, in a statement. Under the terms of the agreement, YaoPharma will conduct a phase one trial on its drug, while Pfizer will take control of later development. Pfizer also plans to conduct studies combining YaoPharma's treatment with its own drug targeting another gut hormone receptor called GIP, which is currently in mid-stage development.That combination isn't new in the space: Eli Lilly's weight loss injection Zepbound and diabetes drug Mounjaro use a dual approach targeting both GLP-1 and GIP. In a note on Tuesday, BMO Capital Markets analyst Evan Seigerman said limited information is available on YaoPharma's drug, called YP05002. But Seigerman said he views \"obesity diversification as promising in the short term\" for Pfizer. He added that Pfizer's $150 million up-front payment reflects \"prudent capital conservation in light of the recent Metsera bidding war.\"The opportunity to enter the booming weight loss drug market could be huge for Pfizer. Some analysts expect the weight loss drug space could be worth roughly $100 billion by the 2030s.It's unclear exactly how many people are using GLP-1s in the U.S., especially for obesity in particular. But around 1 in 8 adults said they were taking a GLP-1 drug to lose weight or treat another chronic condition as of November, according to a poll from health policy research organization KFF.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pfizer adds to obesity bet with up to $2.1 billion deal to develop Chinese company's pill ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107364661-17062120762021-04-23t143705z_84240954_rc2q1n97o4om_rtrmadp_0_health-coronavirus-eu-pfizer.jpeg?v=1706212117&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T17:20:56.000Z",
      "dateModified": "2025-12-09T17:20:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rivian turns to AI, autonomy to woo investors as EV sales stall",
    "url": "https://www.cnbc.com/2025/12/10/rivian-rivn-ai-day-avs-evs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108015625-17226075032024-06-21t000000z_1422933821_rc2uf8aws884_rtrmadp_0_rivian-electric.jpeg?v=1722607565&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T14:40:00.000Z",
    "description": "Rivian CEO RJ Scaringe tours the inside of electric auto maker Rivian's manufacturing facility in Normal, Illinois, U.S. June 21, 2024. Joel Angel Jua",
    "body": "Rivian CEO RJ Scaringe tours the inside of electric auto maker Rivian's manufacturing facility in Normal, Illinois, U.S. June 21, 2024. Joel Angel Juarez | ReutersDETROIT — Rivian Automotive will let artificial intelligence take the wheel to try to convince investors that its future can be more lucrative than its past.The all-electric vehicle maker is set to host its first \"Autonomy and AI Day\" Thursday as its core business of producing and selling EVs hasn't been as fruitful as expected since its initial public offering in 2021.Shares of the automaker are off more than 80% since then as internal and external challenges have caused sales and production to be slower than planned. The company also continues to lose billions of dollars annually, despite significant cost reductions and gains in software revenue thanks to a multiyear $5.8 billion joint venture deal with German automaker Volkswagen. CEO RJ Scaringe has always sold the company as a technology play in varying forms – from initially touting its cloud-based tech and \"vertically integrated ecosystem\" to more recently highlighting new \"zonal\" software architecture and AI aspirations.But the pressure is on for Rivian to deliver. It has tactically brought its software and automation efforts in house to unlock future growth potential for investors and to try to expand its customer base amid slowing sales of EVs and regulatory changes.\"Over the longer term, we believe what will differentiate Rivian's autonomous capabilities will be our end-to-end AI-centric approach,\" Scaringe said last month during the automaker's most recent quarterly investor call.Stock Chart IconStock chart iconRivian vs. Tesla stockRivian is following the strategy of other \"pure EV\" automakers in the U.S., specifically Tesla.The U.S. EV leader has promised owners for more than a decade that its cars would be able to get upgraded to autonomous vehicles that can work for them while they sleep or make a cross-country trip with no human intervention. The company launched a pilot robotaxi service in Austin, Texas, this year, with human safety drivers on board, and intends to expand that to new U.S. markets next year. Fellow EV carmaker Lucid also recently struck a partnership with AV startup Nuro to bring driverless features to its EVs.But Wall Street isn't completely buying into the hype. Morgan Stanley this week downgraded Rivian to underweight, citing the EV deceleration and Rivian not having the \"scale or balance sheet to support the capital intensity\" of reinvesting in the current \"industry hype cycle\" around AVs and AI. It also downgraded Lucid and Tesla for one or both of those reasons.\"We are taking a more cautious view on the Auto Industry heading into 2026 after a surprisingly resilient 2025,\" Morgan Stanley analyst Andrew Percoco wrote in a Sunday investor note.Scaringe has said the AI Day will include in-depth looks at the computing power of Rivian's new vehicles, such as its upcoming \"R2\" SUV; its autonomous vehicle platform; and data flywheel in which data inputs are used to continuously improve products.Rivian CEO RJ Scaringe reacts at an event to unveil a smaller R2 SUV in Laguna Beach, California, on March 7, 2024.Mike Blake | ReutersThe hope is to increase confidence in Rivian's future vehicles and technologies, which Wall Street analysts believe could be licensed to other companies.Rivian is currently viewed as lagging Tesla and even legacy automakers such as General Motors, Ford Motor and German luxury brands when it comes to its advanced driver assistance systems, or ADAS. Its features only recently allowed some drivers to have their hands off the wheel while highway driving under certain circumstances, a milestone other automakers have already reached.Rivian's AI Day comes more than four years after Tesla became the first automaker to host such an event. While Rivian is regularly compared with Tesla, its AI Day is expected to focus more on vehicles and supporting software initiatives rather than non-core businesses such as humanoid robots like Tesla has done.Wall Street expectationsWall Street analysts generally expect Rivian on Thursday to provide more details on the future capabilities of its vehicles. \"Management will likely provide updated timelines on its next generation features and perhaps better dimension the cost/resources required to achieve its ambitions,\" Deutsche Bank analyst Edison Yu said in an investor note. \"High level, the company has alluded to a vertically integrated, AI-centric autonomy platform that digests raw, multi-modal sensor data to train large models.\"Advanced driver assistance systems and autonomous vehicles have once again become a focus for investors and auto companies as AI technologies have grown over the past year.watch nowThe automotive industry has been working toward true AVs for a while, though it has seen little success other than from Google-backed Waymo and, increasingly, Tesla's ADAS features. But insiders and experts think AI can finally unlock the true potential of the technology.\"We believe RIVN will attempt to show why they should be seen as a serious players in the US AV space, which currently is largely seen as a two player game between Tesla and Waymo,\" Barclays analyst Dan Levy said in a Friday investor note.Wall Street analysts expect Rivian will focus on its in-house software enabling more advanced ADAS features, including the ability for its vehicles to eventually be able to drive themselves in certain circumstances.Scaringe has said the company expects to broaden the use cases of its hands-free systems to \"just about any road\" in the short-term, followed by eyes-off driving in the years ahead. He has recently voiced support for lidar, or light detection and ranging, systems that allow vehicles to better detect or \"see\" their surroundings.\"We applaud Rivian for its autonomy pivot especially given our view that level 3 autonomy will be a critical step for all OEMs [original equipment manufacturers]. Its goal of in-sourcing could make autonomy a profit center, which is important especially given the company's liquidity situation,\" RBC analyst Tom Narayan said in a note last week.Rivian's current vehicles feature a host a suite of radars, cameras and other sensors but not lidar.SAE International, formerly known as the Society of Automotive Engineers, has characterized automated driving for vehicles from level 0 to level 5. The highest level 5, is a fully autonomous vehicle, with each stage from level 0 adding more technologies and allowing human drivers to be more \"out of the loop.\"watch nowVehicles on U.S. roadways today have varying levels of autonomy but nearly all are categorized as level 2 — allowing drivers to have their hands off the wheel in certain circumstances — or below, including those with cruise control and \"adaptive cruise control.\" More recently, many companies have focused on growing their ADAS systems past level 2, where vehicles can largely drive themselves under certain conditions.Industry experts have also raised questions about demand for AV technologies. General Motors was the first to offer hands-free driving technologies in 2017, but the rollout was slow and adoption was low following the end of free trials.Even at Tesla, which is viewed as a software and technology leader in the U.S. with \"tech-savvy\" buyers, only about 12% of customers paid for its top-end \"FSD\" system that can control the vehicle under many circumstances, the company recently said.Stock priceDespite Rivian's sales being down 14% through the third quarter and the company's downward guidance revisions, shares of Rivian are up more than 30% this year amid gains in operational profit and investor optimism.The bullishness is led by the company's new rollout of technologies and upcoming launch of its new \"R2\" vehicle during the first half of next year.But given that those are both forward-looking catalysts, Wall Street analysts expect much of the upside potential to already be priced into the company's stock price. \"We believe investors are less likely to be bullish on the case of RIVN catching up to Waymo/Tesla in AV, and we expect that test drives / an impressive tech stack is less likely to move the stock (with this arguably already embedded in the stock),\" Levy said.Shares of Rivian closed Tuesday at $17.71, up 0.1% ahead of the AI event. The stock is up 33% this year but is a far cry from the company's IPO of $78 per share.— CNBC's Lora Kolodny and Michael Bloom contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rivian turns to AI, autonomy to woo investors as EV sales stall",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108015625-17226075032024-06-21t000000z_1422933821_rc2uf8aws884_rtrmadp_0_rivian-electric.jpeg?v=1722607565&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T14:40:00.000Z",
      "dateModified": "2025-12-10T14:40:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Greetings, earthlings’: Nvidia-backed Starcloud trains first AI model in space as orbital data center race heats up",
    "url": "https://www.cnbc.com/2025/12/10/nvidia-backed-starcloud-trains-first-ai-model-in-space-orbital-data-centers.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108239434-1765324482324-Screenshot_2025-12-09_at_65040_PM.png?v=1765324511&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T15:49:26.000Z",
    "description": "The Starcloud-1 satellite is launched into space from a SpaceX rocket on November 2, 2025.Courtesy: SpaceX | StarcloudNvidia-backed startup Starcloud ",
    "body": "The Starcloud-1 satellite is launched into space from a SpaceX rocket on November 2, 2025.Courtesy: SpaceX | StarcloudNvidia-backed startup Starcloud trained an artificial intelligence model from space for the first time, signaling a new era for orbital data centers that could alleviate Earth's escalating digital infrastructure crisis. Last month, the Washington-based company launched a satellite with an Nvidia H100 graphics processing unit, sending a chip into outer space that's 100 times more powerful than any GPU compute that has been in space before. Now, the company's Starcloud-1 satellite is running and querying responses from Gemma, an open large language model from Google, in orbit, marking the first time in history that an LLM has been run on a high-powered Nvidia GPU in outer space, CNBC has learned. \"Greetings, Earthlings! Or, as I prefer to think of you — a fascinating collection of blue and green,\" reads a message from the recently launched satellite. \"Let's see what wonders this view of your world holds. I'm Gemma, and I'm here to observe, analyze, and perhaps, occasionally offer a slightly unsettlingly insightful commentary. Let's begin!\" the model wrote.Starcloud's output Gemma in space. Gemma is a family of open models built from the same technology used to create Google's Gemini AI models.StarcloudStarcloud wants to show outer space can be a hospitable environment for data centers, particularly as Earth-based facilities strain power grids, consume billions of gallons of water annually and produce hefty greenhouse gas emissions. The electricity consumption of data centers is projected to more than double by 2030, according to data from the International Energy Agency.Starcloud CEO Philip Johnston told CNBC that the company's orbital data centers will have 10 times lower energy costs than terrestrial data centers.\"Anything you can do in a terrestrial data center, I'm expecting to be able to be done in space. And the reason we would do it is purely because of the constraints we're facing on energy terrestrially,\" Johnston said in an interview.Johnston, who co-founded the startup in 2024, said Starcloud-1's operation of Gemma is proof that space-based data centers can exist and operate a variety of AI models in the future, particularly those that require large compute clusters. \"This very powerful, very parameter dense model is living on our satellite,\" Johnston said. \"We can query it, and it will respond in the same way that when you query a chat from a database on Earth, it will give you a very sophisticated response. We can do that with our satellite.\"In a statement to CNBC, Tris Warkentin, product director at Google DeepMind, said that \"seeing Gemma run in the harsh environment of space is a testament to the flexibility and robustness of open models.\" In addition to Gemma, Starcloud was able to train NanoGPT, an LLM created by OpenAI founding member Andrej Karpathy, on the H100 chip using the complete works of Shakespeare. This led the model to speak in Shakespearean English.Orbital compute offers a way forward that respects both technological ambition and environmental responsibility. When Starcloud-1 looked down, it saw a world of blue and green. Our responsibility is to keep it that way.Philip JohnstonStarcloud CEO Starcloud — a member of the Nvidia Inception program and graduate from Y Combinator and the Google for Startups Cloud AI Accelerator — plans to build a 5-gigawatt orbital data center with solar and cooling panels that measure roughly 4 kilometers in both width and height. A compute cluster of that gigawatt size would produce more power than the largest power plant in the U.S. and would be substantially smaller and cheaper than a terrestrial solar farm of the same capacity, according to Starcloud's white paper.These data centers in space would capture constant solar energy to power next-generation AI models, unhindered by the Earth's day and night cycles and weather changes. Starcloud's satellites should have a five-year lifespan given the expected lifetime of the Nvidia chips on its architecture, Johnston said. Orbital data centers would have real-world commercial and military use cases. Already, Starcloud's systems can enable real-time intelligence and, for example, spot the thermal signature of a wildfire the moment it ignites and immediately alert first responders, Johnston said. \"We've linked in the telemetry of the satellite, so we linked in the vital signs that it's drawing from the sensors — things like altitude, orientation, location, speed,\" Johnston said. \"You can ask it, 'Where are you now?' and it will say 'I'm above Africa and in 20 minutes, I'll be above the Middle East.' And you could also say, 'What does it feel like to be a satellite? And it will say, 'It's kind of a bit weird.' ... It'll give you an interesting answer that you could only have with a very high-powered model.\"Starcloud is working on customer workloads by running inference on satellite imagery from observation company Capella Space, which could help spot lifeboats from capsized vessels at sea and forest fires in a certain location. The company will include several Nvidia H100 chips and integrate Nvidia's Blackwell platform onto its next satellite launch in October 2026 to offer greater AI performance. The satellite launching next year will feature a module running a cloud platform from cloud infrastructure startup Crusoe, allowing customers to deploy and operate AI workloads from space. \"Running advanced AI from space solves the critical bottlenecks facing data centers on Earth,\" Johnston told CNBC. \"Orbital compute offers a way forward that respects both technological ambition and environmental responsibility. When Starcloud-1 looked down, it saw a world of blue and green. Our responsibility is to keep it that way,\" he added.The risksRisks in operating orbital data centers remain, however. Analysts from Morgan Stanley have noted that orbital data centers could face hurdles such as harsh radiation, difficulty of in-orbit maintenance, debris hazards, and regulatory issues tied to data governance and space traffic. Still, tech giants are pursuing orbital data centers given the prospect of nearly limitless solar energy and greater, gigawatt-sized operations in space.Along with Starcloud and Nvidia's efforts, several companies have announced space-based data center missions. On Nov. 4, Google unveiled a \"moonshot\" initiative titled Project Suncatcher, which aims to put solar-powered satellites into space with Google's tensor processing units. Privately owned Lonestar Data Holdings is working to put the first-ever commercial lunar data center on the moon's surface.OpenAI CEO Sam Altman has explored an acquisition or partnership with a rocket maker, suggesting a desire to compete against Elon Musk's SpaceX, according to The Wall Street Journal. SpaceX is a key launch partner for Starcloud.Referring to Starcloud's launch in early November, Dion Harris, senior director of AI infrastructure at Nvidia, said: \"From one small data center, we've taken a giant leap toward a future where orbital computing harnesses the infinite power of the sun.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Greetings, earthlings’: Nvidia-backed Starcloud trains first AI model in space as orbital data center race heats up",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108239434-1765324482324-Screenshot_2025-12-09_at_65040_PM.png?v=1765324511&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T15:49:26.000Z",
      "dateModified": "2025-12-10T15:49:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former GitLab CEO raises money for Kilo to compete in crowded AI coding market",
    "url": "https://www.cnbc.com/2025/12/10/former-gitlab-ceo-raises-8-million-for-kilo-to-compete-in-vibe-coding.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238725-1765240138691-PXL_20251026_194908794.jpg?v=1765328078&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T14:00:01.000Z",
    "description": "Members of the Kilo Code team, including Scott Breitenother, its co-founder and CEO, and Sid Sijbrandij, its co-founder and previously the CEO of GitL",
    "body": "Members of the Kilo Code team, including Scott Breitenother, its co-founder and CEO, and Sid Sijbrandij, its co-founder and previously the CEO of GitLab, gather for the startup's all-team gathering in Amsterdam in October 2025.Kilo CodeInvestors are betting there's room for another startup using artificial intelligence to help software engineers write code faster. The difference with Kilo Code is it counts former GitLab CEO Sid Sijbrandij among its founders.On Wednesday, Kilo Code announced $8 million in seed funding, with backing from Breakers, Cota Capital, General Catalyst, Quiet Capital and Tokyo Black.Sijbrandij is a self-taught developer who helped popularize GitLab's tools for source code collaboration, deployment and testing. GitLab went public in 2021 and is valued at more than $6 billion. Sijbrandij stepped down as CEO last year to focus on cancer treatment but continued as board chair.Since then, the technology industry has become obsessed with having large language models write and update software, a practice commonly known in Silicon Valley as vibe coding. OpenAI co-founder Andrej Karpathy is credited with coining the term in February. OpenAI looked at buying AI coding startup Windsurf for around $3 billion, but scrapped the plan before Google hired senior Windsurf employees in a $2.4 billion transaction in July. Rival Cursor announced a $2.3 billion funding round in November at a $29.3 billion valuation.At Microsoft, vibe coding already makes up 30% of the company's code, CEO Satya Nadella said in April. Sijbrandij witnessed the action and became fascinated by what AI could do for software development. In September, an acquaintance introduced him to Scott Breitenother, who started and later sold consultancy Brooklyn Data.\"I thought we were just kind of having a meet and greet, and then 25 minutes in, Sid's like, 'Hey, can you start next week?'\" Breitenother said. Sijbrandij contributed early capital for the startup, which now employs about 34 people across continents. Breitenother is in charge, but he talks with Sijbrandij many times a day. Kilo Code's software plugs in to coding applications such as Cursor and Microsoft's Visual Studio Code. It's the most widely used service for startup OpenRouter's application programming interface that gives developers access to a variety of AI models, including Grok Code Fast 1 from Elon Musk's xAI. Kilo Code has processed more than 3 trillion tokens in the past month, according to OpenRouter. A single token represents about three-quarters of a word.Daniël Langezaal, a software engineer at Dutch e-commerce startup Plug&Pay, said he has used Kilo Code for months after trying products from Anthropic, Cursor and Microsoft, among others. He said he appreciates Kilo Code's support for both premium and affordable models, and he likes that people publicly contribute to the Kilo Code extension under an open-source license.Langezaal has spread the word. About 80% of Plug&Pay's developers now use Kilo Code, he said. It helped save time for one teammate who recently assembled a complex SQL query. \"With Kilo, it took him a day,\" Langezaal said. \"If he didn't have access to Kilo, it would have taken him a few days to implement.\"GitLab, which has been testing a platform for AI agents to perform tasks, is paying attention, and was interested in what Kilo was building.\"I talked to the board,\" Sijbrandij said. \"We ended up deciding to do it outside of GitLab.\"GitLab included reference to Kilo in a filing last month. The company said that it paid Kilo $1,000 in exchange for a right of first refusal for 10 business days should the startup receive an acquisition proposal before August 2026. The market is rapidly evolving. Design software company Figma and a slew of startups now offer vibe coding options for less technical people. It's a category Kilo Code won't be ignoring for much longer.\"We also want to be the place for people just getting started with code,\" Sijbrandij said. \"We are working on an app builder that's more like the Lovable or Bolt experience,\" he said, referring to two popular startups.  Lovable, based in Sweden, announced funding at a $1.8 billion valuation in July.WATCH: Google's vibe-coding play",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former GitLab CEO raises money for Kilo to compete in crowded AI coding market",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238725-1765240138691-PXL_20251026_194908794.jpg?v=1765328078&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T14:00:01.000Z",
      "dateModified": "2025-12-10T14:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Online grocer Thrive Market bails on booze, bets big on alcohol-free boom",
    "url": "https://www.cnbc.com/2025/12/10/online-grocer-thrive-market-goes-dry-non-alcoholic-products.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108239484-1765332550755-gettyimages-534023606-90792826.jpeg?v=1765382174&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T16:04:29.000Z",
    "description": "Thrive Market headquarters at Fast Company Creativity Counter-Conference in Los Angeles.Araya Doheny | Getty ImagesThrive Market is officially going d",
    "body": "Thrive Market headquarters at Fast Company Creativity Counter-Conference in Los Angeles.Araya Doheny | Getty ImagesThrive Market is officially going dry.The online health and grocery marketplace will become the first major online grocer to remove all alcohol products when it takes them off its subscription service. The company plans to replace the category entirely with a lineup of over 20 brands and 100 products spanning nonalcoholic beer, wine and mocktails.\"It's time to really double down on nonalcohol and take a stand that is aligned with where science and where we think attitudes among health and wellness consumers is shifting,\" Thrive CEO Nick Green told CNBC. \"Alcohol is not the future.\"The company said the move reflects shifting consumer preferences and the growing popularity of \"Dry January,\" when people abstain from drinking as the new year begins. Thrive first entered the wine market seven years ago because it saw an opportunity to \"raise health standards in the category,\" according to Green, but in recent years has seen the category's decline as a reason to exit.\"What surprised me is how fast that shift has seemed to happen with alcohol,\" said Green. \"There's a whole attitude shift, kind of paradigm shift, in the way alcohol is viewed similar frankly, to tobacco where I think that at one time smoking was very socially acceptable.\"A recent Gallup report found only 54% of U.S. adults now consume alcohol, one of the lowest levels in decades. Meantime, the latest Nielsen beer scanner data shows U.S. beer volumes have been falling by a mid-single digit percentage year over year since June. Research firm Bernstein said the data underscore a deeper consumer pivot away from traditional beer, especially as drinkers explore everything from spirits-based ready-to-drink cocktails to nonalcoholic alternatives. \"It's becoming clearer that we are seeing a broad-based reduction in US alcohol consumption,\" said Bernstein analyst Nadine Sarwat in a recent research note.At the same time, the nonalcoholic drinks sector is booming, with sales projected to reach $5 billion by 2028, according to alcohol data firm IWSR. More brands like AB InBev, Molson Coors and Heineken have entered the market.Nonalcoholic beers photographed for Food in Washington, March 11, 2024.Scott Suchman | The Washington Post | Getty ImagesThrive said its own data mirrors the national shift, too. Searches for nonalcoholic options on ThriveMarket.com have climbed steadily and accelerated over the last three months. Thrive, a CNBC Disruptor 50 company in both 2024 and 2025, has more than 1.7 million paying members nationwide and brought in over $700 million in sales last year. As its average shopper loads up on 15 items per basket, the company is betting a growing share of those items will be alcohol-free.\"People aren't shopping on Thrive Market the way they might shop on Amazon, where they order one thing and it ships separately,\" said Green. \"People are getting big boxes of stuff, they're looking to us for their pantry staples similar to what businesses like Costco see.\"The company also cites logistics as motivation for the move. While alcohol can ship to only 39 states, most nonalcoholic beverages can ship across all of the U.S.\"People are basically trading to a healthier alternative,\" said Green. \"We can focus on being that place that they go for innovation.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Online grocer Thrive Market bails on booze, bets big on alcohol-free boom",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108239484-1765332550755-gettyimages-534023606-90792826.jpeg?v=1765382174&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T16:04:29.000Z",
      "dateModified": "2025-12-10T16:04:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump slams European leaders as 'weak' — just as they're trying to impress him",
    "url": "https://www.cnbc.com/2025/12/10/trump-criticism-of-european-leaders-as-weak-comes-at-the-worst-time.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108239485-17653328192025-12-10t003939z_1073267445_rc2bdia54lfx_rtrmadp_0_usa-trump.jpeg?v=1765332911&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T12:56:57.000Z",
    "description": "U.S. President Donald Trump and Ukrainian President Volodymyr Zelenskyy pose for a picture with European leaders following a meeting in the Oval Offic",
    "body": "U.S. President Donald Trump and Ukrainian President Volodymyr Zelenskyy pose for a picture with European leaders following a meeting in the Oval Office at the White House on August 18, 2025 in Washington, DC. Win McNamee | Getty ImagesWhile it's been clear to Europe for some time that U.S. President Donald Trump is not the biggest fan of the region, the president's latest tirade against the continent's leadership will sting — particularly as the bloc strives to show more decisiveness and authority.Trump has once again provoked outrage among his European allies, describing them as \"weak\" and leading a \"decaying\" region in an interview with Politico published Tuesday. Criticizing the region's response to immigration and the war in Ukraine, Trump said: \"I think they don't know what to do.\"That comment will be jarring for Europe after its efforts in recent days, weeks and months to support Ukraine, be it militarily, diplomatically or financially — efforts which Trump has frequently downplayed.Instead, Europe has had to watch on as U.S. officials have held talks with their Russian and Ukrainian counterparts on a draft peace plan for Ukraine, without a seat at the table. That's despite the fact that the resolution of the almost four-year war — and what shape that takes — is seen by analysts, and European leaders, as critical for the region's future security.Indeed, Trump's comments came just a day after Ukraine's President Volodymyr Zelenskyy was in London to meet European leaders to discuss joint efforts to end the war. The leaders stressed the need for security guarantees for Ukraine in any peace deal, and expressed their opposition to Ukraine having to cede territory to Russia as part of an agreement, as has been demanded by Russia. watch nowTrump has vacillated on the issue, previously suggesting Ukraine would have to give up land and then suggesting Kyiv could win back lost territory.European leaders this week also discussed the thorny issue of future funding for the country, which is a bugbear for Trump. The leaders said \"positive progress\" had been made on using frozen Russian assets to support Ukraine's post-war reconstruction, although such a move faces hurdles and opposition from some countries in the EU.Trump appeared unmoved by Europe's diplomatic efforts, of late. When Politico asked him whether Europe could help end the war, he said: \"They talk but they don't produce. And the war just keeps going on and on.\"Seismic shift in an old allianceThere's no doubt that Trump has a checkered relationship with Europe and its leaders, appearing to get on well with some — such as the U.K. and Italy's Prime Ministers Keir Starmer and Giorgia Meloni, and NATO Secretary General Mark Rutte— but not so much with others.Trump has had something of an awkward \"frenemy\" relationship with French President Emmanuel Macron who he has both praised and criticized, and he has no natural rapport with the serious German Chancellor Friedrich Merz. Trump also appears to have a strained relationship with European Commission President Ursula von der Leyen.U.S. President Donald Trump and French President Emmanuel Macron speak during a meeting with Ukrainian President Volodymyr Zelenskiy (not pictured) and European leaders amid negotiations to end the Russian war in Ukraine, at the White House in Washington, D.C., U.S., August 18, 2025. Alexander Drago | ReutersBelittling his political foes is nothing new for Trump, but what's shocking for Europe is that he appears willing to relinquish longstanding friends and tested alliances that have been in place since World War II. Europe was already put on notice last week when Trump's new national security strategy stated that Europe risked \"civilizational erasure\" within the next 20 years and questioned whether European countries can \"remain reliable allies.\" In turn, it said Washington should reestablish strategic stability with Russia. The Kremlin praised the new strategy, saying it largely accorded with Russia's \"vision.\"The security strategy signals a seismic shift in U.S.-European relations, analysts say, and should be a wake-up call for Europe.\"Trump's worldview is clear\" in the new U.S. national security document, Ian Bremmer, founder and president of Eurasia Group, commented Tuesday: \"A strong united Europe is a threat, not an asset. The Kremlin calls the document \"aligned\" with Russian interests. That should make every NATO capital sit up straight,\" he said in comments on social media platform X.Bremmer said the transatlantic relationship had been the world's strongest up to this point, but that had changed under the Trump administration.\"President Trump believes a strong Europe is not in the U.S.' interests, particularly a strong, coordinated Europe. He does not like the European Union ... His issue is that the EU, together, has the ability to tell Trump things that he doesn't like to hear,\" Bremmer added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump slams European leaders as 'weak' — just as they're trying to impress him",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108239485-17653328192025-12-10t003939z_1073267445_rc2bdia54lfx_rtrmadp_0_usa-trump.jpeg?v=1765332911&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T12:56:57.000Z",
      "dateModified": "2025-12-10T12:56:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "IMF's Georgieva urges China to speed up 'long-overdue' shift away from relying on exports for growth, so as 'not to provoke' other countries ",
    "url": "https://www.cnbc.com/2025/12/10/imfs-georgieva-urges-china-to-speed-up-shift-from-exports.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108239579-1765351108685-gettyimages-2250190772-AFP_87HF2ZQ.jpeg?v=1765351130&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T10:44:25.000Z",
    "description": "International Monetary Fund (IMF) Managing Director Kristalina Georgieva attends the 1+10 Dialogue with leaders of International Economic Organisation",
    "body": "International Monetary Fund (IMF) Managing Director Kristalina Georgieva attends the 1+10 Dialogue with leaders of International Economic Organisations, with China's Premier Li Qiang (not pictured) in Beijing on December 9, 2025. Pedro Pardo | Afp | Getty ImagesBEIJING — China needs to \"accelerate\" support for domestic consumption and reduce its reliance on exports for growth, International Monetary Fund Managing Director Kristalina Georgieva has said.\"As the second-largest economy in the world, China is simply too big to generate much growth in exports and continuing to depend on export-like growth risks [and] furthering global trade tensions,\" Georgieva told reporters Wednesday.She said the country has to \"accelerate\" its decades-long plan to shift away from relying on exports for growth, adding it would be \"beneficial for China, it is beneficial for the world economy.\"She said this change was \"so as not to provoke other countries to take measures to curb down Chinese exports.\"Her comments came as trade tensions between China and the U.S. have escalated, while Europe and countries like Mexico are increasingly wary of the volume of cars and other goods coming from China. China's trade surplus reached a record of more than $1 trillion for the year as of November.Its consumer spending has remained tepid since the pandemic, partly as the ongoing real estate slump has weighed on household sentiment.Georgieva said the IMF estimates China would have to spend about 5% of its GDP over the next three years to \"resolutely\" resolve property sector problems. She said this could be achieved with tighter management of fiscal and industrial policy.She added that policymakers should be more proactive on finishing construction on pre-sold apartments — and be more decisive on allowing \"unviable\" Chinese developers to exit.\"We call them zombie firms. Well, let the zombies go away,\" she said.watch nowGeorgieva also said IMF analysis found that raising spending on social support, especially in rural areas, could help boost consumption by up to 3 percentage points of GDP in the medium term.She noted the need for specific policy measures, but emphasized the need for market forces to play a greater role, especially for China's tech development and the yuan.\"What we want to see is a market-based RMB exchange rate that reflects fundamentals,\" she added.The IMF said in a release Wednesday that China's low inflation, relative to trading partners, \"has led to real exchange rate depreciation, contributing to strong exports and rising current account surplus.\"China's GDP upgradeThe IMF on Wednesday also raised its forecast for China's economic growth next year to 4.5%, based on domestic stimulus and lower-than-expected tariffs.That's a 0.3 percentage point increase from the IMF's forecast in October. The organization also raised its forecast for 2025 growth by 0.2 percentage points to 5%.The IMF said it expects inflation in China to rise to an average of 0.8% next year, up from 0% this year.China earlier on Wednesday reported the consumer price index hit its highest in nearly two years at 0.7% growth in November from a year ago.\n\t\t\n\t\t\n\t\t\n\t\t\tWeekly analysis and insights from Asia's largest economy in your inbox\n\t\t\tSubscribe now\n\t\t\n\tThe IMF said Beijing's transition to a more consumption-led growth model \"requires more urgent and forceful\" stimulus.Chinese leaders in October announced development goals for the next five years would include greater efforts to boost consumption in addition to tech self-sufficiency. Top leaders are expected to hold an annual meeting later this week to discuss economic plans for next year.IMF trip to ChinaThe IMF representatives were speaking at the end of a 10-day visit of Beijing and Shanghai for the fund's annual China economy review, known as the Article IV Consultation.Georgieva joined the discussions with Chinese Premier Li Qiang, Vice Premier He Lifeng, People's Bank of China Governor Pan Gongsheng, Minister of Finance Lan Fo'an and Minister of Commerce Wang Wentao. Li met with Georgieva and the heads of nine other major international economic organizations on Tuesday in Beijing. The Chinese premier called for more cooperation and said China would be able to achieve its economic targets for this year, according to  Sonali Jain-Chandra, Mission Chief for China, led the visit. IMF First Deputy Managing Director Dan Katz joined part of the mission and met senior Chinese officials.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "IMF's Georgieva urges China to speed up 'long-overdue' shift away from relying on exports for growth, so as 'not to provoke' other countries ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108239579-1765351108685-gettyimages-2250190772-AFP_87HF2ZQ.jpeg?v=1765351130&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T10:44:25.000Z",
      "dateModified": "2025-12-10T10:44:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia refutes report that China's DeepSeek is using its banned Blackwell AI chips",
    "url": "https://www.cnbc.com/2025/12/10/nvidia-report-china-deepseek-ai-blackwell-chips.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236087-1764784471491-gettyimages-2249114707-HUANG_SENATE.jpeg?v=1765374381&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T14:46:09.000Z",
    "description": "Jensen Huang, chief executive officer of Nvidia Corp., outside the US Capitol in Washington, DC, US, on Wednesday, Dec. 3, 2025. Bloomberg | Bloomberg",
    "body": "Jensen Huang, chief executive officer of Nvidia Corp., outside the US Capitol in Washington, DC, US, on Wednesday, Dec. 3, 2025. Bloomberg | Bloomberg | Getty ImagesNvidia on Wednesday refuted a report that the Chinese artificial intelligence startup DeepSeek has been using smuggled Blackwell chips to develop its upcoming model. The U.S. has banned the export of Nvidia's Blackwell chips, which are considered the company's most advanced offerings, to China in an effort to stay ahead in the AI race. DeepSeek is reportedly using chips that were snuck into the country without authorization, according to The Information. \"We haven't seen any substantiation or received tips of 'phantom datacenters' constructed to deceive us and our OEM partners, then deconstructed, smuggled, and reconstructed somewhere else,\" a Nvidia spokesperson said in a statement. \"While such smuggling seems farfetched, we pursue any tip we receive.\"Read more CNBC tech newsAustralia is trying to enforce the first teen social media ban. Governments worldwide are watchingOracle's AI-fueled debt load has investors on edge ahead of quarterly earningsTrump's blessing of Nvidia AI chip sales to China gets a chilly reception from GOPMeta's multibillion-dollar AI overhaul has created a culture clashNvidia has been one of the biggest winners of the AI boom so far because it develops the graphics processing units (GPUs) that are key for training models and running large workloads. Since the hardware is so crucial for advancing AI technology, Nvidia's relationship with China has become a political flashpoint among U.S. lawmakers. President Donald Trump on Monday said Nvidia can ship its H200 chips to \"approved customers\" in China and elsewhere on the condition that the U.S. will get 25% of those sales. The announcement was met with pushback from some Republicans. DeepSeek spooked the U.S. tech sector in January when it released a reasoning model, called R1, that rocketed to the top of app stores and industry leaderboards. R1 was also created at a fraction of the cost of other models in the U.S., according to some analyst estimates. In August, DeepSeek hinted that China will soon have its own \"next generation\" chips to support its AI models.WATCH: Nvidia selling H200 AI chips to China is net positive, says Patrick Moorheadwatch now- CNBC's Kristina Partsinevelos contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia refutes report that China's DeepSeek is using its banned Blackwell AI chips",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236087-1764784471491-gettyimages-2249114707-HUANG_SENATE.jpeg?v=1765374381&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T14:46:09.000Z",
      "dateModified": "2025-12-10T14:46:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia is trying to enforce the first teen social media ban. Governments worldwide are watching.",
    "url": "https://www.cnbc.com/2025/12/10/australia-16-year-old-teens-ban-social-media-policy-law-ig-tiktok-fb-reddit-youtube-snapchat.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108216447-1761300179713-gettyimages-2198590463-socialphones-9.jpeg?v=1765353126&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T14:35:42.000Z",
    "description": "In this photo illustration, iPhone screens display various social media apps on the screens on February 9, 2025 in Bath, England.Anna Barclay | Getty ",
    "body": "In this photo illustration, iPhone screens display various social media apps on the screens on February 9, 2025 in Bath, England.Anna Barclay | Getty Images News | Getty ImagesAustralia on Wednesday became the first country to formally bar users under the age of 16 from accessing major social media platforms, a move expected to be closely monitored by global tech companies and policymakers around the world.Canberra's ban, which came into effect from midnight local time, targets 10 major services, including Alphabet's YouTube, Meta's Instagram, ByteDance's TikTok, Reddit, Snapchat and Elon Musk's X.The controversial rule requires these platforms to take \"reasonable steps\" to prevent underage access, using age-verification methods such as inference from online activity, facial estimation via selfies, uploaded IDs, or linked bank details.All targeted platforms had agreed to comply with the policy to some extent. Elon Musk's X had been one of the last holdouts, but signaled on Wednesday that it would comply. The policy means millions of Australian children are expected to have lost access to their social accounts. However, the impact of the policy could be even wider, as it will set a benchmark for other governments considering teen social media bans, including Denmark, Norway, France, Spain, Malaysia and New Zealand. Controversial rolloutAhead of the legislation's passage last year, a YouGov survey found that 77% of Australians backed the under-16 social media ban. Still, the rollout has faced some resistance since becoming law.Supporters of the bill have argued it safeguards children from social media-linked harms, including cyberbullying, mental health issues, and exposure to predators and pornography. Among those welcoming the official ban on Wednesday was Jonathan Haidt, social psychologist and author of The Anxious Generation, a 2024 best-selling book that linked a growing mental health crisis to smartphone and social media usage, especially for the young.watch nowIn a post on social media platform X, Haidt commended policymakers in Australia for \"freeing kids under 16 from the social media trap.\"\"There will surely be difficulties in the early months, but the world is rooting for your success, and many other nations will follow,\" he added. On the other hand, opponents contend that the ban infringes on freedoms of expression and access to information, raises privacy concerns through invasive age verification, and represents excessive government intervention that undermines parental responsibility.Those critics include groups like Amnesty Tech, which said in a statement Tuesday that the ban was an ineffective fix that ignored the rights and realities of younger generations.\"The most effective way to protect children and young people online is by protecting all social media users through better regulation, stronger data protection laws and better platform design,\" said Amnesty Tech Programme Director Damini Satija.watch nowMeanwhile, David Inserra, a fellow for free expression and technology at the Cato Institute, warned in a blog post that children would evade the new policy by shifting to new platforms, private apps like Telegram, or VPNs, driving them to \"more isolated communities and platforms with fewer protections\" where monitoring is harder.Tech companies like Google have also warned that the policy could be extremely difficult to enforce, while government-commissioned reports have pointed to inaccuracies in age-verification technology, such as selfie-based age-guessing software. Indeed, on Wednesday, local reports in Australia indicated that many children had already bypassed the ban, with age-assurance tools misclassifying users, and workarounds such as VPNs proving effective. However, Australian Prime Minister Anthony Albanese had attempted to preempt these issues, acknowledging in an opinion piece on Sunday that the system would not work flawlessly from the start, likening it to liquor laws.\"The fact that teenagers occasionally find a way to have a drink doesn't diminish the value of having a clear national standard,\" he added.Experts told CNBC that the rollout is expected to continue to face challenges and that regulators would need to take a trial-and-error approach. \"There's a fair amount of teething problems around it. Many young people have been posting on TikTok that they successfully evaded the age limitations and that's to be expected,\" said Terry Flew, a professor of digital communication and culture at the University of Sydney. \"You were never going to get 100% disappearance of every person under the age of 16 from every one of the designated platforms on day one,\" he added.Global implicationsExperts told CNBC that the policy rollout in Australia will be closely watched by tech firms and lawmakers worldwide, as other countries consider their own moves to ban or restrict teen social media usage. \"Governments are responding to how public expectations have changed about the internet and social media, and the companies have not been particularly responsive to moral suasion,\" said Flew. \"We see similar pressures are emerging, particularly, but not exclusively in Europe,\" he added.  The European Parliament passed a non-binding resolution in November advocating a minimum age of 16 for social media access, allowing parental consent for 13 to 15-year-olds. The bloc has also proposed banning addictive features such as infinite scrolling and auto-play for minors, which could lead to EU-wide enforcement against non-compliant platforms.watch nowOutside Europe, Malaysia and New Zealand have also been advancing proposals to ban social media for children under 16. However, laws elsewhere are expected to differ from Australia's, whether that be regarding age restrictions or age verification processes. \"My hope is that countries that are looking at implementing similar policies will monitor for what doesn't work in Australia and learn from our mistakes,\" said Tama Leaver, professor at the Department of Internet Studies at Curtin University and a Chief Investigator in the ARC Centre of Excellence for the Digital Child. \"I think platforms and tech companies are also starting to realize that if they don't want age-gating policies everywhere, they're going to have to do much better at providing safer, appropriate experiences for young users.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia is trying to enforce the first teen social media ban. Governments worldwide are watching.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108216447-1761300179713-gettyimages-2198590463-socialphones-9.jpeg?v=1765353126&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T14:35:42.000Z",
      "dateModified": "2025-12-10T14:35:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]