[
  {
    "title": "JPMorgan Chase reaches deal to become Apple Card issuer as Goldman closes chapter on consumer foray",
    "url": "https://www.cnbc.com/2026/01/07/jpmorgan-apple-credit-card.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108213165-1760638891276-gettyimages-2241014582-IMF_WORLD_BANK.jpeg?v=1760638927&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-07T23:53:48.000Z",
    "description": "Apple CEO Tim Cook introduces Apple Card during a launch event at Apple headquarters on March 25, 2019, in Cupertino, California.Noah Berger | AFP | G",
    "body": "Apple CEO Tim Cook introduces Apple Card during a launch event at Apple headquarters on March 25, 2019, in Cupertino, California.Noah Berger | AFP | Getty ImagesJPMorgan Chase has reached a deal to take over the Apple credit card from its original issuer, Goldman Sachs, the two banks said Wednesday in separate releases.The arrangement, completed after a year of negotiations between the parties, means that a giant in credit cards and retail banking overall will grow even larger. JPMorgan will take over more than $20 billion in card loans from Goldman, which began to pivot away from consumer finance in 2022.JPMorgan said that the deal will take about 24 months to close and that it will book a $2.2 billion provision for credit losses when it reports fourth-quarter 2025 earnings next week.Customers will continue to tap the card's existing perks and it will continue to run on Mastercard's network, the bank said.\"Chase shares our commitment to innovation and delivering products and services that enhance consumers' lives,\" Jennifer Bailey, an Apple executive in charge of payments, said in the release. \"We look forward to working together to continue to provide a best-in-class experience.\"The contract, further enmeshing JPMorgan with a dominant tech player, burnishes the bank's reputation as a leader in American finance. Even before this deal, it was already the country's largest credit card issuer by purchase volume.For Goldman, offloading the Apple Card business helps it move past a rocky chapter for CEO David Solomon. Goldman entered the credit card business with great fanfare in 2019 by beating out other issuers for the Apple Card.\"This transaction substantially completes the narrowing of our focus in our consumer business,\" Solomon said in his bank's release. \"We look forward to continuing to support our customers during the transition to a new issuer as we focus on advancing the strategy we laid out for our core franchises.\"Goldman said that the transaction will boost its earnings by 46 cents per share when it posts results next week.Last bank standingIn July, CNBC reported that talks between JP Morgan and Apple had progressed, with JPMorgan being the last bank standing after other interested issuers, including American Express, Synchrony and Barclays, exited.At the time, people with knowledge of the matter said that JPMorgan would only take on the Apple Card portfolio if Goldman and Apple were willing to make concessions.It appears as though JPMorgan succeeded on at least one front: It is taking over the Apple Card portfolio at a discount of more than $1 billion, according to a person familiar with the transaction, who spoke on the condition of anonymity about confidential details. The portfolio contains more subprime and lower-credit borrowers than JPMorgan would usually serve, people with knowledge of the business have told CNBC. Apple wanted Goldman to service as many of its iPhone users as possible, the sources have said.JPMorgan is also planning to offer an Apple savings account as part of a bundle of financial services the tech giant offers. The Wall Street Journal first reported on the deal.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "JPMorgan Chase reaches deal to become Apple Card issuer as Goldman closes chapter on consumer foray",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108213165-1760638891276-gettyimages-2241014582-IMF_WORLD_BANK.jpeg?v=1760638927&w=1920&h=1080"
      ],
      "datePublished": "2026-01-07T23:53:48.000Z",
      "dateModified": "2026-01-07T23:53:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venezuela says 100 killed in U.S. military operation that captured Maduro",
    "url": "https://www.cnbc.com/2026/01/07/us-venezuela-military-operation-maduro-injuries-casualties.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108249177-1767767224269-gettyimages-2254194774-maduro_010526xny_27.jpeg?v=1767767237&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-08T08:18:26.000Z",
    "description": "Nicolas Maduro and his wife, Cilia Flores, are seen in handcuffs after landing at a Manhattan helipad, escorted by heavily armed Federal agents as the",
    "body": "Nicolas Maduro and his wife, Cilia Flores, are seen in handcuffs after landing at a Manhattan helipad, escorted by heavily armed Federal agents as they make their way into an armored car en route to a Federal courthouse in Manhattan on Jan. 5, 2026 in New York City. Xny/star Max | Gc Images | Getty ImagesMore than 100 people were killed during the U.S. military operation in Venezuela that captured Nicolás Maduro and his wife, the country's Interior Minister Diosdado Cabello said Wednesday.It was the first time a Venezuelan government official publicly provided a death toll from the operation, as additional details emerged about the mission, which U.S. President Donald Trump described as \"perfectly executed.\"\"So far — and I say so far — there are 100 dead. One hundred. And a similar number injured,\" Cabello said. Two senior Venezuelan officials had previously told MS Now that more than 70 people were killed in the raid.Cabello also said both Maduro and his wife, Cilia Flores, were injured during the operation. MS Now earlier reported that Maduro was hurt after falling while attempting to flee. Two U.S. sources told the outlet that Flores was struck in the head during the raid.Cuba revealed on Monday that 32 of its citizens were killed during the operation, adding that those individuals were carrying out missions for Cuba's armed forces and interior ministry. The statement was posted by Cuba's presidential office on Facebook.Special operations forces from multiple service branches and more than 150 military aircraft were involved in the capture of Maduro.Seven U.S. service members were injured during the military operation, a Pentagon official told MS Now on Wednesday.Two of the seven are still recovering, while five have recovered from their injuries sustained in the operation dubbed \"Absolute Resolve.\"\"The fact that this extremely complex and grueling mission was successfully executed with so few injuries is a testament to the expertise of our joint warriors,\" the official said.The official said an assessment of casualties on the ground was still ongoing and is being led by the U.S. intelligence community.U.S. President Donald Trump said the military action was conducted in coordination with American law enforcement authorities, according to a post on Truth Social on Saturday.The U.S. strikes followed weeks of military buildup in the region and repeated threats by Trump against Maduro.The deposed leader appeared in a New York court on Monday, where he said he had been \"kidnapped\" with his wife by U.S. forces from his home in Caracas and described himself as a \"prisoner of war.\" He pleaded not guilty to drug trafficking charges.— CNBC's Lim Hui Jie and MS Now's Julia Jester contributed to this report.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venezuela says 100 killed in U.S. military operation that captured Maduro",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108249177-1767767224269-gettyimages-2254194774-maduro_010526xny_27.jpeg?v=1767767237&w=1920&h=1080"
      ],
      "datePublished": "2026-01-08T08:18:26.000Z",
      "dateModified": "2026-01-08T08:18:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft revealed as company behind controversial data center proposal in Michigan township",
    "url": "https://www.cnbc.com/2026/01/07/microsoft-behind-controversial-data-center-in-michigan-township.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108249718-1767835792137-gettyimages-1203055659-INDIA_NADELLA.jpeg?v=1767835840&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-08T02:12:22.000Z",
    "description": "Microsoft CEO Satya Nadella speaks during the Future Decoded Tech Summit in Bengaluru, India, on Feb. 25, 2020. Microsoft will open a new data-center ",
    "body": "Microsoft CEO Satya Nadella speaks during the Future Decoded Tech Summit in Bengaluru, India, on Feb. 25, 2020. Microsoft will open a new data-center region in Spain, expanding their strategic partnership with Telefonica SA, according the the statement by Telefonica.Samyukta Lakshmi | Bloomberg | Getty ImagesMicrosoft has identified itself as the mystery company behind a prospective data center in a part of Michigan where locals have objected to such a development. On Wednesday, Microsoft's cloud infrastructure team was named in a letter, published by Lowell Charter Township, as the party eyeing a 237-acre lot beside Interstate 96. The township, with a population of around 6,500, is located 20 miles southeast of Grand Rapids.The letter came after weeks of speculation about who was collaborating with developer Franklin Partners for the controversial project. Franklin, based in Illinois, had previously said it was working with a national company based in the U.S. to build a data center on the land. In December, locals crowded into a planning commission meeting, where a public hearing on the proposed rezoning was on the agenda, leading to the postponement of the event. News outlet MLive reported that a Grand Rapids business owner appeared in a Mr. Peanut costume and held up a sign saying \"This is nuts.\" Some in the area have said the township was moving too quickly to rezone the land, given the absence of clarity surrounding issues like energy requirements to operate the facility. Days after the canceled meeting, local officials said they were temporarily holding off on moving forward with the project.\"We are introducing ourselves now because we have observed that the community would like more information about the proposal, and we believe it is important to be transparent about our intentions moving forward,\" Microsoft said in Wednesday's letter. \"We asked the seller to pause the rezone process so that we could spend time with the community early this year and share more about our potential long-term plans before we proceed.\"Microsoft is set to nearly double the size of its data center portfolio in the next two years, CEO Satya Nadella told analysts in October. It's among a group of industry heavyweights, including Amazon, Google, Meta, Oracle, OpenAI and Elon Musk's xAI, rushing to spin up data centers packed with Nvidia's graphics processing units and other infrastructure needed to run powerful artificial intelligence models and workloads. Tech's megacaps are collectively committing hundreds of billions of dollars a year to capital expenditures, raising concerns that they're fueling another industry bubble. Utilities in some U.S. markets have said they won't be able to supply the energy needed for these planned data centers, which has made site selection more difficult. Residents living near the sites of proposed facilities have been pushing back, citing a range of concerns.Water use is one of the key issues. The Michigan township said it has an agreement with the nearby city of Lowell to provide a path for increased \"capacity of the plant at no additional cost to rate payers.\" Consumers Energy, a utility serving millions of Michiganders, has said data centers will not lead to higher electricity rates.The lot in the Covenant Business Park in the township is zoned as industrial planned unit development, and has sat empty, in part because of a lack of water and sewer services. The township's board would have to approve to change the zoning to light industrial for the project to advance.The development would result in $500 million to $1 billion in investment over the course of three to five years, the township said.The planning commission is set to meet again on Jan. 12. WATCH: Data centers in space will be 'front and center' for investors in next 12-24 months: BofA's Obinwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft revealed as company behind controversial data center proposal in Michigan township",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108249718-1767835792137-gettyimages-1203055659-INDIA_NADELLA.jpeg?v=1767835840&w=1920&h=1080"
      ],
      "datePublished": "2026-01-08T02:12:22.000Z",
      "dateModified": "2026-01-08T02:12:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says U.S. to ban large investors from buying homes",
    "url": "https://www.cnbc.com/2026/01/07/trump-housing-affordability.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108003382-1720549569834-gettyimages-2155188332-4045_32_2024_3236.jpeg?v=1767817249&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-08T00:04:06.000Z",
    "description": "watch nowPresident Donald Trump said the U.S. should bar large institutional investors from buying single-family homes, arguing that corporate ownersh",
    "body": "watch nowPresident Donald Trump said the U.S. should bar large institutional investors from buying single-family homes, arguing that corporate ownership has helped push housing further out of reach for everyday Americans.\"For a very long time, buying and owning a home was considered the pinnacle of the American Dream. It was the reward for working hard, and doing the right thing, but now, because of the Record High Inflation caused by Joe Biden and the Democrats in Congress, that American Dream is increasingly out of reach for far too many people, especially younger Americans,\" Trump said in a Truth Social post Wednesday.\"It is for that reason, and much more, that I am immediately taking steps to ban large institutional investors from buying more single-family homes, and I will be calling on Congress to codify it. People live in homes, not corporations,\" he added.Private equity giants, real estate investment trusts and other large institutional investors have amassed sizable portfolios of single-family rental homes over the past decade. Many have argued that these investments have reduced housing supply for would-be homeowners and helped drive up prices. Invitation Homes, which is the largest renter of single-family homes in the country, tumbled 6%. Shares of Blackstone, an investing firm that owns and rents single-family homes, dropped more than 5%. Private equity firm Apollo Global Management also declined over 5%.The national median existing single-family home price was $426,800 in the third quarter of 2025 after hitting a record high of $435,300 in the summer, according to the National Association of Realtors. The average rate on a 30-year fixed mortgage is currently at 6.19%, according to Mortgage News Daily.Blackstone was the largest private-equity owner of apartments in the U.S. with more than 230,000 units, according to data from the Private Equity Stakeholder Project released last year. Blackstone in recent years has spent billions acquiring real estate companies such as Tricon Residential, American Campus Communities and AIR Communities.Trump did not provide details on how such a ban would be implemented. Trump said he plans to outline additional housing and affordability proposals during a speech at the World Economic Forum in Davos in two weeks.Senator Tim Scott, head of the committee overseeing housing in the Senate, said while he embraced Trump's push for affordability, the better way to go forward would be his bipartisan \"ROAD to Housing\" bill.\"2026 must be the year we get housing affordability right for working families. I welcome President Trump's desire to look for ways to create more homeowners, especially first-time homeowners,\" Scott said in a statement to CNBC's Emily Wilkins. \"My focus is on advancing meaningful solutions that expand housing supply and lower costs — including building on our unanimously passed ROAD to Housing Act — because that's how we make the American Dream more attainable.\"— CNBC's Alex Harring contributed reporting.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says U.S. to ban large investors from buying homes",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108003382-1720549569834-gettyimages-2155188332-4045_32_2024_3236.jpeg?v=1767817249&w=1920&h=1080"
      ],
      "datePublished": "2026-01-08T00:04:06.000Z",
      "dateModified": "2026-01-08T00:04:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump’s Greenland gambit puts China on edge after Venezuela operation",
    "url": "https://www.cnbc.com/2026/01/08/us-trump-china-greenland-denmark-arctic-tensions-trump-rare-earth-elements-minerals-mining.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108249107-1767747479480-gettyimages-1316746348-vcg111328729453.jpeg?v=1767747492&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-08T06:28:07.000Z",
    "description": "SHANGHAI, CHINA - MAY 06: China's research icebreaker Xuelong 2, or Snow Dragon 2,  arrives at Waigaoqiao port after over 5-month Antarctic expedition",
    "body": "SHANGHAI, CHINA - MAY 06: China's research icebreaker Xuelong 2, or Snow Dragon 2,  arrives at Waigaoqiao port after over 5-month Antarctic expedition on May 6, 2021 in Shanghai, China. Vcg | Visual China Group | Getty ImagesU.S. President Donald Trump's renewed threat to take control of Greenland has raised alarm in Beijing, following Washington's military operation that seized Venezuelan President Nicolás Maduro.Trump, who has long advocated U.S. control over the self-governing Danish territory, repeatedly emphasized on Sunday that Greenland is strategically important.\"We need Greenland from a national security situation. It's so strategic. Right now, Greenland is covered with Russian and Chinese ships all over the place,\" Trump told reporters aboard Air Force One.In an email to Chinese state media Xinhua News Agency, White House spokesperson Karoline Leavitt said Trump views acquiring Greenland as a national security priority to deter rivals in the Arctic. She added that his team is weighing a range of options — including the possibility of using military force.Chinese authorities have pushed back. On Monday, Chinese Foreign Ministry spokesperson Lin Jian criticized Washington for \"using the so-called 'China threat' as a pretext for itself to seek selfish gains.\"Frozen frontiersChina described itself as a \"near-Arctic state\" in its 2018 official Arctic Policy, asserting its right to use resources and develop shipping routes in the Arctic. State-linked Chinese firms have also invested heavily in Arctic energy projects and developed maritime routes that could reduce shipping times between Asia and Europe. \"China would push back hard against any U.S. move to take control of Greenland, given Beijing's commercial interests on the island — from resource exploration to the security of Arctic shipping routes,\" said Xinbo Wu, director at the Center for American Studies at Shanghai-based Fudan University. The U.S. Defense Department has identified China and Russia as key competitors in the region, pointing to their expanded military capabilities and joint naval patrols as risks to national security. Beijing could seek to raise costs for Washington through multilateral diplomacy and may deepen military cooperation with Russia in the Arctic region to deter the U.S., Wu said.\"We are really getting into uncharted territory and we have to be extremely careful,\" said Henry Wang, founder and president of the Center for China and Globalization, a think-tank that often aligns with Beijing's thinking.\"The international community has to work together now and probably stop this kind of unilateral approach.\"Energy, rare earths, infrastructureBeijing's main interests in Greenland mirror those of the U.S.: rare earths, uranium and zinc, said Dan Wang, China director at Eurasia Group. Greenland, a vast and sparsely populated autonomous Danish territory, hosts several large rare-earth element deposits, with some discovered mines ranking among the world's largest. These minerals are crucial for high-tech industries, from electric vehicles to defense equipment.  Besides the U.S. and China, the European Union has also tried to secure access to these critical mineral supplies.Chinese investors have grown \"much more cautious\" about Greenland in recent years amid rising geopolitical uncertainty, said Patrik Andersson, an analyst at the Swedish National China Center at the Swedish Institute of International Affairs. Denmark retains the legal authority to block foreign investments on national security grounds. In 2016, a Hong Kong-linked firm attempted to acquire a former Danish naval base and related port facilities, prompting Copenhagen to block the sale. A Chinese state-owned firm also withdrew its bid for an airport construction contract worth 3.6 billion Danish kroner ($563 million) in 2019 after Greenland chose Denmark over Beijing to finance the project. Andersson noted that in some cases, Chinese interest in Greenland's minerals appeared to have already declined before the recent rise in geopolitical risk, in part due to the high costs of operating in Greenland. \"From a commercial standpoint, Chinese investors may see more attractive opportunities elsewhere,\" he added. watch nowSome Chinese-backed projects in Greenland have also stalled over environmental concerns.Chinese state-affiliated company Shenghe Resources acquired a stake in the Kvanefjeld project in southern Greenland in 2016. The project, which was set to become one of the world's largest rare-earth and uranium mines, was halted after Greenland reinstated a ban on uranium mining in 2021. While some analysts have estimated Chinese investments in the Arctic at over $90 billion and described them as \"unconstrained,\" Harvard University's Kennedy School said the figures are \"highly exaggerated\" because they included failed investments and unbuilt projects.According to Harvard's estimates in June 2025, most of the mineral, oil and gas resource projects in Greenland with Chinese backing had been paused or canceled. Despite those setbacks, Greenland opened its representation office in Beijing in 2023 as the Arctic country sought to deepen ties with Beijing.   'Polar Silk Road'China has eyes on new shipping routes opening up as melting ice opens shorter paths between Asia and Europe. China's exports to the European Union, its second-largest trading bloc, grew 8.1% year-on-year in the first eleven months of 2025. Beijing formally introduced the \"Polar Silk Road\" in its 2018 Arctic policy white paper and launched its first Arctic shipping route to Europe in September 2025, cutting transit times to about 20 days, roughly half the time needed for a journey through the Suez Canal. The alternative sea route presents not only \"immense economic opportunities\" for Beijing through faster trade and access to untapped natural resources, but also a \"strategic challenge to the United States' dominance of global sea lanes,\" said Zoha Fatima, a researcher focused on Arctic governance and geopolitics. China has also expanded Arctic research efforts over the years, supporting discoveries related to sea ice composition, space weather and marine life. Building on existing projects in Norway, Iceland, Sweden and Finland, China has also planned a research and satellite ground station in Greenland.   These facilities are crucial for China's Beidou navigation satellite system, developed as an alternative to the U.S.'s GPS system.  China's polar research programs have raised security concerns in the Arctic. In 2022, the Biden administration asserted that China used its scientific engagements to conduct \"dual-use research with intelligence or military applications.\" \"If Trump were to take Greenland, Beijing would frame this as U.S. unilateralism and North Atlantic militarization, while stressing respect for Danish-Greenlandic autonomy and UN-based rules,\" said Eurasia's Wang. — CNBC's Evelyn Cheng, Emily Tan contributed to this story. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump’s Greenland gambit puts China on edge after Venezuela operation",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108249107-1767747479480-gettyimages-1316746348-vcg111328729453.jpeg?v=1767747492&w=1920&h=1080"
      ],
      "datePublished": "2026-01-08T06:28:07.000Z",
      "dateModified": "2026-01-08T06:28:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ford enters race to offer eyes-off driving tech, starting with $30,000 EV in 2028",
    "url": "https://www.cnbc.com/2026/01/07/ford-eyes-off-driving-ev-2028.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108205796-1759246835485-AP25120668077019.jpg?v=1767824348&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-08T01:56:11.000Z",
    "description": "Jim Farley, president and chief executive officer of Ford, speaks at the Ford Motor Co.'s Kentucky Truck Plant to launch the 2025 Ford Expedition, in ",
    "body": "Jim Farley, president and chief executive officer of Ford, speaks at the Ford Motor Co.'s Kentucky Truck Plant to launch the 2025 Ford Expedition, in Louisville, Kentucky, April 30, 2025.Carolyn Kaster | APFord Motor plans to introduce eyes-off driving technology on an upcoming $30,000 all-electric vehicle in 2028, the Detroit automaker announced Wednesday.The target brings Ford into a race against competitors such as Tesla, General Motors and Rivian Automotive to develop and broadly launch such systems, which Wall Street views as a potential growth market to fully autonomous vehicles. Ford's plan is similar to those of other automakers, but the company notably plans to offer the new system on a mainstream EV first, rather than on a pricier model — defying typical technology rollouts in the automotive industry.\"It's part of what has evolved to be a broader technology strategy of putting our best and newest technology where the volume is and where the accessibility is,\" Doug Field, Ford's chief EV, digital and design officer, told CNBC during an interview.The first vehicle to feature the new system is expected to be built on the company's upcoming \"Universal EV platform,\" which Ford has said is capable of supporting a variety of vehicles. The first is a roughly $30,000 midsize pickup truck set to hit the market in 2027. watch nowField, who joined Ford after stints with Apple and Tesla, said the first vehicle with the eyes-off system will come at that starting price, but did not disclose if it would be the pickup truck.Ford has said the next-generation EV platform reduces parts by 20% versus a typical vehicle, with 25% fewer fasteners, 40% fewer workstations in the plant and 15% faster assembly time.Field announced the eyes-off system at the CES technology show in Las Vegas alongside other plans, including a new vehicle software architecture as well as a Ford-engineered artificial intelligence assistant. GM in October announced similar plans, including an AI assistant and an eyes-off system expected to launch in 2028 on its electric Cadillac Escalade IQ. That vehicle currently starts at more than $127,000.SkunkworksFord, led by CEO Jim Farley, is under pressure to deliver on the new vehicle platform, known as UEV, and its supporting technologies, which largely fall under Field.The company has wasted billions of dollars amid shifting EV strategies as well as quality and production issues in recent years.Ford has significantly cut back its spending on EVs and has moved focus from large all-electric pickup trucks and SUVs to smaller, more affordable models through a special project, or \"skunkworks,\" team that created the UEV platform. Ford announced plans to invest about $5 billion in U.S. plants to produce the vehicles and the batteries to power them.watch nowField referred to the skunkworks team as a \"bet\" over the last couple of years that has \"started to build a tremendous amount of confidence\" over the \"last few months.\" He said Ford now has all of the critical software and supporting hardware it needs in-house for a new generation of technologically advanced vehicles to differentiate the automaker.\"One of the things we're seeing is just how much faster our development process works on this product and this architecture compared to what we've done in the past,\" Field said. \"So, we have a lot of confidence in our ability to get this out.\"Ford last month said it expects to record about $19.5 billion in special items through 2027 related to such restructuring efforts and its pullback in EV investments.Eyes-off drivingField said Ford's planned eyes-off system, which the auto industry refers to as \"Level 3 driving automation,\" will utilize an array of sensors and in-house software development to lower costs compared to competitors. Field declined to comment on the roadmap for expanding the new system to other vehicles, but said the goal is to commoditize the technology. \"The actual rollout schedule will be based on a lot of work we have to do on which customers need it in their applications, when, and which products are most ready for it now,\" Field said. \"It'll take time to roll it out everywhere, but we'll prioritize that based on where we will have the biggest impact on customers.\"Ford's BlueCruise system displayed on the driver information cluster of an F-150 pickup truck.FordSAE International, formerly known as the Society of Automotive Engineers, has characterized automated driving for vehicles from Level 0 to Level 5. The highest, Level 5, is a fully autonomous vehicle, with each stage from Level 0 adding more technologies and enabling human drivers to be more \"out of the loop.\"Ford currently offers a Level 2 advanced driver assistance system, or ADAS, known as BlueCruise. While active, a vehicle can drive itself under certain circumstances without human intervention on divided highways, but drivers still need to pay attention to the roads and system in case of problems.  AI assistant, new vehicle 'brain'Ford's new AI assistant is expected to launch in early 2026 through its phone apps for Ford and Lincoln, followed by a native in-vehicle experience starting in 2027, the company said Wednesday. Several other automakers also have announced plans for AI digital assistants, but Field said he believes Ford's will offer unique capabilities specific to each car or truck by utilizing each vehicle's unique identification number.Ford said the AI assistant will be able to review a picture of a trailer to confirm whether a vehicle can properly tow it, for example, or assess how many bags of mulch the interior of a car or truck can hold. \"The AI companion is something we think we can make special for Ford, representative of what we're trying to do on the customer experience side,\" Field said.Assisting in that better customer experience is expected to be an updated in-house software architecture that Ford's calling an \"integrated digital platform\" that will debut with the UEV platform.The company said the updated system will result in \"a more unified 'brain inside' the vehicle — a single, powerful module that unifies infotainment, ADAS, audio, and networking.\"\"For customers, that means a vehicle that feels more consistent, more reliable, and more capable year after year,\" Field said in a blog post accompanying the CES announcements.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ford enters race to offer eyes-off driving tech, starting with $30,000 EV in 2028",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108205796-1759246835485-AP25120668077019.jpg?v=1767824348&w=1920&h=1080"
      ],
      "datePublished": "2026-01-08T01:56:11.000Z",
      "dateModified": "2026-01-08T01:56:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he will not permit dividends and stock buybacks for defense companies",
    "url": "https://www.cnbc.com/2026/01/07/trump-dividends-stock-buybacks-defense-companies.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108248801-1767714747625-gettyimages-2254927972-aw1a9594_evbrlwla.jpeg?v=1767714772&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-07T23:36:58.000Z",
    "description": "watch nowPresident Donald Trump on Wednesday said he \"will not permit\" defense companies to issue dividends or stock buybacks until those firms speed ",
    "body": "watch nowPresident Donald Trump on Wednesday said he \"will not permit\" defense companies to issue dividends or stock buybacks until those firms speed up their production of military equipment and address his other complaints about the industry.Trump, in a lengthy Truth Social post, also took aim at defense contractors' executive pay packages, calling them \"exorbitant and unjustifiable.\"\"Defense Companies are not producing our Great Military Equipment rapidly enough and, once produced, not maintaining it properly or quickly,\" he wrote.Until those companies build new production plants, \"no Executive should be allowed to make in excess of $5 Million Dollars,\" Trump declared.Shares of General Dynamics, Lockheed Martin and Northrop Grumman each fell about 3% following Trump's comments.Trump later singled out Raytheon as \"the least responsive to the needs of the Department of War, the slowest in increasing their volume, and the most aggressive spending on their Shareholders rather than the needs and demands of the United States Military.\"He said that the Pentagon will cut its business ties with Raytheon unless it \"steps up\" on investment in plants and equipment, adding that \"under no circumstances\" can the company do any more stock buybacks in the meantime.Shares of RTX, the parent of Raytheon, slid an additional 2% in after-hours trading after closing down 2.5%. A major defense contractor, RTX manufactures advanced air-to-air missiles and many of the components in the F-35 fighter jet.It was not initially clear what impact or binding force, if any, Trump's announcement would have on major defense companies' financial activities. The White House did not immediately respond to CNBC's request for additional information.Stock Chart IconStock chart icon$GD, $LMT and $NOC Stock Prices Trump griped in the post that \"massive\" shareholder dividends and buybacks were taking place \"at the expense and detriment of investing in Plants and Equipment.\"\"This situation will no longer be allowed or tolerated!\" Trump wrote in the post, which warned the defense industry to \"BEWARE.\"\"Therefore, I will not permit Dividends or Stock Buybacks for Defense Companies until such time as these problems are rectified — Likewise, for Salaries and Executive Compensation,\" he wrote.Military equipment \"must be built now with the Dividends, Stock Buybacks, and Over Compensation of Executives, rather than borrowing from Financial Institutions, or getting the money from your Government,\" Trump added.While the tech industry leads the way in buybacks, defense companies have also spent big repurchasing stock in recent years.Northrop Grumman, for example, spent $1.17 billion on stock buybacks in the nine months ended Sept. 30 and paid out $964 million in dividends to shareholders over that time period.Lockheed spent $2.25 billion on stock buybacks in the nine months ended Sept. 28, while paying out $2.33 billion in dividends.Northrop, Lockheed and RTX did not immediately respond to CNBC's requests for comments on Trump's posts. General Dynamics declined to comment.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he will not permit dividends and stock buybacks for defense companies",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108248801-1767714747625-gettyimages-2254927972-aw1a9594_evbrlwla.jpeg?v=1767714772&w=1920&h=1080"
      ],
      "datePublished": "2026-01-07T23:36:58.000Z",
      "dateModified": "2026-01-07T23:36:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The first of China’s 'AI tigers' goes public as Zhipu climbs in Hong Kong debut",
    "url": "https://www.cnbc.com/2026/01/08/china-ai-tiger-goes-ipo-zhipu-hong-kong-debut-openai-knowledge-atlas-hsi-hang-seng-listing.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108164338-1750918943889-gettyimages-2206295278-TFSPI_24032025-5829.jpeg?v=1767842302&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-08T07:02:30.000Z",
    "description": "The Zhipu AI logo is seen displayed on a smartphone screen. Sopa Images | Lightrocket | Getty ImagesShares of Knowledge Atlas Technology JSC, better k",
    "body": "The Zhipu AI logo is seen displayed on a smartphone screen. Sopa Images | Lightrocket | Getty ImagesShares of Knowledge Atlas Technology JSC, better known as Zhipu, edged higher on their Hong Kong debut, following a $558 million initial public offering that made it the first of China's \"AI tigers\" to go public.The stock rose as much as 15% above its offer price of 116.20 Hong Kong Dollars ($15) on Thursday, with around 37.4 million shares on offer by the Beijing-based startup.The IPO valued Zhipu at around HK$4.3 billion, making it one of the larger AI flotations in recent years. Founded in 2019 by researchers from a top Chinese university, Zhipu represents the country's first major large language model company to go public through an IPO. The listing marks another key milestone for China's broader artificial intelligence sector following a wave of recent listings by AI chipmakers. The firm, strongly backed by Beijing, is also considered one of China's so-called \"AI tigers\" — startups building large language models to rival the likes of OpenAI and Anthropic. Other notable firms in the group include DeepSeek, which famously rattled markets early last year with the release of one of its LLM models. While not as well known globally as DeepSeek, Zhipu gained attention last year when American AI juggernaut OpenAI highlighted its notable progress as a competitor on the \"front line\" of China's race to lead in AI. The firm reportedly has offices  in the United Kingdom, Singapore, Malaysia, and across the Middle East. It also operates joint \"innovation centers\" projects across Southeast Asia, including in Indonesia and Vietnam.Zhipu's progress has come despite being placed on the US Commerce Department's Entity List in January last year, after U.S. officials said it was working with China's military. The firm's ability to train its AI models has also been constrained by U.S. restrictions on access to advanced semiconductor technology and expertise.According to Zhipu's prospectus, it plans to use 70% of the IPO proceeds toward research and development of its general-purpose large AI models. The firm reported revenue of 312.4 million yuan in 2024.Rival Chinese AI start-up MiniMax is expected to launch its own offering on Friday, following a confidential filing last year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The first of China’s 'AI tigers' goes public as Zhipu climbs in Hong Kong debut",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108164338-1750918943889-gettyimages-2206295278-TFSPI_24032025-5829.jpeg?v=1767842302&w=1920&h=1080"
      ],
      "datePublished": "2026-01-08T07:02:30.000Z",
      "dateModified": "2026-01-08T07:02:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ICE agents fatally shoot woman in Minneapolis, DHS says",
    "url": "https://www.cnbc.com/2026/01/07/ice-dhs-minneapolis-shooting.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108249447-17678046922026-01-07t162000z_931764646_rc2gwiaplo41_rtrmadp_0_usa-trump-minnesota.jpeg?v=1767826331&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-07T23:16:20.000Z",
    "description": "Members of U.S. Immigration and Customs Enforcement stand guard after a driver of a vehicle was shot in Minneapolis, Minnesota, Jan. 7, 2026.Tim Evans",
    "body": "Members of U.S. Immigration and Customs Enforcement stand guard after a driver of a vehicle was shot in Minneapolis, Minnesota, Jan. 7, 2026.Tim Evans | ReutersU.S. Immigration and Customs Enforcement agents fatally shot a woman in her car on Wednesday on a residential street in Minneapolis, authorities said.Videos of the incident that were posted on social media show the woman being shot within seconds by an ICE agent who was standing at the front of her SUV when she began driving off after being told to exit her vehicle. The shooting occurred in front of other people on Portland Avenue who were opposing ICE activities in Minneapolis.The Star-Tribune newspaper identified the dead woman as Renee Nicole Good, citing Good's mother as the source of that information.Department of Homeland Security Secretary Kristi Noem and another top DHS official both claimed that the dead woman, who police said had been shot in the head, was engaged in an \"act of domestic terrorism\" by intentionally trying to run down ICE agents.\"Today, ICE officers in Minneapolis were conducting targeted operations when rioters began blocking ICE officers and one of these violent rioters weaponized her vehicle, attempting to run over our law enforcement officers in an attempt to kill them — an act of domestic terrorism,\" said Department of Homeland Security Assistant Secretary Tricia McLaughlin in a post on X. Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey scoffed at that account, citing video footage they had seen.Frey called DHS' claims \"bulls---\" and \"a garbage narrative.\" He said the woman was 37 years old. MS NOW, citing people familiar with the matter, said the woman was a U.S. citizen.\"That's so stupid\" that she was killed, Good's mother, Donna Ganger, told a Star-Tribune reporter after being told some of the shooting's details. \"She was probably terrified.\"The shooting came during increased tension over a surge of more than 2,000 ICE, DHS and other federal agents to Minneapolis and St. Paul for immigration enforcement, criticism of the city's large Somali population by President Donald Trump and the Trump administration's focus on a series of frauds against social service programs administered by Minnesota that receive federal support.A Border Patrol Tactical Unit agent sprays pepper spray into the face of a protestor attempting to block an immigration officer vehicle from leaving the scene where a woman was shot and killed by a federal agent earlier, in Minneapolis, Minn. on Wednesday, Jan. 7, 2026. Alex Kormann | The Minnesota Star Tribune | Getty ImagesWalz blasted DHS for saying they knew the motives of the dead woman without doing an investigation. The governor said he had issued a so-called warning order to state officials to prepare to deploy Minnesota National Guard troops.\"We have someone dead, in their care, for no reason whatsoever,\" Walz said at a press conference.\"We've been warning for weeks that the Trump administration's dangerous, sensationalized operations are a threat to our public safety, that someone was going to get hurt. Just yesterday, I said exactly that,\" Walz said.\"What we're seeing is the consequences of governance designed to generate fear, headlines and conflict. It's governing by reality TV, and today that recklessness cost [someone] their life,\" he said.\"I have a simple message: We don't need any further help from the federal government,\" Walz said. \"To Donald Trump and Kristi Noem: You've done enough.\"Minneapolis Police Chief Brian O'Hara said his department secured the \"crime scene\" and that the incident is being investigated by the Federal Bureau of Investigation and the Minnesota Bureau of Criminal Apprehension. O'Hara said the state bureau will probe \"whether any state laws ... have been violated.\"An onlooker holds a sign that reads \"Shame\" as members of law enforcement work the scene following a suspected shooting by an ICE agent during federal law enforcement operations on Jan. 7, 2026 in Minneapolis, Minnesota.Stephen Maturen | Getty ImagesVideo from the scene posted on social media shows ICE officers pulling up to a group of cars parked on a residential street.\"Get the f--- out of our neighborhood,\" a woman is heard saying on the video, apparently from behind the camera.ICE agents then quickly exited their truck and walked up to a vehicle blocking the road, saying, \"Ma'am, get out of the car, out of the car, get out of the f---ing car,\" the video shows. One agent grabbed the handle of the driver's side door and tried to open it, and reached inside the vehicle, the video shows.The car then backs up slightly and begins pulling away, the video shows.Another agent, who had been standing up the road from the woman's vehicle, walks up to the front of the car and draws his pistol and quickly fires toward the car's windshield as the vehicle begins moving forward at him, according to videos. He appears to have fired at least three shots.One video aired by KSTP 5 in Minneapolis shows the agent who pulled his pistol appearing to lean on or toward the woman's SUV vehicle at the time it began moving forward, and then firing.Less than three seconds pass between the car reversing and moving forward, and the beginning of the gunfire.\"Oh f---ing, God!\" a woman screams on the video.Members of the community and media take cover as Border Patrol agents use chemical irritants to disperse a crowd trying to prevent them from leaving the scene where a driver was shot by a U.S. immigration agent, according to local and federal officials, in Minneapolis, Minnesota, U.S., Jan. 7, 2026. Tim Evans | ReutersThe vehicle that was shot at quickly crashes into the back of a car parked a short distance down the street.\"Dude, you did a murder, for what?\" a man yells on the video.A separate video, which begins after the shooting took place, shows a man attempting to approach the crashed car while identifying himself as a doctor.While the man is in the street, a black SUV approaches and multiple armed agents jump out and shout at him to back up, according to that video.Noem, the DHS secretary, during a speech said, \"Our ICE officers were out in an enforcement action.\"\"They got stuck in the snow because of the adverse weather that is in Minneapolis,\" Noem said. \"They were attempting to push out their vehicle and a woman attacked them, and those surrounding them, and attempted to run them over and ram them with her vehicle.\"Noem said, \"An officer of ours acted quickly and defensively shot to protect himself and the people around him and my understanding is that she was hit and is deceased.\"There is no footage on the video supporting Noem's claim that the officers were trying to push their vehicle out of any snow, or that the woman attacked them as they were doing so right before the shooting occurred.The truck carrying the agents was driving up the street when it stopped and the agents got out. The street was clear of any snow.Walz, in a tweet said, \"I've seen the video. Don't believe this propaganda machine.\"\"The state will ensure there is a full, fair, and expeditious investigation to ensure accountability and justice,\" Walz said.Read more CNBC politics coverage‘Greenland belongs to its people’: European leaders unite over Trump’s threats to annex territoryTrump wants to take over Greenland — but the island's economy faces 'major challenges'Hilton shares fall after DHS says MN hotel canceled reservation due to immigration enforcementRepublican Rep. Doug LaMalfa dies at 65, GOP saysClassified Venezuela briefing leaves lawmakers split along party lines after Maduro captureRubio explains how U.S. might 'run' Venezuela after Maduro's ousterMultiple elected officials from Minnesota demanded that ICE leave Minneapolis after the shooting.Mayor Frey, during a press conference, blasted ICE and called the allegation that the dead woman was trying to kill agents \"bulls---.\"\"I have a message for ICE, to ICE: Get the f--- out of Minneapolis,\" Frey said.\"What they are doing is causing chaos and distrust. They're ripping families apart,\" Frey said.\"They're sowing chaos on our streets, and in this case, quite literally killing people, so they are already trying to spin this as an action of self-defense,\" the mayor said. \"Having seen the video of myself, I want to tell everybody directly that is bulls---. This was an agent recklessly using power that resulted in somebody dying, getting killed,\" Frey said.Trump, in a social media post, said, \"I have just viewed the clip of the event which took place in Minneapolis, Minnesota. It is a horrible thing to watch.\"\"The woman screaming was, obviously, a professional agitator, and the woman driving the car was very disorderly, obstructing and resisting, who then violently, willfully, and viciously ran over the ICE Officer, who seems to have shot her in self defense,\" Trump said.\"Based on the attached clip, it is hard to believe he is alive, but is now recovering in the hospital. The situation is being studied, in its entirety, but the reason these incidents are happening is because the Radical Left is threatening, assaulting, and targeting our Law Enforcement Officers and ICE Agents on a daily basis,\" the president said. \"They are just trying to do the job of MAKING AMERICA SAFE. We need to stand by and protect our Law Enforcement Officers from this Radical Left Movement of Violence and Hate!\" Rep. Ilhan Omar, D-Minn., in a post on X, wrote, \"ICE must stop terrorizing our communities and leave our city.\"Omar's House district includes all of Minneapolis.In a later statement, Omar said, \"ICE's actions today were unconscionable and reprehensible. I am beyond outraged that their reckless, callous actions led to the killing of a legal observer in Minneapolis.\"My heart breaks for the victim's family, who will have to forever live with the pain caused by the Trump Administration's reckless and deadly actions,\" the congresswoman said. \"This administration has shown, yet again, that it does not care about the safety of Minnesotans. Instead of protecting our communities, they are unleashing violence — terrorizing neighborhoods and now killing a civilian.\"\"For weeks, ICE's so-called 'Operation Metro Surge' has spread fear, chaos, and violence across our state,\" Omar said, \"This is not law enforcement. It is state violence. It is simply indefensible, and ICE must be held accountable. That must include a full, comprehensive investigation and legal action against the agency.\"Walz called for any protests of the shooting incident to be peaceful.\"They want a show. We can't give it to them. We cannot,\" Walz said at the news conference.\"You protest and express your First Amendment rights, please do so  peacefully, as you always do,\" he said. \"We can't give them what they want.\"Correction: Minneapolis Mayor Jacob Frey called DHS' claims about the incident \"a garbage narrative.\" A previous version of this story misattributed the quote.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ICE agents fatally shoot woman in Minneapolis, DHS says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108249447-17678046922026-01-07t162000z_931764646_rc2gwiaplo41_rtrmadp_0_usa-trump-minnesota.jpeg?v=1767826331&w=1920&h=1080"
      ],
      "datePublished": "2026-01-07T23:16:20.000Z",
      "dateModified": "2026-01-07T23:16:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Exxon and Conoco claims against Venezuela are not an immediate priority, Energy Secretary says",
    "url": "https://www.cnbc.com/2026/01/07/exxon-conocos-venezuela-claims-not-immediate-priority-energy-secretary.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108249585-1767815884655-gettyimages-2244278144-whitehouse.jpeg?v=1767815950&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-07T22:46:07.000Z",
    "description": "watch nowThe debts that Venezuela owes ConocoPhillips and ExxonMobil are not an immediate priority for the Trump administration after the overthrow of",
    "body": "watch nowThe debts that Venezuela owes ConocoPhillips and ExxonMobil are not an immediate priority for the Trump administration after the overthrow of President Nicolás Maduro, Energy Secretary Chris Wright told CNBC on Wednesday. \"The huge debts that are owed Conoco and Exxon, those are very real and need to be recompensed in the future,\" Wright told CNBC's Brian Sullivan. \"But that's a longer-term issue. That's not a short-term issue.\"Conoco and Exxon filed arbitration cases against Venezuela after former President Hugo Chavez nationalized the oil industry in 2007. Venezuela owes Conoco about $10 billion and Exxon about $2 billion, according to a JPMorgan note published on Monday. The Trump administration's immediate priority is stabilizing Venezuela, Wright said. \"What we need to do with the revenue from those oil sales is stabilize the economy in Venezuela, stop the collapse of the bolivar, prevent Venezuela from becoming a failed state,\" the energy secretary said. Conoco and Exxon exited Venezuela after the Chavez nationalization. Chevron remained and is the only U.S. oil major operating in the country through a special license issued by the Trump administration.It will take time for U.S. oil majors to invest the billions of dollars needed to rebuild Venezuela's energy infrastructure, Wright said. \"If you're Exxon or Conoco and you've exited the country, you just need normal, commercial business conditions, rule of law and some security to go back in. That will take some time,\" he said. The Trump administration will work with Chevron on \"incremental tweaks or changes\" to enable their production to grow, he said. Venezuelan production could grow by several hundred thousand barrels per day in the short to medium term, Wright said earlier at Goldman Sachs' annual energy conference in Miami. The energy secretary said the U.S. will control Venezuela's oil sales indefinitely.\"We're going to market the crude coming out of Venezuela — first this backed up stored oil, and then indefinitely, going forward, we will sell the production that comes out of Venezuela into the marketplace,\" Wright said at the Goldman conference. \"We need to have that leverage and that control of those oil sales to drive the changes that simply must happen in Venezuela,\" the energy secretary said.Trump will meet with oil executives at the White House on Friday, sources told CNBC's Sullivan. The CEOs of ExxonMobil and ConocoPhillips as well as a representative from Chevron are expected to attend the meeting.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Exxon and Conoco claims against Venezuela are not an immediate priority, Energy Secretary says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108249585-1767815884655-gettyimages-2244278144-whitehouse.jpeg?v=1767815950&w=1920&h=1080"
      ],
      "datePublished": "2026-01-07T22:46:07.000Z",
      "dateModified": "2026-01-07T22:46:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Asia-Pacific markets mostly fall as Trump rattles defense firms and oil prices slide",
    "url": "https://www.cnbc.com/2026/01/08/asia-pacific-markets-today-nikkei-225-hang-seng-index-kospi-wall-street-trump-oil.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107327502-1698905438445-gettyimages-1574181684-dsc00155_w7qyj6oz.jpeg?v=1758060712&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-08T06:58:31.000Z",
    "description": "SHENZHEN, CHINA - AUGUST 26: An aerial view of the Shenzhen skyline on August 26, 2020 in Shenzhen, Guangdong Province of China. (Photo by He Shaoping",
    "body": "SHENZHEN, CHINA - AUGUST 26: An aerial view of the Shenzhen skyline on August 26, 2020 in Shenzhen, Guangdong Province of China. (Photo by He Shaoping/VCG via Getty Images)Vcg | Visual China Group | Getty ImagesAsia-Pacific markets mostly fell Thursday after Wall Street closed lower amid rising geopolitical tensions and comments from U.S. President Donald Trump.U.S. defense stocks fell after Trump said he \"will not permit\" defense companies to issue dividends or stock buybacks until they address his complaints about the industry, including executive pay packages and production issues.Oil prices also dropped overnight after Trump said that Venezuela's interim authorities would turn over as much as 50 million barrels of crude to the U.S., raising concerns about an increase in global supply. Brent crude futures fell 0.51% to $60.39 a barrel, while the U.S. West Texas Intermediate crude added 0.61% to $56.33 per barrel, as of 7.30 a.m. Singapore time (Wednesday 6.30 p.m. EST).Japan's benchmark Nikkei 225 index fell 1.63%, weighed down by basic materials and technology stocks. Among the biggest decliners were SoftBank, which plunged 7.59%, and Tokyo Electron, which provides essential chipmaking equipment to foundries that manufacture Nvidia's chips, was 4.01% lower. The broader Topix index retreated 0.77%.South Korea's Kospi settled slightly above the flatline at 4,552.37, while the small-cap Kosdaq retreated 0.35%.Australia's S&P/ASX 200 closed 0.29% higher at 8,720.8. Shares of BlueScope Steel fell 1.57% after the company rejected a $9 billion takeover bid from U.S.-based Steel Dynamics and Australian conglomerate SGH, which also saw its stock drop 1.92%.On Thursday afternoon, BlueScope's biggest investor, AustralianSuper, increased its voting power in the steel company to 13.52%, from 12.5%, according to a filing after the bell. Hong Kong's Hang Seng Index declined 1.59%, led lower by losses in basic materials and technology stocks. Lenovo Group fell 3.44%, Kuaishou Technology lost 2.85%, and Baidu traded 2.76% lower. The mainland's CSI 300 fell 1.04%. Shares of Knowledge Atlas Technology JSC, better known as Zhipu, rose as much as 15% on their Hong Kong debut, following a $558 million initial public offering that made it the first of China's \"AI tigers\" to go public.India's Nifty 50 fell 0.83%, while the BSE Sensex index was 0.63% lower.U.S. equity futures were little changed in early Asian hours, after the S&P 500 and the Dow Jones Industrial Average snapped a three-day winning streak.Overnight, the broad market index shed about 0.3% while the Dow fell 466 points, or roughly 0.9%. The tech-heavy Nasdaq Composite gained nearly 0.2%, aided by a 2.4% jump in Google parent Alphabet that led the company's market cap to surpass Apple's for the first time since 2019.— CNBC's Pia Singh and Sean Conlon contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Asia-Pacific markets mostly fall as Trump rattles defense firms and oil prices slide",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107327502-1698905438445-gettyimages-1574181684-dsc00155_w7qyj6oz.jpeg?v=1758060712&w=1920&h=1080"
      ],
      "datePublished": "2026-01-08T06:58:31.000Z",
      "dateModified": "2026-01-08T06:58:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Trump wants Greenland — and what makes it so important for national security",
    "url": "https://www.cnbc.com/2026/01/07/why-trump-wants-greenland-and-what-makes-it-so-important-for-security.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108249172-1767767047765-gettyimages-2202756795-AFP_36ZA8BT.jpeg?v=1767834988&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-07T15:02:44.000Z",
    "description": "watch nowU.S. President Donald Trump is fixated on taking control of Greenland, a vast, sparsely populated and mineral-rich island situated between th",
    "body": "watch nowU.S. President Donald Trump is fixated on taking control of Greenland, a vast, sparsely populated and mineral-rich island situated between the Arctic Ocean and the North Atlantic Ocean. \"It's so strategic,\" Trump told reporters onboard Air Force One on Sunday. \"Right now, Greenland is covered with Russian and Chinese ships all over the place. We need Greenland from the standpoint of national security.\" His comments, which came hot on the heels of an audacious military operation in Venezuela, sounded the alarm across Europe, with Denmark warning that an American takeover of Greenland would mark the end of the NATO military alliance.The U.S. president, however, is yet to waver. Indeed, the White House ramped up trans-Atlantic tensions even further on Tuesday, saying that Trump and his team are considering \"a range of options\" to make the self-governing Danish territory a part of the United States — including \"utilizing the U.S. Military.\" Positioned between the U.S. and Russia, Greenland has long been viewed as an area of high strategic importance, particularly when it comes to Arctic security.  The territory of nearly 57,000 people is in close proximity to emerging Arctic shipping routes, with the rapid melting of ice creating opportunities to substantially reduce Asia-Europe travel time when compared with the Suez Canal.Greenland also sits astride the so-called GIUK Gap, a naval choke point between Greenland, Iceland and the U.K. that links the Arctic to the Atlantic Ocean. Alongside its strategic geopolitical position, Greenland is known for an abundance of untapped raw materials, from oil and gas reserves to critical mineral deposits and a treasure trove of rare earth elements. AFP | Getty ImagesThese critical minerals and rare earth elements are vital components in emerging technologies, such as wind turbines, electric vehicles, energy storage technologies and national security applications. China repeatedly sought to leverage its near monopoly of rare earths to exert pressure on the U.S. last year.\"Trump is a real estate guy,\" Clayton Allen, head of practice at Eurasia Group, a political risk consultancy, told CNBC by video call.\"Greenland is sitting on some of the most valuable real estate in terms of economic advantage and strategic defense for the next three to five decades.\" Shipping routes To be sure, the U.S. already has a presence in Greenland. The Pituffik Space Base, formerly Thule Air Base, is located in the northwest of Greenland, just across the Baffin Bay from Nunavut, Canada.It is estimated that around 150 U.S. service members are permanently stationed there, down from around 6,000 during the Cold War era.watch now\"For good reasons, the U.S. has an early warning air base in northwestern Greenland because the shortest route for a Russian ballistic missile to reach the continental United States is via Greenland and the North Pole,\" said Otto Svendsen, associate fellow with the Europe, Russia and Eurasia Program at the Center for Strategic and International Studies, or CSIS, a Washington-based think tank. The base, which also has an active airfield and is home to the world's northernmost deep-water port, has traditionally been pivotal to the monitoring of Russian submarines traversing the GIUK Gap, Svendsen said. \"A more recent and emerging threat or factor is the fact that Greenland straddles two potential shipping routes through the Arctic, the Northwest Passage and the Transpolar Sea Route,\" Svendsen told CNBC by telephone. \"And as climate change continues to render those routes more viable, there are commercial interests there as well that add to the national security value of the island,\" he added.A fishing boat navigates around icebergs that broke off from the Jakobshavn Glacier and are floating in Disko Bay on March 10, 2025, in Ilulissat, Greenland.Joe Raedle | Getty Images News | Getty ImagesOpinion polls have previously shown that Greenlanders overwhelmingly oppose U.S. control, while a strong majority support independence from Denmark. 'Golden Dome' Analysts say Greenland could prove useful to the U.S. as a staging ground for a greater defensive presence and as a location for U.S. missile interceptors — particularly in the context of one of the Trump administration's key policies: a \"Golden Dome\" missile defense system.The multibillion-dollar initiative, rolled out in May last year and often compared to Israel's \"Iron Dome\" system, is a visionary plan designed to shield the U.S. from all missile attacks. Read more\"The U.S. needs access to the Arctic and it doesn't really have that much direct access today. Greenland has a tremendous amount. The U.S. needs air defenses deployed closer and closer to Russia to combat next-generation weapons that are not currently defensible with what we have available. Greenland provides that,\" Eurasia Group's Allen said. \"Trump wants to build a Golden Dome over the U.S.,\" he continued. \"Part of that is going to have to depend on Greenland.\" National or economic security? For some, Trump's assertion that annexing Greenland is a core part of U.S. national security has raised eyebrows. The declaration marks a notable shift in tone from almost a year ago, when the then president-elect cited \"economic security\" as a primary factor for annexing the island. Marion Messmer, director of the International Security Programme at London's Chatham House think tank, acknowledged that it is true to say that both Russia and China have increased their military activities in the Arctic in recent years — and, if Moscow launched missiles at the U.S., they would likely fly over Greenland.  \"However, what is not clear is why Washington needs full control over Greenland to defend itself,\" Messmer said in a written analysis published Tuesday. watch nowShe cited the fact that the U.S. already has a presence at Pituffik Space Base, as well as a decades-old defense agreement with Denmark that allows Washington to continue to use it. \"During the Cold War, the US stationed up to 6,000 troops across a range of camps across the island,\" Messmer said. \"It could presumably surge troop presence again if it felt it needed a greater presence in the region – without disputing Danish sovereignty.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Trump wants Greenland — and what makes it so important for national security",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108249172-1767767047765-gettyimages-2202756795-AFP_36ZA8BT.jpeg?v=1767834988&w=1920&h=1080"
      ],
      "datePublished": "2026-01-07T15:02:44.000Z",
      "dateModified": "2026-01-07T15:02:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samsung Electronics estimates nearly three-fold profit surge as memory prices skyrocket ",
    "url": "https://www.cnbc.com/2026/01/08/samsung-electronics-estimates-surge-skyrocket-profit-ai-memory-prices-q4.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108179470-1753922208638-gettyimages-1065011358-191112final.jpeg?v=1767834358&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-08T02:32:29.000Z",
    "description": "Headquarters of Samsung in Mountain View, California, on October 28, 2018. Smith Collection/gado | Archive Photos | Getty ImagesSouth Korea's Samsung ",
    "body": "Headquarters of Samsung in Mountain View, California, on October 28, 2018. Smith Collection/gado | Archive Photos | Getty ImagesSouth Korea's Samsung Electronics expects its profits to triple in the final three months of last year, reaching a record high, as memory prices surge amid booming demand tied to artificial intelligence. The world's largest memory chipmaker estimated that operating profit reached 20 trillion won and consolidated sales of about 93 trillion won in the fourth quarter, according to an earnings guidance released Thursday. The profit projections mark a significant improvement from a year earlier and would surpass Samsung's long-standing record of 17.6 trillion won set in the third quarter of 2018. The surge comes as chipmakers like Nvidia clamor for limited supplies of memory chips used for AI applications. As memory companies prioritize capacity to meet that lucrative demand, it has contributed to a shortage across the broader market, affecting chips used in personal computers and mobile devices.\"The memory market has entered a 'Hyper-Bull' phase, with current conditions eclipsing the historic 2018 peak. Supplier leverage is at an all-time high, driven by an insatiable demand for AI and server capacity,\" Counterpoint Research said in a report Wednesday. The market watcher estimates memory prices surged 40%-50% in the final quarter of 2025, and expects similar gains in the first quarter of 2026, followed by a roughly 20% rise in the second quarter.While these market dynamics have pushed manufacturing costs for most consumer electronics makers, they have been a boon for memory giants like Samsung and its main competitors in the space, SK Hynix and Micron. Samsung shares have gained over 145% over the past 12 months and were up 0.5% on Thursday in choppy trading. The consumer tech giant continues to trail  SK Hynix in high-bandwidth memory (HBM) chips used in AI processors like those from Nvidia. Expanding its HBM production capacity is expected to be a major focus for the company in the new year. Samsung is set to release its audited earnings and hold its quarterly earnings call later this month.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung Electronics estimates nearly three-fold profit surge as memory prices skyrocket ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108179470-1753922208638-gettyimages-1065011358-191112final.jpeg?v=1767834358&w=1920&h=1080"
      ],
      "datePublished": "2026-01-08T02:32:29.000Z",
      "dateModified": "2026-01-08T02:32:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthropic signs term sheet for $10 billion funding round at $350 billion valuation",
    "url": "https://www.cnbc.com/2026/01/07/anthropic-funding-term-sheet-valuation.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236169-1764790512879-gettyimages-2249797202-mms21019_z1bkpxzj.jpeg?v=1764790539&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-07T19:55:04.000Z",
    "description": "watch nowAnthropic has signed a term sheet for a $10 billion funding round at a $350 billion valuation, CNBC confirmed on Wednesday.Coatue and Singapo",
    "body": "watch nowAnthropic has signed a term sheet for a $10 billion funding round at a $350 billion valuation, CNBC confirmed on Wednesday.Coatue and Singapore sovereign wealth fund GIC are leading the financing, according to a source familiar who asked not to be named because the discussions are confidential. A representative for Anthropic declined to comment. The Wall Street Journal was first to report the funding round. Anthropic was founded in 2021 by former OpenAI research executives, including its CEO, Dario Amodei. The company is best known for developing a family of large language models called Claude.Amazon has invested billions of dollars in Anthropic, and in November, Microsoft and Nvidia announced plans to invest up to $5 billion and up to $10 billion, respectively. Anthropic is racing to stay ahead of competitors like Google and OpenAI, which has seen its valuation swell to $500 billion. Anthropic released three new models — Claude Sonnet 4.5, Claude Haiku 4.5 and Claude Opus 4.5 — late last year.Read more CNBC tech newsThis climate startup is taking recycling to the next level, with shower water beerElon Musk's xAI raises $20 billion from investors including Nvidia, Cisco, FidelityMeta hires Microsoft exec, former Trump deputy as chief legal officerHuang says Nvidia seeing 'very high' Chinese customer demand for H200 AI chipswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthropic signs term sheet for $10 billion funding round at $350 billion valuation",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236169-1764790512879-gettyimages-2249797202-mms21019_z1bkpxzj.jpeg?v=1764790539&w=1920&h=1080"
      ],
      "datePublished": "2026-01-07T19:55:04.000Z",
      "dateModified": "2026-01-07T19:55:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oil ship seized by the U.S. over Venezuela sanctions was newly registered under Russian flag",
    "url": "https://www.cnbc.com/2026/01/07/oil-ship-seized-by-us-over-venezuela-ban-newly-listed-under-russian-flag.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108249323-1767794989092-G-EH9LGXUAA3k85.jpg?v=1767807459&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-07T18:05:01.000Z",
    "description": "The U.S. has announced the seizure of the Bella-1 for violations of U.S. sanctions. The vessel, known as the Marinera after recently reflagging to Rus",
    "body": "The U.S. has announced the seizure of the Bella-1 for violations of U.S. sanctions. The vessel, known as the Marinera after recently reflagging to Russia, was seized in the North Atlantic pursuant to a warrant issued by a U.S. federal court after being tracked by USCGC Munro.Source: @US_EUCOM | U.S. Coast Guard | Via XThe U.S. said Wednesday that in its attempt to blockade sanctioned oil exports from Venezuela, it seized two tanker ships, one of which was newly registered under the Russian flag.In a post on X, the U.S. European Command said the tanker — which it called Bella 1, the ship's former name — had been seized in the North Atlantic for violations of U.S. sanctions on Venezuelan oil. The ship, now named Marinera, is just one that Russia has reflagged to join its \"dark\" fleet.\"This has moved beyond a sanctions case into a real-time jurisdictional challenge, where the key question is what legal basis exists for enforcement on the high seas,\" Dimitris Ampatzidis, senior risk and compliance analyst at energy consulting firm Kpler, told CNBC. \"The vessel's identity and history remain constant, but its flag status can significantly raise the diplomatic stakes.\"According to maritime lawyers who spoke with CNBC, a vessel is essentially considered a floating island of the country whose flag it bears.Automatic Identification System tracking data by Kpler shows the path of the vessel and the diversion the vessel made.Path of Marinera, aka Bella 1MarineTrafficKpler's AIS data — real-time location information transmitted by ships — shows that the tanker recently made a sharp turn in the Atlantic Ocean near Scotland. More than two weeks before the ship was seized, the U.S. stopped and attempted to board the tanker, which was registered as the Bella 1 under a fraudulent Guyana flag, during the ship's transit to Venezuela to be filled with the sanctioned crude.On Dec. 31, Russia notified the U.S. that the ship had changed its name to Marinera and switched its registration to Russia, according to Lloyd's List. The vessel left the Caribbean.Another newly Russian-flagged tanker linked to moving Venezuelan oil, the Premier, which was reflagged from Gambia to Russia on Dec. 22, remains empty outside the Jose terminal in Venezuela, according to Lloyd's List vessel tracking.Photo of the Russian-flagged Marinera, former sanctioned vessel Bella 1MarineTrafficIn a separate X post Wednesday, U.S. Southcom announced that the Panama-flagged tanker Sophia had been seized and was being escorted to the U.S. by the U.S. Coast Guard. The Sophia is laden with around 2 million barrels of crude oil that was loaded at Jose Oil Terminal in Venezuela around Dec. 26-29, as confirmed by satellite imagery and port reports seen by Kpler, Emmanuel Belostrino, senior manager of crude oil market data at Kpler, told CNBC.The tanker's previous voyage was also from Venezuela, when it similarly loaded around 2 million barrels of crude in early August 2025 before heading to offshore Malaysia, Belostrino said. \"The sanctioned cargo was likely transferred to another vessel via dark ship-to-ship transfer, but Kpler has not determined the partner vessel,\" he said.Kpler analysis shows Sophia's involvement in sanctioned trade may extend back to November 2021. In addition to transporting sanctioned Venezuelan crude, the vessel has been linked to transporting sanctioned Iranian and Russian oil to China, according to Kpler.The seizure of the Sophia comes after the Dec. 27 seizure of the Panama-flagged ship Centuries. Maritime experts have told CNBC these seizures may have been conducted under the 2002 Salas-Becker agreement, which allows U.S. authorities to board Panamanian-flagged vessels with just two hours' notice.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oil ship seized by the U.S. over Venezuela sanctions was newly registered under Russian flag",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108249323-1767794989092-G-EH9LGXUAA3k85.jpg?v=1767807459&w=1920&h=1080"
      ],
      "datePublished": "2026-01-07T18:05:01.000Z",
      "dateModified": "2026-01-07T18:05:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]