[
  {
    "title": "Jamie Dimon shares why he never reads text messages at work: 'I don't have notifications'",
    "url": "https://www.cnbc.com/2025/11/09/jamie-dimon-shares-why-he-never-reads-text-messages-at-work.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108114999-1741804180208-gettyimages-2204125628-BLACKROCK_RETIREMENT.jpeg?v=1762449895&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-09T03:08:32.000Z",
    "description": "Jamie Dimon, chief executive officer of JPMorgan Chase & Co., speaks during the 2025 National Retirement Summit in Washington, DC, US, on Wednesday, M",
    "body": "Jamie Dimon, chief executive officer of JPMorgan Chase & Co., speaks during the 2025 National Retirement Summit in Washington, DC, US, on Wednesday, March 12, 2025.Al Drago | Bloomberg | Getty ImagesJPMorgan Chase CEO Jamie Dimon recently opened up about his phone habits at work, including never reading text messages and having his phone notifications turned off.\"I don't have notifications,\" the finance boss told CNN's Erin Burnett in an interview. \"If you sent me a text during the day, I probably do not read it.\"He added: \"The only notifications I get is from my kids. That's it. When they text me, I get that.\"The 69-year-old revealed that he doesn't carry his phone around with him all the time and prioritizes deep focus at work.\"When I'm walking around the building and going to meetings, I don't have it on me. It's in my office,\" he said. \"When I go to my meetings, I did the pre-reads and I'm 100% focused on us, what you're talking about, why you're talking about it, as opposed to I'm distracted and I'm thinking about other things.\"Dimon has previously aired his gripes about poor meeting etiquette and said at Fortune's Most Powerful Women Summit in October that using phones in meetings is \"disrespectful\" and \"wastes time.\"\"If you have an iPad in front of me and it looks like you're reading your email or getting notifications, I'll tell you to close the damn thing,\" he said at the time.He explained that meetings should have a purpose and that checking emails and getting distracted are red flags.Working from homeDimon has remained critical of some of the newest shifts in the workplake brought about by the youngest generation at work: Gen Z. Dimon has adhered to more traditional ways of working, often expecting his employees to do the same.Earlier this year, JPMorgan Chase's CEO went on a rant in a leaked audio recording, to JPMorgan employees about working from home and phone usage in meetings after workers complained about having to return to the office five days a week.Dimon told them to quit saying he was concerned about the \"damage\" that work from home was doing to younger recruits.\"Don't give me this s--- that work-from-home Friday works ... I call a lot of people on Fridays, and there's not a goddamn person you can get a hold of ... I've had it with this kind of stuff,\" he said in the recording.\"They're here, they're there, the Zooms [Gen Z], and the zoomers don't show up ... That's not how you run a great company.\"He even took a shot at managers in the call saying they were abusing the privilege of working from home to slack off. When on Zoom, managers were looking at their mail, sending texts and not paying attention, Dimon said. \"And if you don't think that slows down efficiency, creativity, creates rudeness – it does,\" he added.Work etiquetteAnastasia Dedyukhina, a digital wellbeing expert, previously told CNBC Make It that frequently checking your smartphone reduces the quality of your conversations with friends and colleagues. A 2023 survey by Reviews.org found that Americans check their phones an average of 144 times a day.She explained that even just a having a phone near you can be extremely distracting. Using a phone could also leave a bad impression on managers and colleagues and is bad working etiquette.\"I would also keep thinking about it because for our minds, a smartphone and the sound of a smartphone is a highly attractive stimuli. So when I hear my phone ringing and make a notification, for my mind, it's the same as if you were calling me by my name,\" Dedyukhina said.That's why Harvard University associate professor Alison Wood Brooks formerly shared with CNBC Make It that it's important to focus in meetings as it makes you appear smarter and more likable. This includes asking follow up questions and paraphrasing and repeating what the other person said back to them.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jamie Dimon shares why he never reads text messages at work: 'I don't have notifications'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108114999-1741804180208-gettyimages-2204125628-BLACKROCK_RETIREMENT.jpeg?v=1762449895&w=1920&h=1080"
      ],
      "datePublished": "2025-11-09T03:08:32.000Z",
      "dateModified": "2025-11-09T03:08:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I finally have enough cash to pay off my student loan in full—here's why I'm not doing it",
    "url": "https://www.cnbc.com/2025/11/08/i-have-enough-cash-to-pay-off-my-student-loan-why-im-not.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222713-1762464737221-gettyimages-1419594993-cr_vfkdpr220613a5-996430-01.jpeg?v=1762464767&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T14:00:01.000Z",
    "description": "Everyone who knows me knows that I can't stand owing money. I pay down my credit cards every month, and I complete Venmo requests the second I get the",
    "body": "Everyone who knows me knows that I can't stand owing money. I pay down my credit cards every month, and I complete Venmo requests the second I get them.The only debt I have left is my student loan, which has been on minimum payment autopilot since I graduated from college in 2013. For many years, I left those payments on the back burner, funneling any extra savings I had toward my investments.Recently, though, my financial strategy changed after my fiancé and I began planning for a wedding in summer 2027. I sold a fair amount of stock and dialed back my retirement contributions in order to build our wedding fund.For the first time in my life, I'm sitting on a pile of cash. And I have to say, I'm very tempted to use a chunk of it to wipe out my loan.Hear me out. My student debt carries an interest rate of 6.55% and is scheduled to be paid off in late 2027. If I paid my loan off now, I could take my monthly loan payment, plus a few extra dollars, tack it on to my regular contributions to the wedding fund, and still hit our funding goal on time. Plus, I'd be debt-free.I chatted with a few certified financial planners, and pretty much everyone agreed that the math works in my favor.\"If you have the funds available, paying off the loans first is a smart move,\" says MaryAnne Gucciardi, a CFP with Wealthmind Financial Planning. \"That's a guaranteed 6.55% 'return,' which is higher than what you're likely earning in even the best high-yield savings account.\"So as you're reading this, I've already paid the loan off, right? Well, no. I actually decided against it. Here's why.My decision to hold off on repaying my loan, for nowThe mathematical principle Gucciardi points out is an important one that applies to a broad array of situations in personal finance. Paying down a loan with a particular interest rate is equivalent to earning an annualized return on an investment.It's a quick and dirty way to decide how to prioritize your financial goals. If you have credit card debt at 20% — currently right around the average, according to Bankrate — paying it down is like earning 20% a year in the stock market. Because that's a figure your portfolio is unlikely to earn on a long-term basis, the thinking goes, you're better off prioritizing the debt.The same logic applies to my loan. The 3.4% annual percentage yield we're earning in our savings account falls short of the 6.55% I owe on my loans.The cost of making such a move, Gucciardi and others pointed out to me, is liquidity. Once I make the lump sum payment, I won't be able to go to my student loan servicer and ask for my money back. Catching up by the time of our wedding date is as easy as redirecting the freed-up cash from my student loan payment to put toward the wedding fund. But a lot could go wrong between now and then.What if I lose my job? Or one of us needs expensive medical treatment? Or elements of our wedding end up costing much more than we budgeted for? I have emergency savings, but a few things going wrong could make what looked really easy on paper into something really hard in real life.So I did some more math. I've paid off 81% of my student debt, meaning that the vast majority of my payment these days goes toward paying down the principal rather than the interest. By my calculations, paying the loan now, instead of continuing with minimum payments, would save me somewhere between $400 and $500 in interest.\"That net difference is the price of financial flexibility,\" says Sean Pearson, a CFP with Ameriprise Financial Services. \"It's the price of doing the things that you want to do that are the most important to you when you need to get them done.\"To be clear, my financial priorities might not be the same as yours, and it's worth discussing your own goals with a financial advisor. Right now, the wedding is the most important thing I'm saving money for. I want it be everything my fiancé and I envision, and I want our (frankly, too many) guests to have an amazing time. Having the extra cash on hand in case anything comes up is worth paying my student loan servicer an extra $400.It's a lesson I'm applying to my broader financial life too. While certain financial strategies are mathematically optimal, they may not fit within my particular set of goals.\"While imperfect, the best solution is often to make a budget that allows you to reach your priorities when they exist on your timeline and remember that the calendar is as important to your financial plan as your calculator,\" Pearson says.Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I finally have enough cash to pay off my student loan in full—here's why I'm not doing it",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222713-1762464737221-gettyimages-1419594993-cr_vfkdpr220613a5-996430-01.jpeg?v=1762464767&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T14:00:01.000Z",
      "dateModified": "2025-11-08T14:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "34-year-old was saving to buy a house, then decided to focus on early retirement instead: 'I value my time more than home ownership'",
    "url": "https://www.cnbc.com/2025/11/08/millennial-saving-buy-a-house-decide-start-saving-early-retirement.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222596-1762456794823-IMG_8209.jpeg?v=1762457946&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T15:00:01.000Z",
    "description": "In 2020, Anita Kinoshita, 28 years old at the time, started looking into buying a house.Kinoshita was living in California and making around $70,000 a",
    "body": "In 2020, Anita Kinoshita, 28 years old at the time, started looking into buying a house.Kinoshita was living in California and making around $70,000 a year as a software engineer for the Department of Defense.As a first-generation American from a farming family in Mexico, Kinoshita believed the best way to finally achieve the American dream her family had for her was to own property.\"I had my first big girl job and thought the next responsible thing to do would be to buy a house,\" Kinoshita tells CNBC Make It. \"I didn't necessarily want to buy a house. In fact, I was trying to figure out how to finesse the purchase.\"Initially, Kinoshita was seeking a property with the intent to sublet some of the bedrooms and lower her share of the expenses. She had about $20,000 saved for a down payment.\"My vision for the future was to be able to have a family and spend as much time with them and not necessarily have an office job. [But] I still went forward with what made sense for this American Dream path,\" she says.\"I was 28 at the time, so I still kind of cared what my community defined as successful, and homeownership was part of that. At the time, I thought it was the responsible thing to do.\"Kinoshita always believed achieving the American Dream meant owning property.Anita KinoshitaKinoshita wanted to learn as much as she could about the home-buying journey she was embarking on. She enrolled in a nine-week course that teaches people how to manage their money, offered by Financial Peace University.During the retirement module of the online class, Kinoshita used a retirement calculator that helped her realize that if she started contributing a bit more to her 401(k), she could retire around age 55 and buy a house at the same time.\"All of a sudden, the vision I had for the future and the freedom and lifestyle I wanted became possible in my mind for the first time,\" she says.For two years, Kinoshita looked at least a dozen places and put in a total of four offers. She got accepted for one, but then the sellers backed out. She was also approved for a single-family home, but there was a mismatch in the appraisal, so she walked away from the deal.\"I ended up backing out because the only way to be competitive during that time was to invest less and save more for the down payment, and I wasn't willing to do that,\" she says.\"Ultimately, I felt like it wasn't the time for me at the moment, and I was not willing to invest less either. I wasn't satisfied with my career and felt like I was living my dad's dream and not really mine.\"Kinoshita viewed a dozen properties and put in a total of four offers.Anita KinoshitaRedefining successKinoshita switched her focus. Instead of saving for a down payment, she set a goal of having $500,000 invested in her retirement accounts. By April 2022, she had invested $200,000 and reached COAST FIRE — a strategy where you save and invest enough to eventually stop contributing to your retirement accounts and let the compound growth continue rising so you're on track to have a traditional retirement. She decided to quit her job.Kinoshita isn't alone in choosing to wait to buy a house. The median age of a first-time home buyer has gone up in recent years, from 35 in 2023 to 38 in 2024 alone, according to a report from the National Association of Realtors.After quitting her full-time job, Kinoshita started working part-time, creating curriculum for California State University, Monterey Bay and making financial literacy content online. Both of these positions made her more money than when she was working as a software engineer.Kinoshita, now 34, is going to wait until she reaches early COAST FIRE, which, when you have enough invested, lets you stop contributing by the age you decide, versus the traditional retirement age of 67. Kinoshita quit her job and is now making financial literacy content online.Anita KinoshitaHer projected retirement age is now 45, and she expects to have $1.5 million invested by then.\"I value my time and freedom a little bit more than I value home ownership. In retrospect, I think if I had bought the house, I would have felt trapped in my career,\" she says.Kinoshita and her husband recently moved to the California neighborhood where they would one day like to own a home. They pay $4,000 a month in rent and live in a single-family home in a gated community, according to documents reviewed by CNBC Make It.When the couple is ready to buy, she estimates they will have about $300,000 saved to put toward the home. But they still don't know when they will start getting serious about buying.\"I'm not in a rush. I don't want to use it as a financial tool in any way. I'm looking at it more as a luxury and less as an asset these days,\" she says. \"I would rather have my money working for me in the stock market than in real estate.\"Kinoshita and her husband are now renting in the neighborhood they hope to buy one day.Anita KinoshitaKinoshita says her definition of a dream home has also changed.\"I don't want too many bedrooms. I think what I care more about these days is the charming architecture. I don't want it to be overwhelming in terms of square footage. I want it to be in a really beautiful neighborhood where I feel safe. I want to look outside and see nature,\" she says.\"I don't see a reason to settle for something else, so for us it's a as long as it takes kind of thing.\"Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "34-year-old was saving to buy a house, then decided to focus on early retirement instead: 'I value my time more than home ownership'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222596-1762456794823-IMG_8209.jpeg?v=1762457946&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T15:00:01.000Z",
      "dateModified": "2025-11-08T15:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "They met on Tinder when they were 19. Now, they're married and run a cake business that brings in over $650,000 a year",
    "url": "https://www.cnbc.com/2025/11/09/this-gen-z-couple-runs-a-650000-a-year-celebrity-cake-business.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222167-1762406078548-Cake_Inspiration.jpg?v=1762406228&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-09T04:03:58.000Z",
    "description": "Kai Yang Chan (left) and JiaYi Zhou (right) run Singapore-based bakery Cake Inspiration.Courtesy of Cake InspirationWhen Kai Yang Chan and Jiayi Zhuo ",
    "body": "Kai Yang Chan (left) and JiaYi Zhou (right) run Singapore-based bakery Cake Inspiration.Courtesy of Cake InspirationWhen Kai Yang Chan and Jiayi Zhuo matched on Tinder at age 19, neither of them expected that it would lead to marriage. Six years later, not only have they tied the knot — they're also business partners.\"I downloaded Tinder because I was very bored in school, so I was just [swiping] through during class,\" said Zhuo. \"Both of us — we didn't expect that we'd get together,\" she said.\"Personality wise, we are quite different,\" she said, adding that while she is more introverted, her husband is the life of the party.Today, Chan and Zhuo run Singapore-based bakery CakeInspiration. Their business brought in over 850,000 Singapore dollars (about $650,000) in 2024, and is on track to surpass $775,000 in revenue this year, according to documentation reviewed by CNBC Make It.The company is known for its custom cake designs, and its clientele includes family offices, hospitals and even global celebrities.A family affairCakeInspiration originally began as a home-based bakery in 2010, run by Zhuo's parents.\"My parents actually started [the business] when I was nine,\" said Zhuo. \"I was never very studious, but I really like being hands on. So I like to bake, I like to dance. I like to create all these little pretty things,\" she said. From the early days of the business, she often helped with designing cakes.Then, when the pandemic hit, sales stalled and the business began to burn through cash to stay afloat. With her parents contemplating retirement, Zhuo knew it was time for her to step in.Courtesy of CakeInspiration\"I [felt] that it's a waste to just let it go. I [saw] my parents work like 16 hours a day growing up, so ... I [didn't] want the business to get shut down,\" she said.In 2020, Zhuo officially joined her parent's business and expanded the company's product range. She eventually introduced two new brands — Eggyi.Co, which sells bento cakes, or mini, single-serving sized cakes targeted at Gen-Z, and Petissier which sells customised cakes for pets.The introduction of these two brands ultimately helped to save the family's business through Covid, said Zhuo. Today, their prices range from about $100 to $10,000 per order, and they have a staff of about 14 people across two kitchens — one for human cakes, and one for pet cakes.Shooting for the starsSimilar to Zhuo, Chan's passions lied outside of academics growing up.\"I wasn't really the most studious person, [but] I always loved the idea of entrepreneurship and doing our own thing,\" said Chan. \"Since I was 16, I did my own little startups, selling whatever. [I sold] sneakers, I'd buy them, clean them up and sell them. You know, whatever that can make money, I'll do it,\" he said.In 2022, he decided to join his wife in the family business full-time. He introduced a new strategy: rather than only selling directly to individual consumers (B2C), he suggested trying to sell to other businesses (B2B) to create a more consistent source of revenue.In addition, he was focused on building the company's brands online. Along with working to build a presence across social media platforms, Chan started targeting celebrities and influencers who came into town.A custom made cake for social media influencers, the Ha Sisters, by CakeInspiration.Courtesy of CakeInspirationIn June, three Korean-American content creators — sisters Evelyn, Erica and Emily Ha — were in Singapore for a beauty store pop-up event. When Chan discovered they were in town, he saw an opportunity to surprise them with a cake.\"It's actually quite crazy, because they were in Singapore for this beauty store pop-up... They posted a story of them in a hotel, and I thought: 'Hey, this looks really familiar. I know [which] hotel this is,'\" he said. \"So I just prepared a cake and then we just zoomed down to the hotel.\"Chan and his team quickly made a custom cake for the sisters and timed the delivery to coincide with the end of the Ha sisters' event. \"Of course, after the pop-up, you have to go back to [the hotel to] change, right? Yeah. So [that's when I] went there,\" he said.By chance, his timing was perfect. Just as he arrived at the hotel entrance with the cake in hand, he ran into the sisters — and managed to hand-deliver the surprise. One of the Ha sisters later shared a video of the cake to social media, which ultimately reached over 500,000 views.This interaction kicked off the company's celebrity marketing strategy. To date, CakeInspiration has also delivered custom cakes to K-Pop band BlackPink's Lisa, Russell Simmons, G-Dragon and more.Despite popular advice to avoid working with your partner, for Chan and Zhuo, working together as a couple has actually been a big advantage. While Chan is best at partnerships, marketing and anything external-facing, Zhuo is best at managing day-to-day operations and all things internal.\"We don't have conflicts about work because our roles are very defined ... So usually I don't tell her how to run things inside, and she doesn't really tell me how to run things outside. I guess we trust each other to fulfill our roles to the best of our abilities,\" said Chan.Want to be your own boss? Sign up for CNBC's new online course, How To Start A Business: For First-Time Founders. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "They met on Tinder when they were 19. Now, they're married and run a cake business that brings in over $650,000 a year",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222167-1762406078548-Cake_Inspiration.jpg?v=1762406228&w=1920&h=1080"
      ],
      "datePublished": "2025-11-09T04:03:58.000Z",
      "dateModified": "2025-11-09T04:03:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Worried about layoffs? Economists say the job market is cooling but 'not falling off a cliff'",
    "url": "https://www.cnbc.com/2025/11/07/-economists-say-job-market-is-cooling-but-not-falling-off-a-cliff.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222702-1762464339041-gettyimages-2202066593-generational_business-9785.jpeg?v=1762464351&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T17:48:12.000Z",
    "description": "A recent string of high-profile layoffs have taken up headlines and caused anxiety in the workforce.Companies announced 153,074 layoffs in October, ad",
    "body": "A recent string of high-profile layoffs have taken up headlines and caused anxiety in the workforce.Companies announced 153,074 layoffs in October, adding up to 1.1 million cut announcements for the year, according to outplacement firm Challenger, Gray & Christmas. That makes it the worst year for layoff notices since 2009, CNBC reported.But job experts say they're not in panic mode. Layoff news doesn't paint the whole picture of the job market. Private data around job openings, payrolls and employee sentiment show that hiring is cooling but \"not falling off a cliff,\" says Glassdoor chief economist Daniel Zhao.The Challenger monthly data can be volatile, for one, and layoff announcements haven't yet shown up in state-level weekly filings for unemployment benefits, which are still being released during the shutdown.\"I'm not alarmed,\" says Laura Ullrich, Indeed's director of economic research. The latest available data \"does not seem today to indicate that we're going into a high layoff period for the overall economy.\"Government shutdown and layoffs are hitting worker confidenceWhile economists aren't predicting a recession anytime soon, news of layoffs and the government shutdown is hitting worker confidence.The share of Glassdoor reviews mentioning layoffs is up 22% year-over-year as of October, according to data from the jobs site. Workers' confidence in the job market is down from a small rise in September and is close to a recent record-low set in June, according to Glassdoor data.Senior-level employees saw the biggest drops in confidence over the last year, dropping 4.6 percentage points since October 2024.That's concerning since leadership confidence spreads to other employees through hiring and investment plans. If senior leaders aren't confident their business is doing well, they could decide to reduce hiring or lay people off, Zhao says.Meanwhile, for those on the market, fewer people say they've gotten a job offer and declined it, signaling they have less leverage and might be settling for jobs rather than holding out for better ones, according to Glassdoor data.Health-care openings are making up for losses elsewhereMany workers are additionally competing for a smaller pool of opportunities. As of Oct. 31, job postings on Indeed are at their lowest level since 2021, continuing a declining trend for the last four years.Job postings are lowest in areas hit by the government shutdown, including Washington, D.C., and recent tech layoffs, like California and Washington.Openings are concentrated in health-care sectors, security and safety, and engineering, which on the whole are keeping the job market stable.\"I see it a tale of two economies,\" Ullrich says. \"There are certain fields where jobs are continuing to be added, and there's others that are shedding jobs.\"Health care and private education jobs have propped up the labor economy for some time: They make up about 17% of the jobs nationally but have accounted for 56% of job growth between July 2023 and July 2025.\"If health-care employment started dipping that would ring alarm bells for me,\" Ullrich says.The bigger picture: 'The job market is in a funk'Economists say available datasets can provide a pretty good picture of the job market, but official data from the Labor Department around hiring and unemployment are necessary for a best look at the health of the labor economy.The unemployment rate remained steady 4.3% in August, the last month of available government data.The Bureau of Labor Statistics missed another jobs report Friday due to the government shutdown. Economists surveyed by Dow Jones expect it would have shown a drop in 60,000 jobs and a rising unemployment rate to 4.5%, CNBC reported.The numbers we do have point overall to a continuously slowing job market. Economic uncertainty is weighing on employers' willingness to hire, Zhao says, meaning job-seekers are frozen out of the market and employed workers have less leverage to progress in their careers, win raises and stay engaged in the workplace.Hiring experts say building your network and asking for referrals are the best ways to get a job right now. To stand out in a competitive market, consider sharpening your resume to be outcomes-based, building your personal brand on LinkedIn and doing mock interviews, GrowthLoop senior recruiter Kathleen Nolan previously told CNBC Make It.\"Overall, I would say that the job market is in a funk right now,\" Zhao says. \"Even if unemployment is even [and] some of the top line indicators still point to a job market that is not historically bad, that doesn't necessarily mean that people are happy with where the job market is today.\"Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Worried about layoffs? Economists say the job market is cooling but 'not falling off a cliff'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222702-1762464339041-gettyimages-2202066593-generational_business-9785.jpeg?v=1762464351&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T17:48:12.000Z",
      "dateModified": "2025-11-07T17:48:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Carl Icahn returns to a familiar sector — auto repair — as he builds a 15% stake in Monro",
    "url": "https://www.cnbc.com/2025/11/08/carl-icahn-returns-to-a-familiar-sector-auto-repair-as-he-builds-a-15percent-stake-in-monro.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222568-1762454629105-Screenshot_2025-11-06_at_14324_PM.png?v=1762454717&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T12:46:52.000Z",
    "description": "Monro Auto Service in Derby, CT.Source: Google EarthCompany: Monro (MNRO)Business: Monro, formerly Monro Muffler Brake, is engaged in the provision of",
    "body": "Monro Auto Service in Derby, CT.Source: Google EarthCompany: Monro (MNRO)Business: Monro, formerly Monro Muffler Brake, is engaged in the provision of automotive undercar repair and tire services in the United States. The company provides a range of services on passenger cars, light trucks and vans for brakes; mufflers and exhaust systems, and steering, drive train, suspension and wheel alignment. It also offers tires and routine maintenance services, which include state inspections. It offers repair and replacement of parts. Its stores provide a range of undercar repair services for brakes, steering, mufflers and exhaust systems, suspension and wheel alignment, as well as tire replacement and service. It also offers scheduled maintenance services in its stores where services are packaged and offered to consumers based upon the year, make, model and mileage of each specific vehicle. Its maintenance services include oil change services, heating and cooling system flush and fill service, fuel system service and a transmission flush and fill service.Stock Market Value: $458.40 million ($15.27 per share)Stock Chart IconStock chart iconMonro shares year to dateActivist: Carl IcahnOwnership: 14.79%Average Cost: $19.08Activist Commentary: Carl Icahn is the grandfather of shareholder activism and a true pioneer of the strategy. He is very passionate about shareholder rights and good corporate governance and will go to extreme lengths to fight incompetent boards and over compensated managers. Icahn has invested across all sectors over his more than six-decade long career and has a long history in the automotive parts and services industry. He has been involved in several mergers and acquisitions in this space, acquiring some of his portfolio companies through Icahn Automotive, the automotive-segment business of his conglomerate, Icahn Enterprises. This includes his acquisition of Pep Boys-Manny Moe and Jack in 2016 and Federal Mogul in 2017.What's happeningOn Nov. 5, Carl Icahn filed a 13D with the U.S. Securities and Exchange Commission, disclosing a 14.79% position in Monro.Behind the scenesMonro is engaged in the provision of automotive undercar repair and tire services in the United States, operating more than 1,100 repair shops and tire dealers in 32 states under multiple regional brands. The company has faced several challenges in recent years. Macro factors like lower consumer demand, higher material and labor costs, and a trend in consumer trade-down to lower margin tire products have applied significant margin and growth pressure. As a result, following a 4.9% decrease in sales for fiscal year 2025 — the second year in a row with a meaningful decline in revenue — the company announced that they are closing approximately 145 underperforming locations. Most recently, the company's third-quarter earnings report left a lot of investors disappointed about its strategic transition, with weaker-than-expected revenue and no specific financial guidance for the upcoming fiscal year. Shares fell 16.7% the next day. Lastly, many investors have questioned the company's dividend payout ratio, which has remained relatively large despite these ongoing struggles. Putting all this together, it comes as little surprise that shares have underperformed, down 44.73%, 66.73% and 63.25% over the past 1-, 3- and 5-year periods, respectively, prior to Icahn's announcement.Perhaps this depressed valuation is what caught the eye of Carl Icahn. He disclosed a 14.79% position in the company (67% of which was acquired since the stock's Oct. 29 downturn), immediately sending the stock up over 15%. While there are plenty of cheap stocks, this isn't Icahn taking a flyer on the automotive industry. Icahn has a rich history in the automotive parts and services industry, most notably Icahn Automotive, the automotive segment of his conglomerate, Icahn Enterprises. Icahn knows this industry well and likely sees Monro as a great business that is significantly undervalued. The timing of this public engagement is also very notable. It is not just the stock's recent fall that makes this a good entry point for an investor like Icahn. Monro recently agreed to collapse its dual class share structure, which had previously granted its sole Class C shareholder, Peter Solomon, veto power over any matter brought to a shareholder vote, effectively making this a controlled company. Pursuant to its approval in 2023, this collapse will occur prior to the 2026 annual meeting, which is expected to take place next August. So, what does this mean for the company's shareholders? It effectively sets the stage for the company being converted from a privately run company to a publicly run company for the benefit of its shareholders. With one person having veto power over all material board decisions, the rest of the board becomes somewhat irrelevant. With this conversion, the company has an opportunity to have a real, collaborative, and productive board. This would require its reconstitution, and we know of nobody better or more experienced than Icahn for that endeavor.Solomon is an 87-year-old renowned investment banker and Icahn is, well, Icahn and a contemporary of Solomon. However, there is no evidence that the two have ever crossed paths. Despite this, we would imagine that they have many relationships in common and mutual respect for each other. While there are many different ways this campaign can go down, what we would like to see is the two elder statesmen meeting in a room with an air of civility and cordiality uncommon in the average activist engagement and together coming up with a board that will oversee management, hold them accountable on behalf of shareholders and usher the company through its first real phase as a truly public company. With Solomon already agreeing to give up control, and neither Solomon nor Icahn likely to be on the continuing board, there is no reason why this should get contentious.However, we also must address the elephant in the room. Icahn has built his automotive industry on acquisitions, and Monro appears to fit in very nicely in IEP's automotive business. Icahn has launched activist campaigns at some of the auto companies that he later went on to acquire, including Pep Boys-Manny Moe and Jack in 2016 and Federal Mogul in 2017. When Icahn acquired Pep Boys he also stated: \"We believe that with our abundant resources and knowledge of the industry we will be able to grow this business and take advantage of consolidation opportunities, thereby benefiting customers, manufacturing partners and employees, as well as our shareholders.\" While we sincerely believe that Icahn's main motivation for this investment is to invest in a good company that he believes is at an inflection point and is significantly undervalued, there is always the chance that he might want to own the entire company one day. This is a very small position for him and a good return would not move the needle as much as a synergistic integration into his automative business, but we see no reason why both things cannot be true.Ken Squire is the founder and president of 13D Monitor, an institutional research service on shareholder activism, and the founder and portfolio manager of the 13D Activist Fund, a mutual fund that invests in a portfolio of activist investments.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Carl Icahn returns to a familiar sector — auto repair — as he builds a 15% stake in Monro",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222568-1762454629105-Screenshot_2025-11-06_at_14324_PM.png?v=1762454717&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T12:46:52.000Z",
      "dateModified": "2025-11-08T12:46:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China consumer prices return to growth in October, producer price slump extends to three years",
    "url": "https://www.cnbc.com/2025/11/09/china-october-cpi-ppi-deflation-consumer-prices-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223360-1762665207407-gettyimages-2236500727-vcg111592136092.jpeg?v=1762665226&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-09T05:17:57.000Z",
    "description": "YIWU, CHINA - SEPTEMBER 20: Vendors stock up on fruit at a wholesale market on September 20, 2025, in Yiwu, Jinhua City, Zhejiang Province, China. Vcg",
    "body": "YIWU, CHINA - SEPTEMBER 20: Vendors stock up on fruit at a wholesale market on September 20, 2025, in Yiwu, Jinhua City, Zhejiang Province, China. Vcg | Visual China Group | Getty ImagesDeflation pressures in China eased in October as consumer prices returned to growth after remaining in negative territory for the most part this year, supported by holiday season demand, while declines in wholesale prices also moderated.Data from China's National Bureau of Statistics released Sunday showed consumer price index reading for October at 0.2%, compared with analysts' expectations of zero, or flat growth year on year. October's reading was the strongest this year, and the first positive growth in consumer prices since June.On a month-on-month basis CPI also rose by 0.2%, compared with analysts' expectations of zero growth.Food prices, which have been a drag on the country's CPI, dropped 2.9% year on year. However, prices rose 0.2% over the previous month.Factory-gate deflation eased with prices falling 2.1%, year on year, compared with Reuters' poll estimates for a 2.2% decline, completing three years in negative territory. Month-on-month producer prices rose by 0.1% in October.\"In October, policies aimed at expanding domestic demand continued to take effect, coupled with the boost from the National Day and Mid-Autumn Festival holidays,\" Dong Lijuan, chief statistician at the urban division of the National Bureau of Statistics, said in a statement.Read moreWhile China's steps aimed at reining in price wars and fueling demand seem to have started bearing fruit, with the country's industrial profits in September rising more than 21%, experts warn that Chinese local governments' dependence on tax revenue encourages sustained production, intensifying competition and overcapacity until there are meaningful tax changes.China's manufacturing activity in October declined more than expected, contracting to its lowest level in six months, according to an official survey released Oct. 30. The sub-indexes for production, new orders, raw material inventory and employment all deepened their contraction, pointing to a sharp manufacturing slowdown.Chinese producers have been in the throes of demand uncertainty owed to trade tensions with the U.S. this year and weak consumer confidence at home as Beijing struggles with a prolonged housing downturn and headwinds to exports.The country's exports in October unexpectedly contracted, with shipments to the U.S. clocking double-digit declines for a seventh consecutive month, down 25%, customs data released Thursday showed.Going forward, export headwinds could weaken as U.S. President Donald Trump and his Chinese counterpart, Xi Jinping, agreed to a trade truce during their meeting in South Korea on Oct. 30, defusing a potentially incendiary situation that had stoked worries of a full-blown trade war.China's leadership last month vowed to boost domestic consumption as it laid out the economic roadmap for the next five years. China must \"vigorously boost consumption,\" the meeting readout said, according to a CNBC translation.The leaders elaborated on the need for lifting consumption with calls to balance it with \"effective investment\" and \"adhere to the strategic point of expanding domestic demand.\"—  CNBC's Anniek Bao and Evelyn Cheng contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China consumer prices return to growth in October, producer price slump extends to three years",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223360-1762665207407-gettyimages-2236500727-vcg111592136092.jpeg?v=1762665226&w=1920&h=1080"
      ],
      "datePublished": "2025-11-09T05:17:57.000Z",
      "dateModified": "2025-11-09T05:17:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump tells Senate Republicans to send federal health insurance money 'directly to the people'",
    "url": "https://www.cnbc.com/2025/11/08/trump-republicans-health-insurance.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222585-17624560132025-11-06t190319z_2013354139_rc25rha5iso8_rtrmadp_0_usa-trump.jpeg?v=1762456039&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T20:08:22.000Z",
    "description": "U.S. President Donald Trump gestures as he speaks during an event to announce a deal with Eli Lilly and Novo Nordisk to reduce the prices of GLP-1 wei",
    "body": "U.S. President Donald Trump gestures as he speaks during an event to announce a deal with Eli Lilly and Novo Nordisk to reduce the prices of GLP-1 weight‑loss drugs, in the Oval Office at the White House in Washington, D.C., U.S., November 6, 2025. Jonathan Ernst | ReutersPresident Donald Trump proposed a compromise on health insurance payments, calling on Republicans to send federal payments that would go to insurers under the Affordable Care Act directly to Americans to bring an end to the government shutdown.\"I am recommending to Senate Republicans that the Hundreds of Billions of Dollars currently being sent to money sucking Insurance Companies in order to save the bad Healthcare provided by ObamaCare, BE SENT DIRECTLY TO THE PEOPLE SO THAT THEY CAN PURCHASE THEIR OWN, MUCH BETTER, HEALTHCARE, and have money left over,\" he wrote in a Truth Social post on Saturday, without providing any details.The post comes one day after Senate Republicans rejected Democratic Minority Leader Chuck Schumer's deal that would have allowed the U.S. government to reopen after a shutdown that began Oct. 1. The shutdown is now the longest in U.S. history.The plan Democrats put forward on Friday proposed protecting federal ACA subsidies for at least one year, in exchange for dropping their demand that a longer-term extension of Obamacare tax credits be included in a stopgap government funding bill.Those subsidies, which more than 20 million Americans use, will expire at the end of December if Congress does not extend them.Read more CNBC government shutdown coverageSenate Republicans reject Democrat deal to reopen governmentDemocratic leader offers deal to reopen government but Republicans sneerTrump admin asks Supreme Court to block order it pay full SNAP benefitsSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key racesSenate Majority Leader John Thune, R-S.D., on Friday called the Democrats' proposal a \"non-starter.\"The White House did not immediately respond to a CNBC request for comment or specifics on how Trump's proposed direct payment plan would work.Representatives for Sens. Schumer and Thune did not immediately respond to a request for comment. The D.C. offices for House Speaker Mike Johnson, R-La., and House Minority Leader Rep. Hakeem Jeffries, D-N.Y., did not immediately respond to a request for comment.Congressional lawmakers have been in a stalemate, unable to find a compromise to end the shutdown. Democrats want a funding bill to include health-care subsidies that are due to expire for 24 million Americans at year's end. Republicans, meanwhile, say Congress must first pass a funding bill without strings attached and allow the government to reopen before tackling other issues.In multiple posts on Saturday, Trump also reiterated his calls for terminating the filibuster, the Senate rule requiring 60 of its 100 members to pass most legislation. The GOP holds 53 seats in the Senate. There are 45 Democratic senators, and two independents who caucus with them.Senate Republicans have pushed back on changing the rule, saying earlier this week they would not support a change. Trump had called for his party to exercise what he called \"the Nuclear Option\" on the rule.On Saturday, Trump alleged that he is \"making progress\" with Republicans on changing the rule.\"The Democrats are cracking like dogs on the Shutdown because they are deathly afraid that I am making progress with the Republicans on TERMINATING THE FILIBUSTER! Whether we make a Deal or not, THE REPUBLICANS MUST 'BLOW UP' THE FILIBUSTER,\" he wrote.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump tells Senate Republicans to send federal health insurance money 'directly to the people'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222585-17624560132025-11-06t190319z_2013354139_rc25rha5iso8_rtrmadp_0_usa-trump.jpeg?v=1762456039&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T20:08:22.000Z",
      "dateModified": "2025-11-08T20:08:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Supreme Court pauses order that Trump administration must pay full SNAP benefits ",
    "url": "https://www.cnbc.com/2025/11/07/snap-trump-appeals-food-stamps.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220776-1762619229228-108220776-1762199884854-gettyimages-2244377088-US_GOV_FUNDING.jpg?v=1762619246&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T11:03:34.000Z",
    "description": "MIAMI, FLORIDA - OCTOBER 31: A 'We Accept (Food Stamps)' sign hangs in the window of a grocery store on October 31, 2025 in Miami, Florida. The food s",
    "body": "MIAMI, FLORIDA - OCTOBER 31: A 'We Accept (Food Stamps)' sign hangs in the window of a grocery store on October 31, 2025 in Miami, Florida. The food stamp program, now known as the Supplemental Nutrition Assistance Program (SNAP), may run out of funding on November 1st due to the federal government shutdown, which is now entering its second month. In Miami-Dade County, nearly one in six residents receives food assistance. (Photo by Joe Raedle/Getty Images)Joe Raedle | Getty Images News | Getty ImagesThe Supreme Court on Friday night temporarily paused a federal judge's order that directed the Trump administration to pay full SNAP benefits to 42 million Americans for November by the end of the day.The move came hours after the 1st Circuit U.S. Court of Appeals in Boston denied the administration's emergency request to halt the order relating to food stamp benefits to primarily low-income people.But the appeals court also said it would soon rule on whether the administration was entitled to a stay of the order by U.S. District Court in Rhode Island Judge Jack McConnell while its appeal of the order plays out.Supreme Court Justice Ketanji Brown Jackson, in the order on Friday night in favor of the administration, pushed the 1st Circuit to quickly determine whether to issue that stay.\"The applicants assert that, without intervention from this Court, they will have to 'transfer an estimated $4 billion by tonight' to fund SNAP benefits through November,\" Jackson wrote.That money was to come from so-called Section 32 funds that the Trump administration said it did not want to use to augment a partial payment of SNAP benefits that federal officials planned to make. The partial benefits payment would come from $4.6 billion in contingency funds set aside by Congress for that purpose.The administration originally planned not to pay any SNAP benefits in November because of the ongoing government shutdown.\"Given the First Circuit's representations, an administrative stay is required to facilitate the First Circuit's expeditious resolution of the pending stay motion,\" Jackson wrote.She said that the Supreme Court's stay \"will terminate forty-eight hours after the First Circuit's resolution of the pending motion, which the First Circuit is expected to issue with dispatch.\"That two-day window would give time for the Trump administration, or plaintiffs in the case, to return to the Supreme Court to challenge any ruling by the 1st Circuit.It is not clear to what extent Jackson's order will affect payments of SNAP benefits.The U.S. Department of Agriculture earlier Friday told states it would begin disbursing full SNAP benefits to comply with McConnell's order, even as the administration appealed the ruling.The USDA's memo did not suggest that the administration would renege on that plan even if a higher court blocked the order.The Associated Press reported late Friday that more than half a dozen states had \"confirmed that some SNAP recipients already were issued full November payments on Friday.\"New York Attorney General Letitia James, in a statement on Jackson's order, said, \"This decision is a tragedy for the millions of Americans who rely on SNAP to feed their families.\"\"It is disgraceful that the Trump administration chose to fight this in court instead of fulfilling its responsibility to the American people,\" said James, whose state is one of the plaintiffs in another pending lawsuit seeking for force full SNAP benefits to be paid.\"Every day the federal government delays is another day that children, seniors, and families face real pain and suffering,\" Read more CNBC government shutdown coverageSenate Republicans reject Democrat deal to reopen governmentDemocratic leader offers deal to reopen government but Republicans sneerTrump admin asks Supreme Court to block order it pay full SNAP benefitsSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key racesThe administration last week said it would not pay any SNAP benefits in November because of the federal shutdown, which began on Oct. 1 when Congress failed to pass a bill to provide short-term funding for federal programs, including food stamps. Past administrations have paid the benefits during other shutdowns.A group of plaintiffs, comprised of cities, unions, nonprofits, and a retailer, then sued the administration in Rhode Island federal court, asking McConnell to order that full benefits be paid for the month.McConnell on Oct. 31 ordered the administration to disburse at least partial SNAP benefits as soon as possible by tapping the contingency fund.He also ordered the administration to explore whether other pools of previously appropriated money could be used to fully fund SNAP, which costs about $8 billion per month.The administration on Monday said it would pay 50% of SNAP benefits in November by using the contingency funds. But it refused to use another $4 billion from a Section 32 fund that would have made up the difference in the SNAP payments. The administration two days later said a re-calculation found it could pay 65% of the SNAP benefits from the contingency fund.The plaintiffs then urged McConnell to order the administration to make the full SNAP payments from available funds. The judge did so on Thursday, saying at a hearing that the administration's decision to rule out Section 32 funds was \"arbitrary and capricious.\" \"People have gone without for too long,\" McConnell said.\"The evidence shows that people will go hungry, food pantries will be overburdened, and needless suffering will occur\" if SNAP is not fully funded, he wrote in an order.The administration on Friday morning asked the 1st Circuit appeals court to block McConnell's order, even as the USDA issued its memo to states saying that it intended to comply with the ruling.On Friday night, a three-judge panel on that appeals court denied the administration's request.The panel noted that \"the government has not disputed that it may under [federal law] use the Section 32 fund to cover the provision of SNAP benefits for\" November.But the panel also said that the \"government's motion for a stay pending appeal [of McConnell's order] remains pending, and we intend to issue a decision on that motion as quickly as possible.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Supreme Court pauses order that Trump administration must pay full SNAP benefits ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220776-1762619229228-108220776-1762199884854-gettyimages-2244377088-US_GOV_FUNDING.jpg?v=1762619246&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T11:03:34.000Z",
      "dateModified": "2025-11-08T11:03:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FAA-mandated flight cancellations to worsen next week if shutdown continues",
    "url": "https://www.cnbc.com/2025/11/08/government-shutdown-flight-cancelations-faa.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220015-1761920033346-gettyimages-2243415543-US_GOV_FUNDING.jpeg?v=1761920070&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T22:41:54.000Z",
    "description": "A Republic Airways plane takes off near the air traffic control tower at Ronald Reagan Washington National Airport (DCA) in Arlington, Virginia, US, o",
    "body": "A Republic Airways plane takes off near the air traffic control tower at Ronald Reagan Washington National Airport (DCA) in Arlington, Virginia, US, on Tuesday, Oct. 28, 2025. Samuel Corum | Bloomberg | Getty ImagesMore than 5,000 U.S. flights were delayed on Saturday due to air traffic controller shortages, and the country's airlines will have to cut hundreds more flights next week if Congress can't come to a solution to end the government shutdown — now the longest in U.S. history.Trump administration officials this week ordered airlines to start cutting flights at 40 busy U.S. airports on Friday, blaming \"increased reports of strain on the system from both pilots and air traffic controllers\" in large part due to the shutdown.Late Friday, Senate Republicans rejected a Democrat proposal to reopen the government.Air traffic controllers, along with airport security screeners, are required to work during the shutdown without receiving their regular paychecks. Federal workers will miss their second full paycheck on Monday, according to their union. Some controllers have taken second jobs to make ends meet, union officials have said.Close to 1,650 U.S. flights were canceled on Saturday as of 5:30 p.m. ET, about half that number previously announced by the airlines that had 21,748 scheduled for the day. That share of cancellations was on par with severe thunderstorms, which can be disruptive, though they're routine. Cirium said Friday ranked as the 72nd worst for cancellations since Jan. 1, 2024.Under the FAA's order, the flight cuts will increase to 6% of schedules, 8% by Thursday and 10% next Friday. Transportation Secretary Sean Duffy told Fox News on Friday that cuts could eventually reach up to 20% of schedules, although he didn't elaborate. Airlines weren't required to cut international flights.watch nowThe disruptions are occurring at a generally low travel season, but the key Thanksgiving holiday weekend is less than three weeks away. The impact for airlines could quadruple given how fares during that high-demand period spike, Seaport Research Partners airline analyst Daniel McKenzie said in a note on Friday.Airlines this week waived date-change fees for travelers on affected flights and noted they can also request a refund. Airline executives stated that many customers were being rebooked on alternative flights, while last-minute changes sent others scrambling for other arrangements. Hertz, for example, stated on Thursday that, when the FAA made its flight-cut announcement, one-way car rentals increased by 20% over the same two-day period a year earlier.Delays rose throughout the day Saturday, with more than 5,400 late U.S. flights, according to FlightAware. Air traffic control staffing shortages prompted delays at airports including Hartsfield-Jackson Atlanta International Airport, San Francisco International Airport, John F. Kennedy International Airport in New York, Newark Liberty International Airport in New Jersey, Houston's George Bush Intercontinental Airport and Chicago O'Hare International Airport.Here are the airports where the FAA and DOT cuts apply:Impacted airports:ANC - Anchorage InternationalATL - Hartsfield-Jackson Atlanta InternationalBOS - Boston Logan InternationalBWI - Baltimore/Washington InternationalCLT - Charlotte Douglas InternationalCVG - Cincinnati/Northern Kentucky InternationalDAL - Dallas LoveDCA - Ronald Reagan Washington NationalDEN - Denver InternationalDFW - Dallas/Fort Worth InternationalDTW - Detroit Metropolitan Wayne CountyEWR - Newark Liberty InternationalFLL - Fort Lauderdale/Hollywood InternationalHNL - Honolulu InternationalHOU - Houston HobbyIAD - Washington Dulles InternationalIAH - George Bush Houston IntercontinentalIND - Indianapolis InternationalJFK - New York John F. Kennedy InternationalLAS - Las Vegas McCarran InternationalLAX - Los Angeles InternationalLGA - New York LaGuardiaMCO - Orlando InternationalMDW - Chicago MidwayMEM - Memphis InternationalMIA - Miami InternationalMSP - Minneapolis/St. Paul InternationalOAK - Oakland InternationalONT - Ontario InternationalORD - Chicago O'Hare InternationalPDX - Portland InternationalPHL - Philadelphia InternationalPHX - Phoenix Sky Harbor InternationalSAN - San Diego InternationalSDF - Louisville InternationalSEA - Seattle/Tacoma InternationalSFO - San Francisco InternationalSLC - Salt Lake City InternationalTEB - TeterboroTPA - Tampa InternationalRead more CNBC airline newsAmerican Airlines is arriving late to the luxury travel boom. Can it catch up?Boeing gets FAA approval to hike 737 Max outputAir traffic control shortages add to U.S. flight delays, FAA saysSpirit wins court approval for a $475 million bankruptcy lifeline",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FAA-mandated flight cancellations to worsen next week if shutdown continues",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220015-1761920033346-gettyimages-2243415543-US_GOV_FUNDING.jpeg?v=1761920070&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T22:41:54.000Z",
      "dateModified": "2025-11-08T22:41:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump pardons New York baseball star Darryl Strawberry for tax evasion conviction",
    "url": "https://www.cnbc.com/2025/11/07/trump-pardons-darryl-strawberry-tax-evasion.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223154-1762539355136-gettyimages-2158172323-0dbacksmets0019.jpeg?v=1762539430&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T20:07:25.000Z",
    "description": "Darryl Strawberry former New York Mets speaks to the media before a ceremony to retire his jersey number before a game against the Arizona Diamondback",
    "body": "Darryl Strawberry former New York Mets speaks to the media before a ceremony to retire his jersey number before a game against the Arizona Diamondbacks at Citi Field on June 1, 2024 in New York City.Adam Hunger | Getty ImagesPresident Donald Trump pardoned Major League Baseball legend Darryl Strawberry, who had pleaded guilty to tax evasion three decades ago, the White House said Friday.Strawberry, 63, \"served time and paid back taxes\" after his conviction, a White House official said in a statement to CNBC.\"Following his career, Mr. Strawberry found faith in Christianity and has been sober for over a decade – he has become active in ministry and started a recovery center which still operates today,\" the official said.Strawberry is an eight-time MLB All-Star who helped take the New York Mets and the New York Yankees to World Series championships. He pleaded guilty in 1995 to one count of tax evasion for failing to report tens of thousands of dollars of income on his federal returns.Read more CNBC politics coverageDemocrats win big on Election Night in key racesZohran Mamdani wins New York City mayor's race, NBC News projectsDemocratic candidate Mikie Sherrill wins New Jersey governor's race, NBC News projectsDemocrats win Virginia governor, attorney general races, NBC News projectsSNAP update: Trump admin will pay 50% of food stamp benefits in November amid shutdownTrump says he has 'no idea who' Binance's CZ is after pardoning himTrump backtracks on attending Supreme Court tariffs case argumentsStrawberry, who dealt with substance abuse issues for years, was suspended from the MLB in 2000 after failing a drug test, effectively ending his career.Strawberry is the latest high-profile figure to receive clemency from Trump.Last month, the president commuted the prison sentence of disgraced former Republican Rep. George Santos, who had pleaded guilty to charges of wire fraud and aggravated identity theft.Days later, Trump pardoned Changpeng Zhao, founder of cryptocurrency exchange Binance, who had served four months in jail after pleading guilty to failing to address money laundering on the platform.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump pardons New York baseball star Darryl Strawberry for tax evasion conviction",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223154-1762539355136-gettyimages-2158172323-0dbacksmets0019.jpeg?v=1762539430&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T20:07:25.000Z",
      "dateModified": "2025-11-07T20:07:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Palantir CEO Karp twice slams short sellers as stock suffers worst week since April",
    "url": "https://www.cnbc.com/2025/11/07/palantir-ceo-alex-karp-ai-short-sellers.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107319295-1739998455798-107319295-16976413442023-10-18t145750z_1657472629_rc22v3a2gmup_rtrmadp_0_usa-ai-congress.jpeg?v=1740003314&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T21:41:18.000Z",
    "description": "Palantir co-founder and CEO Alex Karp attends meetings at the U.S. Capitol in Washington on Oct. 18, 2023.Jonathan Ernst | ReutersWith Palantir's stoc",
    "body": "Palantir co-founder and CEO Alex Karp attends meetings at the U.S. Capitol in Washington on Oct. 18, 2023.Jonathan Ernst | ReutersWith Palantir's stock plummeting more than 11% this week despite a better-than-expected earnings report, CEO Alex Karp took aim at investors betting against the software company. Karp, who co-founded Palantir in 2003, went after short sellers in two separate interviews on CNBC this week. After \"Big Short\" investor Michael Burry revealed bets against Palantir and Nvidia, Karp on Tuesday accused short sellers of \"market manipulation.\" He repeated that message on Friday in an interview with CNBC's Sara Eisen, again knocking Burry's wager against the stock.\"To get out of his position, he had to screw the whole economy by besmirching the best financials ever ... that are helping the average person as investors [and] on the battlefield,\" Karp said.Even with Palantir's slide this week, the stock is up 135% in 2025 and has multiplied 25-fold in the past three years, an extended rally that's lifted the company's market cap to over $420 billion. While revenue and profit are growing rapidly, the multiples have shot up much faster, and the stock now trades for about 220 times forward earnings, a ratio that rivals Tesla's. Nvidia and Meta, by contrast, have forward price-to-earnings ratios of about 33 and 22, respectively. In August, Citron Research's Andrew Left, a noted short seller, called Palantir \"detached from fundamentals and analysis\" and said shares should be priced at $40. It closed on Friday at $177.93 after late-day gains pushed the stock into the green.  watch nowPalantir, which builds analytics tools for large companies and government agencies, reported earnings and revenue on Monday that topped analysts' estimates and issued a forecast that was also ahead of Wall Street projections. But the stock fell about 8% after the report and then slid almost 7% on Thursday. Karp told Eisen that the recent boom in Palantir's share price isn't just for Wall Street. \"We're delivering venture results for retail investors,\" he said. While Palantir has in the past faced a fairly heft dose of short interest, there are currently relatively few investors placing big bets against it. The short interest ratio, or the percentage of outstanding shares being sold short, peaked at over 9% in September and is now at a little over 2%, which is about as low as its been since the company went public in 2020. Still, calling out the doubters is a common occurrence for Karp, who has previously said on CNBC that people should \"exit\" if they \"don't like the price.\"In May, after the stock plummeted following earnings, Karp said ,\"You don't have to buy our shares.\" \"We're happy,\" he said. \"We're going to partner with the world's best people and we're going to dominate. You can be along for the ride or you don't have to be.\"The company has also faced backlash over its work with government agencies like U.S. Immigration and Customs Enforcement, and Karp has admitted that his strong pro-Israel stance led some people to leave the company.The boisterous CEO has been particularly vocal this week. On Monday's earnings call, he questioned how happy the people are who didn't invest in the company, and told them to \"get some popcorn.\" And on CNBC he aimed much of his ire at Burry after the investor revealed his short positions in Palantir and Nvidia. \"The two companies he's shorting are the ones making all the money, which is super weird,\" Karp told CNBC's \"Squawk Box\" on Tuesday. \"The idea that chips and ontology is what you want to short is bats--- crazy.\"WATCH: Palantir CEO Karp on short sellerswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Palantir CEO Karp twice slams short sellers as stock suffers worst week since April",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107319295-1739998455798-107319295-16976413442023-10-18t145750z_1657472629_rc22v3a2gmup_rtrmadp_0_usa-ai-congress.jpeg?v=1740003314&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T21:41:18.000Z",
      "dateModified": "2025-11-07T21:41:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tesla says shareholders approve Musk's $1 trillion pay plan with over 75% voting in favor",
    "url": "https://www.cnbc.com/2025/11/06/tesla-shareholders-musk-pay.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222736-1762470015629-Screenshot_2025-11-06_at_51201_PM.png?v=1762470059&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T13:05:47.000Z",
    "description": "watch nowTesla said shareholders voted in favor of CEO Elon Musk's almost $1 trillion pay plan, with 75% support among voting shares.Board members rec",
    "body": "watch nowTesla said shareholders voted in favor of CEO Elon Musk's almost $1 trillion pay plan, with 75% support among voting shares.Board members recommended shareholders approve the pay plan, which they introduced in September. Top proxy advisors Glass Lewis and ISS recommended voting against it.Results of the vote were announced on Thursday at the company's annual shareholders meeting in Austin, Texas.A separate proposal, submitted by an individual investor, Stephen Hawk, called for Tesla to be able to invest in xAI, Musk's artificial intelligence startup that was formed in March 2023 to compete with OpenAI. Brandon Ehrhart, general counsel at Tesla, said at the meeting that the company had \"received more votes in favor than we did in against,\" but that there were a number of abstentions and that Tesla is considering next steps.The pay package for Musk, already the world's richest person, consists of 12 tranches of shares to be granted if Tesla hits certain milestones over the next decade. It would also give Musk increased voting power over the company, acceding to demands that he's made publicly since early 2024. His ownership would increase from about 13% to 25%, adding more than 423 million shares to his holdings.The first tranche of stock gets paid out if Tesla hits a market capitalization of $2 trillion. Tesla's current market cap is $1.54 trillion. Awards tied to market cap gains are paired with operational achievements.The next nine tranches would be awarded if Tesla's value increases by increments of $500 billion, up to $6.5 trillion. Musk would earn the last two tranches if the market cap rises by increments of $1 trillion, meaning it would need to hit $8.5 trillion for Musk to get the full package.Elon Musk, CEO of Tesla, speaks during the 2025 Annual Shareholder Meeting on Nov. 6, 2025.Courtesy: TeslaTesla also laid out a series of earnings milestones for Musk, beginning with $50 billion in annual adjusted profit and moving up to $400 billion. In the third quarter, Tesla reported adjusted EBITDA of $4.2 billion.Other goals tied to the newly approved pay plan include reaching 20 million vehicle deliveries, 10 million active FSD (Full Self-Driving) subscriptions​, 1 million bots (Optimus humanoid robots) delivered and​ 1 million robotaxis in commercial operation. To date, Tesla has delivered more than 8 million vehicles, according to its September proxy statement.The proposed plan doesn't specify whether the FSD subscriptions must be purchased or could include free trials. Tesla currently provides partially automated driving systems, which it markets as \"FSD Supervised\" in the U.S. The company intends to improve its FSD Supervised systems so they don't require human supervision on board.At the meeting, Musk claimed that Optimus robots \"will eliminate poverty,\" \"give everyone amazing medical care,\" and will be \"bigger than cell phones, bigger than anything.\" He also said the robots could be used for \"containment of future crime\" by following criminals around and stopping them from \"doing crime.\"There's currently no Optimus robot on the market, and Musk didn't provide a target date for reaching those goals.Read more CNBC tech newsGoogle's decade-long bet on custom chips is turning into company's secret weapon in AI raceTesla says shareholders approve Musk's $1 trillion pay plan with over 75% voting in favorAltman says OpenAI will top $20 billion in annualized revenue this year, hundreds of billions by 2030Meta reportedly projected 10% of 2024 sales came from scam, fraud adsAs Reuters previously reported, Musk could still score tens of billions of dollars without meeting most of the targets laid out for him by the board, collecting more than $50 billion just by hitting a handful of the more attainable goals.There are also a list of \"covered events\" in the award terms that would allow Musk to earn shares without meeting the required operational milestones.Covered events include natural disasters, wars, pandemics, and changes to \"international, federal, state and local law, regulations or other governmental action or inaction,\" that could hamper the company's ability to design, manufacture or sell its products down the line.Shareholders voted on the new plan after the Delaware Court of Chancery ruled last year that Musk's earlier 2018 pay plan was improperly granted by the Tesla board and must be rescinded. Musk appealed that ruling and the matter will be decided by the Delaware State Supreme Court.In addition to leading Tesla, Musk runs xAI which has merged with X, leads SpaceX and its satellite internet business Starlink, and is a founder of brain computer interface company Neuralink and tunneling venture The Boring Company.He's also been heavily engaged in politics, most notably working to propel President Donald Trump back to the White House, and then leading a sweeping effort to slash the federal government at the beginning of his second term.The National Bureau of Economic Research published a paper last month estimating that Tesla sales from October 2022 through April of this year in the U.S. would have been 67% to 83% higher without Musk's \"polarizing and partisan actions.\"The newly approved pay plan puts no limits on Musk's political activity, and does not establish a minimum amount of time he must spend working at Tesla.WATCH: Tesla shareholders approve Musk's pay plan",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tesla says shareholders approve Musk's $1 trillion pay plan with over 75% voting in favor",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222736-1762470015629-Screenshot_2025-11-06_at_51201_PM.png?v=1762470059&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T13:05:47.000Z",
      "dateModified": "2025-11-07T13:05:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fed's Miran says stablecoin surge could help push interest rates lower",
    "url": "https://www.cnbc.com/2025/11/07/feds-miran-says-stablecoin-surge-could-help-push-interest-rates-lower.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220528-1762177130773-gettyimages-2244331113-MIRAN_INTERVIEW.jpeg?v=1762177151&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T20:46:48.000Z",
    "description": "watch nowFed Governor Stephen Miran on Friday suggested that surging demand for dollar-denominated stablecoins could help push U.S. interest rates low",
    "body": "watch nowFed Governor Stephen Miran on Friday suggested that surging demand for dollar-denominated stablecoins could help push U.S. interest rates lower.In a speech delivered for an audience of economists in New York, the central bank official and appointee of President Donald Trump said the flood of crypto tokens pegged to the dollar could tamp down what economists refer to as \"r-star,\" or the \"neutral\" rate of interest that neither pushes nor impedes growth.If that happens, he said, the Fed might need to lower its own policy rate to avoid unintentionally slowing the economy.\"Stablecoins may become a multitrillion-dollar elephant in the room for central bankers,\" Miran said. \"Stablecoins are already increasing demand for U.S. Treasury bills and other dollar-denominated liquid assets by purchasers outside the United States, and this demand will continue growing.\"Citing prior research, Miran said stablecoin growth could push the Fed's benchmark rate down by 0.4 percentage point.During his short time on the Fed board, Miran has advocated aggressive rate cuts, in part because he thinks the neutral rate is considerably lower than most of his colleagues assume. His latest remarks extend that argument into the world of digital finance, suggesting that the rise of stablecoins could structurally lower borrowing costs for years to come.Previously, his arguments have been focused largely on moderating inflation and the importance of the Fed not impeding economic growth with higher rates. The stablecoin dissertation adds another wrinkle to the case for easier policy.\"Even relatively conservative estimates of stablecoin growth imply an increase in the net supply of loanable funds in the economy that pushes down\" the neutral rate, he said. If neutral is lower, he added, \"policy rates should also be lower than they would otherwise be to support a healthy economy. A failure of the central bank to cut rates in response to a reduction in [r-star] is contractionary.\"Miran is expected to leave the Fed in January, when the unexpired term he is filling runs out.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fed's Miran says stablecoin surge could help push interest rates lower",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220528-1762177130773-gettyimages-2244331113-MIRAN_INTERVIEW.jpeg?v=1762177151&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T20:46:48.000Z",
      "dateModified": "2025-11-07T20:46:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Affirm CEO says furloughed federal employees are starting to lose interest in shopping",
    "url": "https://www.cnbc.com/2025/11/07/affirm-government-shutdown-shopping.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219425-17618377172025-10-30t151709z_40634287_rc2dmhadzeuv_rtrmadp_0_usa-shutdown.jpeg?v=1761837754&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T21:06:33.000Z",
    "description": "watch nowAffirm CEO Max Levchin said Friday that while the buy now, pay later firm isn't seeing credit stress among federally employed borrowers due t",
    "body": "watch nowAffirm CEO Max Levchin said Friday that while the buy now, pay later firm isn't seeing credit stress among federally employed borrowers due to the government shutdown, there are signs of a change in shopping habits.\"We are seeing a very subtle loss of interest in shopping just for that group, and a couple of basis points,\" Levchin told CNBC's \"Squawk on the Street.\"At least 670,000 federal employees have been furloughed in the shutdown, and about 730,000 are working without pay, the Bipartisan Policy Center said this week.Levchin said he's closely watching employment data for signs of major disruptions, but the company is \"capable\" of adjusting credit standards when needed.\"Right now, things are just fine,\" he said. \"We're not seeing any major disturbances at all.\"The federal funding lapse, which began Oct. 1, is the longest in U.S. history and has halted work across agencies with an impact beyond those who are government employees. The SNAP food benefit program, which serves 42 million Americans, has also been cut off.Read more CNBC tech newsGoogle's decade-long bet on custom chips is turning into company's secret weapon in AI raceTesla says shareholders approve Musk's $1 trillion pay plan with over 75% voting in favorAltman says OpenAI will top $20 billion in annualized revenue this year, hundreds of billions by 2030Meta reportedly projected 10% of 2024 sales came from scam, fraud adsThe comments from Levchin followed a fiscal first-quarter earnings report that blew past Wall Street's estimates. Affirm posted earnings of 23 cents per share on $933 million in revenue. Analysts polled by LSEG expected earnings of 11 cents per share on $883 million in sales.Revenues climbed 34% from a year ago, while gross merchandise volumes jumped 42% to $10.8 billion from $7.6 billion a year ago. That surpassed Wall Street's $10.38 billion estimate.The fintech company, which went public in 2021, also lifted its full-year outlook, saying it now expects gross merchandise volume to hit $47.5 billion, versus prior guidance of $46 billion.Affirm also said it renewed its partnership with Amazon through 2031. The company has also inked deals with the likes of Shopify and Apple in a competitive e-commerce landscape.Long-time partner Walmart recently ditched Affirm for Swedish buy now, pay later firm Klarna, which went public in September after delaying its public offering due to market uncertainty caused by President Donald Trump's tariff plans. Worries of a pullback in discretionary spending due to tariffs ignited fears across the fintech sector.Levchin said categories such as ticketing and travel have seen an uptick in interest, and consumer shopping remains strong. Active consumers grew to 24.1 million from 19.5 million a year ago.\"We're every single day out there preaching the gospel of buy now, pay later being the better way to buy, and consumers are obviously responding,\" he said.Affirm shares surged 11.6% on Friday.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Affirm CEO says furloughed federal employees are starting to lose interest in shopping",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219425-17618377172025-10-30t151709z_40634287_rc2dmhadzeuv_rtrmadp_0_usa-shutdown.jpeg?v=1761837754&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T21:06:33.000Z",
      "dateModified": "2025-11-07T21:06:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]