[
  {
    "title": "Trump says he will announce a replacement for Powell as Fed chair Friday morning",
    "url": "https://www.cnbc.com/2026/01/29/trump-says-he-will-announce-a-replacement-for-powell-as-fed-chair-friday-morning.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108259293-1769728916637-gettyimages-2258943292-sc1_0633_aok0gq0u.jpeg?v=1769728957&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-30T03:01:59.000Z",
    "description": "U.S. President Donald Trump speaks in the Oval Office at the White House on Jan. 29, 2026 in Washington, DC. Samuel Corum | Getty ImagesPresident Dona",
    "body": "U.S. President Donald Trump speaks in the Oval Office at the White House on Jan. 29, 2026 in Washington, DC. Samuel Corum | Getty ImagesPresident Donald Trump said Thursday that he will be naming his pick Friday for the new Federal Reserve chair.Speaking at the premiere for \"Melania,\" the film about first lady Melania Trump, the president said a process that began last summer of finding his pick to succeed current Chair Jerome Powell is about to end.\"I'll be announcing the Fed chair tomorrow morning,\" Trump said. Asked if he had actually settled on a choice, he replied, \"I do, I better, otherwise I have to go to work very quickly.\"The process for deciding on Powell's replacement began in September with an 11-candidate field that included past and current Fed officials, economists and Wall Street investment professionals. Treasury Secretary Scott Bessent screened the qualifying candidates, whittling the list down to five and then four. The final four is believed to be former Fed Governor Kevin Warsh, National Economic Council Director Kevin Hassett, current Fed Governor Christopher Waller and BlackRock chief investment officer for fixed income Rick Rieder.Prediction markets have been betting on who gets the job. Hassett had been the leader for some time, then Warsh and for the past several days Rieder. However, that flipped Thursday evening, with Kalshi now putting Warsh as a prohibitive 80% favorite.Trump added that the pick is \"somebody that could have been there a few years ago.\" Warsh is known to have been in the running back in 2017 when Trump decided to nominate Powell. An administration source told CNBC that Warsh was at the White House on Thursday. However, a White House official dismissed speculation.\"President Trump will make an announcement about his pick for the Federal Reserve at the appropriate juncture. Any and all reporting on the Federal Reserve Chairman nominations process until then is a waste of everyone's time,\" said White House spokesman Kush Desai.For his part, Powell balked at questions over whether he will stay on after his term as chair expires in May. Powell has the option of serving out the remaining two years on his governor's term.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he will announce a replacement for Powell as Fed chair Friday morning",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108259293-1769728916637-gettyimages-2258943292-sc1_0633_aok0gq0u.jpeg?v=1769728957&w=1920&h=1080"
      ],
      "datePublished": "2026-01-30T03:01:59.000Z",
      "dateModified": "2026-01-30T03:01:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elon Musk's $20 billion spending plan signals 'Tesla of yesterday is gone'",
    "url": "https://www.cnbc.com/2026/01/29/musks-20-billion-spending-plan-signals-tesla-of-yesterday-is-gone.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108168278-17518962972025-06-13t010710z_885255829_rc2gk1a9xltd_rtrmadp_0_space-warfare.jpeg?v=1753301789&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T23:01:47.000Z",
    "description": "Elon Musk, CEO of SpaceX and Tesla, attends the Viva Technology conference at the Porte de Versailles exhibition center in Paris on June 16, 2023.Gonz",
    "body": "Elon Musk, CEO of SpaceX and Tesla, attends the Viva Technology conference at the Porte de Versailles exhibition center in Paris on June 16, 2023.Gonzalo Fuentes | ReutersAt Tesla's factory in Fremont, California, the automaker plans to make robots instead of its older cars, as it gears up to spend $20 billion this year to fund what it views as a business transformation.\"Forget the Tesla you knew,\" wrote analysts at Canaccord Genuity, in a note following Tesla's fourth-quarter earnings report. \"The Tesla of yesterday is gone. We believe Elon Musk has reached a definitive 'burn the ships' inflection point — a total commitment to a vision that leaves no room for retreat.\" The analysts recommend buying the stock. After capital expenditures dropped 24% last year to $8.6 billion, Tesla indicated on Wednesday that the figure will more than double in 2026 as the company shifts business away from electric vehicles, and further into artificial intelligence, with a focus on driverless technology, humanoid robots and, eventually, the chips that underpin these long-promised ambitions.Tesla shares dropped 3.5% to close at $417.89, bringing their January drop to more than 7%. Automotive revenue, which still accounts for about 70% of Tesla's business, declined 10% in 2025, as the company failed to offer new EV models and faced heightened competition across the globe, especially from China's BYD and Volkswagen and BMW in Europe. Total revenue at Tesla fell last year for the first time on record. watch nowOn the earnings call following the  report, Musk said the company is ending production of its Model S sedan and Model X SUVs, which combined made up less than 3% of the company's delivery volume last year, but helped Tesla make EVs mainstream.Musk said the lines that were producing those models in Fremont will be converted into a factory for building Optimus robots, which have yet to hit the market. The company has touted Optimus as a bipedal, intelligent robot that will someday be capable of everything from factory work to surgery and babysitting. He admitted that Optimus is still not in usage in Tesla factories in a \"material way.\"In 2024, Musk said Optimus could eventually make Tesla a $25 trillion company (the market cap sits at $1.4 trillion today) and last year said that 80% of Tesla's value will eventually come from the robots. Tesla didn't specify on this week's earnings call how much of the $20 billion in capex this year will be dedicated to Optimus. CFO Vaibhav Taneja said the money will go towards initiatives at six factories, including a refinery for making battery storage, as well as towards development of its driverless Cybercab, Semi electric truck and Optimus factory. \"On top of it, we'll also be spending money for building our AI compute infrastructure, and we'll continue investing in our existing factories to build more capacity and then also the related infrastructure to go along with it,\" Taneja said.  'Early stages of Optimus'While Musk said that the company is planning to spin up a production line for Optimus that can build a million units per year, he acknowledged that, \"we're still very much at the early stages of Optimus,\" and referred to it as a research and development project. \"We wouldn't expect to have any kind of significant Optimus production volume until probably end of this year,\" said Musk, who is notorious for missing self-imposed deadlines. In addition to its Optimus pursuits, Tesla plans to expand its Robotaxi ride-hailing fleet in the U.S., and is still working to to fulfill its decade-old promise to deliver a self-driving system that makes its cars safe to use without a human driver ready to steer or brake at any time.In 2025, Tesla launched a Robotaxi-branded ride-hailing app, and has been running a pilot service in Austin, Texas. Last week, Tesla executives said they had taken human safety supervisors out of a handful of cars in the Austin fleet to conduct driverless passenger rides. The company also started a service in the San Francisco area last year, but with a driver at the wheel. The company said in its investor deck on Wednesday that it plans to have coverage in seven additional U.S. markets in the first half of this year. Those cities are Dallas, Houston, Phoenix, Miami, Orlando, Tampa and Las Vegas.A Tesla Optimus robot hands out candy in front of the Nasdaq MarketSite in New York, US, on Monday, Oct. 27, 2025. Michael Nagle | Bloomberg | Getty ImagesIn addition to all the technical challenges and financial commitments involved with robots and driverless cars, Tesla faces hefty competition in both areas. Alphabet's Waymo is rapidly expanding its robotaxi service in the U.S., while Baidu's Apollo Go is growing in China. And in robots, Apptronik and Boston Dynamics are among the U.S. players, with companies like Unitree and Agibot in China.One other area where Musk said the company expects to spend big is in chips. He said key suppliers like Samsung, Taiwan Semiconductor Manufacturing Co. and Micron can't possibly produce enough hardware to satisfy Tesla's needs.\"In order to remove the constraint, the probable constraint in three or four years, we're going to have to build a Tesla TeraFab, a very big fab that includes logic, memory and packaging domestically,\" Musk said. \"And that's actually also going to be very important to ensure that we are protected against any geopolitical risks.\"He added that, \"We're going to be paranoid and make sure that we can continue to build batteries and robots and AI chips no matter what happens.\"The spending target for this year doesn't include any TeraFab plans, Taneja said. Nor does it account for Musk's vision to begin solar cell manufacturing in the U.S. Analysts at Barclays, who recommend holding Tesla's stock, wrote in a report on Thursday that while autos may still be the company's core business, the end of the Model S and X \"marks the symbolic baton pass\" into \"physical AI.\" \"In case it wasn't clear before, it's more than abundantly clear now that Tesla is not an auto company,\" the analysts wrote. WATCH: Why Elon Musk is pivoting Tesla away from autoswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elon Musk's $20 billion spending plan signals 'Tesla of yesterday is gone'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108168278-17518962972025-06-13t010710z_885255829_rc2gk1a9xltd_rtrmadp_0_space-warfare.jpeg?v=1753301789&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T23:01:47.000Z",
      "dateModified": "2026-01-29T23:01:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cramer says Microsoft and Meta's earnings offer a clear lesson: Don't give up on the tech giants",
    "url": "https://www.cnbc.com/2026/01/29/cramer-lesson-investors-microsoft-meta-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106459992-1585136831905gettyimages-961657400.jpeg?v=1769722542&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T23:48:48.000Z",
    "description": "watch nowCNBC's Jim Cramer on Thursday sees a crucial takeaway in the post-earnings swings for Microsoft and Meta Platforms stocks. His message to inv",
    "body": "watch nowCNBC's Jim Cramer on Thursday sees a crucial takeaway in the post-earnings swings for Microsoft and Meta Platforms stocks. His message to investors is simple: Do not give up on hyperscalers after a single quarter.Shares of Microsoft fell nearly 10% Thursday while Meta jumped roughly 10% after earnings reports from both tech giants Wednesday evening. In the case of Microsoft, investors were concerned after the software maker posted slowing cloud growth and management gave a weak response to questions about AI spending. Meanwhile, Wall Street cheered the Facebook parent as its AI investments showed that they were accelerating revenue growth, offsetting concerns about excessive spending.Cramer, in particular, praised Meta's advertising business, which made up 97% of overall revenue for the quarter. \"Leave it to [CEO] Mark Zuckerberg from Meta to say that AI has allowed his company to offer the greatest advertising vehicle in the world, aimed at his user base\" of 3.5 billion daily active users, Cramer said.It may be tempting for investors to now view Meta as the new winner in the heated AI arms race and dismiss Microsoft entirely in the race. But Cramer said that is a fool's errands as the market seemingly changes its tune each quarter. After all, Meta stock tumbled on its previous quarterly earnings report in October due in part to concerns about elevated spending on AI initiatives.Cramer also pointed to the huge turnaround in Alphabet's reception on Wall Street. The market was once concerned that ChatGPT creator OpenAI would threaten the Google parent's dominant search business, and that its own AI technology was inferior. However, positive news around Gemini, the large language models from Google, have been a boon for the stock in recent months. Additionally, Alphabet shares surged on its previous earnings report thanks to strong demand for artificial intelligence, which boosted the company's cloud business. \"I bet when we hear from them next week, we'll realize [they are] an AI search winner,\" Cramer said of Alphabet. When it comes to Nvidia, at least, the market should not change its tune quite as often as it does with the other tech giants, Cramer said. He argued the company has sustained a massive market share in the AI chip market that can't be beat.\"They aren't playing a game at all. They're running the game — they're the house. That's the best place to be,\" Cramer added.Disclosure: Cramer's Charitable Trust, the portfolio used by the CNBC Investing Club, owns shares of NVDA, GOOGL, META and MSFT.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cramer says Microsoft and Meta's earnings offer a clear lesson: Don't give up on the tech giants",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106459992-1585136831905gettyimages-961657400.jpeg?v=1769722542&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T23:48:48.000Z",
      "dateModified": "2026-01-29T23:48:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo will start offering rides to San Francisco airport",
    "url": "https://www.cnbc.com/2026/01/29/waymo-will-start-offering-rides-to-san-francisco-airport.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232734-17641870362025-11-26t195228z_944151862_rc2g4iaj6nfw_rtrmadp_0_waymo-robotaxi.jpeg?v=1764187076&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T19:40:36.000Z",
    "description": "Waymo driverless taxi parks in lower Manhattan in New York City, U.S., Nov. 26, 2025.  Brendan McDermid | ReutersWaymo is starting to take San Francis",
    "body": "Waymo driverless taxi parks in lower Manhattan in New York City, U.S., Nov. 26, 2025.  Brendan McDermid | ReutersWaymo is starting to take San Francisco passengers to the airport.The Alphabet-owned company said in a blog post Thursday that it is opening up San Francisco International Airport access to a select number of customers, and will gradually welcome all riders over the coming months. Pickups and drop-offs will initially take place at the airport's rental car center, and will eventually expand to additional locations like terminals. Waymo began driving passengers on freeways late last year, a necessary step to move into airport transportation. \"Serving rides to and from San Francisco International Airport delivers one of the most requested features for our riders and further deepens our relationship with the city,\" Waymo co-CEO Tekedra Mawakana said in a blog post. \"With millions traveling in for major events this year, we look forward to meeting the growing demand for reliable, fully autonomous rides.\"SFO marks Waymo's third major airport, as the company moves further into territory that's been dominated in recent years by Uber and Lyft. Waymo currently provides pickups and drop-offs at San Jose Mineta International Airport and Phoenix Sky Harbor International airport.WATCH: Waymo's year in reviewwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo will start offering rides to San Francisco airport",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232734-17641870362025-11-26t195228z_944151862_rc2g4iaj6nfw_rtrmadp_0_waymo-robotaxi.jpeg?v=1764187076&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T19:40:36.000Z",
      "dateModified": "2026-01-29T19:40:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Homan: ICE and CBP crafting 'drawdown plan' in Minnesota, admits 'improvements' needed",
    "url": "https://www.cnbc.com/2026/01/29/homan-trump-minnesota-ice-cbp-pretti.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108258873-1769693649602-gettyimages-2258854575-157a2039_yjrs6ynu.jpeg?v=1769699947&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T15:23:46.000Z",
    "description": "Border czar Tom Homan speaks during a news conference about ongoing immigration enforcement operations, in Minneapolis, Jan. 29, 2026.Scott Olson | Ge",
    "body": "Border czar Tom Homan speaks during a news conference about ongoing immigration enforcement operations, in Minneapolis, Jan. 29, 2026.Scott Olson | Getty ImagesU.S. border czar Tom Homan on Thursday said federal immigration enforcement agencies are working on a plan to reduce their massive presence in Minnesota, while broadly acknowledging problems with the Trump administration's activities there.\"I'm not here because the federal government has carried its mission out perfectly,\" Homan said at a press conference in Minneapolis, where an aggressive surge in federal deportation efforts has stoked major civil unrest.Homan said he and President Donald Trump, \"along with others in the administration, have recognized that certain improvements could and should be made.\"Trump on Monday sent Homan to Minneapolis to manage U.S. Immigration and Customs Enforcement's operations. The announcement came two days after federal agents killed a second U.S. citizen, Alex Pretti, in the city during altercations that were caught on camera.Homan on Thursday said he is in conversation with state and local officials, including Gov. Tim Walz and Minneapolis Mayor Jacob Frey.\"This is common sense cooperation that allows to draw down on the number of people we have here. Yes, I said it, draw down the number of people here,\" Homan said.ICE and the U.S. Customs and Border Protection agency are \"working on a drawdown plan,\" he said.Read more CNBC politics coverageMan poses as FBI agent to try to free Luigi Mangione from jail, source saysTrump backs Senate government funding deal that includes DHS extensionSenate Ag Committee advances Republican crypto billSenators closing in on funding federal government less than two days from shutdownWatch live: Trump holds Cabinet meeting at White HouseHoman: ICE and CBP crafting drawdown plan in Minnesota, says improvements neededDenmark lauds talks with U.S. over Greenland: 'Now we are back on track'Government shutdown: Republicans mull escape hatch as Congress careens toward deadline'ICE is not a law unto itself,' Minnesota judge says after immigrant releasedThis is developing news. Please check back for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Homan: ICE and CBP crafting 'drawdown plan' in Minnesota, admits 'improvements' needed",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108258873-1769693649602-gettyimages-2258854575-157a2039_yjrs6ynu.jpeg?v=1769699947&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T15:23:46.000Z",
      "dateModified": "2026-01-29T15:23:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump, two sons, Trump Org sue IRS, Treasury for $10 billion over tax records leak",
    "url": "https://www.cnbc.com/2026/01/29/trump-sues-irs-and-treasury-for-10-billion-over-leak-of-tax-records.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108259070-1769709435114-gettyimages-2258303879-AFP_94GN2H6.jpeg?v=1769709477&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-30T01:21:21.000Z",
    "description": "US President Donald Trump listens during a cabinet meeting in the Cabinet Room of the White House in Washington, DC, on Jan. 29, 2026. Brendan Smialow",
    "body": "US President Donald Trump listens during a cabinet meeting in the Cabinet Room of the White House in Washington, DC, on Jan. 29, 2026. Brendan Smialowski | AFP | Getty ImagesPresident Donald Trump, his two eldest sons, and his family business sued the Internal Revenue Service and the U.S. Treasury Department over alleged leaks of their confidential tax information, court records showed Thursday.The plaintiffs seek at least $10 billion in damages, according to the lawsuit in Miami federal court.The civil complaint alleges that the IRS and Treasury failed in their obligation to prevent the leak of those tax records by former IRS employee Charles \"Chaz\" Littlejohn in 2019 and 2020.In addition to Trump, the plaintiffs are his sons, Donald Trump Jr. and Eric Trump, and the Trump Organization, which the sons run.A spokesman for Trump's legal team told CNBC in a statement, \"The IRS wrongly allowed a rogue, politically-motivated employee to leak private and confidential information about President Trump, his family, and the Trump Organization to the New York Times, ProPublica and other left-wing news outlets, which was then illegally released to millions of people.\"\"President Trump continues to hold those who wrong America and Americans accountable,\" the spokesman said.The suit was filed three days after Treasury Secretary Scott Bessent said he had cancelled all of his department's contracts with the consulting firm Booz Allen Hamilton in connection with the company's contractor, Littlejohn, stealing and leaking confidential tax returns.Read more CNBC politics coverageMan poses as FBI agent to try to free Luigi Mangione from jail, source saysTrump backs Senate government funding deal that includes DHS extensionSenate Ag Committee advances Republican crypto billSenators closing in on funding federal government less than two days from shutdownWatch live: Trump holds Cabinet meeting at White HouseHoman: ICE and CBP crafting drawdown plan in Minnesota, says improvements neededDenmark lauds talks with U.S. over Greenland: 'Now we are back on track'Government shutdown: Republicans mull escape hatch as Congress careens toward deadline'ICE is not a law unto itself,' Minnesota judge says after immigrant releasedLittlejohn, 40, is serving a five-year prison sentence after having pleaded guilty in October 2023 to one count of disclosure of tax return information.He admitted to leaking Trump's tax records to The New York Times, and also admitted to leaking records about wealthy individuals to the news outlet ProPublica.The news lawsuit says that Littlejohn, in a 2024 deposition, admitted disclosing \"Trump information [that] included all businesses that he had owned\" to the investigative news outlet ProPublica.The suit asserts that ProPublica's subsequent reporting on Trump's tax documents falsely claimed that the records contained \"versions of fraud.\"While that quote does appear in ProPublica's October 2019 report, it comes from Nancy Wallace, a finance and real estate professor at the University of California-Berkeley's Haas School of Business.Wallace was one of a dozen real estate professionals interviewed by ProPublica who said they saw no clear explanation for \"multiple inconsistencies in the documents,\" according to the report.\"Defendants have caused Plaintiffs reputational and financial harm, public embarrassment, unfairly tarnished their business reputations, portrayed them in a false light, and negatively affected President Trump, and the other Plaintiffs' public standing,\" the lawsuit says.It's all but unheard of for a sitting president to sue their own administration, and the exorbitant damages figure being demanded raises various conflict-of-interest questions.But Trump has reportedly made similar moves in the recent past: The New York Times reported in October that Trump sought $230 million from the Department of Justice as compensation for its past investigations into him.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump, two sons, Trump Org sue IRS, Treasury for $10 billion over tax records leak",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108259070-1769709435114-gettyimages-2258303879-AFP_94GN2H6.jpeg?v=1769709477&w=1920&h=1080"
      ],
      "datePublished": "2026-01-30T01:21:21.000Z",
      "dateModified": "2026-01-30T01:21:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "York Space starts trading at $38 per share as CEO touts 'Golden Dome' potential",
    "url": "https://www.cnbc.com/2026/01/29/york-space-stock-trading-trump-golden-dome.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108259112-17697126682026-01-29t183135z_1156165125_rc22bjaz25in_rtrmadp_0_york-space-ipo.jpeg?v=1769712688&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T21:09:38.000Z",
    "description": "watch nowYork Space Systems began trading as a public company on Thursday, with founder and CEO Dirk Wallinger touting the company's potential to be a",
    "body": "watch nowYork Space Systems began trading as a public company on Thursday, with founder and CEO Dirk Wallinger touting the company's potential to be a key contributor to President Trump's 'Golden Dome' project.The Denver-based space company opened on the New York Stock Exchange at $38, up 11.7% from its $34 offering price. It was valued at $4.75 billion. The stock closed at $33.61, down 1.15%.\"Golden Dome is essentially making disparate systems that weren't intended to talk to one another, talk to one another, which is what we do,\" Wallinger told CNBC's Morgan Brennan. \"York's already delivering on that, so we're looking for the opportunity to deliver on the Golden Dome for our country.\"York has already built low-earth orbit satellites for the U.S. Space Development Agency, launching 21 craft as part of a September launch.Space technology has steadily been gaining momentum in 2025 and looks set for a big 2026. The sector saw several IPOs last year, including Firefly Aerospace, Voyager Technologies and Karman Holdings.Read more CNBC tech newsA Waymo hit a child near an elementary school. The NHTSA is investigatingMeta soars after proving AI spend while Microsoft cloud disappointsApple acquires Israeli startup Q.aiTesla sold $430 million worth of its Megapack backup batteries to Musk's xAI in 2025The industry has also seen a boost from Trump's renewed interest in upgrading military technology and bringing astronauts back to the moon after more than half a century. SpaceX's expected IPO this year is poised to be the largest ever.Wallinger said SpaceX going public will be great for everyone in the sector.\"I think there's a lot of excitement in the market for defense tech and space,\" Wallinger said.York Space Systems has done 74 missions to space since its founding in 2012. The company currently works with the U.S. Department of Defense, and entered a contract with the U.S. Space Development Agency in 2022.Trump announced plans for a $175 billion 'Golden Dome' missile defense system in May. According to the Congressional Budget Office, the project could cost up to $831 billion.\"Historically, people kind of view us solely as a spacecraft manufacturer, but we're really a complete, holistic solution,\" Wallinger said. \"And that kind of turnkey solution is really what national defense needs.\"watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "York Space starts trading at $38 per share as CEO touts 'Golden Dome' potential",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108259112-17697126682026-01-29t183135z_1156165125_rc22bjaz25in_rtrmadp_0_york-space-ipo.jpeg?v=1769712688&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T21:09:38.000Z",
      "dateModified": "2026-01-29T21:09:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "American Airlines to fly to Venezuela for first time since 2019, marking return of U.S. service",
    "url": "https://www.cnbc.com/2026/01/29/american-airlines-return-service-venezuela.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108216865-1761345842885-gettyimages-2242735040-tivony-american251024_np5Jg.jpeg?v=1761345909&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T19:39:30.000Z",
    "description": "An American Airlines airplane arrives at Fort Lauderdale-Hollywood International Airport in Fort Lauderdale, Florida. Ronen Tivony | Nurphoto | Getty ",
    "body": "An American Airlines airplane arrives at Fort Lauderdale-Hollywood International Airport in Fort Lauderdale, Florida. Ronen Tivony | Nurphoto | Getty ImagesAmerican Airlines is planning to resume service to Venezuela from the United States for the first time since 2019, weeks after the U.S. captured Venezuela's president.American would be the first U.S. carrier to restart service to Venezuela, which had become isolated after airlines paused flights to the country in recent years, citing unrest there.\"American will share additional details about its return to service in the coming months as it works closely with federal authorities on all necessary permissions and security assessments prior to resuming service,\" the carrier said Thursday.American halted service to Venezuela in March 2019 after its pilots' union told its members to refuse trips to the country following the State Department advising U.S. citizens to leave the country and pulling its diplomats from Venezuela because of unrest.Delta Air Lines and United Airlines, which had paused service in 2017, didn't immediately comment.Federal officials temporarily closed airspace in the Caribbean earlier this month following the U.S. strikes in Venezuela, a measure that disrupted air travel and forced carriers to cancel hundreds of flights at the tail end of the holidays.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "American Airlines to fly to Venezuela for first time since 2019, marking return of U.S. service",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108216865-1761345842885-gettyimages-2242735040-tivony-american251024_np5Jg.jpeg?v=1761345909&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T19:39:30.000Z",
      "dateModified": "2026-01-29T19:39:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump backs Senate government funding deal that includes DHS extension",
    "url": "https://www.cnbc.com/2026/01/29/trump-congress-government-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108259280-1769726678669-gettyimages-2258941012-sc1_0405_n85ckcua.jpeg?v=1769726726&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-30T02:50:28.000Z",
    "description": "watch nowPresident Donald Trump on Thursday endorsed a Senate deal to fund the vast majority of the federal government through the remainder of the fi",
    "body": "watch nowPresident Donald Trump on Thursday endorsed a Senate deal to fund the vast majority of the federal government through the remainder of the fiscal year.Trump's endorsement is likely to significantly ease the passage of a six-bill funding package the Senate is considering with just over a day until a partial government shutdown. Senators clinched a deal shortly before Trump's announcement, agreeing to strip funding for the Department of Homeland Security from the package and pass the other five bills, while DHS will be funded by a stopgap.\"Republicans and Democrats in Congress have come together to get the vast majority of the Government funded until September, while at the same time providing an extension to the Department of Homeland Security (including the very important Coast Guard, which we are expanding and rebuilding like never before),\" Trump said in a Truth Social post. \"Hopefully, both Republicans and Democrats will give a very much needed Bipartisan 'YES' Vote,\" he said. The Senate is expected to begin taking up the revised bill Thursday night, which would fund the Departments of Defense, Treasury, State, Health and Human Services, Labor, Housing and Urban Development, Transportation, and Education. Democrats demanded to strip the DHS portion of the bill after two U.S. citizens were shot and killed by federal immigration agents in Minnesota this month. Read more CNBC politics coverageMan poses as FBI agent to try to free Luigi Mangione from jail, source saysTrump backs Senate government funding deal that includes DHS extensionSenate Ag Committee advances Republican crypto billSenators closing in on funding federal government less than two days from shutdownWatch live: Trump holds Cabinet meeting at White HouseHoman: ICE and CBP crafting drawdown plan in Minnesota, says improvements neededDenmark lauds talks with U.S. over Greenland: 'Now we are back on track'Government shutdown: Republicans mull escape hatch as Congress careens toward deadline'ICE is not a law unto itself,' Minnesota judge says after immigrant releasedSenate Democratic Leader Chuck Schumer's, D-N.Y., office said shortly before Trump's announcement that a deal had been reached to split the DHS portion from the rest of the bill. Schumer's office said the stopgap for DHS would provide funding for two weeks. The Senate's move to break off the DHS bill from the broader package assures that the House will need to reapprove the package. The House is out on recess with plans to return next week, meaning a government shutdown could still occur over the weekend. A government shutdown last year stretched for a record 43 days. House Speaker Mike Johnson told MS NOW earlier Thursday that he is \"trying to figure all that out\" and wants members to return to Washington \"as soon as possible.\" Johnson cautioned it could take up to 72 hours for all members to return to Washington. The Senate is now \"hotlining\" the proposal, a process to ensure it has unanimous support in the upper chamber. Senate Majority Leader John Thune, R-S.D., will likely need unanimous support to speed passage of the bill with the shutdown deadline looming at 12:01 a.m. Saturday. Senate Republicans began to close in on the deal after a procedural vote on the full six-bill package failed earlier in the day. Seven Republicans joined all Democrats in opposing the measure, underscoring how badly Republicans would need Democrats to overcome the Senate's 60-vote filibuster.Republican senators earlier Thursday said Senate Democrats were negotiating with the White House directly on a deal. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump backs Senate government funding deal that includes DHS extension",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108259280-1769726678669-gettyimages-2258941012-sc1_0405_n85ckcua.jpeg?v=1769726726&w=1920&h=1080"
      ],
      "datePublished": "2026-01-30T02:50:28.000Z",
      "dateModified": "2026-01-30T02:50:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump reportedly says 'very dangerous' for UK to do business with China as Starmer seeks diplomatic reset",
    "url": "https://www.cnbc.com/2026/01/30/trump-china-uk-starmer-visit-xi-canada-carney.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108254684-1768965252681-gettyimages-2240467882-AFP_78MT3V6.jpeg?v=1769735662&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-30T04:28:52.000Z",
    "description": "US President Donald Trump greets Britain's Prime Minister Keir Starmer during a summit on Gaza, Egypt, in Sharm el-Sheikh on Oct. 13, 2025. Evan Vucci",
    "body": "US President Donald Trump greets Britain's Prime Minister Keir Starmer during a summit on Gaza, Egypt, in Sharm el-Sheikh on Oct. 13, 2025. Evan Vucci | Afp | Getty ImagesU.S. President Donald Trump on Thursday reportedly warned the U.K. that it would be \"very dangerous\" for the country to do business with China, after London and Beijing announced steps aimed at mending ties. After years of strained relations, China and the U.K. are looking to develop a long-term strategic partnership following a high-stakes meeting between Chinese President Xi Jinping and British Prime Minister Keir Starmer.Starmer is on a 4-day visit to China, the first trip by a British prime minister in eight years, signaling an attempt at resetting bilateral ties.On the sidelines of premiere of the \"Melania\" film at the Kennedy Center, Trump was asked to comment on Starmer's efforts to get into business with China, and he said that \"it's very dangerous for them to do that,\" Reuters reported. China on Thursday agreed to halve its import tariffs on British whisky to 5% from 10% and confirmed visa-free travels for British nationals visiting China for under 30 days, according to Downing Street. Meanwhile, British drugmaker AstraZeneca will invest $15 billion in China through 2030 to expand medicines manufacturing and research and development in the country. Starmer has brought a delegation of nearly 60 British business executives and organization leaders on this trip. He hailed the agreements on visa-free travel and lowering whisky tariffs as \"really important access, symbolic of what we're doing with the relationship. U.K.'s diplomatic shift appears to mirror that of Canada which signed a trade agreement with China earlier this month following a visit by Prime Minister Mark Carney, as Ottawa appears to diversify trade and investment partners amid persistent frictions with Washington. On Canada, Trump said that \"it's even more dangerous for Canada to get into business with China. Canada is not doing well ... You can't look at China as the answer,\" Reuters reported. \"President Xi is a friend of mine, I know him very well ... The first thing they're going to do is say you're not allowed to play ice hockey anymore. Canada's not going to like that,\" Trump said. Trump has threatened to impose a 100% tariff on Canadian goods if Ottawa moved forward with a trade deal with China, in a sharp reversal from his previous comments that such a deal could be \"a good thing.\" watch nowBefore his trip to Beijing, Starmer said in an interview with Bloomberg that Britain would not have to choose between the U.S. and China, saying that the country can continue to strengthen economic ties with Beijing without angering Trump or harming relations with the U.S.  \"We've got very close relations with the US — of course, we want to — and we will maintain that business, alongside security and defense,\" he said. \"Starmer is wary of alienating Washington. But the U.K.'s squeezed position between the two superpowers is structural, not a quirk of the Trump administration,\" said Gabriel Wildau, managing director at political consultancy Teoneo. Optionality, rather than a full resetWildau suggested a broad U.K.-China trade deal is unlikely as Starmer is pursuing a \"re-balancing\" of the country's foreign relations, rather than a structural reset with China that may attract \"unwanted attention\" from Western allies.  The same diplomatic posturing applies to other \"middle power\" leaders who have visited China in recent months, he added. watch nowA flurry of Western leaders, unsettled by Trump's unpredictable foreign policy and \"America First\" agenda, have been weighing closer ties with Beijing — even at the risk of provoking Trump.Since November, Beijing has hosted French President Emmanual Macron, South Korean President Lee Jae Myung, Finnish Prime Minister Petteri Orpo, German Finance Minister Lars Klingbeil and Irish Taoiseach Micheal Martin — the first visit by an Irish leader in 14 years. \"Rather than realignment, these governments are seeking optionality by creating issue-specific coalitions with China and each other to reduce dependence on the U.S.,\" Wildau noted. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump reportedly says 'very dangerous' for UK to do business with China as Starmer seeks diplomatic reset",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108254684-1768965252681-gettyimages-2240467882-AFP_78MT3V6.jpeg?v=1769735662&w=1920&h=1080"
      ],
      "datePublished": "2026-01-30T04:28:52.000Z",
      "dateModified": "2026-01-30T04:28:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple sales surge 16% on ‘staggering’ iPhone demand ",
    "url": "https://www.cnbc.com/2026/01/29/apple-aapl-earnings-report-q1-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257566-1769524908735-gettyimages-2256932535-AFP_93L849E.jpeg?v=1769524931&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-30T00:36:51.000Z",
    "description": "Apple CEO Tim Cook gestures as he departs after a business leaders reception with the US President on the sidelines of the World Economic Forum (WEF) ",
    "body": "Apple CEO Tim Cook gestures as he departs after a business leaders reception with the US President on the sidelines of the World Economic Forum (WEF) annual meeting in Davos on January 21, 2026. Fabrice Coffrini | Afp | Getty ImagesApple reported fiscal first-quarter earnings on Thursday that surpassed expectations, with revenue soaring 16% on an annual basis.  Shares of the company were up more than 1% in extended trading. Here are the results versus what Wall Street was expecting, according to LSEG consensus estimates for the quarter ending in December: EPS: $2.84 vs. $2.67 estimated Revenue: $143.76 billion vs. $138.48 billion estimated Here is how Apple performed versus LSEG consensus estimates:  iPhone revenue: $85.27 billion vs. $78.65 billion estimatedMac revenue: $8.39 billion vs. $8.95 billion estimated iPad revenue: $8.60 billion vs. $8.13 billion estimated Wearables, Home and Accessories revenue: $11.49 billion vs. $12.04 billion estimated Services revenue: $30.01 billion vs. $30.07 billion estimatedGross margin: 48.2% vs. 47.5% estimated Finance chief Kevan Parekh said that Apple expects revenue this quarter to rise between 13% and 16% on an annual basis, which would be equivalent to between $107.8 billion and $110.66 billion. Analysts polled by LSEG were expecting $104.84 billion. Apple said it expects constrained iPhone supply during the period. Apple also said it expects its Services unit to have a year-over-year growth rate similar to the 14% in the December quarter. The company reported $42.1 billion in net income, or $2.84 per share, versus $36.33 billion, or $2.40 per  share, in the year-ago period.  Overall iPhone revenue surged 23% on an annual basis to $85.27 billion, which the company attributed to strong sales of the iPhone 17 models released in September.  \"The demand for iPhone was just simply staggering,\" Apple CEO Tim Cook told CNBC's Steve Kovach. The strong growth is a reversal from the holiday quarter last year, when Apple reported iPhone sales that declined slightly. Cook said Apple now has an active base of 2.5 billion iPhones, Macs and other Apple devices, up from 2.35 billion announced in January last year. That number is closely watched because it points to the addressable market for Apple services, as well as for software on the company's platforms.  Apple saw particularly strong results in China, including Taiwan and Hong Kong. Sales in the region surged 38% during the quarter to $25.53 billion. Cook said that the performance in the region was driven by iPhone sales.  \"We set an all-time record for upgraders in mainland China, and we saw double-digit growth on switchers,\" Cook said. Upgraders refers to current iPhone users who bought newer models, and switchers means new customers who previously had phones from different brands.  In China, Apple \"saw a lift that, frankly, was much greater than we thought we would see,\" Cook said, adding that it was \"product-driven.\" Apple's sales of Mac laptops came up short of Wall Street expectations, and fell 7% on an annual basis. The company released an updated MacBook Pro laptop with a new M4 chip in November.The iPad business grew 6% in the quarter on an annual basis to $8.6 billion in revenue, beating expectations. Cook said that half of the people who bought an iPad during the quarter had not previously owned one.  The company reports AirPods, Apple Watch, Vision Pro and other accessories in a category called Wearables, Home and Accessories. Those sales fell 2% on an annual basis and missed Wall Street estimates.  Apple's services business includes subscriptions such as Apple TV and iCloud as well as advertising revenue from licensing agreements with Google, AppleCare warranties and other offerings. It grew 14% on an annual basis to $26.34 billion in sales. Cook said Apple TV's viewership rose 36% in December from a year ago.Earlier this month, the company announced it would partner with Google to use its Gemini AI model to power Apple Intelligence software. Apple has spent much less on artificial intelligence technology than its peers, such as Meta and Microsoft, which have committed to spending hundreds of billions on AI infrastructure.  \"We have absolutely the best platforms in the world for AI,\" Cook said.  Apple recorded $2.37 billion in capital expenditures for the quarter, down from $2.94 billion in the same period last year. But research and development expenses increased to $10.89 billion from $8.27 billion in the year-ago period.  \"AI is going to require incremental investment on top of our normal product road map investment,\" Parekh said. All of Apple's devices, including the iPhone, Mac and iPad, use a lot of storage and memory, raising questions about how the company plans to handle increased component costs as memory prices around the world are surging because of an AI-related shortage.  \"We're in a supply chain mode to meet the very high levels of customer demand we're currently constrained,\" Cook said. \"At this point, it's difficult to predict when supply and demand will balance.\"Cook added that one of the constraints was with the advanced chip manufacturing needed for Apple's processors. He also said that memory prices had a minimal impact during the quarter, but the company expects a bigger effect during the current period \"We do continue to see market pricing for memory increasing significantly,\" Cook said. Parekh said that Apple spent nearly $32 billion in the quarter on share repurchases and dividends. WATCH: Apple told us all about its new iPhone chips and on-device AI plans ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple sales surge 16% on ‘staggering’ iPhone demand ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257566-1769524908735-gettyimages-2256932535-AFP_93L849E.jpeg?v=1769524931&w=1920&h=1080"
      ],
      "datePublished": "2026-01-30T00:36:51.000Z",
      "dateModified": "2026-01-30T00:36:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man poses as FBI agent to try to free Luigi Mangione from jail, source says",
    "url": "https://www.cnbc.com/2026/01/29/luigi-mangione-fbi-jail-murder-mark-anderson.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235228-17646905942025-12-02t151708z_42277952_rc2e8iac9dq4_rtrmadp_0_unitedhealth-ceo-mangione.jpeg?v=1769722936&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T22:45:56.000Z",
    "description": "Luigi Mangione appears in Manhattan Supreme Court for a suppression of evidence hearing in the killing of United Healthcare CEO Brian Thompson, Dec. 2",
    "body": "Luigi Mangione appears in Manhattan Supreme Court for a suppression of evidence hearing in the killing of United Healthcare CEO Brian Thompson, Dec. 2, 2025.Curtis Means | Via ReutersA Minnesota man was arrested after allegedly showing up Wednesday night at a New York federal jail claiming to be an FBI agent and saying he had a court order from a judge to release an inmate, according to a new criminal complaint Thursday. That inmate is Luigi Mangione, according to a person in law enforcement, who asked not to be named because they were not authorized to speak publicly on the matter.Mangione is accused of murdering UnitedHealthcare CEO Brian Thompson on a midtown Manhattan street in December 2024.The Minnesota man, 36-year-old Mark Anderson of Mankato, when asked by Bureau of Prisons personnel at the Metropolitan Detention Center in Brooklyn for his credentials, produced a Minnesota driver's license, prosecutors said. Mangione is being held at that jail without bail.Anderson also allegedly said he had weapons in a bag he was carrying. Inside the bag was a barbecue fork and a circular steel blade that resembled a pizza cutter, according to the criminal complaint filed by the U.S. Attorney's Office in Brooklyn.\"Anderson also displayed and threw at the BOP officers numerous documents,\" an FBI agent who signed the complaint wrote. \"I have reviewed those papers and they appear to be related to filing of claims against the United States Department of Justice,\" the agent wrote.A barbecue fork, driver's license and circular steel blade allegedly found in the possession of Mark Anderson of Mankato, Minnesota, when he was detained after allegedly posing as an FBI agent at the Metropolitan Detention Center in New York on Jan. 28, 2026.U.S. District Court for the Eastern District of New YorkAnderson is being charged with impersonating an FBI agent and is scheduled to appear Thursday afternoon in Brooklyn federal court, where he is charged in a complaint.The complaint does not identify by name the inmate that Anderson allegedly hoped to free. But the person in law enforcement confirmed that it was the 27-year-old Mangione.Anderson had traveled to New York City for a job opportunity that did not work out and had been working in a pizzeria, according to that person.Read more CNBC politics coverageMan poses as FBI agent to try to free Luigi Mangione from jail, source saysTrump backs Senate government funding deal that includes DHS extensionSenate Ag Committee advances Republican crypto billSenators closing in on funding federal government less than two days from shutdownWatch live: Trump holds Cabinet meeting at White HouseHoman: ICE and CBP crafting drawdown plan in Minnesota, says improvements neededDenmark lauds talks with U.S. over Greenland: 'Now we are back on track'Government shutdown: Republicans mull escape hatch as Congress careens toward deadline'ICE is not a law unto itself,' Minnesota judge says after immigrant releasedHis arrest came hours after state prosecutors in Manhattan Supreme Court urged a judge there to set Mangione's murder trial for July. That is two months before jury selection is set to begin in the Manhattan federal court case where Mangione is also charged with multiple crimes related to killing Thompson, a Minnesota resident whose company is the largest private health insurer in the United States.Prosecutors alleged that Mangione stalked and then fatally shot Thompson on the morning of Dec. 4, 2024, as the CEO was walking into a midtown Manhattan hotel for an investors' event held by UnitedHealth Group, the parent of UnitedHealthcare.Mangione was arrested at a McDonald's in Altoona, Pennsylvania, five days after the slaying.He has pleaded not guilty in both cases.Federal prosecutors are seeking to impose the death penalty on Mangione if he is convicted in their case. The judge in that case could rule this week on whether Mangione will face a possible death sentence.Correction: This story was updated to reflect that the new criminal complaint did not name the inmate Anderson allegedly attempted to free from the jail.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man poses as FBI agent to try to free Luigi Mangione from jail, source says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235228-17646905942025-12-02t151708z_42277952_rc2e8iac9dq4_rtrmadp_0_unitedhealth-ceo-mangione.jpeg?v=1769722936&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T22:45:56.000Z",
      "dateModified": "2026-01-29T22:45:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tesla sold $430 million worth of its Megapack backup batteries to Musk's xAI in 2025",
    "url": "https://www.cnbc.com/2026/01/29/tesla-sold-430-million-worth-of-its-megapack-batteries-to-xai-in-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107271049-1689253884016-gettyimages-1529573362-arriens-elonmusk230713_np8Mm.jpeg?v=1689254018&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T19:52:49.000Z",
    "description": "Elon Musk announced his new company xAI which he says has the goal to understand the true nature of the universe. Jaap Arriens | Nurphoto | Getty Imag",
    "body": "Elon Musk announced his new company xAI which he says has the goal to understand the true nature of the universe. Jaap Arriens | Nurphoto | Getty ImagesTesla sold $430 million worth of its giant backup batteries called Megapacks to xAI, Elon Musk's artificial intelligence startup, in 2025, according to a filing on Thursday. The sales to xAI accounted for around 3.4% of Tesla's energy business revenue, which climbed 27% to $12.8 billion last year from $10.1 billion in 2024, the filing said. Tesla's energy division, which sells solar photovoltaics and battery storage systems of various sizes, was a bright spot for the company, as auto revenue dropped 10% to $69.5 billion, weighed down by a tarnished brand reputation and an aging lineup. Because autos remain Tesla's predominant source of revenue, total sales fell roughly 3% for the year, declining for the first time on record. Musk first incorporated xAI in March 2023, and revealed its existence publicly four months later,  describing it as a politically incorrect competitor to OpenAI. Musk co-founded OpenAI as an AI lab in 2015, and left in 2018, years before the company released ChatGPT. The two sides are now involved in heated litigation, with a trial expected to begin in April. In its fourth-quarter earnings release on Wednesday, Tesla said it was investing $2 billion in xAI as part of the startup's latest round of funding. Tesla's investment came after the announcement of a number of investigations across the globe into xAI's Grok chatbot and image generator, which enabled the widespread nonconsensual creation and distribution of explicit deepfake images Earlier this month, xAI said that it raised $20 billion in its recent funding round from a number of investors, including Nvidia and Cisco. Reuters reported on Thursday that SpaceX is weighing a merger with xAI ahead of a planned IPO for Musk's aerospace and defense companyXAI previously announced it was using Tesla Megapacks to help power its data infrastructure in and around Memphis, Tennessee, home to its data center called Colossus. Megapacks are used for business and utility-scale developments, and Tesla's newer Megablocks are a combination of four Megapacks around one transformer. The systems use lithium-ion or other battery cells, helping data centers and utilities avoid blackouts, allowing for energy storage from sources like solar and wind. In 2025, xAI installed and was using 35 natural gas-burning turbines to power operations at the Colossus facility, according to aerial video obtained by the Southern Environmental Law Center. Emissions from the turbines led to community uproar, with residents complaining of a stench, health problems and an inability to keep their windows open at home. The Environmental Protection Agency recently updated a rule concerning the use of such turbines, making clear that they are not exempt from the need for Clean Air Act permits.In a lawsuit that's pending in Delaware, Musk has been accused of violating his fiduciary duty to Tesla shareholders by diverting the automaker's resources to xAI.WATCH: Musk's xAI closes $20 billion funding roundwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tesla sold $430 million worth of its Megapack backup batteries to Musk's xAI in 2025",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107271049-1689253884016-gettyimages-1529573362-arriens-elonmusk230713_np8Mm.jpeg?v=1689254018&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T19:52:49.000Z",
      "dateModified": "2026-01-29T19:52:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft lost $357 billion in market cap as stock plunged most since 2020",
    "url": "https://www.cnbc.com/2026/01/29/microsoft-market-cap-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108259054-1769708668197-gettyimages-2256635191-AFP_93BN87M.jpeg?v=1769708712&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T21:41:49.000Z",
    "description": "Microsoft CEO Satya Nadella gestures as he speaks during the World Economic Forum meeting in Davos, Switzerland, on Jan. 20, 2026.Fabrice Coffrini | A",
    "body": "Microsoft CEO Satya Nadella gestures as he speaks during the World Economic Forum meeting in Davos, Switzerland, on Jan. 20, 2026.Fabrice Coffrini | Afp | Getty ImagesMicrosoft shares slid about 10% on Thursday following an earnings report that disappointed some investors, prompting the stock's sharpest daily decline since March 2020. The move trimmed the technology company's market cap by $357 billion, leaving it at $3.22 trillion by the end of Thursday trading.The iShares Expanded Tech-Software Sector exchange-traded fund tumbled 5% on Thursday, while the technology-heavy Nasdaq Composite index finished the day down 0.7%. Not all of technology went down, though. Meta shares spiked 10% after impressing analysts with robust results and quarterly revenue guidance on Wednesday.Investors found a few imperfections in Microsoft's report. The all-important growth statistic for Azure and other cloud services came in at 39%, below StreetAccount's 39.4% consensus. The company called for about $12.6 billion in fiscal third-quarter revenue from the More Personal Computing segment that includes Windows, lower than StreetAccount's $13.7 billion consensus, and the implied operating margin for the new quarter also came up short.Microsoft's finance chief, Amy Hood, argued that the cloud result could have been higher if it had allocated more data center infrastructure to customers rather than prioritizing its in-house needs.\"If I had taken the GPUs that just came online in Q1 and Q2 in terms of GPUs and allocated them all to Azure, the KPI would have been over 40,\" she said.Read more CNBC tech newsA Waymo hit a child near an elementary school. The NHTSA is investigatingMeta soars after proving AI spend while Microsoft cloud disappointsApple acquires Israeli startup Q.aiTesla sold $430 million worth of its Megapack backup batteries to Musk's xAI in 2025Analyst Ben Reitzes of Melius Research, with a buy rating on Microsoft stock, said during CNBC's \"Squawk on the Street\" on Thursday that Microsoft should double down on data center construction.\"I think that there's an execution issue here with Azure, where they need to literally stand up buildings a little faster,\" he said. Analysts at UBS led by Karl Keirstead questioned Microsoft's choice to secure artificial intelligence computing capacity for products such as the Microsoft 365 Copilot productivity software add-on that has yet to succeed as much as OpenAI's ChatGPT.\"M365 revs growth is not accelerating due to Copilot, many checks on Copilot don't suggest a strong usage ramp (we plan to refresh our own checks in case we've missed a usage ramp) and the model market appears crowded and capital-intensive,\" the UBS analysts wrote. \"We think Microsoft needs to 'prove' that these are good investments.\"The negativity wasn't universal across Wall Street. Bernstein analysts led by Mark Moerdler, with the equivalent of a buy rating on Microsoft shares, applauded Microsoft's decision-making.\"Investors need, we believe, to understand that management made a cognizant decision to focus on what is best for the company long term rather than driving the stock up this quarter or even over last quarter and a few quarters to come (as capacity constraints likely abate),\" the analysts wrote in a Thursday note.Hood called for capital expenditures to decline slightly in the current quarter.WATCH: 'AI is eating software', says Melius' Ben Reitzeswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft lost $357 billion in market cap as stock plunged most since 2020",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108259054-1769708668197-gettyimages-2256635191-AFP_93BN87M.jpeg?v=1769708712&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T21:41:49.000Z",
      "dateModified": "2026-01-29T21:41:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trade deficit soared 94% in November and was higher than a year ago, despite tariff efforts",
    "url": "https://www.cnbc.com/2026/01/29/trade-balance-soared-94percent-in-november-and-was-higher-than-a-year-ago-despite-tariff-efforts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219319-17618308642025-10-30t052155z_1516779497_rc22mha87yc7_rtrmadp_0_usa-china-shenzhen.jpeg?v=1761830893&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T21:31:45.000Z",
    "description": "A boat moves past a cargo ship with containers at a terminal of the Yantian port in Shenzhen, Guangdong province, China October 30, 2025. Tingshu Wang",
    "body": "A boat moves past a cargo ship with containers at a terminal of the Yantian port in Shenzhen, Guangdong province, China October 30, 2025. Tingshu Wang | ReutersThe U.S. deficit with its global trading partners nearly doubled in November as the shortfall with the European Union swelled and the impact of President Donald Trump's tariffs worked their way through the economy, the Census Bureau reported Thursday.Following a month where the trade deficit hit its lowest level since early 2009, it shot up to $56.8 billion, an increase of 94.6% from October. Of that gain, about one-third came with the European Union, where the goods deficit rose by $8.2 billion. The goods deficit with China decreased by about $1 billion to $13.9 billion.On a year-over-year basis, the deficit through November stood at $839.5 billion, or about 4% higher than the same period in 2024.The increase in the deficit counters Trump's efforts to use tariffs to reduce imbalances around the globe. When announcing so-called reciprocal tariffs in April 2025, the White House used the level of trade deficits with varying countries as a baseline for determining the duties.As the year went by, Trump softened his stance. A framework agreement between the U.S. and the EU in August put the tariff rate at 15% on most European goods and sought to stabilize relations between the two sides.Clarification: The headline on this story was updated to clarify that it was the trade deficit that soared 94% in November.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trade deficit soared 94% in November and was higher than a year ago, despite tariff efforts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219319-17618308642025-10-30t052155z_1516779497_rc22mha87yc7_rtrmadp_0_usa-china-shenzhen.jpeg?v=1761830893&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T21:31:45.000Z",
      "dateModified": "2026-01-29T21:31:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]