[
  {
    "title": "Japan inflation falls below BOJ's 2% target for first time since March 2022",
    "url": "https://www.cnbc.com/2026/02/20/japan-core-inflation-january-boj-target-gdp-growth.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108133154-1744867915503-gettyimages-2200123617-AFP_36Y84TQ.jpeg?v=1744867928&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-20T02:28:50.000Z",
    "description": "Shop owners of a 70-year-old \"takoyaki\", or octopus balls, restaurant chat while cooking along a street in the Taito Ward area of Tokyo on February 21",
    "body": "Shop owners of a 70-year-old \"takoyaki\", or octopus balls, restaurant chat while cooking along a street in the Taito Ward area of Tokyo on February 21, 2025.Richard A. Brooks | Afp | Getty ImagesJapan's headline inflation rate fell to 1.5% in January, its lowest level since March 2022. The reading ended a run of 45 straight months in which inflation had remained above the Bank of Japan's 2% target.Core inflation rate, which excludes fresh food prices, eased to 2%, the lowest level since January 2024 and matching the 2% forecast by economists polled by Reuters. It was down from 2.4% in December.The so-called \"core-core\" inflation — excluding prices of fresh food and energy — came in at 2.6%, compared with 2.9% in December.The slowdown was driven by declines in fresh food, raw meat and fresh flower prices, as well as a sharper drop in petroleum products.Goods inflation fell to 1.6% from 2.7%, its lowest level since August 2021, while services inflation held steady at 1.4%.In January, the Bank of Japan upgraded its inflation forecasts for fiscal 2026, which begins April 1. It projected core inflation at 1.9% and \"core-core\" inflation at 2.2%, up from 1.8% and 2%, respectively, in its October 2025 outlook.The BOJ also wrote in its outlook that the year-over-year rise in consumer prices is likely to fall below 2% in the first half of 2026, as food prices stabilize and government efforts to ease living costs.Rice inflation slowed for an eighth straight month to 27.9%.Among those measures is an election pledge by Prime Minister Sanae Takaichi to suspend an 8% food tax for two years.Takaichi swept to a landslide victory in the Feb. 8 Lower House election, with the ruling Liberal Democratic Party winning 316 seats, the strongest showing by a single party since the end of World War II.The inflation reading comes after Japan's economy grew 0.1% in the fourth quarter on Monday, narrowly avoiding a technical recession.Despite the slowdown in headline inflation, the Bank of Japan is unlikely to delay rate hikes, according to Norihiro Yamaguchi, lead Japan economist at Oxford Economics. He said fresh-food prices remain volatile, while energy costs fell after Japan scrapped its fuel tax in December. As a result, the core-core index, which excludes fresh foods and energy, provides a clearer gauge of underlying price pressures, easing only gradually to 2.6% from 2.9%. Yamaguchi expects the BOJ to raise rates to 1% at its June meeting, after assessing spring wage negotiation data.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan inflation falls below BOJ's 2% target for first time since March 2022",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108133154-1744867915503-gettyimages-2200123617-AFP_36Y84TQ.jpeg?v=1744867928&w=1920&h=1080"
      ],
      "datePublished": "2026-02-20T02:28:50.000Z",
      "dateModified": "2026-02-20T02:28:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bath & Body Works starts selling on Amazon as more brands embrace its logistics network",
    "url": "https://www.cnbc.com/2026/02/20/bath-body-works-amazon-brands-embrace-logistics-network.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108267311-1771509308286-ProductAssortment.jpg?v=1771509344&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-20T11:30:02.000Z",
    "description": "An assortment of Bath & Body Works products.Courtesy of Bath & Body WorksBath & Body Works Champagne Toast body wash, with no minimum shipping thresho",
    "body": "An assortment of Bath & Body Works products.Courtesy of Bath & Body WorksBath & Body Works Champagne Toast body wash, with no minimum shipping threshold, is now just a click away for Amazon Prime members.The mall-favorite brand is making some of its best-selling fragrances, body washes, hand soaps and candles available for Amazon's U.S. shoppers. The selection is also eligible for Prime shipping. Amazon is the No. 1 online destination for U.S. beauty shoppers, accounting for 47% of the online beauty and personal care market in the U.S. in 2024, according to Euromonitor. Sephora is second with 9% share. Euromonitor estimates 39% of all beauty and personal care sales take place online. \"Launching our first authorized brand storefront on Amazon allows us to put ourselves directly in the path of the consumer,\" Bath & Body Works CEO Daniel Heaf told CNBC. \"It's about meeting them where they already shop.\"The Amazon launch marks the latest effort by Columbus, Ohio-based Bath & Body Works to expand its access points for customers. Last year, it began selling its products in college campus stores — with a footprint of now more than 1,000 locations — in the company's first points of sale outside its roughly 2,600 owned and franchised stores and its own website.Heaf joined Bath & Body Works in May after his role as Nike's chief transformation and strategy officer was eliminated by CEO Elliott Hill. Heaf recently laid out his \"plan to return [Bath & Body Works] to profitable, sustainable growth.\" He calls it a \"consumer-first formula\" with four pillars: creating disruptive and innovative products, reigniting the brand, winning in the marketplace, and operating with speed and efficiency.The Amazon partnership, Heaf said, \"is the first of many milestones that we'll be delivering this fiscal year against that strategy.\"Before the official storefront launch, Bath & Body Works products were sold on Amazon through third-party resellers. Now, Heaf says the company is attempting to reclaim the brand story on Amazon — and those marketplace sales.Amazon: Friend or foe? While Amazon has many first-party relationships with brands from Nike to Calvin Klein that use wholesale partnerships as part of their business models, there are few examples of retailers selling on the site that design, manufacture and sell their products entirely on their own. For those so-called vertically integrated brands, like Bath & Body Works, Amazon is increasingly filling the role of skilled logistics partner rather than retailer. Gap, J. Crew and Everlane are similarly vertically integrated and have small selections of branded products for sale on Amazon. Gap began selling what it calls \"core basics for the whole family\" in 2022 through a wholesale relationship, where Amazon owns and sells the products, which are Prime eligible. Gap has said its goal is to reach new or lapsed customers as well as provide existing shoppers the convenience for \"core essentials.\" Under Bath & Body Works new agreement with Amazon, the brand will retain ownership of the inventory and control pricing, but will use Amazon's fulfillment partners network for Prime eligibility. Everlane declined to comment on its Amazon partnership. J. Crew did not respond to request for comment.Jewelry company Kendra Scott has an authorized storefront on Amazon after initially opposing the partnership — even though it had wholesale relationships with other retailers, including Macy's and Nordstrom. But over time, the brand began to view Amazon as another opportunity to reach shoppers rather than a competitive threat, according to a person familiar with the company's decision making, who spoke about internal matters on the condition of anonymity.On its own website, Bath & Body Works is making it easier for shoppers to place their orders. The company lowered its free shipping threshold to $50 from $100 last month. Still, Heaf admits, \"We know that we will never compete with Amazon in terms of their Prime Network. No one is going to be offering next-day shipping. That's just not what we're in the business of. And so I think that by going on Amazon, we are also making our own site more competitive but recognizing that our job is not to build a fulfillment network that can operate at the speed of Amazon.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bath & Body Works starts selling on Amazon as more brands embrace its logistics network",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108267311-1771509308286-ProductAssortment.jpg?v=1771509344&w=1920&h=1080"
      ],
      "datePublished": "2026-02-20T11:30:02.000Z",
      "dateModified": "2026-02-20T11:30:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Labor Secretary's husband barred from HQ after claims he sexually assaulted women there: MS Now",
    "url": "https://www.cnbc.com/2026/02/19/labor-secretary-chavez-deremer-husband-barred-sexual-assault-claims.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108267630-1771543906094-108267630-17715403472025-02-19t164507z_1422988310_rc2qxcanlzqi_rtrmadp_0_usa-trump-chavez-deremer_1.jpeg?v=1771543936&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-20T00:43:21.000Z",
    "description": "Shawn DeRemer, husband of Lori Chavez-DeRemer, U.S. President Trump’s nominee to be secretary of labor, sits, on the day Chavez-DeRemer testifies befo",
    "body": "Shawn DeRemer, husband of Lori Chavez-DeRemer, U.S. President Trump’s nominee to be secretary of labor, sits, on the day Chavez-DeRemer testifies before a Senate Health, Education, Labor, and Pensions (HELP) Committee confirmation hearing on Capitol Hill in Washington, D.C., U.S., Feb. 19, 2025.Kent Nishimura | ReutersAt least two female staffers have alleged that they were sexually assaulted at the Labor Department building by the husband of Labor Secretary Lori Chavez-DeRemer, MS Now confirmed on Thursday night.Chavez-DeRemer's husband, Dr. Shawn DeRemer, has not been criminally charged, but has been barred from the Labor Department's headquarters in Washington, D.C., after the women detailed their claims to investigators, MS Now confirmed.The New York Times first reported the situation on Thursday, citing people familiar with the situation and a police report.\"This is an active investigation by MPD's Sexual Assault Unit,\" a Washington Metropolitan Police Department spokesperson told CNBC when contacted about the Times' account of one accuser filing a police report in late January. \"We cannot confirm the names of potential suspects or witnesses.The women said Dr. DeRemer, who is an anesthesiologist in Portland, Oregon, \"had touched them inappropriately at the Labor Department's building on Constitution Avenue,\" according to the Times.\"One of the incidents, during working hours on the morning of Dec. 18, was recorded on office security cameras,\" the Times reported, citing people familiar with the case. \"The video showed Dr. DeRemer giving one of the women an extended embrace, and was reviewed as part of a criminal investigation, one of the people said.A source who spoke with MS Now said in that incident, Dr. DeRemer is seen giving that woman a hug that went on for too long and turned \"creepy,\" according to that news outlet.The Labor Department's inspector general, an internal watchdog, is investigating the situation, according to The Times. The paper also reported that Washington's Metropolitan Police Department on Jan. 24 filed a report about forced sexual contact at the department in December.CNBC obtained a public copy of that police report, which says, \"The complainant reported a sexual contact against her will\" during an incident at 11:30 a.m. ET on Dec. 18 at the Department of Labor building.The complainant's name was not given in the public copy of the report, nor was the name of the alleged assailant.Labor Secretary Lori Chavez-DeRemer speaks during a Cabinet meeting at the White House on April 30, 2025 in Washington, DC.Andrew Harnik | Getty ImagesThe inspector general's office would not confirm or deny it was conducting an investigation when contacted by CNBC.Dr. DeRemer, the Labor Department, the Police Department and the White House did not immediately respond to requests for comment from CNBC.The Times in late January reported that a member of Secretary Chavez-DeRemer's security detail with whom she had been accused of having a romantic relationship, had been placed on administrative leave pending an investigation by the inspector general.The Labor Department's social media account in January posted a video that featured a slideshow of artworks depicting glorified scenes of American history.The caption above that video said, \"One Homeland. One People. One Heritage. Remember who you are, American.\"Social media users noted similarities between the Labor Department's post and a Nazi Party slogan.The slogan \"Ein Volk, ein Reich, ein Führer,\" which the U.S. Holocaust Museum notes was used by Adolf Hitler and his Nazi Party, translates to \"One People, One Country, One Leader.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Labor Secretary's husband barred from HQ after claims he sexually assaulted women there: MS Now",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108267630-1771543906094-108267630-17715403472025-02-19t164507z_1422988310_rc2qxcanlzqi_rtrmadp_0_usa-trump-chavez-deremer_1.jpeg?v=1771543936&w=1920&h=1080"
      ],
      "datePublished": "2026-02-20T00:43:21.000Z",
      "dateModified": "2026-02-20T00:43:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Epstein would 'name drop' Trump, Les Wexner says in deposition video",
    "url": "https://www.cnbc.com/2026/02/19/epstein-trump-les-wexner-deposition.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108267577-1771534001715-Screenshot_2026-02-19_at_34619_PM.png?v=1771534183&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-19T22:21:57.000Z",
    "description": "Les Wexner speaks during a deposition about Jeffrey Epstein. Courtesy: GOP Oversight via YouTubeJeffrey Epstein would \"name drop\" President Donald Tru",
    "body": "Les Wexner speaks during a deposition about Jeffrey Epstein. Courtesy: GOP Oversight via YouTubeJeffrey Epstein would \"name drop\" President Donald Trump as one of the many high-profile people he claimed to know, billionaire retail magnate Leslie Wexner said this week in a congressional deposition about the notorious sex offender.The 88-year-old Wexner, who was one of Epstein's top clients and benefactors, said Epstein \"held [Trump] out as a friend,\" according to a video of the deposition that House Democrats released Thursday.But Wexner, the retired founder of Victoria's Secret ex-parent L Brands, said he did not believe Trump and Epstein were actually friends. And he denied seeing or hearing anything about Trump having a sexual relationship with someone introduced to him by Epstein or his convicted accomplice, Ghislaine Maxwell.He also told lawmakers that both Trump and Epstein would sometimes be at the lingerie company's fashion shows — though he suggested it was a \"coincidence\" and that he can't recall \"something ... that would put them together.\"\"I remember because Trump would always introduce himself to me, and I always thought it was kind of odd that he was at the fashion show because he had nothing to do with fashion,\" Wexner said.The White House did not immediately respond to CNBC's request for comment.The deposition occurred as the Department of Justice's recent release of millions of additional Epstein-related files raises new questions about the late sex criminal's ties to a growing list of prominent figures.Video of the nearly five-hour deposition, conducted Wednesday in New Albany, Ohio, where Wexner lives, was shared on the YouTube account for the House Oversight Committee's Republican majority. Democrats on the Oversight panel, who had traveled to Ohio for the deposition, said that no Republican committee members attended.They also expressed skepticism about Wexner's insistence that he had virtually no social life with Epstein, and they vowed to continue investigating.\"I do not believe when Mr. Wexner says that he did not have a personal relationship or a friendly relationship\" with Epstein, Rep. Robert Garcia, D-Calif., the panel's ranking member, told reporters Wednesday.Asked if he had a relationship with Trump, Wexner laughed and said he did not. Despite their occasional exchanges at the fashion shows, \"we didn't know each other,\" Wexner said. \"I'd be shocked if he remembered me.\"Trump has never discussed Epstein with Wexner, he said.But when asked if Epstein ever discussed Trump with him, Wexner paused and then said, \"I would describe it — he would name drop it.\"\"So he would say things like, 'I know [former President Bill] Clinton or I know the Pope or I know God... It was that kind of name dropping, but never, I can't remember [a] specific place, but Jeffrey dropped a lot of names.\"Asked to clarify that Epstein specifically referenced Trump, Wexner seemed to backtrack. \"No, I'm saying it could have and I don't remember,\" he said.Wexner also said Epstein never shared any information with him about Trump's sexual activities.The comments revealed from the deposition video align with the prepared statement Wexner gave the committee, in which he claimed he was \"duped\" and \"conned\" by Epstein but was uninvolved with, and ignorant of, any of his criminal activities.Wexner in the deposition also denied ever meeting prominent Epstein accuser Virginia Giuffre in Epstein's presence. Giuffre has claimed that Wexner sexually abused her. Wexner, in his prepared statement, said he has never been unfaithful to his wife in 33 years of marriage.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Epstein would 'name drop' Trump, Les Wexner says in deposition video",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108267577-1771534001715-Screenshot_2026-02-19_at_34619_PM.png?v=1771534183&w=1920&h=1080"
      ],
      "datePublished": "2026-02-19T22:21:57.000Z",
      "dateModified": "2026-02-19T22:21:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kennedy defends Trump glyphosate order; MAHA erupts as midterms approach",
    "url": "https://www.cnbc.com/2026/02/19/trump-kennedy-glyphosate-maha-midterms-rfk-jr.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250021-17678902852026-01-08t163703z_1155575201_rc24xiaty2ps_rtrmadp_0_usa-health-diet.jpeg?v=1771532752&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-19T20:53:50.000Z",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. announces new nutrition policies during a press conference in Washington, Jan. 8, 2026.Jonat",
    "body": "Health and Human Services Secretary Robert F. Kennedy Jr. announces new nutrition policies during a press conference in Washington, Jan. 8, 2026.Jonathan Ernst | ReutersSecretary of Health and Human Services Robert F. Kennedy Jr. defended President Donald Trump's executive order spurring the domestic production of the weed killer glyphosate, as his Make America Healthy Again movement reels from the president's embrace of the chemical they despise.Trump on Wednesday night signed an executive order invoking the Defense Production Act to compel the domestic production of elemental phosphorus and glyphosate-based herbicides. Glyphosate is the chemical in Bayer-Monsanto's Roundup and is the most commonly used herbicide for a slew of U.S. crops. Trump, in the order, said shortages of both phosphorus and glyphosate would pose a risk to national security.Kennedy backed the president in a statement to CNBC Thursday morning. \"Donald Trump's Executive Order puts America first where it matters most — our defense readiness and our food supply,\" he said. \"We must safeguard America's national security first, because all of our priorities depend on it. When hostile actors control critical inputs, they weaken our security. By expanding domestic production, we close that gap and protect American families.\"But Kennedy's MAHA coalition that supported Trump in the 2024 presidential election hates glyphosate, which has been alleged to cause cancer in myriad lawsuits. Now, the executive order threatens to unravel that coalition ahead of the 2026 midterm elections that could loosen the president's grip on Washington. \"Just as the large MAHA base begins to consider what to do at midterms, the President issues an EO to expand domestic glyphosate production,\" Kelly Ryerson, a prominent MAHA activist known as The Glyphosate Girl, said in a post on X. \"The very same carcinogenic pesticide that MAHA cares about most.\"Ken Cook, president of the Environmental Working Group, a watchdog that has pushed back against chemicals in food for years, said in a statement that he \"can't envision a bigger middle finger to every MAHA mom than this.\"\"Elevating glyphosate to a national security priority is the exact opposite of what MAHA voters were promised,\" Cook said. \"If Secretary Kennedy remains at HHS after this, it will be impossible to argue that his past warnings about glyphosate were anything more than campaign rhetoric designed to win trust — and votes.\"Kennedy, a former environmental attorney, notably once won a nearly $290 million case against Monsanto for a man who claimed his cancer was caused by Roundup. The executive order came down one day after Bayer proposed paying $7.25 billion to settle a series of lawsuits claiming Roundup causes cancer. Former Rep. Marjorie Taylor Greene, R-Ga., knocked Trump for signing \"an EO protecting cancer causing Glyphosate in our foods.\"Glyphosate is a critical chemical to American agriculture. It's applied to many key cash crops, such as corn and soybeans, and has been defended by agricultural trade organizations. Phosphorus is a key input to the creation of glyphosate, which the White House argues is necessary to maintain food security. Elemental phosphorus is also used in the manufacture of some military materials.\"Thank you, President Trump, for acknowledging the importance of glyphosate-based herbicides in American agriculture,\" the House Agriculture Committee Republicans said Wednesday night in an X post. \"This is a vital step forward in ensuring a domestic supply of this critical crop input remains available for our producers.\"House Agriculture Chair Rep. G.T. Thompson, R-Pa., is trying to push a farm bill through Congress this year — a legislative package that covers federal farm support and nutrition subsidies. He's also come under fire from MAHA recently for a provision in that bill that would block state and local pesticide regulations from differing from federal guidance.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kennedy defends Trump glyphosate order; MAHA erupts as midterms approach",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250021-17678902852026-01-08t163703z_1155575201_rc24xiaty2ps_rtrmadp_0_usa-health-diet.jpeg?v=1771532752&w=1920&h=1080"
      ],
      "datePublished": "2026-02-19T20:53:50.000Z",
      "dateModified": "2026-02-19T20:53:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three Silicon Valley engineers charged with stealing Google trade secrets and sending data to Iran",
    "url": "https://www.cnbc.com/2026/02/20/three-engineers-charged-stealing-google-trade-secrets-data-iran-soc-snapdragon.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108129964-1744291856903-gettyimages-1919905342-_s1_3650_p8aqgrtg.jpeg?v=1771565979&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-20T05:39:55.000Z",
    "description": "People walk near a sign outside of Google headquarters in Mountain View, California. Justin Sullivan | Getty Images News | Getty ImagesA federal grand",
    "body": "People walk near a sign outside of Google headquarters in Mountain View, California. Justin Sullivan | Getty Images News | Getty ImagesA federal grand jury indicted three Silicon Valley engineers on charges of stealing trade secrets from Google and other technology companies and transferring sensitive data to Iran, prosecutors said Thursday.Samaneh Ghandali, 41, her sister Soroor Ghandali, 32, and Mohammadjavad Khosravi, 40 — all residents of San Jose — were arrested Thursday and appeared in a federal district court the same day.The indictment identified the defendants as Iranian nationals. Soroor was in the U.S. on a nonimmigrant student visa. Samaneh later became a U.S. citizen, and Khosravi, her husband, became a U.S. legal permanent resident. Prosecutors said that Khosravi previously served in the Iranian army.The trio faces charges of conspiracy to commit trade secret theft, theft and attempted theft of trade secrets, and obstruction of justice, according to the U.S. attorney's office for the Northern District of California.Prosecutors alleged the three defendants exploited their positions at leading technology firms that develop mobile computer processors to obtain hundreds of confidential files, including materials related to processor security and cryptography. Samaneh and Soroor worked at Google before joining a third company identified only as Company 3. Khosravi worked at a separate firm referred to as Company 2, which develops system-on-chip (SoC) platforms such as the Snapdragon series for smartphones and other mobile devices.SoC is a semiconductor that integrates numerous components, such as graphics processing units and memory, into a power-efficient package. Common SoCs include Qualcomm's Snapdragon, found in most high-end Android phones, and Apple's A-series for iPhones.In a statement to CNBC, Google said it had detected the alleged theft through routine security monitoring before referring the case to law enforcement. \"We have enhanced safeguards to protect our confidential information and immediately alerted law enforcement after discovering this incident,\" spokesman José Castañeda said. The tech giant also pointed to measures to protect its trade secrets, including restricting employees' access to sensitive information, two-factor authentication for work-related Google accounts and logging file transfers to third-party platforms such as Telegram. Alleged efforts to concealAuthorities alleged the defendants routed stolen files through a third-party communications platform to channels bearing each of their first names, before copying the material to personal devices, each other's work devices, and to Iran. \"The method in which confidential data was transferred by the defendants involved deliberate steps to evade detection and conceal their identities,\" said FBI Special Agent in Charge Sanjay Virmani. The defendants sought to cover their tracks after Google's internal security systems flagged Samaneh's activity and revoked her access to company resources in August 2023. According to the indictment, she signed an affidavit falsely claiming she had not shared Google's confidential information outside the company. During that period, a personal laptop linked to Samaneh and Khosravi was used to search for methods to delete communications and to research how long mobile carriers retain message records, prosecutors said.The couple also allegedly photographed hundreds of computer screens containing confidential information from Google and Company 2, in what appeared to be an attempt at circumventing digital monitoring tools. On the night before the pair traveled to Iran in December 2023, Samaneh allegedly took about 24 photos of Khosravi's work computer screen containing Company 2's trade secrets, including its Snapdragon SoCs. Prosecutors allege that while in Iran, a device linked to Samaneh accessed those photographs, while Khosravi accessed additional Company 2's proprietary information, such as Snapdragon SoC hardware architecture.Prosecutors said in the indictment that Snapdragon SoC trade secrets had independent economic value because they were not generally known and could not be readily obtained from Company 2's competitors, who could benefit from their disclosure or use. If convicted, each defendant faces up to 10 years in prison for each trade secret charge and up to 20 years for obstruction of justice, along with fines of up to $250,000 per count.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three Silicon Valley engineers charged with stealing Google trade secrets and sending data to Iran",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108129964-1744291856903-gettyimages-1919905342-_s1_3650_p8aqgrtg.jpeg?v=1771565979&w=1920&h=1080"
      ],
      "datePublished": "2026-02-20T05:39:55.000Z",
      "dateModified": "2026-02-20T05:39:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Democrats pick Virginia Gov. Spanberger to give State of the Union rebuttal ",
    "url": "https://www.cnbc.com/2026/02/19/democrats-pick-gov-spanberger-to-give-state-of-the-union-rebuttal-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107332779-1699881781822-gettyimages-1249064863-spanberger_BC_227_032223JPG.jpeg?v=1771530814&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-19T19:57:53.000Z",
    "description": "Then-Rep. Abigail Spanberger, D-Va., poses in her office in the Cannon House Office Building on Wednesday, March 22, 2023.Bill Clark | Cq-roll Call, I",
    "body": "Then-Rep. Abigail Spanberger, D-Va., poses in her office in the Cannon House Office Building on Wednesday, March 22, 2023.Bill Clark | Cq-roll Call, Inc. | Getty ImagesVirginia Gov. Abigail Spanberger will deliver the Democratic rebuttal to President Donald Trump's State of the Union address next Tuesday, a primetime slot for the newly elected state executive to lay out the Democratic Party's vision ahead of the pivotal 2026 midterm elections. Spanberger defeated Republican Winsome Earl-Sears by 15 points in last year's elections, flipping the state from Republican to Democratic control. She was previously a member of the House of Representatives from Virginia.The rebuttal to the State of the Union is a high-stakes opportunity for the party outside of the White House to lay out its vision for the country after the president gives his speech. The stakes are even higher for Democrats this year, who are looking to rip away Trump's complete control of Washington in the midterm elections. \"Virginians and Americans across the country are contending with rising costs, chaos in their communities, and a real fear of what each day might bring,\" Spanberger said in a statement announcing her speech. \"Next week, I look forward to laying out what these Americans expect and deserve — leaders who are working hard to deliver for them.\"House Democratic Leader Hakeem Jeffries, D-N.Y., said in a statement that Spanberger \"stands in stark contrast to Donald Trump, who will lie, deflect and blame everyone but himself for his failed presidency on Tuesday evening.\"And Senate Minority Leader Chuck Schumer, D-N.Y., said she will \"lay out a clear path forward: lower everyday costs, protect healthcare, and defend the freedoms that define who we are as a nation.\"Sen. Elissa Slotkin, D-Mich., gave the rebuttal to Trump's joint session of Congress last year. The last time a governor gave the rebuttal was in 2022 when Republican Iowa Gov. Kim Reynolds spoke following President Joe Biden's State of the Union address.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Democrats pick Virginia Gov. Spanberger to give State of the Union rebuttal ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107332779-1699881781822-gettyimages-1249064863-spanberger_BC_227_032223JPG.jpeg?v=1771530814&w=1920&h=1080"
      ],
      "datePublished": "2026-02-19T19:57:53.000Z",
      "dateModified": "2026-02-19T19:57:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia is in talks to invest up to $30 billion in OpenAI, source says",
    "url": "https://www.cnbc.com/2026/02/19/nvidia-is-in-talks-to-invest-up-to-30-billion-in-openai-source-says.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108267416-1771518692599-gettyimages-2261852386-INDIA_AI_SUMMIT.jpeg?v=1771518848&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-20T12:09:33.000Z",
    "description": "Sam Altman, chief executive officer of OpenAI Inc., at the AI Impact Summit in New Delhi, India, on Thursday, Feb. 19, 2026. Prakash Singh | Bloomberg",
    "body": "Sam Altman, chief executive officer of OpenAI Inc., at the AI Impact Summit in New Delhi, India, on Thursday, Feb. 19, 2026. Prakash Singh | Bloomberg | Getty ImagesNvidia is in discussions to invest up to $30 billion in OpenAI as part of a funding round that could value the artificial intelligence startup at a $730 billion pre-money valuation, CNBC has confirmed. The investment is separate from the $100 billion infrastructure agreement that OpenAI and Nvidia announced in September, according to a source familiar with the matter who asked not to be named because the discussions are confidential. The $30 billion is not tied to any deployment milestones, the person said.The September announcement, which rocked the tech sector and sparked a flurry of subsequent infrastructure deals, outlined a structure where Nvidia would invest in OpenAI over several years as it brought new supercomputing facilities online. A source told CNBC at the time that Nvidia's first investment of $10 billion would be deployed when its first gigawatt was completed.Nvidia's $30 billion investment in OpenAI is different from what was contemplated in September, but the company could still decide to invest in subsequent rounds that align with that framework, the person said. The $30 deal is not final and the details are still subject to change, the person said. The Financial Times was first to report the potential investment.Nvidia declined to comment.Questions about the status of OpenAI and Nvidia's $100 billion infrastructure agreement have been swirling in recent months, particularly after the Wall Street Journal reported in January that the deal was \"on ice.\" watch nowNvidia had previously said in its quarterly financial report in November that there was \"no assurance that we will enter into definitive agreements with respect to the OpenAI opportunity or other potential investments.\" OpenAI CEO Sam Altman tried to shrug off concerns about the deal, writing in a post on X that the company loves working with Nvidia, and that he doesn't \"get where all this insanity is coming from.\"Nvidia CEO Jensen Huang also addressed the potential rift during an interview with CNBC's Jim Cramer earlier this month, and he said there was \"no question\" that the company would invest in OpenAI's next funding round.OpenAI is also engaging in fundraising discussions with other investors, and the total round could close at around $100 billion, as CNBC previously reported. The talks have accelerated in recent weeks, but they have not been finalized.The startup's funding round could close in two parts, beginning with investments from strategics like Amazon, Microsoft and Nvidia, as CNBC previously reported. Other contributions from a broader pool of investors would follow. WATCH: Watch CNBC’s full interview with OpenAI CEO Sam Altmanwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia is in talks to invest up to $30 billion in OpenAI, source says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108267416-1771518692599-gettyimages-2261852386-INDIA_AI_SUMMIT.jpeg?v=1771518848&w=1920&h=1080"
      ],
      "datePublished": "2026-02-20T12:09:33.000Z",
      "dateModified": "2026-02-20T12:09:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple sued by West Virginia for alleged failure to stop child sexual abuse material on iCloud, iOS devices",
    "url": "https://www.cnbc.com/2026/02/19/apple-sued-csam-icloud-ios.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107426851-1718046071516-gettyimages-2156402280-APPLE_DEVELOPERS_CONFERENCE.jpeg?v=1748021043&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-19T15:17:37.000Z",
    "description": "watch nowWest Virginia's attorney general has filed a consumer protection lawsuit against Apple, alleging that it has failed to prevent child sexual a",
    "body": "watch nowWest Virginia's attorney general has filed a consumer protection lawsuit against Apple, alleging that it has failed to prevent child sexual abuse materials from being stored and shared via iOS devices and iCloud services.John \"JB\" McCuskey, a Republican, accused Apple of prioritizing privacy branding and its own business interests over child safety, while other big tech companies, including Google, Microsoft, and Dropbox, have been more proactive, using systems like PhotoDNA to combat such material.PhotoDNA, developed by Microsoft and Dartmouth College in 2009, uses \"hashing and matching\" to automatically identify and block child sexual abuse material (CSAM) images when they have already been identified as such and reported to authorities.In 2021, Apple had tested its own CSAM-detection features that could automatically find and remove images of child exploitation, and report those that had been uploaded to iCloud in the U.S. to the National Center for Missing & Exploited Children.But the company withdrew its plans for the features after privacy advocates who worried that this technology could create a back door for government surveillance, and be tweaked and exploited to censor other kinds of content on iOS devices.The company's efforts since then have not satisfied a broad array of critics.Read more CNBC tech newsAmid Epstein fallout, Bill Gates becomes point of controversy at India AI summitOpenAI and Anthropic's rivalry on display as CEOs avoid holding hands at AI summitChinese tech companies progress 'remarkable,' OpenAI's Altman tells CNBCAnthropic is clashing with the Pentagon over AI use. Here's what each side wantsIn 2024, UK-based watchdog the National Society for the Prevention of Cruelty to Children said Apple failed to adequately monitor, tabulate and report CSAM in its products to authorities. And in a 2024 lawsuit filed in California's Northern District, thousands of child sexual abuse survivors sued Apple, alleging the company never should have abandoned its earlier plans for CSAM detection features, and by allowing such material to proliferate online, it had caused survivors to relive their trauma.Apple has positioned itself as the most privacy-sensitive of the Big Tech companies, since its CEO Tim Cook wrote an open letter on the topic in 2014. If West Virginia's suit is successful, it could force the company to make design or data security changes. The state is seeking statutory and punitive damages, and injunctive relief requiring Apple to implement effective CSAM detection.In an e-mailed statement, a spokesperson for Apple told CNBC that \"protecting the safety and privacy of our users, especially children, is central to what we do.\"The company pointed to parental controls and features like Communication Safety which, \"automatically intervenes on kids' devices when nudity is detected in Messages, shared Photos, AirDrop and even live FaceTime calls,\" as an indication of its commitment to provide \"safety, security, and privacy\" to users.\"We are innovating every day to combat ever-evolving threats and maintain the safest, most trusted platform for kids,\" the spokesperson added.-- CNBC's Kif Leswing contributed reportingwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple sued by West Virginia for alleged failure to stop child sexual abuse material on iCloud, iOS devices",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107426851-1718046071516-gettyimages-2156402280-APPLE_DEVELOPERS_CONFERENCE.jpeg?v=1748021043&w=1920&h=1080"
      ],
      "datePublished": "2026-02-19T15:17:37.000Z",
      "dateModified": "2026-02-19T15:17:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House Democrats call for Treasury probe into Trump family crypto venture",
    "url": "https://www.cnbc.com/2026/02/19/treasury-probe-trump-crypto-world-liberty-financial-democrats.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261397-17702239542026-02-04t163713z_423112504_rc23fjagmhhs_rtrmadp_0_usa-congress-bessent-hearing.jpeg?v=1770223971&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-19T20:39:29.000Z",
    "description": "U.S. Treasury Secretary Scott Bessent testifies before a House Financial Services Committee hearing about the annual report of the Financial Stability",
    "body": "U.S. Treasury Secretary Scott Bessent testifies before a House Financial Services Committee hearing about the annual report of the Financial Stability Oversight Council, on Capitol Hill in Washington, D.C., U.S., February 4, 2026. Kylie Cooper | ReutersDozens of House Democrats wrote to Treasury Secretary Scott Bessent on Thursday calling for an investigation into possible conflicts of interest and national security concerns related to World Liberty Financial, the Trump family's cryptocurrency venture.The letter, led by Rep. Gregory Meeks, D-N.Y. and 40 other lawmakers, landed after Bessent testified at a contentious House Financial Services Committee hearing earlier this month. Meeks at the hearing called Bessent a \"flunky\" of President Donald Trump and raised questions about a $500 million stake that Sheikh Tahnoon bin Zayed Al Nahyan — a royal from the United Arab Emirates also known as the \"spy sheikh\" — bought in World Liberty Financial last year.\"The Trump family's $500 million deal connected to the Emirati royal family is not only a matter of national financial instability, but it also carries serious national security implications,\" Meeks said in a statement accompanying the letter. \"Trust that the record will reflect whether Secretary Bessent chooses to answer to the American people, or his mob boss.\"The request for a probe was made as World Liberty Financial is seeking a national bank charter, a distinction reviewed and issued by the Office of the Comptroller of the Currency, an independent arm of the Treasury Department that regulates banks. World Liberty Financial held a day-long forum Wednesday at Mar-a-Lago where presidential sons Don Jr. and Eric Trump touted the family's stablecoin and called traditional banking a \"Ponzi scheme.\"Meeks at the hearing asked Bessent to commit to pause any pending applications from World Liberty Financial before the OCC and to complete an investigation into the \"conflicts of interest and foreign influence.\"\"The OCC is an independent entity,\" Bessent said then, over the shouts of Meeks, without addressing the topic further.President Donald Trump and his special envoy, Steve Witkoff, are co-founders emeritus of the company, which is run by members of the Trump and Witkoff families.\"This is no longer just a debate about crypto chartering theory. It is about foreign ownership, national security, regulatory integrity, and whether our bank-chartering process is resilient to political and geopolitical pressure,\" the lawmakers wrote Thursday.In the letter, Democratic members asked for information on the safeguards in place to ensure that \"foreign government officials, sovereign proxies, or politically connected investors cannot use the bank-chartering process to gain leverage over the U.S. financial system or access sensitive financial or technological infrastructure.\"It also asks what role the White House, Office and Management and Budget and Treasury have in \"reviewing, approving, or otherwise influencing national bank or trust chartering decisions made by the\" OCC. It lawmakers requested a response from Treasury by Feb. 26.A Treasury Department spokesperson did not immediately respond to an email seeking comment.\"The credibility of America's banking regulatory framework, and of the institutions charged with protecting it, depends on transparency, independence, and a demonstrated willingness to resist undue influence,\" the lawmakers wrote. \"Our constituents need confidence that our banking system is governed by law, not proximity to power; by prudential judgment, not political convenience.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House Democrats call for Treasury probe into Trump family crypto venture",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261397-17702239542026-02-04t163713z_423112504_rc23fjagmhhs_rtrmadp_0_usa-congress-bessent-hearing.jpeg?v=1770223971&w=1920&h=1080"
      ],
      "datePublished": "2026-02-19T20:39:29.000Z",
      "dateModified": "2026-02-19T20:39:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alien files: Trump to order U.S. agencies to release documents on 'extraterrestrial life'",
    "url": "https://www.cnbc.com/2026/02/20/trump-us-aliens-ufo-extraterrestrial-files.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108267694-1771563719886-gettyimages-1222800098-ds5a1218.jpeg?v=1771563749&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-20T06:19:04.000Z",
    "description": "Man and boy sit on a paved sidewalk and draw alien faces.Annie Otzen | Digitalvision | Getty ImagesU.S. President Donald Trump said on Thursday that h",
    "body": "Man and boy sit on a paved sidewalk and draw alien faces.Annie Otzen | Digitalvision | Getty ImagesU.S. President Donald Trump said on Thursday that he would direct the Department of Defense and other agencies to make public government files related to alien and extraterrestrial life.Trump said the files that will be identified and released will also concern unidentified aerial phenomena and unidentified flying objects, as well as \"any and all other information connected to these highly complex, but extremely interesting and important, matters.\"In a Truth Social post, the U.S. president said his move was based on the \"tremendous interest\" in the subject, without providing additional details. This comes after he accused former U.S. President Barack Obama of leaking \"classified information\" on aliens. \"I don't know if they're real or not, but I can tell you he gave classified information,\" Trump told reporters on Air Force One. Obama said on Saturday in a podcast that aliens were real, \"but I haven't seen them, and they're not being kept in ... Area 51.\" \"There's no underground facility, unless there's this enormous conspiracy, and they hid it from the president of the United States,\" Obama added.Area 51 refers to a classified U.S. Air Force facility in Nevada, and has been the center of conspiracy theories saying the U.S. government has been conducting research and using the facility for storing extraterrestrial materials and technology. Obama had previously said that the first question he wanted answered when he became president was \"Where are the aliens?\"After the podcast on Sunday, the former U.S. president clarified his stance on a post on Instagram, saying that the universe was so vast that the odds are good that there's life out there. However, he said that he also saw \"no evidence\" during his presidency that extraterrestrials have made contact with Earth.\" In late 2024, the Pentagon said it had seen 757 new reports of unidentified anomalous phenomena, or UAPs between May 2023 and June 2024, NBC News reported.Of these, 21 \"merit further analysis\" due to \"anomalous characteristics and/or behaviors,\" the report said, adding that there was no evidence, so far, to substantiate life from another planet being involved in these sightings.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alien files: Trump to order U.S. agencies to release documents on 'extraterrestrial life'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108267694-1771563719886-gettyimages-1222800098-ds5a1218.jpeg?v=1771563749&w=1920&h=1080"
      ],
      "datePublished": "2026-02-20T06:19:04.000Z",
      "dateModified": "2026-02-20T06:19:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sumitomo Pharma shares plunge nearly 16% despite greenlight for Parkinson's treatment",
    "url": "https://www.cnbc.com/2026/02/20/sumitomo-pharma-shares-plunge-despite-greenlight-for-parkinsons-treatment.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107275518-1690206948460-gettyimages-1414568582-kob00117.jpeg?v=1713970401&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-20T07:43:50.000Z",
    "description": "Kelvn | Istock | Getty ImagesShares of Japanese drugmaker Sumitomo Pharma fell 15.60% Friday on what appeared to be profit-taking, a day after the gov",
    "body": "Kelvn | Istock | Getty ImagesShares of Japanese drugmaker Sumitomo Pharma fell 15.60% Friday on what appeared to be profit-taking, a day after the government endorsed the company's iPS cell-based therapy for Parkinson's and heart disease.Sumitomo Pharma's stock, which rose more than 300% in 2025, hit its highest level since 2019 last week amid growing confidence in its Parkinson's therapy. The therapies rely on induced pluripotent stem (iPS) cells — adult cells that are reprogrammed back into a stem-cell-like state.Stem cells are are capable of self-renewal and work as a repair system, replacing damaged cells and maintaining tissues, allowing them to be used in regenerative medicine.\"While the treatment could potentially see widespread use and become a blockbuster in Japan and the US over the long term, we expect almost no profit contribution near term,\" said Citigroup Global Markets Japan's analyst Hidemaru Yamaguchi.Sumitomo's stock has been overheated, and recent gains have been  \"excessive,\" he added.According to Japan's Ministry of Health, Labor and Welfare, formal approval will be granted within the next one to two months, NHK reported.The endorsement comes years after Kyoto University professor Shinya Yamanaka, who later won a Nobel Prize for his stem cell research, first succeeded in generating iPS cells from mice in 2006. Japan has been striving to develop stem-cell therapies, with Kyoto University's CiRA, which runs a clinical-grade iPS cell bank, providing researchers access to prepared cells that can be used in trials for a range of conditions.Sumitomo Pharma develops and markets prescription medicines across multiple therapeutic areas, including neuroscience, oncology and regenerative medicine.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sumitomo Pharma shares plunge nearly 16% despite greenlight for Parkinson's treatment",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107275518-1690206948460-gettyimages-1414568582-kob00117.jpeg?v=1713970401&w=1920&h=1080"
      ],
      "datePublished": "2026-02-20T07:43:50.000Z",
      "dateModified": "2026-02-20T07:43:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Epstein files: Former prince Andrew released by police, Trump calls his arrest 'a shame'",
    "url": "https://www.cnbc.com/2026/02/19/epstein-files-former-prince-andrew-police-released-arrest.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108267529-17715285232026-02-19t191413z_482375739_rc27pjahobes_rtrmadp_0_usa-epstein-britain-andrew.jpeg?v=1771538330&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-19T22:28:58.000Z",
    "description": "Andrew Mountbatten-Windsor, formerly known as Prince Andrew, brother of Britain’s King Charles, leaves Aylsham Police Station in a vehicle on the day ",
    "body": "Andrew Mountbatten-Windsor, formerly known as Prince Andrew, brother of Britain’s King Charles, leaves Aylsham Police Station in a vehicle on the day he was arrested on suspicion of misconduct in public office, after the U.S. Justice Department released more records tied to the late financier and convicted sex offender Jeffrey Epstein, in Aylsham, England, Feb. 19, 2026.Phil Noble | ReutersBritish police on Thursday released Andrew Mountbatten-Windsor, former prince and the brother of King Charles III, after having arrested him earlier on suspicion of misconduct in public office.The nature of the investigation has not been revealed. But Mountbatten-Windsor's arrest came after renewed focus on his past friendship with Jeffrey Epstein, the now-dead notorious sex offender, after the U.S. Department of Justice released millions of documents about Epstein.Thames Valley Police, who had arrested Mountbatten-Windsor without publicly identifying him, had said they were assessing reports that he had sent Epstein confidential trade reports in 2010, when he was Britain's special envoy for international trade.Thames Valley Police, in a statement, said, \"On Thursday ... we arrested a man in his sixties from Norfolk on suspicion of misconduct in public office.\"\"The arrested man has now been released under investigation,\" police said. \"We can also confirm that our searches in Norfolk have now concluded. Our searches in Berkshire are still underway.\"King Charles, in a statement earlier Thursday following the arrest of his brother, said, \"I have learned with the deepest concern the news about Andrew Mountbatten-Windsor and suspicion of misconduct in public office.\"\"What now follows is the full, fair and proper process by which this issue is investigated in the appropriate manner and by the appropriate authorities,\" the king said. \"Let me state clearly: the law must take its course.\"President Donald Trump, speaking to reporters on Air Force One on Thursday, called Mountbatten-Windsor's arrest \"a shame.\"\"I think it's very sad. I think it's so bad for the royal family. It's very, very sad. To me, it's a very sad thing,\" said Trump, who himself is a former friend of Epstein.Charles stripped Mountbatten-Windsor of his title of prince in October and forced him out of his home near Windsor Castle because of his ties to Epstein, who killed himself in August 2019 after being arrested on federal child sex trafficking charges filed in New York.Mountbatten-Windsor has denied any wrongdoing in connection with Epstein, including allegations that he sexually assaulted Virginia Giuffre, a known victim of Epstein, when she was 17 years old.In February 2022, Mountbatten-Windsor reached a confidential settlement with Giuffre of her lawsuit in New York federal court related to those allegations, without admitting wrongdoing.But he agreed at the time to what was called \"a substantial donation to Ms. Giuffre's charity in support of victims' rights,\" and in a statement said he regretted his association with Epstein, and commended \"the bravery of Ms. Giuffre and other survivors in standing up for themselves and others.\"Giuffre died by suicide last April.Maria Farmer, a victim of Epstein, in a statement Thursday after the arrest of Mountbatten-Windsor, said, \"Today is just the beginning of accountability and justice brought forth by Virginia Roberts Giuffre — a young mother who adored her daughter so deeply, she fought the most powerful on earth to protect her. She did this for everyone's daughters.\"\"Let's now demand all the dominos of power and corruption begin to fall,\" Farmer said.If you are having suicidal thoughts or are in distress, contact the Suicide & Crisis Lifeline at 988 for support and assistance from a trained counselor.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Epstein files: Former prince Andrew released by police, Trump calls his arrest 'a shame'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108267529-17715285232026-02-19t191413z_482375739_rc27pjahobes_rtrmadp_0_usa-epstein-britain-andrew.jpeg?v=1771538330&w=1920&h=1080"
      ],
      "datePublished": "2026-02-19T22:28:58.000Z",
      "dateModified": "2026-02-19T22:28:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who's laughing now? China’s humanoid robots go from viral stumbles to kung fu flips in one year",
    "url": "https://www.cnbc.com/2026/02/20/china-humanoid-robots-spring-festival-gala-unitree-tesla-ai-race.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108267707-1771566525692-gettyimages-2261125564-AA_14022026_2652018.jpeg?v=1771566615&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-20T10:30:46.000Z",
    "description": "Robots taking part in a martial arts performance at the 2026 Spring Festival Gala in Beijing, China on February 16, 2026. Vcg | Visual China Group | G",
    "body": "Robots taking part in a martial arts performance at the 2026 Spring Festival Gala in Beijing, China on February 16, 2026. Vcg | Visual China Group | Getty ImagesChinese humanoid robots are having a moment in the spotlight after a standout performance at the country's annual Spring Festival Gala earlier this week, with videos from the event circulating widely online. The gala, widely considered the world's most-watched television program, featured robots from several startups performing everything from kung fu moves to choreographed dances to elaborate gymnastics displays. The showing marked a sharp contrast from the 2025 Gala, which had featured less advanced versions of the robots twirling handkerchiefs in a wobbly folk dance. Around that time, public demonstrations of the humanoids often drew skepticism, such as a robot marathon in April that made headlines for stumbles, crashes and breakdowns. But a year can make quite the difference. Viewers of this week's event have expressed everything from admiration for the technological advancements to concern about what they mean for the labor force and the U.S.-China tech race. As we watch them push the physical boundaries humans are capable of, it becomes apparent they can achieve human-level actions, and eventually superhuman-level performances.Reyk KnuhtsenAnalyst at SemiAnalysisAnalysts told CNBC that while humanoid robots still have more to prove, the advancements made over the past year warrant global attention.  \"People should absolutely be taking these robots seriously,\" Reyk Knuhtsen, analyst at SemiAnalysis, told CNBC. \"After this spring gala demonstration, they're becoming visibly more lean, fluid, and capable.\" \"As we watch them push the physical boundaries humans are capable of, it becomes apparent they can achieve human-level actions, and eventually superhuman-level performances,\" he added. China's early leadChina has already taken an early lead in the manufacturing and deployment of humanoid robots, according to data from Barclays. Analysts at the company estimate that of the roughly 15,000 humanoid robot installations in 2025, China accounted for more than 85%, compared with just 13% in the U.S.\"The fundamental advantage that China has is a nearly vertically integrated robotics value chain: from the rare earths and high-performance magnets to the physical components, and the batteries,\" Zornitsa Todorova, Head of Thematic FICC Research at Barclays, told CNBC. Leading Chinese humanoid companies like Unitree are hoping to maintain that lead into this year. The start-up, whose robots were prominently featured at the Spring Festival Gala, expects between 10,000 and 20,000 shipments in 2026, the CEO told local media just before the show ended. The enhanced dexterity shown in routines like aerial flips and weapon handling signals strong potential for economic impact in physically demanding tasks that involve delicate tool handling and precise movements.Lian Jye SuOmdia chief analystChina's manufacturing advantage, combined with government support, has also enabled Chinese robotics producers to manufacture their products at much lower prices than competitors, Todorova said.Unitree, for example, advertises a base price of $13,500 for its G1 humanoid robot. Meanwhile, Tesla's Optimus, a humanoid leader in the U.S., is expected to keep prices higher in the near term. CEO Elon Musk said during an earnings call in Jan. 2025 that the robot's production cost could fall below US$20,000 if annual output reaches 1 million units, though final pricing would depend on market demand.Analysts expect U.S. humanoid manufacturers to also increase production this year, but say they likely have their work cut out for them.\"Other markets will ramp up but likely lag due to China's established supply chains and production scale,\" said Omdia chief analyst Lian Jye Su, adding that China is likely to lead for at least the next few years. Caveats remainWhile the Spring Festival Gala showcased rapid advances, analysts cautioned that humanoid robots still face technical hurdles, with AI and mechanical upgrades required.\"The enhanced dexterity shown in routines like aerial flips and weapon handling signals strong potential for economic impact in physically demanding tasks that involve delicate tool handling and precise movements,\" said Omdia's Su. \"However, they still need to prove reliability in unstructured, human-centric environments for delicate tasks like healthcare or household assistance.\"In those tasks, advances in the underlying AI and minutiae mechanical engineering will matter more than raw manufacturing and shipment numbers. \"[T]he AI model race is still undecided, and that will be the defining factor in the end, as the robot will only be as useful as its model,\" said Knuhtsen. While China's robotics companies have impressed viewers with their flashy kung-fu routines, the analyst said advances in reasoning, longer task durations, and the ability to chain multiple tasks together to perform different chores will matter more this year.\"I think this is where a lot of economic value lies, and it's steadily improving.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who's laughing now? China’s humanoid robots go from viral stumbles to kung fu flips in one year",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108267707-1771566525692-gettyimages-2261125564-AA_14022026_2652018.jpeg?v=1771566615&w=1920&h=1080"
      ],
      "datePublished": "2026-02-20T10:30:46.000Z",
      "dateModified": "2026-02-20T10:30:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "United Airlines is paring back rewards for travelers who don't have its credit card in MileagePlus overhaul",
    "url": "https://www.cnbc.com/2026/02/19/united-airlines-frequent-flyer-mileage-plus-program-credit-card.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108182989-1754573411946-gettyimages-2228142437-AA_07082025_2361374.jpeg?v=1771342389&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-19T12:55:53.000Z",
    "description": "watch nowNo United Airlines credit card? Soon you'll earn fewer miles than other travelers.United is overhauling its MileagePlus frequent flyer progra",
    "body": "watch nowNo United Airlines credit card? Soon you'll earn fewer miles than other travelers.United is overhauling its MileagePlus frequent flyer program to reward travelers with more miles and lower redemption rates, including for some of its long-haul business-class seats — if they have one of the airline's credit cards. It's the latest move by an airline to reward its highest-spending customers.The changes mark the biggest shake-up to the lucrative program in more than a decade, when United began rewarding customers for how much they spent — not just how far they flew.United Chief Commercial Officer Andrew Nocella told CNBC in an interview that the airline has been working on the changes for about 18 months and that the carrier is aiming to reward its most loyal customers.The shift also comes as United tries to stand out in an ever more competitive landscape for travel and rewards credit cards. That space also includes American Express' Platinum, Capital One's Venture X and Chase's Sapphire Reserve cards. United Airlines planes are taxiing to takeoff from San Francisco International Airport.Tayfun Coskun | Anadolu | Getty Images\"In the credit card space in general, a lot's changed over the last five to 10 years in terms of the number of travel credit cards that are out there,\" Nocella said. \"What I'm thinking about as we make these changes for United is to make sure that if you hold the credit card, you put it top of wallet, and then if you don't hold the credit card, there's a reason to get the credit card that seems incredibly compelling if you'd like to fly United Airlines and if you'd like to have that ... trip to Tahiti or to Rome or wherever we may be able to take you.\"The changes take effect April 2. United is planning to show the discounted award flights on its website \"so customers can see exactly how much having a United card could save them on their travel,\" the airline said.United's loyalty program update is part of a trend among airlines to reward frequent flyer program members depending on how much they spend. About a decade ago, the major carriers tweaked their loyalty programs to reward customers for dollars spent over miles traveled.Airlines also encourage customers to sign up for their credit cards by offering perks like no fees for checked bags and earlier boarding.What's changing with United MileagePlus United MileagePlus primary cardholders will get more miles per dollar spent on United flights compared with customers without a card, and higher rates than they do currently. Their earning goes up, too, when they actually use that card to purchase the ticket.Meanwhile, customers without the card will earn less than they do today. For example, a traveler without a co-branded United Airlines credit card will get three miles per dollar spent on a ticket, down from the current five miles. Under the new structure, a cardholder could earn six miles, and more if they use the card to buy it. Those with elite MileagePlus status earn miles at a higher rate, too.United debit cardholders will also receive more miles, once they spend $10,000, United said.Redemption rate discounts for cardholders United will also now allow customers with one of its credit cards to redeem their miles for flights at a discount of at least 10% compared with those without the card.The carrier said that, as an example, an economy-class award ticket that was 15,000 miles will go for 13,500 without elite Premier status. United said it's setting aside special discounted inventory of award tickets for cardholders, including for top-tier Polaris seats.Read more CNBC airline newsSpirit Airlines sells more planes, calls back 500 flight attendants from furlough ahead of spring breakFAA abruptly halted El Paso flights over Defense Department’s plans for anti-drone technologyPressure mounts on American Airlines CEO as carrier lags rivalsSouthwest ends open seating after 54 years. Here’s what the last flight was likeBoeing outsold Airbus last year for first time since 2018, deliveries rise to 600Perks for elitesThose with elite MileagePlus Premier status will get deeper discounts and better miles redemption. Elites with a card get at least 15% off mileage tickets. United said its a seat in a long-haul business class Polaris cabin that is going for 200,000 miles would be 170,000 miles if the cardmember has elite Premier status. United added the lowest priced \"Saver Award\" seats for Polaris would be accesible to MileagePlus members with a United card, seats that were previously just available to high-tier elites.Their earning rates also increase if they have both the credit card and status. MileagePlus 1K, the highest tier before Global Services, will get 17 miles for each dollar spent when they use their United Club credit card. What's happening to basic economy flyers?United Airlines travelers who don't have the credit card won't receive miles for basic economy tickets. American Airlines last year similarly said it would no longer allow travelers in that class to earn miles, following an earlier move by Delta Air Lines. There's an exemption, however, for holders of United's elite Premier status, who can still earn miles in basic economy.What about business travelers?Business travelers often have to book with company credit cards under corporate travel policies. But United said that individuals who personally hold a United credit or debit card will still get more miles than an employee who doesn't.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "United Airlines is paring back rewards for travelers who don't have its credit card in MileagePlus overhaul",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108182989-1754573411946-gettyimages-2228142437-AA_07082025_2361374.jpeg?v=1771342389&w=1920&h=1080"
      ],
      "datePublished": "2026-02-19T12:55:53.000Z",
      "dateModified": "2026-02-19T12:55:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]