[
  {
    "title": "Columbia U. student Elmina Aghayeva released from ICE custody after Trump, NY mayor meeting ",
    "url": "https://www.cnbc.com/2026/02/26/columbia-ice-dhs-immigration-detainment.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108131667-1744656364493-gettyimages-2209732495-AFP_42C74VE.jpeg?v=1772123218&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-27T03:28:36.000Z",
    "description": "Students are seen on the campus of Columbia University in New York City on April 14, 2025.Charly Triballeau | AFP | Getty ImagesFederal authorities re",
    "body": "Students are seen on the campus of Columbia University in New York City on April 14, 2025.Charly Triballeau | AFP | Getty ImagesFederal authorities released Columbia University student Elmina Aghayeva on Thursday afternoon, hours after Immigration and Customs Enforcement agents entered a university residential hall in New York City and took the native of Azerbaijan into custody, the school said.New York Mayor Zohran Mamdani earlier said President Donald Trump had called to tell him that Aghayeva would be released following a meeting at the White House, where the mayor had urged the president to set her free.Aghayeva was arrested by ICE agents at around 6:30 a.m. in Manhattan.Columbia University's acting president, Claire Shipman, accused ICE of entering university property under false pretenses.\"Our understanding at this time is that the federal agents made misrepresentations to gain entry to the building to search for a 'missing person,' \" and then detained Aghayeva, Shipman said in an email obtained by CNBC.All law enforcement agents require a judicial warrant or subpoena to enter housing and other non-public campus areas, Shipman said in the email. Agents looking to enter private campus spaces should wait until the school's public safety team has been contacted, she added.Manhattan Borough President Brad Hoylman-Sigal, in an X post, said that ICE \"used a phony missing persons bulletin\" about a 5-year-old girl.\"They purposefully deceived campus housing/security to gain entry to the student's apartment,\" Hoylman-Sigal wrote. \"The level of civil rights violations that took place is staggering.\"The federal agents identified themselves as police looking for a missing child when entering the building, Shipman alleged in a separate email to the campus community Thursday night. Camera footage showed agents in the hallway sharing pictures of the purported child, she added.Shipman added that federal agents did not produce a warrant despite repeated requests from a Columbia University public safety officer. They also refused to allow the officer to call his boss, Shipman added.\"This was a frightening and fast-moving situation and utterly unacceptable for our students and staff,\" Shipman said in the email.A Department of Homeland Security official told CNBC that ICE agents arrested Aghayeva, whose student visa was terminated by the Obama administration in 2016, after \"the building manager and her roommate let officers into the apartment.\"\"She has no pending appeals or applications with DHS,\" said the official, whose agency oversees ICE.The incident comes as Trump's focus on immigration has become a national flashpoint.Border czar Tom Homan earlier this month said the administration would wind down its immigration enforcement surge in Minnesota, an operation that sent thousands of agents to the Minneapolis area. Two U.S. citizens were killed by immigration officials this year in Minnesota, sparking backlash against the White House's efforts.Columbia has been in the Trump administration's crosshairs since the president returned to office last year.The Education Department in June said the Ivy League school did not meet its accreditation standards because it was \"in violation of federal antidiscrimination laws.\" A month later, Columbia said it would pay $200 million to the federal government to restore its funding that the Trump administration cut.Columbia student Mahmoud Khalil was released in June after three months in ICE detention.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Columbia U. student Elmina Aghayeva released from ICE custody after Trump, NY mayor meeting ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108131667-1744656364493-gettyimages-2209732495-AFP_42C74VE.jpeg?v=1772123218&w=1920&h=1080"
      ],
      "datePublished": "2026-02-27T03:28:36.000Z",
      "dateModified": "2026-02-27T03:28:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix ditches deal for Warner Bros. Discovery after Paramount’s offer is deemed superior",
    "url": "https://www.cnbc.com/2026/02/26/warner-bros-discovery-paramount-skydance-deal-superior-netflix.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108270688-1772144508274-gettyimages-2263201157-a1201249.jpeg?v=1772148874&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T23:59:44.000Z",
    "description": "Netflix CEO Ted Sarandos arrives at the White House in Washington, Feb. 26, 2026.Andrew Leyden | Getty ImagesNetflix is walking away from a deal to bu",
    "body": "Netflix CEO Ted Sarandos arrives at the White House in Washington, Feb. 26, 2026.Andrew Leyden | Getty ImagesNetflix is walking away from a deal to buy Warner Bros. Discovery's studio and streaming assets after the WBD board on Thursday deemed a revised bid by Paramount Skydance to be a superior offer. Earlier this week, Paramount raised its bid to buy the entirety of WBD to $31 per share, up from $30 per share, all cash. It was the latest amendment to Paramount's multiple offers in recent months — and since moving forward with a hostile bid to buy the company — and it's now unseated a deal between WBD and Netflix to sell the legacy media company's studio and streaming businesses for $27.75 per share. Last week, Netflix granted WBD a seven-day waiver to reengage with Paramount, resulting in the higher bid. Paramount's offer is for the entirety of WBD, including its pay-TV networks, such as CNN, TBS and TNT. Netflix had four business days to make changes to its own proposal in light of Paramount's superior bid, the WBD board said in a statement Thursday. Instead, the decision by the streaming giant to walk away puts a pin in a drawn-out saga that saw amended offers from both bidders.\"Netflix is a great company and throughout this process Ted, Greg, Spence and everyone there have been extraordinary partners to us. We wish them well in the future,\" WBD CEO David Zaslav said in a statement, referring to Netflix co-CEOs Ted Sarandos and Greg Peters and CFO Spencer Neumann. \"Once our Board votes to adopt the Paramount merger agreement, it will create tremendous value for our shareholders. We are excited about the potential of a combined Paramount Skydance and Warner Bros. Discovery and can't wait to get started working together telling the stories that move the world.\"Netflix stock spiked 10% in extended trading Thursday, while Paramount stock gained 5%. Shares of Warner Bros. Discovery fell 2%.\"The transaction we negotiated would have created shareholder value with a clear path to regulatory approval,\" Sarandos and Peters said in a statement. \"However, we've always been disciplined, and at the price required to match Paramount Skydance's latest offer, the deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid.\"The latest Paramount bid included a $7 billion breakup fee in the event the proposed merger doesn't win regulatory approval. The company also agreed to pay the $2.8 billion breakup fee that WBD would owe Netflix if that deal didn't go through. Sarandos told CNBC's Julia Boorstin in an interview last week that Netflix granted WBD the waiver to reopen Paramount talks in order to give shareholders clarity. \"Paramount had been making a ton of noise, flooding the zone with confusion for shareholders ... including floating all these hypothetical offers and talking directly to the shareholders and bypassing the Warner Bros. Discovery board,\" Sarandos said at the time. \"So we've given the opportunity to get those shareholders exactly what they deserve, which is complete clarity and certainty.\"However, Sarandos had fallen short of commenting on whether Netflix would up its own offer to match a revised Paramount bid. And Thursday, Sarandos attended meetings at the White House to discuss the potential tie-up.\"Warner Bros. is a world-class organization, and we want to thank David Zaslav, Gunnar Wiedenfels, Bruce Campbell, Brad Singer and the WBD Board for running a fair and rigorous process,\" the Netflix co-CEOs said in their statement. \"We believe we would have been strong stewards of Warner Bros.' iconic brands, and that our deal would have strengthened the entertainment industry and preserved and created more production jobs in the U.S.,\" they said. \"But this transaction was always a 'nice to have' at the right price, not a 'must have' at any price.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix ditches deal for Warner Bros. Discovery after Paramount’s offer is deemed superior",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108270688-1772144508274-gettyimages-2263201157-a1201249.jpeg?v=1772148874&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T23:59:44.000Z",
      "dateModified": "2026-02-26T23:59:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "State Farm announces $5 billion dividend; $100 average refund coming to car insurance customers",
    "url": "https://www.cnbc.com/2026/02/26/state-farm-dividend-car-insurance-customers.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108096987-1738674769552-gettyimages-2197494977-075a0064_vwfbumrp.jpeg?v=1738674795&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T22:13:51.000Z",
    "description": "watch nowState Farm on Thursday announced a historic $5 billion dividend for its car insurance members, the largest in the mutual insurance company's ",
    "body": "watch nowState Farm on Thursday announced a historic $5 billion dividend for its car insurance members, the largest in the mutual insurance company's 103-year history. \"This dividend is possible due to State Farm Mutual's financial strength and a stronger than expected underwriting performance, which has been reported industry wide,\" the company said in a statement. Customers can expect to receive refunds of $100 on average, though State Farm says the amount will vary by state and by the amount of premium paid. State Farm reports it has also lowered premiums by about 10% across 40 states, totaling $4.6 billion in cost savings for customers.That's a trend across the motor vehicle insurance industry. Auto repair costs are starting to decline, and the frequency of accidents declined in 2025. But car insurance premiums have soared. By early 2025, rates had climbed by more than 50% over three years, according to the Bureau of Labor Statistics, the highest inflation for motor vehicle insurance in 50 years.Affordability became a primary concern for many customers and led them to shop around for better deals. TransUnion recently issued a report showing insurance shopping has become a routine activity for consumers, rather than a rare event prompted by a car or home purchase.\"At this point we can safely say that regular insurance shopping is just the new normal,\" Patrick Foy, the senior director of strategic planning for TransUnion's insurance business, told CNBC in an interview. The report noted that the main drivers behind the rate shopping are economic pressures pushing consumers to find ways to reduce household expenses. At the same time, insurers are investing heavily in marketing and setting competitive rates.Travelers, Berkshire Hathaway's Geico, Root and Chubb compete with State Farm and USAA and other mutuals, where customers are also shareholders.Progressive in particular has been pressuring State Farm's dominance in auto and was among major auto insurers announcing significant financial returns to customers in 2025. The company paid $1 billion in dividends to its customers in Florida, where state laws require insurers to return excess profits. USAA announced a $3.8 billion payout to its members across states in 2025. The auto insurance business represents 63% of State Farm's property and casualty insurance business. Customer loyalty in auto insurance often leads to loyalty in homeowner's insurance too, where State Farm told CNBC it is not seeing its claims costs subsiding and it's still working to charge adequate rates to compensate. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "State Farm announces $5 billion dividend; $100 average refund coming to car insurance customers",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108096987-1738674769552-gettyimages-2197494977-075a0064_vwfbumrp.jpeg?v=1738674795&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T22:13:51.000Z",
      "dateModified": "2026-02-26T22:13:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Novartis, Genentech file suit alleging illegal importation of prescription drug",
    "url": "https://www.cnbc.com/2026/02/26/novartis-genentech-sue-alleging-illegal-importation-of-prescription-drug.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217126-1761567809501-gettyimages-2233897287-AFP_73VA2G3.jpeg?v=1772141306&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T21:39:33.000Z",
    "description": "A sign of Swiss pharmaceutical giant Novartis is seen on the top of a building in Basel, Switzerland, Sept. 9, 2025.Fabrice Coffrini | AFP | Getty Ima",
    "body": "A sign of Swiss pharmaceutical giant Novartis is seen on the top of a building in Basel, Switzerland, Sept. 9, 2025.Fabrice Coffrini | AFP | Getty ImagesNovartis, one of the world's largest pharmaceutical companies, and Genentech, a major biotech firm, say they've uncovered a \"dangerous scheme\" to import their allergy medication from Canada into the U.S. in violation of U.S. Food and Drug Administration regulations.Both are suing SHARx — a so-called alternative funding program — and a Canadian pharmacy over the importation of Xolair, an injectable prescription medication for patients with severe asthma, food allergies and respiratory conditions, to an allergy and asthma center in Michigan.\"Biological medicines, like the U.S. Xolair medicine, require particular care because their complex composition and sensitivity to variation in storage and handling conditions are susceptible to contamination and degradation that could undermine their safety and efficacy,\" according to the lawsuit, filed on Feb. 2 in U.S. District Court in Michigan.The suit said the scheme circumvents FDA regulations that generally prohibit importation of unapproved medications from overseas. The plaintiffs are asking the court to stop the importation of the drug. The lawsuit comes on the heels of a CNBC investigation that revealed a growing class of businesses called alternative funding programs, or AFPs, which promise to connect patients with more affordable options for accessing medications that often come at very high costs. The AFPs are able to obtain the overseas drugs at a substantially reduced price.Federal authorities told CNBC last year that importing medications from foreign markets is illegal and could pose risks to patients' health.watch nowAFPs contract with employer-sponsored health plans to offer coverage on specialty drugs. They often work with private employers, school districts, local governments and unions.CNBC's investigation revealed that in at least one case, an employer required its staff to obtain their high-cost medication through SHARx or said it wouldn't be covered. SHARx last year defended its business model, telling CNBC it provides an alternative to expensive drugs in the U.S. SHARx, which is based in St. Louis, Missouri, did not respond to CNBC's request for comment about the lawsuit.According to the complaint, the shipment of Xolair to the Michigan allergy center came from Campbell Heights Pharmacy in British Columbia, Canada. The pharmacy also did not respond to a request for comment.The suit said SHARx \"continues to brazenly deceive patients into believing they are receiving the same safe, securely supplied medicines that they would receive from a U.S. retail pharmacy.\"The drug has strict shipping and temperature controls, the suit said.Drugs not approved for the U.S. market that are shipped from overseas can result in contamination, potentially leading to \"serious patient injury and even death,\" the suit said.A separate lawsuit, filed in late 2024 by Gilead Sciences, similarly alleges that other alternative funding programs illegally import medications. The AFPs in the case, which is pending, have denied any wrongdoing.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Novartis, Genentech file suit alleging illegal importation of prescription drug",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217126-1761567809501-gettyimages-2233897287-AFP_73VA2G3.jpeg?v=1772141306&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T21:39:33.000Z",
      "dateModified": "2026-02-26T21:39:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FanDuel parent Flutter reports disappointing fourth-quarter earnings",
    "url": "https://www.cnbc.com/2026/02/26/fanduel-parent-flutter-flut-q4-2025-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217313-1761583003824-gettyimages-2155741121-AFP_34VQ69G.jpeg?v=1761583032&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T22:44:18.000Z",
    "description": "watch nowFanDuel parent Flutter Entertainment announced fourth-quarter earnings Thursday that missed Wall Street expectations on nearly every metric. ",
    "body": "watch nowFanDuel parent Flutter Entertainment announced fourth-quarter earnings Thursday that missed Wall Street expectations on nearly every metric. FanDuel's performance in the final quarter of 2025 was affected by bettors losing more often than usual.  When that happens, gamblers get discouraged, bet less and stop using the app as frequently, Flutter CEO Peter Jackson told CNBC in an interview.\"It's fair to say, not everything went our way in the fourth quarter,\" Jackson said. Shares of Flutter fell almost 7% in extended trading Thursday. Here's what the company reported for the fourth quarter, compared with Wall Street consensus: Revenue: $4.74 billion vs. $4.97 billion, according to LSEGAdjusted EPS: $1.74 vs. $1.95, according to LSEGFor the fourth quarter, Flutter reported adjusted earnings before interest, taxes, depreciation and amortization of $832 million, below the $893 million that Wall Street was expecting, according to StreetAccount. Its fourth-quarter revenue marked a year-over-year increase of 25%. And yet, Flutter's 2026 revenue guidance of $17.75 billion to $19.05 billion was lower than analysts' projection of $19.34 billion for the year. On the company's earnings call, Jackson told investors that prediction markets would likely spur more legalization of sports betting by the states. He also said the company has found no evidence that prediction markets are cannibalizing the sportsbook business. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FanDuel parent Flutter reports disappointing fourth-quarter earnings",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217313-1761583003824-gettyimages-2155741121-AFP_34VQ69G.jpeg?v=1761583032&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T22:44:18.000Z",
      "dateModified": "2026-02-26T22:44:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Congress takes on Nvidia, White House as it pushes for chip export limits",
    "url": "https://www.cnbc.com/2026/02/26/congress-pushes-back-on-nvidia-white-house-with-chip-export-limits.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108268614-17718674082026-02-23t172218z_1223791976_rc2rrja8p5go_rtrmadp_0_usa-trump-speech.jpeg?v=1771867454&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T17:41:11.000Z",
    "description": "Republican lawmakers are pushing to place limits on the ability of U.S. companies to sell advanced semiconductors to China — an effort that has run af",
    "body": "Republican lawmakers are pushing to place limits on the ability of U.S. companies to sell advanced semiconductors to China — an effort that has run afoul of some key figures in the Trump administration.The effort also pits China hawks on the Hill against Nvidia CEO Jensen Huang, who has repeatedly made the pitch to lawmakers and government official that the more U.S. chips are used in China, the more U.S. companies will be a leader in the space. House Foreign Affairs Committee Chairman Brian Mast, R-Fla., is at the forefront of ensuring artificial intelligence and chips are being viewed as a national security asset — and he isn't afraid to call Huang out directly.  \"The joke here is, Jensen wants us to trust the CCP,\" Mast told CNBC in an interview, referring to the Chinese Communist Party. \"Anybody watching this should laugh.\"In the latest salvo, the House Foreign Affairs Committee advanced legislation that would allow Congress 30 days to review and block sales of advanced chips to adversarial countries — similar to the power Congress has with arms and weapons sales. It would also cancel all existing export licenses to countries like China until the government submits a detailed strategy about how the chips would impact military and intelligence. All but two members of the committee voted to advance the measure. There is already a companion bill in the Senate with bipartisan backing from Sens. Jim Banks, R-Ind., and Elizabeth Warren, D-Mass.\"We are in an AI arms race, and it's important that we know where the AI arms dealers are selling,\" Mast said in the interview. He said while Congress has no right to interfere with chips being sold for video games and other commercial purposes, \"when it blends into the world of now, it's real war, real weapon systems, real casualties at the highest level of all militaries, yeah, we're going to have a say.\"Mast added that Huang \"might not like it, but that's what's going to take place.\"Nvidia said in a statement to CNBC the likelihood of China's military using American chips was low as \"it makes no sense for the Chinese military to depend on American technology.\"The company added that the \"administration's critics are unintentionally promoting the interests of foreign competitors — America should always want its industry to compete for vetted and approved commercial businesses, and thereby protecting national security, creating American jobs, and keeping America's lead in AI.\"Mast, a supporter of Trump's, said the committee was in sync with the White House, and the bill codified provisions in a recent Commerce Department regulation that permitted the sale of advanced chips to China. Both the bill and regulation ban advanced chips from being licensed in a way that could benefit the Chinese military, although the Commerce Department doesn't give lawmakers the power to block a sale. Despite strong support, the bill faces an uphill climb to get to the floor. Ahead of the vote in committee, David Sacks, the White House's AI czar, retweeted a post from the X account Wall Street Mav that slammed the bill, saying it \"handicaps Trump's ability to strategically position the USA favorably against China.\"Sacks quoted the tweet, adding \"Correct.\"Mast pushed back, saying that the talking points of the accounts Sacks boosted matched the talking points he'd heard from Nvidia. \"What he was promoting was literally mercenary influencers, about a dozen of them, telling literal lies,\" Mast said. Mast said he worked with others in the administration on the bill prior to the vote in committee. The White House did not respond to a request for comment. The committee isn't done with its oversight of chips. Mast is also planning a vote on a bill requiring exported advanced chips contain a mechanism to verify their location — and would require exporters to flag the government if a chip wound up in an unauthorized location. The bill, known as the Chip Security Act, has bipartisan support in both the House and the Senate",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Congress takes on Nvidia, White House as it pushes for chip export limits",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108268614-17718674082026-02-23t172218z_1223791976_rc2rrja8p5go_rtrmadp_0_usa-trump-speech.jpeg?v=1771867454&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T17:41:11.000Z",
      "dateModified": "2026-02-26T17:41:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Some student loan borrowers are getting Navient settlement checks — here's who qualifies",
    "url": "https://www.cnbc.com/2026/02/26/navient-settlement-checks-student-loans.html",
    "image": "https://image.cnbcfm.com/api/v1/image/103884632-10442359_468792223264087_7582234042447323184_n.jpg?v=1529472485&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T20:18:33.000Z",
    "description": "Source: NavientSome student loan borrowers can soon expect a check in the mail, more than a year after the Consumer Financial Protection Bureau reache",
    "body": "Source: NavientSome student loan borrowers can soon expect a check in the mail, more than a year after the Consumer Financial Protection Bureau reached a $120 million settlement with former federal servicer Navient. The CFPB said Navient steered student loan borrowers away from affordable repayment plans and into expensive forbearances, causing many to pay steep interest charges.\"People suffered real consequences — delaying children, not buying homes or returning to school when they wanted to, and more,\" said consumer advocate Julia Barnard, who was the top student loan official at the CFPB when the settlement was announced. \"These checks are necessary and will help make debtors whole after the harm they faced due to Navient's misconduct.\" A Navient spokesperson, at the time of the settlement, said it disagreed with the CFPB's allegations.Read more CNBC personal finance coverageSome student loan borrowers are getting Navient settlement checks — who qualifiesTrump accounts aren't exactly 'tax-free,' as the president said. How they workTrump said beef, egg and chicken prices are falling. Here's what the data showsTrump pitches new retirement plan with a match of up to $1,000 — who may benefitThink of active managers and index funds as portfolio 'teammates,' not 'rivals': CFPMany workers want a career change. Are you one of them?ACA health coverage subsidy lapse hit 22 million people. Here are some of their storiesTrump's $2,000 tariff dividend checks just got a lot less likely, experts sayStudent loan forgiveness is taxable again. How to plan for a five-figure IRS billWhat the Trump administration's Harvard lawsuit could mean for future applicantsHomebuyers are paying more for credit checks. Here's whyTrump accounts have 'more unanswered questions than answered,' expert saysTreasury: Trump accounts sign up about 3 million kids in early pushAverage IRS tax refund is up 14.2%, according to early filing dataStudent loan delinquency rate jumps to nearly 25% in Trump's second term: analysisCNBC's Financial Advisor 100: Best financial advisors, top firms rankedAt one point, Navient was the largest student loan servicer in the U.S., managing the accounts of more than 12 million people. As part of the settlement, the CFPB banned the company from handling federal education loans, although it continues to play a role in the private student loan market. More than 42 million Americans hold student loans, and the outstanding debt exceeds $1.6 trillion, according to the Congressional Research Service.Here's what borrowers should know about the settlement compensation. Qualifying borrowers are those put in forbearanceIf you had federal student loans with Navient and your account was placed in a forbearance in 2017 or earlier, you may qualify to receive a check, said higher education expert Mark Kantrowitz. Over the years, the U.S. Department of Education has transferred many borrowers between student loan servicers, once or even multiple times. You should be able to pull up a record of the companies that have managed your debt at Studentaid.gov. Navient's federal student loan accounts were originally transferred to Mohela, and may have subsequently been switched to Aidvantage, Nelnet or EdFinancial.Asked this week about the settlement payments, Cate Fitzgerald, a spokesperson for Navient, said, \"the CFPB is responsible for administering the funds and, under our agreement, identifying the borrowers who will receive them.\"The CFPB did not respond to a request for comment. On its website, the bureau directs consumers with questions about settlement compensation to call the third-party payments administrator, Rust Consulting, at 1-800-711-8418 or email navient_info@rustcfpbconsumerprotection.org. At least 100,000 borrowers may get a checkThe CFPB has not shared the number of borrowers who will be compensated under the settlement. However, Kantrowitz estimates that at least 100,000 people could get a check, based on his analysis of historical data of Navient borrowers in forbearance. The typical payment will likely be several hundred dollars, Kantrowitz said. Borrowers on Reddit have so far reported settlement payments of up to $2,000. \"I'm happy to see that debtors are already receiving these checks that they're entitled to,\" Barnard said. Financial consequences of forbearances When a borrower enters forbearance, they are not required to make payments, but interest typically continues to accrue on their loans. As the Navient settlement showed, forbearances can be costly for borrowers. While it can be tempting to put your loan payments on hold, your balance can grow much larger and, therefore, be harder to repay when the relief period ends. In March 2017, the average loan amount in forbearance by Navient was around $43,000, Kantrowitz found. That means a borrower's balance would spike by nearly $3,000 each year their bill was paused, assuming a 6.8% interest rate, he estimated. Borrowers are better off finding a repayment plan they can afford, consumer advocates say.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Some student loan borrowers are getting Navient settlement checks — here's who qualifies",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/103884632-10442359_468792223264087_7582234042447323184_n.jpg?v=1529472485&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T20:18:33.000Z",
      "dateModified": "2026-02-26T20:18:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Women’s wealth is expected to boom: Where they are investing and how they can maximize returns",
    "url": "https://www.cnbc.com/2026/02/26/womens-wealth-is-expected-to-boom-where-they-are-investing-and-how-they-can-maximize-returns.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108270136-1772055844310-gettyimages-1366137991-dsc00918.jpeg?v=1772055877&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T20:39:43.000Z",
    "description": "Women investors are stepping up their game, gaining confidence and taking some more risks. Yet they still lag their male counterparts when it comes to",
    "body": "Women investors are stepping up their game, gaining confidence and taking some more risks. Yet they still lag their male counterparts when it comes to the amount of money they are putting to work in the market.But women are expected to see an influx of wealth as part of what is being coined the \"Great Wealth Transfer.\" Cerulli Associates anticipates $105 trillion in wealth will be passed down to heirs through 2048, with about $54 trillion of that inheritance going to spouses. Women, on average, live nearly 6 years longer than men, according to the Centers for Disease Control and Prevention. That makes them more likely to be the prime recipients of that wealth. \"We're about to see this massive change in terms of who is going to control wealth,\" said Stephanie Link, chief investment strategist and portfolio manager at wealth management firm Hightower Advisors. See Stephanie Link live here: CNBC Pro Live — Wealth for Women - You're invited to join us for an exclusive, live, in-person event on May 28 at the NASDAQ MarketSite designed specifically for serious investors who demand more than surface-level market commentary. More details below.Women commanded $18 trillion of investable assets in the United States in 2023, representing 34% of the assets under management, according to McKinsey & Company. That figure is expected to nearly double to $34 trillion by 2030, or about 38% of total U.S. assets, the consulting firm found. We've seen an improvement in terms of those that are getting more sophisticated, but we have a long, long way to go.Stephanie LinkHightower AdvisorsWhile the transfer of wealth is one way to narrow the gender investing gap, women are still earning less than men in the workplace. Women employed full time in the United States are typically paid 81 cents to every dollar paid to men, according to the National Women's Law Center. That has led to a gap in retirement savings, said Veronica Willis, global investment strategist at Wells Fargo Investment Institute. Willis co-authored the firm's 2025 \"Women and Investing\" report.  \"We have seen some signs that the gap is starting to close, but there is still some work to do,\" she said. How women investWomen are more likely to describe their investing approach as conservative, according to Wells Fargo's research. Link said she sees that with her female clients, who aren't focused on the beating the S&P 500 and instead want to preserve the wealth they have. \"We've seen an improvement in terms of those that are getting more sophisticated, but we have a long, long way to go,\" Link added.In fact, women are leaning a little less conservative these days and are actually taking a bit more risk, Willis said. They are also gaining confidence in their ability to invest, she noted. Some 71% of women said they invested in the stock market in 2024, up from 60% the year prior, according to a survey by Wells Fargo. Gen Z and millennials led the way. In fact, the firm's analysis found that the performance of single female and female-led accounts  over a seven-year period were similar to that of single male and male-led accounts. However, the female-led accounts had the highest risk-adjusted returns, Willis said. \"Women tend to be less likely to check those accounts every day, which means that they're less likely to make as many trades,\" she explained. \"That willingness to stick to an investment plan … works in the favor of these women.\"Maximize returnsPrasit photo | Moment | Getty ImagesInvestors should assess their goals to understand how they should be investing, Willis said. Then they should ensure they have the right allocations in their portfolio so their investments grow over time, she noted.\"[Make] sure that you have a good mix of equities, as well as some assets that are going to diversify a little bit of that equity risk,\" she said. \"[Resist] that urge to fly to safety, be in cash or all fixed income types of assets when it comes to that retirement bucket.\"Shannon Saccocia, chief investment officer at NB Private Wealth, likes to break it down by age groups.Women should start investing early, with those in their 20s and 30s focusing on discipline to create strong financial habits, she said.By the time they reach their later 30s and 40s, they should have started to accumulate some wealth, she noted. \"They also, however, should consider incorporating broader financial advice — not just how to allocate their 401(k) and optimizing their savings, but understanding that the working capital generated from working is a meaningful input in their financial equation,\"  Saccocia said. That includes issues around workplace compensation and the best ways to diversify equity ownership, she noted.Later in life, women should be honest about what they want both during and after their lifetimes. \"Who will continue their legacy? How do they think about balancing lifestyle, philanthropy, and generational wealth transfer? These should be clearly articulated as part of the conversation with their advisors,\" Saccocia said. For Hightower's Link, education is key. Start reading, find an advisor who can help you meet your goals and talk with other women, whether it is over a Mahjong game or in an investing group, she said. watch nowFor those who want to start investing, the best advice she got was from her father just after she graduated college in 1992. \"You start very early to invest, and when you're younger, you can take more risk … you want to have more equity exposure versus fixed income exposure,\" she said. \"You want to start to dollar cost averaging.\"Dollar cost averaging allows investors to build positions over time and at varying prices. Investors can take a certain amount — even $10, $50, $100 — directly out of their bank account and put it onto an exchange-traded fund that tracks the S&P, she said.Those who have 401(k)s can have funds directly taken out of their paycheck. \"You'll never miss it, and over time, you'll be very thankful and very grateful that you did this, because you're not going to be able to time the market,\" Link said.An Exclusive Invitation: CNBC Pro Live — Wealth for Women: You're invited to join us for an exclusive, live, in-person event on May 28 at the NASDAQ MarketSite designed specifically for serious investors who demand more than surface-level market commentary. CNBC Contributors will present a series of \"strategy salons\" designed to offer personalized, empathetic and actionable financial growth strategies. Attendees will have an opportunity to ask their questions and get answers about how to navigate the changing investment landscape.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Women’s wealth is expected to boom: Where they are investing and how they can maximize returns",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108270136-1772055844310-gettyimages-1366137991-dsc00918.jpeg?v=1772055877&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T20:39:43.000Z",
      "dateModified": "2026-02-26T20:39:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CoreWeave shares slip 8% as quarterly revenue guidance disappoints",
    "url": "https://www.cnbc.com/2026/02/26/coreweave-crwv-q4-earnings-report-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108202347-1762897600925-108202347-17585672832025-09-22t184637z_1258133780_rc22xga69myb_rtrmadp_0_usa-stocks.jpeg?v=1772139645&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-27T00:38:44.000Z",
    "description": "Michael Intrator, Chief Executive Officer of CoreWeave Inc., speaks during an interview with CNBC on the floor at the New York Stock Exchange (NYSE) i",
    "body": "Michael Intrator, Chief Executive Officer of CoreWeave Inc., speaks during an interview with CNBC on the floor at the New York Stock Exchange (NYSE) in New York City, U.S., Sept. 22, 2025.Jeenah Moon | ReutersCoreWeave shares fell 8% in extended trading on Thursday after the artificial intelligence-focused cloud infrastructure provider delivered light revenue guidance for the current quarter.Here's how the company did in comparison with LSEG consensus:Loss per share: 89 cents. That might not compare with the LSEG consensus of a loss of 49 centsRevenue: $1.57 billion vs. $1.55 billion expectedCoreWeave's revenue grew 110% year over year in the fourth quarter, according to a statement.The company called for $1.9 billion to $2 billion in first-quarter revenue, below the $2.29 billion LSEG consensus.For all of 2026, CoreWeave sees $12 billion to $13 billion in revenue. Analysts polled by LSEG had anticipated $12.09 billion.Nvidia graphics chips, which lie at the core of CoreWeave's offering, remain in short supply, CoreWeave CEO Mike Intrator said on a conference call with analysts. Average prices for Nvidia's H100 processors in the fourth quarter were within 10% of where they started the year, and older A100 prices increased in 20205, Intrator said.CoreWeave had 850 megawatts in active power capacity at the end of the year, while contracted power stood at 3.1 gigawatts. Analysts polled by LSEG had been projecting about 827 megawatts in active power. The company is targeting $30 billion to $35 billion in capital expenditures for 2026, up from $10.31 billion in 2025. It intends to end 2026 with over 1.7 gigawatts of active power, which is higher than Visible Alpha's consensus of 1.59 gigawatts, and add over five gigawatts beyond its contracted footprint by 2030.\"Not only are we seeing the proliferation of demand across the economy going from where was initially really housed within the hyperscaler clouds and the foundation models,\" Intrator said. \"You're now seeing it kind of explode into the enterprise. You're seeing it move into sovereign. You're seeing all these new participants beginning to come in and securing the infrastructure that they need.\"CoreWeave quickly resolved delays it disclosed in November, Intrator said.\"We brought in data center technicians from across our entire portfolio, so that we have enough bodies to build at maximum speed,\" he told CNBC in an interview, adding that third-party vendors also helped.A backlog of revenue swelled to $66.8 billion from $55.6 billion at the end of the third quarter. The company's weighted contract length has increased to five years from four at the end of 2024, Intrator said.Adjusted earnings before interest, tax, depreciation and amortization, at $898 million, came in below StreetAccount's $929 million consensus.\"We made the decision intentionally to go ahead and build more faster, and that is being driven by the fact that our clients are desperate to get access to more infrastructure faster,\" Intrator told CNBC. He said he was willing to take a short-term margin hit as the company adds capacity.After going public last March, CoreWeave reported $21.37 billion in debt as of Dec. 31.AI has become a greater concern for software investors in recent weeks, with announcements from Anthropic leading to sharp selling. CoreWeave supplies AI model makers such as Google and OpenAI, and its stock was up 36% so far in 2026 as of Thursday's close, while the iShares Expanded Tech-Software Sector Exchange-Traded Fund is down nearly 22% in the same period.During the quarter, CoreWeave announced a deal with model builder Poolside and introduced an object storage service. The company also said it increased a credit facility to $2.5 billion from $1.5 billion.CoreWeave continues to be a specialist in cloud infrastructure, although the storage launch will help it compete with larger entities, such as Amazon Web Services.WATCH: CoreWeave shares jump 14% intraday after news of Nvidia investmentwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CoreWeave shares slip 8% as quarterly revenue guidance disappoints",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108202347-1762897600925-108202347-17585672832025-09-22t184637z_1258133780_rc22xga69myb_rtrmadp_0_usa-stocks.jpeg?v=1772139645&w=1920&h=1080"
      ],
      "datePublished": "2026-02-27T00:38:44.000Z",
      "dateModified": "2026-02-27T00:38:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russia says Cuba situation is escalating after deadly incident with U.S.-tagged speedboat",
    "url": "https://www.cnbc.com/2026/02/26/cuba-crisis-russia-boat-incident-florida-trump-oil.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108270298-1772102013218-gettyimages-2263011200-AFP_98YG6LB.jpeg?v=1772102103&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T15:15:19.000Z",
    "description": "Cuban coast guard ships docked at the port of Havana on February 25, 2026. Cuba's coast guard said on February 25, 2026, it shot dead four people and ",
    "body": "Cuban coast guard ships docked at the port of Havana on February 25, 2026. Cuba's coast guard said on February 25, 2026, it shot dead four people and wounded six others traveling in a US-registered speedboat during an exchange of fire near Cuba's shores that came amid heightened tensions with Washington.Adalberto Roque | Afp | Getty ImagesThe Kremlin on Thursday said that the situation in fuel-starved Cuba is intensifying after a deadly incident with a U.S.-registered speedboat off the coast of the Caribbean island. \"We see that the situation around Cuba is escalating,\" Kremlin spokesperson Dmitry Peskov told reporters, according to Russian state news outlet RIA Novosti.\"The most important thing is the humanitarian component. Of course, the humanitarian issues of Cuban citizens must be resolved, and no one should create obstacles,\" Peskov said. The comments come shortly after Cuba's Interior Ministry said border guards killed four exiles and wounded six others onboard a Florida-tagged speedboat that entered its territorial waters. The 10 passengers of the vessel were said to have opened fire on a Cuban patrol off the northern coast of the island. The individuals, all of whom were Cuban nationals residing in the U.S., were armed and some had previous criminal records, Cuba's Interior Ministry said. It added that assault rifles, handguns, improvised explosive devices and camouflage uniforms were among the items seized from the boat.U.S. Secretary of State Marco Rubio described the incident as \"highly unusual\" and said the White House would \"respond appropriately\" once it had conducted an independent investigation. Read moreCuba is currently grappling with a worsening economic crisis amid a U.S. oil blockade. The Trump administration has effectively cut Cuba off from Venezuelan oil since launching a military operation to seize Venezuelan President Nicolás Maduro on Jan. 3. Cuba said 32 of its citizens were killed in the attack.U.S. President Donald Trump has since said Cuba's government poses \"an unusual and extraordinary threat\" and pledged to impose tariffs on any country that supplies it with oil. US Secretary of State Marco Rubio speaks to reporters in a departure lounge before returning to Washington following meetings with Caribbean Community (CARICOM) leaders, at Robert L. Bradshaw International Airport in Basseterre, Saint Kitts and Nevis on February 25, 2026.Jonathan Ernst | Afp | Getty ImagesCuba, which has condemned U.S. pressure, has adopted measures to protect essential services and ration fuel supplies for key sectors. The United Nations has warned of a possible humanitarian \"collapse\" in Cuba as the country's oil supplies dwindle.Mexico, for its part, sent a new shipment of humanitarian aid to Cuba this week. The ships set sail from the port of Veracruz on Tuesday with a total of roughly 1,200 metric tons of food supplies, according to Mexico's Foreign Ministry. \"The people of Mexico maintain their tradition of solidarity with the peoples of Latin America, and particularly with the people of Cuba. Our country has always provided assistance to our sister nations in need,\" the ministry said in a statement.The food supplies are expected to arrive in Cuba on Saturday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russia says Cuba situation is escalating after deadly incident with U.S.-tagged speedboat",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108270298-1772102013218-gettyimages-2263011200-AFP_98YG6LB.jpeg?v=1772102103&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T15:15:19.000Z",
      "dateModified": "2026-02-26T15:15:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration faces first big tariff refund court deadline on Friday ",
    "url": "https://www.cnbc.com/2026/02/26/trump-tariff-refunds-doj-court-deadline.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108270656-1772140816580-gettyimages-2211124251-US_TRADE_COURT.jpeg?v=1772140832&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T22:34:35.000Z",
    "description": "The US Court of International Trade in New York, US, on Thursday, April 24, 2025. Bloomberg | Bloomberg | Getty ImagesThe Trump administration's Depar",
    "body": "The US Court of International Trade in New York, US, on Thursday, April 24, 2025. Bloomberg | Bloomberg | Getty ImagesThe Trump administration's Department of Justice is nearing its first big legal deadline in the wake of the U.S. Supreme Court ruling that President Donald Trump's tariffs issued under the International Emergency Economic Powers Act are illegal.The DOJ needs to weigh in by Friday on one of the first legal fights over refunds in which plaintiffs are asking for expedited payment of tariff refunds through the Court of International Trade (CIT), which has typically handled tariff cases.Trade attorneys have told CNBC there are upwards of 2,000 cases that have been filed by companies suing for tariff refunds at the CIT. Back in December, the CIT put a stay on the cases until after the Supreme Court announced its decision.After the Supreme Court ruling, one of the plaintiffs, V.O.S., filed a motion for its case, which was in federal appeals court pending the Supreme Court decision, to be moved as soon as possible through the Court of International Trade for refund payment. The federal district court sent a motion to the Department of Justice, asking for the DOJ to respond on or before February 27 to allow the case to go back to the CIT for its ruling. As of Thursday afternoon, there had been no filing by the DOJ. It did not respond to CNBC's request for comment.The Supreme Court gave the government court system 32 days to decide on next steps after its ruling.  While the case only covers one group of small businesses, it has legal implications for many cases, the plaintiffs said in their filing: \"This Court's prompt action in this case will facilitate the prompt payment of refunds to the numerous other plaintiffs that have filed and will file IEEPA tariff challenges in this Court. ... the refund process in this case can be used as a template for providing swift relief in those other actions as well.\"Trade attorneys and customs experts tell CNBC approximately 300,000 shippers have paid the tariffs and by some estimates there is as much as $175 billion in potential refunds. More companies have sued in the wake of the Supreme court decision, including a case filed last week by FedEx after the Supreme Court ruling. The DOJ response to the court request may begin to reveal how the Trump administration plans to navigate the refund process. President Trump said at a press conference last Friday that it could take years to litigate the tariff refund issue. Democrats on Capitol Hill have been pressing for a plan from the administration to repay the tariffs since last Friday, citing the fact that it had months to prepare for an adverse ruling. Treasury Secretary Scott Bessent said in an interview last Friday on Fox News it \"could take years to litigate and get to a payout. If there is a payout, it looks like it's just going to be the ultimate corporate welfare.\"The plaintiffs state in their motion that they want to require the government to issue the administrative orders necessary to \"promptly effectuate the invalidation of the IEEPA tariffs — including any administrative orders necessary to ensure that Plaintiffs swiftly receive the refunds, with interest, that the government has committed to provide.\"While the motion says the plaintiffs do not expect the government to oppose the court, \"the Administration's recent public statements suggest that injunctive relief from this Court will be necessary to ensure the government promptly adheres to its commitments to pay.\"Trade experts have said that while the Court decision did not specifically weigh in on the tariff process — it was only Justice Brett Kavanaugh in his dissent who said it could be a \"mess\" — refunds are due to companies.\"It is clear that the importers of record that paid the unlawful tariffs are entitled to the amounts they paid,\" said Pratik A. Shah, lead attorney for Learning Resources Supreme Court Case and head of the Supreme Court practice at Akin Gump Strauss Hauer & Feld. \"There is no doubt that people that paid the IEEPA tariffs should get refunds. The only question is the process by which refunds will be made.\"watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration faces first big tariff refund court deadline on Friday ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108270656-1772140816580-gettyimages-2211124251-US_TRADE_COURT.jpeg?v=1772140832&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T22:34:35.000Z",
      "dateModified": "2026-02-26T22:34:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Democratic senators press Commerce Secretary Lutnick on conflict of interest concerns in USA Rare Earth deal",
    "url": "https://www.cnbc.com/2026/02/26/warren-lutnick-usa-rare-earth-usar-critical-minerals.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108133387-1744900687913-108133387-17449005912025-04-08t162310z_1392428932_rc2stdarxtul_rtrmadp_0_usa-trump-tariffs-greer-1.jpg?v=1769189864&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T15:01:43.000Z",
    "description": "U.S. Senator Elizabeth Warren (D-MA) speaks as U.S. Trade Representative Jamieson Greer testifies before a Senate Finance Committee hearing on U.S. Pr",
    "body": "U.S. Senator Elizabeth Warren (D-MA) speaks as U.S. Trade Representative Jamieson Greer testifies before a Senate Finance Committee hearing on U.S. President Donald Trump's trade policy, on Capitol Hill in Washington, D.C., U.S., April 8, 2025.Kevin Mohatt | ReutersDemocratic senators flagged conflict of interest concerns over the involvement of Commerce Secretary Howard Lutnick's former firm, Cantor Fitzgerald, in a deal with critical minerals startup USA Rare Earth.Sens. Elizabeth Warren of Massachusetts, Chris Van Hollen of Maryland, and Ron Wyden of Oregon, the top Democrat on the Finance Committee, said in a letter obtained by CNBC that the deal raises questions about whether Lutnick's immediate family members may have benefited financially. \"It is imperative that federal investments in critical industries be made free from conflicts of interest and on the merits,\" the senators told Lutnick in the letter dated Feb. 25, requesting more information about his involvement in the transaction. The Commerce Department issued a letter of intent last month to provide USA Rare Earth with $1.6 billion in funding to help scale up the company's planned rare earth mining and magnet manufacturing business. The deal required USA Rare Earth to secure at least $500 million in private funding. USA Rare Earth selected Cantor as the \"lead placement agent\" for a fundraising round that totaled $1.5 billion, according to a financial filing.   Lutnick stepped down last year as chairman and CEO of Cantor to lead Commerce. His son Brandon took the reins as chairman and his son Kyle was named executive vice chairman. Lutnick transferred his stake in Cantor to his sons and other adult children through trusts controlled by Brandon. \"We have serious concerns about the Commerce Department's decision to enter this deal in which your former firm, run by your sons, has a clear financial interest,\" the senators said. \"Given your close ties to Cantor, and Cantor's apparent financial interest in USAR, the Commerce Department's investment should be closely scrutinized,\" they said. CNBC has reached out to the Commerce Department for comment. watch nowThe Cantor-led fundraising round was a type of transaction called private investment in public equity, or PIPE. In these transactions, a placement agent usually sells discounted shares to a restricted pool of investors while receiving a fee, the senators wrote. \"If the PIPE funds were raised under these circumstances, then it appears that, in order to secure public funds from the government agency you lead, USAR paid your family's company to raise matching private funds,\" the senators said. The senators also raised concerns that financial firms led by donors to President Donald Trump's campaigns and inaugural committees participated in the fundraising for USA Rare Earth. They include Blackstone co-founder and CEO Stephen Schwarzman, Citadel founder Ken Griffin, and Point72 Asset Management founder Steven Cohen, according to a financial filing. Schwarzman donated to Trump's super PAC, Griffin gave funds to the president's 2025 inaugural committee and Cohen donated to his first-term inauguration.\"It is unclear how or why these supporters of the Trump administration became involved in the USAR PIPE, or the extent to which they were aware of the Commerce Department's direct investment in USAR,\" the senators said. Griffin has made donations to multiple presidents across administrations, Citadel spokesperson Zia Ahmed said. \"The USA Rare Earth investment was made by a Citadel-managed fund, not by Ken Griffin personally,\" Ahmed said. CNBC has reached out to Blackstone and Point72 for comment.The letter requests information on when Lutnick became aware of Cantor's representation of USA Rare Earth in the fundraising round and whether he or Commerce had any involvement in it, among other questions. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Democratic senators press Commerce Secretary Lutnick on conflict of interest concerns in USA Rare Earth deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108133387-1744900687913-108133387-17449005912025-04-08t162310z_1392428932_rc2stdarxtul_rtrmadp_0_usa-trump-tariffs-greer-1.jpg?v=1769189864&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T15:01:43.000Z",
      "dateModified": "2026-02-26T15:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Small investors buy Nvidia in record numbers after Thursday's open",
    "url": "https://www.cnbc.com/2026/02/26/small-investors-buy-nvidia-in-record-numbers-after-thursdays-open.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229156-1763651123145-gettyimages-2246743088-raa-nvidiaph251118_nprRy.jpeg?v=1772124975&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T17:14:26.000Z",
    "description": "Jonathan Raa | Nurphoto | Getty ImagesRetail investors rushed into Nvidia on Thursday following the chipmaker's latest earnings report, according to V",
    "body": "Jonathan Raa | Nurphoto | Getty ImagesRetail investors rushed into Nvidia on Thursday following the chipmaker's latest earnings report, according to VandaTrack.Mom-and-pop traders recorded their highest levels of net buying in the stock during the first 80 minutes of a trading day going back to at least 2012, according to analyst Viraj Patel. Retail is not behind the selling that led to a lackluster reaction to the blockbuster results, Patel said.There's a caveat: Patel said there's strong selling in addition to buying in the chipmaker. That can help explain the stock's rocky action in morning trading, he added.\"Flows have been two-way,\" Patel wrote in a Thursday note. \"Total retail turnover in [Nvidia] has been pretty epic too at the start of the session.\"Thursday's action comes on the heels of the AI darling's earnings, which beat analyst expectations and came with strong guidance. Nvidia also reported 75% revenue growth in its core data center business, which helped drive the company's overall sales up 73%.Despite trading modestly higher before the bell, shares were lower by more than 4% in midday trading.Stock Chart IconStock chart iconNvidia, 1-day chartBroadcom, the iShares Expanded Tech-Software Sector ETF (IGV) and the iShares Semiconductor ETF (SOXX) have seen \"spillover buying\" as retail investors up their activity more broadly, Patel said.\"If this continues, then we may be on track for one of the biggest days of retail buying of single stocks in months, which matters a lot for the overall risk view,\" Patel said.To be sure, everyday traders were relatively reserved heading into Nvidia's report. Average daily net flow over the five-day window ahead of the release was $94 million, around half of what was seen in the runup to the prior report, Vanda said Wednesday.Nvidia has been a top stock for retail investors since 2023, Vanda data shows. Despite Thursday's slide, Wall Street is bullish on the path ahead: The typical analyst polled by LSEG has a buy rating and price target suggesting shares can jump more than 35% over the next 12 months.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Small investors buy Nvidia in record numbers after Thursday's open",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229156-1763651123145-gettyimages-2246743088-raa-nvidiaph251118_nprRy.jpeg?v=1772124975&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T17:14:26.000Z",
      "dateModified": "2026-02-26T17:14:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. and Iran wrap up 'most intense' nuclear talks with no deal — more negotiations ahead",
    "url": "https://www.cnbc.com/2026/02/27/us-iran-nuclear-talks-oil-middle-east.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108270496-17721244192026-02-26t164511z_1021188987_rc2stjam97jp_rtrmadp_0_iran-crisis-talks.jpeg?v=1772124824&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-27T03:24:44.000Z",
    "description": "Iranian negotiating delegation departs for the site of the talks with U.S., in Geneva, Switzerland, Feb. 26, 2026. Iranian Foreign Ministry | WANA | V",
    "body": "Iranian negotiating delegation departs for the site of the talks with U.S., in Geneva, Switzerland, Feb. 26, 2026. Iranian Foreign Ministry | WANA | Via ReutersThe latest round of U.S.-Iran talks did not lead to a breakthrough, with both sides agreeing to extend negotiations, Iranian Foreign Minister Seyed Abbas Araghchi said, describing the discussions as the \"most intense so far.\" \"Further progress has been made in our diplomatic engagement with the United States,\" said Araghchi, adding that both sides planned to engage in a more \"detailed\" manner on critical issues including termination of U.S. sanctions on Iran and \"nuclear-related steps.\"  The two sides made \"significant progress\" in the high-stakes talks in Geneva, Switzerland, and agreed to meet next week to discuss technical details in Vienna, according to Oman's foreign minister Badr Al Busaidi, the mediator of the talks.  Al-Busaidi is headed to Washington to meet with Vice President JD Vance and other U.S. officials on Friday, according to MS Now. Vance has previously downplayed the possibility of the U.S. entering into a years-long war with Iran despite intensifying military rhetoric from Tehran and Washington.Earlier this week, U.S. President Donald Trump said that Iran wants to make a \"deal\" more than the U.S. while Tehran's refusal to commit to not developing nuclear weapons remains a key sticking point holding up the agreement.  In his State of the Union address earlier this week, Trump said that \"They [Iran] want to make a deal, but we haven't heard those secret words: We will never have a nuclear weapon.\" Tensions continued to run high as the U.S. has amassed a large military force in the Middle East with Trump last week warning that \"bad things\" would happen if Iran does not agree to a deal over the future of its nuclear program.The third round of talks this week were led by U.S. special envoy Steve Witkoff and Trump's son-in-law Jared Kushner, while Araghchi headed the Iranian delegation.    The Wall Street Journal reported earlier Friday that the U.S. team had tough demands for the Iranians, including that they destroy the three main nuclear sites at Fordow, Natanz and Isfahan, and deliver all of its remaining enriched uranium to the U.S. Iranian officials have objected to these demands. The team also requested any nuclear deal must last forever and not have so-called sunset clauses, the newspaper reported, citing unnamed U.S. officials.  From nuclear program to ballistic missilesIran's nuclear program has been at the crux of the negotiations, with the U.S. pressuring Tehran to curb its ballistic-missile development program as well. But Tehran has insisted on its right to carry out the enrichment of uranium in the country, saying it's needed for energy production.  Right before the latest talks in Switzerland, U.S. Secretary of State Marco Rubio said that Iran's reluctance to discuss its development of intercontinental ballistic missiles was a significant stumbling block. The Trump administration has also demanded Tehran to stop supporting regional armed groups and cease its repression of domestic protestors.Analysts have warned of risks of a military clash in the region should the two sides fail to reach any meaningful breakthrough, which could unleash turmoil in the wider Middle East and for oil markets. \"Absent a diplomatic breakthrough in the coming days, the U.S. risks entering into a military clash with significant escalatory potential,\" said Michael Hanna, director at International Crisis Group, a Brussels-based think tank.Hanna also pointed out that Washington's priorities remain unclear as it presses a wide-ranging list of demands for Tehran: \"It is unclear if the administration itself has a fixed idea about its desired end point.\"  Among Tehran's priorities in the talks is the lifting of sanctions that have hobbled its economy and fueled a currency crisis, sparking widespread protests against the Islamic Republic in December.  Outcome of this week's indirect talks will be key to the direction of oil prices as traders weigh potential supply concerns if hostilities escalate.  WTI futures were down 35 cents, or 0.24%, on Friday at $64.97 per barrel. Brent crude futures lost 38 cents, or 0.30%, to $70.54 per barrel. \"The market may hold off on a full reaction until the scale of potential U.S. action against Iran becomes clearer,\" said Warren Patterson, head of commodities strategy at ING Bank, forecasting that any \"targeted and brief\" strikes that avoid energy infrastructure — like those seen in June last year — with limited retaliation from Iran may lead to a short-lived spike in oil prices. But in the event of longer-term action from Washington coupled with more aggressive retaliation from Tehran, oil prices will likely stay elevated on supply risks. Traders will also watch the OPEC+ decision on oil output for April this weekend. \"If we are to see de-escalation between the U.S. and Iran, it should allow weaker fundamentals to feed through to a lower flat price — particularly if OPEC+ resumes supply increases from April, which we believe they will agree to this weekend,\" Patterson said. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. and Iran wrap up 'most intense' nuclear talks with no deal — more negotiations ahead",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108270496-17721244192026-02-26t164511z_1021188987_rc2stjam97jp_rtrmadp_0_iran-crisis-talks.jpeg?v=1772124824&w=1920&h=1080"
      ],
      "datePublished": "2026-02-27T03:24:44.000Z",
      "dateModified": "2026-02-27T03:24:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The world's biggest sovereign wealth fund is using Anthropic's Claude AI model to screen investments for ethical issues",
    "url": "https://www.cnbc.com/2026/02/26/norway-sovereign-wealth-fund-nbim-investment-ai-esg-claude.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108124088-1743509333372-gettyimages-2195925093-AFP_36WH6V6.jpeg?v=1772112100&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-26T14:50:34.000Z",
    "description": "Nicolai Tangen, CEO of Norges Bank Investment Management, addresses a press conference on his company's annual results for 2024 at Norges Bank in Oslo",
    "body": "Nicolai Tangen, CEO of Norges Bank Investment Management, addresses a press conference on his company's annual results for 2024 at Norges Bank in Oslo, Norway, on January 29, 2025.Ole Berg-rusten | Afp | Getty ImagesNorway's $2 trillion oil fund, one of the world's biggest investors, said Thursday that it is now using AI to screen investments for potential reputational and ethical risks. Norges Bank Investment Management (NBIM) manages the fund, which was set up in the 1990s to invest revenues from Norway's oil and gas industry. It's an investor in more than 7,200 companies across 60 countries and has stakes in around 1.5% of the world's publicly listed stocks.It's long been influential on the global market and ESG — Environmental, Social, and Governance — investing. It uses its influence and voting rights to set expectations for the companies and markets it invests in, including impact on people, the environment and society.In its annual responsible investment report, the fund's management team said it was now using AI to provide governance and sustainability insights to portfolio managers. The technology means it can expand the scope and scale of the information it analyzes, leading to \"faster identification of material risks,\" NBIM said.A spokesperson for NBIM told CNBC that the organization's ESG risk monitoring team first began using Anthropic's Claude AI model in day-to-day work in Nov. 2024. Since then, they said, it has become \"an important tool in our monitoring of ESG risk across the portfolio.\"In Thursday's report, NBIM said 2025 saw the deployment of large-language AI models to screen all companies on their first day of entering its equity portfolio.\"These tools help us rapidly scan a wide range of public information that goes beyond what data vendors typically cover,\" the report said. \"Where risks emerge around key themes, the LLM conducts deeper searches, providing contextual summaries.\"watch nowNBIM receives daily AI-generated risk assessments for investments made the previous day, which the fund manager said enabled its team to immediately consider ways to mitigate these.\"Within 24 hours of our investment, the AI tools flag new companies in the fund's equity portfolio with potential links to, for example, forced labor, corruption or fraud,\" NBIM said in Thursday's report. \"Often, this information has not been captured in international media coverage or data vendor alerts. We always review the information before we make an investment or risk decision. In multiple instances, we identified and sold these investments before the broader market reacted to the risks, avoiding potential losses.\"NBIM said using AI this way had been particularly valuable for researching smaller companies in emerging markets, where news about the firm may be limited to small media outlets in local languages.\"Artificial intelligence is changing how we work as an investor,\" NBIM CEO Nicolai Tangen said in a statement in the report adding that sustainability and governance \"are inseparable from financial performance,\" noting that \"the world will remain complex and uncertain.\"The fund's value stands at around $2.2 trillion. In 2025, it posted an annual profit of 2.36 trillion kronor, or $246.9 billion.Nearly 40% of NBIM's investments are in U.S. equities, with its most valuable holdings including a 1.3% stake in Nvidia, a 1.2% stake in Apple and a 1.3% stake in Microsoft. NBIM also invests in fixed income, real estate and renewable energy infrastructure.watch nowLast year, however, some of its ethics-related decisions drew criticism — notably from the White House.In September, the U.S. State Department told CNBC it was \"very troubled\" by NBIM's decision to exit positions in American machinery manufacturer Caterpillar and five Israeli banks, citing \"unacceptable risk\" that the companies were contributing to rights violations in Palestinian territories.A spokesperson said NBIM's Caterpillar exit \"appears to be based on illegitimate claims against Caterpillar and the Israeli government.\"Norway's finance minister, Jens Stoltenberg, responded by saying the divestment was \"not a political decision.\"Until Nov. 2025, the Executive Board of Norges Bank decided whether companies should be excluded from the fund's investment portfolio or placed on an observation list. These decisions were informed by the Council on Ethics, an independent body appointed by Norway's Ministry of Finance.But following the controversy over some of its divestments last year, temporary guidelines were put in place, with a review on NBIM's ethical framework due to be presented by a government-appointed committee later this year. Under the temporary guidelines, Norges Bank can no longer make decisions on observation or exclusion of a company from the fund – but it may revoke previous decisions on excluding a company or putting it on the observation list. Meanwhile, the Council on Ethics was stripped of its ability to recommend observation or exclusion at least until the ethical framework review is finalized.\"The conflict in Gaza and the discussions about the fund's ethical framework and investments in Israel demonstrated in 2025 how complex and challenging this can be in practice,\" Tangen said in Thursday's report.\"While the fund's ethical framework is under revision, we continue our responsible investment work, strengthening the link between ownership and investment decisions and focusing on what is financially material.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The world's biggest sovereign wealth fund is using Anthropic's Claude AI model to screen investments for ethical issues",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108124088-1743509333372-gettyimages-2195925093-AFP_36WH6V6.jpeg?v=1772112100&w=1920&h=1080"
      ],
      "datePublished": "2026-02-26T14:50:34.000Z",
      "dateModified": "2026-02-26T14:50:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]