[
  {
    "title": "Gold is at an all-time high—here's the best way to own it, according to financial experts",
    "url": "https://www.cnbc.com/2026/01/23/best-way-to-owngold-according-to-financial-experts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255975-1769113430998-gettyimages-2237798142-img_2043.jpeg?v=1769113459&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T17:33:43.000Z",
    "description": "Call it a golden era for gold. After a historic 60% runup in 2025, the shiny stuff is hitting new highs this year, with prices currently exceeding $4,",
    "body": "Call it a golden era for gold. After a historic 60% runup in 2025, the shiny stuff is hitting new highs this year, with prices currently exceeding $4,900 an ounce. What's good for gold isn't necessarily great for other parts of the market. The precious metal has long been considered a \"safe haven\" asset, meaning that investors tend to flee other assets and flock to gold in the midst of economic or geopolitical turmoil. Investors can take their pick of dustups fueling market uncertainty and driving up gold prices, from the federal investigation into Federal Reserve chairman Jerome Powell, to the U.S. military operation in Venezuela to the recent economic saber-rattling over a U.S. push to control Greenland, Nicky Shiels, head of metals strategy at commodities firm MKS PAMP, recently told CNBC. \"You're entering a world where ... there is a strong demand to secure critical metals, critical commodities in this decade,\" she said. Generally, investors can hold gold in one of two ways: physically in the form of coins or bars or through an exchange-traded fund or mutual fund which tracks the fluctuations in the metal's price. Which approach is right for you depends on your reason for holding, says Mike Casey, a certified financial planner with AE Advisors in Alexandria, Virginia. \"I would reserve physical gold for no more than 5-10% of a diversified portfolio if you're risk-tolerant, value sovereignty or anticipate prolonged instability,\" he says. \"Otherwise, stick to paper gold.\"It's also smart to consult a trusted financial professional before making any changes to your portfolio.Owning physical gold as a disaster hedgeMany investors favor gold during times of instability, as it has been considered currency for millennia. Should something go seriously wrong with the financial system, such as a large-scale devaluation of the U.S. dollar, owning some precious metals could come in handy, says John Bell, a CFP with Free State Financial Planning in Highland, Maryland, adding that he typically advises clients interested in gold to own a mix of physical and \"paper\" gold. \"While I am not a doom and gloom person who thinks the apocalypse is upon us, I like the fact that gold and silver are outside the broad banking and financial services system,\" Bell says. \"For instance, you can access it any time if it is physical and take it to a local dealer to get money.\"Gold comes with a couple of other advantages during trying times, Casey adds. \"It eliminates counterparty risk,\" he says, meaning you won't have to rely on a mutual fund company or brokerage to give you your money. \"[It] provides tangible ownership, and can serve as a privacy shield in uncertain times — think estate planning or cross-border mobility.\"There are some drawbacks to holding gold this way, however. You'll generally have to pay a premium over gold's \"spot\" price (the price ETFs track) to own the physical stuff — often a 5% to 10% markup, Casey says — plus pay extra to store it somewhere, unless you're comfortable stashing it under your mattress. Plus, under normal circumstances, it's much harder to sell your physical gold for cash than it is to click \"sell\" on your your gold ETF position in your brokerage account. Owning gold as a portfolio diversifierEven if you don't have major concerns about geopolitics or the economy, there's still a case to made for owning some exposure to gold, says Casey. \"Gold's allure lies in its role as a portfolio diversifier,\" he says. \"It's historically non-correlated with stocks and bonds, offering stability during market volatility or currency devaluation.\"In other words, the factors that drive gold prices are different than the ones that drive the returns on stocks and bonds, such as corporate earnings and interest rates. And as Casey points out, gold has maintained or grown in value during some periods of market turbulence. In 2002, for instance, when the S&P 500 dropped more than 22%, gold rose by nearly 25%. Gold also posted a nearly 6% uptick in price in 2008, a year in which the broad stock market fell by 37%. Of course, gold doesn't move in the opposite direction as the stock market all of the time — 2025 was a great year for gold and a good one for stocks. But owning a mix of assets that perform differently under different conditions reduces overall volatility in your portfolio and generally provides a smoother ride, experts say. To add \"paper\" gold to your portfolio, consider buying a mutual fund or ETF that tracks the change in the metal's price. These funds are generally backed by a physical cache of precious metals and do an accurate job tracking the spot price. The reason investing experts recommend keeping gold as a small portion of a diversified portfolio is that unlike other assets, such as stocks and bonds, gold doesn't generate profits or throw off cash. \"It simply sits there, unchanged and unproductive, its value dependent on what the next buyer is willing to pay,\" says Alex Canellopoulos, a CFP with Vista Capital Partners in Portland, Oregon. \"That doesn't mean investors never benefit from rising gold prices,\" he says. But he and other experts caution against making it a major building block of your portfolio. Want to get ahead at work with AI? Sign up for CNBC's new online course, Beyond the Basics: How to Use AI to Supercharge Your Work. Learn advanced AI skills like building custom GPTs and using AI agents to boost your productivity today. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gold is at an all-time high—here's the best way to own it, according to financial experts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255975-1769113430998-gettyimages-2237798142-img_2043.jpeg?v=1769113459&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T17:33:43.000Z",
      "dateModified": "2026-01-23T17:33:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia’s Huang to visit China as AI chip sales stall",
    "url": "https://www.cnbc.com/2026/01/23/nvidia-ceo-jensen-huang-china-visit-chip-sales-restrictions.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256213-1769171467655-108256213-17691714072026-01-21t110421z_923549888_rc2m5jaurrtk_rtrmadp_0_davos-meeting.jpg?v=1769171479&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T12:31:43.000Z",
    "description": "Nvidia founder and CEO Jensen Huang (R) speaks next to BlackRock chairman and WEF co-chairman Larry Fink during the World Economic Forum (WEF) annual ",
    "body": "Nvidia founder and CEO Jensen Huang (R) speaks next to BlackRock chairman and WEF co-chairman Larry Fink during the World Economic Forum (WEF) annual meeting in Davos on January 21, 2026. Fabrice Coffrini | Afp | Getty ImagesBEIJING — Nvidia CEO Jensen Huang plans to visit China in the coming days ahead of the mid-February Lunar New Year, two people familiar with the matter told CNBC. The trip comes as questions persist over the U.S. chip giant's ability to sell in the Chinese market, which once accounted for at least one-fifth of revenue from Nvidia's data center business.U.S. export restrictions have prevented Nvidia from selling its most advanced chips to China as Washington seeks to maintain an edge over Beijing in chips used to develop cutting-edge artificial intelligence.Huang is expected to attend an Nvidia company party in Beijing on Monday, said one of the sources, who requested anonymity to speak about the trip.He is also set to meet with potential buyers in China and discuss recent logistical challenges in supplying U.S.-approved Nvidia chips into the market, according to a person with direct knowledge of the travel plans. The Information reported last week, citing sources, that China would only approve local purchases of Nvidia's H200 AI chips for limited purposes such as research. When asked about the report Thursday, China's Commerce Ministry claimed it was unaware of the situation. Bloomberg first reported news of Huang's China trip earlier this week. Nvidia declined to comment on executive travel plans. Huang visited mainland China at least three times last year, including in January for Lunar New Year celebrations. \n\t\t\n\t\t\n\t\t\n\t\t\tWeekly analysis and insights from Asia's largest economy in your inbox\n\t\t\tSubscribe now\n\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia’s Huang to visit China as AI chip sales stall",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256213-1769171467655-108256213-17691714072026-01-21t110421z_923549888_rc2m5jaurrtk_rtrmadp_0_davos-meeting.jpg?v=1769171479&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T12:31:43.000Z",
      "dateModified": "2026-01-23T12:31:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Adani group stocks plunge as U.S. SEC looks to question founder over fraud charges",
    "url": "https://www.cnbc.com/2026/01/23/adani-group-shares-sec-investigation-fraud.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108070014-17331600242024-12-02t070458z_587775375_rc2rfbajk3cu_rtrmadp_0_adani-group-usa.jpeg?v=1733160050&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T10:18:34.000Z",
    "description": "Indian billionaire Gautam Adani attends the 51st Gems and Jewellery Awards in Jaipur, India, November 30, 2024. Stringer | ReutersShares of Adani Grou",
    "body": "Indian billionaire Gautam Adani attends the 51st Gems and Jewellery Awards in Jaipur, India, November 30, 2024. Stringer | ReutersShares of Adani Group companies fell between 5 to 13% on Friday as court filings showed that the U.S. Securities and Exchange Commission is looking to send summons to founder Gautam Adani and nephew Sagar Adani on charges of bribery and fraud.  Indian billionaire Gautam Adani, chair of India's Adani Group and one of the world's richest people, was indicted with seven other men in New York federal court in November 2024 on charges related to a massive bribery and fraud scheme.The SEC has approached a U.S. District Judge, Nicholas Garaufis in Brooklyn, seeking permission to issue a legal summons to Adani Group Chairman Gautam Adani and the executive director of Adani Green Energy, Sagar Adani, according to court filings. CNBC has reached out to Adani Group and the U.S. SEC for comment.Shares of Adani Green Energy ended the session nearly 14% lower, while those of the flagship company Adani Enterprises closed 10.7% lower on Friday. Shares of Adani Power dropped 5.7%.The Adani Group executives are charged with misleading U.S. and international investors about their company's compliance with anti-bribery and anti-corruption practices, as they raised more than $3 billion in capital to fund those energy contracts.India's Ministry of Law and Justice has twice refused last year to deliver the summons to Gautam Adani and Sagar Adani under the Hague Convention, the SEC told the court. \"The Ministry appeared to suggest that the SEC lacks authority to invoke the Hague Convention or seek service of the Summonses,\" it said.Adani and several other defendants are accused of having paid Indian government officials more than $250 million in bribes to obtain solar energy supply contracts worth more than $2 billion in profits.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Adani group stocks plunge as U.S. SEC looks to question founder over fraud charges",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108070014-17331600242024-12-02t070458z_587775375_rc2rfbajk3cu_rtrmadp_0_adani-group-usa.jpeg?v=1733160050&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T10:18:34.000Z",
      "dateModified": "2026-01-23T10:18:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shares of CSG, one of the world’s fastest-growing defense firms, jump 31% on debut",
    "url": "https://www.cnbc.com/2026/01/23/csg-stock-debut-ipo-defense-amsterdam-czech.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256184-1769168232734-gettyimages-2216961506-CZECH_DEFENSE.jpeg?v=1769168308&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T23:14:49.000Z",
    "description": "A flag with the CSG NV logo during the listing of their company at Euronext Amsterdam, Jan. 23, 2026.Bloomberg | Bloomberg | Getty ImagesShares of Cze",
    "body": "A flag with the CSG NV logo during the listing of their company at Euronext Amsterdam, Jan. 23, 2026.Bloomberg | Bloomberg | Getty ImagesShares of Czech-based defense firm Czechoslovak Group, or CSG, soared over 30% on its stock market debut on Friday, underscoring sustained investor interest in defense companies amid Europe's growing push for military sovereignty.CSG, one of the world's fastest-growing defense firms, made its debut on the Euronext exchange in Amsterdam. Shares rose as much as 32% in the session before closing the session up 31.4%.The Prague-based company, which makes armored vehicles, ammunition and advanced defense systems, raised a total of 3.8 billion euros ($4.5 billion) in its initial public offering. Euronext said the listing marked the world's largest defense IPO ever recorded, both in terms of amount raised and market capitalization.\"Today marks a historic milestone for CSG as we join the Euronext Amsterdam market and we welcome the confidence shown in us by investors,\" Michal Strnad, chairman of CSG, said in a statement.\"Becoming a publicly listed company demonstrates our commitment to high standards of transparency, disclosure and corporate governance and strengthens our ability to invest in innovation, expand our global reach and deliver on our mission to be a critical long-term supplier of advanced defence and industrial solutions to NATO states and Government partners worldwide,\" he added.The listing comes after weeks of mounting geopolitical tensions, with President Donald Trump threatening to use military force to seize Greenland from Denmark, a NATO ally. In a surprise development on Wednesday, however, Trump said he had agreed to a framework of a future deal with respect to the self-governing Danish territory. In Europe, meanwhile, investors have continued to pile into defense stocks, fueled by a mix of European Union, national and private capital funding.Strategists have cited Russia's full-scale invasion of Ukraine and the end of the U.S. defense umbrella in Europe as underpinning a so-called mega-trend in the making. — CNBC's Hugh Leask contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shares of CSG, one of the world’s fastest-growing defense firms, jump 31% on debut",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256184-1769168232734-gettyimages-2216961506-CZECH_DEFENSE.jpeg?v=1769168308&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T23:14:49.000Z",
      "dateModified": "2026-01-23T23:14:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok was thriving in the U.S., even before a joint venture saved it from a potential ban",
    "url": "https://www.cnbc.com/2026/01/23/tiktok-other-china-linked-apps-thrived-in-the-us-in-2025-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108202534-1758592736746-gettyimages-2194103715-tiktok-1.jpeg?v=1769053353&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T12:55:44.000Z",
    "description": "TikTok discussions overshadowed U.S.-China tariff negotiations during the latest round of talks.Anna Barclay | Getty Images News | Getty ImagesTikTok ",
    "body": "TikTok discussions overshadowed U.S.-China tariff negotiations during the latest round of talks.Anna Barclay | Getty Images News | Getty ImagesTikTok has just announced a new U.S. venture that will keep it operating there after years of concerns about its links to China. But even as it was nearly banned and faced scrutiny from officials, the short-video platform still dominated in 2025.The app, owned by Beijing-headquartered ByteDance, was the second-most-downloaded app across Apple's App Store and the Google Play Store in the U.S. in 2025, according to Sensor Tower data, defying a near-ban in the market.Another ByteDance app, CapCut, ranked fourth, with the video editing tool climbing three places from a year ago.Other China-linked apps also had strong showings across U.S. app stores in 2025, with major e-commerce players like Temu and Shein thriving even as they were targeted by policy changes, Sensor Tower data showed.Temu, which ran a high-profile Super Bowl ad campaign in 2024, fell from the top position that year, but still ranked in seventh place in 2025, even as U.S. President Donald Trump's tariffs upended its business model.U.S. President Donald Trump speaks after signing an executive order on a deal that would divest TikTok's U.S. operations from ByteDance from its Chinese owner ByteDance, at the White House in Washington, D.C., U.S., Sept. 25, 2025.Kevin Lamarque | ReutersAlthough Shein did not rank among the top 10 most downloaded apps overall, it was the most downloaded app in the apparel shopping category in the U.S. in 2025.Separately, OpenAI's ChatGPT was America's most downloaded app last year, as adoption of generative artificial intelligence continued to expand.Sensor Tower's data shows that U.S. consumers continue to favor apps coming out of China, often synonymous with addictive algorithms, affordability, and convenience.\"2025 showed that these China-originated apps aren't just policy arbitrageurs, but are adaptive ecosystems with governance capabilities on both the demand and supply sides,\" Liang Chen, a Professor of Strategy & Entrepreneurship at Singapore Management University, told CNBC.Defying the banBefore Thursday's announcement of the U.S. joint venture, TikTok faced months of uncertainty in 2025. The Supreme Court upheld a law in January that effectively banned the video-sharing app from U.S. app stores unless ByteDance divested from the platform.The law, signed by President Joe Biden in April 2024, cited risks of the Chinese government accessing user data for surveillance or influence operations. Although TikTok briefly went dark in January, the law was never enforced. Upon taking office, Trump repeatedly extended the law's deadline as he negotiated a divestment deal.The threat of a TikTok ban also drew increased attention to Chinese alternatives such as Xiaohongshu, known in English as RedNote.Despite the uncertainty, not only did interest in TikTok's app hold steady, but it managed to expand its e-commerce business, TikTok Shop, which allows users to purchase products directly through videos and live streams. The company has said that, under the new joint venture plans, TikTok Global's U.S. entities will continue to manage certain commercial activities, including e-commerce and advertising. According to data from retail consulting firm Coresight, TikTok's U.S. revenues, including ad revenue, in-app purchases and commerce, rose 26.2% year over year to $13.9 billion, following 25.7% growth in 2024.\"TikTok's success in 2025 demonstrates a path to navigate geopolitical headwinds despite the continuously deteriorating U.S.-China relationship — a rare case of clever commercial strategy triumphing over politics,\" said Xiaomeng Lu, director of geo-technology at Eurasia Group. The app looks poised to close its deal with U.S. investors, with multiple Trump-Xi meetings planned throughout the year, she added. Temu, Shein and e-commerceTikTok Shop competitors Temu and Shein also remained major players in the U.S. last year despite new tariffs and increased government oversight of labor practices, supply chains, and product safety. The most significant of these headwinds was the Trump administration's closure of the \"de minimis\" trade loophole on May 2 and the imposition of broader tariffs on imports from China. The \"de minimis\" rule had allowed packages valued under $800 to enter the United States duty-free.Although Shein and Temu have moved their headquarters out of China in recent years, much of their operations and suppliers remain in the country.An employee packages garments for the online Chinese e-commerce company Temu at a clothing factory in Guangzhou, in southern China's Guangdong province on April 16, 2025. Jade Gao | Afp | Getty ImagesAnalysts said both companies adjusted to tariffs by negotiating lower supplier prices, absorbing some of the levy costs, and expanding supply networks beyond China, including in the United States.Coresight estimates Shein's U.S. revenue increased 16.8% year over year to $14.6 billion in 2025. Meanwhile, Temu's gross merchandise values increased by 21.8% year over year to $27.4 billion.\"[Policy] shocks in 2025 didn't really make demand disappear. Rather, they proved that these platforms can adapt their logistics, merchant mix, and incentive design faster than consumer habits shift,\" said Singapore Management University's Chen. Secret sauce Analysts said the staying power of apps such as TikTok, Temu and Shein stems from their attention-driven platforms and algorithms.\"The success of Temu, Shein, and TikTok Shop fundamentally reflects a shift in demand generation: moving away from legacy marketing tactics like simple ad-spend and display campaigns to a continuous, attention-economy strategy,\" said Scott Miller, CEO of e-commerce consulting firm pdPlus. \"Their growth shows that American consumers now discover products through highly engaging, viral, and personalized content, making demand creation a function of entertainment and constant digital presence rather than traditional top-down branding,\" he added. Those same algorithms and features have also drawn scrutiny from U.S. regulators. For example, officials have raised national security concerns over TikTok's recommendation algorithm, citing its potential for manipulation by the Chinese government. Regulators have also flagged data privacy and national security risks tied to Temu and Shein's data collection practices.Despite those concerns, the apps have continued to capture the attention of U.S. users and shoppers. \"American consumers overall don't really care an app's association with any specific country as long as they can find something they want at an affordable price,\" said Yao Jin, an associate professor of supply chain management at Miami University.\"[That] is exactly the competitive advantage of most China-originated apps.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok was thriving in the U.S., even before a joint venture saved it from a potential ban",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108202534-1758592736746-gettyimages-2194103715-tiktok-1.jpeg?v=1769053353&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T12:55:44.000Z",
      "dateModified": "2026-01-23T12:55:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House passes final funding bills 8 days before shutdown, Senate now will consider",
    "url": "https://www.cnbc.com/2026/01/22/government-funding-shutdown-house.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256212-17691712382026-01-23t000421z_2144178006_rc2l6jawqs8u_rtrmadp_0_usa-congress.jpeg?v=1769171252&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T12:28:57.000Z",
    "description": "US House Speaker Mike Johnson, a Republican from Louisiana, center, joined by Republican lawmakers, speaks during a news conference at the US Capitol ",
    "body": "US House Speaker Mike Johnson, a Republican from Louisiana, center, joined by Republican lawmakers, speaks during a news conference at the US Capitol in Washington, DC, US, on Thursday, Jan. 22, 2026. Kent Nishimura | Bloomberg | Getty ImagesThe House of Representatives on Thursday passed the final set of outstanding government funding bills as a partial federal government shutdown looms on Jan. 30.The four bills account for the largest chunk of government spending, about $1.2 trillion in total. They would fund the departments of Defense; Health and Human Services; Homeland Security; Labor; Housing and Urban Development; Transportation; and Education. The Homeland Security bill passed 220-207, while the other three cleared 341-88 as part of a package known as a \"minibus.\"The bills represent the final quartet of 12 annual appropriations bills required to fund the government and avoid a partial shutdown on Jan. 30. The Senate still needs to approve them, along with two other House-passed funding bills, before they head to President Donald Trump's desk for a signature. The Senate does not return until next week, and a winter storm closing in on Washington over the weekend threatens to complicate those plans. House lawmakers were widely expected to pass the bills on Thursday, with lawmakers desperate to avoid another shutdown after enduring a record 43-day shutdown last year. Despite bipartisan accord on avoiding another shutdown, some of the bills still face serious hurdles in the Senate. Read more CNBC politics coverageGreenland PM: Trump-NATO deal framework unclear, sovereignty is a red lineTrump sues Jamie Dimon, JPMorgan Chase over debanking the suit calls 'political'Trump says he reached Greenland deal 'framework' with NATO, backs off tariffsTrump interview live updates: CNBC's Joe Kernen sits down with the president at DavosRussia watches as ally Iran edges closer to collapse. Here's why it matters for MoscowTrump's latest geopolitical gambits all lead back to ChinaTrump says anything less than U.S. control of Greenland is 'unacceptable' ahead of talksDemocrats have warned they will not support a bill to fund the Homeland Security Department after an Immigration and Customs Enforcement Agent fatally shot a U.S. citizen in Minnesota earlier this month. The Homeland bill was being considered separately from the other three bills in the House due to the political peril. Meanwhile, Republicans from the Midwest demanded a provision be added to the spending package to allow year-round sale of gasoline with a heavy mix of ethanol, known as E15. The fuel is currently restricted in the summer months due to smog concerns, though that restriction is frequently waived.House Republican leadership agreed to create a congressional \"E-15 Rural Domestic Energy Council\" instead to assuage those Republicans.Trump told Fox Business on Thursday that he \"think[s] we're going to probably end up in another Democrat shutdown,\" but did not specify whether he was referring to the deadline at the end of this month. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House passes final funding bills 8 days before shutdown, Senate now will consider",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256212-17691712382026-01-23t000421z_2144178006_rc2l6jawqs8u_rtrmadp_0_usa-congress.jpeg?v=1769171252&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T12:28:57.000Z",
      "dateModified": "2026-01-23T12:28:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia director Persis Drell resigns with $26 million worth of stock after decade on board",
    "url": "https://www.cnbc.com/2026/01/23/nvidia-director-persis-drell-resigns-decade-on-board-26-million-stock.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108248407-1767646313623-gettyimages-2254214508-CES_2026.jpeg?v=1769211489&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-24T00:04:34.000Z",
    "description": "Signage ahead of the Nvidia Live event at CES 2026 in Las Vegas, Jan. 5, 2026.Bridget Bennett | Bloomberg | Getty ImagesNvidia director Persis Drell, ",
    "body": "Signage ahead of the Nvidia Live event at CES 2026 in Las Vegas, Jan. 5, 2026.Bridget Bennett | Bloomberg | Getty ImagesNvidia director Persis Drell, an engineering professor at Stanford, resigned on Wednesday after just over a decade on the chipmaker's board of directors, the company said in a filing with the SEC on Friday. Drell, 70, stepped down to pursue a \"new professional opportunity,\" Nvidia said, and not because of a disagreement with company or any matter related to its operations or policies. Drell, who served on the compensation committee, is the first Nvidia board member to depart since astronaut Ellen Ochoa resigned in June. The board now has 10 directors, including CEO Jensen Huang. Drell owns close to 143,000 Nvidia shares, worth about $26 million, according to the latest holdings report. She was paid about $344,000 for her work with Nvidia last year, including almost $259,000 in stock awards, the company's annual report said. Nvidia's stock price is up over 22,000% since the end of 2015, emerging as the most valuable company in the world thanks to the artificial intelligence boom. Drell sold about 40,000 shares last year. Drell has been a professor at Stanford since 2002, serving as the dean of the engineering school from 2014 to 2017 and as Stanford's provost from 2017 to 2023. She was also director of Stanford's particle accelerator, called SLAC, from 2007 to 2012. Correction: This story has been revised to reflect that Persis Drell is 70 years old. A previous version misstated her age. WATCH: Chinese AI models adapt without Nvidiawatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia director Persis Drell resigns with $26 million worth of stock after decade on board",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108248407-1767646313623-gettyimages-2254214508-CES_2026.jpeg?v=1769211489&w=1920&h=1080"
      ],
      "datePublished": "2026-01-24T00:04:34.000Z",
      "dateModified": "2026-01-24T00:04:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Capital One is buying startup Brex for $5.15 billion in credit card firm's latest deal",
    "url": "https://www.cnbc.com/2026/01/22/capital-one-is-buying-startup-brex-for-5point15-billion-in-credit-card-firms-latest-deal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106289306-1576027900694henriquepedro.jpg?v=1667836801&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T12:50:56.000Z",
    "description": "Brex co-founders Pedro Franceschi and Henrique Dubugras.BrexCapital One said Thursday that it was acquiring payments startup Brex for $5.15 billion, t",
    "body": "Brex co-founders Pedro Franceschi and Henrique Dubugras.BrexCapital One said Thursday that it was acquiring payments startup Brex for $5.15 billion, the latest splashy deal undertaken by the bank's CEO, Richard Fairbank.The firm, which disclosed the acquisition in its fourth-quarter earnings statement, said the purchase is made up of 50% cash and 50% stock. Brex was previously valued at $12.3 billion. Shares of the bank fell about 3%.Under Fairbank, a rare founder-CEO of a major U.S. bank, Capital One acquired rival card firm Discover Financial last year for about $35 billion. That deal was Fairbank's crowning achievement, giving the credit card lender access to one of the only payment networks of any scale. \"Since our founding, we set out to build a payments company at the frontier of the technology revolution,\" Fairbank said in a release. \"Acquiring Brex accelerates this journey, especially in the business payments marketplace.\"Fairbank said that Brex pioneered the melding of corporate cards, banking and spend management software: \"They have taken the rarest of journeys for a fintech, building a vertically integrated platform from the bottom of the tech stack to the top.\"Still, the more than 50% decline in valuation for Brex from its 2023 level shows the headwinds that even successful fintech companies have encountered. Brex is among a class of fintech firms that rose to prominence during a period of low interest rates; it was known initially as a startup that made loans to other startups via its cards.But the company expanded beyond technology into other sectors and now services larger established firms and startups alike, including Robinhood, Zoom and Anthropic. Capital One, which has offered business credit cards for decades, became increasingly convinced that it was Brex's model that would be the winning offering, according to a person with knowledge of the lender's strategy. \"We didn't have to pursue this acquisition, our growth was incredibly strong,\" Brex CEO Pedro Franceschi told CNBC in an interview.Combining Brex's technology with Capital One's reach and resources would grow the startup's scale faster than as a standalone firm, he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Capital One is buying startup Brex for $5.15 billion in credit card firm's latest deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106289306-1576027900694henriquepedro.jpg?v=1667836801&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T12:50:56.000Z",
      "dateModified": "2026-01-23T12:50:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Databricks obtains $1.8 billion in additional debt ahead of IPO",
    "url": "https://www.cnbc.com/2026/01/23/databricks-obtains-1point8-billion-in-additional-debt-ahead-of-ipo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108090174-1737511299846-Handout_Ali_Ghodsi_seated.jpg?v=1737511358&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T21:15:36.000Z",
    "description": "Databricks co-founder and CEO Ali Ghodsi.DatabricksData analytics software company Databricks has landed $1.8 billion in fresh debt, a person familiar",
    "body": "Databricks co-founder and CEO Ali Ghodsi.DatabricksData analytics software company Databricks has landed $1.8 billion in fresh debt, a person familiar with the matter told CNBC. Databricks now has access to over $7 billion in debt, the person added. The company declined to comment.Databricks is among the highly valued technology companies that are primed to go public in 2026, alongside Anthropic, Canva, OpenAI and Stripe. Ali Ghodsi, Databricks' co-founder and CEO, told CNBC in December that he wouldn't rule out an initial public offering this year.In December, Databricks said it was raising over $4 billion at a $134 billion valuation. The company said it was generating $4.8 billion in annualized revenue, growing at more than 55% year over year. Databricks also said that it had positive free cash flow over the past year.Its subscription gross margin in the 2025 fiscal year was over 80%, the company said at a June investor briefing. Founded in 2013, Databricks received the third highest ranking on CNBC's 2025 Disruptor 50 list of private companies.Bloomberg reported on the financing details earlier.WATCH: Databricks CEO Ali Ghodsi: Wouldn't rule out going public in 2026watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Databricks obtains $1.8 billion in additional debt ahead of IPO",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108090174-1737511299846-Handout_Ali_Ghodsi_seated.jpg?v=1737511358&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T21:15:36.000Z",
      "dateModified": "2026-01-23T21:15:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump's push for Greenland mineral rights could block China's access to rare earths",
    "url": "https://www.cnbc.com/2026/01/23/trump-greenland-china-rare-earth-mineral.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255730-1769094780851-gettyimages-2239134183-1020_01_sre-042-gk2137.jpeg?v=1769177074&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T15:35:21.000Z",
    "description": "watch nowPresident Donald Trump's push for mineral rights in Greenland may be the latest play in long-standing U.S. efforts to block China from access",
    "body": "watch nowPresident Donald Trump's push for mineral rights in Greenland may be the latest play in long-standing U.S. efforts to block China from accessing rare earths on the world's largest island. Trump has disclosed few details about the Greenland framework deal that he announced after meeting with NATO Secretary-General Mark Rutte on Wednesday. But he told CNBC that it includes mineral rights for the U.S. and other partners, presumably NATO allies though it's unclear at this stage.\"They're going to be involved in the Golden Dome, and they're going to be involved in mineral rights, and so are we,\" Trump said in an interview with CNBC's Joe Kernen at the World Economic Forum in Davos, Switzerland.The Trump administration declined requests for further information when asked by CNBC. White House spokeswoman Anna Kelly said, \"as details are finalized by all parties involved, they will be released accordingly.\" \"If this deal goes through, and President Trump is very hopeful it will, the United States will be achieving all of its strategic goals with respect to Greenland, at very little cost, forever,\" Kelly said in a statement.Rare earths are used to make magnets that are key inputs for strategic industries like defense and robotics. China dominates the global supply chain and blocked exports in trade disputes with the U.S. last year. Beijing declared itself a \"near-Arctic state\" and regional stakeholder in 2018.Trump has made developing a Western rare earth supply chain a central objective of his industrial policy as he seeks to reduce U.S. dependence on China. Greenland has the eighth-largest rare earth reserves in the world at 1.5 million metric tons, according to 2024 data from the U.S. Geological Survey. Beijing has a financial interest in the Kvanefjeld mining project in Greenland's south. It is the third-largest known land deposit of rare earths in the world, according the Center for Strategic and International Studies. China's Shenghe Resources is the second-largest investor in Kvanefjeld's owner, Australia's Energy Transition Minerals. The project came to a halt after Greenland banned uranium mining in 2021 and it is now mired in litigation.A framework that provides the U.S. with priority access to Greenland's rare earths \"might ensure that a Chinese partner or somebody else doesn't come back to the table to develop those resources,\" said Ryan Castilloux, founder of Adamas Intelligence, a rare earth market research firm. Greenland's resourcesA second project called Tanbreez is under development in Greenland's south by New York City headquartered Critical Metals. The company has described Tanbreez as one of the largest rare earth deposits in the world. Critical Metals received a letter of interest from the Export-Import Bank of the United States earlier this month that could result in a $120 million loan for the development of Tanbreez. The company's stock rallied about 21% on Thursday and has nearly tripled in value this year. watch nowThe Biden administration was also worried about China gaining access to Greenland's rare earths. It lobbied the developer, Tanbreez Mining, to not sell the project to a China-linked company, CEO Greg Barnes told Reuters in January 2025. Tanbreez was ultimately acquired by Critical Metals.Economic challengesTrump said at Davos that his push for Greenland is not about extracting rare earths. He has said U.S. interests in Greenland are about blocking China's and Russia's ambitions in the Arctic. \"I want Greenland for security. I don't want it for anything else,\" Trump told reporters Wednesday before meeting with the NATO chief. \"We have so much rare earth, we don't know what to do with it. We don't need it for anything else.\" The pipeline for rare earth supplies is full after the U.S. made significant progress in standing up its supply chain over the past year, Castilloux said. The Pentagon struck an agreement last year with rare earth miner MP Materials that included an equity stake, price floor and offtake agreement. Supplies from Greenland are not needed in the near term, though that could change over a longer time horizon, Castilloux said. The economics of mining in Greenland are challenging, the analyst said. The island's remote location and infrastructure gaps would bring higher development costs, he said. Greenland's small population means at least some of the skilled workforce would have to be flown in and out. Shipping costs would also be higher, he said. Trump was blunt Wednesday about the cost of rare earth mining in Greenland.\"In terms of Greenland, you know, you have to go 25 feet down through ice to get it,\" Trump said. \"It's not something that a lot of people are going to do or want to do.\" \"No, this is security we're talking about,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's push for Greenland mineral rights could block China's access to rare earths",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255730-1769094780851-gettyimages-2239134183-1020_01_sre-042-gk2137.jpeg?v=1769177074&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T15:35:21.000Z",
      "dateModified": "2026-01-23T15:35:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A former Trump official wants to build a massive data center in a remote corner of Greenland. Will it work?",
    "url": "https://www.cnbc.com/2026/01/23/greenland-data-center-trump-greenmet.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255706-1769093603396-gettyimages-2162650655-sg019483_u12rqe7i.jpeg?v=1769093648&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T16:47:22.000Z",
    "description": "KANGERLUSSUAQ, GREENLAND - JULY 09: Passenger planes for local flights of Air Greenland stand on the tarmac at the airport as signs show the flight ti",
    "body": "KANGERLUSSUAQ, GREENLAND - JULY 09: Passenger planes for local flights of Air Greenland stand on the tarmac at the airport as signs show the flight times to various global destinations on July 09, 2024 in Kangerlussuaq, Greenland. (Photo by Sean Gallup/Getty Images)Sean Gallup | Getty Images News | Getty ImagesA former official of U.S. President Donald Trump's first administration is planning a multi-billion-dollar data center project in a remote corner of Greenland, as hyperscalers scramble to build out capacity across the globe to keep up with the AI rollout.The data center is aiming to be operational at 300 megawatts (MW) by mid-2027, before further expansion would see it hit 1.5 gigawatts (GW) by the end of 2028.While that's currently several times the power capacity of any active data center in the world, there are plans to build multiple 1 GW-plus facilities across the globe over the next two years as the race to develop AI infrastructure continues to gather pace.The Greenland data center project will cost billions of dollars to complete and has binding commitments with investors to finance half of its initial phase of development and half of the final phase, Drew Horn, a senior aide to Trump's first-term vice president Mike Pence and CEO of GreenMet, a company that's offering strategic support to the project, told CNBC. The venture is eyeing a buildout in the Kangerlussuaq area, a small settlement at the end of a deep fjord on the southwest coast of the Arctic island, with an airport, he added.Technical partners have been enlisted to help with the physical buildout, but the project has yet to secure land or approvals from the local authorities, Horn said. He declined to share the names of the other companies involved in the venture because the information isn't public yet.Commercial opportunities in Greenland have been thrust into the spotlight in recent weeks as the Arctic island has become the center of a geopolitical firestorm after U.S. President Donald Trump doubled down on acquisition talk. Critical minerals mining and freshwater reserves have been touted as potential prospects, though skeptics point to logistical challenges around tapping into them with Greenland's limited infrastructure.  watch nowMulti-billion-dollar data centerData center deals hit a record $61 billion in 2025 amid a rush to build out the infrastructure needed to power energy-intensive AI workloads. Big tech firms, including Meta, OpenAI, Oracle, AWS, Microsoft and Google are investing huge sums into developing facilities across the globe. Work on plans for the Greenland data center project began a year ago, and Horn told CNBC it has secured technical partners to assist with construction, operation and supplying energy.Committed financing, which is in the form of debt and equity, is contingent on the project meeting key milestones, including securing permits from local government, said Horn — who was also a senior advisor to both the energy and intelligence departments towards the end of Trump's first term.Other former senior Trump employees also have stakes in GreenMet, which says on its website that it helps companies with government and private funding and strategic partnerships.  George Sorial, who was an executive vice president and chief compliance counsel at the Trump Organization until 2019, and Keith Schiller, who was a longtime bodyguard for Trump and director of Oval Office operations during the U.S. president's first term, helped set up the company in 2021 and remain shareholders.\"We are not actively involved with GreenMet or Greenland,\" Sorial told CNBC. \"We are passive minority shareholders in GreenMet and have no management role in the company.\" Schiller had not responded to a CNBC request for comment as this story went live.The GreenMet CEO has been developing relationships with officials in the Greenlandic and Danish administrations as he looks to advance the project. He met the Danish Ambassador to the U.S. Jesper Møller Sørensen on Wednesday, as part of a \"continuing dialogue,\" to discuss the data center, Horn said. CNBC has approached Denmark's U.S. embassy for comment.While officials on all sides have been supportive of the project, the \"issue is not so much on the private side, it's on the diplomatic,\" Horn said, pointing to the geopolitical tensions surrounding the U.S. push to acquire Greenland, a semi-autonomous Danish territory.Tensions have cooled since Trump backtracked on plans to impose tariffs on several European nations over the issue, but questions still remain as negotiations around U.S. military and economic involvement in Greenland continue.\"Our effort, which is purely private, it succeeds only if we have the buy-in from the relevant affected parties and countries,\" Horn said.Securing power\"Larger corporate entities\" will be taking the lead on the construction and development of the data center, but GreenMet will continue to be involved as an advisor as the project looks to secure government investment from nations including the U.S., Greenland, Denmark, and other NATO countries, Horn told CNBC. \"We've spent about a year putting together everything from the power to the technology components, [and] we have a Greenlandic partner on the ground,\" Horn said. \"Right now we're waiting on approvals from the Greenlandic side.\"A big challenge for projects of this scale in Greenland is access to power. For the first phase of the project, which is targeting 300 MW power capacity, the plan is to use specialized barges carrying Liquefied Natural Gas to the fjord, Horn said.The venture plans to build a hydroelectric facility — 70% of the island's energy comes from such facilities — to power the second phase, which would see the data center hit 1.5 GW capacity. Permits and approvals from the Greenlandic government are still pending for both the barges and the facility. Greenland's Ministry of Business has been approached for comment.Kangerlussuaq Fjord. Large iceberg in scenic fjord surrounded by snow-capped mountains, Southeast coast, Greenland.Vw Pics | Universal Images Group | Getty ImagesHorn argues that if local authorities greenlight the large hydroelectric facility, energy prices will make the project commercially viable long-term. There are some significant advantages to building data centers in an environment with low temperatures, analysts told CNBC.\"The biggest value sits in its resource profile, specifically in hydro for electricity generation and a 'free cooling' proposition given the lower ambient temperature,\" Noah Ramos, strategist at investment research firm Alpine Macro, told CNBC.But there are hurdles the project will have to overcome. \"Building in the Arctic is capital intensive; construction seasons are short, and the heat from the servers can melt the very ground the building sits on... specialized engineering is needed,\" Ramos said.Nvidia is also touting a new generation of chips that require less cooling. \"It's early days, but if future generations of chips are even more efficient in this regard, it could negate the need for expensive data centre build outs in places like Greenland,\" Michael Field, chief equity strategist at Morningstar, told CNBC.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A former Trump official wants to build a massive data center in a remote corner of Greenland. Will it work?",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255706-1769093603396-gettyimages-2162650655-sg019483_u12rqe7i.jpeg?v=1769093648&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T16:47:22.000Z",
      "dateModified": "2026-01-23T16:47:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump withdraws 'Board of Peace' invitation to Carney in widening rift with Canada",
    "url": "https://www.cnbc.com/2026/01/23/trump-withdraws-board-of-peace-invitation-to-carney-in-widening-rift-with-canada.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256101-1769170620254-108256101-1769140375534-gettyimages-2256691370-AA_20012026_2612726.jpg?v=1769182666&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T14:21:42.000Z",
    "description": "watch nowU.S. President Donald Trump withdrew the invitation to Canada to join his \"Board of Peace,\" days after Prime Minister Mark Carney's address i",
    "body": "watch nowU.S. President Donald Trump withdrew the invitation to Canada to join his \"Board of Peace,\" days after Prime Minister Mark Carney's address in Davos warning against economic coersion by the world's superpowers.   \"Dear Prime Minister Carney: Please let this Letter serve to represent that the Board of Peace is withdrawing its invitation to you regarding Canada's joining,\" Trump said in a post on Truth Social on Thursday night stateside. Carney said last week that he intended to join the board but details, including financial terms, had yet to be worked out. States looking for a permanent seat need to pay $1 billion.In his speech at the World Economic Forum in Davos, Switzerland, earlier this week, Carney said the world's \"middle powers\" must band together to resist coercion from the world's largest powers. \"Great powers have begun using economic integration as weapons. Tariffs as leverage, financial infrastructure as coercion, supply chains as vulnerabilities to be exploited,\" he said. While Carney did not name any country, Trump responded later, saying on the sidelines of the forum that \"Canada lives because of the United States. Remember that, Mark, the next time you make your statements.\" Hours before Carney's speech, Trump had posted on social media a digitally-altered image of a map with Greenland, Venezuela and Canada covered with American flag.  Recent events have shown that \"the rules-based international order\" is effectively dead, while the world's superpowers \"pursue their interests using economic integration as a weapon of coercion,\" Carney said in his speech.  Relations between the two longstanding allies have come under heavy strain in Trump's second term, who has referred to the neighboring country as the U.S.' 51st state, besides targeting it with tariffs. U.S. President Donald Trump (R) meets with Canadian Prime Minister Mark Carney in the Oval Office of the White House on October 07, 2025 in Washington, DC. Anna Moneymaker | Getty ImagesThe \"Board of Peace,\" chaired by Trump, was originally conceived to oversee the demilitarization and rebuilding of Gaza strip after a two-year war with Israel. But Trump said he foresees the board to take a wider role that could ultimately rival the United Nations, a remit that has alarmed several U.S. allies. Trump has garnered the support from regional Middle East countries including Turkey, Egypt, Saudi Arabia and Qatar, as well as emerging economies such as Indonesia. But several global powers and traditional Western U.S. allies have been more cautious, including Australia, France, Germany, Italy and some have rejected the proposal. U.K. Foreign Secretary Yvette Cooper reportedly said that it \"won't be one of the signatories\" citing concerns over Russian President Vladimir Putin's invitation to join.  Russia and China are among those invited to join the board. Putin reportedly told the Russian security council that the foreign ministry was still studying the proposal while China has not confirmed whether it will join. Carney's WEF address followed his high-profile visit to China last week, where he reached a wide-ranging agreement with President Xi Jinping to reduce tariffs and rebuild ties. As part of the deal, Beijing cut tariffs on a number of agricultural products from Canada while Ottawa increased the quotas for imports of Chinese electric vehicles into its market with the most-favored-nation tariff rate of 6.1%. Carney hailed his strategic partnership with Xi, touting the importance of their ties in the face of a \"new world order,\" in a veiled reference to the global instability caused by Trump's foreign policy swings and disruptive trade agenda.  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump withdraws 'Board of Peace' invitation to Carney in widening rift with Canada",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256101-1769170620254-108256101-1769140375534-gettyimages-2256691370-AA_20012026_2612726.jpg?v=1769182666&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T14:21:42.000Z",
      "dateModified": "2026-01-23T14:21:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Intel stock drops 17%, its worst day since 2024, as manufacturing troubles overshadow earnings beat",
    "url": "https://www.cnbc.com/2026/01/23/intel-stock-earnings-q4-2025-supply.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214642-1761048654431-gettyimages-2240015417-jhangiani-indiamob251011_np4YW.jpeg?v=1769180659&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T21:01:06.000Z",
    "description": "The Intel logo is seen at the India Mobile Congress 2025 in Delhi, Oct. 11, 2025.Kabir Jhangiani | Nurphoto | Getty ImagesIntel shares plunged 17% on ",
    "body": "The Intel logo is seen at the India Mobile Congress 2025 in Delhi, Oct. 11, 2025.Kabir Jhangiani | Nurphoto | Getty ImagesIntel shares plunged 17% on Friday after the chipmaker issued lackluster guidance and warned of a supply shortage.The stock notched its worst day since August 2024.During a fourth-quarter earnings call with analysts Thursday, CEO Lip-Bu Tan said the company wouldn't be able to meet full demand for its products. He said production efficiency, or yield, is also below his targets. \"We are on a multiyear journey,\" he said. \"It will take time and resolve.\"The chipmaker expects first-quarter revenue to range between $11.7 billion and $12.7 billion, and adjusted earnings per share to break even. That was below LSEG expectations for earnings of 5 cents per share and $12.51 billion in revenue. Over the last year, Intel shares have rallied more than double on hopes of a turnaround for the embattled American chipmaker, following investments from the U.S. government, SoftBank and Nvidia.Read more CNBC tech newsWaymo launches robotaxi service in Miami, extending U.S. leadTrump wants Nvidia to sell powerful AI chips to Beijing. Washington's China hawks are pushing backOpenAI seeking investments from Middle East sovereign wealth funds for multibillion-dollar roundJeff Bezos' Blue Origin launches satellite internet service to rival SpaceX, AmazonThe company's foundry business has long underperformed competitors, which are profiting massively from the data center artificial intelligence boom. Investors were looking for clarity on foundry customers as the next momentum mover for the stock. The company's foundry business creates chips for other companies. CFO David Zinsner told CNBC that Intel expects customers for its next-generation 14A technology to appear in the second half of the year. But analysts at RBC Capital Markets warned that a \"meaningful revenue contribution\" from 14A customers may not pop up until late 2028. \"We appreciate the recent excitement around opportunity for INTC but still don't see a clear path forward given further share loss, no AI strategy and unclear fab/packaging opportunities,\" wrote analysts at Jefferies.Despite the soft outlook, Intel topped Wall Street's fourth-quarter earnings and revenue expectations. WATCH: BofA's Vivek Arya on Intel: We see no reason to buy a stock at 90x P/Ewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Intel stock drops 17%, its worst day since 2024, as manufacturing troubles overshadow earnings beat",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214642-1761048654431-gettyimages-2240015417-jhangiani-indiamob251011_np4YW.jpeg?v=1769180659&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T21:01:06.000Z",
      "dateModified": "2026-01-23T21:01:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What obesity drugmakers see next in the market: More pills, easier access and drug combinations",
    "url": "https://www.cnbc.com/2026/01/23/weight-loss-glp-1-drugs-next-steps-for-eli-lilly-novo-nordisk-pfizer.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108253253-1768511651216-gettyimages-2255813292-WEGOVY_PILLS.jpeg?v=1769106872&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T12:50:24.000Z",
    "description": "A pharmacist displays a box of Wegovy pills at a pharmacy in Provo, Utah, Jan. 15, 2026.George Frey | Bloomberg | Getty ImagesThe future of the boomin",
    "body": "A pharmacist displays a box of Wegovy pills at a pharmacy in Provo, Utah, Jan. 15, 2026.George Frey | Bloomberg | Getty ImagesThe future of the booming obesity drug market won't hinge on drugs that deliver greater weight loss alone. Top executives from drugmakers big and small told CNBC that the next phase of the space will be defined by a broader range of treatment options and improved access for patients. Those were among the themes that emerged at the annual JPMorgan Healthcare Conference in San Francisco during interviews with top brass from Eli Lilly, Novo Nordisk, Pfizer and other drugmakers. \"We really see the obesity market going from, in this year, a one-size-fits-all kind of idea to different medicines for different patients. We don't have a crystal ball to know how that all sorts out,\" Dan Skovronsky, Eli Lilly's chief scientific officer, told CNBC in an interview at the conference.\"But I think by presenting people with options, they'll pick for themselves with their doctors, and I think we want to have something for everyone,\" he continued. \"And we're not done yet.\" Over the coming years, executives expect an expanding menu of obesity treatments that can be tailored to an individual patient's needs — from pills and less-frequent injections to combination regimens and drugs designed to preserve muscle mass while promoting weight loss. Some also expect the direct-to-consumer market to become an even larger slice of the market, while hoping that hurdles preventing patients from getting treatment continue to fall.Novo Nordisk and Eli Lilly are widely credited with establishing the market through their weekly GLP-1 injections for obesity and diabetes, which have surged in popularity in recent years. The next chapter is already taking shape, with Novo launching the first GLP-1 pill for obesity earlier this month and Lilly preparing to bring an oral option of its own to market later this year. While those companies will play a critical role in how the space evolves, other players from pharma titan Pfizer to little-known upstarts could also enter the market — both threatening the two rivals' sales dominance and offering more treatment alternatives for consumers.While access remains a challenge for many patients, the ability to get GLP-1s has improved notably over the past year. Both Novo and Lilly have slashed cash prices for their injections and struck deals with President Donald Trump in November that will, for the first time, introduce Medicare coverage for obesity drugs later this year.More treatment options and wider access could boost the case for analyst projections that say the weight loss and diabetes drug market could be worth almost $100 billion annually by the end of the decade. In an interview at the conference, Novo Nordisk CEO Mike Doustdar said the company and Lilly currently have around 15 million people combined who have obesity taking GLP-1s. There is still a \"long tail\" to reaching the 110 million that are reportedly suffering from the condition, along with those who are overweight, he added. In a May report, McKinsey said it expects a range of 25 to 50 million U.S. patients to use GLP-1s by 2030. Here's what executives say the future of the space could look like. The pill potentialPills have not yet proven more effective than injections. Still, the consensus among executives is that oral options could expand the market, reaching entirely new patients. That may include people who are afraid of needles, as well as people who could benefit from existing injections but don't view their condition as severe enough to warrant a weekly shot.In an interview at the conference, Doustdar said it could also include people who travel frequently and can't easily refrigerate injections. \"There is so much aligned exactly with this market expansion story … because there is a huge number of patients that are simply not interested in losing weight at the cost of injecting themselves,\" Doustdar said. The \"real growth\" and uptake of the pills is going to come from primary care physicians, who write the majority of prescriptions for Americans and typically prefer pills to injections, said Ray Stevens, the CEO of obesity market hopeful Structure Therapeutics. He said he believes his company's GLP-1 pill, aleniglipron, will be the third to enter the market after Eli Lilly's and Novo Nordisk's. Structure's oral drug will enter Phase 3 trials this year. Daily pills can offer more flexibility to patients. For example, Stevens said a patient could cut a pill in half to mitigate side effects on a day when they have an important meeting to attend. Lilly's Skovronsky said pills will also serve as a way for patients to \"deescalate their therapy\" after taking injections. The company in December released data showing that patients who initially took Wegovy or Zepbound shots maintained the majority of their weight loss after switching to Lilly's pill. \"They say, 'I've lost the weight, I've got this, so I can maintain this on my own with something less strong,'\" Skovronsky said. Structure is also developing an oral drugs that targets amylin, an emerging form of weight loss treatment that mimics a hormone co-secreted with insulin in the pancreas to suppress appetite and reduce food intake. Novo is developing a medicine called amycretin, which targets both GLP-1 and amylin to offer potentially enhanced weight loss. Mixing and matching drugsStevens said combination regimens are \"going to be the next phase of the field.\" For example, Structure hopes to combine its oral GLP-1 and amylin drugs to achieve even greater weight loss than one alone would, which he said will likely be \"one of the best combos of the future.\" It's too early to say which patients would be the best fit for that regimen, but Stevens said it could achieve \"good tolerability, really good patient experience and good efficacy.\" He said the company is already working on manufacturing the two ingredients together in a single pill, which is similar to what Novo's amycretin achieves. But he said combination regimens can also help treat certain obesity-related conditions better than one product alone. That could look like combining a GLP-1 with one of the existing treatments for fatty liver disease. \"I feel like the winners are now starting to emerge for the monotherapy\" treatments, he said. But Stevens said the treatment patients take will segment according to the other health conditions a person has on top of obesity, such as fatty liver disease, chronic kidney disease and cardiovascular disease. Lilly's upcoming pill is an oral GLP-1, but Skovronsky said the company can see the potential for a pill that targets that hormone along with another called GIP, since that's a \"preferred formulation.\" That's how tirzepatide, the active ingredient in Lilly's blockbuster obesity and diabetes injections, works. That drug has proven to be more effective than semaglutide, the active ingredient in Novo Nordisk's rival injections, which only targets GLP-1. Skovronsky said, \"we're working hard to create those medicines\" in an oral form, but aren't ready to disclose any details. Pfizer inherited several experimental injections and pills with combination potential from its roughly $10 billion acquisition of the obesity biotech Metsera last year. But Pfizer CEO Albert Bourla said the company is also developing an in-house oral drug that blocks the GIP receptor, which can significantly reduce side effects when combined with GLP-1. \"I have very high hopes that it will also differentiate,\" Bourla said.One biotech, Wave Life Sciences, also sees combinations as part of its broader strategy, its CEO Paul Bolno said in an interview at the conference. Different weight loss methodsWave is taking a different approach to weight loss, targeting how the body burns fat rather than suppressing appetite. The goal is to achieve comparable weight loss to GLP-1s, without the associated muscle loss, and with less frequent dosing of once or twice a year rather than weekly. That push comes amid growing focus on the quality of weight loss with next-generation obesity drugs, as GLP-1 treatments have raised concerns around muscle loss, side effects and patient drop-offs.Wave has an experimental injection that uses RNA technology to lower levels of a protein called activin E – a liver-produced protein that slows fat burning. By reducing that protein, Wave believes the drug can increase fat loss, particularly harmful visceral fat, while preserving lean muscle mass. Bolno said the company is developing the injection, called WVE-007, as a monotherapy or a potential maintenance treatment that patients can switch to and take far less frequently after being on GLP-1s.But he also sees the opportunity to combine the company's injection with GLP-1s to \"continue to drive benefits.\" \"We can double the weight loss on GLP-1s in combination,\" Bolno said, referring to what the company is seeing in preclinical research. He said adding Wave's injection on top of a GLP-1 won't make it more difficult for patients to tolerate the treatment regimen, so it makes the company's drug \"very amenable to combination\" options.As for who can use Wave's injection, Bolno said it will work for any patient since \"this happens to be a target that's actually in human genetics.\"The future of the industry will likely also include drugs that can achieve even greater weight loss than the current treatments on the market. Lilly in December released the first late-stage data on an injectable drug called retatrutide, the highest dose of which achieved more than 28% weight loss at 68 weeks among patients who stayed on the treatment. Lilly will read out data on seven other Phase 3 trials on the drug this year. Dubbed the \"triple G\" drug, retatrutide works by mimicking three hunger-regulating hormones — GLP-1, GIP and glucagon — rather than just one or two. That appears to have more potent effects on a person's appetite and satisfaction with food than other treatments. Skovronsky said the drug could serve patients who need additional weight loss or have other severe health conditions on top of obesity, such as arthritis knee pain. Novo Nordisk is racing to catch up: In March, it agreed to pay up to $2 billion for the rights to an early experimental drug from Chinese drugmaker United Laboratories International. The newly acquired treatment is a clear potential competitor to retatrutide because it similarly uses a three-pronged approach to promoting weight loss and regulating blood sugar.Patient access to drugsThe industry has made strides toward improving drug access for patients, and executives expect that will continue. The cash price of Novo's pill is already the lowest seen on the market, at $149 for the starting dose and up to $299 for the higher doses. GLP-1 injections are roughly $1,000 per month before insurance and without recent cash discounts.Both Pfizer's Bourla and Lilly's Skovronsky said upcoming Medicare coverage of obesity drugs should also move the needle with coverage. \"Once the government starts covering it in Medicare, it probably will become more and more uncomfortable for employers to not — it's that societal pressure,\" Skovronsky said. He also pointed to an \"activation of consumers,\" where patients are starting to call their employers and ask why their benefits don't cover obesity drugs. Drugmakers, researchers and scientists are also generating more data about the benefits of obesity drugs for health-care spending, which could help spur more employer coverage, Skovronsky said. \"So for employers, is there less absenteeism? Is there better productivity? Is there better medical costs?\" he said. \"The data's coming in, and we're seeing more and more of that.\" In terms of the direct-to-consumer channel, Skovronsky said it may become the \"fastest-growing segment\" of the space given the recent push for drugmakers to launch cash offerings. Lilly was among the first companies to launch a direct-to-consumer platform in 2024 offering its obesity drug Zepbound at a discount, and Novo followed more than a year later. Bourla estimated that the direct-to-consumer channel already makes up 30% of the obesity and diabetes drug market in the U.S. It could become closer to 90% or more of that market abroad, he added. When asked about what the broader market will look like by 2030, Structure's Stevens said he hopes access and affordability are no longer issues.\"I'm okay with the cost dropping because, to me, this has always been about volume and really trying to address a very large unmet need globally itself,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What obesity drugmakers see next in the market: More pills, easier access and drug combinations",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108253253-1768511651216-gettyimages-2255813292-WEGOVY_PILLS.jpeg?v=1769106872&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T12:50:24.000Z",
      "dateModified": "2026-01-23T12:50:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Airlines cancel nearly 4,000 weekend flights as massive winter storm sweeps across U.S.",
    "url": "https://www.cnbc.com/2026/01/23/winter-storm-fern-flight-cancellations.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108082634-1736189865570-gettyimages-2192165643-DC_SNOW.jpeg?v=1736189903&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T21:41:00.000Z",
    "description": "Airplanes on the tarmac during a snow storm at Ronald Reagan Washington National Airport in Arlington, Virginia, US, on Monday, Jan. 6, 2025. Ting She",
    "body": "Airplanes on the tarmac during a snow storm at Ronald Reagan Washington National Airport in Arlington, Virginia, US, on Monday, Jan. 6, 2025. Ting Shen | Bloomberg | Getty ImagesAirlines canceled nearly 4,000 U.S. flights scheduled for the weekend as a massive winter storm sweeps across the country, with heavy snow and sleet in the forecast followed by bitter cold.More than 560 U.S. flights were canceled on Friday, with nearly 2,400 canceled from Saturday's schedule, according to flight tracker FlightAware. Many of Saturday's cancellations were in and out of Dallas Fort Worth International Airport, with more than 1,100 scrubbed flights, and at Dallas Love Field, with 180 cancellations, the majority of the schedule at each airport.Carriers canceled another 1,600 U.S. flights scheduled for Sunday, though those numbers could rise as the storm approaches. Airlines routinely cancel flights ahead of a major storm to prevent planes, passengers and crew from getting stranded, which can worsen disruptions after severe weather moves out. American Airlines, Delta Air Lines, JetBlue Airways, Southwest Airlines, United Airlines and other U.S. carriers said they are waiving change and cancellation fees as well as fare differences to rebook for customers with tickets to and from more than 40 airports around the country. The waivers include restrictive basic economy tickets.American said it was repositioning its airplanes and increasing staffing at major airports to help soften the impact of the storm and to \"set the stage for a fast, safe recovery once conditions improve.\"The National Weather Service is warning that the winter storm could affect hundreds of millions of people and is expected to \"bring widespread heavy snow, sleet, and freezing rain from the Southern Rockies to New England through Monday.\"Read more CNBC airline newsBoeing outsold Airbus last year for first time since 2018, deliveries rise to 600Allegiant to buy rival budget airline Sun Country in $1.5 billion cash and stock dealWhy airline class wars will intensify in 2026American Airlines no longer lets basic economy flyers earn miles",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Airlines cancel nearly 4,000 weekend flights as massive winter storm sweeps across U.S.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108082634-1736189865570-gettyimages-2192165643-DC_SNOW.jpeg?v=1736189903&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T21:41:00.000Z",
      "dateModified": "2026-01-23T21:41:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]