[
  {
    "title": "Car prices hit an average of $50,000 for the first time—here's how much you'd pay per month",
    "url": "https://www.cnbc.com/2025/10/24/car-prices-hit-average-of-50000-dollars.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108216297-1761255508947-gettyimages-590778059-zef006943.jpeg?v=1761255568&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-24T15:31:16.000Z",
    "description": "New-car prices have never been higher.The average sale price reached $50,080 in September, marking the first time it has topped $50,000, according to ",
    "body": "New-car prices have never been higher.The average sale price reached $50,080 in September, marking the first time it has topped $50,000, according to Kelley Blue Book.The milestone came as shoppers rushed to buy electric vehicles before a $7,500 federal tax credit expired on Sept. 30, with EVs selling for an average of $58,124, which helped push overall prices higher, according to KBB.While new-car prices typically rise in early fall, September's year-over-year increase was the largest since the spring of 2023, driven by EV purchases, higher luxury sales and, to a lesser extent, tariffs, KBB says.\"Now that [the EV] incentive is gone, it's possible that electric vehicle sales will drop off somewhat and the average transaction price may dip below $50,000 in the later part of the year,\" Brian Moody, executive editor for Kelley Blue Book, tells CNBC Make It. Either way, car prices have climbed steadily since February. And once expenses like insurance, maintenance and fuel are factored in, monthly costs can exceed $1,000.What a $50,000 car really costs per monthTo show what today's prices mean for buyers, consider a $50,080 vehicle financed over 60 months with 20% down and a 7.12% interest rate — the current national average for a five-year new-car loan, according to Bankrate.That works out to a monthly payment of about $796. But when you add in gas and insurance, the real monthly cost climbs higher. Americans spend an average of $177 a month on fuel, per an analysis by Empower, and the national average cost of auto insurance with liability, collision and comprehensive protection is $242, per Experian. That brings total monthly costs for a new-car owner to roughly $1,215 a month.There are also annual and ongoing costs to consider, including:Maintenance and repairs: about $900 a year on average across all vehicle types in the U.S., according to ConsumerAffairsRegistration fees: an average of roughly $75 a year for registration, although it varies considerably by state, according to InsurifyConsider used or leased cars to offset costsIt's worth remembering that new cars can lose about 20% of their value in the first year and as much as 60% after five years, according to Kelley Blue Book.For cost-conscious buyers, it may be worth exploring used and leased options, which generally come with lower monthly payments.\"We're seeing more and more people turn to leasing as a way to keep ownership costs down as everything gets more expensive,\" says Zander Cook, co-founder of lease-buyout platform Lease End.Leasing essentially means renting a new car for a set term instead of buying it outright. While monthly payments tend to be lower, leases come with mileage limits — usually 10,000 to 15,000 miles per year — and may include fees for excess wear or mileage. Leases also don't result in ownership once the term ends.\"Leasing doesn't work for everyone. If you're driving a ton of miles a year or live somewhere really rural, it's probably not the best fit,\" Cook says. \"But for most people, especially those living in cities or suburbs, driving 10,000 to 12,000 miles a year, leasing makes a lot of sense.\"Another option is to buy a used car. The tradeoff here is that it may lead to higher maintenance and repair costs as the vehicle ages and warranty coverage expires.However, cars that are around three years old often hit the sweet spot between price and reliability, according to J.D. Power. By then, most models have absorbed the steepest depreciation but still fall within warranty coverage.Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience. Sign up today with coupon code EARLYBIRD for an introductory discount of 20% off. Offer valid Oct. 21 through Oct. 28, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Car prices hit an average of $50,000 for the first time—here's how much you'd pay per month",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108216297-1761255508947-gettyimages-590778059-zef006943.jpeg?v=1761255568&w=1920&h=1080"
      ],
      "datePublished": "2025-10-24T15:31:16.000Z",
      "dateModified": "2025-10-24T15:31:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hedge fund assets reach historic $5 trillion as quarterly capital flows hit 18-year high",
    "url": "https://www.cnbc.com/2025/10/24/hedge-fund-assets-reach-5-trillion-as-quarterly-capital-flows-soar.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108129778-1744272489426-gettyimages-2177203346-VukValcicCity1101024_2.jpeg?v=1761304286&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-24T11:25:17.000Z",
    "description": "A member of staff poses next to trading boards at the London Stock Exchange on April 25, 2025 in London, England.Carl Court | Getty Images News | Gett",
    "body": "A member of staff poses next to trading boards at the London Stock Exchange on April 25, 2025 in London, England.Carl Court | Getty Images News | Getty ImagesThe amount of money managed by hedge funds has reached an all-time high of $5 trillion, fueled by a surge in capital allocations in the third quarter coupled with positive investment returns.Analysis published Thursday by industry tracker Hedge Fund Research (HFR) showed total global assets under management stood at a landmark $4.98 trillion at the end of the third quarter.Overall industry assets swelled by $238.4 billion in the three-month period that ended Sept. 30.This included $33.7 billion in net new allocations from investors such as pension funds, insurance companies, sovereign wealth funds, endowments and family offices. HFR said that was the biggest quarterly net asset inflow since the third quarter of 2007 — before the Global Financial Crisis.The remainder of the third-quarter capital increase stemmed from positive trading gains made by managers throughout the three-month period.Here, HFR's main Fund Weighted Composite Index — which aims to provide an overall snapshot of the industry — gained 5.4% during the period.The index, which tracks the gains and losses of more than 1,400 single manager funds across all strategy types, is up 9.5% since the start of 2025.HFR president Kenneth Heinz said the \"historic growth\" has been driven by a mix of rising M&A activity among corporates, successful bets on the ongoing AI and tech boom and growing expectations for lower interest rates.\"While risk-on sentiment has dominated recent months, risks have also evolved, with managers participating in acceleration of these trends through year end but also positioning for sentiment and trend reversals across equities, commodities, currencies and cryptocurrencies,\" Heinz said.More to come?The big winners during the third quarter were equity hedge fund managers, who trade stocks long and short, often using thematic analyses, sector-specific approaches and fundamental single-company research.During the third quarter, they made 7.2% in investment returns, and saw their assets grow by $96.7 billion, including positive investor net inflows of $18 billion.Overall, that brought equity-focused funds' total capital to $1.5 trillion — making them the biggest hedge fund sub-strategy in terms of assets. Year-to-date, stock-picking strategies have gained about 13.6%.The other key beneficiary has been macro hedge funds, which invest in macroeconomic and geopolitical trends using equities, bonds, currencies, commodities and other assets.General view of the City of London skyline, the capital's financial district.Sopa Images | Lightrocket | Getty ImagesMacro strategies' assets grew by $33.5 billion overall during Q3, with clients pouring in $1.7 billion net, bringing total macro capital to $759 billion. Macro managers added 4.7% in investment returns in Q3. Having recouped losses suffered earlier in the year, the sector is up 3.8% in the nine months to the end of September.Heinz said the industry can expect more money to flow into its coffers as investors look to traverse a challenging geopolitical environment and trade policy uncertainty.\"Institutions seeking to strategically position for these trends, including both continued acceleration and defensive reversals, are likely to increase allocations to managers which have demonstrated their ability to navigate both the recent risk-on trends, as well as volatile reversals, with these allocations set to drive industry growth beyond the $5 trillion milestone into year-end.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hedge fund assets reach historic $5 trillion as quarterly capital flows hit 18-year high",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108129778-1744272489426-gettyimages-2177203346-VukValcicCity1101024_2.jpeg?v=1761304286&w=1920&h=1080"
      ],
      "datePublished": "2025-10-24T11:25:17.000Z",
      "dateModified": "2025-10-24T11:25:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Illegal NBA gambling busts put sportsbooks on the defense",
    "url": "https://www.cnbc.com/2025/10/23/nba-gambling-scheme-puts-sportsbooks-on-the-defense.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108205371-1759179454378-gettyimages-2155740972-AFP_34VQ69H.jpeg?v=1761251881&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-23T19:51:15.000Z",
    "description": "NBA and FanDuel online sports betting signage is displayed on the side of a building in Phoenix, Arizona, on June 5, 2024.Patrick T. Fallon | AFP | Ge",
    "body": "NBA and FanDuel online sports betting signage is displayed on the side of a building in Phoenix, Arizona, on June 5, 2024.Patrick T. Fallon | AFP | Getty Images\"This is the insider trading saga for the NBA.\"That was FBI Director Kash Patel's message at a news conference Thursday, announcing the arrests of Portland Trailblazers coach Chauncey Billups and Miami Heat player Terry Rozier.The two were among more than 30 people charged in an illegal poker ring involving organized crime and cheating, according to prosecutors. The U.S. Attorney, FBI and other law enforcement agencies are also charging Rozier as well as former Cleveland Cavaliers player and assistant coach Damon Jones with a sports betting scheme to throw games or make illegal wagers on inside information.It's the kind of news that could prove damaging to the legal gambling industry — or, perhaps, a real opportunity.Legal licensed sportsbooks in the U.S. have enjoyed massive growth in recent years, but they're still trying to expand. The market leaders FanDuel, DraftKings, BetMGM and Caesars don't have access to the two most populous states, California and Texas, because they have not legalized sports gambling.When state lawmakers debate the pros and cons of legalizing sports betting, there are persistent questions about sports integrity and the opportunities for cheating. Players arrested on federal charges, accused of manipulating game play and profiting on illegal activity provide solid evidence for a sermon against the dangers of gambling.The commercial gambling industry knows it. And it's seizing the moment to reiterate its protections.\"Today's events are deeply disturbing, and should concern fans, athletes, and everyone who loves sports and values integrity and fair play,\" FanDuel, owned by Flutter, said in a statement to CNBC shortly after federal prosecutors and law enforcement wrapped up their news conference.\"We are unwavering in our commitment to rooting out abuses by those who seek to undermine fair competition and the games we love,\" FanDuel said.The American Gaming Association blasted out its statement: \"Today's revelations are a stark reminder of the pervasive and predatory illegal market, ensnaring countless individuals and operating in the shadows ... It is important to recognize that the regulated legal market delivers transparency, oversight, and collaboration with authorities that assists in bringing these bad actors to light.\"A DraftKings spokesman told CNBC, \"We fundamentally believe that regulated online sports betting is the best way forward, to monitor for and detect suspicious behavior.\"Sportsbooks and the integrity monitoring companies that work with them were involved in alerting authorities to unusually large wagers on Jontay Porter prop bets that resulted in Porter being banned for life from the NBA last year and convicted on federal charges.Prosecutors say Porter's activity was part of the same conspiracy ring operating between 2022 and 2024 that resulted in six arrests this week.A rapid response from the sportsbooks with carefully crafted crisis communications messages could be designed to ward off threats from state gaming regulators to crack down on player props, which are often the basis of parlay bets.Parlays, which combine several bet criteria into a single wager, are very profitable for the sportsbooks and popular with customers, even though there are lower chances of winning.The negative headlines over illegal gambling could ultimately prove to be an opportunity in the long run for commercial and tribal casinos if it prompts more enforcement action against unlicensed operators.After all, unlicensed gambling in the U.S. is estimated to bring in $674 billion in wagers annually, the AGA said in August.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Illegal NBA gambling busts put sportsbooks on the defense",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108205371-1759179454378-gettyimages-2155740972-AFP_34VQ69H.jpeg?v=1761251881&w=1920&h=1080"
      ],
      "datePublished": "2025-10-23T19:51:15.000Z",
      "dateModified": "2025-10-23T19:51:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "GM lays off more than 200 salaried workers in latest round of job cuts",
    "url": "https://www.cnbc.com/2025/10/24/gm-layoffs-job-cuts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214758-1761058610938-108214758-1761058506292-gettyimages-1040898016-87064775.jpg?v=1761319845&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-24T16:00:48.000Z",
    "description": "The headquaters of US auto company General Motos (GM) in Detroit, Michigan.Uli Deck | Picture Alliance | Getty ImagesDETROIT – General Motors laid off",
    "body": "The headquaters of US auto company General Motos (GM) in Detroit, Michigan.Uli Deck | Picture Alliance | Getty ImagesDETROIT – General Motors laid off more than 200 salaried employees on Friday, as the automaker continues to reevaluate its businesses and cut costs to boost profits.The impacted employees were largely Computer-Aided Design, or CAD, engineers who worked at the company's global tech campus in metro Detroit, according to GM.\"We're restructuring our design engineering team to strengthen our core architectural design engineering capabilities,\" GM said in an emailed statement. \"As a result, a number of CAD execution roles have been eliminated. We recognize the efforts and accomplishments of the impacted team members, and we thank them for their contributions.\"GM declined to comment on the number of employees affected, but a source familiar with the matter confirmed to CNBC that more than 200 employees, which was first reported by Bloomberg News. The person spoke anonymously because the number had not yet been made public.The employees were told their roles were being eliminated due to \"business conditions\" and not their performance via Microsoft Teams calls on Friday, the source said.The Detroit automaker has been regularly reviewing its business units and organizations for years in an effort to cut costs, boost profits and eliminate what it considers unneeded or overstaffed roles for future operations.The most recent layoffs represent a small percentage of the automaker's salaried workforce, but continue a trend of white-collar U.S. headcount reductions. GM's U.S. salaried headcount fell from 53,000 in 2023 to 50,000 to end last year.GM's layoffs also come a day after all-electric vehicle maker Rivian laid off roughly 4.5% of its workforce, or more than 600 people, to restructure some teams as the EV market faces growing challenges amid policy changes and slower-than-expected demand. The most recent cuts come as President Donald Trump touted on social media Friday that Ford Motor and GM are \"UP BIG on Tariffs\" amid tariff changes last week for heavy- and medium-duty trucks, which he referred to as \"Big and Midsized Trucks.\"While both Ford and GM, including CEO Mary Barra, this week praised the tariff changes, which also included extending offsets on U.S.-produced vehicles, the automakers are still seeing additional cost burdens from the levies. These changes are simply helping to lower those added costs.The layoffs come days after GM raised its 2025 financial guidance Tuesday as it beat Wall Street's top- and bottom-line earnings expectations for the third quarter, causing the stock to have its second-best day on the market since its 2009 emergence from bankruptcy.Shares of GM are up more than 29% this year, while Ford's stock is up roughly 38%. Both hit new 52-week highs on Friday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "GM lays off more than 200 salaried workers in latest round of job cuts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214758-1761058610938-108214758-1761058506292-gettyimages-1040898016-87064775.jpg?v=1761319845&w=1920&h=1080"
      ],
      "datePublished": "2025-10-24T16:00:48.000Z",
      "dateModified": "2025-10-24T16:00:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump White House ballroom financed by Big Tech and these other corporate donors",
    "url": "https://www.cnbc.com/2025/10/23/trump-white-house-east-wing-ballroom-donors-apple-amazon-meta-microsoft-google.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108215865-1761220017640-gettyimages-2242389845-WHITEHOUSE.jpeg?v=1761220051&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-23T20:34:57.000Z",
    "description": "U.S. President Donald Trump speaks holding a photos of the new ballroom during a meeting with NATO Secretary General Mark Rutte in the Oval Office of ",
    "body": "U.S. President Donald Trump speaks holding a photos of the new ballroom during a meeting with NATO Secretary General Mark Rutte in the Oval Office of the White House in Washington, DC on October 22, 2025. Salwan Georges | The Washington Post | Getty ImagesBig Tech and other publicly traded companies are helping to finance the $300 million White House ballroom planned by President Donald Trump.The White House East Wing has been demolished to make room for the 90,000 square foot ballroom, sparking public anger after Trump promised in July that the building would not be impacted.Trump has said the construction of the ballroom will be financed by his own funds and corporate and individual donors at no cost to the taxpayer. The president said Wednesday the project will cost $300 million, up from an initial estimate of $200 million.Trump has not said how much he is spending. White House press secretary Karoline Leavitt told reporters on Thursday that the president will disclose his contribution.The White House has released a list of donors that include Amazon, Alphabet, Apple, Microsoft and Meta.Alphabet is contributing $22 million which represents about 7% of the project's estimated cost. Its contribution is the result of a settlement reached with Trump last month over a lawsuit he filed against YouTube for banning him from the platform after a riot by his supporters against Congress on Jan. 6, 2021.The settlement notes that $22 million will be contributed on Trump's behalf \"to the Trust for the National Mall, a 501(c)(3) tax-exempt entity dedicated to restoring, preserving, and elevating the National Mall, to support the construction of the White House State Ballroom.\"Donors also include Palantir, Micron, Coinbase, Lockheed Martin, Continental Resources founder Harold Hamm, and Cameron and Tyler Winklevoss, according to the White House list.\"Lockheed Martin is grateful for the opportunity to help bring the President's vision to reality and make this addition to the People's House, a powerful symbol of the American ideals we work to defend every day,\" a company spokesperson said in a statement.Comcast, CNBC's current parent company, is also on the donor list. CNBC has reached out to Comcast for comment.Here are the donors disclosed by the White House:Altria Group Inc.AmazonAppleBooz Allen Hamilton Inc.Caterpillar Inc.CoinbaseComcast CorporationJ. Pepe and Emilia FanjulHard Rock InternationalGoogle HP Inc.Lockheed MartinMeta PlatformsMicron TechnologyMicrosoftNextEra Energy Inc.Palantir Technologies Inc.RippleReynolds AmericanT-MobileTether AmericaUnion Pacific RailroadAdelson Family FoundationStefan E. BrodieBetty Wold Johnson FoundationCharles and Marissa CascarillaEdward and Shari GlazerHarold Hamm Benjamin Leon Jr.The Lutnick FamilyThe Laura & Isaac Perlmutter FoundationStephen A. SchwarzmannKonstantin SokolovKelly Loeffler and Jeff SprecherPaolo TiramaniCameron WinklevossTyler WinklevossDisclosure: Comcast, the current parent company of CNBC, is on the list of corporate donors. It is not clear how much Comcast has contributed to the project. CNBC will spin off from Comcast under the ownership of a new parent company, Versant.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump White House ballroom financed by Big Tech and these other corporate donors",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108215865-1761220017640-gettyimages-2242389845-WHITEHOUSE.jpeg?v=1761220051&w=1920&h=1080"
      ],
      "datePublished": "2025-10-23T20:34:57.000Z",
      "dateModified": "2025-10-23T20:34:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Target cuts 1,800 corporate jobs in its first major layoffs in a decade",
    "url": "https://www.cnbc.com/2025/10/23/target-layoffs-corporate-jobs-sales-slump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108188060-1755616409044-gettyimages-2228107591-250802_sd_logos_113.jpeg?v=1755616566&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-23T21:04:11.000Z",
    "description": "A Target logo is displayed outside one of their stores on August 2, 2025 in San Diego, California. Kevin Carter | Getty ImagesTarget said on Thursday ",
    "body": "A Target logo is displayed outside one of their stores on August 2, 2025 in San Diego, California. Kevin Carter | Getty ImagesTarget said on Thursday it's cutting 1,800 corporate jobs as the retailer tries to get back to growth after four years of roughly stagnant sales.It marks the first major round of layoffs in a decade for the Minneapolis-based retailer. It announced the layoffs in a memo sent by Target's incoming CEO Michael Fiddelke to employees at its headquarters.The eliminated roles are a combination of about 1,000 employee layoffs and about 800 positions that will no longer be filled, a company spokesman said. Together, they represent an approximately 8% cut to Target's corporate workforce, according to the memo. Affected employees will be notified Tuesday.The retailer announced the cuts as it nears a leadership change.Target in August named Fiddelke, currently its chief operating officer and formerly chief financial officer, as the successor to longtime leader Brian Cornell. He takes the helm February 1.Fiddelke has also overseen the Enterprise Acceleration Office, an effort announced in May, which looked for ways to simplify company operations, use technology in new ways and speed up Target's growth. Target has been fighting a sales slump, as it tries to rebound from declining store traffic, inventory troubles and customer backlash. The company has said it expects annual sales to decline this year. Its shares have fallen by 65% since their all-time high in late 2021.Compared to retail competitors, Target draws less of its overall sales from groceries and other necessities, which can make its business more vulnerable to the ups and downs of the economy and consumer sentiment. About half of Target's sales come from discretionary items, compared to only 40% at Walmart, according to estimates from GlobalData Retail.As a result of that and other company-specific challenges, Target's sales trends and stock performance have diverged sharply from competitors. Shares of Walmart are up about 123% in the past five years, compared to Target's decline of 41% during the same time period.In a memo sent Thursday to employees at Target's headquarters, Fiddelke said the employee cuts will help Target make urgent changes.\"The truth is, the complexity we've created over time has been holding us back,\" he said in the memo. \"Too many layers and overlapping work have slowed decisions, making it harder to bring ideas to life.\"He said the cuts are difficult, but \"a necessary step in building the future of Target and enabling the progress and growth we all want to see.\"   Target employees affected by the layoffs will receive pay and benefits until January 3, in addition to severance packages, according to a company spokesman. No roles in stores or in Target's supply chain were impacted by the cuts, the company spokesman said.Read the full memo from Fiddelke:Team, This spring, we launched our enterprise acceleration efforts with a clear ambition: to move faster and simplify how we work to drive Target's next chapter of growth. The truth is, the complexity we've created over time has been holding us back. Too many layers and overlapping work have slowed decisions, making it harder to bring ideas to life. On Tuesday, we'll share changes to our headquarters structure as an important step in accelerating how we work. This includes eliminating about 1,800 non-field roles — about 8% of our global HQ team. As we make these changes, I'm asking all U.S. HQ team members to work from home next week. Target in India and our other global teams will follow their in-office routines. Decisions that affect our team are the most significant ones we make, and we never make them lightly. I know the real impact this has on our team, and it will be difficult. And, it's a necessary step in building the future of Target and enabling the progress and growth we all want to see.   Adjusting our structure is one part of the work ahead of us. It will also require new behaviors and sharper priorities that strengthen our retail leadership in style and design and enable faster execution so we can: Lead with merchandising authority; Elevate the guest experience with every interaction; and Accelerate technology to enable our team and delight our guests. Put together, these changes set the course for our company to be stronger, faster and better positioned to serve guests and communities for many years to come. Michael ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Target cuts 1,800 corporate jobs in its first major layoffs in a decade",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108188060-1755616409044-gettyimages-2228107591-250802_sd_logos_113.jpeg?v=1755616566&w=1920&h=1080"
      ],
      "datePublished": "2025-10-23T21:04:11.000Z",
      "dateModified": "2025-10-23T21:04:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ford beats on earnings but lowers 2025 guidance after supplier fire",
    "url": "https://www.cnbc.com/2025/10/23/ford-motor-earnings-q3-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214455-17609973122025-10-20t215148z_1001305606_rc2wfhayx4gr_rtrmadp_0_ford-results.jpeg?v=1760997355&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-23T21:33:00.000Z",
    "description": "A Ford logo on a Ford F-150 pickup truck for sale in Encinitas, California, U.S. Oct. 20, 2025. Mike Blake | ReutersDETROIT – Ford Motor beat Wall Str",
    "body": "A Ford logo on a Ford F-150 pickup truck for sale in Encinitas, California, U.S. Oct. 20, 2025. Mike Blake | ReutersDETROIT – Ford Motor beat Wall Street's third-quarter earnings expectations but lowered its 2025 guidance due to impacts of a supplier fire, which is disrupting production of its highly profitable large trucks and SUVs.The Detroit automaker said the fire last month at a New York plant for aluminum supplier Novelis is expected to cost it between $1.5 billion and $2 billion, but it expects to mitigate much of that this year and next, largely by increasing manufacturing of the impacted vehicles once supplies are more available.Ford stock initially fell during extended trading Thursday before swinging to being up roughly 4%. It closed at $12.34 per share Thursday and the stock is up 24% so far this year.Ford said the total cost of the fire on its business is expected to be less than $1 billion by next year, as the company announced plans Thursday to \"significantly increase\" its U.S. pickup truck production. That includes adding 1,000 workers early next year to plants that produce the vehicles in Michigan and Kentucky. The automaker expects the additional production next year to recoup about half of the 100,000 units it expects to lose due to the fire this year.\"We are working intensively with Novelis and others to source aluminum that can be processed in the cold rolling section of the plant that remains operational while also working to restore overall plant production. We have made substantial progress in a short time to minimize the impact in 2025 and recover production in 2026,\" Ford CEO Jim Farley said in a statement.Stock Chart IconStock chart iconFord stockFord Chief Operating Officer Kumar Galhotra said the fire occurred in one of three main parts of the plant — a hot mill — with the non-impacted areas continuing to operate. The impacted part of the plant is expected to restart sooner than originally expected in late November or early December, he said.Ford's new 2025 guidance includes adjusted earnings before interest and taxes of $6 billion to $6.5 billion, down from $6.5 billion to $7.5 billion as of July; adjusted free cash flow of $2 billion to $3 billion, down from $3.5 billion to $4.5 billion, and capital spending of roughly $9 billion, which remains the same.Ford CFO Sherry House said without the supplier fire, the company was planning to raise its 2025 guidance to more than $8 billion in adjusted EBIT rather than cutting it.RBC Markets analyst Tom Narayan in a note Thursday called the guidance change \"effectively\" a raise, backing out the supplier fire and changes in tariff costs.Ford lowered its expected tariff costs by $1 billion, to roughly $2 billion,  half of which the automaker expects to offset through other actions, due to changes Friday by the Trump administration that included exemption and extending tariff offsets on American-made vehicles.Here's what Wall Street expects, based on average analysts' estimates compiled by LSEG:Earnings per share: 45 cents adjusted vs. 36 cents expectedAutomotive revenue: $47.19 billion vs. $43.08 billion expectedFord said there was no material impact to third-quarter results due to the fire, but that it will impact its fourth-quarter results.The company's third-quarter revenue, including its financial arm, was $50.5 billion, a quarterly record and 9% increase from the same time a year ago. Its net income during the quarter was $2.4 billion, up from $900 million a year earlier, and adjusted earnings before interest and taxes were level at $2.6 billion. Both included adverse net tariff-related impact of $700 million during the third quarter.Adjusted earnings exclude one-time or special items, some interest and taxes as well as other financials not considered \"core\" to the company's operations. \"Our performance in the quarter show that the Ford+ plan is delivering consistent improvement. Our underlying business becomes stronger, more efficient, more agile and increasingly durable,\" House told media Thursday.The Ford+ plan is a turnaround and cost-improvement plan under Farley, who started leading the automaker more than five years ago. The company said it remains on track to cut $1 billion in costs this year as part of the plan.Ford's third-quarter results were led by its \"Pro\" commercial and fleet business that reported EBIT results of nearly $2 billion, up $172 million from a year earlier. Its traditional operations, known as \"Ford Blue\" reported EBIT earnings of $1.54 billion, while its \"Model e\" electric vehicle business widened losses by $179 million compared with a year ago, to $1.41 billion.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ford beats on earnings but lowers 2025 guidance after supplier fire",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214455-17609973122025-10-20t215148z_1001305606_rc2wfhayx4gr_rtrmadp_0_ford-results.jpeg?v=1760997355&w=1920&h=1080"
      ],
      "datePublished": "2025-10-23T21:33:00.000Z",
      "dateModified": "2025-10-23T21:33:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney warns ESPN, other networks may go out on YouTube TV at the end of the month",
    "url": "https://www.cnbc.com/2025/10/23/disney-espn-youtube-tv-network-dispute.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108216239-1761250904885-ESPN_YouTubeTV.jpg?v=1761250922&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-23T21:14:54.000Z",
    "description": "ESPN and YouTube TV.David Buono | Icon Sportswire | Jaque Silva | NurPhoto | Getty ImagesJust a month after reaching an agreement with NBCUniversal to",
    "body": "ESPN and YouTube TV.David Buono | Icon Sportswire | Jaque Silva | NurPhoto | Getty ImagesJust a month after reaching an agreement with NBCUniversal to avoid dropping its networks, YouTube TV has another potential blackout on its hands — this time with Disney.Disney said Thursday it would begin running public messages for YouTube TV subscribers to alert customers that the company's networks, including ABC and ESPN, will be dropped from the service if the two sides can't reach a new distribution agreement, which expires October 30 at 11:59 p.m. ET.\"This is the latest example of Google exploiting its position at the expense of their own customers,\" a Disney spokesperson said in a statement. \"If we don't reach a fair deal soon, YouTube TV customers will lose access to ESPN and ABC, and all our marquee programming — including the NFL, college football, NBA and NHL seasons — and so much more.\"Disney began running public announcements on YouTube TV at 5 p.m. ET.As with NBCUniversal, YouTube TV is asking for better rates for Disney's programming, according to people familiar with the discussions. YouTube TV has about 10 million subscribers and wants more favorable terms given their scale, the people said.\"We've been working in good faith to negotiate a deal with Disney that pays them fairly for their content on YouTube TV,\" a spokesperson for the service said in a statement. \"Unfortunately, Disney is proposing costly economic terms that would raise prices on YouTube TV customers and give our customers fewer choices, while benefiting Disney's own live TV products - like Hulu + Live TV and, soon, Fubo. Without an agreement, we'll have to remove Disney's content from YouTube TV and if it remains unavailable for an extended period of time, we will offer subscribers a $20 credit.\"Get the CNBC Sport newsletter directly to your inboxThe CNBC Sport newsletter with Alex Sherman brings you the biggest news and exclusive interviews from the worlds of sports business and media, delivered weekly to your inbox.Subscribe here to get access today.YouTube TV and NBCUniversal first reached a temporary extension to avoid a blackout before inking a finalized deal a few days later.Two years ago, Disney reached an unusual distribution agreement with Charter, the largest U.S. pay TV provider by subscribers, that gave certain Charter subscribers access to Disney+, Hulu and ESPN+ for no extra charge. Disney is willing to offer YouTube TV the same terms as that Charter agreement, two of the people said.YouTube TV is again asking to ingest Disney's streaming content, giving customers the ability to view programming on Disney+, Hulu and ESPN+ without leaving the YouTube platform, according to a person familiar with the negotiations. YouTube TV also asked for this in its negotiations with NBCUniversal and was rejected. Similarly, Disney has no plans to say yes to this request, according to people familiar with the company's thinking.The clash between Disney and YouTube has an added element of conflict. YouTube hired away former Disney distribution executive Justin Connolly earlier this year, prompting Disney to file a breach of contract lawsuit. Connolly has recused himself from these discussions, according to the people familiar with the process.Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast's planned spinoff of Versant.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney warns ESPN, other networks may go out on YouTube TV at the end of the month",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108216239-1761250904885-ESPN_YouTubeTV.jpg?v=1761250922&w=1920&h=1080"
      ],
      "datePublished": "2025-10-23T21:14:54.000Z",
      "dateModified": "2025-10-23T21:14:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AMD's stock pops 6% on report IBM can use its chips for quantum computing",
    "url": "https://www.cnbc.com/2025/10/24/amd-stock-pops-on-report-ibm-can-use-its-chips-for-quantum-computing.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108184165-1754920654587-gettyimages-2185244462-INDIA_LISA_SU.jpeg?v=1754920688&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-24T15:45:12.000Z",
    "description": "Shares of Advanced Micro Devices jumped more than 6% on a report that IBM can utilize the company's chips to run certain quantum computing algorithms.",
    "body": "Shares of Advanced Micro Devices jumped more than 6% on a report that IBM can utilize the company's chips to run certain quantum computing algorithms.IBM gained about 6%.Reuters reported on Friday that a paper will publish next week showing that IBM can run a quantum error-correction algorithm on AMD's field-programmable gate array chips.Representatives from AMD and IBM didn't immediately respond to requests for comment.In August, the two companies announced an agreement to develop quantum computing capabilities and integrate technologies. IBM has also said it plans to debut a quantum computer by 2029. The technology utilizes quantum mechanics to address problems that traditional computers are unable to solve. Technology giants such as Google, Microsoft and Amazon are also racing to develop quantum computing.Last year, Microsoft rolled out its first quantum computing chip, while Google launched its breakthrough WIllow. A top quantum executive at the internet search company told CNBC in March that the technology was \"five years out from a real breakout.\"The various announcements have brought renewed interest to the quantum space, boosting stocks like D-Wave Quantum, Rigetti Computing, and IonQ, which all climbed on Friday. The Trump administration on Thursday refuted a report that it was negotiating stakes in quantum companies.WATCH: Commerce Department denies it is currently in talks for stakes in quantum companies",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AMD's stock pops 6% on report IBM can use its chips for quantum computing",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108184165-1754920654587-gettyimages-2185244462-INDIA_LISA_SU.jpeg?v=1754920688&w=1920&h=1080"
      ],
      "datePublished": "2025-10-24T15:45:12.000Z",
      "dateModified": "2025-10-24T15:45:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What a cut in Reliance's Russian crude purchases would mean for India",
    "url": "https://www.cnbc.com/2025/10/24/what-a-cut-in-reliances-russian-crude-purchases-would-mean-for-india.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108121904-1743046749258-gettyimages-1234869791-INDIA_RELIANCE.jpeg?v=1743046781&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-24T11:38:35.000Z",
    "description": "The Reliance Industries Ltd. oil refinery in Jamnagar, Gujarat, India, on Saturday, July 31, 2021.Bloomberg | Bloomberg | Getty ImagesIndia's largest ",
    "body": "The Reliance Industries Ltd. oil refinery in Jamnagar, Gujarat, India, on Saturday, July 31, 2021.Bloomberg | Bloomberg | Getty ImagesIndia's largest private oil refiner Reliance Industries is reportedly halting purchases of Russian crude, following the U.S.' decision to sanction Russia's two largest oil companies, Rosneft and Lukoil.Reliance has become a major buyer of Russian crude. In September, it purchased around 629,590 barrels of Russian crude per day from the two firms, out of India's total imports of 1.6 million barrels per day, according to data by commodities data analytics firm Kpler.Over the same month last year, Reliance purchased around 428,000 barrels per day of oil from the Russian companies.In fact, India's Russian crude imports used to account for less than 3% of its total crude import basket, but today account for one-third of India's crude imports, experts say.Reliance has not responded to CNBC requests for comment on reports that it is stopping the purchase of Russian crude.It comes as the U.S. Treasury Department on Wednesday levied sanctions on Rosneft and Lukoil, citing Moscow's \"lack of serious commitment\" to ending the war in Ukraine. The sanctions aim to \"degrade\" the Kremlin's ability to finance its war, the U.S. department said, signaling more measures could follow.If Reliance does halt Russian purchases, it will have \"negative impacts on [Reliance's] margin and profitability as Russian crude constitute more than 50% of [its] crude diet,\" Pankaj Srivastava, SVP of commodity oil markets at market research firm Rystad Energy said in emailed comments.He added that the availability of \"similar crude is not an issue\" and can be sourced from West Asia, Brazil, or Guyana, but Reliance is unlikely to get the same price as it does on Russian crude, as it has long-term deals with suppliers like Rosneft.Last December, Reliance Industries signed a deal to import crude oil worth $12 billion-$13 billion a year from Russia's Rosneft for 10 years, which would translate to roughly 500,000 barrels per day, according to a report by Reuters.'Opportunistic buying'The purchase of Russian oil by Indian refiners was \"opportunistic buying\" driven by discounts versus comparable grades, said Vandana Hari of Vanda Insights.India bought 38% of Russia's crude exports in September, second only to China at 47% according to Helsinki-based think tank Centre for Energy and Clean Air.Hari added that Indian refineries can easily pivot to buying from sources with the trade-off being \"pressure on refining margins.\"Muyu Xu, senior crude oil analyst at Kpler, said the Indian refining giant might face some short-term issues as it looks to replace the Russian crude.\"Given the large volumes under the Reliance-Rosneft deal, we expect some short-term friction for Reliance in securing replacement barrels,\" says Muyu Xu, senior crude oil analyst at Kpler.She added that \"Russia's medium-sour Urals remains about $5–6/bbl [barrel] cheaper than Middle Eastern crude of similar quality.A report by Jefferies last month indicated that the impact of Reliance Industries moving away from Russian oil was \"manageable.\"The brokerage said in September that it had received queries from investors about the possible financial impact on Reliance if it halts its imports of Russian oil due to sanctions.The benefit of Russian crude accounts for around 2.1% of the firm's estimated consolidated EBITDA of 2.05 trillion rupees ($ 22.8 billion) for fiscal year 2027, the brokerage said.Reliance's consolidated EBITDA for the six months of fiscal year 2026 was 1.08 trillion Indian rupees ($12.3 billion), of which 295 billion rupees were from its oil-to-chemicals segment, while its telecom and retail ventures together contributed to nearly 500 billion rupees.Hopes of a U.S. trade dealOther Indian refiners are also looking to cut imports of Russian oil. Weaning off Russian oil might raise India's import bill, but it won't be \"as big a sticker shock as [it] might have been if crude was in the $70 or $80 range,\" said Hari of Vanda Insights.U.S. West Texas Intermediate futures were trading around $61.83 a barrel on Friday.Experts also say the benefits of India cutting back on Russian oil purchases outweigh the downsides.According to Natixis' Senior Economist Trinh Nguyen, the arbitrage that Russian oil offered during the energy crisis has tapered off, and there is no need for India now to have significant purchases of Russian oil.watch nowIndia's Russian crude purchase has been a sore point in its trade relations with the U.S., which culminated in the U.S. imposing a total 50% tariff on Indian goods exported to the U.S..With both state-owned and private refiners expected to halt purchase of Russian crude — a long-standing demand of U.S. President Donald Trump — the chances of India negotiating a mutually beneficial trade deal with the U.S. have increased.— CNBC's Ying Shan Lee contributed to this report ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What a cut in Reliance's Russian crude purchases would mean for India",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108121904-1743046749258-gettyimages-1234869791-INDIA_RELIANCE.jpeg?v=1743046781&w=1920&h=1080"
      ],
      "datePublished": "2025-10-24T11:38:35.000Z",
      "dateModified": "2025-10-24T11:38:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Applied Materials lays off 4% of workforce",
    "url": "https://www.cnbc.com/2025/10/23/applied-materials-lays-off-4percent-of-workforce.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108186599-1755269220052-gettyimages-1232980841-APPLIED_MATERIAL_EARNS.jpeg?v=1761258095&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-23T22:50:08.000Z",
    "description": "Signage outside Applied Materials headquarters in Santa Clara, California, U.S., on Thursday, May 13, 2021. David Paul Morris | Bloomberg | Getty Imag",
    "body": "Signage outside Applied Materials headquarters in Santa Clara, California, U.S., on Thursday, May 13, 2021. David Paul Morris | Bloomberg | Getty ImagesChip equipment manufacturer Applied Materials is laying off 4% of its workforce.The company on Thursday began notifying impacted employees around the world \"across all levels and groups,\" it said in a filing. Applied Materials provides equipment, services and software to industries, including the semiconductor industry.Applied Materials had approximately 36,100 full-time employees, according to an August 2025 filing. A layoff of 4% would represent about 1,444 employees.\"Automation, digitalization and geographic shifts are redefining our workforce needs and skill requirements,\" the company wrote in the filing. \"With this in mind, we have been focused for some time on building high-velocity, high-productivity teams, adopting new technologies and simplifying organizational structures.\"The move comes at the end of the company's fiscal year. Earlier this month, the Applied Materials forecasted a $600 million hit to fiscal 2026 revenue after the U.S. expanded its restricted export list. That resulted in company shares to dipping 3% in extended trading.As a result of the workforce reduction, Applied Materials expects to incur charges of approximately $160 million to $180 million, consisting primarily of severance and other one-time employment termination benefits to be paid in cash, the filing states.The company said the cuts are a way to position itself \"as a more competitive and productive organization.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Applied Materials lays off 4% of workforce",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108186599-1755269220052-gettyimages-1232980841-APPLIED_MATERIAL_EARNS.jpeg?v=1761258095&w=1920&h=1080"
      ],
      "datePublished": "2025-10-23T22:50:08.000Z",
      "dateModified": "2025-10-23T22:50:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump foe Letitia James blasts 'revenge' prosecution, trial set for Jan. 26",
    "url": "https://www.cnbc.com/2025/10/24/letitia-james-mortgage-fraud-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108213259-1761312422692-108213259-1760645545792-gettyimages-2241471012-mms28055_w75u4otd.jpg?v=1761312446&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-24T16:12:33.000Z",
    "description": "New York Attorney General Letitia James speaks to reporters, after she attended a hearing and pleaded not guilty to charges that she defrauded her mor",
    "body": "New York Attorney General Letitia James speaks to reporters, after she attended a hearing and pleaded not guilty to charges that she defrauded her mortgage lender, outside the U.S. District Court for the Eastern District of Virginia, in Norfolk, Virginia, U.S., October 24, 2025. Jonathan Ernst | ReutersNew York Attorney General Letitia James on Friday pleaded not guilty to federal charges in a fraud case tied to mortgage records she signed in 2020.James is a longtime antagonist of President Donald Trump, who publicly urged Attorney General Pam Bondi to target her weeks before she was indicted.James' case in U.S. District Court in Norfolk, Virginia, is set to head to trial on Jan. 26, 2026.\"This is not about me. This is about all of us,\" James said after leaving court, \"and about a justice system which has been weaponized\" and \"used as a tool of revenge.\"\"So there's no fear today,\" she said. \"I believe that justice will rain down like water and righteousness like a mighty stream.\"James, at her arraignment, pleaded not guilty to one count each of bank fraud and making false statements to a financial institution.James has decried the charges as \"baseless,\" calling her indictment \"nothing more than a continuation of the president's desperate weaponization of our justice system.\"Interim U.S. Attorney for the Eastern District of Virginia Lindsey Halligan, in a highly unusual move, personally presented evidence about James to a grand jury before it issued the indictment. U.S. attorneys normally have assistant U.S. attorneys present evidence to grand juries.After Friday's arraignment, James' legal team filed a motion asking Judge Jamar Walker to dismiss the indictment on the grounds that Halligan \"had no authority to bring the charges in this case\" because she was invalidly appointed.Read more CNBC politics coverageTrump pardons convicted Binance founder Changpeng ZhaoChauncey Billups, others arrested in FBI probe linking NBA to Mafia gambling ringTrump to demolish entire East Wing of White House for ballroom: 'Plans changed'Government shutdown becomes 2nd longest in U.S. historyTrump special counsel nominee Paul Ingrassia withdraws after racist texts flapTrump says U.S. cattle ranchers 'don't understand' tariffs, must lower pricesOil jumps 3% after Trump administration sanctions big Russian oil companiesRussia was smug about Trump-Putin talks. Now they're on hold, Moscow's anxiousTrump dined with Murdoch at White House amid $10B Epstein letter lawsuitTrump wants $230 million from DOJ for investigating him: NYTWhite House calls Trump ballroom demolition work furor 'manufactured outrage'Trump Jan. 6 pardon recipient accused of threatening to kill Dem leader JeffriesTrump idea to buy beef from Argentina will hurt U.S. ranchers, GOP Sen. warnsTrump can deploy National Guard in Portland, appeals court panel saysU.S. and Australia sign critical minerals agreement with $8.5B project pipelineComey seeks case dismissal, says Trump-picked prosecutor appointed unlawfullyWhite House economic advisor Hassett says shutdown could end this weekX lawsuit vs. Apple and OpenAI stays in Fort Worth, Texas; judge suggests they move there'No Kings' protests against Trump bring a street party vibe to cities nationwideTrump commutes prison sentence of ex-GOP Rep. George SantosU.S. Chamber of Commerce sues Trump administration over $100,000 H-1B visa feesBill to fund military during government shutdown fails in Senate procedural voteFormer Trump national security advisor John Bolton indicted by grand juryGovernment shutdown: Senate bill fails for 10th time, Kelly tells Trump to get involvedIllinois Gov. JB Pritzker won $1.4 million gambling last year, tax filings showTrump says he and Putin will meet in Hungary to discuss war in UkraineFeds to seek indictment against former Trump advisor John Bolton on Thursday: ReportsTrump says he might attend Supreme Court tariff case arguments next monthJudge blocks Trump from firing federal workers during government shutdown for nowDOJ seizes $15 billion in bitcoin from 'pig butchering' scam based in CambodiaBessent says market weakness won't deter U.S. from taking strong action against ChinaTrump threatens China with cooking oil embargo over soybean snubTrump shutdown job cuts affect bipartisan prioritiesTrump trade rep says 100% tariff on China depends on Beijing's next moveQatar Air Force facility to be built at USAF base in Idaho, Defense Secretary Hegseth saysTrump nominee Paul Ingrassia reportedly accused of sexual harassmentHalligan was installed as U.S. Attorney after her predecessor, Erik Siebert, resigned under pressure from Trump.Siebert had balked at seeking indictments against James and former FBI Director James Comey, another Trump foe who was indicted after Halligan presented evidence to another grand jury.Halligan previously served as one of Trump's personal lawyers.\"Forcing a political opponent to show up in court to defend baseless criminal charges is like something out of [President Vladimir] Putin's Russia — not the America we know and love,\" Democracy Defenders Fund executive chair Norm Eisen said in a statement Friday.\"Donald Trump is destroying the rule of law just like he's tearing down the East Wing White House. All Americans should speak out about the unjust prosecution of Letitia James,\" said Eisen, a vocal Trump critic who has been repeatedly criticized by the president.The indictment against James alleges that she made false representations in documents she signed when purchasing a three-bedroom home in Norfolk that was financed with a roughly $109,600 mortgage loan.A rider to that loan required James to occupy the home as a second residence and not rent it out. But the home \"was instead used as a rental investment property\" for a family of three, the indictment alleges.James' total purported \"ill-gotten gains\" were only about $19,000 over the life of the loan she received, according to the indictment. Most of that money was from savings James allegedly received from having a lower interest rate on the mortgage than what she would have paid if the home was classified as a rental investment property, the indictment says.Prosecutors who investigated James, in a September memo, said they found evidence that appeared to undercut the indictment's allegations, MSNBC's Ken Dilanian reported Friday.That evidence reportedly includes the amount that James stood to receive financially from her alleged mortgage misrepresentation: Only about $800 in the year that she bought the home. The prosecutors also questioned if the case could be proven beyond a reasonable doubt. ABC News first reported the memo on Thursday, citing sources.This is developing news. Please check back for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump foe Letitia James blasts 'revenge' prosecution, trial set for Jan. 26",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108213259-1761312422692-108213259-1760645545792-gettyimages-2241471012-mms28055_w75u4otd.jpg?v=1761312446&w=1920&h=1080"
      ],
      "datePublished": "2025-10-24T16:12:33.000Z",
      "dateModified": "2025-10-24T16:12:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taco Bell tries to woo younger customers with Live Más Café's flashy beverages",
    "url": "https://www.cnbc.com/2025/10/24/taco-bell-live-mas-cafe.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108215496-1761155939539-UCI_LiveMasCafe1.jpg?v=1761252509&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-24T16:15:37.000Z",
    "description": "watch nowIRVINE, Calif. — Taco Bell is going all in on beverages, starting with its Live Más Café concept.The Yum Brands chain unveiled the drink-focu",
    "body": "watch nowIRVINE, Calif. — Taco Bell is going all in on beverages, starting with its Live Más Café concept.The Yum Brands chain unveiled the drink-focused store format last December, with the first location in Chula Vista, California. Ten months later came the second location, near the University of California, Irvine campus. By the end of the year, Taco Bell is projecting that it will have 30 Live Más Cafés in its portfolio, across Southern California, Dallas and Houston.Unlike McDonald's now-defunct CosMc's spinoff, which had its own standalone locations, the Live Más Café lives inside existing Taco Bell restaurants. Customers order at kiosks and can watch the \"bellristas\" assemble their drinks from behind the designated counter, which takes prime real estate in the store. The drink menu includes a range of beverage options, from blended coffees to lemonade-based drinks.The beverage-focused concept is supposed to help the Mexican-inspired chain reach its goal of generating a $5 billion drink business by 2030. Taco Bell first disclosed that target in March at an investor day, where the chain shared more about its plans to keep growing as it fuels Yum's operating profit growth.So far this year, Taco Bell has sold more than 600 million beverages, up 16% from the year-ago period, according to the company. More than 60% of the chain's orders this year have included a drink, Taco Bell said.\"I think drinks are big right now because I think people are really craving unique, interesting flavors in their beverages, and we hear that all the time from our consumers,\" said Liz Matthews, global chief food innovation officer for Taco Bell.Center stageTaco Bell's Live Más Café.Courtesy: Taco BellStepping inside the Irvine location, the Live Más Café beverage station is the clear star.Most of the self-order kiosks are positioned in front of the station's long counter. Customers have a free view of the \"bellristas\" making their specialty drinks, unlike the restaurant's other employees who assemble Crunchwrap Supremes and Chalupas hidden from sight.Digital menu boards across the restaurant highlight the beverage offerings. The drink menu spans four distinct categories: churro chillers, specialty coffees, refrescas and \"bellrista favorites.\"The churro chillers are creamy and cold milkshakes topped with churro chunks. The specialty coffees come either hot, iced or blended as a \"chiller.\" Brightly colored refrescas use either lemonade, green tea or Rockstar energy drinks as the base for their fruity flavors, like strawberry passionfruit or mango peach. And the \"bellrista favorites\" include seasonal options, like the autumnal caramel apple empanada churro chiller, which incorporates blended chunks of Taco Bell's apple empanada.When crafting the menu, Matthews and her team tried to stick to the chain's Mexican-inspired roots, but she said Taco Bell will always have a \"playful spirit.\"And while the Live Más Café offers plenty of options, with a variety of flavors, Taco Bell kept the options to customize minimal.\"What we found when we talked to consumers, they actually really want us to curate their drink for them,\" Matthews said.To date, the Irvine location's top-selling drinks are the Mexican Chocolate Churro Chiller, the Dirty Mountain Dew Baja Blast Dream Soda and the Mango Peach Agua Refresca. Six of the top 10 bestselling drinks at the location are chillers. That's a reversal from the initial test location in Chula Vista, which has seen similar demand for every drink category, according to Matthews.Since opening day, the Irvine location has been selling more than 900 drinks per day, according to Taco Bell. More than a third of orders include an item from the Live Más Café menu.Meanwhile, the Chula Vista location, which exceeded its initial sales forecast by four times, is selling more than 750 beverages a day, nearly a year since its opening, the company said. A quarter of all transactions include a Live Más Café beverage, according to Taco Bell.\"Given what we're seeing right now from the business results, the payback looks really attractive and in line with what our franchisees would expect for something big, but we've got a lot more to learn,\" said Taylor Montgomery, global chief brand officer of Taco Bell.'Little treat'This year, the hottest trend in fast food hasn't been a chicken sandwich or plant-based burgers. Instead, beverages of all consistencies, colors and nutritional have taken the spotlight.For example, Shake Shack is selling lemonade with mini raspberry popping boba, inspired by the success of bubble tea. Panera Bread is testing frescas and energy refreshers in select bakery-cafés. Chick-fil-A is planning to open Daybright, a beverage-focused restaurant with specialty coffees, smoothies and cold-pressed juices in Hiram, Georgia, later this year. And although McDonald's this summer wound down its spin-off called CosMc's that focused on drinks and snacks, it also tested new coffee drinks, refreshers and flavored sodas at more than 500 U.S. restaurants.The number of beverages sold by the top 500 chains has climbed more than 9% in the last year, according to Technomic. The swell of beverage innovation follows the speedy expansion of a number of a specialty drink chains, from upstart 7 Brew Coffee to dirty-soda inventor Swig.\"[Quick-service chains] have seen that there's a big opportunity with an entire generation and how they're interested in that 'little treat' culture,\" said Claire Conaghan, trendologist at Datassential, which tracks menu trends. \"There's options to kind of go beyond their focus area of core meal and really lean into that snacking moment.\"Generation Z and millennials are driving the trend, according to Varchasvi Singh, a foodservice analyst for Mintel. Younger generations enjoy customizing their food and beverage orders.\"Among younger consumers, in particular, we see that fast-food dining is just as much about experimentation and novelty as it is about indulgence,\" Singh said. \"They're a lot more open to trying premium menu items and personalizing their orders, whereas older generations, who have associated fast food with extreme affordability for a long time, are a little bit more critical of how expensive it has become for them.\"For Taco Bell, turning to beverages and creating the Live Más Café is part of its broader plan to appeal to younger consumers, who are projected to see their spending power increase rapidly in just a few years.\"Over the past five years, we've really, really been transitioning and thinking about the brand and how to position it for Gen Z, and so Café was really born from that,\" Montgomery said. \"I think it's something like 60% of Gen Z consumers come to a restaurant or [quick-service restaurant] for an afternoon treat.\"Rather than creating a standalone Live Más Café, Taco Bell chose to put the sub-brand inside existing restaurants in part because of \"humility,\" according to Montgomery.\"Today, we're not known to be a beverage destination — yet,\" he told CNBC.Live Más Café can also help Taco Bell more broadly.\"It also acts a little bit as a test market where they can get some more real-time data. Which combos do people do the most?\" Conaghan said. \"Which customizations matter the most? Do we need every type of alternative milk or maybe just these one or two? Do we need all 15 flavors of whatever energy refresher?\"That's already started happening. Taco Bell's agua frescas, which began as a Live Más Café menu line, have since been launched nationwide.\"They're one of our top-selling items, and we didn't wait to scale the Café,\" Montgomery said. \"We pushed those in all the restaurants, and we've seen success there.\"Plus, the coffee options on the café's menu are part of Taco Bell's plan to make a bigger push into breakfast. The chain started serving the morning meal more than a decade ago but told franchisees last year that they could opt out serving breakfast; for some fast-food operators, opening early isn't profitable, plus there's the added headache of finding staff willing to work the morning shift.Taco Bell has already had some success with another sub-brand. Its Cantina format, typically found in cities, features a custom menu, alcoholic beverages and seating meant to encourage customers to linger. Since opening the first location in Chicago a decade ago, Taco Bell Cantina has grown to dozens of restaurants.Broadly, even as inflation-weary consumers pull back their spending, Taco Bell's focus on new menu items has lifted its sales; earlier this year, the company announced plans to double innovation in 2025. Taco Bell's prices have climbed 75.5% since 2019, according to Technomic's Ignite Menu. Still, customers keep coming back.In recent years, Taco Bell has been the gem of Yum's portfolio, typically outperforming both Wall Street's expectations and its sister chains, KFC and Pizza Hut. Executives have named the chain as one of the company's primary growth engines. In the second quarter, while many fast-food rivals reported shrinking sales, Taco Bell reported same-store sales growth of 4%.\"From a portfolio standpoint, we represent a pretty significant amount of Yum's operating profit, but we learn a lot from other brands, too,\" Montgomery said.Yum is expected to report its third-quarter earnings before the bell on Nov 4.Watch the video to learn more about why Taco Bell is betting on drinks.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taco Bell tries to woo younger customers with Live Más Café's flashy beverages",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108215496-1761155939539-UCI_LiveMasCafe1.jpg?v=1761252509&w=1920&h=1080"
      ],
      "datePublished": "2025-10-24T16:15:37.000Z",
      "dateModified": "2025-10-24T16:15:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Inflation rate hit 3.0% in September, lower than expected, long-awaited CPI report shows",
    "url": "https://www.cnbc.com/2025/10/24/cpi-inflation-september-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108215298-1761140241031-gettyimages-2242203776-US_CPI.jpeg?v=1761140349&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-24T16:06:43.000Z",
    "description": "watch nowPrices that people pay for a variety of goods and services rose less than expected in September, according to a Bureau of Labor Statistics re",
    "body": "watch nowPrices that people pay for a variety of goods and services rose less than expected in September, according to a Bureau of Labor Statistics report Friday that keeps the door wide open for another interest rate cut next week.The consumer price index showed a 0.3% increase on the month, putting the annual inflation rate at 3%. Economists surveyed by Dow Jones had been looking for respective readings of 0.4% and 3.1%. The annual rate reflected a 0.1 percentage point uptick from August.Excluding food and energy, core CPI showed a 0.2% monthly gain and an annual rate also at 3%, compared to respective estimates of 0.3% and 3.1%. Core CPI on a monthly basis had posted 0.3% gains in both July and August.The CPI reading is the only official economic data allowed to be released during the government shutdown.\"Like an oasis slaking the thirst of a weary desert traveler, today's CPI number offered investors the first tidbit of information from the barren wasteland of government data that has existed since the shutdown started Oct 1,\" wrote John Kerschner, global head of securitized products at Janus Henderson. \"Investors were not disappointed. Inflation came in softer than expected, leading to a tepid bond market rally, and ensuring that the Fed will cut rates at next week's Open Market Committee meeting.\"A 4.1% jump in gasoline prices was the largest contributor to a report that otherwise showed inflation pressures fairly muted. Food prices saw a 0.2% increase. Commodity prices overall rose 0.5%. On an annual basis, energy was up 2.8% and food rose 3.1%.Within the food index, prices for meat, poultry, fish and eggs surged 5.2% in the past year, while nonalcoholic beverages increased 5.3%. In energy, while electricity (up 5.1%) and natural gas (11.7%) prices pushed higher over the past year, gasoline actually fell 0.5% during the period.Shelter costs, which comprise about one-third of the weighting in the CPI, rose just 0.2% and were up 3.6% from a year ago. Services excluding shelter costs also were 0.2% higher.New vehicles saw a 0.8% increase, but used cars and truck prices fell 0.4%.Stock market futures added to gains following the release, while Treasury yields were slightly negative.\"Inflation might not be slowing but it's not surprising to the upside anymore,\" said David Russell, global head of market strategy at TradeStation.The report provides a glimpse into the state of the U.S. economy at a time when all other data releases have been suspended. There were only limited impacts from President Donald Trump's tariffs, though they likely have not made their way fully through the economy yet.watch nowCore goods prices saw just a 0.2% gain on the month. Data within the CPI report, combined with the Customs revenue generated by tariffs, indicate a \"realized\" tariff rate of just 10%, according to James Knightley, chief international economist at ING.There are signs of \"a strong substitution effect already coming through – US companies switching to lower tariff countries for their product sourcing with the composition of imports shifting,\" Knightly wrote.\"The result is companies are better able to absorb these more modest than feared cost increases and there has been less impact on inflation than predicted so far,\" he said. \"In time we expect the realized tariff rate to rise and goods prices to be more heavily impacted, but we continue to argue that tariffs will be a one-off step change in prices rather than something that will lead to more persistent inflation.\"Final report before the FedThe BLS released the data specifically because the Social Security Administration uses it as a benchmark for cost-of living adjustments in benefit checks. Otherwise, the federal government has suspended all data compilation and releases until the fiscal impasse is settled in Washington, D.C. CPI originally was scheduled for release Oct. 15.In addition to providing a COLA guide, the CPI release is the final significant data point the Federal Reserve will get before it makes its interest rate decision next week. The Fed has a 2% inflation goal. The headline measure was last below that level in February 2021.A shopper looks at a sales advertisement at a grocery store in West Milton, Ohio, US, on Tuesday, Oct. 21, 2025. Kyle Grillot | Bloomberg | Getty Images\"This report will clearly keep the Fed on track to cut rates,\" said Art Hogan, chief market strategist at B. Riley Wealth. \"The Fed has been clear that they are more focused on the softening labor data and will continue to defend their full employment mandate, even with core CPI well above their 2% target.\"Markets are pricing in a near-certainty that the central bank lowers its benchmark overnight borrowing rate by a quarter percentage point from its current target range of 4%-4.25%. Traders also are anticipating another cut in December.However, the path after that is much less clear.Worries persist that Trump's tariffs could cause another round of painful inflation. At the same time, Fed policymakers worry that a slump in hiring this year could spread, though layoffs remain low.Tariff-sensitive apparel prices saw a 0.7% increase in September, while durable goods moved 0.3% higher.Chair Jerome Powell and his colleagues have expressed generally cautious tones about the pace of rate cuts as they weigh the threat of inflation against weakness in the labor market. For his part, Trump has insisted that inflation is no longer a problem and the Fed should be cutting aggressively.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inflation rate hit 3.0% in September, lower than expected, long-awaited CPI report shows",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108215298-1761140241031-gettyimages-2242203776-US_CPI.jpeg?v=1761140349&w=1920&h=1080"
      ],
      "datePublished": "2025-10-24T16:06:43.000Z",
      "dateModified": "2025-10-24T16:06:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Jana's partnership with Travis Kelce could tip the balance and revive Six Flags' business",
    "url": "https://www.cnbc.com/2025/10/24/why-janas-partnership-with-travis-kelce-could-tip-the-balance-and-revive-six-flags-business.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108191499-1756319167092-gettyimages-2191710033-a9308033_1p3wirjh.jpeg?v=1761321664&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-24T16:01:26.000Z",
    "description": "Taylor Swift (L) and Travis Kelce are seen in the Meatpacking District on Dec. 28, 2024 in New York City. TheStewartofNY | GC Images | Getty ImagesCom",
    "body": "Taylor Swift (L) and Travis Kelce are seen in the Meatpacking District on Dec. 28, 2024 in New York City. TheStewartofNY | GC Images | Getty ImagesCompany: Six Flags Entertainment (FUN)Business: Six Flags Entertainment is a regional amusement-resort operator with approximately 27 amusement parks, 15 water parks and nine resort properties across 17 states in the United States, Canada and Mexico. The company provides memorable experiences to millions of guests every year with coasters, themed rides, thrilling water parks, resorts and a portfolio of intellectual property such as Looney Tunes, DC Comics and Peanuts. The company's parks include Hurricane Harbor Phoenix, California's Great America, Knott's Berry Farm, Knott's Soak City Waterpark, Six Flags Magic Mountain, Six Flags Discovery Kingdom, Six Flags Over Georgia, Six Flags White Water, Cedar Point Shores Waterpark, Six Flags Great America, Six Flags Fiesta Texas, Hurricane Harbor Splashtown, Dorney Park & Wildwater Kingdom and others.Stock Market Value: $2.60 billion ($25.63 per share) Stock Chart IconStock chart iconSix Flags Entertainment stock year to dateActivist: Jana PartnersOwnership: ~9%Average Cost: n/a Activist Commentary: Jana is a very experienced activist investor founded in 2001 by Barry Rosenstein. They made their name taking deeply researched activist positions with well-conceived plans for long-term value. Rosenstein called his activist strategy \"V cubed.\" The three \"Vs\" were: (i) Value: buying at the right price; (ii) Votes: knowing whether you have the votes before commencing a proxy fight; and (iii) Variety of ways to win: having more than one strategy to enhance value and exit an investment. Since 2008, they have gradually shifted that strategy to one which we characterize as the three \"Ss\" (i) Stock price – buying at the right price; (ii) Strategic activism – sale of company or spinoff of a business; and (iii) Star advisors/nominees – aligning with top industry executives to advise them and take board seats if necessary.What's happeningOn Oct. 21, Jana announced that it had partnered with Travis Kelce, Glenn Murphy and Dave Habiger in an investment in Six Flags Entertainment and plans to engage with the company's board and management regarding opportunities to enhance shareholder value and improve the guest experience.Behind the scenesSix Flags Entertainment is a regional amusement-resort operator with approximately 27 amusement parks, 15 water parks and nine resort properties across 17 states in the United States, Canada and Mexico. In November 2023, Six Flags announced that it would be merging with Cedar Fair. While this news received backlash from some investors, most notably from activist Land & Buildings, the merger was completed in July 2024. At the time, this merger seemed like an opportunity to combine Six Flags' regional dominance in amusement parks, strong licensing arrangements (such as its lifetime IP agreement with Warner Brothers) and modern tech and pricing backbone with Cedar Fair's operational discipline, best-in-class park experience and high customer satisfaction rate to generate synergies and elevate Six Flags' asset value.However, this arrangement has not really gone as planned. In the second quarter, Six Flags faced severe weather conditions during their typical peak May to June season, which resulted in substantial EBITDA and attendance misses. Moreover, the company entered this period highly levered from the merger, and these misses only amplified the company's balance sheet problems in the eyes of investors. This sent Six Flags' share price down over 58% from the completion of the Cedar Fair merger to the day prior to Jana's announcement.Stock action like this on otherwise strong businesses that is due to an idiosyncratic event like weather that is not likely to recur generally gets the attention of good value investors. However, Six Flags does have other issues, namely poor operational execution, integrating the Cedar Fair merger and identifying a new CEO, as CEO Richard Zimmerman has announced he is stepping down from his role at the end of 2025.Jana Partners is now the fifth activist investor in this stock. Other include Sachem Head (4.82%), H Partners (4.59%), Dendur (4.38%) and Land & Buildings (n/a). All of those other activists, except L&B, have received board representation.Jana, as it often does, is coming in with an All-Star team: Glenn Murphy, executive chairman of Petco and former chairman and CEO of the Gap; Dave Habiger, chairman of Reddit; and NFL Superstar Travis Kelce. The investment group holds a roughly 9% economic interest and plans to engage Six Flags' board and management team to explore ways to enhance shareholder value and improve the guest experience.Much of Jana's campaign echoes the qualms already raised by the other activists in the stock, including the company's potential to unlock value by reinvigorating the business as a standalone company with a new CEO and/or monetizing the real estate, or even selling the entire company. Regardless of which plan is pursued, the company must immediately start down the road of fixing its operational issues.Operationally, Six Flags has forfeited a substantial opportunity by failing to integrate its consumer-facing technology. More than a year post-merger, Six Flags still operates over 10 different apps, and even basic transactions like purchasing a season pass on the website have been unreliable, so modernizing and streamlining this technology could go a long way.The company also needs to reexamine its operating strategy during inclement weather and adopt a more disciplined capex framework. For example, despite this poor weather during the second quarter, Six Flags still kept its parks open on more days during this quarter than the same period last year, resulting in significant and unnecessary losses.Jana also believes Six Flags has the opportunity to leverage its existing real estate to implement year-round and inclement weatherproof experiences, such as indoor skydiving and trampoline parks.Kelce cool factorNext, the company needs to reinvigorate its advertising and marketing. Six Flags is one of the most recognizable entertainment brands, but its advertising has been stale, abandoning regional marketing efforts while also missing the opportunity to leverage its national scale. While the new CEO will likely have good ideas in this area, having access to Travis Kelce, one of the most popular and liked celebrities in the world across all demographics is a valuable potential marketing asset. (For example, look what Sydney Sweeney has already done for American Eagle with just one ad.)Kelce has not signed on as a brand ambassador or in any capacity other than as a shareholder, but he is a true fan of amusement parks like Six Flags, has already added advertising value to the company just by talking about it on his podcast and there is always a potential to do more with him either informally or through some sort of an agreement. Brand revitalization catalyzed by Kelce's active involvement provides a meaningful opportunity to lift attendance and engagement at Six Flags.JANA's partnership with Mr. Kelce is unprecedented in two respects: 1) it pairs an activist and a world-famous celebrity that has personally invested in the company and is using their star power to boost the company's brand from the outside in a highly authentic manner, and 2) it brings a perfectly tailored solution to rejuvenate the company's branding and marketing, reaffirming its cool factor and resolving any concern about Six Flag's brand relevance that has weighed on the company's multiple.Finally, and probably most importantly, the ongoing CEO process presents a golden opportunity to recruit a world class operator capable of executing upon these initiatives. In the world of shareholder activism, there are not many better opportunities for value creation than the activist having a say in identifying a new CEO for a great but struggling business.With multiple activists participating in this process, we would expect the new CEO to be a first-rate operator with strong views on creating value for shareholders. Moreover, a reconstituted board over the past several years and the addition of Kelce as a potential formal or informal brand ambassador may increase the quality of the candidate pool.That all being said, a CEO vacancy is also often the perfect time to explore strategic alternatives, and Jana is still urging the company to evaluate a potential sale of underperforming parks and/or the entire company.Should Six Flags position itself for a sale, there would likely be both private equity and strategic interest. Apollo, for example, attempted to acquire Cedar Fair back in 2010 before their merger fell through due to lack of investor support, and Blackstone already owns Great Wolf Lodge – a complementary asset.In terms of strategics, the growing media and entertainment trend of integrating physical park assets into cross-platform media ecosystems makes the industry a logical candidate. Media titans like Disney and Comcast have already provided the blueprint on how to leverage amusement parks to promote intellectual property.Paramount, the third peer to Disney and Comcast, is the only one without an amusement park after interestingly selling five Paramount Parks to Cedar Fair in 2006. This becomes even more intriguing now that Paramount has made a $57 billion bid to acquire Warner Bros Discovery. Six Flags has a licensing agreement with Warner Brothers and at a current $2.6 billion market cap, would be a logical add-on to its acquisition by Paramount, or any strategic investor for that matter. (Netflix has also shown interest).Jana is a highly experienced activist with a track record for showing up with operators tailor-made for a company's specific problems, and that's exactly what they have done here. The perfect brand ambassador and two corporate legends with almost unparalleled consumer and technology-based operational turnaround expertise may be exactly the medicine required here. With that in mind, we would normally argue that this is too crowded of a shareholder base for Jana to gain board representation, as there are already six directors on the board who were appointed pursuant to an activist settlement. However, we believe that the activists with representatives already on the board are like-minded to Jana and would welcome directors of this quality to help pursue a path they all seem to agree on.Ken Squire is the founder and president of 13D Monitor, an institutional research service on shareholder activism, and the founder and portfolio manager of the 13D Activist Fund, a mutual fund that invests in a portfolio of activist investments.Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast's planned spinoff of Versant.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Jana's partnership with Travis Kelce could tip the balance and revive Six Flags' business",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108191499-1756319167092-gettyimages-2191710033-a9308033_1p3wirjh.jpeg?v=1761321664&w=1920&h=1080"
      ],
      "datePublished": "2025-10-24T16:01:26.000Z",
      "dateModified": "2025-10-24T16:01:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]