[
  {
    "title": "Rare earth stocks rally in premarket, extending gains amid renewed U.S.-China trade spat",
    "url": "https://www.cnbc.com/2025/10/14/rare-earth-stocks-rally-amid-renewed-us-china-trade-dispute-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108211629-1760431440350-gettyimages-2240325072-dji_20251010120435_0741_d_3hc8dueh.jpeg?v=1760431475&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T12:26:08.000Z",
    "description": "In an aerial view, a container ship arrives at the Port of Oakland on October 10, 2025 in Oakland, California. U.S. President Donald Trump is threaten",
    "body": "In an aerial view, a container ship arrives at the Port of Oakland on October 10, 2025 in Oakland, California. U.S. President Donald Trump is threatening to impose a massive increase of tariffs on Chinese imports in response to China's announcement of new export controls on rare earths. China controls an estimated 70% of the global supply of rare earths minerals.Justin Sullivan | Getty Images News | Getty ImagesShares of U.S. rare earth miners rallied in premarket trade on Tuesday, extending sharp gains from the previous session after U.S. President Donald Trump threatened China with 100% tariffs over Beijing's strict export controls on critical minerals.Critical Metals jumped more than 36% in premarket, USA Rare Earth rallied 11% and MP Materials rose 8%. Shares of Energy Fuels were last seen up 14%, while NioCorp Developments stood 15% higher.The moves come as investors keep a close eye on the potential for a renewed trade spat between the world's two largest economies.Trump on Friday announced the U.S. would impose new tariffs of 100% on imports from China starting from Nov. 1, adding that the White House would also slap export controls on \"any and all critical software.\"The U.S. president appeared to water down his rhetoric on Sunday, however, saying the situation with Beijing will \"be fine.\"China on Thursday announced a new framework for restricting rare earth exports in a move that was seen as a stark warning to the West — and a reflection of the deepening mistrust between Beijing and Washington.U.S. rare earth stocks posted bumper gains on Monday. Critical Metals closed the session up more than 55%, while MP Materials rose 21% and USA Rare Earth popped 18%.China is the undisputed leader of the critical minerals supply chain, producing nearly 70% of the world's supply of rare earths from mines and processing almost 90%, which means it is importing these materials from other countries and refining them.Western officials have repeatedly flagged Beijing's supply chain dominance as a strategic challenge, particularly given that critical mineral demand is expected to grow exponentially, as the clean energy transition picks up pace.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rare earth stocks rally in premarket, extending gains amid renewed U.S.-China trade spat",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108211629-1760431440350-gettyimages-2240325072-dji_20251010120435_0741_d_3hc8dueh.jpeg?v=1760431475&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T12:26:08.000Z",
      "dateModified": "2025-10-14T12:26:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NASA unit JPL to lay off about 550 workers, citing restructure",
    "url": "https://www.cnbc.com/2025/10/13/nasa-jpl-layoffs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108211447-1760382166893-gettyimages-1986209037-AFP_34HT3KB.jpeg?v=1760382260&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T20:02:01.000Z",
    "description": "The entrance to NASA's Jet Propulsion Laboratory in Pasadena, California, is seen on February 7, 2024. Robyn Beck | AFP | Getty ImagesThe Jet Propulsi",
    "body": "The entrance to NASA's Jet Propulsion Laboratory in Pasadena, California, is seen on February 7, 2024. Robyn Beck | AFP | Getty ImagesThe Jet Propulsion Laboratory unit of NASA said Monday that it will lay off about 550 employees — 11% of JPL's workforce — as part of a restructuring.The job cuts \"are not related to the current government shutdown,\" JPL Director Dave Gallagher said in a message to the unit that was posted on the lab's website.JPL is a research and development lab funded by NASA — the federal space agency — and managed by the California Institute of Technology.\"While not easy, I believe that taking these actions now will help the Lab transform at the scale and pace necessary to help achieve humanity's boldest ambitions in space,\" Gallagher wrote in a separate mekor to JPL employees and contractors.Gallagher, in the public announcement, noted that the reorganization of JPL began in July, and \"over the past few months, we have communicated openly with employees about the challenges and hard choices ahead.\"\"This week's action, while not easy, is essential to securing JPL's future by creating a leaner infrastructure, focusing on our core technical capabilities, maintaining fiscal discipline, and positioning us to compete in the evolving space ecosystem — all while continuing to deliver on our vital work for NASA and the nation,\" Gallagher wrote.Gallagher said that JPL employees will be notified of their status on Tuesday, and the \"new Lab structure ... will become effective Wednesday.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NASA unit JPL to lay off about 550 workers, citing restructure",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108211447-1760382166893-gettyimages-1986209037-AFP_34HT3KB.jpeg?v=1760382260&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T20:02:01.000Z",
      "dateModified": "2025-10-13T20:02:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China targets five U.S. subsidiaries of South Korea's Hanwha Ocean, sending shares down 8%",
    "url": "https://www.cnbc.com/2025/10/14/china-sanctions-five-us-subsidiaries-of-south-koreas-hanwha-ocean-over-their-ties-with-washington.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108211616-1760426151042-gettyimages-2236481664-dsc_7708_bhri6nhq.jpeg?v=1760426171&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T07:16:51.000Z",
    "description": "A large screen displays images of Combat Unmanned Surface Vessels (USV) at the Hanwha exhibition stand during the Security Equipment International (DS",
    "body": "A large screen displays images of Combat Unmanned Surface Vessels (USV) at the Hanwha exhibition stand during the Security Equipment International (DSEI) at London Excel on Sept.10, 2025 in London, England. John Keeble | Getty Images News | Getty ImagesShares of South Korean shipbuilder Hanwha Ocean fell more than 8% Tuesday after China sanctioned five of its U.S. subsidiaries, escalating tensions with Washington over their alleged involvement in a probe into the Chinese shipping industry.The sanctioned subsidiaries are Hanwha Shipping LLC, Hanwha Philly Shipyard Inc., Hanwha Ocean USA International LLC, Hanwha Shipping Holdings LLC, and HS USA Holdings Corp, according to a statement from China's Commerce Ministry.\"Hanwha's subsidiaries in the U.S. have assisted and supported the U.S. government's probes and measures against Chinese maritime, logistics and shipbuilding sectors. China is strongly dissatisfied and resolutely opposes it,\" a spokesperson at Mofcom said in a separate statement, translated by CNBC.The order, effective immediately, will prohibit Chinese organizations and individuals from doing business with the sanctioned companies, the ministry said, adding that the move was intended to safeguard China's sovereignty and security.Hanwha Ocean did not immediately respond to CNBC's request for comments.Earlier Tuesday, Beijing confirmed it had begun collecting the additional port fees on U.S.-linked vessels while clarifying that Chinese-built ships would be exempted from the charges.The move followed the U.S. decision to impose steep fees on Chinese ships docking at American ports starting Tuesday at 12:01 a.m. EDT. China retaliated with a similar charge of 400 yuan ($56) per net ton on American vessels, starting on the same day. Container vessels can range from 50,000 to 220,000 tons.Beijing has also unveiled a new framework for restricting rare earths exports and expanded its blacklist of U.S. companies. In response, U.S. President Donald Trump threatened to impose 100% more tariffs on Chinese imports, prompting Beijing to assert its rare earths restrictions as a \"legitimate\" measure.In a separate statement, China's Ministry of Transport said it had launched an investigation into the impact of Washington's Section 301 probe on Chinese shipping and shipbuilding industries.The ministry said the inquiry will also assess whether companies, organizations or individuals helped the U.S. in \"undertaking discriminatory restrictive behaviours\" against China's shipping supply chain.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China targets five U.S. subsidiaries of South Korea's Hanwha Ocean, sending shares down 8%",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108211616-1760426151042-gettyimages-2236481664-dsc_7708_bhri6nhq.jpeg?v=1760426171&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T07:16:51.000Z",
      "dateModified": "2025-10-14T07:16:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oracle Cloud to deploy 50,000 AMD AI chips, signaling new Nvidia competition ",
    "url": "https://www.cnbc.com/2025/10/14/oracle-cloud-to-deploy-50000-amd-ai-chips-as-alternative-to-nvidia.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108158703-1749756531719-Screenshot_2025-06-12_at_32333_PM.png?v=1750098597&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T12:06:16.000Z",
    "description": "AMD Chair and CEO Lisa Su looks on, on the day of a meeting of the White House Task Force on Artificial Intelligence (AI) Education in the East Room a",
    "body": "AMD Chair and CEO Lisa Su looks on, on the day of a meeting of the White House Task Force on Artificial Intelligence (AI) Education in the East Room at the White House in Washington, D.C., U.S., September 4, 2025. Brian Snyder | ReutersOracle Cloud Infrastructure on Tuesday announced that it will deploy 50,000 Advanced Micro Devices graphics processors starting in the second half of 2026.The move is the latest sign that cloud companies are increasingly offering AMD's GPUs as an alternative to Nvidia's market-leading GPUs for artificial intelligence.\"We feel like customers are going to take up AMD very, very well — especially in the inferencing space,\" Karan Batta, senior vice president of Oracle Cloud Infrastructure, told CNBC's Seema Mody.Oracle will use AMD's Instinct MI450 chips, which were announced earlier this year.They are AMD's first AI chips that can be assembled into a larger rack-sized system that enables 72 of the chips to work as one, which is needed to create and deploy the most advanced AI algorithms.OpenAI CEO Sam Altman appeared with AMD CEO Lisa Su at a company event in June to announce the product.\"I think AMD has done a really fantastic job, just like Nvidia, and I think both of them have their place,\" Batta said.He added that AMD's software stack is \"critical\" and that \"customers are going to take up AMD very, very well, in the inferencing space.\"Read more CNBC tech newsDutch government takes control of Chinese-owned chipmaker Nexperia in 'highly exceptional' moveXiaomi shares see biggest drop since April after fatal EV crash sparks safety concernsNavan sets price range for IPO, expects market cap of up to $6.5 billionWe tested OpenAI's Sora 2 video generator to find out why Hollywood is freaking outEarlier this month, OpenAI announced a deal with AMD for processors requiring six gigawatts of power over multiple years, with a 1-gigawatt rollout starting in 2026. As part of the deal, and if the deployment goes well, OpenAI may end up owning as many as 160 million shares of AMD, or about 10% of the company.In September, OpenAI entered into a five-year cloud deal with Oracle that could be worth as much as $300 billion.OpenAI has historically been closely linked with Nvidia, whose chips were used to develop ChatGPT. Nvidia's chips dominate the market for data center GPUs with over 90% market share. Nvidia also invested in OpenAI in September.But OpenAI leaders say that the company needs as much computing power as possible, which means it needs AI chips from multiple suppliers. OpenAI also has plans to design its own AI chips with Broadcom.Tuesday at Oracle AI World, founder and chairman Larry Ellison is set to take the stage and share his views on the latest OpenAI deal and what his company is doing to stay ahead of its main cloud competitors – Microsoft, Amazon and Google. \"Oracle has already shown it is willing to place big bets and go all in to meet the AI moment. The company must now prove that beyond capacity, it can capitalize on its massive underlying data and enterprise capabilities…to add meaningful value to the enterprise AI wave,\" said Daniel Newman, CEO of The Futurum Group, on the sidelines of Oracle's conference.Stock Chart IconStock chart iconOracle and AMD year-to-date stock chart.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oracle Cloud to deploy 50,000 AMD AI chips, signaling new Nvidia competition ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108158703-1749756531719-Screenshot_2025-06-12_at_32333_PM.png?v=1750098597&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T12:06:16.000Z",
      "dateModified": "2025-10-14T12:06:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Singapore warns of slower 2026 growth after third-quarter GDP beats expectations",
    "url": "https://www.cnbc.com/2025/10/14/singapore-gdp-expands-at-slowest-pace-in-two.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108211558-1760404057920-gettyimages-2208383472-AFP_39CQ4BA.jpeg?v=1760404068&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T01:47:09.000Z",
    "description": "This aerial view taken from a commercial flight shows cargo ships docked along the strait in Singapore on April 7, 2025.Mohd Rasfan | Afp | Getty Imag",
    "body": "This aerial view taken from a commercial flight shows cargo ships docked along the strait in Singapore on April 7, 2025.Mohd Rasfan | Afp | Getty ImagesSingapore's economy expanded faster than expected in the third quarter, even as the country's central bank warned that growth is likely to slow in 2026.Gross domestic product rose 2.9% year on year in the three months through September, the Ministry of Trade and Industry said Tuesday.That beat economists' forecasts for a 1.9% increase, though it marked a slowdown from a revised 4.5% expansion in the second quarter.On a seasonally adjusted, quarter-on-quarter basis, the economy expanded by 1.3%, easing slightly from 1.5% in the previous quarter.Manufacturing was the main drag on growth, flattening after a 5% expansion in the second quarter. The construction sector also softened, rising 3.1% year on year compared with 6.2% in the prior quarter.\"Growth was weighed down by output declines in the biomedical manufacturing and general manufacturing clusters, even as output in the other manufacturing clusters expanded,\" MTI said in a statement.Growth in the services sector slowed to 0.2% from 1.7%, dragged down by contractions in wholesale and retail trade, as well as transportation and storage.\"While this marks a slowdown from 4.5% y-o-y in Q2, partly due to high base effects from a year ago, it nonetheless reflects a resilient pace of growth amid global trade headwinds,\" Lloyd Chan, senior currency analyst at Mitsubishi UFJ Financial Group, wrote in a note after the data release.MAS decisionThe economic slowdown comes as Singapore's central bank left its policy settings unchanged, maintaining its stance from July.The Monetary Authority of Singapore said that GDP growth is expected to moderate as activity \"normalises\" in trade-related sectors.Global investment in artificial intelligence is expected to support Singapore's manufacturing sector, the central bank said, while construction and financial services should benefit from infrastructure spending and accommodative financial conditions.\"In 2026, GDP growth is projected to slow in line with external developments to a near-trend pace, such that the output gap narrows to around 0%,\" MAS said in a statement.Vishnu Varathan, managing director at Mizuho Securities, said that there were \"no surprises\" in the MAS' decision, despite significant declines in headline and core inflation in the run-up to this decision.Core inflation rose 0.3% in August, the slowest pace since February 2021, as services costs eased.Separately, the MAS said core inflation — which strips out prices of private transport and accommodation — is expected to ease in the near term, before rising gradually afterward.The central bank said that core inflation should average around 0.5% for 2025 and come in at between 0.5% and 1.5% in 2026.Varathan described the MAS decision as \"not a dovish pause,\" but a \"comfortable hold,\" adding that the bar for further easing remains much higher than simply disinflation risks.\"[Singapore dollar nominal effective exchange rate] slope flattening ... would require an adverse demand shock,\" he said.Exports from Singapore recorded an 11.3% decline in non-oil domestic exports in August, the sharpest drop since March 2024.Non-oil exports to Indonesia, the U.S. and China fell in August, but rose to the European Union, Taiwan and South Korea, government data showed.Singapore's exports to the United States dropped by 28.8% year on year in August, following a 42.8% fall in July.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Singapore warns of slower 2026 growth after third-quarter GDP beats expectations",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108211558-1760404057920-gettyimages-2208383472-AFP_39CQ4BA.jpeg?v=1760404068&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T01:47:09.000Z",
      "dateModified": "2025-10-14T01:47:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says the war is over, but the path to peace in the Middle East is fragile",
    "url": "https://www.cnbc.com/2025/10/14/trump-says-israel-hamas-war-is-over-but-the-road-to-peace-is-fragile.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108211322-17603709142025-10-13t155403z_1129974448_rc23bha5prun_rtrmadp_0_israel-palestinians-egypt-summit-britain.jpeg?v=1760370979&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T10:21:47.000Z",
    "description": "U.S. President Donald Trump gestures as he poses next to a sign before a family photo at a world leaders' summit on ending the Gaza war, amid a U.S.-b",
    "body": "U.S. President Donald Trump gestures as he poses next to a sign before a family photo at a world leaders' summit on ending the Gaza war, amid a U.S.-brokered prisoner-hostage swap and ceasefire deal between Israel and Hamas, in Sharm el-Sheikh, Egypt, Oct. 13, 2025. Suzanne Plunkett | ReutersU.S. President Donald Trump was in a bullish mood as he and other global leaders in Egypt signed on Monday the first phase of the Gaza ceasefire agreement, seen as a precursor to a possible peace deal between Hamas and Israel.\"This took 3,000 years to get to this point, can you believe it? And it's going to hold up too,\" Trump said confidently as he signed the deal in front of the world's media.\"We've achieved what everybody said was impossible — at long last, we have peace in the Middle East,\" Trump said later during a news conference, flanked by other leaders. \"Nobody thought we could ever get there, and now we're there,\" he added.U.S. President Donald Trump poses with the signed agreement at a world leaders' summit on ending the Gaza war, amid a U.S.-brokered prisoner-hostage swap and ceasefire deal between Israel and Hamas, in Sharm el-Sheikh, Egypt, Oct. 13, 2025. Suzanne Plunkett | ReutersWhile most agree that Trump deserves credit for helping to bring an immediate end to the devastating war between Israel and Hamas — which saw the return of Israeli hostages after two years in captivity and release of almost 2,000 Palestinian prisoners and detainees — achieving a long-lasting peace is a different matter.\"At the end of the day, getting to a ceasefire was very, very important. It was important not just for Gaza and Israel, but for the whole region which has been consumed by this conflict. But it's also the easy part,\" Rob Geist Pinfold, lecturer in International Security, at King's College London, told CNBC Tuesday.\"Both sides have shown some desire to come to the table and talk and reach some kind of a deal, but the real differences are on what comes 'the day after',\" Geist Pinfold noted.20-point peace plan problemsAnalysts note that detail is scant in Trump's 20-point peace plan, meaning there are a number of grey areas and room for discontent and disagreement in the near and long-term.This is particularly salient when it comes to both immediate matters in the peace proposal, such as the demilitarization of Hamas and withdrawal of Israeli forces from Gazan territory it currently controls, to perhaps the biggest bone of contention: a two-state solution for the Israelis and Palestinians.Trump refused to be drawn on the matter as he travelled to Israel on Monday, telling reporters on Air Force One: \"I'm not talking about a single state or double state or two state,\" before adding: \"A lot of people like the one-state solution, some people like the two-state solution. We'll have to see.\" While both sides had said \"yes\" to the ceasefire deal — with little other option given growing international pressure and disquiet from Trump and regional partners in the Middle East, as well as the weakening of Iran, Hamas' backer — both sides will be looking for the other to violate and scupper the deal, experts say.\"Israel's demand that Hamas be demilitarized, that its leaders go into exile ... would essentially mean that Hamas would be, if they agreed to it, committing institutional suicide,\" Geist Pinfold said.Israeli Prime Minister Benjamin Netanyahu addresses the Knesset as U.S. President Donald Trump and Amir Ohana, Speaker of the Israeli Knesset, look on October 13, 2025 in Jerusalem.   Chip Somodevilla | Via Reuters\"On the other side an Israeli withdrawal from the Gaza Strip is something that [Prime Minister] Benjamin Netanyahu has resisted from day one,\" he said, adding: \"So the stakes are very, very high here.\"The peace plan envisages the creation of a \"board of peace,\" to be chaired by Trump, to oversee the creation of a transitional authority to administer Gaza and supervise its reconstruction. How this will work in practice is also ambiguous, as well as who will keep the peace.\"When it comes to the peacekeepers, we don't know how many there will be, what countries they will be from when they would be deployed, or what their mandate will be. All these questions have been kicked down the road,\" Geist Pinfold said.Uriel Abulof, a visiting professor in Cornell University's government department and professor of politics at Tel-Aviv University, agreed that the deal signed at the peace summit in Egypt on Monday was not necessarily a \"peace deal.\"\"It's a survival pact for leaders who thrive on conflict. For two years, Netanyahu and Hamas have used this war to solidify their power, continuing a long-standing dynamic where each side's extremism justifies the other's,\" Abulof said in emailed comments.\"This agreement, forced upon them by external patrons like the U.S. and Qatar, is deliberately vague on core issues, allowing both to claim a win,\" he added.Abulof said both sides shared an \"unspoken goal\" in looking to block a viable Palestinian Authority from governing Gaza. \"Consequently, lasting peace isn't on the table,\" he said.\"The only path forward is through civic renewal, where Israelis and Palestinians replace leaders who see perpetual war as essential for staying in power,\" he said.Glimmers of hopeFeelings of bitterness, distrust and enmity, if not outright hatred, run deep on both sides of the simmering conflict and the latest eruption of tensions has left thousands dead and displaced 1.7 million people, according to the United Nations.A drone view shows Palestinians standing near rubble following the withdrawal of the Israeli forces from the area, amid a ceasefire between Israel and Hamas in Gaza, in Gaza City, on Oct. 12, 2025.Dawoud Abu Alkas | ReutersHamas' attack on Israel on Oct. 7 2023 saw the terrorist group kill 1,200 people and take hundreds hostage. Israel's response and the ensuing war left more than 67,000 Palestinians dead, including thousands of civilians, according to Gaza's Health Ministry. In the process, Gaza itself has been largely destroyed with most buildings in ruins.That pain and those losses will not be forgotten, let alone forgiven, overnight. At the same time, all peace processes have to start somewhere.People react as they watch the hostage release live stream at Hostages Square on Oct. 13, 2025 in Tel Aviv, Israel.Alexi J. Rosenfeld | Getty Images News | Getty ImagesThomas Schwartz, distinguished professor of History and Political Science at Vanderbilt University, said there's room for cautious optimism.\"I do see some strong parallels to past breakthroughs in the Middle East, especially Kissinger's shuttle diplomacy and Jimmy Carter's Camp David agreements,\" he noted in emailed comments Monday. \"That should also teach a bit of caution – in the Middle East, it's often two steps forward, and then one step backward. It will be a long road to real peace in the region, but I am genuinely optimistic.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says the war is over, but the path to peace in the Middle East is fragile",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108211322-17603709142025-10-13t155403z_1129974448_rc23bha5prun_rtrmadp_0_israel-palestinians-egypt-summit-britain.jpeg?v=1760370979&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T10:21:47.000Z",
      "dateModified": "2025-10-14T10:21:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The U.S. has stepped in with an extraordinary bailout of Argentina. Here's what it means",
    "url": "https://www.cnbc.com/2025/10/13/the-us-has-stepped-in-with-an-extraordinary-bailout-of-argentina-heres-what-it-means.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108202863-17586458482025-09-23t164306z_339157486_rc2sxgaetpbl_rtrmadp_0_un-assembly-trump.jpeg?v=1760366353&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T17:27:16.000Z",
    "description": "U.S. President Donald Trump shakes hands with Argentina's President Javier Milei during the 80th United Nations General Assembly, in New York City, Ne",
    "body": "U.S. President Donald Trump shakes hands with Argentina's President Javier Milei during the 80th United Nations General Assembly, in New York City, New York, U.S., Sept. 23, 2025.Alexander Drago | ReutersThe Treasury Department has extended a financial lifeline to Argentina in apparent hopes of heading off an emerging market financial crisis that could spread to U.S. shores.In a move that Treasury Secretary Scott Bessent announced Thursday on social media site X, the U.S. is providing a $20 billion currency swap line with Argentina's central bank — essentially exchanging stable U.S. dollars with volatile pesos.The move comes amid liquidity concerns in Argentina that threatened stability for the country as it faces key midterm elections.Providing the swap line \"marks a pivotal moment for Argentina's financial stability,\" Diego Celedon, head of equity strategy for the region at JPMorgan Chase, said in a client note. \"The U.S. support acts as a circuit breaker, halting the negative feedback loop that had threatened to deepen Argentina's economic strain.\"Economics, markets and politicsThere are equal parts economic and political stakes with the venture, which marks the first U.S. intervention of this nature since rescuing Mexico in 1995.While Argentina poses little systemic risk, it can still matter in terms of possible capital flight along with volatility in debt and commodity markets. That chance was deemed worth the risk of potential Argentinian default.\"Overall, the American intervention has transformed Argentina's short-term outlook, but the administration must now leverage its political capital to fully capitalize on this window of opportunity,\" Celedon wrote.The immediate market reaction was for the peso to appreciate sharply against the dollar Friday.However, an exchange-traded fund pegged to the country's industrial leaders, the Global X MSCI Argentina ETF, slumped Friday, indicating concerns that the American backstop may not be enough.\"It's unclear why the Trump administration is providing a de facto bailout of the Argentinian peso when there is no significant financial or economic relationship between the two economies,\" said Joseph Brusuelas, chief economist at RSM.\"It's entirely unclear to me that Argentina will not choose to devalue its peso after its election later this month,\" he added. \"Therein lies one of the greater risks of providing $20 billion Treasury supported swap line to Buenos Aires.\"In addition to economic and market matters, the U.S. has a significant political stake in what's happening in Argentina.Oct. 26 elections will determine the fate of President Javier Milei's government, which has become an important ally for the U.S. in the region. With investors jittery over global growth and election-year uncertainty, the bailout shows Washington is committed to keeping credit markets calm at home.Defending the dealIn his announcement of the deal, Bessent said it was in response to \"a moment of acute illiquidity\" and said the U.S. was in a unique position to help.He further mentioned the country's efforts at fiscal reform that \"will generate significant dollar-denominated exports and foreign exchange reserves.\"Still, the country's shaky fiscal history generated caution that the U.S. essentially could be throwing good money after bad as Argentina has a long history of defaulting on its debts.\"Milei has succeeded in sharply reducing inflation but has struggled to stabilize the peso's exchange rate against the dollar,\" said Lourdes Casanova, director of the Emerging Markets Institute at Cornell University. \"Given that currency trading is the largest financial market in the world ... no amount of reserves can single-handedly offset that pressure.\"The move also was met with criticism elsewhere, ranging from the soundness of the Argentinian political and economic system to the White House's use of the Exchange Stabilization Fund for the liquidity measure.\"While the government is 'shut down,' the Treasury Department officially started its bailout of Argentina,\" Rohit Chopra, director of the Consumer Financial Protection Bureau, said in a statement. \"We are now actively pumping dollars into Argentina in exchange for the country's plummeting peso, rather than helping people here at home.\"Bessent, though, said Milei's fiscal policies are \"sound\" and the success of the country is systemically important.Correction: This story has been updated to correct the name of the Exchange Stabilization Fund.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The U.S. has stepped in with an extraordinary bailout of Argentina. Here's what it means",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108202863-17586458482025-09-23t164306z_339157486_rc2sxgaetpbl_rtrmadp_0_un-assembly-trump.jpeg?v=1760366353&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T17:27:16.000Z",
      "dateModified": "2025-10-13T17:27:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Goldman Sachs beats estimates on better-than-expected investment banking, bond trading",
    "url": "https://www.cnbc.com/2025/10/14/goldman-sachs-gs-earnings-q3-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108134706-1745326385021-SG-Solomon-02.jpg?v=1745326464&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T12:26:21.000Z",
    "description": "David Solomon, CEO Goldman Sachs, speaking on CNBC's Squawk Box on April 22nd, 2025. CNBCGoldman Sachs on Tuesday beat estimates for its third quarter",
    "body": "David Solomon, CEO Goldman Sachs, speaking on CNBC's Squawk Box on April 22nd, 2025. CNBCGoldman Sachs on Tuesday beat estimates for its third quarter on stronger-than-expected investment banking and fixed income trading.Here's what the company reported:Earnings per share: $12.25 vs. $11 expected, according to LSEGRevenue: $15.18 billion vs. $14.1 billion expected, according to LSEGThe company said in a release that profit surged 37% from a year earlier to $4.1 billion, or $12.25 a share. Revenue rose 20% to $15.18 billion.Investment banking was the engine for Goldman's beat this quarter, with fees jumping 42% to $2.66 billion, or roughly $500 million more than what analysts surveyed by StreetAccount had expected.Trading desks across Wall Street have benefited as President Donald Trump's tariff policies have roiled markets for bonds, currencies, commodities and stocks. Investment banking activity including mergers and IPOs has also gained steam, with revenue climbing 22% in the third quarter, per Dealogic.Goldman Sachs gets the majority of its revenue from Wall Street activities including trading and investment banking. The bank cited more completed mergers and debt underwriting deals for its third-quarter revenue increase.Fixed income trading revenue rose 17% to $3.47 billion, topping the StreetAccount estimate by about $280 million, on greater activity in interest rate products, mortgages and commodities.But the bank's equities traders appear to have underdelivered compared to expectations, producing a 7% increase in revenue to $3.74 billion, about $160 million below the estimate.On Monday, Goldman announced it was acquiring Industry Ventures, a venture capital firm with $7 billion in assets under supervision, to bolster its asset management division.Shares of the bank were down about 2% in premarket trading Tuesday. They've climbed 37% this year as of Monday's close.JPMorgan Chase, Wells Fargo and Citigroup also released earnings Tuesday, with Bank of America and Morgan Stanley set to report results Wednesday.This story is developing. Please check back for updates.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Goldman Sachs beats estimates on better-than-expected investment banking, bond trading",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108134706-1745326385021-SG-Solomon-02.jpg?v=1745326464&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T12:26:21.000Z",
      "dateModified": "2025-10-14T12:26:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney has considered a co-CEO structure to replace Bob Iger. Its history may make that a bad idea",
    "url": "https://www.cnbc.com/2025/10/14/disney-ceo-succession-why-co-ceos-may-be-a-bad-idea.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108208416-1759779139794-Disney.jpg?v=1759779251&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T12:27:34.000Z",
    "description": "Dana Walden and Josh D'Amaro.Michael Buckner | Errich Petersen | Getty ImagesAs 2025 enters its final months, Disney inches closer to the announcement",
    "body": "Dana Walden and Josh D'Amaro.Michael Buckner | Errich Petersen | Getty ImagesAs 2025 enters its final months, Disney inches closer to the announcement the entire entertainment industry has been waiting for — who will take over for Bob Iger as the company's next CEO.Disney has publicly stated it will name Iger's successor in early 2026. Two internal candidates stand out as the most likely contenders: Disney Entertainment co-chairman Dana Walden and Disney Experiences chairman Josh D'Amaro. Walden brings decades of Hollywood expertise; D'Amaro worked in consumer products before his elevation in the theme parks division all the way up to running the unit when its previous leader, Bob Chapek, was named Disney CEO in 2020.Given Walden's and D'Amaro's complementary skill sets — and given recent momentum behind co-CEO appointments both in media and beyond — the Disney board could opt to select both to jointly replace Iger.It's a strategy rival Netflix has similarly — and effectively — used since 2020, when Reed Hastings named Ted Sarandos his co-CEO. Three years later, Hastings relinquished that post and moved on to become the company's executive chairman, elevating Greg Peters into his spot as co-CEO.Netflix's success has contributed to a recent co-CEO wave. Last month, Spotify named Alex Norstrom and Gustav Soderstrom as co-CEOs to replace founder Daniel Ek; Oracle named Clay Magouyrk and Mike Sicilia to jointly lead the company; and Comcast tapped president Mike Cavanagh to join longtime CEO Brian Roberts in the chief role.But while a duel CEO structure may superficially make sense for Disney, company insiders and corporate governance experts warn there are considerations specific to the Mouse House that would make such a dynamic unwise.The Netflix strategyLast year, Iger called Sarandos and asked him about Netflix's co-CEO model. That call was first reported by the Wall Street Journal in November, and CNBC can confirm it took place, according to people familiar with the matter.Sarandos and co-CEO Peters have different areas of passion, according to people familiar with Netflix's leadership styles, who asked to remain unnamed because the details are private. That's allowed the two leaders to make decisions without stepping on each other's toes. If Sarandos and Peters disagree on something, they work it out by deferring to the leader who is more passionate about the answer. That typically means Sarandos wins out if it's a content or creative decision, and Peters triumphs if the decision is more product- or technology-based. A Netflix spokesperson declined to comment.If there's a grey area, the co-CEOs can always fall back on Hastings, the company's co-founder and CEO of 25 years. Peters and Sarandos worked together under Hastings for many years. That comfort level — and Netflix's famously un-hierarchical corporate culture — have helped maintain a dual CEO structure without turf wars and while serving shareholders, Sarandos told Iger, according to the people familiar.Since Peters stepped in as co-CEO in January 2023, Netflix shares have gained about 275%.Disney's choiceAt first glance, Walden and D'Amaro present a similar dynamic to Sarandos and Peters. Walden's expertise is Hollywood, and D'Amaro's is parks and consumer products. Iger could theoretically advance to the executive chairman role, keeping him around in a similar fashion to Hastings.Selecting both Walden and D'Amaro as Iger's long-awaited successor may allow Disney to keep both leaders at the company. If the board chooses one over the other, Disney risks losing a top executive who may want a chance to be CEO elsewhere. This happened to Disney in 2020, when streaming chief Kevin Mayer departed the company to become TikTok's CEO after he was passed over for Chapek.But a Disney co-CEO arrangement also comes with a number of red flags that don't exist at other companies.First, if Iger sticks around on the board, some employees — and external partners — may still view him as a CEO. That could undercut the power-sharing structure of two CEOs, especially given Iger's reputation for wanting to remain the company's No. 1 leader.While Hastings has turned his attention to hobbies like skiing since giving up his CEO role, Iger has developed a reputation for wanting to hang around as Disney's head honcho. He's five times pushed backed retirement to remain at the helm, and he came back to replace Chapek in 2022 after hand-picking him as his replacement.Second, during Chapek's tenure, Iger didn't fully give up his operational responsibilities right away, choosing to direct the company's \"creative endeavors\" for more than a year. That led to an ugly power-sharing situation between Iger and Chapek, as CNBC detailed in 2023. Even if Walden and D'Amaro have different domain strengths, choosing a co-CEO model after suffering through a recent time period where control lines were blurred may be a case of failing to learn from one's mistakes.Third, Walden and D'Amaro haven't worked together as long as Peters and Sarandos (or other co-leader arrangements with long-term success, such as CAA's co-chairman arrangement with Bryan Lourd, Richard Lovett and Kevin Huvane). Walden did work in a co-chair arrangement with Gary Newman at Fox for many years running Fox TV, proving she's capable of succeeding in such an arrangement, but it's unclear if she'd relish the opportunity to go back to a pairing.Fourth, Disney's corporate culture is famously political. The company has had several tortured succession processes with Iger and Disney's former CEO Michael Eisner. While Netflix is largely untouched by M&A, Disney is an amalgam of many acquisitions and units over the years, including ABC, ESPN, Fox, Pixar, Marvel and Lucasfilm. That's brought employees from many different cultures together, rather than breeding a unified corporate mindset from its founding.\"It wouldn't work for Disney,\" a senior media executive told CNBC privately. \"There would be so much backbiting. That's how it's always been there.\"A Disney spokesperson declined to comment.Netflix vs. traditionOn top of all of that, traditional corporate governance experts have broadly dismissed a co-CEO setup as suboptimal.About 1.2% of companies in the Russell 3000 index have employed a co-CEO structure at any given time in recent years, The Wall Street Journal reported last month, citing data from Equilar.\"When you create two sources of authority in an organization, that's never good,\" said Charles Elson, founding director of the Weinberg Center for Corporate Governance at the University of Delaware, in an interview. \"Two in charge means no one is in charge.\"Still, there are mitigating factors that can make a co-CEO arrangement more palatable, Elson said. Having Hastings as executive chairman is likely important for Netflix because he can act as a de-facto tiebreaker in a co-CEO arrangement.Similarly, a co-CEO structure can work if it's clearly done for more-drawn-out succession planning, such as Comcast's decision to elevate Cavanagh to co-CEO alongside Roberts, said Elson.When push comes to shove, Hastings and Roberts can make the deciding calls on the biggest decisions, Elson said. Roberts is Comcast's controlling shareholder. Oracle similarly has a controlling shareholder in co-founder Larry Ellison. While Iger could play a tie-breaking role for Disney as executive chairman, he isn't a founder of the company and owns less than 1% of shares outstanding. That gives him less skin in the game for the Disney's future than someone like Roberts or Ellison, noted Elson.Selecting just one CEO may be a leap of faith for the Disney board, but it's better than setting up instability, said Elson.\"Inevitably, one CEO dominates and the other one goes away,\" he said. \"That's the nature of humanity.\"Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast's planned spinoff of Versant.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney has considered a co-CEO structure to replace Bob Iger. Its history may make that a bad idea",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108208416-1759779139794-Disney.jpg?v=1759779251&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T12:27:34.000Z",
      "dateModified": "2025-10-14T12:27:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How China's rare earth restrictions could disrupt the U.S. defense industry and reignite a trade war",
    "url": "https://www.cnbc.com/2025/10/14/china-trump-xi-rare-earth-defense-critical-mineral-trade-war-tariffs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108170156-17521529182020-04-22t000000z_781196416_rc2n9g9vgdx7_rtrmadp_0_usa-rareearths.jpeg?v=1752152993&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T11:20:54.000Z",
    "description": "watch nowChina sweeping restrictions on rare earth exports threaten the U.S. defense industry, providing President Xi Jinping with a powerful leverage",
    "body": "watch nowChina sweeping restrictions on rare earth exports threaten the U.S. defense industry, providing President Xi Jinping with a powerful leverage over President Donald Trump in upcoming trade talks.Beijing will not allow the export of rare earth materials for use by foreign militaries, China's Ministry of Commerce announced on Oct. 9. These are the first restrictions imposed by China that specifically target the defense sector, according to Gracelin Baskaran, a critical minerals expert at the Center for Strategic and International Studies.\"What this essentially means is that it will deny licenses to foreign militaries and companies that are producing military use end goods,\" Baskaran told CNBC. \"It undermines the development of the defense industrial base at a time when there is rising global tension. It is a very powerful negotiating tactic because it undermines national security.\"Rare earth magnets are crucial components in U.S. weapons systems such as the F-35 warplane, Virginia and Columbia class submarines, Predator drones, Tomahawk missiles, radars, and the joint direct attack munition series of smart bombs, according to the Department of Defense.China dominates the global supply chain for rare earths. It controls 60% of mining and more than 90% of refining worldwide, according to the International Energy Agency. The U.S. is dependent on China for around 70% of its rare earth imports, according the U.S. Geological Survey.\"It's scandalous that we don't have a rare earths strategic reserve, that we let China monopolize 90% of the refining of rare earth materials,\" Jeremy Siegel, University of Pennsylvania professor emeritus of finance, told CNBC on Monday. \"Where were we?\"'Massively disruptive'Beijing also imposed broad controls that require foreign companies to obtain an export license if rare earths processed in China make up as little as 0.1% of their products' value. Firms also need licenses for products that rely Chinese rare earth technology for mining, smelting, separation, magnet manufacturing and recycling.\"If these rules were to be strictly and indefinitely enforced, they would be massively disruptive, not just to the US but globally,\" Wolfe Research analyst Tobin Marcus told clients in an Oct. 10 note. Rare earths are also also crucial inputs for the semiconductor and automobile industries.The restrictions would impact every sector of the U.S. economy but the defense, semiconductor and electric vehicle industry would face the brunt, according to Alicia Garcia Herrero, an economist at French investment bank Natixis. Defense contractors, Apple, Nvidia, Intel, Tesla, Ford and GM are all highly exposed, Hererro told clients in a Monday note.The Trump administration is working to build out a domestic supply chain. The Defense Department struck an unprecedented deal with the largest U.S. rare earth miner MP Materials in July that included an equity stake, price floors and an offtake agreement.\"This will certainly also further accelerate US efforts to develop our own rare earth resources,\" Marcus said. U.S. rare earth stocks have surged as investors speculate that the Trump administration will strike deals with other miners.Standoff in South KoreaThe restrictions threaten to reignite the trade war between the China and the U.S. after months of relative calm.Trump has responded with 100% tariffs on Chinese goods starting Nov. 1. The huge import taxes would come on top of the 44% tariff rate already in place on China, effectively cutting off trade between the world's two largest economies, according to Wolfe Research.\"It wouldn't take much re-escalation to get us back to the quasi-embargo situation that prevailed in the spring,\" Marcus told clients.The U.S. stock market erased about $2 trillion in value Friday after Trump threatened massive tariffs against China, according to Bespoke Investment Group. The S&P 500 rallied Monday to regain more than half of Friday's losses after Trump appeared to de-escalate, saying \"it will all be fine\" with China.Trump and Xi are still expected to meet on the sidelines of the Asia-Pacific Economic Cooperation summit in Seoul, South Korea later this month, Treasury Secretary Scott Bessent told Fox Business on Monday.The most likely scenario is \"both sides pull back on the most aggressive policies and that talks lead to a further—and possibly indefinite—extension of the tariff escalation pause reached in May,\" Goldman Sachs told clients Sunday.But Beijing's strategy is unclear and the tariff deadline is just weeks away, raising the risk that an agreement might not be struck in time, Marcus said.\"Without more conviction about Beijing's strategy here, we're concerned that they won't be willing to back down fast enough to prevent these 100% tariffs from kicking in, at least temporarily,\" the analyst said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How China's rare earth restrictions could disrupt the U.S. defense industry and reignite a trade war",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108170156-17521529182020-04-22t000000z_781196416_rc2n9g9vgdx7_rtrmadp_0_usa-rareearths.jpeg?v=1752152993&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T11:20:54.000Z",
      "dateModified": "2025-10-14T11:20:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Goldman Sachs agrees to acquire $7 billion VC firm Industry Ventures ",
    "url": "https://www.cnbc.com/2025/10/13/goldman-sachs-agrees-to-acquire-7-billion-vc-firm-industry-ventures-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108016846-1729004196183-108016846-1722955743918-gettyimages-2165053438-DAVID_SOLOMON_INTERVIEW.jpg?v=1760386317&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-13T20:48:17.000Z",
    "description": "David Solomon, chief executive officer of Goldman Sachs Group Inc., during an interview for an episode of \"The David Rubenstein Show: Peer-to-Peer Con",
    "body": "David Solomon, chief executive officer of Goldman Sachs Group Inc., during an interview for an episode of \"The David Rubenstein Show: Peer-to-Peer Conversations\" in New York, US, on Tuesday, Aug. 6, 2024.Jeenah Moon | Bloomberg | Getty ImagesGoldman Sachs has agreed to acquire Industry Ventures, a venture capital firm with $7 billion in assets under supervision, according to a release from the investment bank.Goldman is paying $665 million in cash and equity, and up to $300 million more based on the firm's future performance through 2030, the bank said. The deal is expected to close in the first quarter of 2026.Goldman Sachs is making the acquisition to bolster its $540 billion alternatives investment platform, part of the self-identified \"growth engine\" of the investment bank. By identifying and making bets on startups, the venture capital firm can help Goldman create a pipeline of investments for its wealthy clients, as well as provide solutions to tech entrepreneurs.San Francisco-based Industry Ventures has helped pioneer aspects of the American VC market since its founding 25 years ago, according to Goldman CEO David Solomon.\"Industry Ventures' trusted relationships and venture capital expertise complement our existing investing franchises and expand opportunities for clients to access the fastest growing companies and sectors in the world,\" Solomon said in the release.\"By combining the global resources of Goldman Sachs with the venture capital expertise of Industry Ventures, we are uniquely positioned to serve the increasingly complex needs of entrepreneurs, private technology companies, limited partners, and venture fund managers,\" said Hans Swildens, founder and CEO of Industry Ventures.Industry Ventures has made more than 1,000 investments and said its annual performance was an internal rate of return of 18%.The bank said it expects that all 45 employees of the venture firm will join Goldman.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Goldman Sachs agrees to acquire $7 billion VC firm Industry Ventures ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108016846-1729004196183-108016846-1722955743918-gettyimages-2165053438-DAVID_SOLOMON_INTERVIEW.jpg?v=1760386317&w=1920&h=1080"
      ],
      "datePublished": "2025-10-13T20:48:17.000Z",
      "dateModified": "2025-10-13T20:48:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What laid off federal workers need to know about their student loans",
    "url": "https://www.cnbc.com/2025/10/14/government-shutdown-layoffs-rifs-student-loans.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210697-1760115897623-gettyimages-2239359467-US_GOV_FUNDING.jpeg?v=1760116045&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T11:14:01.000Z",
    "description": "The US Capitol in Washington, DC, US, on Tuesday, Oct. 7, 2025.Eric Lee | Bloomberg | Getty ImagesThe thousands of federal workers newly laid off by t",
    "body": "The US Capitol in Washington, DC, US, on Tuesday, Oct. 7, 2025.Eric Lee | Bloomberg | Getty ImagesThe thousands of federal workers newly laid off by the Trump administration face numerous financial challenges, including finding new health insurance and keeping up with recurring bills. Another key task: Figuring out what to do about their monthly student loan payment.The permanent job cuts — which Russell Vought, director of the Office of Management and Budget, announced on Friday — are formally known as \"Reductions in Force,\" or RIFs. The RIFs will strip many federal workers of certain benefits related to their student loans and make it harder for them to repay their debt.However, there are options available that allow borrowers to pause their payments or request a lower payment during difficult times.Here's what federal workers should know about their student loan options.How RIFs affect repayment assistance, forgivenessOften, federal agencies provide their employees with student loan repayment assistance of up to $10,000 per year, said higher education expert Mark Kantrowitz. In total, federal workers can get up to $60,000 under the U.S. Office of Personnel Management program.In 2024, more than 16,500 federal employees collectively received around $150 million in student loan repayment benefits, according to an OPM report.\"This is one of the key perks that help attract recent college graduates to working for the federal government,\" Kantrowitz said. \"But, when a borrower's employment is terminated, they lose this benefit.\"Federal workers should not need to repay any benefits they've received before the RIF, he added.Read more CNBC personal finance coverageDespite government shutdown, Oct. 15 is still the tax extension deadlineBoomers still love their department stores. Here's whyHow new federal tax changes for 2026 may affect familiesIRS announces new federal income tax brackets for 2026The IRS unveils higher capital gains tax brackets for 2026Gold hits $4,000 but stocks still win over time, top advisor saysAttending a wedding can cost you as much as a typical month’s rentAI is poised to disrupt the job market. Some roles could ‘radically transform'This tax move is one of the IRS’ ‘best-kept secrets for retirees,’ advisor saysFurloughed federal workers face threat of no back pay from shutdownConsumer outlook sours as inflation expectations rise: New York FedHow the S&P 500 performed after 10 previous government shutdownsCNBC's Financial Advisor 100: Best financial advisors, top firms for 2025 rankedGovernment workers who were working toward Public Service Loan Forgiveness will not receive credit for the program during their period of unemployment. PSLF offers loan forgiveness to certain public servants after a decade.Borrowers will retain credit for qualifying PSLF payments they made before the RIF.Try getting a lower monthly paymentFederal student loan borrowers who are laid off from their jobs are usually able to sign up for an income-driven repayment plan and get a lower payment, or even a $0 bill. IDR plans limit borrowers' monthly payments to a share of their discretionary income and cancel any remaining debt after a certain period, typically 20 years or 25 years.While IDR plan applications may be delayed during the government shutdown, you should be placed in a temporary forbearance after you submit your request, Kantrowitz said. You won't need to make a payment for that period, but interest may continue to accrue on your debt.watch nowAny unemployment benefits you collect will count as income in the U.S. Department of Education's calculation of your monthly bill. Even so, those payments often come out to far less than what a person was earning while employed, according to a 2023 report from the National Employment Law Project.One important thing to note: The government may calculate your monthly payment obligation under an IDR plan based on your last filed tax return, said Nancy Nierman, assistant director of the Education Debt Consumer Assistance Program in New York.But if your earnings have dropped recently, \"you can provide proof of your current income instead,\" Nierman said.Borrowers who were caught in a RIF may also be eligible for an Unemployment Deferment. Under that option, the Education Department often allows you to pause your payments if you're receiving unemployment benefits or looking for and unable to find full-time employment, among other requirements. (Some student loans will still accrue interest during the payment pause, while others will not.)Recent legislation will do away with the Unemployment Deferment for those who take out student loans after July 1, 2027. But current borrowers will maintain access to the relief option.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What laid off federal workers need to know about their student loans",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210697-1760115897623-gettyimages-2239359467-US_GOV_FUNDING.jpeg?v=1760116045&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T11:14:01.000Z",
      "dateModified": "2025-10-14T11:14:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "California just passed new AI and social media laws. Here's what they mean for Big Tech",
    "url": "https://www.cnbc.com/2025/10/14/heres-what-californias-new-ai-social-media-laws-mean-for-big-tech.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108211453-1760382792321-gettyimages-2228237489-AA_08082025_2362705.jpeg?v=1760382867&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T11:54:56.000Z",
    "description": "Governor Gavin Newsom speaks at Google San Francisco office about 'Creating an AI-Ready Workforce' that new joint effort with some of the world's lead",
    "body": "Governor Gavin Newsom speaks at Google San Francisco office about 'Creating an AI-Ready Workforce' that new joint effort with some of the world's leading tech companies to help better prepare California's students and workers for the next generation of technology, in San Francisco, California, United States on August 7, 2025. Tayfun Coskun | Anadolu | Getty ImagesCalifornia Gov. Gavin Newsom signed a series of bills Monday targeting child online safety as concerns over the risks associated with artificial intelligence and social media use keep mounting.\"We can continue to lead in AI and technology, but we must do it responsibly — protecting our children every step of the way,\" he said in a release. \"Our children’s safety is not for sale.”The latest legislation comes as the AI craze ushers in a wave of more complex chatbots capable of deep, intellectual conversation and encouraging behaviors. Across age groups, people are leaning on AI for emotional support, companionship and in some cases, romantic connections.A recent survey from Fractl Agents found that one in six Americans rely on chatbots and worry that losing access would stunt them emotionally and professionally. More than a fifth of respondents reported having an emotional connection with their chatbot.Many lawmakers have called for laws requiring Big Tech to better protect against chatbots promoting unsafe behaviors such as suicide and self-harm on their platforms.The bills signed into law by Newsom on Monday are intended to address some of those concerns.The changesOne of the laws passed by California implements a series of safeguards geared toward AI chatbots.SB 243 is the first state law of its kind and requires chatbots to disclose that they are AI and tell minors every three hours to \"take a break.\" Chatbots makers will also need to implement tools to protect against harmful behaviors and disclose certain instances to a crisis hotline.The law allows California to maintain its lead in innovation while also holding companies accountable and prioritizing safety, Newsom said in a release.In a statement to CNBC, OpenAI called the law a \"meaningful move forward\" for AI safety standards.\"By setting clear guardrails, California is helping shape a more responsible approach to AI development and deployment across the country,\" the company said.Another bill signed by Newsom, AB 56, requires that social media platforms including Instagram and Snapchat to add labels that warn users of the potential mental health risks associated with using those types of apps. AB 621, meanwhile, heighten penalties for companies whose platforms distribute deepfake pornography.The other key law, known as AB 1043, requires that device makers, like Apple and Google, implement tools to verify user ages in their app stores. Some Big Tech companies have already endorsed the law's safeguards, including Google and Meta.Last month, Kareem Ghanem, Google's senior director of government and affairs and public policy, called AB 1043 one of the \"most thoughtful approaches\" to keeping children safe online.The impact to big techThe new laws require a series of changes to many long-standing business models. But D.A. Davidson's Gil Luria said companies should experience a \"distributed\" impact from these new measures, since all businesses are forced to accommodate the rules.\"For AI chats the timing is beneficial since these companies are still working out their business models and will now accommodate a more restrictive approach at the outset,\" he said.Other countries have already enacted rules tougher restrictions on AI. Last year, the European Union passed the AI Act that includes fines for companies that violate the laws' framework that includes a social scoring systems.Utah and Texas have also signed laws implementing AI safeguards for minors. The Utah law, for example, requires that Apple and Google to verify user ages and it requires parental permission for those under 18 to use certain apps. These laws have also raised questions over whether harsh restrictions violate free speech or bans are the most effective solution.California isn't the first jurisdiction to pass laws like these, but Newsom's signings carry significance due to the size of the state's population and the fact that many tech companies are based in the San Francisco Bay Area.WATCH: Why it's time to take AI-human relationships seriouslywatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "California just passed new AI and social media laws. Here's what they mean for Big Tech",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108211453-1760382792321-gettyimages-2228237489-AA_08082025_2362705.jpeg?v=1760382867&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T11:54:56.000Z",
      "dateModified": "2025-10-14T11:54:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Salesforce's Agentforce software is coming to OpenAI's ChatGPT later this year",
    "url": "https://www.cnbc.com/2025/10/14/salesforce-will-bring-agentforce-to-openais-chatgpt-later-in-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108211552-1760399850212-gettyimages-2194677103-DAVOS_WEF_2025.jpeg?v=1760399909&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T11:45:01.000Z",
    "description": "Salesforce CEO Marc Benioff participates in an interview during the World Economic Forum in Davos, Switzerland, on Jan. 22, 2025.Chris Ratcliffe | Blo",
    "body": "Salesforce CEO Marc Benioff participates in an interview during the World Economic Forum in Davos, Switzerland, on Jan. 22, 2025.Chris Ratcliffe | Bloomberg | Getty ImagesSalesforce is ramping up partnerships with leaders in generative artificial intelligence as investors continue to fear that the software company faces business risks due to the rapid growth of AI.Just ahead of its annual Dreamforce conference in San Francisco, Salesforce said Tuesday it will enable the use of AI models from OpenAI and Anthropic inside its Agentforce 360 software. A day earlier, Salesforce expanded Agentforce beyond text chats to also handle voice calls.\"The way people are going to interact with software is going to fundamentally shift,\" said Brian Landsman, CEO of Salesforce's AppExchange business and executive vice president of partnerships, in an interview. The interaction could be in ChatGPT or in Slack, he said.Salesforce will collaborate with Anthropic to bring Agentforce 360 into Claude, Landsman added.Shares of Salesforce are down about 26% this year, while the S&P 500 index has gained 13%, as Wall Street seeks faster revenue growth from the cloud software company. So far, Agentforce revenue has been \"modest,\" Morgan Stanley analysts, who have the equivalent of a buy rating on Salesforce, wrote in a Monday note.Large software companies are increasingly turning to popular AI model developers for new capabilities. Atlassian, Datadog and Intuit have previously signed deals with OpenAI, and Microsoft has invested almost $14 billion in the company. In September, Databricks committed to spending $100 million on OpenAI models.As part of Salesforce's announcement, customers will be able to access corporate information in Agentforce 360 and create charts in Tableau through the ChatGPT assistant, which has more than 800 million weekly users. Last week OpenAI announced a software development kit for integrating third-party applications into ChatGPT.Companies working with both OpenAI and Salesforce will be able to sell products through ChatGPT's instant checkout feature later in 2025. Salesforce plans to work with Anthropic on selling products for regulated industries, starting with financial services.OpenAI said last month that ChatGPT users would be able to purchase products from U.S. Etsy sellers and Shopify merchants.Meanwhile, Salesforce said its engineering organization is adopting Anthropic's Claude Code programming product.\"We plan to continue to go much deeper with these partners over time,\" Landsman said.Salesforce CEO Marc Benioff has been defending his company's position in the AI boom. And on last month's earnings call, he said Anthropic and OpenAI both use Salesforce tools.\"All these next-generation AI companies ranging from OpenAI to Anthropic to everyone are on Slack,\" Benioff, who is also Salesforce's co-founder, told analysts. \"And it is incredible how they've used that as their operating system and as their platform to run their companies.\"WATCH: Salesforce CEO Marc Benioff goes one-on-one with Jim Cramerwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Salesforce's Agentforce software is coming to OpenAI's ChatGPT later this year",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108211552-1760399850212-gettyimages-2194677103-DAVOS_WEF_2025.jpeg?v=1760399909&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T11:45:01.000Z",
      "dateModified": "2025-10-14T11:45:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rockefeller Capital secures backing from Chanel dynasty's family office and others",
    "url": "https://www.cnbc.com/2025/10/14/rockefeller-capital-mousse-partners-greg-fleming-expansion.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210731-1760117810087-Screenshot_2025-10-10_at_13343_PM_copy.png?v=1760123435&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-14T12:00:02.000Z",
    "description": "Greg Fleming, Rockefeller Capital Management president and CEO, speaks during CNBC's 'Squawk Box' on July 10, 2025.CNBCRockefeller Capital Management,",
    "body": "Greg Fleming, Rockefeller Capital Management president and CEO, speaks during CNBC's 'Squawk Box' on July 10, 2025.CNBCRockefeller Capital Management, the wealth manager born from John D. Rockefeller's family office, has raised new funds from investment firms of other ultra-rich families, CNBC has learned.On Tuesday, Rockefeller plans to announce the recapitalization and its new valuation of $6.6 billion, up from $3 billion in 2023. The terms of the recapitalization, which traditionally use equity or debt to fund growth, strengthen the balance sheet, or provide liquidity to investors, were not disclosed.The recapitalization was led by Mousse Partners, the family office of Chanel's owners; Progeny 3, a Kirkland, Washington-based firm built on a shipping fortune; and Abrams Capital, the hedge fund manager founded by David Abrams, a protege of The Baupost Group's Seth Klarman.The Rockefeller family still owns a minority stake in the firm, having rolled over some of their equity from their former family office into Rockefeller when it was formed in 2018 with only $18 billion in assets. The firm now manages $187 billion in assets, mostly through its global family office division. Rockefeller also has asset management and investment bank divisions.With the transaction, which is expected to close by the end of 2025, hedge fund and founding backer Viking Global Investors will no longer be the firm's majority shareholder, but will still own the largest stake.Rockefeller CEO Greg Fleming told CNBC in an interview the new investors are emblematic of the entrepreneurial, high-net-worth clients that the firm targets. Rockefeller typically caters to clients with $25 million to $100 million in assets. With the fresh funding, the firm plans to reach more American business owners by hiring more advisors in existing markets including Boston and Houston and new ones like Miami and Minneapolis, he said.\"Our new families that are investing here have created wealth through building businesses,\" Fleming said. \"In America, 4 [million] to 5 million new businesses are started and developed every year.\"Rockefeller is also looking to tap into international wealth by partnering with local wealth advisory firms, most likely in Singapore and the Middle East, he said.\"The Rockefeller brand is a global brand, an iconic brand,\" he said, pointing to the Standard Oil family's philanthropic efforts abroad, such as founding a hospital in Beijing over a century ago. \"That's another growth lever. The slingshot that we've got coming out of this transaction will allow us to go after it.\"Fleming said negotiations for the financing began in earnest this past summer. He said the patient capital of family offices, which can afford to invest for decades or even generations, were a good fit for the firm's long-term vision. The Desmarais family, one of Canada's richest, invested $622 million in Rockefeller in 2023 through its financial services conglomerate, Power Corporation of Canada.\"They know if you're going to build something that's excellent that it takes time, and they look for investments that flourish over the long run,\" Fleming said of family-office investors.Mousse Partners, the family office of Chanel owners Alain and Gérard Wertheimer, is better known for its consumer bets such as clean beauty label Beautycounter, recently rebranded as Counter, and the luxury fashion brand The Row. That said, Mousse Partners has invested in financial services before, having backed the private takeover of Rothschild & Co. alongside the bank's namesake family and the families behind Peugeot and Dassault.Fleming said family offices see wealth management as a growth business with stable fee-based revenue. He added that the firm is also poised for growth during the great wealth transfer, with $124 trillion expected to be passed down by 2048 by Cerulli Associates' estimate.\"If you're focused on the client first, and you do a really good job, you can do more and more for the existing clients and bring in more and more new clients,\" he said.The lofty expectations of ultra-rich clients also plays into the firm's favor, as they increasingly expect a broad range of services from direct investing advisory to philanthropic education and a seamless tech interface, he said.\"It's a business where, particularly in 2025, there's a lot of investment needed to be able to create the capabilities to serve these high-net-worth and ultra-net-worth families. They are sophisticated,\" he said. \"It's quite hard to do it.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rockefeller Capital secures backing from Chanel dynasty's family office and others",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210731-1760117810087-Screenshot_2025-10-10_at_13343_PM_copy.png?v=1760123435&w=1920&h=1080"
      ],
      "datePublished": "2025-10-14T12:00:02.000Z",
      "dateModified": "2025-10-14T12:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]