[
  {
    "title": "Figma delivers strong forecast as AI draws in more customers",
    "url": "https://www.cnbc.com/2025/11/05/figma-fig-q3-earnings-report-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108193793-1756916915031-gettyimages-2227189910-FIGMA_IPO.jpeg?v=1762375030&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-05T23:16:09.000Z",
    "description": "Dylan Field, co-founder and CEO of Figma, center, appears on the floor of the New York Stock Exchange in New York on July 31, 2025. Figma Inc. shares ",
    "body": "Dylan Field, co-founder and CEO of Figma, center, appears on the floor of the New York Stock Exchange in New York on July 31, 2025. Figma Inc. shares surged as much as 229% after the design software maker and some of its shareholders raised $1.2 billion in an IPO, with the trading valuing the company far above the $20 billion mark it would have reached in a now-scrapped merger with Adobe Inc.Michael Nagle | Bloomberg | Getty ImagesDesign software maker Figma on Wednesday reported stronger-than-expected third-quarter revenue and quarterly revenue guidance. The stock moved as much as 6% higher in extended trading.Here's how the company did in comparison with LSEG consensus:Earnings per share: 10 cents adjustedRevenue: $274.2 million vs. $265.2 million expectedFigma's revenue grew 38% year over year in the third quarter, according to a statement.The company's net loss ballooned to $1.10 billion, or $2.72 per share, from $15.6 million, or 7 cents per share, in the same quarter a year ago.The adjusted earnings per share excluded a major increase in stock-based compensation expense.The company reported an adjusted operating margin of 12%, above StreetAccount's consensus of 6.5%.Some of the growth derives from the adoption of Figma Make, a product that develops app designs using generative artificial intelligence models. About 30% of customers spending over $100,000 in annualized revenue are using Figma Make weekly, CEO and co-founder Dylan Field told CNBC in an interview.\"That continues to grow, and overall sort of across the business, Figma Make was a big driver of new customers in Q3,\" he said.Read more CNBC tech newsAmazon upheaval: With morale shaken, Jassy looks for next big play after mass layoffsArmis raises $435 million, valuing cybersecurity startup at $6.1 billionChinese EV maker Xpeng to launch robotaxis, humanoid robots with self-developed AI chipsTrump renominates Musk ally Jared Isaacman to run NASA months after withdrawalFigma's net dollar retention rate for clients spending at least $10,000 on an annualized basis, a reflection of expansion among the existing customer base, was 131%, up from 129% in the second quarter.At the same time, Figma's base of large customers is expanding. It reported 1,262 organizations with over $100,000 in annualized spending at the end of September, up about 13% from the count at the end of June.Figma sees $292 million to $294 million in fourth-quarter revenue, above LSEG's $283 million consensus. The range implies 35% growth.Figma raised $1.2 billion when it went public on the New York Stock Exchange in July, pricing shares at $33 each. The stock closed at $44.01 on Wednesday, good for a 33% gain. The Nasdaq Composite index is up about 11% over the same period.On Oct. 30, Figma said it had acquired Weavy, a startup whose software enables people to compose images, videos and other creative assets with generative AI models.Field told CNBC that he didn't have information available yet on pricing for the Figma Weave capabilities resulting from the deal.Figma still isn't enforcing AI credit limits for its full subscription seats, nor is it charging for AI consumption add-ons, Praveer Melwani, the company's finance chief, said on a conference call with analysts. He said he doesn't expect consumption revenue to be material in 2025.\"We will continue investing heavily in AI and we will trade near-term margin to build the right long-term platform for our customers,\" Field said on the conference call.WATCH: Waiting for market to digest Figma's post-IPO volatility 'before I start to dabble,' says Steve Grassowatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Figma delivers strong forecast as AI draws in more customers",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108193793-1756916915031-gettyimages-2227189910-FIGMA_IPO.jpeg?v=1762375030&w=1920&h=1080"
      ],
      "datePublished": "2025-11-05T23:16:09.000Z",
      "dateModified": "2025-11-05T23:16:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FAA to cut flights by 10% at 40 major airports due to government shutdown",
    "url": "https://www.cnbc.com/2025/11/05/faa-cuts-flight-capacity-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222102-1762382256681-gettyimages-2245206189-_kr11196_seyxsnkk.jpeg?v=1762382301&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-05T22:38:57.000Z",
    "description": "U.S. Transportation Secretary Sean P. Duffy and FAA Administrator Bryan Bedford hold a press conference at the U.S. Department of Transportation Headq",
    "body": "U.S. Transportation Secretary Sean P. Duffy and FAA Administrator Bryan Bedford hold a press conference at the U.S. Department of Transportation Headquarters on Nov. 5, 2025 in Washington, DC. Tasos Katopodis | Getty ImagesTransportation Secretary Sean Duffy announced Wednesday afternoon that he will be reducing flight capacity by 10% at 40 major airports starting on Friday morning, affecting roughly 3,500 to 4,000 flights daily.It was not immediately clear which airports would be affected.\"This is proactive,\" Duffy said in a news conference.Federal Aviation Administration Administrator Bryan Bedford said additional measures could be taken after the initial reduction.\"As we slice the data more granularly, we are seeing pressures build in a way that we don't feel, if we allow it to go unchecked, will allow us to continue to tell the public that we operate the safest airline system in the world,\" Bedford said on Wednesday.Bedford added that the administration will be meeting with the airline community to decide how to move forward on implementing the reduction, which he said has never happened before during his time in the industry.The government shutdown, which entered its 36th full day on Wednesday, is now the longest in U.S. history.Duffy said he expects more cancellations as a result of the reduction, which has no set end time. \"We thought 10% was the right number based on the pressure we were seeing,\" Duffy added.The move comes as air traffic controllers have missed their paychecks due to the government shutdown. Air traffic controllers and Transportation Security Administration screeners are among the essential government employees who are required to work during the shutdown.The closure has also raised concerns about already thin staffing among air traffic controllers, the FAA said. Insufficient staffing at some FAA facilities has disrupted some flights since Oct. 1.Earlier this week, Duffy told CNBC's \"Squawk Box\" that he could \"shut the whole airspace down\" if the shutdown drags on.On Wednesday morning, National Air Traffic Controllers Association President Nick Daniels told CNBC's \"Squawk Box\" that it could take \"weeks to recover\" from the impacts of the government shutdown on air traffic controllers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FAA to cut flights by 10% at 40 major airports due to government shutdown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222102-1762382256681-gettyimages-2245206189-_kr11196_seyxsnkk.jpeg?v=1762382301&w=1920&h=1080"
      ],
      "datePublished": "2025-11-05T22:38:57.000Z",
      "dateModified": "2025-11-05T22:38:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia's Jensen Huang softens his ‘China will win the AI race’ remark to FT",
    "url": "https://www.cnbc.com/2025/11/06/jensen-huang-says-china-will-win-the-ai-race-before-clarifying-in-a-statement-nvidia-trump-xi.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222120-17623850772025-11-05t232015z_1107606753_rc2lqhan43vc_rtrmadp_0_britain-royals-king.jpeg?v=1762385223&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-06T09:04:56.000Z",
    "description": "Jensen Huang attends a reception for the 2025 Queen Elizabeth Prize for Engineering, at St James' Palace in London, Brirain, Nov. 5, 2025.  Yui Mok | ",
    "body": "Jensen Huang attends a reception for the 2025 Queen Elizabeth Prize for Engineering, at St James' Palace in London, Brirain, Nov. 5, 2025.  Yui Mok | Via ReutersNvidia CEO Jensen Huang reportedly told the Financial Times on Wednesday that \"China is going to win the AI race,\" only to release a notably softer statement soon after. The prolific tech leader was speaking on the sidelines of the FT's Future of AI Summit, where he warned that China would beat the U.S. in artificial intelligence thanks to lower energy costs and looser regulations.The comments, which CNBC could not verify independently, would represent Huang's starkest warning yet that the U.S. is at risk of losing its global lead in advanced AI technologies. However, several hours after the FT published its report, Nvidia issued a separate statement from Jensen on an official X account. \"As I have long said, China is nanoseconds behind America in AI. It's vital that America wins by racing ahead and winning developers worldwide,\" he added.Huang has long stated that the U.S. can stay ahead in the AI race if it keeps developers reliant on Nvidia's leading AI chips — an argument the CEO has used to lobby against export restrictions on his company's sales to China. Following meetings with U.S. President Donald Trump in July, it seemed that Huang's efforts had paid off, with Washington agreeing to ease some of its chip curbs. Under the plan, Nvidia and competing AI chip company AMD had agreed to pay the U.S. government 15% of their Chinese revenues from sales of existing AI processors tailored for the market.However, Beijing has since shut Nvidia out of the market as it conducts a national security review of its chips, with Huang stating that the firm's market share has been reduced to zero. It remains unclear whether China will allow any of Nvidia's chips to return, as officials push domestic tech companies towards its domestic AI chip alternatives. However, some experts have speculated that Beijing is using Nvidia's market access as leverage in trade negotiations or to push Washington for wider access to advanced semiconductors.Huang was in South Korea last month, during Trump's meeting with Chinese President Xi Jinping. Highly anticipated trade talks between the two leaders did not yield any concessions from either side on chip policy. According to The Wall Street Journal, Trump had initially sought to discuss a request by Huang to allow sales of a new generation of AI chips to China. However, top officials rallied against the idea, the Journal reported, citing anonymous current and former administration officials familiar with the matter.Now that Nvidia's access to China remains frozen, it appears Huang is shifting his attention to other matters he considers essential to Nvidia's growth and the AI race. In the interview with the FT, Huang reportedly expressed concerns that the West, including the U.S, was being held back by \"cynicism\" and excessive regulation — contrasting that with China's energy subsidies aimed at lowering costs for local developers using domestic chips.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia's Jensen Huang softens his ‘China will win the AI race’ remark to FT",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222120-17623850772025-11-05t232015z_1107606753_rc2lqhan43vc_rtrmadp_0_britain-royals-king.jpeg?v=1762385223&w=1920&h=1080"
      ],
      "datePublished": "2025-11-06T09:04:56.000Z",
      "dateModified": "2025-11-06T09:04:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Job cuts in October hit highest level for the month in 22 years, Challenger says",
    "url": "https://www.cnbc.com/2025/11/06/job-cuts-in-october-hit-highest-level-for-the-month-in-22-years-challenger-says.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203774-1758802270042-gettyimages-2231677197-US_JOBS.jpeg?v=1758802638&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-06T12:26:08.000Z",
    "description": "Jobseekers during a NYS Department Of Labor job fair at the Downtown Central Library in Buffalo, New York, US, on Wednesday, Aug. 27, 2025. Lauren Pet",
    "body": "Jobseekers during a NYS Department Of Labor job fair at the Downtown Central Library in Buffalo, New York, US, on Wednesday, Aug. 27, 2025. Lauren Petracca | Bloomberg | Getty ImagesLayoff announcements soared in October as companies recalibrated staffing levels during the artificial intelligence boom, a sign of potential trouble ahead for the labor market, according to outplacement firm Challenger, Gray & Christmas.Job cuts for the month totaled 153,074, a 183% surge from September and 175% higher than the same month a year ago. It was the highest level for any October since 2003.\"Like in 2003, a disruptive technology is changing the landscape,\" said Andy Challenger, workplace expert and chief revenue officer at the firm. \"At a time when job creation is at its lowest point in years, the optics of announcing layoffs in the fourth quarter are particularly unfavorable.\"The report provides a glimpse into the labor market at a time when the government has suspended data gathering and releases during the shutdown in Washington, D.C.To be sure, the Challenger monthly numbers can be highly volatile, and an accelerated pace of layoffs has yet to show up in state-level weekly jobless claim filings that continue to come in despite the shutdown. Payrolls processing firm ADP reported that October saw net job growth of 42,000 in October, reversing two consecutive months of losses in the private sector.However, the report comes at a time when Federal Reserve officials have expressed concern about a softening labor market. The central bank has lowered its benchmark interest rate twice since September and is expected to approve another quarter percentage point reduction in December as policymakers look to get ahead of any more serious problems.The Challenger reports the highest level of layoffs coming from the technology sector amid a time of restructuring due to AI integration. Companies in the sector announced 33,281 cuts, nearly six times the level in September.Consumer products also saw a sharp gain to 3,409, while nonprofits, an area hit hard by the shutdown, listed 27,651 cuts year to date, up 419% from the same point in 2024.In total, companies have announced 1.1 million cuts this year, a 65% increase from a year ago and the highest level since the Covid pandemic year of 2020. October saw the highest total for any month in the fourth quarter since 2008.\"Some industries are correcting after the hiring boom of the pandemic, but this comes as AI adoption, softening consumer and corporate spending, and rising costs drive belt-tightening and hiring freezes. Those laid off now are finding it harder to quickly secure new roles, which could further loosen the labor market,\" Challenger said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Job cuts in October hit highest level for the month in 22 years, Challenger says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108203774-1758802270042-gettyimages-2231677197-US_JOBS.jpeg?v=1758802638&w=1920&h=1080"
      ],
      "datePublished": "2025-11-06T12:26:08.000Z",
      "dateModified": "2025-11-06T12:26:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lucid misses Wall Street expectations, narrows production guidance",
    "url": "https://www.cnbc.com/2025/11/05/lucid-lcid-earnings-q3-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107420148-1716586096525-gettyimages-2154514894-js1_9845_axy5pfiz.jpeg?v=1762373980&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-05T23:27:40.000Z",
    "description": "Brand new Lucid electric cars sit parked in front of a Lucid Studio showroom in San Francisco on May 24, 2024.Justin Sullivan | Getty ImagesDETROIT – ",
    "body": "Brand new Lucid electric cars sit parked in front of a Lucid Studio showroom in San Francisco on May 24, 2024.Justin Sullivan | Getty ImagesDETROIT – Lucid Group missed Wall Street's expectations for a second consecutive quarter as the all-electric vehicle maker continues to address problems with the launch of its new flagship Gravity SUV.The company, for a second consecutive quarter, also cut the high end of its annual production guidance to around 18,000 vehicles from a previous forecast of between 18,000 and 20,000 units. Its original target for this year was 20,000 units. It also reduced the low end target of its capital expenditures by $100 million to between $1 billion and $1.2 billion.Here's how the company performed in the third quarter, compared with average estimates compiled by LSEG:Loss per share: $2.65 adjusted vs. a loss of $2.27 expectedRevenue: $336.6 million vs. $379.1 million expectedLucid reported a net loss for the quarter of $978.4 million, or $3.31 per share, compared with a net loss of $992.5 million, or $4.09 per share, in the same period last year. Adjusting for one-time items including restructuring, the company lost $2.65 a share.The company's adjusted earnings before interest, taxes, depreciation and amortization was a loss of $717.7 million vs. an expected loss of $597.4 million, according to estimates compiled by StreetAccount. That loss widened year-over-over by 17%. Its quarterly revenue increased roughly 68% from $200 million a year earlier. Its quarterly revenue increased roughly 68% from $200 million a year earlier.In addition to releasing its third-quarter results, Lucid said it has agreed to increase a delayed draw term loan credit facility from $750 million to roughly $2 billion from Saudi Arabia's Public Investment Fund, the company's largest shareholder.The company reported total liquidity of $5.5 billion to end the quarter, including the undrawn credit line. Its cash and cash equivalents were roughly flat from the end of last year at $1.6 billion, with a total financial runway into the first half of 2027, the company said.Lucid also said it continues to evaluate finance and liquidity options outside of the PIF as it launches its Gravity SUV and develops an upcoming midsize vehicle, which isn't expected to start production until at least late next year.An autonomous robotaxi from Uber's partnership with Lucid and autonomous vehicle startup, Nuro.Courtesy: Nick Twork | LucidRegarding Gravity, Lucid interim CEO Marc Winterhoff said the company \"remains intensely focused on ramping up production and addressing the significant supply chain disruptions impacting the entire industry.\"During the company's last quarterly results in August, Winterhoff admitted there were problems with Gravity, saying the company planned to significantly increase production during the second half of the year.Winterhoff told investors Wednesday that the company continues to believe it can achieve a significant increase in Gravity deliveries during the fourth quarter, despite the supply chain issues and an industrywide slowdown in EV demand. Lucid CFO Taoufiq Boussaid said Gravity production increased quarter-to-quarter but remains at an unmeaningful level.The earnings results come roughly a month after Lucid reported third-quarter vehicle deliveries of 4,078 units, which increased from a year earlier but also fell slightly short of Wall Street expectations.Lucid has made several partnership announcements this year. In July, it signed a $300 million deal with Uber that included the ride-hailing platform acquiring and deploying more than 20,000 Lucid Gravity SUVs over the next six years that will be equipped with autonomous vehicle technology from startup Nuro. More recently, it announced an expanded partnership with Nvidia for autonomous vehicle technologies.Lucid's results are in stark contrast to fellow pure EV company Rivian Automotive, which on Tuesday reported third-quarter earnings and revenue that topped Wall Street expectations and drove the stock price up during intraday trading Wednesday.Shares of Rivian — following near-record gains Wednesday — are up roughly 16% in 2025, while Lucid remains off more than 40%, including a 1-for-10 reverse stock split this summer.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lucid misses Wall Street expectations, narrows production guidance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107420148-1716586096525-gettyimages-2154514894-js1_9845_axy5pfiz.jpeg?v=1762373980&w=1920&h=1080"
      ],
      "datePublished": "2025-11-05T23:27:40.000Z",
      "dateModified": "2025-11-05T23:27:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eli Lilly to start late-stage trials on amylin obesity drug after it shows up to 20% weight loss in study ",
    "url": "https://www.cnbc.com/2025/11/06/eli-lilly-amylin-obesity-drug-study-weight-loss-trials.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108184894-17550206822025-08-12t173750z_397057516_rc26lz9i31dr_rtrmadp_0_usa-texas-eli-lilly.jpeg?v=1758034387&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-06T11:50:41.000Z",
    "description": "Eli Lilly Biotechnology Center is shown in San Diego, California, March 1, 2023.Mike Blake | ReutersEli Lilly on Thursday said it will start late-stag",
    "body": "Eli Lilly Biotechnology Center is shown in San Diego, California, March 1, 2023.Mike Blake | ReutersEli Lilly on Thursday said it will start late-stage trials on its experimental amylin obesity drug next month after it showed encouraging results in a mid-stage study.The highest dose of the weekly injection, called eloralintide, helped patients with obesity or who are overweight lose 20.1% of their body weight on average at 48 weeks. The results support the pharmaceutical giant's efforts to bring next-generation treatments to the blockbuster weight loss drug market, and solidify its dominance in the segment. The data bolsters Eli Lilly's chances of bringing a strong competitor to the red-hot amylin space, in particular. Many industry analysts view so-called amylin analogs as the next wave of obesity treatments that could serve as an alternative or complementary option to existing injections targeting gut hormone GLP-1. Several large drugmakers such as Roche and AbbVie have shelled out billions to buy or license experimental amylin treatments, and Novo Nordisk is developing its own drugs. Novo Nordisk — Eli Lilly's chief rival in the obesity market — and Pfizer are also in the midst of a heated takeover war over Metsera, whose pipeline includes a potential once-monthly amylin drug. Amylin analogs mimic a hormone co-secreted with insulin in the pancreas to suppress appetite and reduce food intake. Amylin treatments have a similar effect to GLP-1s like Lilly's Zepbound and Mounjaro, but some analysts and researchers say it could be easier for patients to tolerate and help them preserve lean muscle mass. The lowest dose of Eli Lilly's injection helped people lose 9.5% of their weight at 48 weeks, compared to 0.4% among those who received a placebo. Patients who used a two-step dose escalation – starting at a 6 milligram dose and increasing to a 9 milligram dose – lost 19.9% of their weight at 48 weeks. People who used a three-step dose escalation that started at 3 milligrams lost 16.4% of their weight.The most common side effects of the injection were mild to moderate gastrointestinal symptoms and fatigue, which were observed more frequently in patients who took higher doses of the drug, according to Eli Lilly. Patients in groups that gradually increased doses of the drug saw lower side effects. The company has yet to release detailed data on side effect rates and how many patients discontinued the treatment during the trial. Eli Lilly will present the data at the ObesityWeek scientific conference in Atlanta on Thursday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eli Lilly to start late-stage trials on amylin obesity drug after it shows up to 20% weight loss in study ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108184894-17550206822025-08-12t173750z_397057516_rc26lz9i31dr_rtrmadp_0_usa-texas-eli-lilly.jpeg?v=1758034387&w=1920&h=1080"
      ],
      "datePublished": "2025-11-06T11:50:41.000Z",
      "dateModified": "2025-11-06T11:50:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tesla sales in Germany have cratered from last year, data shows",
    "url": "https://www.cnbc.com/2025/11/05/tesla-musk-germany-sales-down.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107386817-1710334926425-gettyimages-2074363429-GERMANY_MUSK.jpeg?v=1734719862&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-05T19:30:26.000Z",
    "description": "Elon Musk, CEO of Tesla Inc., arrives at the Tesla plant in Gruenheide, Germany, on March 13, 2024.Krisztian Bocsi | Bloomberg | Getty ImagesTesla sol",
    "body": "Elon Musk, CEO of Tesla Inc., arrives at the Tesla plant in Gruenheide, Germany, on March 13, 2024.Krisztian Bocsi | Bloomberg | Getty ImagesTesla sold just 750 electric vehicles in Germany for October 2025, less than half of what it sold a year ago, according to data out Wednesday from the country's federal transport authority, known as KBA.In October last year, Tesla sold 1,607 EVs in Germany.KBA data shows 434,627 new battery electric vehicles year to date, the KBA data said, up nearly 40% from the same period last year. Of those EVs, 15,595 were Teslas, a decline of 50% for Elon Musk's automaker this year.Tesla operates a massive vehicle assembly plant in Brandenburg, Germany, which is outside of Berlin, but the company is not a hometown favorite.Musk's incendiary political rhetoric and endorsement of AfD, Germany's extremist, anti-immigrant party, have weighed on left-leaning consumers' interest in the Tesla brand there.Read more CNBC tech newsAmazon upheaval: With morale shaken, Jassy looks for next big play after mass layoffsArmis raises $435 million, valuing cybersecurity startup at $6.1 billionChinese EV maker Xpeng to launch robotaxis, humanoid robots with self-developed AI chipsTrump renominates Musk ally Jared Isaacman to run NASA months after withdrawalTesla also faces a passel of European and Chinese competitors throughout Europe offering smaller and more affordable EVs, many priced below 35,000 euros.During October, Tesla began selling a new, lower-cost version of its Model Y SUV in Germany. The stripped-down version of the SUV was priced at 39,990 euros for the German market -- about 5,000 euros lower than the cheapest, previously available versions of the Model Y there.It remains to be seen whether Tesla's new, lower-priced model variants can help revitalize demand for their EVs in Germany or Europe.Policy changes ahead may lift EV sales in Germany, overall.Germany scrapped incentives to boost purchases of fully electric vehicles about two years ago, a policy change that led to a sharp drop in demand for fully electric vehicles, initially. The country is now poised to start up a new EV incentive program that goes into effect in January 2026, and is intended to help lower- and middle-income buyers adopt zero tailpipe emission vehicles.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tesla sales in Germany have cratered from last year, data shows",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107386817-1710334926425-gettyimages-2074363429-GERMANY_MUSK.jpeg?v=1734719862&w=1920&h=1080"
      ],
      "datePublished": "2025-11-05T19:30:26.000Z",
      "dateModified": "2025-11-05T19:30:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump nuclear power investment in Westinghouse could lead to IPO with U.S. government as shareholder",
    "url": "https://www.cnbc.com/2025/11/05/westinghouse-cameco-brookfield-trump-nuclear-ap1000.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107159026-1669822107322-gettyimages-526258454-img_6728.jpeg?v=1669982401&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-05T18:14:57.000Z",
    "description": "The Vogtle nuclear power plant is located in Burke County, near Waynesboro, Georgia in USA. Each of the two existing units have a Westinghouse pressur",
    "body": "The Vogtle nuclear power plant is located in Burke County, near Waynesboro, Georgia in USA. Each of the two existing units have a Westinghouse pressurized water reactor (PWR), with a General Electric turbine and electric generator, producing approximately 2,400 MW of electricity. Two Westinghouse made AP 1000 reactors are under construction here.Pallava Bagla | Corbis News | Getty ImagesThe Trump administration's plan to spend tens of billions of dollars on Westinghouse nuclear plants could transform it into an independent, publicly traded company with the U.S. government as a major shareholder.The Commerce Department signed a deal last week with Westinghouse owners Cameco and Brookfield Asset Management to spend $80 billion to build the company's nuclear plants across the U.S.Under the deal, the U.S. government is granted a participation interest in Westinghouse and can require an initial public offering on or before January 2029 if the company's value surges to $30 billion or more.The government could become an 8% shareholder in Westinghouse under this scenario, said Cameco Chief Operating Officer Grant Isaac on the company's third-quarter earnings call Wednesday. It is not entitled to a stake in Cameco or Brookfield under the deal, Isaac said.Cameco would consider spinning out Westinghouse as an independent company in 2029 depending on the circumstances, the executive said.\"There is definitely a unique interest in investing just in Westinghouse,\" Isaac said. \"Cameco is a funny proxy for that. Brookfield's probably an even funnier proxy to invest in just Westinghouse.\"Cameco is one of the largest uranium miners in the world and Brookfield is one of the biggest investors in energy generation.\"We're going to keep all options on the table,\" Isaac said. \"This partnership agreement does not force us to leave Westinghouse in 2029. We don't have to sell any of our share — or we may if the value of Westinghouse is so significant come 2029 when that window opens up.\"U.S. government financingThe government's interest in Westinghouse vests only if it makes a final investment decision with definitive agreements to build new reactors in the U.S. with a total value of $80 billion.The U.S. could use tools like Department of Energy loans or financing from \"other jurisdictions\" to finance the projects among other options, Isaac said.\"We're assured that there is a lot of interest in investing this minimum $80 billion in order to begin the process,\" the executive said.Westinghouse has designed a big modern nuclear reactor called the AP1000 that the Trump administration wants to deploy across the U.S. to meet rising electricity demand from data centers and manufacturing. It generates a gigawatt of electricity, which is enough power for more than 750,000 homes.President Donald Trump signed an executive order in May that called for the U.S. to start construction on 10 large new nuclear reactors by 2030. Westinghouse CEO Dan Sumner said in July that the company would meet Trump's call with the AP1000.But Westinghouse has struggled in the past to deliver the AP1000 on time and on budget. It went bankrupt in 2017 from cost overruns at big nuclear projects in Georgia and South Carolina.The first two AP1000 reactors in the U.S. came online at Plant Vogtle in Georgia in 2023 and 2024 but the South Carolina project was canceled.Westinghouse was bought by Brookfield and Cameco in 2023, five years after it emerged from bankruptcy. Brookfield has a 51% stake in Westinghouse and Cameco owns 49% of it.The nuclear industry needs a big order of reactors to stimulate the market and supply chains, Isaac said. The U.S. government is serving that role, the executive said.\"What the U.S. government has done is committed to step in and be that stimulant if you will, their commitment is to facilitate the financing,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump nuclear power investment in Westinghouse could lead to IPO with U.S. government as shareholder",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107159026-1669822107322-gettyimages-526258454-img_6728.jpeg?v=1669982401&w=1920&h=1080"
      ],
      "datePublished": "2025-11-05T18:14:57.000Z",
      "dateModified": "2025-11-05T18:14:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Qualcomm reports earnings, revenue beat and issues strong forecast",
    "url": "https://www.cnbc.com/2025/11/05/qualcomm-qcom-q4-2025-earnings-report.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217424-17615920782025-05-19t074654z_735119456_rc2vkea7nsnk_rtrmadp_0_taiwan-computex-qualcomm.jpeg?v=1761592149&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-05T21:22:12.000Z",
    "description": "Qualcomm CEO Cristiano Amon delivers a keynote speech at Computex in Taipei, Taiwan May 19, 2025. Ann Wang | ReutersQualcomm reported fiscal fourth-qu",
    "body": "Qualcomm CEO Cristiano Amon delivers a keynote speech at Computex in Taipei, Taiwan May 19, 2025. Ann Wang | ReutersQualcomm reported fiscal fourth-quarter results on Wednesday that beat analyst estimates on the top and bottom lines.Here's how the company did, compared with estimates from analysts polled by LSEG:Earnings per share: $3.00 adjusted vs. $2.88 expectedRevenue: $11.27 billion vs. $10.79 billion expectedRevenue rose 10% from $10.24 billion a year earlier, Qualcomm said in a statement. Due to an income tax expense, the company recorded a net loss of $3.12 billion, or $2.89 a share, after reporting net income a year earlier of $2.92 billion, or $2.59 per share.For the fiscal first quarter, Qualcomm said it expects revenue of $11.8 billion to $12.6 billion, or $12.2 billion at the middle of the range. That exceeded the average analyst estimate of $11.62 billion, according to LSEG. Adjusted EPS will be $3.30 to $3.50, the company said, while analysts expected earnings of $3.31 per share.The company has long been a dominant provider of mobile phone chips, including the central processor and modem for high-end devices made by Samsung and modems for Apple iPhones.Qualcomm expects to lose Apple as a customer for its modem business in the coming years, and has been working to diversify by making chips for other devices such as Windows PCs and virtual-reality headsets and smart glasses from Meta.But the biggest opportunity is in artificial intelligence, where Nvidia has run away with the processor market and Advanced Micro Devices is trying to play catchup.Last week, Qualcomm announced that it will release new AI accelerator chips, a disclosure that boosted the stock 11%. Qualcomm said that both the AI200, which will go on sale in 2026, and the AI250, planned for 2027, can come in a system that fills up a full, liquid-cooled server rack.Nvidia and AMD offer their graphics processing units, or GPUs, in full-rack systems that allow as many as 72 chips to act as one computer. AI labs need that computing power to run the most advanced models.Qualcomm shares are up 17% for the year as of Wednesday's close, trailing the Nasdaq's 22% gain. Nvidia and AMD, meanwhile, are up 45% and 112%, respectively.Revenue in Qualcomm's handsets business rose 14% to $6.96 billion in the latest quarter. Sales in the automotive unit increased 17% to $1.05 billion. Qualcomm reports its Meta revenue under its Internet of Things (IoT) division, which had $1.81 billion in sales during the quarter, up 7% from a year earlier. All three of those segments topped estimates, according to StreetAccount. Qualcomm's licensing business saw revenue slide 7% from a year ago to $1.41 billion, also beating analyst expectations. WATCH: Qualcomm CEO on new AI chipswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Qualcomm reports earnings, revenue beat and issues strong forecast",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217424-17615920782025-05-19t074654z_735119456_rc2vkea7nsnk_rtrmadp_0_taiwan-computex-qualcomm.jpeg?v=1761592149&w=1920&h=1080"
      ],
      "datePublished": "2025-11-05T21:22:12.000Z",
      "dateModified": "2025-11-05T21:22:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Doordash stock sinks 9% as company misses earnings, says it expects further spending",
    "url": "https://www.cnbc.com/2025/11/05/doordash-stock-dash-q3-2025-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108181891-1754417500004-gettyimages-2213188946-DOORDASH_DELIVERY.jpeg?v=1762378572&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-05T23:12:12.000Z",
    "description": "A DoorDash bag on a bicycle in New York, US, on Tuesday, May 6, 2025. Yuki Iwamura | Bloomberg | Getty ImagesDoorDash reported third-quarter earnings ",
    "body": "A DoorDash bag on a bicycle in New York, US, on Tuesday, May 6, 2025. Yuki Iwamura | Bloomberg | Getty ImagesDoorDash reported third-quarter earnings that missed analyst expectations and said it expects to spend \"several hundred million dollars\" on new initiatives and development in 2026.The stock sank 9% following the report.Here's how the company did compared to LSEG estimates:Earnings: 55 cents per share vs 69 cents per share expectedRevenue: $3.45 billion vs $3.36 billion expected.\"We wish there was a way to grow a baby into an adult without investment, or to see the baby grow into an adult overnight, but we do not believe this is how life or business works,\" the company wrote in its earnings release to explain the boosted spending.DoorDash said it is developing a new global tech platform that progressed in 2025 but is expected to accelerate in 2026, noting the direct and opportunity costs in the near term. The company announced its Dot autonomous delivery robot in September.The food delivery platform's revenue increased 27% from a year earlier.DoorDash posted net income of $244 million, or 55 cents per share, in Q3, up from $162 million, or 38 cents per share, a year ago.Read more CNBC tech newsAmazon upheaval: With morale shaken, Jassy looks for next big play after mass layoffsArmis raises $435 million, valuing cybersecurity startup at $6.1 billionChinese EV maker Xpeng to launch robotaxis, humanoid robots with self-developed AI chipsTrump renominates Musk ally Jared Isaacman to run NASA months after withdrawalTotal orders grew 21% over the prior year to 776 million during the quarter that closed Sept. 30, just above the 770.13 million expected by FactSet.The company expects Adjusted EBITDA for the fourth quarter in the range of $710 million to $810 million, a midpoint of $760 million. Analysts polled by FactSet expected $806.8 million for Q4.DoorDash closed its acquisition of British food delivery company Deliveroo on Oct. 2, a deal that valued the UK company at about $3.9 billion.The company expects a depreciation and amortization expense of $700 million for the fiscal year, exclusive of the acquisition. A stock-based compensation expense of $1.1 billion is also expected for fiscal 2025.DoorDash expects Deliveroo to add $45 million to adjusted EBITDA in Q4 and about $200 million to adjusted EBITDA in 2026.Stock Chart IconStock chart iconDoordash one-day stock chart.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Doordash stock sinks 9% as company misses earnings, says it expects further spending",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108181891-1754417500004-gettyimages-2213188946-DOORDASH_DELIVERY.jpeg?v=1762378572&w=1920&h=1080"
      ],
      "datePublished": "2025-11-05T23:12:12.000Z",
      "dateModified": "2025-11-05T23:12:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chinese autonomous driving firm Pony.ai sees shares drop 12% in Hong Kong debut ",
    "url": "https://www.cnbc.com/2025/11/06/china-ponyai-weride-ipo-shares-market-debut.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108051023-1729609719251-Image_3.jpg?v=1745568971&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-06T09:23:19.000Z",
    "description": "A Pony.ai autonomous car.Pony.aiChina's Pony.ai on Thursday saw its shares drop over 12%, while rival WeRide fell nearly 13% as the autonomous driving",
    "body": "A Pony.ai autonomous car.Pony.aiChina's Pony.ai on Thursday saw its shares drop over 12%, while rival WeRide fell nearly 13% as the autonomous driving companies began trading in Hong Kong.Pony.ai and WeRide, which are already listed in the U.S., raised 6.71 billion Hong Kong dollars (about $860 million) and HK$2.39 billion, respectively, in their initial public offerings.The companies are striving to keep pace with larger competitors such as Baidu's Apollo Go in China and Alphabet's Waymo in the U.S. amid growing interest in autonomous technologies.Pony.ai and WeRide, both headquartered in Guangzhou, China, stated that funds would go toward scaling efforts, and the development of Level 4 autonomous driving — a measure of driving automation that does not require human monitoring or intervention under specific environments. WeRide CEO Tony Xu Han told CNBC that proceeds from the latest fundraising would also be used to boost the company's artificial intelligence capabilities and data center capacity, while Pony.ai CEO James Peng emphasized on building autonomous-driving parking and charging infrastructure, besides AI development.The CEOs stressed on driver safety as their companies seek global expansion, including in their home markets of China, where they have already begun operating fully autonomous robotaxis in some cities. New regions the companies are expanding to include the Middle East, Europe and Asian countries such as Singapore. They have yet to receive full approvals to operate their robotaxis in most of those regions.The permits that both companies have received to test and operate their self-driving vehicles became a contentious issue in the lead up to the listings.According to local Chinese media reports, WeRide CFO Li Xuan claimed last week that Pony.ai had misinformed investors by understating the number of cities where WeRide had operations, among other issues.Pony.ai did not immediately respond to a request for comment on the matter.In the U.S., both companies are aiming for a partnership with California-based Uber to allow them to deploy their robotaxis on the firm's ride-hailing platform after receiving regulatory approval.  However, their U.S. plans face headwinds as earlier this year the government finalized a rule effectively banning Chinese technology in connected vehicles, including self-driving systems. \"With the uncertainty in the markets around the world and the fact that there would be intense scrutiny on a Pony or WeRide trying to enter the U.S. market, a dual listing is a lot about risk mitigation,\" said Tu Le, founder and managing director at Sino Auto Insights. He added that the listings were also an acknowledgement that it's gonna take a lot of capital and an endorsement of a market outside the U.S. for Pony.ai and WeRide to succeed.The two companies' weak performance in Hong Kong follows declines in New York, where WeRide shares dropped 5.2% and Pony.ai fell 2% on Wednesday.Hong Kong IPO shiftPony.ai and WeRide's competing listings highlight a recent trend of Chinese companies seeking dual listings in Hong Kong in what has been a bounce-back year for the city's IPO market.  The companies received approval from Hong Kong regulators to dual list in mid-October. \"For the HK stock exchange, clustering the listing at the same time helps to reinforce investor perception of HK as a tech-hub for Asia-focused technology companies,\" Rolf Bulk, equity research analyst at New Street Research told CNBC. In May, Chinese battery manufacturer and technology company CATL completed a secondary listing in Hong Kong, raising $5.2 billion in the world's largest IPO so far this year.The growing trend emerges amid geopolitical tensions and regulatory uncertainty in the U.S. According to New Street Research's Bulk, the Hong Kong listings for Pony.ai and WeRide will help the companies gain access to Asia-based capital and expand their presence in China and the region.\"However, it will do nothing to advance the progress of their technology stack and regulatory approvals in Western markets. If anything, gaining approval in Western markets may be more challenging with a HK secondary listing,\" he added. The listings could also help the firms keep up with competitors such as Baidu's Apollo Go in China and Alphabet's Waymo in the U.S., which currently have larger fleets. \"Pony and WeRide are right up there among the global leaders,\" said Sino Auto Insights' Le. \"WeRide has diversified their service portfolio a bit more but they both see Uber and the Middle East as two viable partners in their ability to get more pilots launched outside of China.\"\"Investors should pay special attention to how their technology evolves with AI and other new tools becoming more mainstream,\" Le said.— CNBC's Elaine Yu and Anniek Bao contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chinese autonomous driving firm Pony.ai sees shares drop 12% in Hong Kong debut ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108051023-1729609719251-Image_3.jpg?v=1745568971&w=1920&h=1080"
      ],
      "datePublished": "2025-11-06T09:23:19.000Z",
      "dateModified": "2025-11-06T09:23:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Snap shares rocket 15% on strong forecast, $400 million Perplexity deal",
    "url": "https://www.cnbc.com/2025/11/05/snap-q3-earnings-report-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108169683-1752081473114-untitled-656-3.jpg?v=1754423864&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-06T01:37:25.000Z",
    "description": "Evan Spiegel, CEO of Snap Inc., attends the annual Allen and Co. Sun Valley Media and Technology Conference at the Sun Valley Resort in Sun Valley, Id",
    "body": "Evan Spiegel, CEO of Snap Inc., attends the annual Allen and Co. Sun Valley Media and Technology Conference at the Sun Valley Resort in Sun Valley, Idaho, on July 9, 2025.David A. Grogan | CNBCSnap shares climbed 15% on Wednesday after the company issued its third-quarter earnings, reporting revenue that beat analysts expectations and a $500 million stock repurchase program.Here is how the company did compared with Wall Street's expectations:Earnings per share: Loss of 6 cents. That figure is not comparable to analysts' estimates.Revenue: $1.51 billion vs. $1.49 billion expected, according to LSEG Global daily active users: 477 million vs. 476 million expected, according to StreetAccountGlobal average revenue per user (ARPU): $3.16 vs. $3.13 expected, according to StreetAccountSnap also announced that it is partnering with the startup Perplexity AI, which \"will integrate its conversational search directly into Snapchat.\" The feature is set to appear in Snapchat starting in early 2026, Snap said.\"Perplexity will pay Snap $400 million over one year, through a combination of cash and equity, as we achieve global rollout,\" Snap said in a letter to investors. \"Revenue from the partnership is expected to begin contributing in 2026.\"The partnership represents \"a first step in Snap's effort to make Snapchat a platform where leading AI companies can connect with its global community in creative and trusted ways,\" the two companies said in their announcement.In the company's earnings call, Snap CEO Evan Spiegel said Perplexity will have \"default placement in our chat inbox\" and the startup will \"control the responses from their chatbot inside of Snapchat.\" Although Snap will not be selling \"advertising against the Perplexity responses,\" Spiegel said that the integration \"will help Perplexity drive additional subscribers, which I think is something that will be valuable to their business.\"\"We have a really unique opportunity ahead to help distribute AI agents through our chat interface,\" Spiegel said.While Snapchat users will still be able to engage with the company's My AI chatbot, the integrated Perplexity AI service will provide them with \"real-time answers from credible sources and explore new topics within the app,\" the companies said.Regarding Snap's expensive foray into developing augmented reality glasses, Spiegel said the company plans to create a separate subsidiary around the Specs AR glasses to speed up development with partners.Snap said fourth-quarter sales will come in between $1.68 billion and $1.71 billion. That figure's midpoint of $1.695 billion is slightly ahead of Wall Street expectations of $1.69 billion.For the third quarter, Snap said sales grew 10% year over year while it logged a net loss of $104 million. During the same quarter last year, Snap recorded a net loss of $153 million.The Snapchat parent said that third-quarter adjusted earnings before interest, taxes, depreciation and amortization, or EBITDA, came in at $182 million, ahead of the $125 million that StreetAccount was projecting.The company also said that its adjusted EBITDA for the fourth quarter will be between $280 million and $310 million, which tops StreetAccount's projections of $255.4 million.Snap shares were down 32% for the year, as of Wednesday's close, compared to the Nasdaq's 22% gain.Although the company's shares soared as high as 25% in after-hours trading on Wednesday, they began their descent after Snap finance chief Derek Andersen detailed some of the company's sales-related challenges on the earnings call.\"The North America LCS segment remains the primary headwind to our overall revenue growth,\" said Andersen, adding that the company is seeing more growth and demand for Snap's ad products from small-to-medium sized businesses in other regions.In the letter to investors, Snap said that government regulations like Australia's social media minimum age bill and related policy developments \"are likely to have negative impacts on user engagement metrics that we cannot currently predict.\"\"While we remain committed to our goal of serving 1 billion global monthly active users, we expect overall DAU may decline in Q4 given these internal and external factors, and as noted above we expect particularly negative impacts in certain jurisdictions,\" Snap said in the letter.The Australian senate passed the bill in November 2024, and when the law comes into effect next month, companies like Facebook and Instagram parent Meta, TikTok and Snap will be penalized if they fail to adequately prevent children under 16 from possessing accounts on their respective platforms.Snap also said in the investor letter that the \"upcoming rollout of platform-level age verification\" from companies like Apple and Google could also negatively impact user metrics in the future.  Utah and California have signed online-child safety bills that put the onus on app store makers to verify user ages. Utah's law is set to fully take effect in May 2026.\"We are also preparing for the upcoming rollout of platform-level age verification, which will use new signals provided by Apple — and soon Google — to help us better determine the age of our users and remove those we learn are under 13,\" Snap said in the letter.Snap's warning to investors underscores how new laws, policies and regulations around the globe are beginning to impact tech firms.In the letter, Snap also said that some of its efforts to improve monetization, such as its Snapchat+ subscription service, could result in \"adverse impact on engagement metrics as these experiences are rolled out globally.\"Pinterest shares tanked on Tuesday after the company reported third-quarter results that missed on earnings per share and provided weaker-than-expected guidance. The company's finance chief Julia Donnelly told analysts that Pinterest expects \"broader trends and market uncertainty continuing with the addition of a new tariff in Q4 impacting the home furnishing category.\"Big tech companies like Meta, Alphabet and Amazon reported their latest quarterly earnings last week in which they posted solid digital advertising sales and hefty spending on AI-related computing infrastructure.The Facebook-parent saw third-quarter sales boom 26% year-over-year to $51.24 billion, while revenue in Amazon's online ad unit soared 24% year-over-year to $17.7 billion.Alphabet said that its total advertising revenue for the third quarter rose 13% year-over-year to $74.18 billion, while YouTube's online ad sales climbed 15% to $10.26 billion.Reddit said last Thursday that third-quarter sales surged 68% year-over-year to $585 million. The company's global daily active uniques increased 19% year-over-year to 116 million, surpassing estimates of 114 million. WATCH: It would be irresponsible of Zuckerberg to not spend on his network of properties, says Jim Cramer.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Snap shares rocket 15% on strong forecast, $400 million Perplexity deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108169683-1752081473114-untitled-656-3.jpg?v=1754423864&w=1920&h=1080"
      ],
      "datePublished": "2025-11-06T01:37:25.000Z",
      "dateModified": "2025-11-06T01:37:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Starbucks union authorizes open-ended strike as busy holiday season begins",
    "url": "https://www.cnbc.com/2025/11/05/starbucks-union-authorizes-open-ended-strike-as-holiday-season-begins.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218029-1761673249735-gettyimages-2243379737-AFP_82AY763.jpeg?v=1761673296&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-05T19:21:52.000Z",
    "description": "Starbucks baristas gather outside a Starbucks store as they protest against the company during a rally to demand a new contract in New York City, on O",
    "body": "Starbucks baristas gather outside a Starbucks store as they protest against the company during a rally to demand a new contract in New York City, on October 28, 2025. The Starbucks Workers United is fighting for a new contract that delivers improved staffing hours, take-home pay, and on-the-job protections for baristas. (Photo by TIMOTHY A.CLARY / AFP) (Photo by TIMOTHY A.CLARY/AFP via Getty Images)          Timothy A.clary | Afp | Getty ImagesStarbucks Workers United has authorized an open-ended strike that could begin on Red Cup Day, one of the coffee chain's biggest sales days of the year, the union announced Wednesday.The union is preparing to strike in more than 25 cities if it doesn't reach a collective bargaining agreement with Starbucks by Nov. 13, when Red Cup Day falls this year. The two parties have not been in active negotiations to reach a contract after talks between them fell apart late last year. Starbucks and the union entered into mediation in February, and hundreds of barista delegates voted down the economic package Starbucks proposed in April.The strike authorization won 92% of votes, according to Starbucks Workers United.The union is pushing for improved hours, higher wages and the resolution of hundreds of unfair labor practice charges levied against Starbucks.The strike would clash with Starbucks' annual giveaway of reusable red cups bearing the company's logo with any purchase. The freebie has become a collector's item for the coffee giant's biggest fans.Without an end date in sight, the strike would also disrupt Starbucks' broader holiday season, which falls during the company's fiscal first quarter and is one of the busiest times of the year for the coffee chain. Customers flock to its cafes for seasonal drinks like its peppermint mocha, along with gift cards and other merchandise.watch nowWorkers United, which began organizing at Starbucks in 2021, says it now represents more than 12,000 workers across more than 650 stores. (The company told CNBC that the union only represents workers at 550 cafes, accounting for some store closures over time.)In a statement, Starbucks said it will be ready to serve customers across its nearly 18,000 company-operated and licensed stores this holiday season.\"We are disappointed that Workers United, who only represents around 4% of our partners, has voted to authorize a strike instead of returning to the bargaining table. When they're ready to come back, we're ready to talk,\" Starbucks spokesperson Jaci Anderson said.Starbucks said any agreement with the union needs to reflect the reality that it \"already offers the best job in retail, including more than $30 an hour on average in pay and benefits for hourly partners. The facts show people like working at Starbucks. Partner engagement is up, turnover is nearly half the industry average, and we get more than 1 million job applications a year.\"The company is in the midst of a turnaround plan under new CEO Brian Niccol, dubbed \"Back to Starbucks,\" that has begun to show momentum. Starbucks reported in its fiscal fourth quarter that its same-store sales returned to growth for the first time in nearly two years. The coffee chain's global same-store sales rose 1%, lifted by international markets. Its U.S. same-store sales were flat for the quarter but turned positive in September. Starbucks also announced a $1 billion restructuring plan in September that involves closing some 500 of its North American stores, according to analyst estimates, and laying off 900 workers in nonretail roles. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Starbucks union authorizes open-ended strike as busy holiday season begins",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218029-1761673249735-gettyimages-2243379737-AFP_82AY763.jpeg?v=1761673296&w=1920&h=1080"
      ],
      "datePublished": "2025-11-05T19:21:52.000Z",
      "dateModified": "2025-11-05T19:21:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bank of England holds rates steady in narrow vote ahead of Autumn Budget",
    "url": "https://www.cnbc.com/2025/11/06/bank-of-england-rate-cut-a-close-call-ahead-of-the-autumn-budget.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108188385-1755684063698-gettyimages-2228182666-AFP_68YF7KY.jpeg?v=1759926556&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-06T12:21:34.000Z",
    "description": "LONDON — The Bank of England on Thursday voted narrowly to hold interest rates steady, exercising caution ahead of the government's Autumn Budget in N",
    "body": "LONDON — The Bank of England on Thursday voted narrowly to hold interest rates steady, exercising caution ahead of the government's Autumn Budget in November.Out of the BOE's nine-member monetary policy committee, five members voted to hold the key interest rate, known as Bank Rate, at 4%, while four opted for a 25 basis point cut.The vote was slimmer than expected with economists polled by Reuters expecting a 6-3 split in favor of a hold.The BOE said in a statement that the inflation rate, at 3.8% in September, had likely peaked and that a disinflationary trend was underway. This was \"supported by the still restrictive stance of monetary policy,\" it said.\"This is reflected in an easing of pay growth and services price inflation. Underlying disinflation is being underpinned by subdued economic growth and building slack in the labour market,\" the bank added.The BOE cautioned that future rate cuts \"will therefore depend on the evolution of the outlook for inflation. If progress on disinflation continues, Bank Rate is likely to continue on a gradual downward path.\"\"I think this is the doves winning the argument,\" Victoria Clarke, U.K. chief economist at Santander CIB, told CNBC Thursday. \"[BOE Governor Andrew] Bailey has made it clear he wants a bit more data and that was certainly my judgement, that there is a lot of value in waiting for December. You've got two more CPI [inflation] prints coming and two more labor market prints and, of course, this massive budget,\" she told CNBC's Decision Time. Yields on U.K. government bonds fell across the board, with the yield on the benchmark 10-year gilt shedding almost 3 basis points. Meanwhile the British pound trimmed earlier gains to trade 0.18% higher against the U.S. dollar.A Union flag flutters from a pole atop the Bank of England, in the City of London on August 7, 2025. Niklas Halle'n | Afp | Getty ImagesThe meeting on Thursday was the last one before the Autumn Budget later this month. Economists had said that while they believed the central bank was more likely to hold rates steady, it was not a given.\"We can never know for sure which way any meeting will go, but this one is ... one of the hardest to call for some time,\" Dean Turner, chief euro zone and U.K. Economist at UBS Global Wealth Management's Chief Investment Office, had said Tuesday.\"It's not a case of whether they will cut interest rates at some point — the answer to that is yes, we believe they will ... if policy is tight, inflation is falling, and growth is lacklustre, then interest rates are going to come down. The hard part is anticipating when,\" he added.Economists had forecast, for the most part, that a majority of the BOE's policymakers would vote to keep its key interest rate, known as Bank Rate, unchanged at 4% at its November meeting.There were some dissenters, however, with the likes of Barclays, Nomura, Mizuho and Unicredit believing there could be a surprise cut today, to 3.75%. Julien Lafargue, chief market strategist at Barclays Private Bank, conceded Wednesday that while there was a case for a rate cut, it was \"a very finely balanced decision.\"Cuts comingIn any case, there is a general consensus that rate-setters could trim rates as soon as December, and will cut again over the coming year in response to expected cooling inflation — the rate of which remained unchanged for the third consecutive month in September, at 3.8% — and a softening of labor market data.watch nowMost MPC members are more concerned about the implications of cutting rates too quickly rather than too slowly, Oxford Economics noted in analysis, and the BOE will want to see evidence of sustained downside surprises in the data and pay growth slowing to a target-consistent pace before voting to cut again.\"If we are right and the BOE pauses [this] week, the question will then turn to when the next cut will come,\" Allan Monks, chief U.K. economist at JP Morgan, said in a note.\"We have argued that further downside surprises in the inflation and labour market data will determine that. For example, a move up in the unemployment rate to 4.9% in September could be significant, as well as further soft sequential gains in core CPI services and private pay.\"Assuming the BOE does hold rates on Thursday, UBS' Turner said that he expects the central bank to then \"signal that a cut is coming no later than February — maybe as soon as December.\"\"Policymakers will not be armed with fresh forecasts in December, but they will have the budget and the impact analysis in their pockets,\" he said.Autumn BudgetThe fact the central bank's meeting this month comes ahead of the upcoming Autumn Budget on Nov. 26 is another reason for the BOE's policy makers to pause for thought.It's widely expected that Chancellor Rachel Reeves will announce tax rises as she looks to fill a fiscal black hole estimated to be anywhere between £20-50 billion ($20-$65.2 billion), based on assumed forecasts of lower productivity, servicing debt and the cost of U-turns on welfare spending cuts, among other things.Earlier this week Reeves gave a clearer indication that tax rises are coming and is she is expected to consider increasing income tax as one way to raise revenues, but she has not given any further detail. Tax rises would likely act as another damper on inflation by reducing consumer demand.watch now\"If the measures [in the budget] include a hike in income tax, they would add to the drag on households' real incomes from high inflation and slowing pay growth. As these factors weigh on demand inflation will likely ease,\" Andrew Wishart, economist at Berenberg, said in a note Friday.\"If so, this will allow the Bank of England to cut interest rates by 25 basis points at least twice next year to 3.50%. A front-loaded fiscal tightening would open the door to a third cut in 2026, to 3.25%,\" he added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bank of England holds rates steady in narrow vote ahead of Autumn Budget",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108188385-1755684063698-gettyimages-2228182666-AFP_68YF7KY.jpeg?v=1759926556&w=1920&h=1080"
      ],
      "datePublished": "2025-11-06T12:21:34.000Z",
      "dateModified": "2025-11-06T12:21:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New bipartisan bill would require companies to report AI job losses",
    "url": "https://www.cnbc.com/2025/11/05/ai-jobs-act-warner-hawley.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217887-17616658142025-10-28t153423z_829638327_rc23lhar6u0w_rtrmadp_0_amazon-com-layoffs.jpeg?v=1761665903&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-05T18:53:31.000Z",
    "description": "A pedestrian walks past Amazon Ireland corporate offices in Dublin, as Amazon.com, Inc., said on Tuesday it plans to cut its global corporate workforc",
    "body": "A pedestrian walks past Amazon Ireland corporate offices in Dublin, as Amazon.com, Inc., said on Tuesday it plans to cut its global corporate workforce by as many as 14,000 roles and seize the opportunity provided by artificial intelligence (AI), in Dublin, Ireland, Oct. 28, 2025. Damien Eagers | ReutersA new bipartisan bill seeks to provide a \"clear picture\" of how artificial intelligence is affecting the American workforce.Sens. Mark Warner, D-Va., and Josh Hawley, R-Mo., on Wednesday announced the AI-Related Job Impacts Clarity Act. It would require publicly traded companies, certain private companies and federal agencies to submit quarterly reports to the Department of Labor detailing any job losses, new hires, reduced hiring or other significant changes to their workforce as a result of AI.The data would then be compiled by the Department of Labor into a publicly available report.\"This bipartisan legislation will finally give us a clear picture of AI's impact on the workforce,\" Warner said in a statement. \"Armed with this information, we can make sure AI drives opportunity instead of leaving workers behind.\"The proposed legislation comes as politicians, labor advocates and some executives have sounded the alarm in recent years about the potential for widespread job loss due to AI.In May, Anthropic CEO Dario Amodei said that the AI tools that his company and others are building could eliminate half of all entry-level white-collar jobs and cause unemployment to spike up to 20% in the next one to five years. Anthropic makes the chatbot Claude. Layoffs have been announced recently at companies across the tech, retail, auto and shipping industries, with executives citing myriad reasons, from AI and tariffs to shifting business priorities and broader cost-cutting efforts. Job cuts announced at Amazon, UPS and Target last month totaled more than 60,000 roles.Some experts have questioned whether AI is fully to blame for the layoffs, noting that companies could be using the technology as cover for concerns about the economy, business missteps or cost cutting initiatives.WATCH: Is AI behind recent job cuts? Here's what to knowwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New bipartisan bill would require companies to report AI job losses",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217887-17616658142025-10-28t153423z_829638327_rc23lhar6u0w_rtrmadp_0_amazon-com-layoffs.jpeg?v=1761665903&w=1920&h=1080"
      ],
      "datePublished": "2025-11-05T18:53:31.000Z",
      "dateModified": "2025-11-05T18:53:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]