[
  {
    "title": "Bank of Japan raises economic growth forecasts ahead of snap election, holds rates at 0.75%",
    "url": "https://www.cnbc.com/2026/01/23/boj-rate-decision-snap-election-takaichi-gdp.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108039403-1727318530651-gettyimages-2163966308-AFP_367P9V3.jpeg?v=1741751211&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T04:16:16.000Z",
    "description": "A guide sign reading \"Bank of Japan\" is seen in Tokyo on July 31, 2024.Kazuhiro Nogi | Afp | Getty ImagesJapan's central bank on Friday raised economi",
    "body": "A guide sign reading \"Bank of Japan\" is seen in Tokyo on July 31, 2024.Kazuhiro Nogi | Afp | Getty ImagesJapan's central bank on Friday raised economic growth forecasts while holding its key policy rate at 0.75% as the country prepares to go into an election.  The Bank of Japan upgraded its economic growth forecast for the fiscal year ending in March 2026 to 0.9% from 0.7% in October 2025, and also raised its GDP expansion outlook for the 2026 fiscal year to 1% from 0.7%. The central bank expects Japan's economy grow moderately as other economies return to growth, and the BOJ sees a virtuous cycle of rising prices and wages, supported by government's economic measures and accommodative financial conditions.The central bank kept the benchmark interest rate steady in a split 8-1 decision, after raising it to the highest level in 30 years in December, ahead of snap polls that could see Prime Minister Sanae Takaichi sharpen her advocacy for monetary easing and fiscal support.In its statement, the BOJ revealed that board member Hajime Takata had proposed raising rates to 1%, saying that risks to prices in Japan were skewed to the upside. The bank in its outlook forecast inflation to fall below the 2% target in the first half of the year. Japan's December inflation data, released earlier in the day, showed headline price growth coming in at 2.1%, its lowest since March 2022, but still running above the BOJ's target of 2% for a 45th straight month.Japan embarked on the path to policy normalization in March 2024, abandoning the world's last negative interest rate regime, and has stressed on raising rates subject to a virtuous cycle of growth in wages and prices.That policy, however, has come under political pressure with prominent names including Takaichi advocating for softer rates to fuel economic growth. Japan's economy shrank more than initially estimated in the third quarter, contracting 0.6% quarter on quarter, and 2.3% on an annualized basis.Despite BOJ's monetary tightening, Japanese bond yields have been rising, hitting multidecade highs over the past month, driving capital outflows and weakening the yen. This comes as real rates still remain negative, according to the BOJ, and mounting fiscal worries.  Takaichi had planned a record $783 billion budget for the next fiscal year, starting April 1, on top of a $135 billion stimulus package last year targeted at helping households with the rising cost of living. Pressured by rising yields amid fiscal concerns, the yen has seen a significant decline against the dollar toward the end of last year, falling about 4.6% since Oct. 21, when Takaichi became prime minister to its current level of 158.97.This weakness prompted Finance Minister Satsuki Katayama to warn against \"one-sided\" moves in the currency. Katayama reportedly told reporters in Washington last week that she has conveyed her \"deep concern\" over the depreciation in yen and Treasury Secretary Scott Bessent shared her view on \"one-sided\" weakness in the Japanese currency. On Friday, she reportedly said that the bond market rout has appeared to have receded, and that she was closely monitoring financial markets with a \"high sense of urgency.\"Analysts from Dutch bank ING said before the rate decision that \"the markets will closely listen to Governor Ueda's assessment of how recent weakness in the JPY might affect inflation.\"Takaichi is set to dissolve Japan's Lower House later in the day, as Japan goes to polls in a snap election on Feb. 8. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bank of Japan raises economic growth forecasts ahead of snap election, holds rates at 0.75%",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108039403-1727318530651-gettyimages-2163966308-AFP_367P9V3.jpeg?v=1741751211&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T04:16:16.000Z",
      "dateModified": "2026-01-23T04:16:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "30-year-old American lives in Bahrain: Take a look inside her $2,200/month, 3-bedroom rental",
    "url": "https://www.cnbc.com/2026/01/22/american-in-bahrain-house-tour.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108251827-1768325203898-251210-mi-12-rel-mcghee-bahrain-radio-v400_06_32_17Still008.png?v=1768325341&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T18:58:12.000Z",
    "description": "The child of parents who both served in the U.S. Navy, much of Mikayla McGhee's early life was spent moving from military base to military base. McGhe",
    "body": "The child of parents who both served in the U.S. Navy, much of Mikayla McGhee's early life was spent moving from military base to military base. McGhee, 30, spent most of her time living abroad in Japan, which she says led her to realize she wanted to build a life for herself outside the United States.\"I was always working towards freedom, so I never knew exactly what I was going to do, but I knew I wanted the freedom to be able to live wherever I wanted to and travel whenever I wanted to,\" McGhee tells CNBC Make It.\"Once you've experienced growing up abroad and you're exposed to that, you continue to search for it. So moving back to the States after living in Japan, I always knew I wanted to live outside of the U.S. I just didn't know how.\"One of McGhee's amenities is having someone that takes care of the pool and landscaping.Prakhar Deep Jain for CNBC Make ItIn 2020, McGhee was living in Atlanta, Georgia, and went to visit her parents in Bahrain, where her dad was stationed at the time. The country is located in the Persian Gulf and is home to the Naval Support Activity, Bahrain, a U.S. military base. McGhee stayed in the country for three months and says she fell in love with it. As soon as she got back to Atlanta, she started planning a permanent move to Bahrain. \"The culture shock was that, actually, things were better, not worse. Don't just believe what you're told or what you see in the media because it's nothing like that at all,\" she says.\"It's so calm. It's so peaceful. There was never a time where I didn't feel like I fit in or I was standing out as an expat. Every culture shock was a positive one.\"McGhee's house now is close to Bahrain's capital of Manama.Prakhar Deep Jain for CNBC Make ItIn December 2022, McGhee moved to Bahrain and lived in her parents' three-bedroom home for six months before moving out on her own. After leaving her parents' house, McGhee lived in a two-bedroom apartment in a luxury high-rise building. She lived there for over a year. Now, McGhee lives near the capital of Bahrain, Manama, in a three-bedroom, four-and-a-half-bathroom home with a pool and one-car garage that rents for $2,200 USD a month.The house also has a laundry room and is fully fenced in. The cost of monthly rent includes what McGhee calls a \"watchman,\" or someone who comes by the house to clean the pool and take care of the landscaping. McGhee lives with her partner and she says he pays the majority of their expenses.Prakhar Deep Jain for CNBC Make ItAs a licensed realtor in Bahrain, McGhee conducted the housing search on her own and says she chose this one because of its proximity to the city center. She says she and her partner split expenses, though he pays the majority, while most of her money goes to savings and to the trips the couple take together. The couple signed a one-year lease last year and plan to renew another one-year lease this year too.McGhee works remotely as a senior performance marketing manager at an IT company, and has a dedicated space to work from home. She earns $140,000 a year, according to documents reviewed by CNBC Make It.Since McGhee earns her salary in USD, she still pays U.S. taxes. McGhee also uses the health insurance offered by her company, which allows her access to Bahrain's health-care system.McGhee's house has a private pool in the back.Prakhar Deep Jain for CNBC Make ItWhen McGhee has free time during the day, she says she likes to work out, shop for groceries and create content. She shares a lot of her life in Bahrain on TikTok to her more than 65,000 followers.\"It is my duty to make sure that Americans know how great this country is,\" McGhee says.Although McGhee isn't sure if she will stay in Bahrain long-term, she says she knows she wants to buy property around the country as a real estate investment and have a permanent place for herself there, too. \"My life is 10 times better here. My happiness has skyrocketed. Even the weather alone has increased my mood,\" she says.\"I will always want to have something that I can come back to, that I could call my home. Bahrain felt like home from the day I got here, so in order for me to leave, another place would need to do the same.\"Want to get ahead at work with AI? Sign up for CNBC's new online course, Beyond the Basics: How to Use AI to Supercharge Your Work. Learn advanced AI skills like building custom GPTs and using AI agents to boost your productivity today.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "30-year-old American lives in Bahrain: Take a look inside her $2,200/month, 3-bedroom rental",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108251827-1768325203898-251210-mi-12-rel-mcghee-bahrain-radio-v400_06_32_17Still008.png?v=1768325341&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T18:58:12.000Z",
      "dateModified": "2026-01-22T18:58:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You may soon be able to use a buy now, pay later plan for your rent—what to know",
    "url": "https://www.cnbc.com/2026/01/22/affirm-partnership-to-offer-buy-now-pay-later-plan-for-rent.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107370470-1707337997495-gettyimages-1325053161-me1a5141.jpeg?v=1769019939&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T18:47:23.000Z",
    "description": "Some renters will soon be able to pay their rent using a buy now, pay later plan through financial technology company Affirm, which offers installment",
    "body": "Some renters will soon be able to pay their rent using a buy now, pay later plan through financial technology company Affirm, which offers installment-based payment plans for consumers at a wide variety of retailers.Affirm will partner with fintech company Esusu to provide renters with \"a flexible option for managing one of their largest monthly expenses,\" an Affirm spokesperson said in a statement provided to CNBC Make It. Esusu offers memberships starting at $10 a month for services to help users build credit, including reporting rent payments to credit agencies. Eligible renters will be able to use Affirm through Esusu to pay their rent in two equal, biweekly payments with 0% interest and no late fees, the spokesperson said. The offering is rolling out through a pilot program, and the companies have not yet announced a launch date. Esusu's recently launched split pay option already allows its plus and premium membership subscribers to break up rent payments throughout the month after an initial down payment, according to its website. The partnership with Affirm will give Esusu members another option to split their rent into two payments. Plus and premium memberships, which cost $35 and $50 a month, respectively, are only available to residents at Esusu-partnered properties, according to its website.Nationally, rents in the U.S. were up about 3% in December 2025 compared with the previous year, according to Bureau of Labor Statistics data. And nearly half of all renters spent more than the recommended 30% of their income on housing costs in 2023, according to the most recent Census Bureau American Community Survey 1-year estimates.A new payment option won't solve the 'underlying affordability issue'Some financial experts are skeptical of using buy now, pay later plans for fixed costs like monthly rent.Using a buy now, pay later plan for rent \"could be useful in a true pinch or short-term emergency,\" says Chris Jackson, a certified financial planner based in South Carolina. However, \"relying on it consistently would be a mistake, particularly for people who already struggle keeping up with rent payments.\"Borrowing to cover your rent won't solve the \"underlying affordability issue,\" he adds. Douglas Boneparth, a CFP, founder of Bone Fide Wealth and member of CNBC's financial advisor council, encourages anyone struggling to pay rent to work directly with their landlord to work out a payment agreement, rather than turning to a lender.Boneparth has previously criticized installment plans for encouraging overspending and targeting consumers \"who are most susceptible to borrowing when they shouldn't,\" he wrote on LinkedIn in 2025. Using buy now, pay later plans for rent could be a \"slippery slope\" that has consumers \"falling into traps of fiscal irresponsibility,\" he says.Outside of temporary hardships or broader socio-economic conditions, \"we have to get down to those fundamentals and put yourself in a position to afford your lifestyle,\" Boneparth says.Affirm's spokesperson said the new offer will be \"a transparent option that offers flexibility for renters to align expenses with their paychecks.\" They added, \"We underwrite every application individually and we only approve people for what we believe they can responsibly afford to repay.\"Want to get ahead at work with AI? Sign up for CNBC's new online course, Beyond the Basics: How to Use AI to Supercharge Your Work. Learn advanced AI skills like building custom GPTs and using AI agents to boost your productivity today.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You may soon be able to use a buy now, pay later plan for your rent—what to know",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107370470-1707337997495-gettyimages-1325053161-me1a5141.jpeg?v=1769019939&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T18:47:23.000Z",
      "dateModified": "2026-01-22T18:47:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fed's main gauge shows inflation at 2.8% in November, edging further away from target",
    "url": "https://www.cnbc.com/2026/01/22/pce-inflation-november-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108075677-1739369585315-108075677-1734095016471-gettyimages-2188958076-ryder-amazon-8.jpg?v=1755285181&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T18:59:35.000Z",
    "description": "People shop at a Costco store in the Staten Island borough of New York City, U.S., Jan. 16, 2026.  Brendan McDermid | ReutersInflation drifted slightl",
    "body": "People shop at a Costco store in the Staten Island borough of New York City, U.S., Jan. 16, 2026.  Brendan McDermid | ReutersInflation drifted slightly further from the Federal Reserve's target in November though in line with expectations, according to the central bank's preferred gauge released Thursday.The personal consumption expenditures price index, a Commerce Department measure the central bank uses as its main forecasting tool, showed inflation at 2.8% for the month both for headline and core, in line with the Dow Jones consensus. In addition, the department's Bureau of Economic Analysis reported that the rate for October was 2.7% on both a headline and core basis, the latter excluding volatile food and energy prices.The monthly figures showed a 0.2% increase for both months. The BEA released the October and November numbers together due to impacts from the government shutdown during which official agencies suspended data collection and reports.In addition to the inflation figures, the report showed personal income up 0.1% in October and 0.3% in November, the latter 0.1 percentage point below the forecast. Also, personal consumption expenditures, a proxy for consumer spending, rose 0.5% in both months, matching the November forecast.The personal savings rate rose in November to 3.5%, down 0.2 percentage point from the prior month.Price figures for November reflected 0.2% increases in both goods and services. Food was flat while energy-related costs rose 1.9% and after falling 0.7% in October.The report comes the same day that the BEA said gross domestic product rose 4.4% in the third quarter, according to the second and final estimate. In addition, the Labor Department reported that jobless claims are trending around their lowest level in two years.Together, the data indicates an economy continuing to expand, with consumer spending ahead of inflation despite a somewhat softening labor market.\"The consumer continues to drive the U.S economy, with today's data pointing to another strong gain in spending. This resilience comes in spite of last year's slowdown in the labor market, and still elevated inflation, both of which have weighed on real incomes,\" said James McCann, senior economist for investment strategy at Edward Jones. \"Today's data should reassure the Fed that the economy remains on a solid footing, despite a cooler labor market.\"Markets expect the Federal Reserve to stay on hold at its policy meeting next week following three consecutive interest rate cuts in 2025. Futures traders see at most two rate reductions this year as policymakers weigh the impact of last year's easing, coupled with continued inflation pressures and an uncertain geopolitical landscape.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fed's main gauge shows inflation at 2.8% in November, edging further away from target",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108075677-1739369585315-108075677-1734095016471-gettyimages-2188958076-ryder-amazon-8.jpg?v=1755285181&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T18:59:35.000Z",
      "dateModified": "2026-01-22T18:59:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "India’s youth are turning concerts into an economy. The money is following",
    "url": "https://www.cnbc.com/2026/01/23/india-live-entertainment-concert-event-ticketing-boom-young-audiences-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256095-1769138098339-gettyimages-2247956003-r3mj0517.jpeg?v=1769138109&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T03:42:17.000Z",
    "description": "British rock band Coldplay performs at Global Citizen India at MMRDA Ground, BKC on Nov. 19, 2016 in Mumbai, India.Hindustan Times / ContributorTanvi ",
    "body": "British rock band Coldplay performs at Global Citizen India at MMRDA Ground, BKC on Nov. 19, 2016 in Mumbai, India.Hindustan Times / ContributorTanvi Shirgaonkar is counting down to Jan. 24, when she will finally get to see the Japanese artist Fujii Kaze, best known for the song \"Shinunoga E-Wa,\" perform in Mumbai at Lollapalooza India.The 29-year-old banking professional said the show will be the first of many concerts and live events she plans to \"experience\" this year. An avid fan of South Korean pop group BTS, Shirgaonkar attends a live event roughly every two months, mostly in Mumbai, and travels overseas at least once a year to see her favorite artists perform.\"Live entertainment offers an experience of collective effervescence and it's great for social media clout,\" the millennial told CNBC.Shirgaonkar is among a growing tribe of young Indians, whose rising disposable incomes are fueling a boom in the country's live entertainment industry. People attend the Lollapalooza India music festival in Mumbai on Jan. 28, 2023.Punit Paranjpe | Afp | Getty ImagesBetween 2024 and 2030, India will have the highest increase in working-age population globally, with over 100 million people expected to be added, according to a April 2025 report by Bain & Company. India's working-age population, defined as those aged 15 to 59, currently accounts for 64.2% of the total population and is expected to remain near 65% over the next decade, according to government data.Income per capita is also projected to grow the fastest among the top five emerging markets, including China, Brazil, Mexico, and Russia.That demographic shift is supporting stronger demand for live entertainment.Companies, including Eternal, which operates the live events platform District, and popular online ticketing platform BookMyShow, are among those betting on the trend.India's live entertainment sector grew by 17% last year, according to a report by BookMyShow. In 2025 alone, India hosted 34,086 live events, spanning concerts, theatre shows and comedy shows.Rapper DaBaby performs in the crowd at Loud Park on Nov. 22, 2025 in Navi Mumbai, India. Matt Jelonek | Getty Images Entertainment | Getty ImagesSeveral large international tours helped drive the surge. These included Coldplay's Music of the Spheres tour in Ahmedabad and Travis Scott's Circus Maximus tour, which concluded in India with shows in New Delhi and Mumbai.\"Seventy percent of the live event attendees are under 35 years of age and 52% are under 30,\" said Raghav Anand, partner and leader for digital, media and convergence at EY Parthenon, a consultancy.Anand said the Coldplay concerts marked a turning point for the sector in India, demonstrating the scale of demand and the country's ability to host global productions.\"The amplification of the [Coldplay] event won over a huge number of people in the experiences bracket, said Anand.International artists are increasingly adding multiple Indian cities to their tour schedules, aided by digital platforms that make their work more accessible to fan bases across the country.Affluence fuels demandA key driver of the surge in live events is the growing number of affluent households, which are giving consumers more disposable income to spend on experiences, industry experts said.\"Once you are affluent, it is about new experiences\", said Anand.Naman Pugalia, Chief Business Officer at BookMyShow, described the rise in live events as a \"real renaissance,\" driven by audiences placing greater value on how they spend their leisure time.That shift is reflected in growing demand for premium offerings. According to the BookMyShow report, 2025 saw a doubling of footfall for premium live-event experiences, including VIP pits, viewing decks and enhanced hospitality zones.A general view at Lollapalooza India 2025 on March 8, 2025 in Mumbai, India.Matt Jelonek | Getty Images Entertainment | Getty ImagesThe shift is not confined to major metropolitan areas. Smaller cities are seeing rapid growth, which Pugalia attributed to the increasingly fluid nature of fandom across the country.\"Fandom is such a powerful force that it knows really no definitions of tiers or metros, non-metro,\" he said, noting that demand is no longer limited to traditional cultural hubs.Live entertainment footfalls rose 213% in Shillong, 188% in Guwahati and 94% in Nashik in 2025, according to BookMyShow.Spillover effectsIndia aims to be among the world's top five live entertainment destinations by 2030, according to a government vision paper released in May last year.The sector's rapid growth is spilling into other parts of the economy. Coldplay's Ahmedabad concerts alone generated 6.41 billion rupees ($70.5 million) in economic value across hospitality, retail, transport and tourism, according to a report by EY in May last year.To keep pace with demand, organizers and ticketing platforms are investing in larger venues, improved safety measures and more efficient crowd management.British rock band Coldplay performs at Global Citizen India at MMRDA Ground, BKC on Nov.19, 2016 in Mumbai, India.Hindustan Times / ContributorStill, infrastructure remains a constraint. India has fewer than 10 purpose-built concert venues capable of hosting audiences of more than 10,000 in major cities, and almost none in smaller urban centers, according to the government white paper.\"The expectation has gone up\", Anand said, citing the need for smoother entry and exit, better facilities and higher overall production standards. Coldplay's tour in India, in particular, marked \"a genuine turning point\" for India's live entertainment industry in 2025, Anand said, helping establish Ahmedabad as a viable concert destination.Looking ahead, he said the industry is approaching an inflection point. \"2026 [is going] to be a breakout year,\" Anand said, as live entertainment takes a more central role in India's consumer economy.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "India’s youth are turning concerts into an economy. The money is following",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256095-1769138098339-gettyimages-2247956003-r3mj0517.jpeg?v=1769138109&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T03:42:17.000Z",
      "dateModified": "2026-01-23T03:42:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok forms U.S. joint venture, names Adam Presser CEO",
    "url": "https://www.cnbc.com/2026/01/22/tiktok-forms-us-joint-venture-names-a-ceo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108244260-1766163208070-gettyimages-2252059222-avils-notitle251219_npqZ4.jpeg?v=1766163286&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T03:28:14.000Z",
    "description": "The TikTok USDS (U.S. Data Security) logo appears on a smartphone screen in this illustration photo in Reno, United States, on Dec. 19, 2025.Jaque Sil",
    "body": "The TikTok USDS (U.S. Data Security) logo appears on a smartphone screen in this illustration photo in Reno, United States, on Dec. 19, 2025.Jaque Silva | Nurphoto | Getty ImagesPresident Donald Trump and TikTok said Thursday that the company had formed a joint venture to keep the video-sharing app operating in the U.S. under new American leadership.The company said Adam Presser, who has been serving as TikTok's head of operations and trust and safety, will be the CEO of TikTok USDS Joint Venture. Presser has worked at TikTok for almost four years and was previously a senior executive at Warner Bros.  TikTok CEO Shou Chew will be a director of the newly formed venture, which will run as an \"independent entity,\" according to Thursday's announcement. TikTok USDS Joint Venture \"will operate under defined safeguards that protect national security through comprehensive data protections, algorithm security, content moderation, and software assurances for U.S. users,\" the company said.Trump hailed the deal in a Truth Social post on Thursday, stating that the company would now be owned by a \"group of Great American Patriots and Investors, the Biggest in the World.\" He also thanked Chinese President Xi Jinping for working with his administration, and \"ultimately, approving the Deal.\"\"He could have gone the other way, but didn't, and is appreciated for his decision,\" Trump wrote. China has not issued an official statement confirming the agreement.  According to TikTok, the new venture will be governed by a seven-member board of directors, the majority of whom are American. In addition to Chew, the board is comprised of TPG Global's Timothy Dattels, Susquehanna International Group's Mark Dooley, Silver Lake co-CEO Egon Durban, DXC Technology CEO Raul Fernandez, Oracle's Kenneth Glueck, and MGX's David Scott.ByteDance, the Chinese parent of TikTok, will retain 19.9% of the new venture. Silver Lake, Oracle and MGX are the new managing investors. Other backers include Michael Dell's investment firm, Vastmere Strategic Investments, Alpha Wave Partners, Revolution, and General Atlantic affiliate Via Nova.ByteDance was subject to a national security law, originally signed by former President Joe Biden, that required the company to sell its U.S. operations or be effectively banned in the country. That law was never enacted due to several executive orders signed by President Donald Trump last year.Those orders kept the attorney general from enforcing the national security law while the app's leaders searched for a buyer.\"Interoperability enables the Joint Venture to provide U.S. users with a global TikTok experience, ensuring U.S. creators can be discovered and businesses can operate on a global scale,\" the company said. \"TikTok global's U.S. entities will manage global product interoperability and certain commercial activities, including e-commerce, advertising, and marketing.\"TikTok's prized content-recommendation algorithm will now be hosted within Oracle's American data centers, and it will be retrained, tested and updated on U.S. user data, the company said. The new structure also helps keep sibling apps like CapCut, Lemon8 and other unspecified services and websites operational in America, the statement said.Although the Chinese government hasn't commented publicly on the deal, Semafor reported earlier on Thursday, citing people familiar with the matter, that the U.S. and Chinese governments have signed off on the sale, and that the deal was set to close this week.President Trump said in September that Chinese President Xi Jinping had agreed to move forward with the proposed deal that was codified that month via an executive order. At the time, U.S. Vice President JD Vance said there was \"some resistance\" from the Chinese government to support the deal, which he said would value TikTok's U.S. business at $14 billion.Chew revealed the name of TikTok's U.S. entity to employees in December and said it signed an agreement to form a new U.S. joint venture, CNBC reported.WATCH: TikTok signs agreement to create new U.S. joint venture:watch now— CNBC's Dylan Butts contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok forms U.S. joint venture, names Adam Presser CEO",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108244260-1766163208070-gettyimages-2252059222-avils-notitle251219_npqZ4.jpeg?v=1766163286&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T03:28:14.000Z",
      "dateModified": "2026-01-23T03:28:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elon Musk says Tesla taking safety supervisors out of some Robotaxi vehicles in Austin",
    "url": "https://www.cnbc.com/2026/01/22/musk-says-tesla-takes-safety-supervisors-out-of-some-austin-robotaxis.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108162508-17506898602025-06-22t145208z_1243287827_rc2q7farilas_rtrmadp_0_tesla-robotaxi-texas.jpeg?v=1750696254&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T00:53:37.000Z",
    "description": "A Tesla robotaxi drives on the street along South Congress Avenue in Austin, Texas, on June 22, 2025Joel Angel Juarez | ReutersTesla CEO Elon Musk sai",
    "body": "A Tesla robotaxi drives on the street along South Congress Avenue in Austin, Texas, on June 22, 2025Joel Angel Juarez | ReutersTesla CEO Elon Musk said on Thursday that his company is now running a small number of its Robotaxi vehicles in Austin, Texas, without a human driver or safety supervisor on board.\"Just started Tesla Robotaxi drives in Austin with no safety monitor in the car,\" Musk posted on X. \"Congrats to the @Tesla_AI team!\" Ashok Elluswamy, Tesla's vice president of software, wrote in a separate post that the Austin Robotaxi service included, \"a few unsupervised vehicles mixed in with the broader robotaxi fleet with safety monitors.\" He said the ratio of driverless to supervised vehicles will increase over time in that market.Tesla shares rose 4.2% on Thursday to close at $449.36.Tesla lags behind several companies that are already operating commercial robotaxi services with no drivers or safety monitors present. Alphabet's Waymo leads the U.S. market, while Baidu's Apollo Go is out front in China with significant competition from WeRide.Other players are joining the fray, as Amazon's Zoox is now operating limited driverless services in the U.S., and startups like May Mobility and Nuro are developing their driverless offerings.Elon Musk waves to the crowd during the 56th annual World Economic Forum (WEF) meeting in Davos, Switzerland, January 22, 2026. Denis Balibouse | ReutersMusk said in July that Tesla would likely have \"autonomous ride hailing in probably half the population of the U.S. by the end of the year.\" The company fell far shy of that goal. However, Tesla drummed up excitement with the launch of its Robotaxi ride-hailing app, and its initial services in Austin and the San Francisco Bay area.In Texas, Tesla obtained a permit to run a transportation networking company, which allowed it to use \"automated driving systems,\" or driverless vehicles, there. But in California, Tesla has yet to obtain permits that would allow it to conduct driverless testing or robotaxi rides without a human at the wheel, ready to steer or brake at any time.Speaking at the World Economic Forum in Davos on Thursday, Musk said, \"I think self-driving cars is essentially a solved problem at this point,\" adding that he expects his company's Robotaxi service will be \"very widespread by the end of this year within the U.S.\" Musk is notorious for missing his self-imposed timelines for grand technical or business achievements.In 2019, he told investors that he was \"very confident\" the company would be able to turn its existing vehicles into robotaxis with a software update by the end of the following year.With its EV sales sliding, Tesla's ability to keep investors enthused may hinge on whether it can scale a driverless, ride-hailing service in the U.S. this year and upgrade the partially automated driving systems in its cars to a fully automated driving system. Today, its premium system is marketed as FSD (Supervised), and the company plans to sell an FSD Unsupervised system in the future.Surveys by the Electric Vehicle Intelligence Report found a majority of U.S. consumers polled late last year did not want to ride in robotaxis, with particular concerns around safety.Deutsche Bank analysts wrote in a note this week that they anticipated \"muted underlying volume growth\" for Tesla and EV maker Rivian this year with \"autonomy and physical AI driving the narrative.\" They also said, \"Tesla will have to prove out FSD unsupervised and the scaling up of robotaxi (which in our view has been clearly tracking behind schedule) before garnering incremental valuation credit.\" Tesla didn't respond to a request for comment on Thursday.Late last year, California regulators found that Tesla had engaged in deceptive marketing and false advertising around their vehicles' driverless capabilities. And the National Highway Traffic Safety Administration is currently investigating Tesla to determine how often the company's FSD systems may have caused traffic safety violations.According to TeslaDeaths.com, which draws on NHTSA data, legal filings and press reports to track fatal Tesla collisions, 65 people have died in Tesla crashes that involved the use of Autopilot, including two in which the company's FSD systems were engaged in the seconds leading up to the crash.Tesla is scheduled to report fourth-quarter results on Wednesday. WATCH: Tesla takes Full Self-Driving feature to a monthly subscriptionwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elon Musk says Tesla taking safety supervisors out of some Robotaxi vehicles in Austin",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108162508-17506898602025-06-22t145208z_1243287827_rc2q7farilas_rtrmadp_0_tesla-robotaxi-texas.jpeg?v=1750696254&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T00:53:37.000Z",
      "dateModified": "2026-01-23T00:53:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft working to fix Outlook email issues",
    "url": "https://www.cnbc.com/2026/01/22/microsoft-outlook-outage-email-issues.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256002-1769115627239-gettyimages-2234387224-nguyen-notitle250911_npFWY.jpeg?v=1769115648&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T03:03:14.000Z",
    "description": "The Microsoft office building is in the RheinauArtOffice in Cologne, Germany, on September 11, 2025.Michael Nguyen | Nurphoto | Getty ImagesMicrosoft ",
    "body": "The Microsoft office building is in the RheinauArtOffice in Cologne, Germany, on September 11, 2025.Michael Nguyen | Nurphoto | Getty ImagesMicrosoft said Thursday that it was working to resolve technical issues that were getting in the way of people sending and receiving email messages in its Outlook application.The event happened in the middle of U.S. business hours, leading people to address the snafu on social media as schools, government institutions and companies dealt with the outage. The program represents a core part of Microsoft 365 productivity software bundles.At 2:37 p.m. ET, the company said in an X post that it was investigating an issue affecting Outlook. \"Users may be receiving a '451 4.3.2 temporary server issue' error message when attempting to send or receive email through Outlook,\"  Microsoft said in an update to an online dashboard.In addition, searches in the OneDrive cloud file storage application, the Teams communication app and the SharePoint Online collaboration service might be slow or might not work at all, the company said on the dashboard. Microsoft said people might also be unable to create chats, meetings, teams and channels, breakout rooms or live events in Teams.In an X post published at 3:17 p.m. ET, Microsoft said that it had found that \"a portion of service infrastructure in North America\" was not handling traffic correctly and that it was working to fix the problem.A follow-up post at 4:14 p.m. ET said that the company has restored affected infrastructure and was directing traffic to other infrastructure to recover.Service remained degraded more than seven hours after Microsoft acknowledged the error messages.\"We're seeing continued improvements in service availability and functionality as a result of our load-balancing efforts,\" Microsoft said in an X post at 9:46 p.m. ET. \"We're actively monitoring performance and making targeted adjustments to further improve stability and availability, while continuing recovery actions to ensure a reliable service experience.\"Last July, an Outlook outage lasted over 21 hours.WATCH: Trade Tracker: Stephanie Link sells Microsoftwatch nowRead more CNBC tech newsWaymo launches robotaxi service in Miami, extending U.S. leadTrump wants Nvidia to sell powerful AI chips to Beijing. Washington's China hawks are pushing backOpenAI seeking investments from Middle East sovereign wealth funds for multibillion-dollar roundJeff Bezos' Blue Origin launches satellite internet service to rival SpaceX, Amazon",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft working to fix Outlook email issues",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256002-1769115627239-gettyimages-2234387224-nguyen-notitle250911_npFWY.jpeg?v=1769115648&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T03:03:14.000Z",
      "dateModified": "2026-01-23T03:03:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan inflation cools to 2.1%, lowest since March 2022, but rice prices loom large ahead of election",
    "url": "https://www.cnbc.com/2026/01/23/japan-december-inflation-rice-prices-snap-election-sanae-takaichi-boj.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255448-1769050069590-gettyimages-2256453326-JAPAN_CPI.jpeg?v=1769050082&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T02:22:03.000Z",
    "description": "An employee at the Celsior Wadamachi supermarket in Yokohama, Japan, on Thursday, Jan. 15, 2026. Soaring food costs are a key component driving broade",
    "body": "An employee at the Celsior Wadamachi supermarket in Yokohama, Japan, on Thursday, Jan. 15, 2026. Soaring food costs are a key component driving broader inflation higher, with data Friday expected to show consumer price growth has stayed above the central bank's 2% target for four straight calendar years. Bloomberg | Bloomberg | Getty ImagesJapan's headline inflation rate slowed sharply to 2.1%, its lowest level since March 2022, down from 2.9% in November, as easing price pressures collide with political focus on living costs and a looming central bank decision.This was the 45th straight month that the inflation figure has been above the Bank of Japan's 2% target. Core inflation, which strips out prices of fresh food, stood at 2.4%, in line with analysts' estimates and its lowest level since October 2024. That was sharply lower than November's 3%.The so-called \"core-core\" inflation rate — which strips out prices for fresh food and energy — eased to 2.9% from 3% a month earlier.Japan's full-year inflation stood at 3.2%, according to government data. Inflation hit a two-year high in January 2025, before tapering down over the course of the year.However, Japan saw rice inflation hit its highest in over 50 years in May, and rice prices soared to record highs then. Rice inflation for December came in at 34.4%, marking the seventh straight month of decline from a year ago. Despite that, rice prices in Japan remain near record levels. Data from Japan's agriculture ministry showed the average price of a 5-kilogram bag of rice was at 4,267 yen for the week ended Jan. 11. Back in 2025, soaring rice prices and careless comments cost then farm minister Taku Eto his job and reportedly prompted former prime minister Shigeru Ishiba to take personal responsibility for lowering prices as a rice shortage took hold. \"Goods inflation in Japan is still the main driver of inflation,\" Marcel Theliant, Head of Asia Pacific at Capital Economics, told CNBC's \"Squawk Box Asia\" on Friday. He noted that in 2025, import prices slowed as the yen strengthened, but they have since stopped falling. \"So it's possible [that] goods inflation probably remains higher for longer, and that will keep inflation above the BOJ's target for longer.\"This would possibly prompt an interest rate hike as soon as April, Theliant said.Snap electionThe data comes as Prime Minister Sanae Takaichi is set to dissolve Japan's Lower House today in preparation for a snap election on Feb. 8. Takaichi has made tackling the cost of living a priority and has vowed to suspend Japan's 8% food tax for 2 years to help households with rising living costs.Last year, her government put together a massive $135 billion stimulus package for the country, which included measures to expand local government grants, as well as provide subsidies for electricity and gas bills.Later today, the Bank of Japan will also release its policy decision, although economists polled by Reuters largely expect a hold at 0.75%. Fresh inflation and GDP forecasts will also come from the BOJ for 2026.— CNBC's Martin Soong, Chery Kang and Kaori Enjoji contributed to this report. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan inflation cools to 2.1%, lowest since March 2022, but rice prices loom large ahead of election",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255448-1769050069590-gettyimages-2256453326-JAPAN_CPI.jpeg?v=1769050082&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T02:22:03.000Z",
      "dateModified": "2026-01-23T02:22:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Capital One is buying startup Brex for $5.15 billion in credit card firm's latest deal",
    "url": "https://www.cnbc.com/2026/01/22/capital-one-is-buying-startup-brex-for-5point15-billion-in-credit-card-firms-latest-deal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106289306-1576027900694henriquepedro.jpg?v=1667836801&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T23:26:27.000Z",
    "description": "Brex co-founders Pedro Franceschi and Henrique Dubugras.BrexCapital One said Thursday that it was acquiring payments startup Brex for $5.15 billion, t",
    "body": "Brex co-founders Pedro Franceschi and Henrique Dubugras.BrexCapital One said Thursday that it was acquiring payments startup Brex for $5.15 billion, the latest splashy deal undertaken by the bank's CEO, Richard Fairbank.The firm, which disclosed the deal in its fourth-quarter earnings statement, said the deal is made up of 50% cash and 50% stock. Brex was previously valued at $12.3 billion. Shares of the bank fell about 3%.Under Fairbank, a rare founder-CEO of a major U.S. bank, Capital One acquired rival card firm Discover Financial last year for about $35 billion. That deal was Fairbank's crowning achievement, giving the credit card lender access to one of the only payment networks of any scale. \"Since our founding, we set out to build a payments company at the frontier of the technology revolution,\" Fairbank said in a release. \"Acquiring Brex accelerates this journey, especially in the business payments marketplace.\"Fairbank said that Brex pioneered the combination of corporate cards, banking and spend management software: \"They have taken the rarest of journeys for a fintech, building a vertically integrated platform from the bottom of the tech stack to the top.\"Still, the more than 50% decline in valuation for Brex from its 2023 level shows the headwinds that even successful fintech companies have encountered. Brex is among a class of fintech firms that rose to prominence during a period of low interest rates; it was known initially as a startup that made loans to other startups via its cards.But the company expanded beyond technology into other sectors and now services larger established firms and startups alike, including Robinhood, Zoom and Anthropic. Capital One, which has offered business credit cards for decades, became increasingly convinced that it was Brex's model that would be the winning offering, according to a person with knowledge of the lender's strategy. \"We didn't have to pursue this acquisition, our growth was incredibly strong,\" Brex CEO Pedro Franceschi told CNBC in an interview.Combining Brex's technology with Capital One's reach and resources would grow the startup's scale faster than as a standalone firm, he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Capital One is buying startup Brex for $5.15 billion in credit card firm's latest deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106289306-1576027900694henriquepedro.jpg?v=1667836801&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T23:26:27.000Z",
      "dateModified": "2026-01-22T23:26:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House passes final funding bills 8 days before shutdown, Senate now will consider",
    "url": "https://www.cnbc.com/2026/01/22/government-funding-shutdown-house.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256061-1769123100075-gettyimages-2257051951-US_GOV_FUNDING.jpeg?v=1769123166&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T23:06:46.000Z",
    "description": "Speaker of the House Mike Johnson, R-La., and House Majority Leader Steve Scalise, R-La., right, respond to a question during a news conference in the",
    "body": "Speaker of the House Mike Johnson, R-La., and House Majority Leader Steve Scalise, R-La., right, respond to a question during a news conference in the Capitol Visitor Center after a meeting of the House Republican Conference on Wednesday, Jan. 7, 2026.Tom Williams | CQ-Roll Call, Inc. | Getty ImagesThe House of Representatives on Thursday passed the final set of outstanding government funding bills as a partial federal government shutdown looms on Jan. 30.The four bills account for the largest chunk of government spending, about $1.2 trillion in total. They would fund the departments of Defense; Health and Human Services; Homeland Security; Labor; Housing and Urban Development; Transportation; and Education. The Homeland Security bill passed 220-207, while the other three cleared 341-88 as part of a package known as a \"minibus.\"The bills represent the final quartet of 12 annual appropriations bills required to fund the government and avoid a partial shutdown on Jan. 30. The Senate still needs to approve them, along with two other House-passed funding bills, before they head to President Donald Trump's desk for a signature. The Senate does not return until next week, and a winter storm closing in on Washington over the weekend threatens to complicate those plans. House lawmakers were widely expected to pass the bills on Thursday, with lawmakers desperate to avoid another shutdown after enduring a record 43-day shutdown last year. Despite bipartisan accord on avoiding another shutdown, some of the bills still face serious hurdles in the Senate. Read more CNBC politics coverageGreenland PM: Trump-NATO deal framework unclear, sovereignty is a red lineTrump sues Jamie Dimon, JPMorgan Chase over debanking the suit calls 'political'Trump says he reached Greenland deal 'framework' with NATO, backs off tariffsTrump interview live updates: CNBC's Joe Kernen sits down with the president at DavosRussia watches as ally Iran edges closer to collapse. Here's why it matters for MoscowTrump's latest geopolitical gambits all lead back to ChinaTrump says anything less than U.S. control of Greenland is 'unacceptable' ahead of talksDemocrats have warned they will not support a bill to fund the Homeland Security Department after an Immigration and Customs Enforcement Agent fatally shot a U.S. citizen in Minnesota earlier this month. The Homeland bill was being considered separately from the other three bills in the House due to the political peril. Meanwhile, Republicans from the Midwest demanded a provision be added to the spending package to allow year-round sale of gasoline with a heavy mix of ethanol, known as E15. The fuel is currently restricted in the summer months due to smog concerns, though that restriction is frequently waived.House Republican leadership agreed to create a congressional \"E-15 Rural Domestic Energy Council\" instead to assuage those Republicans.Trump told Fox Business on Thursday that he \"think[s] we're going to probably end up in another Democrat shutdown,\" but did not specify whether he was referring to the deadline at the end of this month. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House passes final funding bills 8 days before shutdown, Senate now will consider",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256061-1769123100075-gettyimages-2257051951-US_GOV_FUNDING.jpeg?v=1769123166&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T23:06:46.000Z",
      "dateModified": "2026-01-22T23:06:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump sues Jamie Dimon, JPMorgan Chase over debanking the suit calls 'political' ",
    "url": "https://www.cnbc.com/2026/01/22/trump-sues-jamie-dimon-jpmorgan-chase.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255856-1769102645769-107341256-1701350099513-Untitled-2.jpg?v=1769102697&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T22:47:34.000Z",
    "description": "watch nowPresident Donald Trump sued JPMorgan Chase and its CEO, Jamie Dimon, on Thursday for closing accounts belonging to Trump and related entities",
    "body": "watch nowPresident Donald Trump sued JPMorgan Chase and its CEO, Jamie Dimon, on Thursday for closing accounts belonging to Trump and related entities in early 2021, in what the lawsuit calls political actions. The closures came on the heels of the Jan. 6, 2021, riot by Trump supporters at the U.S. Capitol, and Trump exiting the White House later that same month after his electoral loss to former President Joe Biden was confirmed.\"He debanked me,\" Trump told reporters in Switzerland, when asked about Dimon on Wednesday, hours after his lawsuit was filed in Florida state court in Miami-Dade County.\"He shouldn't be debanking,\" Trump said. \"It's so wrong.\"\"Jamie Dimon is not allowed to do what he did.\"JPMorgan on Thursday denied that it closed Trump's accounts for political reasons and suggested that the closures were due to federal rules and regulations that the bank has been seeking to change during this and prior presidential administrations.Trump and the other plaintiffs in the case, which are business entities related to the president, are seeking at least $5 billion in civil damages. The plaintiffs had been customers of the bank for decades, the suit says.\"Plaintiffs are confident that JPMC's unilateral decision came about as a result of political and social motivations, and JPMC's unsubstantiated, 'woke' beliefs that it needed to distance itself from President Trump and his conservative political views,\" the lawsuit alleges.\"In essence, JPMC debanked Plaintiffs' Accounts because it believed that the political tide at the moment favored doing so,\" says the suit.The suit says JPMorgan failed to disclose why the bank was terminating the accounts, but that the \"plaintiffs have subsequently learned that they were debanked as a result of political discrimination against President Trump, the Trump Organization, its affiliated entities, and/or the Trump family.\"The suit does not detail what the plaintiffs learned that substantiated that claim.The suit also says that JPMorgan's \"reckless decision is leading a growing trend by financial institutions in the United States of America to cut off a consumer's access to banking services if their political views contradict with those of the financial institution.\"In addition to alleging motivations for the closures, the complaint says that Trump and the plaintiffs \"have recently learned that JPMC — at the direction of Dimon — has unlawfully and unjustifiably published some or all of their names, including the names of President Trump, the Trump Organization with its affiliated entities, and/or the Trump family, on a blacklist.\"That purported blacklist is accessible by federally regulated banks \"and is comprised of individuals and entities that have a history of malfeasant acts and are otherwise non-compliant with applicable banking rules and regulations,\" the suit says, while stating that the plaintiffs \"have always complied\" with banking rules and regulations.The complaint does not give a formal name for that blacklist or indicate that it was part of a government regulatory apparatus.The complaint alleges trade libel, and breach of implied covenant of good faith and fair dealing by JPMorgan.Read more CNBC politics coverageGreenland PM: Trump-NATO deal framework unclear, sovereignty is a red lineTrump sues Jamie Dimon, JPMorgan Chase over debanking the suit calls 'political'Trump says he reached Greenland deal 'framework' with NATO, backs off tariffsTrump interview live updates: CNBC's Joe Kernen sits down with the president at DavosRussia watches as ally Iran edges closer to collapse. Here's why it matters for MoscowTrump's latest geopolitical gambits all lead back to ChinaTrump says anything less than U.S. control of Greenland is 'unacceptable' ahead of talksIt also alleges violations of Florida's Unfair and Deceptive Trade Practices Act by Dimon.In addition to Trump, the plaintiffs include Trump Payroll Corp. and various limited liability corporations.JPMorgan, in a statement to CNBC, said, \"While we regret President Trump has sued us, we believe the suit has no merit.\"\"We respect the President's right to sue us and our right to defend ourselves — that's what courts are for,\" said the bank's spokeswoman, Patricia Wexler. \"JPMC does not close accounts for political or religious reasons.\"\"We do close accounts because they create legal or regulatory risk for the company. We regret having to do so but often rules and regulatory expectations lead us to do so,\" Wexler said.\"We have been asking both this Administration and prior administrations to change the rules and regulations that put us in this position, and we support the Administration's efforts to prevent the weaponization of the banking.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump sues Jamie Dimon, JPMorgan Chase over debanking the suit calls 'political' ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255856-1769102645769-107341256-1701350099513-Untitled-2.jpg?v=1769102697&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T22:47:34.000Z",
      "dateModified": "2026-01-22T22:47:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Intel stock plunges 13% on soft guidance, concerns about chip production",
    "url": "https://www.cnbc.com/2026/01/22/intel-intc-earnings-report-q4-2025-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255966-1769112419753-gettyimages-2257634615-_75a0006_dq1vuat9.jpeg?v=1769112503&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T23:18:21.000Z",
    "description": "The Intel logo is displayed on a sign in front of Intel headquarters on Jan. 22, 2026 in Santa Clara, California. Justin Sullivan | Getty ImagesIntel ",
    "body": "The Intel logo is displayed on a sign in front of Intel headquarters on Jan. 22, 2026 in Santa Clara, California. Justin Sullivan | Getty ImagesIntel reported fourth-quarter earnings Thursday that beat Wall Street expectations but offered soft guidance for the current quarter.Shares of the company were down as much as 13% in after-hours trading. Here's how the chipmaker did compared with what Wall Street was expecting, based on a survey of analysts by LSEG:Earnings per share: 15 cents adjusted vs. 8 cents expectedRevenue: $13.7 billion vs. $13.4 billion expectedIntel said it expected first-quarter revenue between $11.7 billion and $12.7 billion, and breakeven adjusted earnings per share. That came in below LSEG expectations of 5 cents earnings per share on $12.51 billion in sales. Finance chief David Zinsner told CNBC's Kristina Partsinevelos that the company's soft guidance in the first quarter was partially because the company doesn't have the supply it needs for seasonal demand, and that supply would improve in the second quarter this year. On a call with analysts, CEO Lip-Bu Tan said that the company was looking to improve its production efficiency, called yield, in order to improve supply of the company's products. \"Our yields are in line with our internal plans,\" Tan said. \"They are still below what I want them to be.\"The company said it had a net loss of $600 million, or 12 cents per diluted share. In the year-ago period, Intel reported a net loss of $100 million, or 3 cents per share. Investor expectations were high for Intel heading into the report, with the stock up 147% in the past year. The rally has been driven by optimism that Intel may be on the cusp of securing its first major anchor customer for its foundry business, which manufactures chips for other companies.Tan said earlier this month that the company's 18A manufacturing technology — competing with Taiwan Semiconductor Manufacturing Company's 2nm technology — \"over-delivered\" in 2025. That suggests that the technology is mature enough to start volume production of products, such as Intel's own Core Ultra Series 3 central processor. In a statement, Tan said that Intel was \"working aggressively\" to increase 18A supply to meet \"strong customer demand.\"Zinsner told CNBC that customers for Intel's next-generation 14A technology would show up in the second half of the year. Zinsner added that the company was unlikely to announce customers in general. \"Once we get them, we're gonna need to start really spending capital on the 14A front, and that's how you'll know,\" Zinsner said. Intel said its foundry had $4.5 billion in revenue, although some of that is accounting for making the company's own chips. There is also optimism tied to strong sales of Intel's latest server chips, which analysts say are seeing a sales boom because of increased spending on infrastructure for artificial intelligence. Tan said in a statement Thursday that Intel's central processing units were becoming more important because of systems built for artificial intelligence. Revenue from those chips is reported as Data Center and AI sales, which totaled $4.7 billion in revenue during the quarter, up 9% on an annual basis. Chips for laptops are reported as Client Computing Group sales. The product category was down 7% on a year-over-year basis to $8.2 billion in sales. During 2025, the U.S. government, SoftBank and Nvidia made big investments into the chipmaker, all becoming major shareholders. Intel said that its sale of stock to Nvidia worth $5 billion was completed during the quarter. WATCH: Can Intel's New Arizona Chip Fab Bring It Back From The Brink?watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Intel stock plunges 13% on soft guidance, concerns about chip production",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255966-1769112419753-gettyimages-2257634615-_75a0006_dq1vuat9.jpeg?v=1769112503&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T23:18:21.000Z",
      "dateModified": "2026-01-22T23:18:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greenland PM: Don't know details of Trump-NATO deal framework, but sovereignty is a 'red line'",
    "url": "https://www.cnbc.com/2026/01/22/greenland-trump-nato-deal-nielsen.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255911-17691063812026-01-22t170709z_1171800888_rc2g6ja7r9ck_rtrmadp_0_usa-trump-greenland-nielsen.jpeg?v=1769106450&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T20:53:48.000Z",
    "description": "Greenland’s Prime Minister Jens-Frederik Nielsen holds a press conference in Nuuk, Greenland, Jan. 22, 2026. Marko Djurica | ReutersGreenland Prime Mi",
    "body": "Greenland’s Prime Minister Jens-Frederik Nielsen holds a press conference in Nuuk, Greenland, Jan. 22, 2026. Marko Djurica | ReutersGreenland Prime Minister Jens-Frederik Nielsen said in a press conference Thursday that he doesn't know what's in the \"framework\" deal that President Donald Trump announced after meeting with NATO's leader a day earlier.But Nielsen emphasized that no deal involving Greenland can be struck without the island and its governing kingdom, Denmark, having a say.Any such deal must respect Greenland's \"red lines\" — including its sovereignty and territorial integrity, he added.\"We choose the Kingdom of Denmark. We choose the EU. We choose NATO,\" Nielsen told the press in Nuuk, Greenland. \"This is not only a situation for Greenland and the Kingdom of Denmark, it's about the world order for all of us.\"The remarks echoed Danish Prime Minister Mette Frederiksen's earlier statement maintaining that Greenland's sovereignty is non-negotiable.Nielsen's comments came one day after Trump — who has spent weeks aggressively pressuring Europe over a proposed U.S. takeover of Greenland — abruptly announced that he and NATO Secretary General Mark Rutte have forged the \"framework of a future deal.\"The announcement, delivered in a Truth Social post following a closed-door meeting in Davos, Switzerland, was light on details. In a CNBC interview, Trump called it the \"concept of a deal\" and said he would \"explain it down the line.\"Read more CNBC politics coverageGreenland PM: Trump-NATO deal framework unclear, sovereignty is a red lineTrump sues Jamie Dimon, JPMorgan Chase over debanking the suit calls 'political'Trump says he reached Greenland deal 'framework' with NATO, backs off tariffsTrump interview live updates: CNBC's Joe Kernen sits down with the president at DavosRussia watches as ally Iran edges closer to collapse. Here's why it matters for MoscowTrump's latest geopolitical gambits all lead back to ChinaTrump says anything less than U.S. control of Greenland is 'unacceptable' ahead of talksBut the agreement was apparently enough for Trump to cancel the forthcoming tariffs he had imposed on eight European countries that had come to Greenland's defense amid the president's saber-rattling.Trump suggested to CNBC that the framework involves mineral rights for the U.S., as well as the Trump administration's proposed \"Golden Dome\" missile defense system.Meanwhile, The New York Times reported Wednesday that some NATO officials had separately discussed a possible compromise in which the U.S. would get sovereignty over \"small pockets of Greenland for military bases.\"Nielsen on Thursday rejected that proposal out of hand, while repeatedly noting that he has not been told what the Trump-Rutte framework entails.\"I don't know what's concrete in that deal,\" he said. \"But I know that we have now a high-level working group working on a solution for both parties.\"\"We have some red lines\" that cannot be crossed, Nielsen said. \"We have to respect our territorial integrity. We have to respect international law, sovereignty.\"\"Our integrity and our borders and international law is definitely, definitely a red line that we don't want anyone to cross,\" he added later in the presser. \"And I don't think that is strange at all.\"Nielsen said that he believes those red lines, which were recently relayed to Rutte from Danish and Greenlandic officials, have since \"been delivered\" to Trump.But there's been \"nothing about a deal on mineral resources or anything else,\" he said. Greenland is willing to negotiate with the U.S. on economics and other matters, \"but that's something we have to talk about in mutual respect,\" he added.Nielsen also directly criticized the Trump administration's aggression toward Greenland, including the recent flare-up in tensions that, until Wednesday, included the possibility of U.S. military action.\"No doubt, the rhetoric we have heard the last year is unacceptable for us,\" he said, adding that it is difficult to maintain a respectful dialogue when Greenland's citizens \"every night hear threats about acquiring and taking.\"\"Try to imagine how it is as Greenlanders, as people here, peaceful people in Greenland, hear and see in the media every day that somebody wants to take your freedom.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greenland PM: Don't know details of Trump-NATO deal framework, but sovereignty is a 'red line'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255911-17691063812026-01-22t170709z_1171800888_rc2g6ja7r9ck_rtrmadp_0_usa-trump-greenland-nielsen.jpeg?v=1769106450&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T20:53:48.000Z",
      "dateModified": "2026-01-22T20:53:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Procter & Gamble is selling diapers made with silk fibers in China as it leans into luxury",
    "url": "https://www.cnbc.com/2026/01/22/procter-gamble-diapers-silk-china.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255770-1769097001938-gettyimages-2218820181-dsc05223_emf2bblf.jpeg?v=1769097026&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T18:57:42.000Z",
    "description": "Packages of Pampers diapers are displayed at a Target store on June 05, 2025 in Novato, California. Justin Sullivan | Getty ImagesProcter & Gamble is ",
    "body": "Packages of Pampers diapers are displayed at a Target store on June 05, 2025 in Novato, California. Justin Sullivan | Getty ImagesProcter & Gamble is selling diapers made with silk fibers in China as part of the company's strategy to entice shoppers to spend more, even as demand for some of its products wanes.China is the company's second-largest market, trailing only the United States. In both markets, P&G has turned to innovation, rather than discounts, to attract consumers who are otherwise trying to spend less at the grocery store. For example, last year, it unveiled a new formula for its liquid Tide detergent in the U.S. In China, P&G also faces another challenge: a record-low birth rate. Government data released Monday showed that births dropped to 5.6 per 1,000 people in 2025, down from 6.4 in 2023. For P&G, fewer babies means the company is selling fewer diapers. To boost the sales of its baby-care division, P&G is leaning into luxury.Executives touted the success of the Pampers Prestige product on the company's earnings conference call Thursday. It added silk fibers to the inside of the diaper for skin comfort and protection.\"Chinese parents want only the best for their baby,\" P&G CEO Shailesh Jejurikar said.He added that \"reframing\" the company's super-premium diaper line has fueled double-digit organic sales growth and a 3% market share increase for P&G's baby-care business in Greater China over the last 18 months. The company did not share how the pricing of Pampers Prestige compares with its other diaper lines in China.In the latest quarter, P&G's overall baby-care division reported single-digit organic sales declines, despite a 20% jump in organic sales in Greater China, according to CFO Andre Schulten.More broadly, the focus on innovation is paying off for P&G. Consumer sentiment in China is still negative, yet P&G saw 3% growth in the market in the latest quarter, Schulten said on a call with reporters on Thursday.Stateside, P&G's sales were weaker. Organic sales in North America fell 2% in its fiscal second quarter. P&G is hoping that the strategy that is working in China could soon pay off in the U.S. The current bifurcated — or \"K-shaped\" — economy has showed that wealthier Americans are still willing to flex their purchasing power, even as lower-income shoppers pull back. Shares of P&G rose more than 2% in morning trading Thursday after the company reported better-than-expected earnings. However, P&G's revenue fell short of Wall Street's expectations, hurt by weaker demand in the U.S.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Procter & Gamble is selling diapers made with silk fibers in China as it leans into luxury",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255770-1769097001938-gettyimages-2218820181-dsc05223_emf2bblf.jpeg?v=1769097026&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T18:57:42.000Z",
      "dateModified": "2026-01-22T18:57:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]