[
  {
    "title": "65-year-old furloughed by government shutdown: 'I could lose the house. I could lose my car. I could lose everything'",
    "url": "https://www.cnbc.com/2025/10/04/65-year-old-furloughed-by-government-shutdown-i-could-lose-everything.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207834-1759525271818-gettyimages-2097720137-hill-21.jpeg?v=1759525334&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-04T14:00:01.000Z",
    "description": "<div><div><p>On Tuesday, Willie Price woke up at 3 a.m. to deliver newspapers. At 6:30 a.m., she clocked into her food service job, working the cash r",
    "body": "<div><div><p>On Tuesday, Willie Price woke up at 3 a.m. to deliver newspapers. At 6:30 a.m., she clocked into her food service job, working the cash register and making coffee, in a cafeteria at the Library of Congress on Capitol Hill.</p><p>Then, on Wednesday, <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/government-shutdown-updates-thune-trump.html\">the government shut down</a>.</p><p>Price, who says she makes about 16 cents per newspaper she delivers and $25 an hour from her food service job, says she hasn't worked since Tuesday. If the shutdown continues, she won't be able to pay her bills this month.</p><p>\"I don't even know what to do,\" the 65-year-old, who says she lives paycheck to paycheck, tells CNBC Make It. \"I could lose the house. I could lose my car. I could lose everything.\"</p><p>Price is one of many <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/what-the-government-shutdown-means-for-federal-workers.html\">hourly contractors who work directly for the government</a> or through third-party contractors who will not be paid during the shutdown period. Some federal employees are guaranteed back pay once the shutdown ends, but <a href=\"https://www.poynter.org/fact-checking/2025/government-shutdown-who-gets-paid\" target=\"_blank\">contractors are not</a>. </p><p>Shutdowns have <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/what-the-government-shutdown-could-mean-for-your-investments.html\">typically lasted about four days</a>. The most recent one in 2018 was the longest on record, lasting more than a month. On Friday afternoon, the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/government-shutdown-updates-thune-trump.html\">Senate failed to pass either of the funding bills</a> that would have ended the three-day government shutdown. The shutdown is now expected to extend at least through Monday, Oct. 6.</p><p>A prolonged shutdown could put an immense amount of <a href=\"https://nffe.org/press-release/federal-employees-union-leader-urges-compromise-and-a-swift-end-to-the-government-shutdown/\" target=\"_blank\">financial strain on low-wage workers</a>, many of whom already live paycheck to paycheck, said Randy Erwin, president of the National Federation of Federal Employees, a union that represents 110,000 federal workers nationwide.</p></div><h2><a></a>'People think they can play with people's livelihoods'</h2><div><p>Starting Oct. 6, Audrey Murray, a 64-year-old security officer, says she will no longer receive her $20.22-an-hour paycheck from her job at the Smithsonian's National Portrait Gallery. While she's not expecting to be furloughed from her second job at the State Department, she says the income from that job alone will not cover her bills for the month.</p><p>\"I'm just in limbo right now,\" Murray says. \"It's just funny how people think they can play with people's livelihoods. I do all the right things. I go to work.\"</p></div><div><p>Willie Price (L) and Audrey Murray (R) are contract workers who will not receive paychecks during the government shutdown.</p><p>Christina Locopo | CNBC Make It (Photos courtesy of: Willie Price and Audrey Murray)</p></div><div><p>A single mother to two teenage sons and a full-time caregiver for her 12-year-old granddaughter, Murray says it took her two years to pay off the money she borrowed from her relatives during the last government shutdown in 2018.</p><p>Every month, she makes a $2,200 mortgage payment and spends up to $600 on groceries for her family, she says, plus costs for utilities and child care. She's already thinking about how she might have to ask her children to ration their food.</p><p>\"How am I going to feed my children and pay my bills?\" Murray says. \"I need to keep my electric on. I have to keep my gas on.\"</p></div><h2><a></a>Many low-wage workers may not be able to pay their bills</h2><div><p>It's unclear how many workers will be affected in total, but about <a href=\"https://www.cbo.gov/system/files/2025-09/61773-Government-Shutdown.pdf\" target=\"_blank\">750,000 federal government</a> employees could be put on unpaid leave each day of the shutdown, according to the Congressional Budget Office.</p><p>Low-wage workers are the ones who will <a href=\"https://x.com/mannypastreich/status/1973128378720067927?s=46&t=GbyjREhVTYDTF10sJk0EnQ\" target=\"_blank\">bear the brunt</a> of the government shutdown, Manny Pasterich, president of 32BJ SEIU, a union that represents 2,400 federally contracted security officers, office cleaners and food service workers, said in a Tuesday statement.</p><p>\"Not only do 32BJ members earn less than direct federal employees, but they also would be ineligible to receive backpay,\" Pasterich said. \"A government shutdown would turn their lives upside down, forcing many to risk eviction, have their utilities turned off and leave them unable to feed themselves and their families.\"</p><p>At the Smithsonian, Murray says \"everyone\" is worried about how the shutdown will affect their lives. In the past few days, she's seen many of her coworkers cry on the job from the stress, she says.</p><p>\"It's so sad to see everybody sad,\" she says. \"People don't know how they're going to pay their bills. People don't know how they're going to put food on the table.\"</p><p><em><strong>Want to be your own boss?</strong> Sign up for CNBC's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "65-year-old furloughed by government shutdown: 'I could lose the house. I could lose my car. I could lose everything'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207834-1759525271818-gettyimages-2097720137-hill-21.jpeg?v=1759525334&w=1920&h=1080"
      ],
      "datePublished": "2025-10-04T14:00:01.000Z",
      "dateModified": "2025-10-04T14:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "36-year-old American Air Force vet pays $850 to rent his 2-bedroom apartment in Vietnam— take a look inside",
    "url": "https://www.cnbc.com/2025/10/04/american-air-force-vet-two-bedroom-vietnam-apartment.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207526-1759501271324-celia_6.jpg?v=1759501443&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-04T14:00:01.000Z",
    "description": "<div><div><p>Before Markeiz Ryan, 36, left the U.S. Air Force in 2019, he took a trip to Vietnam and that experience changed the course of his life.</",
    "body": "<div><div><p>Before Markeiz Ryan, 36, left the U.S. Air Force in 2019, he took a trip to Vietnam and that experience changed the course of his life.</p><p>\"It just looked like so much fun and it really lived up to all the hype,\" Ryan tells CNBC Make It. \"I ended up having the best time of my life, and that depression was [just] gone.\"</p><p>Ryan says that after that first visit to Vietnam and how happy he was there, he didn't want to let go of that feeling. He started planning his return to the country.</p><p>The veteran returned to his life in the United States and the Air Force, where he completed his service on a military base in Wyoming before being honorably discharged in 2019.</p></div><div><p>Ryan's favorite part of the apartment is his view.</p><p>Louis Corallo for CNBC Make It</p></div><div><p>Soon after leaving the Air Force, Ryan relocated to Vietnam, where he lives off roughly $4,000 a month, according to documents reviewed by CNBC Make It. His monthly income stems from several sources, including VA disability, the GI Bill since he's pursuing a master's degree, and teaching English. Ryan also occasionally takes on odd jobs, such as voiceover work, and is an avid fan of day trading.</p><p>Ryan suffers from spine arthritis, respiratory issues, auditory pain, and mental health challenges from his time in the military.</p><p>\"This might not sound like a lot in America but trust me, this is more than enough to be middle or even above middle class in Vietnam,\" he says.</p><p>When Ryan first arrived, he worked with a longtime friend and realtor to find his first apartment. He moved around a lot at first because of all the noise pollution. He also wanted to take advantage of low rent prices during the covid-19 pandemic.</p><p>\"There's a lot of honking, street sellers and sometimes karaoke really loudly, so if you are very intolerant to noise, this might not be the place for you,\" he says.</p></div><div><p>Ryan says he has no plans of leaving this apartment.</p><p>Louis Corallo for CNBC Make It</p></div><div><p>In 2023, Ryan moved into the two-bedroom, one-bathroom apartment where he currently resides in Ho Chi Minh City. It is in one of the country's tallest residential towers. Ryan says what he loves the most is the view.</p><p>\"The view is so good here. I can't pass it up for everything. I'm never going to resign unless they kick me out,\" he says.</p><p>His utilities round up to about $130, which includes electricity, water and housekeeping.</p></div><div><p>This is Ryan's fourth apartment since he moved to Vietnam in 2019.</p><p>Louis Corallo for CNBC Make It</p></div><div><p>Ryan has been in this space for two years now and has no plans of leaving the apartment — or Vietnam.</p><p>\"If I leave, it's because Vietnam told me to leave. In America, I felt very unmotivated. I felt like no matter how hard you work, you're still in poverty. You're constantly chasing a standard that you can't really achieve,\" he says.</p><p>\"Here in Vietnam, it takes a lot of the monetary pressure out of your day-to-day. You focus on what makes you happy, who you want to become and how you're going to get there.\"</p></div><div><p>Ryan lives in one of the country’s tallest residential towers in Ho Chi Minh City.</p><p>Louis Corallo for CNBC Make It</p></div><div><p>This experience, he says, is the complete opposite of what his life was like back in the U.S.</p><p>\"Every day I wake up with a long to-do list of things I want to do, not the things that I need to do, and it's a completely different way of living. Even if you need to work 40 hours a week here, you're doing it as an investment in your future. Getting out of survival mode makes things infinitely more human.\"</p><p><em><strong>Want to be your own boss?</strong> Sign up for CNBC's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "36-year-old American Air Force vet pays $850 to rent his 2-bedroom apartment in Vietnam— take a look inside",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207526-1759501271324-celia_6.jpg?v=1759501443&w=1920&h=1080"
      ],
      "datePublished": "2025-10-04T14:00:01.000Z",
      "dateModified": "2025-10-04T14:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The shutdown meant no jobs report. Here's what it would have said about the economy",
    "url": "https://www.cnbc.com/2025/10/03/shutdown-jobs-report-economy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108206734-1759352726135-gettyimages-2238210877-US_JOBS.jpeg?v=1759352801&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T19:06:19.000Z",
    "description": "<div><div><p>Recruiters speak to job seekers at the Appalachian State University internship and job fair in Boone, North Carolina, US, on Wednesday, O",
    "body": "<div><div><p>Recruiters speak to job seekers at the Appalachian State University internship and job fair in Boone, North Carolina, US, on Wednesday, Oct. 1, 2025. </p><p>Allison Joyce | Bloomberg | Getty Images</p></div><div><p>If it just seems like the first Friday of the month wasn't the same without being able to pore through the Bureau of Labor Statistics' hotly watched monthly jobs report, don't worry. You probably didn't miss much.</p><p>While the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/bls-wont-be-releasing-data-including-fridays-key-jobs-report-in-case-of-a-shutdown.html\">BLS has gone dark</a> with the shutdown in Washington, other reports outside the government data suggest the labor market just plodded along in September.</p><p>The Dow Jones consensus forecast was for growth of 51,000 in nonfarm payrolls with the unemployment rate holding steady at 4.3%.</p><p>High-frequency data that includes job postings, private payrolls and state-by-state figures for initial jobless claims indicate that while employment growth continues to be anemic, the labor market overall isn't capsizing, at least not anytime soon.</p><p>\"We fight with the army we have at moments like this, where it's critically important that we're figuring out whether the economy is in a moment of transition,\" Chicago Federal Reserve President Austan Goolsbee <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/fed-goolsbee-rates.html\">said in a CNBC interview</a> Friday. \"This is what we have, and thus far it still continues to point to a pretty stable labor market.\"</p><p>The Chicago Fed is one of those organizations looking to provide alternates to BLS data that had come under harsh White House criticism prior to this week's shutdown.</p><p>Though the timing was coincidental, the central bank district in September unveiled <a href=\"https://www.chicagofed.org/research/data/chicago-fed-labor-market-indicators/latest-release\" target=\"_blank\">its own dashboard</a> of data measuring key labor market metrics including unemployment, the hiring rate and the layoff rate.</p><p>Bottom line: The unemployment rate held flat at 4.3%, though another hundredth of a point or two would have pushed it to 4.4% — the highest since October 2021 but still low by historical standards.</p><p>Other nongovernmental data showed similar trends: Conditions overall are softening, with job availability gradually shrinking.</p><p>But employers are still reluctant to part with workers given the lessons from the Covid pandemic, when a rash of layoffs in the early stages was followed by the monumental task of refilling those jobs. At one point, open positions outnumbered available workers by more than 2 to 1.</p><p>\"A lot of the new entrants in the market, young workers, recent graduates, people who are already unemployed [are] having a hard time getting into the market,\" said Cory Stahle, senior economist at job postings site Indeed, which itself provides an encompassing menu of labor market data. \"Regardless of what the unemployment rate is, people taking longer to find jobs is a sign of some economic distress for some households.\"</p></div><h2><a></a>Signs of imbalances</h2><div><p>Indeed's <a href=\"https://data.indeed.com/#/\" target=\"_blank\">measure of job postings</a> shows a decline of about 8.9% from a year ago as of Sept. 26, a sharper drop than the 5.5% reflected in BLS data, which only runs through August.</p><p>Broader trends suggest an uneven labor market, with professions like health care continuing to thrive while other fields lag, Stahle said.</p><p>\"Overall, things are looking pretty good, but a lot of those job gains, a lot of those postings and hiring, are coming from health care, and so it's hard to say that the labor market is fully in balance when it's not providing equal opportunities across different occupations,\" he said.</p><p>BLS data also has shown a fairly sizeable tilt in openings toward health care-related professions, with business and professional services next followed by leisure and hospitality. Government had been a leader but has pulled back since President Donald Trump began his term in January with a vow to pare down the federal payroll.</p><p>\"Right now is a good time to be a nurse, not so good of a time to be working as a software developer,\" Stahle added. \"That bifurcation of the labor market is also an important thing to look at here, not just the overall balance and an overall number.\"</p><p>Other indicators paint a similar picture, though <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/private-payrolls-declined-in-september-by-32000-in-key-adp-report-coming-amid-shutdown-data-blackout.html\">ADP's private payroll count</a> for September showed a decline of 32,000 jobs and an August loss of 3,000 as well. ADP on occasion also has been maligned for being incongruent with BLS data. However, the firm's reports are getting a closer look after it signaled a slowdown in the labor market well before the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/09/jobs-report-revisions-september-2025-.html\">BLS marked down its own counts</a> also to show a weak hiring picture.</p><p>It wasn't just the monthly nonfarm payroll account that went missing because of the shutdown: The Labor Department also didn't release its weekly tally of initial jobless claims.</p><p>Goldman Sachs came to the rescue for that metric, figuring that state-level claims data that was filed pointed to a national total of 224,000 — slightly higher than the previous week but largely in line with trends through most of the year.</p></div><h2><a></a>Other measures</h2><div><p>Beyond simple job or payroll count, spending data also can be a useful indirect gauge.</p><p>Bank of America's credit and debit card tracking showed spending on a steady uptick in September. Total card outlays compared to a year ago increased 2.2% for the week ending Sept. 27.</p><p>\"Spending growth remains solid despite soft labor data. We will continue to monitor this dichotomy,\" BofA economist Shruti Mishra said in a client note.</p><p>Similarly, Fiserv's small business index showed annual sales and transactions increased 2.3% in September, reflecting the same pace for the past three months.</p><p>However, other small business indicators show weakness.</p><p>\"Right now we see that there are a lot of firms that have job openings. There are, unfortunately, very few that get filled,\" Bill Dunkelberg, chief economist at the National Federation of Independent Business, told CNBC on Friday. \"So plans to fill them are always very optimistic, but when the dust clears, very few jobs actually get created.\"</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The shutdown meant no jobs report. Here's what it would have said about the economy",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108206734-1759352726135-gettyimages-2238210877-US_JOBS.jpeg?v=1759352801&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T19:06:19.000Z",
      "dateModified": "2025-10-03T19:06:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taylor Swift's 'The Life of a Showgirl' album release party snares $33 million domestically",
    "url": "https://www.cnbc.com/2025/10/05/taylor-swifts-the-life-of-a-showgirl-album-release-party-box-office.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207806-17595225752025-10-03t201355z_444986308_rc2j4ha0k8r2_rtrmadp_0_music-taylor-swift-album.jpeg?v=1759522609&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-05T15:17:22.000Z",
    "description": "<div><div><p>A person wearing an outfit inspired by The Eras Tour poses in front of \"The Official Release Party of a Showgirl\" posters at an AMC theat",
    "body": "<div><div><p>A person wearing an outfit inspired by The Eras Tour poses in front of \"The Official Release Party of a Showgirl\" posters at an AMC theater to celebrate the release of Taylor Swift’s new album \"The Life of a Showgirl\" in New York City, U.S., Oct. 3, 2025. </p><p>Kylie Cooper | Reuters</p></div><div><p>Taylor Swift gave the box office a boost this weekend.</p><p>In partnership with <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AMC/\">AMC</a><span><span></span></span></span>, the singer-songwriter brought a 90-minute movie to cinemas for one weekend only to celebrate the release of her 12th album, \"The Life of a Showgirl.\"</p><p>The three-day event tallied an estimated $33 million domestically, the biggest album debut event in cinema history. Internationally, the film snared $13 million, bringing the estimated global box office total to $46 million for the weekend.</p><p>\"On behalf of AMC Theatres and the entire theatrical exhibition industry, I extend our sincerest appreciation to the iconic Taylor Swift for bringing her brilliance and magic to movie theatres this weekend,\" AMC's CEO Adam Aron said in a statement Sunday. \"Her vision to add a cinematic element to her incredible album debut was nothing less than a triumph.\"</p><p>Swift's \"The Official Release Party of a Showgirl\" featured a music video for the song \"The Fate of Ophelia,\" as well as behind-the-scenes footage from the music video shoot, lyric videos for other songs on the album and personal reflections from the singer.</p><p>This is the second collaboration between Swift and AMC. In 2023, the theater chain secured the rights to distribute a filmed version of Swift's Eras Tour concert. The concert film generated more than $261 million at the global box office. It is currently the highest-grossing concert film of all time.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taylor Swift's 'The Life of a Showgirl' album release party snares $33 million domestically",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207806-17595225752025-10-03t201355z_444986308_rc2j4ha0k8r2_rtrmadp_0_music-taylor-swift-album.jpeg?v=1759522609&w=1920&h=1080"
      ],
      "datePublished": "2025-10-05T15:17:22.000Z",
      "dateModified": "2025-10-05T15:17:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elon Musk is telling his followers to cancel Netflix subscriptions. Here's what's happening",
    "url": "https://www.cnbc.com/2025/10/02/elon-musk-calls-for-canceling-netflix-whats-happening.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108152705-17486289872025-05-30t181538z_798494356_rc2iseae2w85_rtrmadp_0_usa-trump.jpeg?v=1748633566&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T20:13:51.000Z",
    "description": "<div><div><p>Elon Musk stands in the Oval Office to attend a press event with U.S. President Donald Trump, at the White House in Washington, D.C., U.S",
    "body": "<div><div><p>Elon Musk stands in the Oval Office to attend a press event with U.S. President Donald Trump, at the White House in Washington, D.C., U.S., May 30, 2025. </p><p>Nathan Howard | Reuters</p></div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/elon-musk/\">Elon Musk</a> this week urged his followers to cancel their <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NFLX/\">Netflix</a><span><span></span></span></span> subscriptions over a controversy surrounding an animated show and its creator.</p><p>Musk on Wednesday <a href=\"https://x.com/elonmusk/status/1973292474375479556\" target=\"_blank\">posted</a> on his X platform saying, \"Cancel Netflix for the health of your kids.\" The post was in response to an image accusing Netflix of carrying out a \"transgender woke agenda.\"</p><p>The controversy seems to stem from conservative backlash over an animated Netflix show, \"Dead End: Paranormal Park,\" which features a transgender character. The show was canceled in 2023 after two seasons.</p><p>In addition to several anti-trans posts, Musk also <a href=\"https://x.com/elonmusk/status/1973101319222165785?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1973101319222165785%7Ctwgr%5E6bb1e8bac213d47b901b22d6ba65042b371c9caf%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.firstpost.com%2Fexplainers%2Felon-musk-netflix-boycott-charlie-kirk-controversy-13938760.html\" target=\"_blank\">responded</a> to a post criticizing alleged statements made by the show's creator, Hamish Steele, that a prominent conservative X account said \"mocked\" the murder of conservative activist Charlie Kirk.</p><p>Steele responded to Musk's callout on rival social media platform Bluesky saying, \"It's probably going to be a very odd day.\" Steele also shared a post by TV writer Jack Bernhardt that called \"Dead End\" a \"brilliant show about kind, wonderful characters.\"</p><p>Also this week, vocal conservative activist Robby Starbuck began posting about Netflix, echoing anti-trans sentiments and arguing the company has promoted an ideology that is \"hateful to White Americans.\" Starbuck, who has repeatedly targeted major corporations in recent months over diversity, equity and inclusion efforts, said in one of his X posts on Netflix, \"No one should give this woke company another dime.\"</p><p>Netflix did not respond to requests for comment from CNBC.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108206766-17593554481759355445-41906018363-1080pnbcnews.jpg?v=1759355447&w=750&h=422&vtcrop=y\" alt=\"‘Fast Money’ traders talk Netflix shares dropping after Elon Musk tells people to cancel\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>Analysts say the backlash might not pose as big of a threat to Netflix as Musk may be hoping for.</p><p>Netflix reported 301.63 million subscribers as of the fourth quarter of 2024, the last time it reported the metric before shifting priority to revenue over user growth. The company has a roughly $490 billion market cap, and its stock is up more than 60% in the past year.</p><p>Shares lost nearly 5% over the week. </p><p>\"Is that going to move the needle necessarily? ... You're going to see people sign up on the back of that to counter it,\" CNBC contributor Guy Adami said Wednesday on \"Fast Money.\"</p><p>\"I don't think this is a reason to sell the stock,\" he added.</p><p>Wedbush Securities' Alicia Reese told CNBC that the comments came too late in the third quarter to make any meaningful impact on subscriber counts.</p><p>Still, she said she believes the backlash won't make a major dent and that any impact will be offset by an increase in ad revenue.</p><p>\"Their numbers should come out just fine,\" Reese said. \"I think that shares haven't been hit too hard.\"</p><p>Seymour Asset Management's Tim Seymour said though a day of headlines may move the stock around, Netflix shares are ultimately too expensive to be significantly affected by internet backlash.</p><p>\"We've had these moments in time where, whether it was an ad campaign that went wrong or whether it was some sense that a company was aligned in a particular political channel... I don't think that that's going to be the reason to sell Netflix here,\" Seymour said Wednesday.</p><p>The calls for a boycott mirror those against <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/BUD/\">Anheuser-Busch InBev</a><span><span></span></span></span> in 2023 after it <a target=\"_blank\" href=\"https://www.cnbc.com/2023/06/14/bud-light-beer-sales-trail-modelo-in-may-following-anti-lgbtq-backlash.html\">released</a> an ad campaign with transgender influencer Dylan Mulvaney. But the boycott of Bud Light, CNBC contributor Karen Finerman noted on Wednesday, yielded \"far greater\" destruction than any other recent examples.</p><p>\"I feel like this will be very fleeting,\" Finerman said.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elon Musk is telling his followers to cancel Netflix subscriptions. Here's what's happening",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108152705-17486289872025-05-30t181538z_798494356_rc2iseae2w85_rtrmadp_0_usa-trump.jpeg?v=1748633566&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T20:13:51.000Z",
      "dateModified": "2025-10-03T20:13:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says",
    "url": "https://www.cnbc.com/2025/10/05/trump-layoffs-government-shutdown-kevin-hassett-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108191413-17563120822025-08-27t133731z_1467133196_rc2pfgaixlc2_rtrmadp_0_usa-trump.jpeg?v=1756312180&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-05T16:08:21.000Z",
    "description": "<div><div><p>White House National Economic Adviser Kevin Hassett talks to reporters on the West Wing driveway at the White House in Washington, D.C., ",
    "body": "<div><div><p>White House National Economic Adviser Kevin Hassett talks to reporters on the West Wing driveway at the White House in Washington, D.C., U.S., August 27, 2025. </p><p>Jonathan Ernst | Reuters</p></div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/white-house/\">White House</a> National Economic Council Director <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/20/hassett-likely-to-be-trumps-pick-for-fed-chief-though-warsh-is-more-qualified-cnbc-survey-finds.html\">Kevin Hassett</a> said Sunday that layoffs for federal employees will begin if President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> decides that congressional negotiations to end the government shutdown \"are absolutely going nowhere.\"</p><p>\"I think that everybody's still hopeful that when we get a fresh start at the beginning of the week, that we can get the Democrats to see that it's just common sense to avoid layoffs like that,\" Hassett said on CNN's \"State of the Union.\"</p><p>His comments come as the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/government-shutdown-updates-thune-trump.html\">government shutdown</a> enters its fifth day, with no clear offramp in sight.</p><p>Democrats are holding their ground on their health-care demands, pushing to include a permanent extension of enhanced premium tax credits in any government funding legislation.</p></div><div><h2>Read more CNBC politics coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/05/trump-layoffs-government-shutdown-kevin-hassett-.html\">'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/trump-face-coin-treasury-dollar.html\">Treasury weighs minting $1 coin with Trump's face for U.S. 250th anniversary</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/government-shutdown-updates-thune-trump.html\">Government shutdown: Senate funding measures fail again as deadlock continues</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-israel-gaza-hamas-peace-plan.html\">Watch: Trump details plan to end Israel war with Hamas in Gaza</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-health-government-shutdown-jeffries-schumer.html\">Democrats refuse to cave on health care before Trump government shutdown meeting</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-zohran-mamdani-eric-adams-new-york-mayor.html\">Trump bashes Zohran Mamdani after Eric Adams drops out of New York mayor's race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-movie-furniture-tariffs.html\">Trump 'Truths' about tariffs on films and furniture raise questions on details</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/trump-mass-firings-government-shutdown.html\">Trump threatens mass firings if shutdown isn't averted: NBC News</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/government-shutdown-trump-democrats-republicans-health-care.html\">Republicans say Obamacare tax credit fight can wait until after shutdown averted</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/jd-vance-trump-tiktok-china-bytedance.html\">JD Vance on Tiktok: U.S. 'successfully separated' TikTok from China's ByteDance</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/eric-adams-new-york-city-mayor-race-trump-.html\">Eric Adams drops out of New York City mayoral race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/27/trump-cartoon-firing-powell-fed.html\">President Trump posts cartoon image depicting him firing Fed Chief Powell</a></li></ul></div></div><div><p>Republicans, however, argue that those conversations should happen in December — not as part of government shutdown negotiations — escalating the standoff.</p><p>Democrats continue to dig in on their demands as the shutdown enters a new week.</p><p><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/government-shutdown-updates-thune-trump.html\">The Senate again</a> on Friday failed to pass two <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/trump-chicago-infrastructure-shutdown-vought.html\">funding</a> bills that would have ended the shutdown. The Republican measure would have funded the government through late November, while Democrats' version included additional health-care funding.</p><p>The resolutions previously failed multiple times in the upper chamber last week.</p><p>The Trump administration has repeatedly <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/what-the-government-shutdown-means-for-federal-workers.html\">warned of mass layoffs</a> during a government shutdown, saying last week that they would be \"imminent.\"</p><p>Trump also <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/trump-government-shutdown-updates-vought.html\">said</a> that the shutdown offered him an \"unprecedented opportunity\" to slash the size of federal agencies and lay off government workers, although the administration has not yet followed through on its threat.</p><p>Hassett said Sunday that Trump and Office of Management and Budget Director Russ Vought are \"lining things up and getting ready to act if they have to, but hoping that they don't.\"</p><p>Still, Hassett expressed optimism that negotiations this week could resolve the impasse.</p><p>\"We think the Democrats, there's a chance that they'll be reasonable once they get back into town on Monday,\" Hassett said on CNN.</p><p>\"And if they are, then I think there's no reason for those layoffs.\"</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108191413-17563120822025-08-27t133731z_1467133196_rc2pfgaixlc2_rtrmadp_0_usa-trump.jpeg?v=1756312180&w=1920&h=1080"
      ],
      "datePublished": "2025-10-05T16:08:21.000Z",
      "dateModified": "2025-10-05T16:08:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "To be a better communicator, 'you have to have a tolerance for discomfort,' says Brené Brown: These 3 phrases can help you navigate a conflict",
    "url": "https://www.cnbc.com/2025/10/05/brene-brown-good-communicators-have-a-tolerance-for-discomfort-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207730-1759516491223-gettyimages-2204469378-_h_10988_kq5fgvil.jpeg?v=1759516528&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-05T15:00:01.000Z",
    "description": "<div><div><p>Brené Brown's ninth book, \"Strong Ground: The Lessons of Daring Leadership, the Tenacity of Paradox, and the Wisdom of the Human Spirit,\"",
    "body": "<div><div><p>Brené Brown's ninth book, \"Strong Ground: The Lessons of Daring Leadership, the Tenacity of Paradox, and the Wisdom of the Human Spirit,\" published last month.</p><p>The University of Houston <a href=\"https://brenebrown.com/\" target=\"_blank\">research professor</a>, podcaster and bestselling author recently went on The New York Times' podcast \"<a href=\"https://www.nytimes.com/2025/09/06/magazine/brene-brown-interview.html\" target=\"_blank\">The Interview</a>\" to discuss the book's various themes like courageous leadership and discipline.</p><p>On the theme of communication, journalist Lulu Garcia-Navarro asked Brown a frank question: \"Why do you think we suck at it?</p><p>\"We don't teach people how <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/17/one-leadership-approach-gen-zers-wont-accept-said-bren-brown.html\">to communicate</a> well,\" Brown responded.</p><p>\"Good communication <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/bren-brown-on-two-elements-of-her-success-i-dont-really-care-if-im-inspirational.html\">is vulnerable</a>,\" she said. \"It's hard. You have to have a tolerance for discomfort if you want to communicate well and honestly. And that's at every level in an organization, in a family. It doesn't matter.\"</p><p>Effective communication is about being clear and \"using the <a target=\"_blank\" href=\"https://www.cnbc.com/2023/05/26/brene-brown-simon-sinek-successful-people-master-these-soft-skills.html\">right words</a> to describe what we want to do, what we mean and what we need,\" Brown said. It's about calling someone instead of texting.</p><p>\"Tone is lost on text,\" Brown said.</p><p>And it's about taking accountability when you've said something that upset someone. \"I think behaviorally, no one's taught how to do that,\" she said.</p></div><h2><a></a>Use these 3 phrases to navigate conflict and communicate better</h2><div><p>Experts agree we could all learn to communicate better. As it pertains to taking accountability, specifically, it can be challenging to keep your cool during a difficult conversation. When conflicts arise, try using the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/27/11-phrases-to-help-you-gain-influence-and-navigate-awkwardness-at-work-from-communication-experts.html\">following phrases</a>.</p><ul><li><strong>'It sounds like what's most important to you in this situation is …' </strong>This is a phrase<strong> </strong>career coach<strong> </strong><a href=\"https://www.betterwithphoebe.com/\" target=\"_blank\">Phoebe<strong> </strong>Gavin</a> previously told CNBC Make It she recommends using. Paraphrasing the main point of someone's argument helps show that you're listening.</li></ul><ul><li><strong>'It makes sense that you feel that way,' </strong><a href=\"https://alisonwoodbrooks.com/\" target=\"_blank\">Alison Wood Brooks</a>, associate professor of business administration at Harvard Business School, previously told Make It.<strong> </strong>This phrase helps you lead with empathy<strong> </strong>if the person you're speaking with seems especially upset.</li></ul><ul><li><strong>'I want to make sure I understand,' </strong>multiple experts suggest.<strong> </strong>In conflict, it is key to validate the other person's feelings and perspectives. This phrase helps you do just that.</li></ul><p>Try keeping these phrases in mind when you're having a tough conversation. \"I think communication has never been more important than it is right now,\" said Brown.</p><p><em><strong>Want to be your own boss?</strong> Sign up for CNBC's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108207650-250929-mg-08-himi-matthews-goodies_CLEAN.jpg?v=1759509666&w=750&h=422&vtcrop=y\" alt=\"How I bring in over $1 million a year working just two hours a day\" /><span></span><span><span></span></span></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "To be a better communicator, 'you have to have a tolerance for discomfort,' says Brené Brown: These 3 phrases can help you navigate a conflict",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207730-1759516491223-gettyimages-2204469378-_h_10988_kq5fgvil.jpeg?v=1759516528&w=1920&h=1080"
      ],
      "datePublished": "2025-10-05T15:00:01.000Z",
      "dateModified": "2025-10-05T15:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Trump's tax changes could impact your year-end charitable giving",
    "url": "https://www.cnbc.com/2025/10/05/trumps-tax-changes-charitable-giving.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207581-1759505830831-gettyimages-1352553979-186a8181-417_r.jpeg?v=1759505860&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-05T11:30:01.000Z",
    "description": "<div><div><p>New Year celebration concept. Front view. Close-up</p><p>Anna Efetova | Moment | Getty Images</p></div><div><p>President <a target=\"_blan",
    "body": "<div><div><p>New Year celebration concept. Front view. Close-up</p><p>Anna Efetova | Moment | Getty Images</p></div><div><p>President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a>'s \"big beautiful bill\" added <a target=\"_blank\" href=\"https://www.cnbc.com/guide/what-trumps-one-big-beautiful-bill-means-for-your-money/\">trillions of dollars of tax breaks</a>, some of which could impact <a target=\"_blank\" href=\"https://www.cnbc.com/taxes/\">your deduction</a> for charitable giving.</p><p>U.S. individual giving <a href=\"https://philanthropy.indianapolis.iu.edu/news-events/news/_news/2025/giving-usa-2025.html\" target=\"_blank\">grew to $392.45 billion</a> in 2024, up by about 5%, including inflation, from the previous year, according to Giving USA's annual report released in June.</p><p>But as the calendar winds down, your 2025 year-end giving strategy could look different than that of previous years, financial experts say.</p><p><strong>More from Personal Finance:</strong><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/sp-500-set-it-and-forget-it-strategy.html\">With S&P 500 near record highs, reconsider the set-it-and-forget-it strategy</a><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/government-shutdown-social-security-benefit-payments.html\">What the government shutdown means for Social Security benefits</a><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/best-financial-advisors.html\">CNBC's Financial Advisor 100: Best financial advisors for 2025 ranked</a></p><p>When planning for charitable giving, investors should consider a \"multi-year approach,\" especially after the latest tax law changes, according to Dianne Mehany, who leads the private tax group of EY's national tax department in Washington, D.C.</p><p>Here is a breakdown of some of the key changes — and how they could impact your year-end donations.</p></div><h2><a></a>This is a 'no-brainer' for smaller gifts</h2><div><p>When filing taxes, you claim the greater of your itemized tax breaks or the standard deduction. For 2025, the standard deduction is now <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/03/trump-big-beautiful-bill-tax-changes.html\">$15,750 for single filers</a> and $31,500 for married couples filing jointly.</p><p>But <a href=\"https://www.irs.gov/pub/irs-pdf/p4801.pdf\" target=\"_blank\">90% of filers</a> don't itemize, according to the latest IRS data, which prevents most filers from claiming the <a href=\"https://www.irs.gov/charities-non-profits/charitable-organizations/charitable-contribution-deductions\" target=\"_blank\">charitable deduction</a>.</p><p>This will soon change thanks to Trump's legislation. Starting in 2026, there's a <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/01/trumps-big-beautiful-bill-charitable-deduction.html\">new charitable tax break</a> for non-itemizers, worth up to $1,000 for single filers and $2,000 for married couples filing jointly.</p></div><div><p>With the change happening in 2026, it could make sense to delay smaller, year-end gifts if you typically don't itemize deductions, experts say.</p><p>\"It seems like a no-brainer to just do it in January and capture a little benefit that you wouldn't otherwise achieve,\" certified financial planner Edward Jastrem, chief planning officer at Heritage Financial Services in Westwood, Massachusetts, <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/01/trumps-big-beautiful-bill-charitable-deduction.html\">previously told CNBC</a>.</p></div><h2><a></a>There's a 'double hit' for top earners</h2><div><p>Trump's legislation could also <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/05/trump-big-beautiful-bill-charitable-deduction.html\">shrink the charitable deduction</a> for some higher earners in 2026, experts say.</p><p>Starting in 2026, there's an itemized charitable deduction \"floor,\" which only permits the tax break once it exceeds 0.5% of your adjusted gross income. Plus, the new law caps the benefit for filers in the top <a target=\"_blank\" href=\"https://www.cnbc.com/2024/10/22/irs-2025-federal-income-tax-brackets.html\">37% income tax bracket</a>, also beginning in 2026.</p><p>\"You're essentially reducing your benefit to 35% instead of 37%,\" which \"feels like a double hit,\" when combined with the 0.5% deduction floor, said Mehany from EY.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108206901-17594027821759402780-41913755879-1080pnbcnews.jpg?v=1759402782&w=750&h=422&vtcrop=y\" alt=\"Tax changes for charitable giving: Here's what to know\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>With the charitable deduction reductions for 2026, \"there's some benefit to accelerating [donations] this year,\" said certified public accountant Sheneya Wilson, founder and CEO of Fola Financial in New York.</p><p>One option to frontload gifts in 2025 could be using a so-called <a target=\"_blank\" href=\"https://www.cnbc.com/2023/11/27/why-wealthy-people-use-donor-advised-funds-for-charitable-gifts.html\">donor-advised fund</a>, which works like a charitable checkbook.</p><p>You receive an upfront charitable deduction on transferred assets by \"bunching\" multiple years of gifts into a single year. Then, you can invest and potentially grow the balance while choosing grants for public charities later. </p><p><em>Sharon Epperson</em> <em>contributed to reporting for this story.</em></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Trump's tax changes could impact your year-end charitable giving",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207581-1759505830831-gettyimages-1352553979-186a8181-417_r.jpeg?v=1759505860&w=1920&h=1080"
      ],
      "datePublished": "2025-10-05T11:30:01.000Z",
      "dateModified": "2025-10-05T11:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Inside the uranium plant at the center of U.S. plans to expand nuclear power",
    "url": "https://www.cnbc.com/2025/10/04/urenco-centrus-orano-enriched-uranium-nuclear-russia-ai-data-center.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108201973-1758544014913-IMG_7639.jpg?v=1758632648&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-04T12:40:09.000Z",
    "description": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108156792-1749500125439-Energy_Fuels_Pinyon_Plain_Mine.jpg?v=1749500298&w=750&h=422&vtcro",
    "body": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108156792-1749500125439-Energy_Fuels_Pinyon_Plain_Mine.jpg?v=1749500298&w=750&h=422&vtcrop=y\" alt=\"Why U.S. companies are reopening uranium mines\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>EUNICE, NEW MEXICO — Paul Lorskulsint was a shift manager at a brand new uranium enrichment facility deep in the American Southwest when catastrophe struck Japan in 2011.</p><p>A massive tsunami and earthquake had caused a severe accident at the Fukushima Daiichi Nuclear Power Plant. Thousands of miles away in Eunice, New Mexico, Lorskulsint turned on the television to make sure his team could witness what was happening across the Pacific Ocean.</p><p>Lorskulsint knew the disaster in Japan was a watershed moment for the nuclear industry. The plant where he was leading an operations shift had just opened in 2010, after the European uranium enricher Urenco had spent years building the facility in anticipation of growing demand.</p><p>Over the ensuing decade, public support for nuclear power diminshed and a dozen reactors closed in the U.S. as the industry struggled to compete against a flood of cheap natural gas and renewable energy. Demand for the low enriched uranium that fuels nuclear plants dwindled.</p><p>\"The price of what we sold basically went through the floor,\" Lorskulsint, who is now the chief nuclear officer at Urenco USA, told CNBC. Urenco's long-term contracts with utilities insulated the facility during the downturn, he said, but the price drop put further expansion plans on hold.</p></div><div><p>Paul Lorskulsint, Chief Nuclear Officer, Urenco USA talks about the uranium enrichment process. </p><p>Adam Jeffery | CNBC</p></div><div><p>Headquartered outside London, Urenco is joinly owned by the British and Dutch goverments and two German utilities. Its New Mexico facility is the only commercial enrichment facility left in the U.S. The last U.S.-owned commercial facility in Paducah, Kentucky, closed in 2013 and its owner the United States Enrichment Corporation went bankrupt during the downturn after Fukushima.</p><p>Fourteen years later, the situation has reversed once again. Urenco USA is racing to expand its enrichment capacity. The nuclear industry is gaining momentum as electricity demand in the U.S. is projected to surge from artificial intelligence and the push to expand domestic manufacturing. Doubts persist about whether U.S. power supplies will ramp up quick enough to meet the needs. Increasing uranium enrichment will be a key part of the process, despite the history of past disappointments. </p><p>Also, U.S. enriched uranium supplies are at risk. The U.S. still imported 20% of its <a href=\"https://www.eia.gov/uranium/marketing/pdf/2024%20UMAR.pdf\" target=\"_blank\">enriched uranium from Russia</a> in 2024, a legacy of the now shattered hope for friendship between the two countries after the collapse of the Soviet Union and end of the Cold War.</p><p>The U.S. will completely ban the import Russian uranium by 2028 in repsonse to Moscow's full-scale invasion of Ukraine, leaving a gapping supply deficit just when Washington, the utilities and the tech sector are developing the most ambitious plans in decades to build new reactors.</p><p>Nuclear plants like <a target=\"_blank\" href=\"https://www.cnbc.com/2025/03/22/michigan-nuclear-plant-shows-challenges-us-safely-restart-old-reactors-.html\">Palisades</a> in Michigan, <a target=\"_blank\" href=\"https://www.cnbc.com/2024/11/16/look-inside-the-three-mile-island-nuclear-power-plant.html\">Crane Clean Energy Center</a> in Pennsylvania and <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/01/nuclear-duane-arnold-nextera-nee-tech-data-center-ai.html\">Duane Arnold</a> in Iowa are planning to restart operations this decade after closing years ago. The tech sector is investing hundreds of millions of dollars to bring advanced reactors online in the 2030s to help power their computer warehouses that train and run AI applications.</p><p>\"It is a pivotal moment, the next five to 10 years for the nuclear industry,\" Lorskulsint said. \"We're going to have to have to deliver on time, on schedule and continue to maintain that momentum, which is a significant challenge.\"</p></div><div><p>Employees at Urenco USA receive a cylinder of feed material for enrichment process.</p><p>Adam Jeffery | CNBC</p></div><h2><a></a>Expansion plans</h2><div><p>In deeply divided Washington, support for nuclear power is one of the few issues that can still muster some bipartisan support. President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> wants to <a target=\"_blank\" href=\"https://www.cnbc.com/2025/05/23/trump-nuclear-executive-order.html\">quadruple nuclear power by 2050</a>, a significant increase over President Joe Biden's previous goal to triple it by that date.</p><p>The U.S. has only built one new nuclear plant from scratch in the past 30 years, raising doubts about whether such ambitious plans can be realized. But any effort big or small to expand nuclear power in the U.S. will run through Urenco's facility in New Mexico.</p><p>The plant currently has capacity to supply about a third of U.S. demand with $5 billion invested in the facility to date. Urenco is expanding its capacity in New Mexico by 15% through 2027 as utilties replace Russian fuel. It has installed two new centrifuge cascades for enrichment this year. But Urenco's expansion alone won't fill the Russian supply gap, Lorskulsint said.</p><p>\"Our competitors will have to expand in order to make sure that as a whole the industry is still supplied,\" he said. \"We're building quickly as we can to make sure that the the industry is not short handed.\"</p><p>As Russian fuel is banned from the U.S., the Trump administration is pushing for 10 new large reactors to start construction this decade. <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/GOOGL/\">Alphabet</a><span><span></span></span></span> is investing in about 2 gigawatts of new nuclear, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AMZN/\">Amazon</a><span><span></span></span></span> has committed to more than 5 gigawatts, and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/META/\">Meta</a><span><span></span></span></span> wants to bring up to 4 gigawatts online.</p></div><div><p>Urenco USA Facilities in Eunice, New Mexico.</p><p>Adam Jeffery | CNBC</p></div><div><p>The industry is worried about the supply gap, Lorskulsint said, but filling it \"is not an insurmountable task.\"</p><p>Urenco USA is a candidate to receive a contract from the Department of Energy to produce more low-enriched uranium, part of <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/mp-materials-lithium-americas-lac-rare-earth-trump-stake.html\">U.S. efforts to standup a domestic nuclear supply chain</a>. The contract would allow the New Mexico facility to expand further with the construction of a fourth production building.</p><p>Urenco's competitors are also seeking support from the Energy Department to build out U.S. enrichment capacity. France's Orano is planning to build a facility in Oak Ridge, Tennesse, with operations potentially starting in the 2030s.</p><p>Publicly traded <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/LEU/\">Centrus</a><span><span></span></span></span> has a facility in Piketon, Ohio, where it plans to produce low-enriched uranium, but it hasn't yet started commercial operations. Centrus is the successor company to the United States Enrichment Corporation that went bankrupt in 2013.</p><p>Centrus stock has gained more than 400% this year as investors bet on a growing demand for enriched uranium due to U.S. plans to expand nuclear power.</p></div><div><p>Paul Lorskulsint, Chief Nuclear Officer, Urenco USA talks about the uranium enrichment process next to centrifuge cascade.</p><p>Adam Jeffery | CNBC</p></div><h2><a></a>Supply chain bottlenecks</h2><div><p>But enrichment is just one stage in a long supply chain that will be stretched by growing demand. Uranium delivered to the U.S is often mined in Canada and it is then converted into intermediate state called uranium hexafluoride that is the feedstock for enrichment.</p><p>The feedstock is spun in Urenco's centrifuges to increase the presence of the isotope Uranium-235 to 5%, the level needed for most nuclear plants. The enriched uranium is then shipped to fuel fabricators that manufacture the pellets that go into reactors in power plants.</p><p>U.S. nuclear plants are facing cumulative supply gap of 184 million pounds of uranium through 2034, according to the Energy Information Administration.The biggest bottleneck right now for Urenco is the conversion of uranium into the feedstock for enrichment, Lorskulsint said. There are only three facilities in the Western world located in Canada, France and Illinois that convert uranium into feedstock.</p><p>\"Every portion of the supply chain is going to have to expand, it's not just about enrichment,\" Lorskulsint said. \"We need more of everything but conversion right now is the bottleneck.\"</p><p>The nuclear supply chain may not be the biggest challenge in the end, the executive said. The ageing U.S. electric grid could prove to be the real constraint on building new nuclear due how long it takes to complete upgrades, he said. While this could slow Urenco down, it won't stop the expansion, he said.</p><p>\"We came here when the market demanded it,\" Lorskulsint said of Urenco's investment in the U.S. \"We were here when the market didn't demand it. And we are now expanding to make sure that we can still support as much as the market needs from us.\"</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inside the uranium plant at the center of U.S. plans to expand nuclear power",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108201973-1758544014913-IMG_7639.jpg?v=1758632648&w=1920&h=1080"
      ],
      "datePublished": "2025-10-04T12:40:09.000Z",
      "dateModified": "2025-10-04T12:40:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lyft CEO left Microsoft in the 90s to join a tiny startup called Amazon—here's how Jeff Bezos convinced him",
    "url": "https://www.cnbc.com/2025/10/04/how-jeff-bezos-convinced-lyft-ceo-to-quit-microsoft-join-amazon-in-the-90s.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108132715-17448118692025-04-16t135527z_1680667919_rc20zda4lzqj_rtrmadp_0_usa-lyft-ceo.jpeg?v=1744811897&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-04T13:00:01.000Z",
    "description": "<div><div><p>In 1996, <a target=\"_blank\" href=\"https://www.cnbc.com/2025/05/09/lyft-ceo-i-learned-these-lessons-from-bill-gates-jeff-bezos.html\">David",
    "body": "<div><div><p>In 1996, <a target=\"_blank\" href=\"https://www.cnbc.com/2025/05/09/lyft-ceo-i-learned-these-lessons-from-bill-gates-jeff-bezos.html\">David Risher told Bill Gates he was quitting his management role at Microsoft</a>, then already one of the world's largest companies with annual revenue of nearly $8.7 billion, to take a job at a \"tiny, little bookstore online,\" called Amazon.</p><p>\"It wasn't an entirely rational move,\" Risher, who is now CEO of Lyft, admitted on an episode of the Fortune Leadership Next podcast that aired on Sept. 30. Risher served as Amazon's senior vice president of U.S. retail between 1997 and 2002.</p><p>In fact, Bill Gates tried to talk Risher out of the move, he said on the podcast, reminding him he'd been \"successful\" at the larger company, where Risher had developed Microsoft's first database product, called Access.</p><p>Gates — then the world's wealthiest person, with a net worth estimated by Forbes at <a href=\"https://www.latimes.com/archives/la-xpm-1996-07-01-fi-20274-story.html\" target=\"_blank\">$18 billion</a> in September 1996 — was surprised Risher would want to leave Microsoft for an internet startup that reported annual revenue of just <a href=\"https://www.aboutamazon.com/news/company-news/amazons-original-1997-letter-to-shareholders\" target=\"_blank\">$15.7 million</a> in 1996, only two years after Jeff Bezos founded the company.</p><p>\"'Things are going well [here]. You mean to tell me you're leaving this company for some tiny, little internet bookstore that nobody's ever heard of … that has got to be the stupidest decision I've ever heard anyone make,'\" Risher said Gates told him at the time. A spokesperson for Gates did not immediately respond to CNBC Make It's request for comment.</p><p>While Risher understood the inherent risk of leaving an established tech giant for a much smaller, and unproven, startup, Amazon's founder had made a convincing case, Risher said.</p></div><h2><a></a>'We'll be a billion-dollar business' by 2000</h2><div><p>Risher actually first met Bezos over the phone a year before joining Amazon, when the founder called him to check a work reference for another new employee Bezos was hiring. </p><p>\"We had a great conversation and I was really impressed by the questions he asked, and that the CEO of Amazon would take 45 minutes to personally do a background check,\" Risher told journalist Danielle Newnham in a <a href=\"https://medium.com/swlh/david-risher-the-quiet-revolutionary-1e6d1512eadb\" target=\"_blank\">2015 interview</a>.</p><p>By 1996, Risher had become so impressed with Bezos and Amazon that he began interviewing for a job at the young startup. There were two things about Bezos that convinced Risher he was making the right decision, he said. The first was Bezos' obsession with the customer experience.</p><p>\"The idea that you, personally, can improve the lives of millions of customers if you take the responsibility seriously is very powerful,\" he told Newnham.</p><p>The other part of Bezos' pitch that won over Risher was the entrepreneur's confidence that Amazon could be the next huge tech company. </p><p>At the time, Amazon had a \"relatively small business\" that <a target=\"_blank\" href=\"https://www.cnbc.com/2024/01/13/in-1997-jeff-bezos-said-why-he-chose-books-to-sell-on-amazon.html\">initially only focused on selling books</a>. But, Bezos had a clear vision that would start with books and eventually expand to more and more product categories until Amazon became the \"<a target=\"_blank\" href=\"https://www.cnbc.com/2020/10/08/jeff-bezos-amazon-turned-into-the-everything-store-because-of-an-email-i-sent-in-1997.html\">everything store</a>\" it is today.</p><p>\"'I think if we do everything right, by the time we're in the year 2000, we'll be a billion-dollar business,'\" Bezos said, according to Risher.</p></div><h2><a></a>A 'very compelling' opportunity</h2><div><p>Risher obviously bought into Bezos' vision for Amazon. He found the opportunity to be at the forefront of that sort of massive, rapid growth to be \"very compelling,\" he said.</p><p>\"I thought to myself: 'How often do you get to be at a company that's right at this crazy intersection of technology and culture and all these different things, and build something that could be a billion-dollar company?'\" he told Fortune.</p><p>Amazon ended up beating Bezos' prediction by one year, hitting $1.6 billion in annual revenue in 1999. Risher was a huge part of that growth, joining Amazon as the company's 37th employee overall, he said. Risher's role involved expanding Amazon into a variety of new product categories, including music, movies and toys.</p><p>When Risher left the company to become a business professor at the University of Washington in 2002, Amazon's annual revenue was $3.9 billion.</p><p>Now 60 years old, Risher has led Lyft since 2023 and he still takes leadership inspiration from his former bosses, the billionaires Gates and Bezos, <a target=\"_blank\" href=\"https://www.cnbc.com/2025/05/09/lyft-ceo-i-learned-these-lessons-from-bill-gates-jeff-bezos.html\">Risher often says</a>. He also fondly remembers the excitement of Amazon's early years.</p><p>\"It was really quite a rocket ship, which is always a fun thing to be on,\" Risher said. \"That building of something that hadn't been built before at that scale was really very exciting.\"</p><p><em><strong>Want to be your own boss?</strong> Sign up for CNBC's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108199266-1758027174439-GettyImages-1056373084.jpg?v=1758027217&w=750&h=422&vtcrop=y\" alt=\"The ultimate guide to starting your own business: A CNBC Make It course\" /><span></span><span><span></span></span></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lyft CEO left Microsoft in the 90s to join a tiny startup called Amazon—here's how Jeff Bezos convinced him",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108132715-17448118692025-04-16t135527z_1680667919_rc20zda4lzqj_rtrmadp_0_usa-lyft-ceo.jpeg?v=1744811897&w=1920&h=1080"
      ],
      "datePublished": "2025-10-04T13:00:01.000Z",
      "dateModified": "2025-10-04T13:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Global week ahead: Bull markets, bubbles and 'Swiftonomics'",
    "url": "https://www.cnbc.com/2025/10/05/global-week-ahead-bull-markets-bubbles-and-swiftonomics.html",
    "image": "https://image.cnbcfm.com/api/v1/image/102305597-101637597.jpg?v=1759390104&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-05T02:01:17.000Z",
    "description": "<div><div><p>Siegfried Layda | Getty Images</p></div><div><p>\"It was the best of times, it was the worst of times, it was the age of wisdom, it was th",
    "body": "<div><div><p>Siegfried Layda | Getty Images</p></div><div><p>\"It was the best of times, it was the worst of times, it was the age of wisdom, it was the age of foolishness,\" Charles Dickens famously wrote. That aptly captures the dislocation between political events and market action as we go into the next week.</p><p>The U.S. government shutdown has stoked worries about its adverse impact globally, but it does not seem to have dampened the risk-on sentiment across major equity markets. The political deadlock in Washington, D.C. looks set to continue into next week, with concerns the Trump administration could <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/trump-government-shutdown-updates-vought.html\">use the funding freeze to permanently slash roles</a> and cancel certain projects.</p><p>While there has been much research on what an extended shutdown could mean for stocks, major U.S. and European indexes have been notching record highs. That comes as fund flows data from the Bank of America shows $26 billion moved into global equities during the week ended Oct. 1, with a record $9.3 billion going into the technology sector.</p></div><div><div><svg width=\"256\" height=\"256\">Stock Chart IconStock chart icon</svg><p><img src=\"https://static-redesign.cnbcfm.com/dist/a54b41835a8b60db28c2.svg\" alt=\"hide content\" /></p></div><p>Fresh Record Highs</p></div><div><p>But amid this optimism, another narrative is growing. An increasing number of market participants are warning that bubbles are forming in parts of the market, with some saying this could lead to a larger market correction.</p><p>Saxo's warning is \"don't predict, prepare.\" In a recent note, the bank said \"the mood could hardly be more conflicted. Equity indices hover near record highs ... yet consumer sentiment remains close to historic lows,\" encouraging investors to diversify to protect against instability.</p><p>There are red flags in the credit markets in particular. Barnaby Martin from Bank of America told \"<a target=\"_blank\" href=\"https://www.cnbc.com/squawk-box-europe/\">Squawk Box Europe</a>\" their recent survey showed credit investors have one of the \"biggest overweights ever in the 20-year history\" of that survey, warning there were increasing concerns about market bubbles.</p><p>Last week, U.S. car parts manufacturer First Brands filed for bankruptcy after revealing a $12 billion debt pile through the use of off-balance sheet financing. Famed short-seller Jim Chanos <a href=\"https://www.ft.com/content/395ca469-7315-4d66-ae74-6a47bda751ae\" target=\"_blank\">told the Financial Times</a> he \"suspects we are going to see more of these things,\" warning the increasingly expansive private credit market has echoes of the subprime crisis.</p><p>A bubble that does not seem at risk of bursting is the one formed around multi-award-winning pop star Taylor Swift. Her latest album \"The Life of a Showgirl\" was released worldwide on Friday following months of anticipation for fans. It follows her record-breaking Eras Tour that topped $2 billion in ticket sales alone.</p></div><div><p>Kate Green | Getty Images Entertainment | Getty Images</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Global week ahead: Bull markets, bubbles and 'Swiftonomics'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/102305597-101637597.jpg?v=1759390104&w=1920&h=1080"
      ],
      "datePublished": "2025-10-05T02:01:17.000Z",
      "dateModified": "2025-10-05T02:01:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I'm a psychologist who studies couples—here's the No. 1 thing people fight about in relationships",
    "url": "https://www.cnbc.com/2025/10/05/psychologist-the-no-1-thing-couples-fight-about-in-relationships.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207779-1759520403557-Couples_Fight_CNBC_Illo_de_Recat_Pink.jpg?v=1759520446&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-05T16:05:24.000Z",
    "description": "<div><div><p>When people ask me what couples fight about the most, they expect the usual suspects like money, sex or parenting. But after years of res",
    "body": "<div><div><p>When people ask me what couples fight about the most, they expect the usual suspects like money, sex or parenting. But after years of research, and from real-life experience in my own marriage, the answer is much simpler: <a target=\"_blank\" href=\"https://www.cnbc.com/2025/06/08/im-a-psychologist-who-studies-couples-what-people-fight-about-the-most-in-relationships.html\">tone of voice</a>.</p><p>That's right. It's not the dishes in the sink or the unpaid credit card bill. It's how partners <em>speak</em> to each other about those things that creates tension.</p></div><h2><a></a>Tone can matter more than what you say</h2><div><p>It only takes a subtle shift in tone — a sigh, an eye-roll, or a sharp edge in your voice — for a simple question like \"Did you take out the trash?\" or \"Sure, whatever you say...\" to land like an accusation.</p><p>Research backs this up: <a href=\"http://doi.org/10.5964/ijpr.v7i1.119\" target=\"_blank\">One study</a> found that when we interpret messages, only a small portion comes from the actual words. The rest? It's all nonverbal: facial expressions, body language, and especially tone.</p><p>When we argue with someone we love, <a href=\"https://today.yougov.com/society/articles/42707-how-and-why-do-american-couples-argue\" target=\"_blank\">tone tends to dominate</a> because it carries emotional weight. A clipped delivery can sound like blame. A flat one might feel like indifference. Sarcasm can come across as contempt.</p><p>We often don't remember the exact words said in a fight. But we do remember how our partner sounded and how it made us feel.</p></div><h2><a></a>If you're the one with the sharp tone...</h2><div><p>We all slip up. When we're tired, stressed, or distracted, our tone can betray our actual intentions.</p><p>The fix is to catch yourself in real time. If you notice your voice is harsher than intended, pause. Then, try these simple repair moves: </p><ul><li>\"Sorry, I didn't mean for that to come out so sharp. Let me say it differently.\"</li><li>\"I realize that sounded a lot harsher than what I intended. What I'm trying to say is...\"</li><li>\"Hold on, I don't like how that came out. Let me try that again.\"</li></ul><p>It doesn't need to be dramatic, but you should be honest. That means calling yourself out instead of pretending nothing happened. With practice, this honesty becomes easier: You build the muscle by noticing your slip-ups, owning them quickly, and then rephrasing. </p><p>These small adjustments show your partner that you're self-aware, and it can stop an argument before it snowballs.</p></div><h2><a></a>If you're on the receiving end…</h2><div><p>When your partner's tone turns sharp, it's natural to mirror it. But doing that often leads to a blame spiral about <em>how </em>you're fighting, instead of resolving the actual issue.</p><p>The key is to interrupt the cycle without escalating it. Try saying:</p><ul><li>\"I didn't like the way that sounded. Can you say it a different way?\"</li><li>\"I want to hear you out, but your tone is making that difficult for me right now. Can you try again?\"</li><li>\"I get that you're frustrated, but can you explain that for again a little more calmly?\"</li></ul><p>No accusations. No defensiveness. Just a simple nudge toward better communication.</p></div><h2><a></a>When both of you are stuck in a bad tone loop</h2><div><p>Sometimes, both partners fall into the tone trap. One person gets defensive, the other responds with more edge. Soon, you're both in a reactive back-and-forth.</p><p>The only way out? Someone has to be brave enough to hit the reset button.</p><p>I call it a \"reset phrase.\" This could be:</p><ul><li>\"Let's start over.\"</li><li>An inside joke.</li><li>A nonverbal gesture like a hand squeeze.</li></ul><p>In my marriage, sometimes my wife will laugh and say, \"Listen to us. We sound like teenagers.\" Other times, I'll make a joke and suggest we take a breather. These resets don't erase the disagreement, but they do defuse the tone, allowing for a more productive conversation.</p><p><a target=\"_blank\" href=\"https://www.cnbc.com/mark-travers/\"><em><strong>Mark Travers</strong></em></a><em>, PhD, is a psychologist who specializes in relationships. He holds degrees from Cornell University and the University of Colorado Boulder. He is the lead psychologist at </em><a href=\"https://www.awake-therapy.me/\" target=\"_blank\"><em>Awake Therapy</em></a><em>, a telehealth company that provides online psychotherapy, counseling, and coaching. He is also the curator of the popular mental health and wellness website, </em><a href=\"http://therapytips.org/\" target=\"_blank\"><em>Therapytips.org</em></a><em>.</em></p><p><em><strong>Want to be your own boss?</strong> Sign up for CNBC's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/107141202-1666818446901-MakeIt_220922_EstherWojcicki_Thumb6_v2.jpg?v=1667051101&w=750&h=422&vtcrop=y\" alt=\"I raised 2 successful CEOs and a professor of pediatrics—here's the biggest parenting mistake I see\" /><span></span><span><span></span></span></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I'm a psychologist who studies couples—here's the No. 1 thing people fight about in relationships",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207779-1759520403557-Couples_Fight_CNBC_Illo_de_Recat_Pink.jpg?v=1759520446&w=1920&h=1080"
      ],
      "datePublished": "2025-10-05T16:05:24.000Z",
      "dateModified": "2025-10-05T16:05:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jane Goodall adopted a plant-based diet back in the 1960s: It was key to her activism and a long, healthy life",
    "url": "https://www.cnbc.com/2025/10/04/why-jane-goodall-adopted-a-plant-based-diet-back-in-the-1960s.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207705-1759514304709-gettyimages-495359451-80179736.jpeg?v=1759514344&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-04T12:00:01.000Z",
    "description": "<div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/jane-goodall-has-died-at-91.html\">Jane Goodall</a>, the acclaimed conservationis",
    "body": "<div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/jane-goodall-has-died-at-91.html\">Jane Goodall</a>, the acclaimed conservationist who captured the world's attention through her work studying the behavior of chimpanzees in Africa, died of natural causes at age 91 on Wednesday.</p><p>She was on a speaking tour in Los Angeles when she passed. And her commitment to working in her 90s aligns with a common trait of the happiest and healthiest people who live close to the age of 100, or beyond it: they often <a target=\"_blank\" href=\"https://www.cnbc.com/2024/07/20/100-year-olds-not-retiring-is-what-keeps-us-going.html\">keep working and never retire</a>.</p><p>Goodall's dedication to her work and the health of the planet even trickled down to her diet. For decades, she only ate plant-based foods.</p><p>\"I stopped eating meat some 50 years ago when I looked at the pork chop on my plate and thought: this represents fear, pain, death,\" she <a href=\"https://news.janegoodall.org/2017/04/28/why-i-went-plant-based-and-why-we-should-all-eat-less-meat\" target=\"_blank\">wrote</a> in an essay in 2017.</p><p>\"That did it, and I went plant-based instantly.\"</p></div><blockquote><div><p>When I stopped eating meat I immediately felt better, lighter.</p><div><p>Jane Goodall</p><p>Conservationist and Ethologist</p></div></div></blockquote><div><p>Goodall cited her main reasons for shifting to a plant-based diet as not wanting to support factory farms and the damage done to the environment by meat production. She encouraged readers of her essay to cut meat out of their diets for the same reasons.</p><p>The production of meat \"contributes to greenhouse gas emissions and other markers that could adversely affect planetary health,\" <a href=\"https://web.uri.edu/nutrition/meet/maya-vadiveloo/\" target=\"_blank\">Maya Vadiveloo</a>, an associate professor in the department of nutrition at the University of Rhode Island, <a target=\"_blank\" href=\"https://www.cnbc.com/2024/06/22/planetary-health-diet-vs-the-mediterranean-diet-which-one-is-best.html\">told CNBC Make It</a> last year.</p><p>Goodall also saw improvements to her health when she went plant-based. \"When I stopped eating meat I immediately felt better, lighter,\" she said.</p><p>Cutting red meat out of your diet can lead to better health outcomes like a lower chance of developing cardiovascular disease and cancer, according to <a href=\"https://www.health.harvard.edu/staying-healthy/cutting-red-meat-for-a-longer-life\" target=\"_blank\">Harvard Health Publishing</a>. People who eat large amounts of red meat may also have a greater risk of dying at a younger age, <a href=\"https://pubmed.ncbi.nlm.nih.gov/22412075\" target=\"_blank\">researchers found</a>.</p><p>\"I didnʼt become vegan just because of my health. I became vegan for ethical reasons,\" Goodall told <a href=\"https://www.thenationalnews.com/news/uae/2025/02/01/jane-goodall-shares-secret-to-staying-fit-as-a-fiddle-at-90\" target=\"_blank\">The National</a> in January.</p><p>\"Iʼm vegan for the environment.\"</p><p><em><strong>Want to be your own boss?</strong> Sign up for CNBC's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/107115544-thumb_2.jpg?v=1669992361&w=750&h=422&vtcrop=y\" alt=\"5 toxic brain foods to avoid, according to a Harvard nutritionist\" /><span></span><span><span></span></span></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jane Goodall adopted a plant-based diet back in the 1960s: It was key to her activism and a long, healthy life",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207705-1759514304709-gettyimages-495359451-80179736.jpeg?v=1759514344&w=1920&h=1080"
      ],
      "datePublished": "2025-10-04T12:00:01.000Z",
      "dateModified": "2025-10-04T12:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Psychologist's No. 1 non-negotiable parenting rule for happier, healthier kids: It's 'very straightforward and costs nothing'",
    "url": "https://www.cnbc.com/2025/10/05/psychologist-jean-twenge-top-screen-time-parenting-rule-for-kids.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207187-1759429945755-gettyimages-2216327906-NUP_207550_00055.jpeg?v=1759430087&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-05T13:05:01.000Z",
    "description": "<div><div><p>A lot of parents struggle with the idea of giving their kids <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/jonathan-haidts-adv",
    "body": "<div><div><p>A lot of parents struggle with the idea of giving their kids <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/jonathan-haidts-advice-for-planning-a-screen-free-afternoon-for-kids.html\">access to smartphones or other connected devices</a>. How old should they be when they get their first phone or tablet? What parental controls, if any, should you use?</p><p>No matter what you decide, you need to follow one \"imperative\" rule to help your kids grow up to be happy, successful adults, says psychologist Jean Twenge: \"No electronic devices in the bedroom overnight.\"</p><p>\"That's just a situation where there's, kind of, no argument: 'You do not need that phone in your bedroom when you are supposed to be sleeping. Period. End of story. Mic drop. We're done,'\" says Twenge, a professor of psychology at San Diego State University whose latest book, \"<a href=\"https://www.jeantwenge.com/10-rules-for-raising-kids-in-a-high-tech-world/\" target=\"_blank\">10 Rules for Raising Kids in a High-Tech World</a>,\" published on September 2.</p><p>Twenge has spent much of the past decade <a target=\"_blank\" href=\"https://www.cnbc.com/2017/08/05/smartphones-ruining-mental-health-teens.html\">warning parents</a> about the risks of giving young adolescents unlimited access to smartphones and social media. She's cited <a href=\"https://www.who.int/europe/news/item/25-09-2024-teens--screens-and-mental-health\" target=\"_blank\">research</a> connecting their usage to higher rates of mental health issues in teens, including anxiety and depression.</p><p>Some other parenting and medical experts <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/jonathan-haidts-advice-for-planning-a-screen-free-afternoon-for-kids.html\">have issued similar warnings</a>: In 2023, then-U.S. Surgeon General Vivek Murthy <a target=\"_blank\" href=\"https://www.cnbc.com/2023/05/23/us-surgeon-general-we-must-protect-kids-from-social-media-risks-now.html\">issued an advisory</a> warning that the risks of social media and connected devices have helped create \"a national youth mental health crisis,\" for example.</p><p>In her book, Twenge advocates for parents to wait as long as possible before handing over smartphones to their kids, or allowing them on social media platforms. She recommends keeping kids from joining social media until they're 16 or older, and from having full access to their own smartphone until they have a driver's license and are expected to \"get around independently.\"</p><p>But banning devices from kids' rooms overnight is her No. 1 rule because of its potential to improve their sleep habits, she says. Doing so is \"absolutely crucial for both physical and mental health,\" she notes in her book.</p><p>\"If you have the bandwidth to fully follow only one rule in this book, make it this one,\" writes Twenge. \"No devices in the bedroom overnight is very straightforward and costs nothing.\"</p></div><h2><a></a>'Not getting enough sleep is a risk factor'</h2><div><p>Devices in bedrooms can easily cut into sleeping time, whether your teen puts off shutting their eyes to continue scrolling through social media or the sounds of notifications keep waking them up, <a href=\"https://www.commonsensemedia.org/press-releases/teens-are-bombarded-with-hundreds-of-notifications-a-day\" target=\"_blank\">research shows</a>.</p><p>More than two-thirds of adolescents surveyed <a href=\"https://www.commonsensemedia.org/sites/default/files/research/report/2023-cs-smartphone-research-report_final-for-web.pdf\" target=\"_blank\">by Common Sense Media in</a> 2023 reported missing out on sleep \"sometimes\" or \"often\" due to using phones or other devices late at night in their bedrooms. Overall, 77% of teens get an insufficient amount of sleep, <a href=\"https://www.cdc.gov/sleep/data-research/facts-stats/high-school-students-sleep-facts-and-stats.html\" target=\"_blank\">according to data</a> from the U.S. Centers for Disease Control and Prevention.</p><p>\"Not getting enough sleep is a risk factor for just about everything we'd like our kids to avoid, from getting sick to feeling depressed,\" Twenge writes in her book.</p><p>Looking at screens in bed <a target=\"_blank\" href=\"https://www.cnbc.com/2017/11/03/nobel-prize-winner-sleep-research-dont-take-your-phone-to-bed.html\">is connected to higher rates</a> of mental and physical health issues for adults, too. But healthy sleeping habits are even more important for kids, because their brains are still developing. Sleep can help enable their <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC9685105/\" target=\"_blank\">cognitive development and mental health</a>, including their ability to learn and regulate their emotions — <a target=\"_blank\" href=\"https://www.cnbc.com/2024/12/13/the-no-1-strategy-for-raising-mentally-strong-kids-psychotherapist.html\">traits they'll need</a> to develop to grow up and become happy, healthy and successful adults.</p><p>\"If you can only do one thing, [this rule] might end up making the biggest difference,\" says Twenge.</p></div><h2><a></a>Be honest, but firm</h2><div><p>Any of Twenge's rules will likely be met with resistance from kids, especially teenagers who already regularly use their smartphones and other devices at all times of day, she says. You can more easily implement and enforce these types of policies by communicating them to your kids at an early age, she advises.</p><p>Twenge recommends having conversations about the dangers of smartphones — and the need for strict rules around their use — as soon as elementary school. \"Kids are getting these devices younger and younger\" and your child might have friends who are already using connected devices at that age, she says.</p><p>Parents of older kids can also backtrack and put new, stricter rules in place. That's what Twenge did with her own three teenage daughters, after initially allowing them to use their laptops overnight, she says. Retroactively establishing strict rules isn't easy, she adds: \"The first few days might be tough, and you might get some slammed doors.\"</p><p>Her advice is to be transparent, but firm, about your decision process. \"You should be honest with your kid [and say], 'Look, I made a mistake. I now know more, I've learned more, and we're going to do it differently going forward,'\" says Twenge.</p><p><em><strong>Want to be your own boss?</strong> Sign up for CNBC's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108199266-1758027174439-GettyImages-1056373084.jpg?v=1758027217&w=750&h=422&vtcrop=y\" alt=\"The ultimate guide to starting your own business: A CNBC Make It course\" /><span></span><span><span></span></span></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Psychologist's No. 1 non-negotiable parenting rule for happier, healthier kids: It's 'very straightforward and costs nothing'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207187-1759429945755-gettyimages-2216327906-NUP_207550_00055.jpeg?v=1759430087&w=1920&h=1080"
      ],
      "datePublished": "2025-10-05T13:05:01.000Z",
      "dateModified": "2025-10-05T13:05:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Investors aren't the market's biggest loser if Trump, SEC end quarterly reporting",
    "url": "https://www.cnbc.com/2025/10/05/trump-sec-quarterly-earnings-reports-accounting-firms.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207498-1759497787293-gettyimages-2212002272-_90a9437_v0gjbshz.jpeg?v=1759497806&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-05T13:06:30.000Z",
    "description": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108201241-17582874271758287424-41720443270-1080pnbcnews.jpg?v=1758287426&w=750&h=422&vtcr",
    "body": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108201241-17582874271758287424-41720443270-1080pnbcnews.jpg?v=1758287426&w=750&h=422&vtcrop=y\" alt=\"SEC Chair Paul Atkins: We will propose rule change on Trump’s call to end quarterly reports\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>With the Securities and Exchange Commission now pursuing <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">President Trump</a>'s request to consider a rule that <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/15/trump-advocates-that-companies-stop-reporting-earnings-on-a-quarterly-basis-.html\">ends the mandate</a> that public companies file quarterly reports, there's a lot to gain for companies in time and money, and a lot for the Big Four accounting firms to lose.</p><p>Trump originally proposed a switch to semi-annual reporting in a post on Truth Social a few weeks ago, saying it would \"save money, and allow managers to focus on properly running their companies.\"</p><p>SEC Chair Paul Atkins told CNBC soon after that a rule proposal is underway, though he suggested any change would <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/19/sec-to-propose-rule-change-on-trumps-call-to-end-quarterly-earnings-reporting-says-chair-atkins.html\">give companies the option to change</a> their reporting schedule. \"For the sake of shareholders and public companies, the market can decide what the proper cadence is,\" Atkins said.</p><p>With semi-annual reports, companies could theoretically halve the considerable costs and labor associated with filing quarterly reports. But the independent, outside accounting firms, in particular the \"Big Four\" — Deloitte, EY, KPMG and PwC — that help prepare them stand to lose a major portion of their audit business. On average, it takes about 180 hours to prepare a requisite form 10-Q, at an expense that can vary from $50,000 for smaller companies to well over $1 million for large-cap enterprises. And that doesn't include expenditures for internal audit teams and operations.</p><p>It's important to note the distinction between a quarterly report, or 10-Q, and an earnings report. The SEC-required 10-Q is prepared and reviewed by independent auditors, following strict disclosure standards. Around the same time, via a press release, companies issue a quarterly earnings report — which is not audited — to the media and investors, highlighting revenue, profits and other key metrics featured in the official 10-Q.</p><p>\"I'm sure [the Big Four] are paying very close attention to this proposal as it potentially moves through the SEC,\" said Jerry Maginnis, a CPA and former audit partner at KPMG. \"It could have a very significant impact on their business model.\"</p><p>He estimates that up to 15% of the firms' annual audit fees \"could be going away.\"</p><p>The Big Four might be able to recoup some of that lost revenue by expanding their advisory and tax services, but if not, they would have to consider cost cuts, said Larry Rand, a visiting professor of economics at Brown University and a financial consultant. \"If you are going to be losing a substantial revenue flow, you're certainly going to have to look at ways of saving money,\" he said. \"They will hire fewer people. They will use more artificial intelligence tools,\" he added.</p><p>That's happening as it is. <a href=\"https://www.businessinsider.com/pwc-hiring-fewer-junior-associates-ai-offshoring-big-four-2025-8\" target=\"_blank\">PwC said</a> in August that it expects to hire one-third fewer people off college campuses by 2028 — 39% fewer in audit — partly driven by the rapid emergence of AI and how it's changing entry-level jobs. The SEC rule change could be another blow to accounting firms' workforces.</p><p>The proposed SEC rule change came as somewhat of a surprise. It hadn't been among Trump's plethora of deregulation targets, from immigration to DEI, nor was it included in the now-prescient Project 2025 playbook.</p><p>But during Trump's first term, he threw out the same pitch in 2018. \"That would allow greater flexibility & save money,\" he posted on Twitter (now X). \"I have asked the SEC to study!\" The SEC elicited <a href=\"https://www.sec.gov/comments/s7-26-18/s72618.htm?campaign_id=4&emc=edit_dk_20250916&instance_id=162639&nl=dealbook&regi_id=46899355&segment_id=206001&user_id=3f253630d9e330aaf579d9ddaec0d2f5\" target=\"_blank\">comments</a> from a variety of affected stakeholders — the accounting industry, investment research firms, institutional and individual investors and academics — but ultimately, momentum stalled.</p><p>This iteration is likely to go through the same process, but has a good chance of succeeding, especially considering the current administration's <a href=\"https://www.brookings.edu/articles/tracking-regulatory-changes-in-the-second-trump-administration/\" target=\"_blank\">deregulatory wins to date</a> and agencies' steady compliance with Trump's wishes. Indeed, a spokesperson for the SEC said that the agency \"is prioritizing this proposal to further eliminate unnecessary regulatory burdens on companies.\"</p><p>Each of the Big Four accounting firms declined to comment.</p><p>Although today's economy is remarkably different from that in 2018 — look no further than tariffs, trade wars and AI — it's instructive to review comments accounting firms did make back in 2018 when the SEC first undertook the quarterly reporting issue.</p><p>Not surprisingly, considering the negative implications for the industry, all four were in favor of retaining the quarterly cadence, each citing values that it brings to investors and capital markets. Deloitte, for example, said, \"By helping to ensure that investors receive regular, timely and reliable information, the SEC regime has helped make the U.S. markets the strongest and most trusted in the world.\"</p><p>\"We believe quarterly reporting minimizes information asymmetry between management and investors and reduces market uncertainty,\" EY said. \"Quarterly reporting also helps reduce risks in the corporate financial reporting system by facilitating timely identification and resolution of potential accounting and reporting issues.\"</p><p>Financial statement users, said KPMG, \"have historically relied on the negative assurance provided by the auditors' review for their investment decisions.\"</p><p>PwC, remarking on the difficulty of reforming reporting, said that the \"unstructured nature of earnings releases could make it challenging for investors to determine what information was subject to the independent auditor's interim review procedures. Additional guidance would need to be developed.\"</p><p>At the same time they argued against the rule change, the firms were careful to acknowledge the SEC's authority to review its quarterly reporting schedule, which has been mandated since 1970. For instance, KPMG said, \"We applaud the Commission's continued efforts to take a fresh look at the financial reporting requirements…to update and streamline them for the benefit of all market participants.\"</p><p>The reporting process, EY said, \"could benefit from targeted improvements that would reduce the compliance burden on companies.\"</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108199362-17580343831758034380-41674851475-1080pnbcnews.jpg?v=1758034382&w=750&h=422&vtcrop=y\" alt=\"Long-Term Stock Exchange CEO on biannual reporting: Pleased the President agrees with us\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>Its merits have long been debated by business leaders and investors, but the concept of semi-annual reporting has precedent. The European Union and the U.K. switched from a quarterly cadence more than a decade ago, although companies can voluntarily choose to issue quarterly reports.</p><p>Those foreign companies \"are not required to report quarterly, but a fair amount of larger companies still do,\" even if it's not an official earnings release, said Dominic Pappalardo, chief multi-asset manager for financial research firm Morningstar.</p><p>Pappalardo can foresee that same scenario being adopted in the U.S., he said. \"If the companies think there's a benefit to giving investors quarterly information, they're going to continue to do it. I believe that some, if not many, [would] continue to provide some sort of quarterly update,\" he said.</p><p>Some commentators back in 2018 noted that any public firms needing to issue debt or equity at any given time might have no choice but to report quarterly numbers, or face a higher cost of capital. There will also be some level of peer checks taking place in the market — if a public company is out of step with key competitors on reporting schedules, investor money could move away from it.</p><p>For these and many other reasons, accounting firms' fears of losing business may be less extreme than they seem on the surface. \"Even if it's not required by the SEC,\" Maginnis said, \"it would not be surprising to me that [certain clients] would want their accounting firm to be involved somewhat similarly to what's happening currently. In those cases, the revenue streams might not be impacted as much,\" he added.</p><p>Besides lessening the expense and rigors of quarterly reporting, another argument in favor of a semi-annual mandate is that it would encourage private companies to go public. The number of publicly listed companies in the U.S. has fallen from more than 7,000 in 1996 to less than 4,000 in 2020.</p><p>Reinvigorating the IPO market — which has lately been <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/15/tech-ipos-bullish-figma-circle-roaring-after-years-of-prohibition-.html\">gaining momentum</a> — would be an additional way for the Big Four to keep their heads above water. \"From their point of view, it's zero sum,\" Rand said. \"They may lose revenues from their existing client base, but will pick up revenues from more companies going public if they know that they only have to report semi-annually.\"</p><p>It will take months for the SEC to again gather and sift through comments to this proposal. Although the Big Four pushed back, if gently, against Trump's 2018 proposal, the firms may be more conciliatory this time around — if for no other reason than fretting the type of jawboning that has been a hallmark of Trump 2.0. \"That is a pervasive reaction to a lot of potential commenters,\" Rand said. \"I don't think it would be a safe thing to do.\"</p><p>Regardless, Maginnis believes the stars are aligning in favor of the scheduling change. \"Between the president's support and encouragement of this, and the current SEC leadership's approach to the regulatory landscape, I would say it's got at least a 50-50 chance of going through, and maybe a little better than that.\"</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Investors aren't the market's biggest loser if Trump, SEC end quarterly reporting",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207498-1759497787293-gettyimages-2212002272-_90a9437_v0gjbshz.jpeg?v=1759497806&w=1920&h=1080"
      ],
      "datePublished": "2025-10-05T13:06:30.000Z",
      "dateModified": "2025-10-05T13:06:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]