[
  {
    "title": "Students pursuing these 11 degrees will be eligible to take out up to $200,000 in federal loans under new borrowing limits",
    "url": "https://www.cnbc.com/2025/11/26/criteria-to-be-considered-professional-degrees.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232498-1764169231544-gettyimages-1447684501-4p1a5221.jpeg?v=1764169265&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T19:32:01.000Z",
    "description": "President Donald Trump and his administration will begin imposing new limits for federal student loans disbursed on or after July 1, 2026.Undergraduat",
    "body": "President Donald Trump and his administration will begin imposing new limits for federal student loans disbursed on or after July 1, 2026.Undergraduate borrowers will have the same current limit of up to $7,500 a year for dependent students, depending on their class year. But graduate and professional students will see new limits of up to $20,500 per year ($100,000 total) for graduate studies and $50,000 a year ($200,000 total) for professional programs. Graduate PLUS loans, which previously allowed students to borrow up to their total cost of attendance, will be eliminated.According to the proposed regulation, a professional degree \"signifies both completion of the academic requirements for beginning practice in a given profession and a level of professional skill beyond that normally required for a bachelor's degree.\"The Department of Education has named 11 degree fields that meet the requirements to be considered professional, and thus eligible for higher loan limits under the new rules: Pharmacy (Pharm. D.)Dentistry doctorate (D.D.S. or D.M.S.)Veterinary medicine (D.V.M.)Chiropractic (D.C. or D.C.M.)Law (L.L.B. or J.D.)Medicine (M.D.)Optometry (O.D.)Osteopathic medicine (D.O.)Podiatry (D.P.M., D.P., or Pod.D.)Theology (M.Div., or M.H.L.)Clinical psychology (Psy.D. or Ph.D.)The addition of clinical psychology came out of the department's recent negotiated rulemaking session where stakeholders debated the loan limit rule and how it should be applied.The department also said programs in at least 44 other fields could qualify if they meet certain criteria, including giving students a \"level of professional skill beyond that normally required for a bachelor's degree,\" generally resulting in a doctoral level degree and requiring professional licensure to begin practice. Potentially eligible programs include a number of other pharmacy degrees, clinical counseling and theological studies. Institutions are responsible for determining whether a program meets the requirements to be considered a professional degree or not, says Sarah Austin, a policy analyst at the National Association of Student Financial Aid Administrators.Professional organizations respondSome professional organizations have expressed concern over the list of degrees eligible for the $200,000 aggregate federal loan limit and the Department of Education's definition of professional programs.\"Despite broad recognition of the complexity, rigor, and necessity of post-baccalaureate nursing education, the Department's proposal defines professional programs so narrowly that nursing, the nation's largest healthcare profession, remains excluded,\" The American Association of Colleges of Nursing said in a press release on Nov. 7. \"Should this proposal be finalized, the impact on our already-challenged nursing workforce would be devastating.\"\"Declassifying the [Master of Social Work] and [Doctorate of Social Work] degrees will reduce access to affordable social work education, thereby increasing reliance on high-interest private loans,\" the National Association of Social Workers' Florida chapter said in a press release on Nov. 20.In a fact sheet released on Nov. 24, the Department of Education said, \"The definition of a 'professional degree' is an internal definition used by the Department to distinguish among programs that qualify for higher loan limits, not a value judgement about the importance of programs. It has no bearing on whether a program is professional in nature or not.\"The intention behind the loan limits is to discourage borrowers from taking on more debt than they will be able to handle and to encourage institutions to rein in tuition costs, the department said. The loan limit regulation is not final, however. The Department of Education will publish the regulation in its current form in the federal register in the coming months where the public will have the opportunity to give feedback before it becomes final.Black Friday sale: Want to up your AI skills and be more productive? Get 25% off our most popular course of the year, How to Use AI to Be More Successful at Work, with coupon code GETSMART. Offer valid Nov. 17 through Dec. 5, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Students pursuing these 11 degrees will be eligible to take out up to $200,000 in federal loans under new borrowing limits",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232498-1764169231544-gettyimages-1447684501-4p1a5221.jpeg?v=1764169265&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T19:32:01.000Z",
      "dateModified": "2025-11-26T19:32:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix suffers brief outage during 'Stranger Things' season-five debut",
    "url": "https://www.cnbc.com/2025/11/26/netflix-outage-stranger-things.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219999-17619180342025-10-31t124225z_1078586780_rc2ymhavntx8_rtrmadp_0_television-stranger-things-season-5-lucca.jpeg?v=1761918055&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T04:03:53.000Z",
    "description": "A Netflix logo is on display at the Lucca Comics &amp; Games 2025 event, one of Europe's largest pop culture conventions, as stars and creators of \"St",
    "body": "A Netflix logo is on display at the Lucca Comics &amp; Games 2025 event, one of Europe's largest pop culture conventions, as stars and creators of \"Stranger Things\" series launch Season 5, in Lucca, Italy, October 31, 2025. Claudia Greco | ReutersNetflix viewers experienced a brief outage Wednesday night as the video streaming platform rolled out the long-awaited fifth and final season of \"Stranger Things.\"Users on social media earlier posted that they were experiencing issues, and DownDetector.com showed that reports spiked around 9 p.m. Eastern.\"Netflix fix your app bro,\" one X user posted. DownDetector logged the first wave of issues at about 7:40 p.m., and nearly 16,000 cases were reported by users at its peak. Eastern. Netflix had slated the latest season of \"Stranger Things\"  to go live at 8 p.m.Netflix said it would release the first four episodes of the fifth season of \"Stranger Things\" on Wednesday. The streaming service has said it will release another three episodes on Dec. 25 and the final episode on Dec. 31.The company did not respond to a request for comment. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix suffers brief outage during 'Stranger Things' season-five debut",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219999-17619180342025-10-31t124225z_1078586780_rc2ymhavntx8_rtrmadp_0_television-stranger-things-season-5-lucca.jpeg?v=1761918055&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T04:03:53.000Z",
      "dateModified": "2025-11-27T04:03:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Puma shares pop 14% after report China's Anta Sports is looking to buy the sportswear giant",
    "url": "https://www.cnbc.com/2025/11/27/puma-shares-chinas-anta-sports-is-reportedly-looking-to-buy-the-firm.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232963-1764227370372-gettyimages-1247583266-GERMANY_PUMA.jpeg?v=1764227379&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T10:08:07.000Z",
    "description": "The logo of Puma SE displayed in the window of the flagship store in Berlin, Germany, on Wednesday, March 1, 2023. Puma forecast slower profit growth ",
    "body": "The logo of Puma SE displayed in the window of the flagship store in Berlin, Germany, on Wednesday, March 1, 2023. Puma forecast slower profit growth as new Chief Executive Officer Arne Freundt confronts excess inventory and higher costs for marketing sneakers and apparel. Photographer: Krisztian Bocsi/Bloomberg via Getty ImagesBloomberg | Bloomberg | Getty ImagesPuma shares jumped as much as 16% early Thursday following a report that China's Anta Sports is among a number of firms looking to buy the German athletic brand.Puma may also attract interest from Chinese apparel firm Li Ning and Japan's Asics Corp, Bloomberg reported, citing unnamed sources.Puma declined to comment and Anta Sports has yet to respond to a request for comment from CNBC.The Frankfurt-listed shares have more than halved year to date amid an increasingly competitive sportswear market and tariffs hitting customer sentiment. Shares were up 14.5% by 9:30 a.m. London time (4:30 a.m. ET).Stock Chart IconStock chart iconPuma shares year-to-dateCEO Arthur Hoeld, who was appointed on July 1, is tasked with reviving the ailing brand. His turnaround plan involves cutting jobs, narrowing its product range, and improving marketing operations.In late October, the company said it is aiming to establish itself as a \"Top 3 global sports brand,\" as it reported quarterly sales that fell on a double digit basis. Puma acknowledged that key challenges included a muted brand momentum, U.S. tariffs, and high inventory levels.Puma's biggest shareholder is currently Artemis which holds a 29% stake in the company. Artemis — the holding company of France's billionaire Pinault family as well as the largest shareholder of Gucci-owner Kering — has been on a spending spree and has seen its debt balloon. Artemis' valuation expectations for Puma may be a major hurdle to any transaction involving the athletic brand, Bloomberg reported, citing people familiar with the matter. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Puma shares pop 14% after report China's Anta Sports is looking to buy the sportswear giant",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232963-1764227370372-gettyimages-1247583266-GERMANY_PUMA.jpeg?v=1764227379&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T10:08:07.000Z",
      "dateModified": "2025-11-27T10:08:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saba Capital activist Boaz Weinstein calls for removal of Baillie Gifford-run tech investment trust’s entire board",
    "url": "https://www.cnbc.com/2025/11/27/saba-capitals-boaz-weinstein-targets-baillie-gifford-run-tech-trust-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107416509-1715954534877-gettyimages-1258512789-BLOOMBERG_INVEST.jpeg?v=1764240097&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T11:45:00.000Z",
    "description": "Boaz Weinstein is calling for the removal of the entire board of a tech-focused fund managed by Baillie Gifford, in a bid to reverse what the activist",
    "body": "Boaz Weinstein is calling for the removal of the entire board of a tech-focused fund managed by Baillie Gifford, in a bid to reverse what the activist investor sees as \"unprecedented\" value destruction.In a letter to the Edinburgh Worldwide Investment Trust's board on Thursday, Weinstein — whose activist investment firm Saba Capital owns around 30% of shares in the trust — said the board has \"objectively and categorically failed\" to deliver the performance expected by shareholders.EWIT's portfolio comprises a global mix of smaller and emerging public and private companies focused on tech innovation and transformation, that target \"significant disruptive growth potential,\" according to the London-listed Baillie Gifford's website. Its holdings include Elon Musk's Space Exploration Technologies, or SpaceX, which makes up 8.4% of its portfolio.Weinstein said EWIT's net asset value is down 30.8% over the past five years, while its share price return has fallen 35%, having \"massively underperformed\" its self-selected benchmark, the FTSE All-Share Index, which is up 71.4% over the same period.That means the company's NAV return and share price performance ultimately lag the benchmark by more than 100% over the five-year period, Saba noted in the letter.Stock Chart IconStock chart iconEdinburgh Worldwide Investment Trust.\"The magnitude of this value destruction is unprecedented among peer U.K. equity investment trusts over this period,\" Weinstein wrote.The trust's total assets stood at £847.15 million ($1.1 billion) as of Oct. 31. Now the high-profile activist investor is calling for a general meeting to appoint a new board composed solely of \"qualified, independent directors… committed to delivering long-term value for all shareholders.\"\"We remain profoundly frustrated by the board's prolonged inertia,\" Weinstein wrote in the letter on Thursday. \"We do not have faith in the current Board's ability to implement the necessary strategic changes.\"The move follows an earlier attempt by Saba last year to shake up the EWI trust's board, a bid which ultimately failed to win investor support.Weinstein — whose New York-based $6 billion hedge fund trades credit relative value opportunities — has built a number of positions across the U.K. investment trust space lately. Outlining two new bets at the annual Sohn London investment conference last week, he said there is \"a storm brewing\" in the U.K. investment trust sector where discounts have widened sharply.EWIT is expected to issue a statement later on Thursday. Baillie Gifford declined to comment on the matter.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saba Capital activist Boaz Weinstein calls for removal of Baillie Gifford-run tech investment trust’s entire board",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107416509-1715954534877-gettyimages-1258512789-BLOOMBERG_INVEST.jpeg?v=1764240097&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T11:45:00.000Z",
      "dateModified": "2025-11-27T11:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Rush Hour 4’ revived after Trump urged Paramount Skydance to resurrect franchise: Reports",
    "url": "https://www.cnbc.com/2025/11/25/trump-pushed-paramount-revive-rush-hour-4-reports-say.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231981-1764100830002-gettyimages-75880729-14590923.jpeg?v=1764100906&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T02:33:04.000Z",
    "description": "Actors Chris Tucker and Jackie Chan arrive to the premiere of \"Rush Hour 3\" at Mann's Chinese Theater on July 30, 2007 in Hollywood, California. Jeff ",
    "body": "Actors Chris Tucker and Jackie Chan arrive to the premiere of \"Rush Hour 3\" at Mann's Chinese Theater on July 30, 2007 in Hollywood, California. Jeff Vespa | WireImage | Getty ImagesA push from President Donald Trump led Paramount Skydance to revive its \"Rush Hour\" buddy cop movie series, two decades after the last installment, according to multiple reports Tuesday.Paramount has secured funding for \"Rush Hour 4\" and struck a distribution arrangement with Warner Bros. Discovery, which previously owned the franchise under its New Line banner, Puck's Matthew Belloni reported. The project had been in limbo for years.Studios were repeatedly approached about a new installment, but had balked at working with director Brett Ratner.Ratner's career collapsed in 2017 after several female actors accused him of sexual misconduct. He has denied the allegations and was never charged.Belloni reported that Paramount's decision to release \"Rush Hour 4\" came \"after prodding from Trump on behalf of Brett Ratner,\" who will direct the film.Ratner, in late 2024, was tapped to direct a documentary about first lady Melania Trump for Amazon Prime, which reportedly paid $40 million for the rights to make it.In the \"Rush Hour 4\" deal, Paramount will collect a flat distribution fee to release the film in theaters, Variety first reported. Warner Bros. will take an undisclosed share of box-office receipts before financiers recoup costs.Paramount Skydance and Warner Bros. did not respond to requests for comment. The White House also did not respond to a request for comment.The first three \"Rush Hour\" films were global hits, particularly in China, earning more than $850 million worldwide, according to box office estimates. They also turned Jackie Chan and Chris Tucker into major stars.But the new sequel faces a changed theatrical landscape where comedies have struggled at the box office.And at 71 years old, Chan has scaled back U.S. studio work, while Tucker has not headlined a major film since 2007.Both Chan and Tucker are expected to be in the new film.Trump's intervention in Hollywood has drawn criticism. He has informally tapped allies including Sylvester Stallone, Jon Voight, and Mel Gibson as cultural emissaries, and has repeatedly said he wants to restore what he calls \"classical masculinity\" to studio filmmaking.For Paramount, the \"Rush Hour\" revival comes as the newly combined studio aims to nearly double its output, targeting 15 films in 2026 and up to 18 by 2028.The timing also overlaps with a major industry shake-up: Paramount Skydance, Comcast, and Netflix have all submitted first-round bids to acquire Warner Bros. The company's portfolio includes some of entertainment's most valuable franchises, from DC to Harry Potter.Paramount is bidding for all of Warner Bros. Its proposal, previously valued at about $23.50 per share, would bring the entire company — the studio, HBO Max, and the cable networks — under one owner.Comcast is reportedly interested in the studio and streaming assets, including Warner Bros. and HBO Max. The deal would fold those pieces into NBCUniversal and let Warner Bros. Discovery spin off CNN and TNT Sports before the deal closes. Netflix is also interested in the film and streaming assets, people familiar with the matter previously told CNBC.Warner Bros. Discovery aims to have its sale process wrapped by mid- to late-December, CNBC previously reported.Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast's planned spinoff of Versant.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Rush Hour 4’ revived after Trump urged Paramount Skydance to resurrect franchise: Reports",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231981-1764100830002-gettyimages-75880729-14590923.jpeg?v=1764100906&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T02:33:04.000Z",
      "dateModified": "2025-11-26T02:33:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alibaba's AI glasses to rival Meta go on sale for $500 ",
    "url": "https://www.cnbc.com/2025/11/27/alibaba-quark-ai-glasses-go-on-sale-price-specs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108177567-1753687050071-Alibaba_AI_glasses.jpg?v=1753690514&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T09:07:07.000Z",
    "description": "Alibaba announced plans to release a pair of smart glasses powered by its AI models. The Quark AI Glasses are Alibaba's first foray into the smart gla",
    "body": "Alibaba announced plans to release a pair of smart glasses powered by its AI models. The Quark AI Glasses are Alibaba's first foray into the smart glasses product category.AlibabaAlibaba's artificial intelligence-powered smart glasses went on sale on Thursday as the Chinese tech giant looks to ramp up its focus on consumer AI in an increasingly competitive market. The Quark AI Glasses, first announced in July, come in two variants — the S1, which starts at  3,799 Chinese yuan ($536) and G1 at 1,899 yuan.The tech giant has integrated its Qwen AI models — Alibaba's version of ChatGPT — with the device which also links to its newly-launched Qwen app. This means users can use voice control to get the glasses to carry out tasks.The lenses of the glasses are effectively screens and the device has a camera built into the frame. The main difference between the S1 and G1 is the display, Alibaba said.watch nowThe company said that some of the features include on-the-go translation, AI-generated meeting notes and the ability to ask the virtual assistants questions. Users take pictures of a product using the camera in the lens and then the device will show the price of that product on Taobao, Alibaba's main shopping app in China. Alibaba, like other technology companies such as U.S. giant Meta, are betting that smart glasses could be the next big consumer device after the smartphone.In September, Meta unveiled the $799 Meta Ray-Ban Display glasses, the social media company's first consumer-ready smart glasses with a built-in display. Users can control the device via hand gestures with a special wristband. Alibaba's glasses will initially go on sale in China and compete with domestic rivals, including consumer electronics maker Xiaomi and startup Xreal. The smart glasses market is still small but growing rapidly. By 2026, shipments of AI glasses are expected to exceed more than 10 million units, doubling from 2025, according to a forecast from Omdia. For Alibaba, the glasses are its latest play in the consumer AI market as it looks to build on its recent successes. The company's ChatGPT-style Qwen app got 10 million downloads in the first week of the public beta launch. Meanwhile, Alibaba's cloud computing business, where it books much of its AI-relate revenue, saw an acceleration of growth in the last quarter.The Hangzhou, headquartered company is one of the leaders in China's AI space, and has been investing aggressively in AI alongside rival giants like Baidu and Tencent, and aggressively launching new models.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alibaba's AI glasses to rival Meta go on sale for $500 ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108177567-1753687050071-Alibaba_AI_glasses.jpg?v=1753690514&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T09:07:07.000Z",
      "dateModified": "2025-11-27T09:07:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chinese giants rush to pledge millions after Hong Kong’s deadliest fire since 1948 kills 55",
    "url": "https://www.cnbc.com/2025/11/27/chinese-firms-rush-to-pledge-millions-in-fire-rescue-as-hong-kong-fire-death-toll-climbs-to-55.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232973-1764230663993-gettyimages-2248064620-167a4923.jpeg?v=1764230761&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T10:26:44.000Z",
    "description": "Firefighters walk near residential buildings that continue to burn at Wang Fuk Court in the Tai Po district on Nov. 27, 2025 in Hong Kong, China.Isaac",
    "body": "Firefighters walk near residential buildings that continue to burn at Wang Fuk Court in the Tai Po district on Nov. 27, 2025 in Hong Kong, China.Isaac Lawrence | Getty Images News | Getty ImagesChinese private firms pledged tens of millions of dollars to support rescue and relief efforts after a deadly residential fire in Hong Kong killed at least 55 people and left hundreds missing.Alibaba Group and its affiliate Ant Group together committed 30 million Hong Kong dollars to support fire relief efforts. Alibaba founder Jack Ma, one of the most recognizable Chinese entrepreneurs, also pledged $30 million through his charity foundation to provide emergency aid to those affected. Sportswear maker Anta, which owns brands such as Jack Wolfskin and Fila, said it would donate HK$30 million in cash and equipment. Tencent Holdings, Xiaomi Corp and ByteDance each pledged HK$10 million to aid the rescue efforts and support victims of the blaze. The wave of donations followed comments from President Xi Jinping, who urged all-out efforts to reduce casualties and rallied relevant authorities and parties to provide \"necessary support.\" Companies pledge millions after Hong Kong fireChina Red Cross: 2 million yuanXiaomi: HK$10 millionAnta Group: HK$30 millionTencent: HK$10 millionByteDance: HK$10 millionAnt Group: HK$10 millionAlibaba Group: HK$20 millionFuguiniao Group: HK$5 millionBe Friends Holdings: HK$1 millionXpeng: HK$5 millionBYD: HK$10 millionGeely: HK$10 millionNetEase: HK$10 millionTrip.com: HK$10 millionWens Foodstuff: HK$40 millionMidea Group: HK$10 millionDu Xiaoman: HK$10 millionXtep Group: HK$20 millionLenovo: HK$10 millionSource: ReutersChinese entrepreneurs have ramped up their charitable commitments in recent years to heed Beijing's call to put social responsibility before profits, amid tightened regulatory scrutiny of the private sector. Xiaomi's co-founder, Lei Jun, has donated more than 1.7 billion yuan ($240 million) since launching his philanthropic foundation in 2019 to support cutting-edge technology development and provide financial assistance to students from low-income families. In 2021, Meituan's founder, Wang Xing, contributed shares worth about $2.3 billion to his philanthropic foundation, which promotes education and scientific research. ByteDance's Zhang Yiming has also given away parts of his fortune to charitable causes. A woman is seen crying near residential buildings that continue to burn at Wang Fuk Court in the Tai Po district on Nov. 27, 2025 in Hong Kong, ChinaIsaac Lawrence | Getty Images News | Getty ImagesWorst fire since 1948The fire is Hong Kong's deadliest since 1948, when a warehouse blaze killed 176 people.The latest blaze tore through Wang Fuk Court, an eight-tower public housing complex in northern Hong Kong, home to 4,600 people in 2,000 apartments, according to Reuters.On Thursday morning, Reuters reported, citing authorities, that the fire in four of the seven affected blocks had been brought under control nearly a full day after the fire began. Firefighters were still working to contain the blaze in the remaining areas.Officials said the blaze may have started on a section of bamboo scaffolding encasing the complex, then spread to other buildings through the wooden poles and protective netting — prompting public scrutiny of the city's housing standards.  Hong Kong's police pointed to a \"grossly negligent\" construction company for using \"highly inflammable\" foam material, protective mesh sheets and plastic that may not have met fire standards. Three men from the construction company have been arrested on suspicion of \"manslaughter.\"  Volunteers give out food to residents after a major fire swept through several apartment blocks at the Wang Fuk Court residential estate in Hong Kong's Tai Po district on Nov. 27, 2025. Peter Parks | Afp | Getty Images",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chinese giants rush to pledge millions after Hong Kong’s deadliest fire since 1948 kills 55",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232973-1764230663993-gettyimages-2248064620-167a4923.jpeg?v=1764230761&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T10:26:44.000Z",
      "dateModified": "2025-11-27T10:26:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple is challenging India's anti-trust body over a potential $38 billion fine",
    "url": "https://www.cnbc.com/2025/11/27/apple-challenges-indias-anti-trust-body-over-potential-38-billion-fine.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108115188-1741833320394-gettyimages-1681507978-INDIA_IPHONE_15.jpeg?v=1748332385&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T11:00:40.000Z",
    "description": "The first day of sale of the iPhone 15 smartphone in Mumbai, India, on Sept. 22, 2023.Dhiraj Singh | Bloomberg | Getty ImagesApple has filed a case in",
    "body": "The first day of sale of the iPhone 15 smartphone in Mumbai, India, on Sept. 22, 2023.Dhiraj Singh | Bloomberg | Getty ImagesApple has filed a case in Delhi High Court against the country's anti-trust body because of how it considers global turnover when calculating penalties.The iPhone maker, which is among the fastest growing smart phone brands in India, is challenging India's new antitrust law under which the U.S. company could incur fines of up to $38 billion, according to a report by Reuters.It added it was \"unconstitutional, grossly disproportionate, unjust\" for the Competition Commission of India (CCI) to use turnover when calculating penalties.Apple did not immediately respond to a request for comment from CNBC.The CCI has been investigating complaints made by an alliance of Indian startups and Tinder-owner Match Group that accuse Apple of \"abusive conduct\" which forces developers to pay high commissions for in-app purchases. Apple denied the charges.The CCI's final verdict is still pending but it said its \"prima facie view [is] that mandatory use of Apple's IAP for paid apps & in-app purchases restrict the choice available to the app developers to select a payment processing system of their choice\", in an order in December 2021.Apple recorded its highest-ever quarterly shipments in India of 5 million units in the third quarter of 2025, according to data from IDC. watch nowThe company is expected to sell about 15 million iPhones this year in India and could rank among top five smartphone companies there, Navkendar Singh associate vice president with IDC India said on CNBC's \"Inside India\" on Nov. 18.Apple is among the global companies who are diversifying their manufacturing supply chain from China to India. In 2024, Apple exports from India hit a record of $12.8 billion, growing at more than 42% from year ago.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple is challenging India's anti-trust body over a potential $38 billion fine",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108115188-1741833320394-gettyimages-1681507978-INDIA_IPHONE_15.jpeg?v=1748332385&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T11:00:40.000Z",
      "dateModified": "2025-11-27T11:00:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eric Swalwell sues FHFA chief Pulte, alleging director used private information to attack Trump critics",
    "url": "https://www.cnbc.com/2025/11/26/swalwell-mortgage-fraud-lawsuit-fhfa-pulte-democrat-governor-bid.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106237343-1573479639092rts2h5cp.jpg?v=1573479741&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T19:26:35.000Z",
    "description": "Rep. Eric Swalwell (D-CA)Yuri Gripas | ReutersRep. Eric Swalwell, D-Calif., filed a 19-page lawsuit Tuesday in U.S. District Court in Washington, D.C.",
    "body": "Rep. Eric Swalwell (D-CA)Yuri Gripas | ReutersRep. Eric Swalwell, D-Calif., filed a 19-page lawsuit Tuesday in U.S. District Court in Washington, D.C., alleging Federal Housing Finance Agency Director Bill Pulte abused his authority to make \"fanciful\" mortgage fraud allegations against him and other critics of President Donald Trump.The lawsuit asks the court to declare Pulte's conduct unlawful, order him and the FHFA to withdraw a criminal mortgage fraud referral, and award damages for violations of federal privacy law.Swalwell — who announced Friday that he is running for governor of California — alleges in the complaint that Pulte improperly accessed and leaked his private mortgage records in retaliation for his political speech, violating both the Privacy Act of 1974 and the First Amendment.\"Director Pulte has combed through private records of political opponents to silence them,\" Swalwell posted in a statement on X.The suit alleges Pulte's referral of the matter to the Justice Department was \"patently false,\" noting that Swalwell had sworn in an affidavit that his Washington, D.C., home would be his wife's primary residence and that he remained a California resident.Swalwell's lawyers note in the filing that the disclosures landed just as Swalwell prepared to launch his gubernatorial bid. The leak of Pulte's referral letter to the media occurred \"with remarkable speed,\" the suit states, followed by conservative commentators posting details about his home where his wife and children live, activity Swalwell's suit says increased security risks for his family.The filing casts Pulte's actions as part of a broader effort by the Trump administration to use federal agencies and the courts against political opponents. Swalwell, a seven-term congressman and former House impeachment manager during Trump's second impeachment, has long been one of the most vocal critics of the president. \"Pulte's brazen practice of obtaining confidential mortgage records from Fannie Mae and/or Freddie Mac and then using them as a basis for referring individual homeowners to DOJ for prosecution is unprecedented and unlawful,\" the lawsuit argues. In recent months, Pulte has issued similar criminal referrals to Swalwell's to other Trump critics, among them New York Attorney General Letitia James, Sen. Adam Schiff, D-Calif., and Federal Reserve Governor Lisa Cook. James' indictment was dismissed by a federal judge Monday while Schiff faces an ongoing probe though has not been charged. Cook also has not been charged, though Trump cited the criminal referral as cause in his attempt to fire her from the board of governors for the Federal Reserve in August. The firing is currently on hold pending a Supreme Court review.Pulte defended his agency's criminal referral of Cook to CNBC in August, saying it wasn't politically motivated. \"We make referrals almost every day. Lisa Cook happened to be one of them,\" he said.In an interview with \"Squawk Box\" in September, Pulte refused to tell host Andrew Ross Sorkin where the tip came from.\"I'm not going to explain our sources and methods, where we get tips from, who are whistleblowers,\" Pulte said.Swalwell's lawsuit says no comparable FHFA criminal referrals have been made against Trump allies. There is evidence that top Trump officials like Treasury Secretary Scott Bessent made mortgage claims similar to ones Trump cited to try to fire Cook.Spokespeople for the FHFA and DOJ did not immediately respond to CNBC's request for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eric Swalwell sues FHFA chief Pulte, alleging director used private information to attack Trump critics",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106237343-1573479639092rts2h5cp.jpg?v=1573479741&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T19:26:35.000Z",
      "dateModified": "2025-11-26T19:26:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge dismisses Trump election interference racketeering case in Georgia",
    "url": "https://www.cnbc.com/2025/11/26/trump-georgia-election-case-dismissed-2020.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108230861-1764172468628-108230861-1763989708794-gettyimages-2247478837-gy7fo6hhgkjw3vhhv7wyujcpty.jpg?v=1764172475&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T19:56:27.000Z",
    "description": "President Donald Trump returns to the White House on Marine One in Washington, D.C., on November 22, 2025.Allison Robbert | The Washington Post | Gett",
    "body": "President Donald Trump returns to the White House on Marine One in Washington, D.C., on November 22, 2025.Allison Robbert | The Washington Post | Getty ImagesA judge in Georgia on Wednesday dismissed the historic racketeering case brought against President Donald Trump over his efforts to overturn his loss in the state's 2020 election.The ruling by Fulton County Superior Court Judge Scott McAfee, who ordered the case \"dismissed in its entirety,\" draws to a close the final criminal case against Trump that remained unresolved after he won back the White House in 2024.McAfee's ruling came shortly after state prosecutor Peter Skandalakis moved to drop the case against Trump and his remaining co-defendants \"to serve the interests of justice and promote judicial finality.\"\"In my professional judgment, the citizens of Georgia are not served by pursuing this case in full for another five to ten years,\" Skandalakis wrote in a court filing.Fulton County Sheriff's OfficeTrump celebrated the ruling later Wednesday, writing in a lengthy Truth Social post that \"LAW and JUSTICE have prevailed.\"\"This case should never have been brought,\" Steve Sadow, Trump's lead attorney in the case, said in a statement. \"A fair and impartial prosecutor has put an end to this lawfare.\"The case brought by Fulton County District Attorney Fani Willis initially charged Trump with 13 criminal counts, including the serious charge of violating Georgia's powerful anti-racketeering law.The indictment, returned by a grand jury in August 2023, alleged that Trump and numerous co-defendants — including his former lawyers Rudy Giuliani and John Eastman, and former White House chief of staff Mark Meadows — illegally tried to reverse Joe Biden's victory in the state's 2020 presidential contest.Fulton County District Attorney Fani Willis looks on during a hearing in the case of the State of Georgia v. Donald John Trump at the Fulton County Courthouse on March 1, 2024, in Atlanta, Georgia.Alex Slitz-Pool | Getty Images News | Getty ImagesThose efforts included pressuring Georgia's secretary of state, Brad Raffensperger, to find Trump enough votes for him to overcome his margin of loss to Biden.The case was once seen as one of the biggest threats to the GOP leader, who was already grappling with a torrent of other criminal indictments and civil lawsuits. At least four of Trump's 18 co-defendants pleaded guilty within two months of the indictment being filed.It also produced one of the most striking images in recent U.S. political history: a mugshot of the president, who was forced to travel to Fulton County jail to be booked on the state charges.But the case ran into major problems long before Trump's reelection in 2024 effectively put it on ice.In September 2024, McAfee tossed out two of the criminal counts against Trump and some of his co-defendants, though he kept the top charges intact.By that time, Willis was facing intensifying scrutiny over her romantic relationship with Nathan Wade, one of the top prosecutors in the criminal case. She defended herself in dramatic courtroom testimony against the allegations of impropriety, but was disqualified from the case in December 2024.The Georgia Supreme Court declined to hear Willis' appeal. The case was eventually handed to Skandalakis on Nov. 14, less than two weeks before he asked McAfee to dismiss it.Read more CNBC politics coverageJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'\"This entire case, from the initiation of the District Attorney's investigation in 2021 to the present, is without precedent,\" Skandalakis wrote in the 23-page request for McAfee to drop the case.\"Never before, and hopefully never again, will our country face circumstances such as these,\" he wrote in the motion for what is known as a \"nolle prosequi.\"He noted that the prospect of bringing the case against Trump to trial would take years, as there is \"no realistic prospect that a sitting President will be compelled to appear\" in court and it would be \"impossible\" to quickly proceed after he leaves office in 2029.Skandalakis also foreclosed on the possibility of severing Trump from the remaining defendants and conducting separate trials, writing that it would be \"both illogical and unduly burdensome and costly for the State and for Fulton County.\"\"Some may argue that cases against the campaign attorneys and advisors should proceed even if President Trump is removed from the indictment,\" Skandalakis wrote. \"However, I am extremely reluctant to criminalize the act of attorneys providing flawed legal advice to the President of the United States under these circumstances.\"The Prosecuting Attorneys' Council of Georgia also lacks the resources to conduct multiple trials, according to Skandalakis. \"Continuing this litigation under these circumstances would neither serve the citizens of Georgia nor fulfill our statutory obligations.\"Despite asking for the case to be closed, Skandalakis suggested that the efforts by Trump and his allies to overturn the 2020 election, in Georgia and elsewhere, were serious.\"As I have previously stated, contesting an election is not unlawful,\" he wrote. \"However, the strategy conceived in Washington, D.C. to contest the 2020 Presidential Election quickly shifted from a legitimate legal effort into a campaign that ultimately culminated in an attack on the Capitol, undertaken to prevent the Vice President from carrying out his ministerial duty of counting the electoral votes.\"Skandalakis said he believed the case would be \"best pursued at the federal level.\" But he acknowledged that former special counsel Jack Smith, who had pursued federal election interference charges against Trump, was forced to drop his case after the Supreme Court strengthened immunity powers for former presidents, and after Trump won reelection.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge dismisses Trump election interference racketeering case in Georgia",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108230861-1764172468628-108230861-1763989708794-gettyimages-2247478837-gy7fo6hhgkjw3vhhv7wyujcpty.jpg?v=1764172475&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T19:56:27.000Z",
      "dateModified": "2025-11-26T19:56:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The 10 U.S. cities where pay for young workers is rising the fastest, says new research",
    "url": "https://www.cnbc.com/2025/11/26/the-10-us-cities-where-pay-for-young-workers-is-rising-the-fastest-says-new-research.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231815-1764088841231-gettyimages-2214833007-ma117338.jpeg?v=1764088853&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T14:22:39.000Z",
    "description": "It's been a tough job market for young professionals, but there's some good news for 2026: New grads with up to four years' work experience are expect",
    "body": "It's been a tough job market for young professionals, but there's some good news for 2026: New grads with up to four years' work experience are expected to see stronger wage growth next year, according to Glassdoor research.In other words, early-career workers who can secure a job are likely to have more spending power, at a rate surpassing 2020 levels — the last time wage growth kept pace with inflation.Wage growth will vary depending on the location. While rising cities may not offer the biggest paychecks compared to places like New York or San Francisco, they're seeing the fastest wage growth and offer a lower cost of living, Glassdoor researchers note.These are the top 10 cities for early-career wage growth since 2020, according to Glassdoor research:1. Provo, UtahAnnual growth since 2020: 7.0%Average salary in 2025: $61,164Job groups with fastest wage growth: Research and science; product and project management; human resources2. Boise, IdahoAnnual growth since 2020: 5.5%Average salary in 2025: $60,876Job groups with fastest wage growth: Health care; skilled labor and manufacturing; business3. Orlando, FloridaAnnual growth since 2020: 5.4%Average salary in 2025: $55,782Job groups with fastest wage growth: Skilled labor and manufacturing; research and science; customer services and support4. Charleston, South CarolinaAnnual growth since 2020: 5.3%Average salary in 2025: $59,100Job groups with fastest wage growth: Health care; sales; skilled labor and manufacturing5. Austin, TexasAnnual growth since 2020: 5.2%Average salary in 2025: $71,808Job groups with fastest wage growth: Customer services and support; legal; research and science6. Miami-Fort Lauderdale, FloridaAnnual growth since 2020: 5.2%Average salary in 2025: $62,970Job groups with fastest wage growth: Customer services and support; consulting; marketing7. Rochester, New YorkAnnual growth since 2020: 5.2%Average salary in 2025: $58,513Job groups with fastest wage growth: Health care, engineering, sales8. Denver, ColoradoAnnual growth since 2020: 5.1%Average salary in 2025: $73,711Job groups with fastest wage growth: Consulting; customer services and support; product and project management9. Richmond, VirginiaAnnual growth since 2020: 5.1%Average salary in 2025: $63,071Job groups with fastest wage growth: Finance and accounting; sales; product and project management10. Tucson, ArizonaAnnual growth since 2020: 5.1%Average salary in 2025: $59,975Job groups with fastest wage growth: Engineering; health care; retail and food servicesHealth-care jobs are the most in-demand roles with rising pay for young workers, Glassdoor lead researcher Chris Martin told CNBC Make It via email. These positions led wage growth in three of the top 10 cities: Boise, Charleston and Rochester.GlassdoorOverall, health care along with private education jobs have propped up the labor economy for some time. They make up about 17% of the jobs nationally but accounted for 56% of job growth between July 2023 and July 2025, according to an Indeed analysis of Bureau of Labor Statistics data.Meanwhile, customer services and support roles led wage growth in Miami and Austin, per Glassdoor.And in many cities, wages are rising for jobs across the income spectrum, according to Glassdoor data. For example, Tucson's fastest-growing salaries for young workers were for engineering roles that pay an average salary of $86,700 in 2025, followed by health care ($64,100) and then retail and food services jobs ($35,800).Earn more and get ahead with CNBC's online courses. Black Friday starts now! Get 25% off select courses and 30% off exclusive bundles with coupon code GETSMART. Offer valid November 17 through December 5, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The 10 U.S. cities where pay for young workers is rising the fastest, says new research",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231815-1764088841231-gettyimages-2214833007-ma117338.jpeg?v=1764088853&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T14:22:39.000Z",
      "dateModified": "2025-11-26T14:22:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Zootopia 2,' 'Wicked: For Good' lead Thanksgiving box office ",
    "url": "https://www.cnbc.com/2025/11/26/thanksgiving-box-office-zootopia-2-wicked-for-good.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232613-1764176601111-g_studio_zootopia2_02_still_7b4ea150_Cropped.jpg?v=1764176670&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T17:50:45.000Z",
    "description": "Disney's \"Zootopia 2\" follows detectives Judy Hopps and Nick Wilde find themselves on the twisting trail of a mysterious reptile who turns the mammal ",
    "body": "Disney's \"Zootopia 2\" follows detectives Judy Hopps and Nick Wilde find themselves on the twisting trail of a mysterious reptile who turns the mammal metropolis of Zootopia upside down.DisneyMoviegoers have plenty to feast on at the box office this Thanksgiving.Disney's \"Zootopia 2\" snared $10.2 million in Tuesday previews, the second-highest haul for a Disney Animation Studios film ever, behind only last year's \"Moana 2,\" which took in $13.8 million. It's the eighth-highest preview for an animated movie of all time. Box office analysts expect the film to generate between $135 million and $150 million during the five-day Thanksgiving period. Although that will be significantly below the $225.4 million that \"Moana 2\" took in during the same period last year, it is a welcome jolt for a box office that has struggled in the last few months to drum up ticket sales.Also in the mix is Universal's \"Wicked: For Good,\" which tallied $147 million during its opening last week and is expected to bring in between $80 million and $100 million over the five-day holiday. That figure could be higher considering last year's \"Wicked\" tallied $118 million during the Thanksgiving frame after debuting to $112.5 million during the same pre-Thanksgiving weekend.\"The Thanksgiving holiday frame is one of the most important moviegoing periods of the year and is off to a running start with the overperforming 'Wicked: For Good' powering an impressive five days of box office revenue for movie theaters in the $300 million range,\" said Paul Dergarabedian, head of marketplace trends at Comscore. \"'Zootopia 2' has a perfect release date and built-in brand recognition and a revenue enhancing PG rating so that's a huge plus.\"Thanksgiving this year is facing tough comparisons after the 2024 holiday saw \"Moana 2,\" \"Wicked\" and \"Gladiater II\" fuel a record-breaking $424.9 million domestic five-day score. Previously, the highest-grossing Thanksgiving haul was $315.6 million, which was captured in 2018, according to data from Comscore.\"While that record is in no jeopardy of being broken, this year will nonetheless prove to be a solid Thanksgiving holiday corridor for movie theaters that will likely rank in the top five performing frames historically of all time,\" said Dergarabedian.Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast's planned spinoff of Versant.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Zootopia 2,' 'Wicked: For Good' lead Thanksgiving box office ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232613-1764176601111-g_studio_zootopia2_02_still_7b4ea150_Cropped.jpg?v=1764176670&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T17:50:45.000Z",
      "dateModified": "2025-11-26T17:50:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Homebuyers make a last gasp effort before the holidays, but interest rates offer little incentive",
    "url": "https://www.cnbc.com/2025/11/26/homebuyers-make-a-last-gasp-effort-before-the-holidays-but-interest-rates-offer-little-incentive.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225448-1763044515960-gettyimages-2245910288-MORTGAGE_APPLICATION_FIGURES.jpeg?v=1763044637&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T12:00:01.000Z",
    "description": "A \"For Sale\" sign in front of a home in Crockett, California, US, on Wednesday, Nov. 12, 2025. David Paul Morris | Bloomberg | Getty ImagesMortgage ra",
    "body": "A \"For Sale\" sign in front of a home in Crockett, California, US, on Wednesday, Nov. 12, 2025. David Paul Morris | Bloomberg | Getty ImagesMortgage rates have hovered around the same range for roughly two months, giving current borrowers nor potential homebuyers little incentive to get into the market. Total mortgage application volume was essentially flat last week, up just 0.2% from the prior week, according to the Mortgage Bankers Association's seasonally adjusted index. The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances $806,500 or less increased to 6.40% from 6.37%, with points decreasing to 0.60 from 0.62, including the origination fee, for loans with a 20% down payment. That was the highest since early October. Last year, during the same week, the average rate was 46 basis points higher. Despite the slight rate increase, applications for a mortgage to purchase a home rose 8% for the week and were 20% higher than the same week a year ago. That was driven by buyers looking for cheaper loans. The government purchase index, which includes FHA, VA, and USDA applications, increased 9% for the week and had its strongest week since 2023.Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.\"Affordability remains a challenge in many markets and government loan programs remain appealing to qualified buyers looking to purchase a home. The average purchase loan size decreased to its lowest level in two months,\" said Joel Kan, MBA Vice President and Deputy Chief Economist. Applications to refinance a home loan dropped 6% for the week but were 117% higher than the same week one year ago. That enormous annual difference is not because of any refinance boom; it's simply that the numbers were so very low a year ago. Mortgage rates dropped back a bit to start this week, according to a separate survey from Mortgage News Daily (MND). \"Rather than credit any of the recent underlying events, the improvement in rates/bonds has more to do with idiosyncratic trading conditions that are often seen on major holiday weeks,\" explained Matthew Graham, chief operating officer at MND. \"That said, some of [Tuesday's] data and events contributed. These include another weak reading in weekly employment numbers from ADP as well as a reaction to rumors that rate-friendly Kevin Hassett will be the next Fed Chair.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Homebuyers make a last gasp effort before the holidays, but interest rates offer little incentive",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225448-1763044515960-gettyimages-2245910288-MORTGAGE_APPLICATION_FIGURES.jpeg?v=1763044637&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T12:00:01.000Z",
      "dateModified": "2025-11-26T12:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump pardons Thanksgiving turkeys, blasts Biden and says Ukraine peace deal is ‘very close’",
    "url": "https://www.cnbc.com/2025/11/25/trump-turkey-pardon-biden-ukraine-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231861-17640921532025-11-25t173253z_89963273_rc2s3iaukfyf_rtrmadp_0_usa-thanksgiving-trump.jpeg?v=1764092166&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T21:33:45.000Z",
    "description": "U.S. President Donald Trump looks at Gobble one of two turkeys to ceremonially pardoned for Thanksgiving in the Rose Garden at the White House in Wash",
    "body": "U.S. President Donald Trump looks at Gobble one of two turkeys to ceremonially pardoned for Thanksgiving in the Rose Garden at the White House in Washington, D.C., U.S., November 25, 2025. Jonathan Ernst | ReutersGobble and Waddle won't get gobbled this Thanksgiving — they're waddling off to freedom instead after President Donald Trump granted pardons to those two turkeys on Tuesday.During the traditional Rose Garden ceremony in which the birds get spared from the butcher, Trump also suggested a U.S.-brokered peace deal between Ukraine and Russia soon could come to fruition.\"I think we're getting very close to a deal; we'll find out,\" Trump said. \"I think we're making progress.\"Trump also bashed former President Joe Biden, claiming that his predecessor used an autopen to sign last year's turkey pardons, making them \"totally invalid.\" Trump cracked that he has \"officially pardoned\" those other birds, Peach and Blossom, adding that he \"saved them in the nick of time.\"Gobble and Waddle were raised on a small farm in Wayne County, North Carolina, owned by Travis and Amanda Pittman, who raised turkeys for Butterball.First lady Melania Trump's office had encouraged Americans to text \"Gobble\" or \"Waddle\" to 45470 to decide which bird would receive the formal pardon. Earlier this year, she posted a poll on X to name the birds.Born in July and weighing 52 and 50 pounds respectively, Gobble and Waddle spent the past week getting used to noise, lights, and crowds before checking into their ceremonial suite at the Willard InterContinental Hotel — a long-running perk of being a presidential turkey.The National Thanksgiving Turkeys from North Carolina, named Waddle and Gobble, wait in their room a day ahead of their Thanksgiving holiday pardoning at the White House, at the Willard InterContinental Hotel in Washington, D.C., U.S., November 24, 2025. Nathan Howard | ReutersWhite House Press Secretary Karoline Leavitt holds her son Nicholas as Waddle, one of the National Thanksgiving turkeys, visits the press briefing room of the White House, prior to the turkey pardoning ceremony with US President Donald Trump on November 25, 2025, in Washington, DC. Alex Wroblewski | Afp | Getty ImagesExperts previously told CNBC that retailers who ordered turkeys early locked in lower prices, while others relying on the spot market are facing steeper costs. Wells Fargo's agriculture team said there could be a $20 difference in the price of comparably sized turkeys depending on where consumers shopped.Major retailers have offered holiday promotions to lure cost-conscious shoppers.Walmart is advertising a dinner bundle for 10 people for under $56; Aldi has one for $40; Amazon is offering a $25 dinner promotion; and Target announced a $20 Thanksgiving deal for four.Despite elevated turkey prices, the broader Thanksgiving meal for 10 is less expensive for the third straight year, according to the AFBF. A \"classic\" 16-pound turkey dinner with sides averages $55.18 nationwide.The annual turkey presentation dates to the 1940s and became a formal presidential pardon in 1989 under George H. W. Bush. But presidents have been gifted turkeys since the 1870s, according to the White House Historical Association. Over time, the rite has evolved into soft marketing for America's multibillion-dollar  poultry industry.This year's moment of pageantry comes in a second term where Trump has leaned heavily on his actual pardon power, granting relief to more than 1,000 January 6 rioters and high-profile figures including former Illinois Gov. Rod Blagojevich, disgraced former representative George Santos and former New York City Mayor Rudy Giuliani. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump pardons Thanksgiving turkeys, blasts Biden and says Ukraine peace deal is ‘very close’",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231861-17640921532025-11-25t173253z_89963273_rc2s3iaukfyf_rtrmadp_0_usa-thanksgiving-trump.jpeg?v=1764092166&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T21:33:45.000Z",
      "dateModified": "2025-11-25T21:33:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Black Friday is most popular with Gen Z, even as the holiday loses its shine, new survey finds",
    "url": "https://www.cnbc.com/2025/11/26/att-holiday-shopping-survey-black-friday-gen-z.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231995-1764101405012-gettyimages-2247871527-TARGET_SHOPPERS.jpeg?v=1764101572&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T19:07:54.000Z",
    "description": "Black Friday signage at a Target store ahead of Black Friday in Jersey City, New Jersey, US, on Tuesday, Nov. 25, 2025. Michael Nagle | Bloomberg | Ge",
    "body": "Black Friday signage at a Target store ahead of Black Friday in Jersey City, New Jersey, US, on Tuesday, Nov. 25, 2025. Michael Nagle | Bloomberg | Getty ImagesBlack Friday is proving more popular for younger consumers than for their elders, according to a new report provided exclusively to CNBC.AT&T Business' 2025 Holiday Shopping Survey, conducted by Morning Consult, found that 40% of Generation Z members and 32% of millennials plan to do most of their shopping on Black Friday. Older generations, on the other hand, prefer to shop later in the season, just a week or two before Christmas, the survey found.  \"Black Friday is always such a big deal, and the pricing and the offers and advertising that's done during that time is probably what would draw Gen Z, especially things done on social media,\" said Angela Rutherford, AT&T's vice president of mid-market sales.The enthusiasm for Black Friday comes even as Gen Z plans to pull back their spending. Read more CNBC Black Friday newsShoppers curtail Black Friday spending: 'They are using every tool that they can,' expert saysBlack Friday is most popular with Gen Z, even as the holiday loses its shine, new survey findsBlack Friday car deals are sparser this year, analyst says: ‘Buyers may be a little disappointed’Pro: Wall Street’s favorite holiday shopping stocks as Black Friday nearsConsulting firm PwC reported in September that Gen Z shoppers plan to spend 23% less on average this holiday season than a year ago – the sharpest decline of any generation and a significant change from the previous year, when Gen Z said they planned to spend 37% more.And as non-wealthy Americans face pressures of higher prices and economic uncertainty, some reports are showing signs of a \"K-shaped\" economy that may stretch into the holiday season, with wealthier consumers spending more and lower-income consumers shopping more conservatively.A new Deloitte survey found that consumers at large plan to spend 4% less on Black Friday than they did last year, primarily due to concerns of financial constraints and a higher cost of living.Still, Rutherford said consumers are being more \"intentional and value-driven\" in their holiday shopping this year. That spending is translating into more support for small businesses rather than large legacy retailers, with 77% of consumers reporting they would do all of their holiday shopping at small businesses if they could and if the pricing was the same, according to AT&T's survey. Compared with last year, the number of survey respondents who said they shop at small businesses to boost their local economies grew by 8 percentage points. \"I think there's a price consciousness out there, combined with a, 'If I can still save money or get a good price, I will still shop local,' type of mentality out there,\" Rutherford said. The AT&T survey also found that 72% of people reported getting their gift ideas from in-person shopping rather than from social media. And even as artificial intelligence begins to reshape the way people shop, more than half of shoppers said they were more likely to use traditional online search methods for their gifting this holiday season than AI – just 9% of those surveyed said they are more likely to use AI to find gifts. \"AI has exploded over the last couple years, and it's infiltrating all aspects of life,\" Rutherford said. \"I think as time goes on, you will see a shift from the traditional search to AI for shopping.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Black Friday is most popular with Gen Z, even as the holiday loses its shine, new survey finds",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231995-1764101405012-gettyimages-2247871527-TARGET_SHOPPERS.jpeg?v=1764101572&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T19:07:54.000Z",
      "dateModified": "2025-11-26T19:07:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]