[
  {
    "title": "Oil prices jump after Trump says Iran supreme leader 'should be very worried'",
    "url": "https://www.cnbc.com/2026/02/04/oil-prices-jump-on-report-us-iran-nuclear-talks-are-collapsing.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108253682-1768587130467-gettyimages-2255969652-US_VENEZUELA_OIL.jpeg?v=1768587205&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T21:02:29.000Z",
    "description": "Tankers docked at the Phillips 66 Freeport Terminal in Freeport, Texas, US, on Friday, Jan. 16, 2026. Mark Felix | Bloomberg | Getty ImagesOil prices ",
    "body": "Tankers docked at the Phillips 66 Freeport Terminal in Freeport, Texas, US, on Friday, Jan. 16, 2026. Mark Felix | Bloomberg | Getty ImagesOil prices rose Wednesday after President Donald Trump said Iran's Supreme Leader Ayatollah Ali Khamenei \"should be very worried.\" U.S. crude oil rose $1.93, or 3.05%, to close at $65.14 a barrel. Global benchmark Brent was up $2.13, or 3.16%, to settle at $69.46 a barrel. \"I would say he should be very worried. Yeah, he should be,\" Trump told NBC News in an interview. \"As you know, they're negotiating with us.\"The president has threatened to launch strikes on Iran if it doesn't agree to a deal governing its nuclear program. He previously threatened to intervene on the side of protestors who rose up against the Islamic Republic in January, but ultimately backed away from military action. A conflict with Iran or a collapse of the regime could disrupt crude oil supplies in the Middle East. Iran is an OPEC member and significant oil producer.But talks between the U.S. and Iran could still de-escalate tensions. Iran Foreign Minister Abbas Araghchi said discussions with the U.S. on the Islamic Republic's nuclear program will take place at 10 a.m. Friday in Muscat, Oman. The planned discussions were on the verge of collapsing earlier Wednesday after Washington and Tehran couldn't agree on a location and format, according to Axios. Middle Eastern leaders successfully lobbied the U.S. to not walk away from the discussions, two U.S. officials told Axios. Trump's warning comes after the U.S. military said Tuesday it shot down an Iranian drone that approached the USS Abraham Lincoln aircraft carrier. Iranian gunboats also tried to board a U.S. merchant vessel in the Strait of Hormuz, according to U.S. Central Command. Iranian media said the drone was conducting routine surevillance that is permitted under international law.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oil prices jump after Trump says Iran supreme leader 'should be very worried'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108253682-1768587130467-gettyimages-2255969652-US_VENEZUELA_OIL.jpeg?v=1768587205&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T21:02:29.000Z",
      "dateModified": "2026-02-04T21:02:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "E.l.f. Beauty posts earnings beat, raises full-year guidance",
    "url": "https://www.cnbc.com/2026/02/04/elf-beauty-elf-q3-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107327059-1698856159605-031622_SLHaloGroup-V1_Main_0186_STACK_FINAL_IGF.jpg?v=1716394371&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T22:52:55.000Z",
    "description": "Elf Beauty cosmeticsCourtesy: e.l.f BeautyE.l.f. Beauty reported a huge earnings beat Wednesday and raised its guidance for the fiscal year.E.l.f. sto",
    "body": "Elf Beauty cosmeticsCourtesy: e.l.f BeautyE.l.f. Beauty reported a huge earnings beat Wednesday and raised its guidance for the fiscal year.E.l.f. stock was up as much as 15% in after-hours trading before losing the majority of those gains.Here's what the company reported for the third fiscal quarter, compared with analyst estimates from LSEG:Earnings per share: $1.24 adjusted vs. 72 cents expectedRevenue: $490 million vs. $460 million expectedE.l.f. said net sales increased 38% to $489.5 million, or $1.24 per share, up from $355 million, or 74 cents a share, in the same period a year ago, driven by growth across the globe and across its retailers and e-commerce. It reported adjusted net income of $74.5 million, up from $43 million over the same period a year ago.The company recently acquired celebrity Hailey Bieber's skin-care company, Rhode, in a roughly $1 billion deal, and it contributed $128 million to the company's net third-quarter sales growth. E.l.f. told CNBC it's projecting Rhode to contribute up to $265 million in net sales this year, up $65 million from its previous guidance.E.l.f. also raised its full-year guidance, increasing its revenue outlook by a range of $42 million to $50 million.\"Our Q3 results, which included 130 basis points of market share gains for our namesake e.l.f. Cosmetics brand and a record-breaking launch of rhode in Sephora in the U.K., are a continuation of the consistent, category-leading growth we've delivered over the past 28 quarters,\" CEO Tarang Amin said in a statement. \"Our value proposition, powerhouse innovation and disruptive marketing engine continue to fuel our brands.\"— CNBC's Jodi Gralnick contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "E.l.f. Beauty posts earnings beat, raises full-year guidance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107327059-1698856159605-031622_SLHaloGroup-V1_Main_0186_STACK_FINAL_IGF.jpg?v=1716394371&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T22:52:55.000Z",
      "dateModified": "2026-02-04T22:52:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon CEO Andy Jassy picks marketplace exec to be his new 'shadow' advisor",
    "url": "https://www.cnbc.com/2026/02/04/amazon-jassy-new-shadow-advisor-dharmesh-mehta.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217788-1761657947456-gettyimages-2201505685-ALEXA_AI_UNVEILING.jpeg?v=1770235877&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T20:45:10.000Z",
    "description": "Andy Jassy, CEO of Amazon, speaks during an unveiling event in New York, Feb. 26, 2025.Michael Nagle | Bloomberg | Getty ImagesAmazon CEO Andy Jassy h",
    "body": "Andy Jassy, CEO of Amazon, speaks during an unveiling event in New York, Feb. 26, 2025.Michael Nagle | Bloomberg | Getty ImagesAmazon CEO Andy Jassy has tapped one of the company's top marketplace executives to be his new \"shadow\" advisor, the company announced Wednesday.In a blog post, Amazon said Dharmesh Mehta, vice president of worldwide selling partner services, will become Jassy's technical advisor in March.Amazon said Amit Agarwal, its senior vice president of international stores, will take on Mehta's responsibilities as part of an expanded role that will also include its customer trust teams.The role of technical advisor, often referred to internally as a \"shadow,\" is one of the most sought after positions in the company. The role involves accompanying Jassy to most of his meetings to learn more about Amazon's various businesses. Shadow advisors typically go on to assume greater roles inside the company. Jassy served as Amazon founder Jeff Bezos' shadow in the early 2000s, before he went on to be CEO of Amazon Web Services. Jay Marine, a top executive in Amazon's Prime Video streaming unit, was Bezos' shadow in 2013. Agarwal served as Bezos' shadow from 2007 to 2009 before he helped oversee Amazon's international expansion and India business. Mehta replaces Alex Dunlap, a former AWS VP who was appointed Jassy's technical advisor in late 2024, Business Insider reported.  Read more CNBC tech news'Muskonomy' shakeup: SpaceX valuation approaches Tesla's after merger with xAIPinterest CEO rebukes, fires 'obstructionist' employees who created tool to track layoffsNvidia, OpenAI appear stalled on their mega deal. But the AI giants still need each otherNvidia's Jensen Huang denies OpenAI deal rumors: 'There's no drama'",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon CEO Andy Jassy picks marketplace exec to be his new 'shadow' advisor",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217788-1761657947456-gettyimages-2201505685-ALEXA_AI_UNVEILING.jpeg?v=1770235877&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T20:45:10.000Z",
      "dateModified": "2026-02-04T20:45:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bitcoin bleeds for second straight day, nearly grazes $72,000",
    "url": "https://www.cnbc.com/2026/02/04/bitcoin-bleeds-for-second-straight-day-nearly-grazes-72000.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108239329-1765313567199-gettyimages-2250323804-US_CRYPTO.jpeg?v=1770231880&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T19:27:25.000Z",
    "description": "Bitcoin signage in Times Square in New York, US, on Tuesday, Dec. 9, 2025.  Michael Nagle | Bloomberg | Getty ImagesBitcoin nearly touched the $72,000",
    "body": "Bitcoin signage in Times Square in New York, US, on Tuesday, Dec. 9, 2025.  Michael Nagle | Bloomberg | Getty ImagesBitcoin nearly touched the $72,000 mark on Wednesday, marking the second straight day of its massive retreat this week. The world's oldest cryptocurrency sank as low as $72,096.20, plunging more than 5% on the day. It was last trading at $72,958.38, down about 4% on the day. Bitcoin is currently more than 40% off its record high of about $126,000 hit last October. Stock Chart IconStock chart iconBitcoin in the past day, per Coin MetricsBitcoin first broke below the $73,000 mark on Tuesday, hitting its lowest price in roughly 16 months and approaching its pre-election value. Analysts say $70,000 is a key level to watch as the digital asset's downturn deepens, according to a Citi note to clients dated Tuesday.  The token's value is bleeding as a result of several of geopolitical and economic challenges, among other headwinds. Chief among them is investors' recent rotation out of risk-on assets due to rising tensions between the U.S. and Europe over U.S. President Donald Trump's Greenland gambit and a recently ended partial government shutdown that delayed the release of some critical economic data. Also at play are expectations of a U.S. monetary policy shift following Trump's nomination of Kevin Warsh for Fed chair late last month as well as a slowdown in efforts to create more crypto-friendly regulatory and legislative guardrails in the U.S. Large institutional outflows driven by expectations of a deeper bitcoin correction has also thinned liquidity for the token, hurting its price, according to a recent analyst note from Deutsche Bank. Spot bitcoin exchange-traded funds have seen significant outflows since a series of liquidations of highly leveraged digital asset positions last October, the analysts noted. The funds have recorded outflows of more than $3 billion in January, roughly $2 billion last December, and about $7 billion last November.  Bitcoin's pullback hit several crypto stocks. Strategy, a bitcoin treasury firm, was also down 5% on the day, while digital asset mining names like Riot Platforms and MARA Holdings shed almost 11%.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bitcoin bleeds for second straight day, nearly grazes $72,000",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108239329-1765313567199-gettyimages-2250323804-US_CRYPTO.jpeg?v=1770231880&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T19:27:25.000Z",
      "dateModified": "2026-02-04T19:27:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he'll stay out of Netflix, Paramount Skydance fight to take over WBD",
    "url": "https://www.cnbc.com/2026/02/04/trump-wbd-netflix-paramount-skydance.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108260632-1770120568283-gettyimages-2258483703-AFP_94LU6RD.jpeg?v=1770120649&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T00:39:05.000Z",
    "description": "U.S. President Donald Trump speaks before signing executive orders in the Oval Office in the White House in Washington, DC, on Jan. 30, 2026.Annabelle",
    "body": "U.S. President Donald Trump speaks before signing executive orders in the Oval Office in the White House in Washington, DC, on Jan. 30, 2026.Annabelle Gordon | Afp | Getty ImagesPresident Donald Trump said in a new interview on Wednesday did an about-face and said that he will not be involved in the fight between streaming giant Netflix and Paramount Skydance to buy some or all of Warner Bros. Discovery.\"I haven't been involved,\" Trump told \"NBC Nightly News.\"\"I've been called by both sides,\" Trump said. \"It's the two sides, but I've decided I shouldn't be involved. The Justice Department will handle it.\"Trump's latest comment is a pivot from what he said in early December after Netflix's proposed acquisition of WBD was made public.Trump at that time said the deal \"could be a problem\" because of the size of the market share Netflix would end up with if the proposed purchase was approved by federal regulators.The president, at the same time, had said he would be involved in the process of reviewing and potentially approving the deal, which, in addition to U.S. regulatory approval, faces a review by European regulators.The billionaire Larry Ellison, whose son David Ellison is Paramount's CEO, is close to Trump.And Netflix CEO Ted Sarandos visited Trump in the Oval Office shortly before his company's offer to WBD was recommended by WBD leadership. Netflix proposes acquiring WBD in a deal worth $72 billion, which would not include the company's cable networks, including CNN. The deal would give Netflix WBD's film studio, in addition to HBO and the streaming service HBO Max.Paramount, in response, launched a hostile takeover bid for all of WBD, with an enterprise value of more than $108 billion. \"There's a theory that one of the companies is too big and it shouldn't be allowed to do it, and the other company is saying something else,\" Trump told NBC News on Wednesday.\"They're beating the hell out of each other — and there'll be a  winner,\" the president said.Sarandos appeared Tuesday before the Senate Judiciary Committee's antitrust subcommittee, where he reportedly said that his meeting with Trump \"was not specifically to talk about the deal.\"\"I have confidence in this case on the merits, and that it will be run by the Department of Justice,\" Sarandos said, according to The New York Times.Sen. Mike Lee, a Utah Republican, at the hearing said, \"All told, one might say that Netflix  seeks to become the one platform to rule them all, or at least to  exercise a significant amount of market dominance,\" according to the Times.\"The merger raises numerous antitrust concerns, in a nutshell, consolidating both production and distribution power,\" Lee said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he'll stay out of Netflix, Paramount Skydance fight to take over WBD",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108260632-1770120568283-gettyimages-2258483703-AFP_94LU6RD.jpeg?v=1770120649&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T00:39:05.000Z",
      "dateModified": "2026-02-05T00:39:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ciena returns to S&P 500 after getting booted 17 years ago",
    "url": "https://www.cnbc.com/2026/02/04/ciena-returns-to-sp-500-after-getting-booted-17-years-ago.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261687-1770247972762-gettyimages-170545273-SMITH_CIENA_CORP.jpeg?v=1770248049&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T00:07:51.000Z",
    "description": "Gary Smith, chief executive officer and president of Ciena Corp., speaks during a Bloomberg Television interview in New York on June 14, 2013.Scott Ee",
    "body": "Gary Smith, chief executive officer and president of Ciena Corp., speaks during a Bloomberg Television interview in New York on June 14, 2013.Scott Eells | Bloomberg | Getty ImagesNetworking hardware maker Ciena will join the S&P 500, returning to the benchmark after getting booted 17 years ago. The stock rose in extended trading. Ciena is replacing human resources software company Dayforce, S&P Dow Jones Indices said in a statement on Wednesday. Private equity firm Thoma Bravo acquired Dayforce for $12.3 billion.Ciena sells a variety of products for high-speed fiber optical networks. Nearly 18% of revenue in the 2025 fiscal year came from an unnamed cloud provider, and about 11% came from AT&T, according to the company's annual report. Ciena's market cap has almost tripled in the past year. Shares of companies added to the S&P 500 often rise ahead of their inclusion in the index, as fund managers buy shares to match the benchmark. Technology companies AppLovin, Datadog, DoorDash and Robinhood entered the S&P 500 in 2025.For Ciena, the entry marks a return. The company joined the index in 2001, boosted by the dot-com and telecom boom, and was removed in 2009, when it was replaced by Visa. Investor excitement has returned due to soaring demand for data center infrastructure that can run generative artificial intelligence models. The opportunity represents \"a major contributor to our 2026 expected growth rate,\" Ciena CEO Gary Smith told analysts on a conference call in December. At the time, the company called for revenue to grow about 24% during the 2026 fiscal year, which would mark the fastest rate of expansion since 2011.On Tuesday, Ciena's stock closed at the highest price since 2001. Network equipment giant Cisco recorded a new high on Tuesday as well.As companies look to deliver additional AI capacity, components such as memory have become harder to find, driving up prices. Optical parts are also constrained, Marc Graff, Ciena's finance chief, said on the December conference call.\"We've worked really closely with our key suppliers and I know who those are, to make sure that we can secure supply,\" Graff said.WATCH: Josh Brown's best stocks in the market: Morgan Stanley, Baker Hughes and Cienawatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ciena returns to S&P 500 after getting booted 17 years ago",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261687-1770247972762-gettyimages-170545273-SMITH_CIENA_CORP.jpeg?v=1770248049&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T00:07:51.000Z",
      "dateModified": "2026-02-05T00:07:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Older workers with student loan debt have less saved for retirement, Fidelity finds",
    "url": "https://www.cnbc.com/2026/02/04/student-loan-debt-retirement-savings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261300-1770214880316-gettyimages-156914730-07e685b4-0bd1-4af1-a567-36e4fe517d51.jpeg?v=1770214893&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T20:47:16.000Z",
    "description": "Momo Productions | Stone | Getty ImagesStudent debt can make it more challenging to prepare for retirement — and that is reflected in the retirement b",
    "body": "Momo Productions | Stone | Getty ImagesStudent debt can make it more challenging to prepare for retirement — and that is reflected in the retirement balances of older borrowers, Fidelity data shows. Retirement balances are roughly 30% lower among employees over age 50 who currently have student debt, at an average of $153,000, compared to $221,000 for savers in that age group who do not have such loans, the financial services company wrote in a report published Wednesday.  Workers ages 18 to 49 with student loans have nest eggs about 20% smaller than those of their debt-free counterparts, with an average balance of $58,000 versus $72,000. Fidelity analyzed internal retirement account data, including that of borrowers enrolled in its student debt benefits programs.\"Student debt casts a long shadow,\" said Jesse Moore, head of student debt at Fidelity. \"It doesn't fade with age or career advancement. It's a structural issue that shapes financial security at every stage of life.\"Read more CNBC personal finance coverageMillions may drop ACA coverage — and raise health insurance costs for everyone elseRetirement savings 'lost and found' helps retirees track down old 401(k)sBigger SALT cap may 'drive higher refunds,' tax expert says — who benefitsWhat new Medicaid, SNAP work requirements mean for older workersTrump accounts could grow to $50,000 or more, president says. Advisors weigh inHousing affordability isn't just hurting buyers: More homeowners are falling behindFlying without a Real ID? You may owe $45 — or more — starting Feb. 1What Trump Fed chair pick Kevin Warsh may mean for consumersAverage tax refunds may be $1,000 higher, White House says. What to expectAs ACA subsidies expire, health costs emerge as top economic worry for votersData breaches hit a new high in 2025. How to protect your personal informationGameStop mania fed off investor angst. That still fuels 'gamblifying' of investingIRS owes some taxpayers refunds for pandemic-era relief: watchdog auditFed holds interest rates steady: What that means for your walletAltimeter Capital's Brad Gerstner backs Trump accounts for kids in IndianaCNBC's Financial Advisor 100: Best financial advisors, top firms rankedExperts say the findings highlight some of the burdens of student debt: Borrowers tend to delay investing for retirement or make smaller contributions than they otherwise might have. That leaves them with less time and money to grow their savings. Even later in their careers, student loan holders aren't catching up.Around 9.5 million Americans over 50 carry education debt, and their average balance is about $47,000, according to an analysis by higher education expert Mark Kantrowitz. \"Every dollar people spend on repaying debt is a dollar less they have available to save for retirement,\" Kantrowitz said. Retiring with student loan debt can have ripple effects, a separate poll from Fidelity found. A third of baby boomers surveyed said they delayed travel because of their student loans, while 16% put off purchasing a house and 8% had postponed starting a business. In October, the firm polled 747 U.S. adults who are currently paying back their student loans.Longer repayment terms could set borrowers backRecent legislative changes from President Donald Trump's \"big beautiful bill\" may only worsen the problems for older student loan borrowers, consumer advocates said.Currently, student loan repayment plans typically range from 10 to 25 years — which already results in people bringing education debt into middle age and beyond. But, starting in July, borrowers could face repayment terms as long as 30 years. \"This approach will perpetuate a cycle of indebtedness,\" said Carolina Rodriguez, director of the Education Debt Consumer Assistance Program in New York. \"Borrowers struggling with their own debt will be unable to save for retirement or for their children's education, inevitably leading to more borrowing.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Older workers with student loan debt have less saved for retirement, Fidelity finds",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261300-1770214880316-gettyimages-156914730-07e685b4-0bd1-4af1-a567-36e4fe517d51.jpeg?v=1770214893&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T20:47:16.000Z",
      "dateModified": "2026-02-04T20:47:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fed pick: Tillis doubles down on Warsh blockade over concerns about central bank independence",
    "url": "https://www.cnbc.com/2026/02/04/fed-warsh-tillis-confirmation.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108259765-1769800549683-gettyimages-2259101306-kd1_6883_mmgvt1cu.jpeg?v=1769800572&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T15:05:02.000Z",
    "description": "watch nowSen. Thom Tillis on Wednesday recommitted to his blockade of Kevin Warsh's nomination to lead the Federal Reserve until the Department of Jus",
    "body": "watch nowSen. Thom Tillis on Wednesday recommitted to his blockade of Kevin Warsh's nomination to lead the Federal Reserve until the Department of Justice ends its investigation into Fed Chair Jerome Powell. Tillis, R-N.C., said in an interview on CNBC's \"Squawk Box\" that he's \"willing to let it play out for the remainder of this Congress, if that's what's necessary to get to the truth or to get back to a process that makes sense and that keeps the Fed independent.\" \"I'd be one of the first people to introduce Mr. Warsh if we're behind this and support him, but not before this matter is settled,\" Tillis said.The DOJ last month opened an investigation into Powell relating to cost overruns for renovations at the Federal Reserve headquarters. The Justice Department is separately investigating Fed Governor Lisa Cook over alleged mortgage fraud.Tillis, who is retiring at the end of his term next January, also said he would keep his block even if the Justice Department agrees to toss the investigation in exchange for Powell leaving the Fed after his term as chair. Powell could remain on the board as a governor for two years. \"To ramp it down or have it adjudicated, that's the only way we get out of here as far as I'm concerned in this Congress for the next 333 days,\" Tillis said. \"I know how I would react to this, I'd be there for the remaining two years.\"\"They got ahead of their blockers. They didn't consult with the adults in the room when they decided to do the subpoenas,\" Tillis said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fed pick: Tillis doubles down on Warsh blockade over concerns about central bank independence",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108259765-1769800549683-gettyimages-2259101306-kd1_6883_mmgvt1cu.jpeg?v=1769800572&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T15:05:02.000Z",
      "dateModified": "2026-02-04T15:05:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Snap shares rise on fourth-quarter earnings that beat on sales",
    "url": "https://www.cnbc.com/2026/02/04/snap-q4-earnings-report-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108169684-1752081473153-untitled-657-2.jpg?v=1770247966&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T23:50:55.000Z",
    "description": "Evan Spiegel, CEO of Snap Inc. attends the annual Allen and Co. Sun Valley Media and Technology Conference at the Sun Valley Resort in Sun Valley, Ida",
    "body": "Evan Spiegel, CEO of Snap Inc. attends the annual Allen and Co. Sun Valley Media and Technology Conference at the Sun Valley Resort in Sun Valley, Idaho, July 9, 2025.David A. Grogan | CNBCSnap shares were up over 2% in after-hours trading on Wednesday after the Snapchat parent released fourth-quarter earnings that beat on sales. The company also announced a $500 million stock repurchase program.Here is how the company did compared with Wall Street's expectations:Earnings per share: 3 cents. That figure is not comparable to analysts' estimates.Revenue: $1.72 billion vs. $1.70 billion expected, according to LSEG Global daily active users: 474 million vs. 478 million expected, according to StreetAccountGlobal average revenue per user (ARPU): $3.62 vs. $3.56 expected, according to StreetAccountThe social media company said first-quarter revenue will be in the range of $1.50 billion to $1.53 billion, which is below analyst estimates of $1.55 billion. Sales in Snap's fourth quarter rose 10% year over year, while net income was $45.2 million, which was up nearly 400% from the $9.1 million it reported a year ago.Snap said that fourth-quarter adjusted earnings before interest, taxes, depreciation and amortization, or EBITDA, was $358 million, topping the $300 million that StreetAccount was projecting.The company also said that its adjusted EBITDA for the first quarter will be between $170 million and $190 million. That midpoint is higher than StreetAccount's estimates of $178 million.Snap's fourth-quarter global DAU dropped by 3 million quarter-over-quarter, which the company attributed to a reduction in marketing spending \"in order to focus on more profitable growth,\" according to a letter to investors.Additionally, Snap said that due to Australia's social media minimum age act, the company \"implemented platform-level age verification\" in that country during the fourth quarter that resulted \"in the removal of approximately 400,000 accounts.\"The company said that DAU for the North American region was 94 million, lower than the 97 million that Wall Street was projecting.Snap shares dipped slightly in after-hours trading when an analyst asked the company's executives during an earnings call about potential regulatory challenges. \"Obviously, there's quite a bit working its way to the court system right now that would further restrict the use of Snapchat for our community,\" Snap CEO Evan Spiegel said during the earnings call about the regulatory environment. Still, he said, the company's global ad sales stemming from users under the age of 18 is \"not material.\"\"Looking at the revenue-generating potential of the business looking forward, we're not overly concerned about the changing regulatory environment,\" Spiegel said.Snap CEO Evan Spiegel will be interviewed by CNBC's Julia Boorstin on Thursday at 11 AM ET.In the letter, Snap said it plans to focus on growing its subscription-related offerings, like Snapchat+ and the recently debuted Memories Storage Plans. The company said overall subscribers to those services grew 71% year over year to 24 million in the fourth quarter.\"Certainly memory storage plans were a big driver of the subscriber growth that we've seen recently,\" Spiegel said.Last week, Snap announced that it had created a wholly owned subsidiary named Specs Inc. that will develop and market the company's augmented reality glasses. \"We're super excited about what's ahead this year with the launch of Specs, and obviously graduating from the R&D phase of Specs to broader consumer adoption,\" Spiegel said about the company's upcoming AR glasses slated to debut in 2026.Because the company's AR glasses \"appeals to a different audience segment than the core Snapchat audience,\" Spiegel said, it's \"going to be really important for us to develop a standalone brand identity for Specs.\"Spiegel said that while \"there may be opportunities to raise additional capital\" for the company's AR glasses-related efforts in the future, Snap will need to be \"balancing\" the outside investment with its \"own ownership interest and any potential dilution.\"WATCH: Snap CEO Evan Spiegel on AR glasses.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Snap shares rise on fourth-quarter earnings that beat on sales",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108169684-1752081473153-untitled-657-2.jpg?v=1770247966&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T23:50:55.000Z",
      "dateModified": "2026-02-04T23:50:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "January jobs report will be released on Feb. 11 after shutdown delay",
    "url": "https://www.cnbc.com/2026/02/04/january-jobs-report-government-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250689-1767986912602-gettyimages-2255433333-anotherday172742671_qphcnx6n.jpeg?v=1770224915&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T18:45:04.000Z",
    "description": "A 'help wanted' advertisement is displayed in Manhattan on Jan. 9, 2026, in New York City.Spencer Platt | Getty ImagesThe January jobs report delayed ",
    "body": "A 'help wanted' advertisement is displayed in Manhattan on Jan. 9, 2026, in New York City.Spencer Platt | Getty ImagesThe January jobs report delayed by the brief government shutdown will be released next week, the Bureau of Labor Statistics said Wednesday.The closely watched report now will come out Feb. 11, five days later than its original release date, according to a revised schedule.In addition, the BLS will release the Job Openings and Labor Turnover Survey on Thursday, after it originally had been scheduled for Tuesday. There are other delays as well. The consumer price index for January now will be released on Feb. 13, two days later than its original release date. A companion release, which computes real earnings, will be subject to the same delay.Economists surveyed by Dow Jones expect the nonfarm payrolls report to show a gain of 60,000 jobs for the month, following an increase of 50,000 in December. The report also is projected to show that the unemployment rate held steady at 4.4%.Earlier Wednesday, payrolls processing firm ADP reported that companies added just 22,000 jobs in January.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "January jobs report will be released on Feb. 11 after shutdown delay",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250689-1767986912602-gettyimages-2255433333-anotherday172742671_qphcnx6n.jpeg?v=1770224915&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T18:45:04.000Z",
      "dateModified": "2026-02-04T18:45:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Corporate DEI index sees 65% drop in participation from Fortune 500 companies",
    "url": "https://www.cnbc.com/2026/02/04/corporate-dei-index-hrc.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108071288-1733330890976-gettyimages-2187618148-AFP_36PF8JQ.jpeg?v=1733330976&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T20:43:56.000Z",
    "description": "People hold flags outside the US Supreme Court on December 4, 2024 in Washington, DC, during oral argument on whether states can ban certain gender tr",
    "body": "People hold flags outside the US Supreme Court on December 4, 2024 in Washington, DC, during oral argument on whether states can ban certain gender transition medical treatments for young people. Roberto Schmidt | AFP | Getty ImagesNew research from the LGBTQ+ group Human Rights Campaign showed a drastic drop in Fortune 500 companies willing to publicly disclose their diversity, equity and inclusion practices.The HRC's 2026 Corporate Equality Index saw a 65% drop in participation this year, falling from 377 Fortune 500 companies in 2025 to just 131 companies in 2026. HRC noted many of the companies that dropped out hold federal contracts.\"Our research shows the strength and the strain of this moment on LGBTQ+ workers, consumers and the companies that count on us,\" HRC President Kelley Robinson said in a statement.Of the 1,450 companies that participated, 534 earned a score of 100, representing nearly 6 million U.S. employees, according to HRC. HRC's index launched in 2002 and rates companies based on their social responsibility and equity in the workplace.Over the past two years, the anti-DEI movement, championed by the White House, began to reframe the index, making it a conservative target.The Corporate Equality Index has increasingly seen more companies exiting its orbit, beginning with Tractor Supply and including big names like Walmart, Ford and Lowe's. Walmart, the largest U.S. retailer and grocer, said it had conversations with conservative activist Robby Starbuck, who has publicly advocated for a shift away from DEI, before the company pulled out.It was a significant change from years prior, when companies like Ford and Walmart issued public statements supporting DEI and touting their achievements in their workplaces.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Corporate DEI index sees 65% drop in participation from Fortune 500 companies",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108071288-1733330890976-gettyimages-2187618148-AFP_36PF8JQ.jpeg?v=1733330976&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T20:43:56.000Z",
      "dateModified": "2026-02-04T20:43:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China ramps up threats over Panama Canal ruling that handed Trump a major victory",
    "url": "https://www.cnbc.com/2026/02/04/china-us-trump-panama-canal-court-ruling-ck-hutchison.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261178-1770194219638-gettyimages-2200234379-AFP_36YA8B8.jpeg?v=1770194287&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T16:45:59.000Z",
    "description": "A cargo ship transits through Panama Canal Cocoli locks in Panama City on February 21, 2025.Martin Bernetti | Afp | Getty ImagesThe Chinese government",
    "body": "A cargo ship transits through Panama Canal Cocoli locks in Panama City on February 21, 2025.Martin Bernetti | Afp | Getty ImagesThe Chinese government has condemned a ruling from Panama's top court, warning the Central American country \"will inevitably pay a heavy price\" unless it changes course.The rebuke comes shortly after Panama's Supreme Court ruled to void Hong Kong-based CK Hutchison's license to operate ports at either end of the Panama Canal.The ruling was seen as a major victory for the Trump administration's security ambitions in the Western Hemisphere, given that the White House has made blocking China's influence over the critically important waterway one of its top priorities. In a commentary posted on Tuesday on its WeChat account, the Hong Kong and Macao Affairs Office of the State Council said the \"logically flawed\" and \"utterly ridiculous\" ruling was opposed by the Chinese government and the Hong Kong Special Administrative Region government.\"The Panamanian authorities should recognize the situation and correct their course,\" the Hong Kong and Macao Affairs Office said, according to a Google translation. \"If they persist in their own way and remain obstinate, they will inevitably pay a heavy price in terms of politics and economics!\" watch nowIn a brief statement on Jan. 29, Panama's top court said the terms under which Panama Ports Co., or PPC, a subsidiary of CK Hutchison, runs the Port of Balboa on the Pacific Coast and Cristóbal on the Atlantic side of the Panama Canal violated its constitution. The ruling came around a year after U.S. President Donald Trump threatened to seize control of the Panama Canal, saying the waterway was \"vital to our country\" and claiming, \"it's being operated by China.\"'Extensive damages'The comments from the Hong Kong and Macao Affairs Office reflect an escalation in tone from China's initial response to the ruling. A spokesperson for China's Ministry of Foreign Affairs said on Friday that the decision was \"contrary to the laws governing Panama's approval of the relevant franchises, and that the companies will reserve all rights, including legal proceedings.\" Beijing said it would take all necessary measures to safeguard the legitimate rights and interests of Chinese companies. PPC, which has held the contract to operate the ports of Balboa and Cristóbal since the 1990s, also said that the decision was inconsistent with the relevant legal framework. Aerial view of the Bridge of the Americas at the Pacific entrance of the Panama Canal, located next to the port of Balboa in Panama City, on January 30, 2026.Martin Bernetti | Afp | Getty ImagesCK Hutchison, for its part, said Wednesday that it had launched international arbitration proceedings against Panama after the country annulled its licenses to operate two Panama Canal ports. In a statement, the company said PPC would seek \"extensive damages\" over the ruling, without specifying the damages sought.Shares of CK Hutchison closed up more than 2% on Wednesday. The stock has climbed over 23% so far this year. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China ramps up threats over Panama Canal ruling that handed Trump a major victory",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261178-1770194219638-gettyimages-2200234379-AFP_36YA8B8.jpeg?v=1770194287&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T16:45:59.000Z",
      "dateModified": "2026-02-04T16:45:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A surprising share of homeowners have high mortgage rates. Here's the breakdown",
    "url": "https://www.cnbc.com/2026/02/04/homeowner-mortgage-rates-breakdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108191615-1756328988233-gettyimages-2232420756-dji_20250827113335_0375_d_ksayd8tl.jpeg?v=1770157693&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T15:11:16.000Z",
    "description": "An aerial view of homes in San Francisco, Aug. 27, 2025.Justin Sullivan | Getty ImagesThe share of U.S. homeowners with high rates on their mortgages ",
    "body": "An aerial view of homes in San Francisco, Aug. 27, 2025.Justin Sullivan | Getty ImagesThe share of U.S. homeowners with high rates on their mortgages has jumped sharply in just the last few years. That's having a marked impact on the refinance market and a somewhat more muted impact on home sales. Rates have been front and center in the debate over how to improve home affordability — and for good reason. In 2022, after mortgage interest rates hit more than a dozen record lows, sparking a refinance bonanza, barely 10% of homeowners had 30-year fixed mortgages with rates above 5%. Just four years later, that share has jumped to over 30%, according to ICE Mortgage Technology. About 20% of borrowers have mortgages with a rate over 6%.Home sales have been less than robust over the last few years, with the National Association of Realtors reporting a historically low 4.06 million sales last year, basically unchanged from 2024. This, after hitting a 15-year high of 6.12 million home sales in 2022. More recent sales, combined with some cash-out refinancing, pushed the share of higher-interest-rate borrowers up.There has been a major focus by the Trump administration to lower mortgage rates as a way to boost home affordability. The president recently announced a plan for Fannie Mae and Freddie Mac to buy more than $200 billion in mortgage-backed bonds. It is still a subject of debate as to how much lower that would push mortgage rates once the purchase is made, but just the announcement alone caused rates to drop a bit. Industry experts say the actual purchases could shave perhaps about an eighth of a percentage point off the current 30-year rate, putting it right around 6%. Last year at this time, the average rate on the 30-year fixed mortgage was just over 7%, according to Mortgage News Daily.  If the average on the 30-year fixed moved to 6%, 5.5 million current homeowners would be able to benefit from a refinance, according to ICE Mortgage Technology. Those homeowners could save at least 75 basis points on their rate, which makes the fees involved financially worthwhile, it said. If rates dropped to 5.88%, that number grows to 6.5 million homeowners. \"The most popular interest rate that's been used to buy a home over the last 3.5 years is between 6.875% and 6.99%, right? Nobody wanted to tell their neighbors they used a 7% interest rate to buy a home, so everybody bought down into this high 6% range,\" said Andy Walden, ICE Mortgage Technology's head of mortgage and housing market research. \"Coincidentally, those 15-basis-point-spread moves from this $200 billion in MBS purchase is moving rates from what would have been six and a quarter right now down to six and an eighth. And so it's providing meaningfully more refinance incentive than would otherwise be out there, and it's having an oversized impact on the market,\" he said. Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.Applications to refinance a home loan are now about 120% higher than they were one year ago, according to the Mortgage Bankers Association. As for home sales, the last four years were characterized by the so-called rate \"lock-in\" effect, meaning potential sellers didn't want to give up their historically low rates. They therefore put off moves that they might otherwise have wanted to make. Entering 2025, there were roughly 39 million homeowners with an interest rate below 5% and roughly 12 million with an interest rate below 3%, according to Walden.\"If you look at how those borrowers behaved last year, only about 6% of those folks gave up those low rates, either through a refinance to pull equity out of their home or through the sale of their home. Close to 95% of homeowners held on to those rates tight,\" he said.As for prospective homebuyers, a 15-basis-point drop on the 30-year fixed rate would save only about $35 a month on the mortgage payment for the average-priced home. Alternately, they could keep the rate and buy 1.5% more home. \"Certainly a move in the right direction, but not a massive movement for those homebuyers,\" said Walden. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A surprising share of homeowners have high mortgage rates. Here's the breakdown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108191615-1756328988233-gettyimages-2232420756-dji_20250827113335_0375_d_ksayd8tl.jpeg?v=1770157693&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T15:11:16.000Z",
      "dateModified": "2026-02-04T15:11:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eli Lilly's GLP-1 growth is only getting started as Novo Nordisk braces for a decline in 2026",
    "url": "https://www.cnbc.com/2026/02/04/eli-lilly-novo-nordisk-earnings-glp1-market.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261536-1770233397984-Side_by_Side_template.jpg?v=1770233491&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T21:05:25.000Z",
    "description": "The Eli Lilly and Novo Nordisk logos.Mike Blake | Tom Little | ReutersIt's a tale of two drugmakers in the red-hot obesity drug market. Both Novo Nord",
    "body": "The Eli Lilly and Novo Nordisk logos.Mike Blake | Tom Little | ReutersIt's a tale of two drugmakers in the red-hot obesity drug market. Both Novo Nordisk and Eli Lilly are grappling with lower prices in the U.S., but their 2026 outlooks are diverging sharply: While Novo is bracing for a sales decline, Lilly sees revenue jumping again thanks to its blockbuster medicines. The split in guidance — despite similar headwinds — underscores the strength of Lilly's position in the obesity and diabetes drug market, underpinned by its more effective injections and early foray into direct-to-consumer sales, among other factors. While Novo Nordisk effectively made the drugs mainstream, Lilly has since taken a clear edge in market share — and the forecasts show it will likely only extend its advantage this year.\"The difference in sales momentum and market share trend was visible throughout 2025, but the dichotomy between the two companies' prospects was accentuated within this 24-hour period in which Novo guided below consensus and Lilly guided above consensus expectations,\"  Leerink Partners analyst David Risinger told CNBC on Wednesday. \"That really solidified an investor's mind that Lilly is going to be the dominant player in obesity going forward,\" he added. This year, all eyes will be on how Lilly's upcoming obesity pill, orforglipron, fares against Novo's own oral Wegovy drug, which has had an explosive U.S. launch this year. In an interview on CNBC's \"Squawk Box\" on Wednesday, Lilly CEO David Ricks said 20 million to 25 million patients are currently taking both companies' medicines. But he said the total addressable market of patients in the obesity space is \"gigantic.\" watch nowDiverging outlooksOn Wednesday, Lilly forecasted 2026 sales of $80 billion to $83 billion, surpassing the $77.62 billion that analysts were expecting, according to LSEG. The midpoint of that outlook translates to sales growing by 25% this year.In contrast, Novo warned on Tuesday that it sees sales and profit declining by 5% to 13% this year, as prices fall in the U.S. and exclusivity expires for its blockbuster obesity and diabetes drugs in China, Brazil and Canada. Mike Doustdar, left, CEO of Novo Nordisk, and David Ricks, CEO of Eli Lilly, listen as President Donald Trump speaks in the Oval Office during an event about weight-loss drugs on Nov. 6, 2025.Andrew Caballero-Reynolds | Afp | Getty ImagesLilly similarly pointed to a \"global pricing decline in the low- to mid- teens [percentages] this year.\" That comes after the landmark \"most favored nation\" deals both companies struck with President Donald Trump in November to slash obesity and diabetes drug costs, along with their recent efforts to further reduce direct-to-consumer prices for their treatments. The agreements with Trump are expected to take a bite out of both companies' sales, but eventually increase volumes of prescriptions for their drugs. Still, Lilly is bullish about other factors that will help offset that pricing pressure. That includes continued worldwide demand for its obesity drug Zepbound and diabetes counterpart Mounjaro and the expected launch of its GLP-1 pill for obesity in the second quarter, pending U.S. approval. Lilly also pointed to government Medicare coverage of obesity treatments starting for the first time by at least July, one of the winning features of the drug pricing deals with Trump. Lilly's Ricks told CNBC that coverage will open up access to 40 million new Medicare beneficiaries, \"and that could be quite expansive to volume.\"Overall, Risinger called Lilly's guidance \"very encouraging\" and said the \"price per volume trade-off is playing out well\" for the company. He said tirzepatide, the active ingredient in Zepbound and Mounjaro, is \"superior\" in its effectiveness and tolerability compared to semaglutide, the ingredient in Novo's obesity and diabetes drugs. That was proven in a head-to-head clinical trial conducted by Lilly in 2024, and prescription trends show that the company's drugs are preferred among prescribers.  \"I think that's what is driving Lilly's market share gain\" relative to Novo, Risinger said. Another factor that sets Lilly and Novo apart is patent exclusivity. While Novo said expiring patents in some international markets pose a challenge, Lilly's Ricks said tirzepatide should be protected into \"the back half of the 2030s\" in major markets. Risinger noted that Lilly is still working to drive global uptake for tirzepatide, which won U.S. approval for obesity in 2023. All eyes on pillsA pharmacist displays a box of Wegovy pills at a pharmacy in Provo, Utah, Jan. 15, 2026.George Frey | Bloomberg | Getty ImagesNovo Nordisk is first to market with a GLP-1 pill for obesity, and it hit 50,000 weekly prescriptions in just under three weeks of its launch. But investors are watching to see how that shifts once Lilly's pill rolls out to patients later this year. In an interview with CNBC's \"Mad Money,\" Novo CEO Mike Doustdar said he's confident about the company's ability to compete with Lilly. \"Clearly we have the most efficacious weight-reduction pill that there is and I'm very optimistic and bullish on when they come with their pill and we have to battle this out,\" Doustdar said. He's referring to clinical trial data suggesting that Novo's Wegovy pill promotes comparable weight loss to its injectable counterpart, which is around 15%. Meanwhile, Lilly's pill appears to be slightly less effective than that, based on separate study data. Risinger said the launch of Novo's pill has benefited from the fact that the company is leveraging the Wegovy brand name, which is recognizable by many patients, and immediately launched direct-to-consumer advertising for the product in early January. But he said Lilly could capitalize on its pill's convenience advantage. Orforglipron is a small-molecule drug that is absorbed more easily in the body and doesn't require dietary restrictions like Novo Nordisk's pill, which is a peptide medication. Patients are supposed to drink no more than four ounces of water with the Wegovy pill and must wait 30 minutes before eating or drinking anything else each day. Novo contends that those requirements won't hinder uptake, but Risinger said it could help Lilly's pill eventually generate greater sales globally. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eli Lilly's GLP-1 growth is only getting started as Novo Nordisk braces for a decline in 2026",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261536-1770233397984-Side_by_Side_template.jpg?v=1770233491&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T21:05:25.000Z",
      "dateModified": "2026-02-04T21:05:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Qualcomm stock sinks as memory shortage drags on forecast",
    "url": "https://www.cnbc.com/2026/02/04/qualcomm-qcom-q1-2026-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108139039-1746043403032-gettyimages-2183699246-AFP_36MB2FJ.jpeg?v=1746043511&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T23:26:18.000Z",
    "description": "President and CEO of Qualcomm Cristiano Amon delivers a speech at the Web Summit at Parque das Nacoes in Lisbon, on November 12, 2024. Patricia De Mel",
    "body": "President and CEO of Qualcomm Cristiano Amon delivers a speech at the Web Summit at Parque das Nacoes in Lisbon, on November 12, 2024. Patricia De Melo Moreira | AFP | Getty ImagesQualcomm reported fiscal first-quarter earnings on Wednesday that beat expectations, but the company's forecast came up short because of the global memory shortage. Shares of Qualcomm tumbled as much as 10% in extended trading. Here's how the chipmaker did versus LSEG consensus estimates:EPS: $3.50 adjusted vs. $3.41 expectedRevenue: $12.25 billion vs. $12.21 billion expectedIn the current quarter, Qualcomm said it expects adjusted earnings per share between $2.45 and $2.65 on revenue of $10.2 billion to $11 billion. Analysts polled by LSEG were expecting $11.11 billion in sales and earnings of $2.89 per share.Qualcomm executives said in an interview that the shortfall in guidance was directly related to the global memory shortage. Big orders for data center memory are taking production capacity for memory for smartphones and other devices.The company's smartphone customers, who buy their own memory and pair it with Qualcomm's processors and modems, are closely watching their purchases and inventories and adjusting them based on the availability of memory.Qualcomm finance chief Akash Palkhiwala said the guidance gap versus consensus estimates was due to the memory issue. watch now\"We're starting to see that memory is going to define the size of the mobile market,\" Qualcomm CEO Cristiano Amon said in an interview. Amon added that handset demand remains high, and the smartphone market is going through an upgrade cycle, but he said Qualcomm anticipates issues with smartphone supply. He said that the company doesn't know if smartphone makers will raise prices, but Amon said he expects Qualcomm's customers to focus on higher-tier devices, which will be more capable of absorbing memory price increases than budget handsets. Amon said on an earnings call that Qualcomm was most competitive in premium-tier handsets. \"We see this as an industry issue affecting everything in consumer electronics,\" Amon said. Stock Chart IconStock chart iconQualcomm one-day stock chart.During the quarter, Qualcomm reported $7.82 billion in handset sales, a 3% rise on an annual basis. Qualcomm's overall revenue grew 5% during the quarter. Qualcomm's smaller businesses grew more quickly during the quarter.  The company's Internet of Things group, which includes both chips for industrial uses as well as the chip that powers the Meta Ray-Ban smart glasses, increased 9% during the quarter to $1.69 billion in sales. And Qualcomm's growing automotive business, which provides chips for carmakers, including Toyota, rose 15% to $1.1 billion for the division. Qualcomm said that it expected data center sales from its new AI chips and other data center products to start appearing in fiscal 2027.\"Everything is on track,\" Amon said on an earnings call. Net income in the period came in at $3 billion, or $2.78 per share, versus $3.18 billion, or $2.83 per diluted share in the year-ago period. In addition to selling chips, Qualcomm also licenses its intellectual property for technologies such as 5G to other hardware companies. That's reported as QTL revenues, which are significantly more profitable than hardware sales. Qualcomm reported $1.59 billion in QTL revenue during the quarter. Correction: This story has been revised to reflect that Qualcomm's net income for Q1 fiscal 2025 was $3.18 billion. A previous version misstated the company's net income for that period.WATCH: Memory is where the bottleneck is and we like Micron, says FL Putnam's Ellen Hazenwatch nowRead more CNBC tech news'Muskonomy' shakeup: SpaceX valuation approaches Tesla's after merger with xAIPinterest CEO rebukes, fires 'obstructionist' employees who created tool to track layoffsNvidia, OpenAI appear stalled on their mega deal. But the AI giants still need each otherNvidia's Jensen Huang denies OpenAI deal rumors: 'There's no drama'",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Qualcomm stock sinks as memory shortage drags on forecast",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108139039-1746043403032-gettyimages-2183699246-AFP_36MB2FJ.jpeg?v=1746043511&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T23:26:18.000Z",
      "dateModified": "2026-02-04T23:26:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]