[
  {
    "title": "Trump, Saudi Crown Prince bin Salman brush off criticism of Khashoggi killing",
    "url": "https://www.cnbc.com/2025/11/18/trump-saudi-arabia-mohammed-bin-salman-mbs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108227597-1763487621028-gettyimages-2247321300-wm020775_77k7mxlp.jpeg?v=1763487706&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T22:16:16.000Z",
    "description": "President Donald Trump and Saudi Arabia's Crown Prince Mohammed bin Salman, the de facto ruler of his nation, on Tuesday brushed off questions about b",
    "body": "President Donald Trump and Saudi Arabia's Crown Prince Mohammed bin Salman, the de facto ruler of his nation, on Tuesday brushed off questions about bin Salman's involvement in the 2018 killing of the Saudi journalist Jamal Khashoggi in the Saudi consulate in Istanbul.\"Things happen,\" Trump said when asked about Khashoggi's killing by Mary Bruce of ABC News, as he sat next to bin Salman in the Oval Office. Khashoggi, who was a critic of the regime, was also a U.S. resident.Trump called the ABC News reporter \"fake news\" after she asked about Khashoggi, about claims by families of 9/11 victims that Saudi Arabia bankrolled the Sept. 11, 2001, terror attacks, and about the propriety of Trump's business investing in Saudi Arabia.\"You're mentioning somebody that was extremely controversial,\" Trump said of Khashoggi.\"A lot of people didn't like that gentleman that you're talking about, whether you like him or didn't like him, things happen,\" Trump said.Referring to bin Salman, Trump said, \"But he knew nothing about it, and we can leave it at that.\"\"You don't have to embarrass our guests by asking a question,\" Trump said.U.S. President Donald Trump (R) speaks during a bilateral meeting with Crown Prince and Prime Minister Mohammed bin Salman of Saudi Arabia (L) in the Oval Office of the White House on November 18, 2025 in Washington, DC. Win McNamee | Getty ImagesBin Salman has denied ordering Khashoggi's killing.But in February 2021, a month after then-President Joe Biden took office, the United States' director of national intelligence released a report that said bin Salman approved an operation to capture or kill Khashoggi.On Tuesday, bin Salman said, \"You know, I feel painful about, you know, families of 9/11 in America. But, you know, we have to focus on reality.\"\"Reality based in CIA documents, and based on a lot of documents that Osama bin Laden used Saudi people in that event, for one main purpose, is to destroy this [relationship], to destroy the American-Saudi relation,\" bin Salman said.\"It's really painful to hear .... anyone that been losing his life for you know, no real purpose or ... not in a legal way,\" bin Salman said, referring to Khashoggi.\"And it's been painful for us in Saudi Arabia,\" the prince said. \"We did all the right steps of investigation ... in Saudi Arabia, and we've improved our system to be sure that nothing happened like that. And it's painful, and it's a huge mistake, and we are doing our best that this still doesn't happen.\"Khashoggi's widow, in a social media post directed at Trump before the meeting with bin Salman, wrote, \"The murder of my husband has caused me to lose everything. There is unfinished business that remains including: the recovery of my husband's body & my rightful compensation as his widow.\"\"Much like the families in Israel, I would like to recover the remains of my husband so that I may have an appropriate religious burial ceremony,\" Hanan Elatr Khashoggi wrote in the post on X. \"And much like the 9-11 families, I am seeking financial compensation for the murder of my husband.\"Hanan Khashoggi separately told CNN in an interview that \"it is very painful for me\" to see Trump welcome bin Salman to the White House.The prince's visit is his first to the United States since Khashoggi was killed.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump, Saudi Crown Prince bin Salman brush off criticism of Khashoggi killing",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108227597-1763487621028-gettyimages-2247321300-wm020775_77k7mxlp.jpeg?v=1763487706&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T22:16:16.000Z",
      "dateModified": "2025-11-18T22:16:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bitcoin briefly falls below $90,000 to lowest since April",
    "url": "https://www.cnbc.com/2025/11/18/bitcoin-briefly-falls-below-90000-to-lowest-since-april-as-cryptocurrency-gives-up-2025-gain.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108067835-17325694842024-11-25t203255z_1254692498_rc2kcbaf4cwr_rtrmadp_0_fintech-crypto-bitcoin.jpeg?v=1733950537&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T18:37:20.000Z",
    "description": "Representations of cryptocurrency Bitcoin are seen in this illustration taken Nov. 25, 2024.Dado Ruvic | ReutersBitcoin wavered as investors continued",
    "body": "Representations of cryptocurrency Bitcoin are seen in this illustration taken Nov. 25, 2024.Dado Ruvic | ReutersBitcoin wavered as investors continued to shed their speculative technology holdings with the cryptocurrency first among them.Bitcoin was last trading up 1.6% at $93,236.00, but earlier Tuesday touched $89,259, its lowest since April 22. Bitcoin is up 2% over the past year, according to Coin Metrics.The move comes as investors have shed their AI-related tech holdings this month in the stock market. Bitcoin appeared to foreshadow the risk-off move, peaking in early October at a record above $126,000 and sliding ever since.Stock Chart IconStock chart iconBitcoin, YTDThe tech-heavy Nasdaq 100 stock index is off by 4.5% this month, following cryptocurrencies lower. Many large tech investors are also big holders in the cryptocurrency space.Mike O'Rourke, chief market strategist at Jones Trading said the correlation between bitcoin and the tech-stock sell-off this week \"is undeniable.\"\"It is truly the tail wagging the dog when a $1.8 trillion market cap speculative asset is significantly influencing the $32 trillion market capitalization index,\" said O'Rourke. \"It is alarming to see the index — with its highly concentrated exposure to the largest and most influential companies in the world and the U.S. equity market — take cues from bitcoin.\"But while bitcoin's continued sell-off has left some experts concerned, it serves an important purpose — clearing leveraged positions and setting up the token for its next runup, according to Willem Schroé, CEO of bitcoin layer-2 network Botanix Labs.\"Bitcoin's brief falling under $90,000 doesn't change the bigger picture,\" Schroé said. \"Each cycle has these 20% to 30% pullbacks to clear leverage. Historically, those periods have been the foundation for the next major [bull] run.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bitcoin briefly falls below $90,000 to lowest since April",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108067835-17325694842024-11-25t203255z_1254692498_rc2kcbaf4cwr_rtrmadp_0_fintech-crypto-bitcoin.jpeg?v=1733950537&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T18:37:20.000Z",
      "dateModified": "2025-11-18T18:37:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Panera lost diners by cutting portions and staff. It's reversing course to win them back",
    "url": "https://www.cnbc.com/2025/11/18/panera-bread-turnaround-plan.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108177387-1753482309904-gettyimages-2227024701-dsc09126_kyhpuho6.jpeg?v=1753482424&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T15:03:59.000Z",
    "description": "A Panera Bread sign hangs on the exterior of the restaurant on July 25, 2025 in Miami, Florida. Joe Raedle | Getty ImagesWhen Panera Bread began shrin",
    "body": "A Panera Bread sign hangs on the exterior of the restaurant on July 25, 2025 in Miami, Florida. Joe Raedle | Getty ImagesWhen Panera Bread began shrinking its sandwiches and skimping on salads, it started shedding customers.Now, to win them back, the chain plans to reinvest in the business and undo many of those same cost-cutting measures, it said Tuesday.Once the No. 1 fast-casual brand in the U.S., Panera has dipped to No. 3, ceding the top spots to Chipotle Mexican Grill and Panda Express. Last year, its sales fell 5% to $6.1 billion, according to Technomic estimates. For years, the chain's traffic has been shrinking, according to CEO Paul Carbone, who took the reins earlier this year. Controversy after the chain's foray into energy drinks didn't help matters, either.Panera's troubles have coincided with a tough year for fast-casual restaurants. Chipotle, Sweetgreen and Cava have all cut their full-year forecasts as they see younger consumers eating out less frequently.Carbone has a plan to bring back customers. Under the strategy, named \"Panera RISE,\" the company aims to refresh its menu, focus on value, improve its service and build new restaurants. He said the plan has the backing of the franchisees who operate roughly half of its 2,200 U.S. locations, along with the support of JAB Holding, the investment arm of the Reimann family that owns the company.Panera's slide has been poorly timed for JAB. The firm has been plotting an IPO for the chain's parent company, Panera Brands, which also owns Caribou Coffee and Einstein Bros. Bagels.In 2021, four years after taking the chain private, JAB struck a deal with Danny Meyer's special purpose acquisition company for a merger that would take the company public again. But Panera scrapped those plans a year later, citing market conditions. In late 2023, the company confidentially filed for an initial public offering that still hasn't happened.When asked about the status of Panera's IPO plans, Carbone told CNBC that the chain's management team is currently focused on growing traffic and implementing the Panera RISE strategy.Entering the value warsPhase one of Panera's plan is to improve the quality of its food, reversing cost-cutting measures imposed in the face of high inflation, according to Carbone.\"We squeezed food costs. We squeezed labor,\" he said.Some of those changes happened while Carbone was chief financial officer. He now calls himself a \"reformed CFO\" — albeit one who still listens to earnings conference calls.\"It's really about death by a thousand paper cuts, it truly is,\" Carbone said about the chain's downturn.Take Panera's salads, for example. In the summer of 2024, Panera began using a mix of half romaine, half iceberg lettuce to make its salads, saving the chain money compared with when it was using romaine alone. This summer, it reverted back to entirely romaine salads.\"You know what guests told us? No one likes iceberg, and no one gets that and says, 'Oh my God, that white salad, it looks so appetizing,'\" Carbone said.And then there's the cherry tomato. Carbone said Panera is one of the few restaurant chains that doesn't slice the bite-sized tomatoes in half, a decision made to save on labor costs.\"We make the guest chase the cherry tomato around the bowl,\" he said.And when a salad comes with an avocado, customers have to cut the halved fruit themselves, rather than it coming presliced. The chain will start slicing the cherry tomatoes and avocados early next year.Plus, Panera's salads typically have five ingredients, while those of competitors like Sweetgreen feature as many as eight.But it wasn't just salads that were affected by the cost-cutting measures.\"In some instances, we shrunk portions, so guests would walk into our cafe to buy a sandwich that has gone up significantly in price, with lower-quality ingredients, in a smaller size,\" Carbone said.The menu refresh will also include new items. Last month, the chain announced that it is testing new \"fresca\" and \"energy refresher\" drinks.Panera previously offered highly caffeinated energy drinks, but it discontinued the line, which included Charged Lemonade, following two wrongful death lawsuits and related negative publicity. Panera denied wrongdoing and settled the lawsuits earlier this year.When it comes to value, Panera is planning on leaning into a barbell menu strategy, offering customers options on both the low- and high-price end. The approach has worked particularly well for casual-dining chains like Chili's, but Panera doesn't have the same appetizer offerings as a full-service restaurant.\"We haven't cracked the code yet,\" Carbone said. \"We're doing a lot of testing.\"Chains across the restaurant industry have embraced value offerings, from McDonald's Extra Value Meal to Applebee's \"2 for $25\" deal, igniting the so-called value wars. However, restaurants have to balance the desire to attract cash-strapped diners with maintaining their profit margins.To improve the customer experience, Panera is planning to invest more into labor. Like many restaurants, Panera in recent years scheduled fewer workers and relied more on the self-order kiosks it pioneered in the industry. That approach saved money, but customers often walked into a cafe and couldn't find an employee in sight, according to Carbone.Panera will also invest back into its kiosks, which it hasn't significantly upgraded since they first entered its restaurants roughly a decade ago. And its dining rooms will get a facelift, too.If these changes succeed in bringing back lapsed customers, then Panera's restaurants will become more profitable, fueling future restaurant growth. And those new bakery-cafes could look different.\"What does the cafe of the future look like? We're doing a lot of work around that, we're going to test different things,\" Carbone said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Panera lost diners by cutting portions and staff. It's reversing course to win them back",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108177387-1753482309904-gettyimages-2227024701-dsc09126_kyhpuho6.jpeg?v=1753482424&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T15:03:59.000Z",
      "dateModified": "2025-11-18T15:03:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Home Depot cuts earnings outlook as home improvement demand falls short of expectations",
    "url": "https://www.cnbc.com/2025/11/18/home-depot-hd-q3-2025-earnings-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225050-1762982099805-gettyimages-2234977071-250906_retail_116.jpeg?v=1762982178&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T21:16:09.000Z",
    "description": "The Home Depot logo is displayed on a sign outside of a store on Sept. 6, 2025 in San Diego, California.  Kevin Carter | Getty ImagesHome Depot on Tue",
    "body": "The Home Depot logo is displayed on a sign outside of a store on Sept. 6, 2025 in San Diego, California.  Kevin Carter | Getty ImagesHome Depot on Tuesday cut its full-year profit forecast and missed Wall Street's earnings expectations for the third straight quarter as it saw weaker home improvement demand, tepid consumer spending and lower-than-usual storm activity.The retailer said it now expects full-year sales will climb about 3% and comparable sales, which take out the impact of one-time factors like store openings and calendar differences, to be slightly positive. That compares with its previous expectations for full-year sales to grow by 2.8% and comparable sales to increase by 1%.The revised outlook includes an estimated $2 billion in incremental revenue from GMS, a building products distributor that Home Depot acquired earlier this year. The company's sales were not part of its previous full-year guidance.Home Depot expects full-year adjusted earnings per share to decline by about 5% from the year-ago period, compared with its prior expectations that they would fall by about 2%In a CNBC interview, Chief Financial Officer Richard McPhail said the retailer previously expected home improvement activity would increase. It also anticipated higher sales of roofing materials, generators and other supplies that typically sell before and after seasonal storms.Neither dynamic materialized, he said, putting pressure on the business. \"When we set guidance, we had anticipated that demand would begin to accelerate gradually in the back half of the year as interest rates and mortgage rates eased,\" he said. \"But what we saw was that ongoing consumer uncertainty and continued pressure in housing are disproportionately impacting home improvement demand.\"Here's what Home Depot reported for the fiscal third quarter compared with Wall Street's estimates, according to a survey of analysts by LSEG:Earnings per share: $3.74 adjusted vs. $3.84 expectedRevenue: $41.35 billion vs. $41.10 billion expectedHome Depot's shares closed at $336.48 on Tuesday, down 6%. As of Tuesday's close, the company's stock is down about 13% so far this year. That trails the S&P 500's nearly 13% gains during the same period.Fewer hurricanes and a 'deferral mindset'For Home Depot, housing turnover typically sparks larger and more lucrative projects as customers fix up their homes before or after moving. Those big projects, however, have dropped in frequency as higher interest rates have led to steeper mortgage rates and borrowing costs for loans, which a homeowner may use to pay for a kitchen remodel or major addition.Since roughly the middle of 2023, McPhail has told CNBC that homeowners have been in a \"deferral mindset.\" That's led to a bit of a waiting game for Home Depot, as it holds out for either lower mortgage rates or a shift by consumers who get used to higher mortgage rates as the new normal.In the most recent three-month period, that waiting game continued. McPhail told CNBC that demand was \"stable\" from the fiscal second quarter to the third quarter when adjusting for the lack of hurricanes. But, he added, \"at this point, it's hard to identify near-term catalysts that would lead to acceleration.\" Home Depot's net income for the three-month period that ended Nov. 2 dropped to $3.60 billion, or $3.62 per share, from $3.65 billion, or $3.67 per share, in the year-ago quarter. Revenue decreased from $40.22 billion in the year-ago quarter.Adjusting for one-time items, including the value of intangible assets, Home Depot reported earnings of $3.74 per share.Comparable sales rose 0.2% in the quarter, falling short of analysts' expectations of 1.4% growth, according to StreetAccount.Sales trends compared to the prior year slowed as the quarter progressed. Comparable sales were up 2% in August, up 0.5% in September and down 1.5% year-over-year in October, Billy Bastek, executive vice president of merchandising said on the company's earnings call.CEO Ted Decker said on an earnings call that the primary driver of that deceleration was the lack of storm activity — particularly when lapping a year-ago period with a lot of hurricanes. He said that pressure will continue into the fourth quarter.Compared with other big-box retailers, Home Depot's customers tend to be more financially stable. About 90% of its do-it-yourself customers own their homes and the home professionals who shop at the retailer tend to get hired by homeowners.Even so, McPhail told CNBC Home Depot gave a weaker outlook in part because shoppers across income groups are reluctant to take on high-dollar projects. He said a slower housing market and the higher cost of borrowing has contributed to the trend.He said other factors may also be having a chilling effect, including the prolonged government shutdown, an uptick in corporate layoff announcements and a decline in home values in some markets.However, Bastek said on the company's earnings call that Home Depot has not seen customers trading down to cheaper products. Instead, he said, they are often opting for more innovative and premium appliances, power tools or other items, which tend to cost more.Big-ticket transactions, which the company defines as costing $1,000 or more, rose 2.3% year over year. Still, Bastek added the company continues to see \"softer engagement in larger discretionary projects where customers typically use financing to fund renovation projects.\"Average ticket, the typical amount spent by customers at the store or on the company's website, rose 1.8% year over year in the quarter. However, customer transactions fell 1.6% year over year.A bright spot in the quarter was online sales, which rose by 11% year over year, McPhail said.Looking to pros for growthAs do-it-yourself customers postpone bigger projects, the company has tried to attract more business from contractors, roofers and other professionals.The company has made two key purchases of pro-related companies. Last year, it bought Texas-based SRS Distribution for $18.25 billion — the largest acquisition in its history. The company sells supplies to professionals in the landscaping, pool and roofing businesses. Home Depot acquired GMS earlier this year.Like other retailers, Home Depot has felt the pinch of higher costs on some imported items because of tariffs. McPhail said in May that the company was diversifying the countries where it sourced its goods and intended to \"generally maintain our current pricing levels across our portfolio.\"However, company leaders warned in August that it may have to hike prices in some categories because of higher tariffs.McPhail told CNBC that Home Depot has increased some items' prices, but said \"where there were price actions, they were modest.\" He said Home Depot has kept prices the same for some key items or even been able to reduce them. For example, he said, its bestselling 7½-foot Grand Duchess Christmas tree and many of its strings of lights for trees have dropped in price. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Home Depot cuts earnings outlook as home improvement demand falls short of expectations",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225050-1762982099805-gettyimages-2234977071-250906_retail_116.jpeg?v=1762982178&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T21:16:09.000Z",
      "dateModified": "2025-11-18T21:16:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump calls for ABC's license to be revoked after reporter asks about Jeffrey Epstein files",
    "url": "https://www.cnbc.com/2025/11/18/trump-epstein-files-abc-license.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108227720-1763495859237-gettyimages-2246770067-TRUMP_MBS.jpeg?v=1763495890&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T22:13:07.000Z",
    "description": "US President Donald Trump, during a meeting with Mohammed bin Salman, Saudi Arabia's crown prince, not pictured, in the Oval Office of the White House",
    "body": "US President Donald Trump, during a meeting with Mohammed bin Salman, Saudi Arabia's crown prince, not pictured, in the Oval Office of the White House in Washington, DC, US, on Tuesday, Nov. 18, 2025. Nathan Howard | Bloomberg | Getty ImagesPresident Donald Trump on Tuesday called for ABC's broadcast license to be revoked as he angrily lashed out at a reporter from the network who asked why he has not released files on notorious sex offender Jeffrey Epstein, his former friend.\"I think you are a terrible reporter,\" Trump told ABC News White House correspondent Mary Bruce.The president said he did not like Bruce's \"attitude.\"\"You ought to go back and learn how to be a reporter. No more questions from you,\" Trump said in the Oval Office, where he was meeting with Crown Prince Mohammed bin Salman of Saudi Arabia.Trump's tirade came shortly before the House of Representatives voted overwhelmingly in favor of a bill to compel the Department of Justice to release all of its records on Epstein.The DOJ earlier this year refused to release those documents, despite prior promises by Attorney General Pam Bondi and other Trump administration officials.Trump does not need to wait for Congress to pass a bill. He could order the DOJ to release more Epstein files.\"Why wait for Congress to release the Epstein files?\" Bruce asked the president. \"Why not just do it now?\"Trump said, \"As far as the Epstein files ... I have nothing to do with\" him.Read more about the Epstein filesHouse overwhelmingly passes bill to release Jeffrey Epstein filesTrump calls to revoke ABC's license over reporter's Epstein files questionJeffrey Epstein files: Larry Summers steps back from public commitments over email falloutJeffrey Epstein victims' ad calls for files to be released, Trump urges GOP to vote for House measureTrump reverses stance on Epstein records, presses Republicans to support releaseJeffrey Epstein on Trump: 'I know how dirty donald is'Trump to ask DOJ to probe Jeffrey Epstein involvement with Clinton, JPMorgan, SummersGoldman Sachs stands by top lawyer Kathy Ruemmler after her emails with Jeffrey Epstein exposedJeffrey Epstein files: House speaker announces vote next week on release of docs\"I threw him out of my club many years ago because I thought he was a sick pervert,\" Trump said, referring to his Mar-a-Lago Club in Palm Beach, Florida.\"People are wise to your hoax,\" the president told the reporter. \"Your crappy company is one of the perpetrators.\"\"And I'll tell you something,\" Trump said. \"I think the license should be taken away from ABC. Because your news is so fake and so wrong.\"\"We have a great commissioner ... who should look at that,\" he added, apparently referring to Federal Communications Commission Chair Brendan Carr, whose agency oversees broadcast licenses.In September, Carr threatened ABC's license over comments by late-night show Jimmy Kimmel about the assassination of conservative activist Charlie Kirk.\"We can do this the easy way or the hard way,\" said Carr on a podcast at the time. \"These companies can find ways to change conduct, to take action, frankly, on Kimmel, or you know, there's going to be additional work for the FCC ahead.\"Hours after Carr's remarks, ABC suspended \"Jimmy Kimmel Live!\"The show returned to air about a week later after backlash against ABC and its parent company, Disney.Trump has repeatedly called the Epstein matter a \"hoax\" created by Democrats, even though members of Trump's Make America Great Again movement were leading advocates for releasing the files.And Trump failed to dissuade Republican allies in Congress from supporting the bill to release the files.On Sunday night, as the Epstein bill's chances of passage appeared to rise, Trump suddenly reversed course and urged his GOP allies to support the measure.On Monday, Trump said he would sign the bill if Congress passes it.Trump and Epstein had been longtime friends but had a falling out years before Epstein killed himself in jail in August 2019 after being arrested on federal child sex trafficking charges.Last week, the House Oversight Committee released emails showing Epstein discussing Trump.In one email from 2019, Epstein wrote that Trump \"knew about the girls.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump calls for ABC's license to be revoked after reporter asks about Jeffrey Epstein files",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108227720-1763495859237-gettyimages-2246770067-TRUMP_MBS.jpeg?v=1763495890&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T22:13:07.000Z",
      "dateModified": "2025-11-18T22:13:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cloudflare says outage that hit X, ChatGPT and other sites is resolved",
    "url": "https://www.cnbc.com/2025/11/18/cloudflare-down-outage-traffic-spike-x-chatgpt.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108227419-1763475252912-gettyimages-2247287964-300534final.jpeg?v=1763475263&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T16:22:29.000Z",
    "description": "Person's handing hold an iPhone displaying a Cloudflare Error while attempting to access a webpage, during an outage of the Cloudflare service, Lafaye",
    "body": "Person's handing hold an iPhone displaying a Cloudflare Error while attempting to access a webpage, during an outage of the Cloudflare service, Lafayette, California, November 18, 2025. Smith Collection/gado | Archive Photos | Getty ImagesInternet infrastructure company Cloudflare was hit by an outage on Tuesday, knocking several major websites offline for global users.Many sites came back online within a few hours. In an update to its status page around 9:57 a.m. ET, Cloudflare said it had implemented a fix to resolve the outage, though it noted some users may still experience issues accessing its online dashboard.\"We are continuing to monitor for errors to ensure all services are back to normal,\" the company added.E-commerce platform Shopify, job search engine Indeed, Anthropic's Claude chatbot, President Donald Trump's Truth Social and Elon Musk's social media platform X were among the sites impacted by the Cloudflare issues, according to Downdetector, which itself could not be accessed briefly for some users. Some of NJ Transit's digital services were brought down by the outage.OpenAI's status page indicated ChatGPT and its Sora short-form video app had fully recovered after they experienced issues due to a \"third-party service provider.\"A Cloudflare spokesperson said the \"root cause\" of the outage was an automatically generated configuration file used to manage threat traffic that \"grew beyond an expected size of entries,\" which triggered a crash in the software system that handles traffic for several of its services.The company said it began to observe a \"spike in unusual traffic\" around 5:20 a.m. ET.There's no evidence that the outage was a result of an attack or caused by malicious activity, the spokesperson added.\"Given the importance of Cloudflare's services, any outage is unacceptable,\" the spokesperson said. \"We apologize to our customers and the internet in general for letting you down today.\"Cloudflare's software is used by many businesses worldwide, helping to manage and secure traffic for about 20% of the web. Among the services it provides are that it guards against distributed denial of service attacks, which are when malicious actors attempt to overload a website's system with so many traffic requests that it can't function.Shares of Cloudflare slid more than 2%.The issue comes less than a month after Amazon Web Services suffered a daylong disruption that took down numerous online services, followed by a global outage of Microsoft's Azure cloud and 365 services.In July 2024, a faulty software upgrade by cybersecurity firm CrowdStrike caused a widespread outage that temporarily halted flights, impacted financial services and pushed hospitals to delay procedures.Read more CNBC tech newsSenators push for probe into Trump-linked crypto firm over token sales tied to North Korea and RussiaArm custom chips get a boost with Nvidia partnershipBuffett's Google bet comes 2 decades after billionaire investor 'inspired' search giant's IPONvidia CEO Jensen Huang surprised investors with a 'half a trillion' forecast. It'll come up at earnings",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cloudflare says outage that hit X, ChatGPT and other sites is resolved",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108227419-1763475252912-gettyimages-2247287964-300534final.jpeg?v=1763475263&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T16:22:29.000Z",
      "dateModified": "2025-11-18T16:22:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo says it will launch in more Texas and Florida cities in 2026",
    "url": "https://www.cnbc.com/2025/11/18/waymo-texas-florida-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107388040-1710503249580-gettyimages-2085256529-mt2_3894_qwq22ibr.jpeg?v=1763484111&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T17:38:21.000Z",
    "description": "A Waymo autonomous self-driving Jaguar taxi drives along a street on March 14, 2024 in Los Angeles, California.Mario Tama | Getty ImagesWaymo on Tuesd",
    "body": "A Waymo autonomous self-driving Jaguar taxi drives along a street on March 14, 2024 in Los Angeles, California.Mario Tama | Getty ImagesWaymo on Tuesday said it will bring its robotaxi service to new cities in Texas and Florida in 2026.The Alphabet-owned company said it plans to start operating its vehicles with no human driver assistants in Dallas, Houston, San Antonio, Miami and Orlando in the coming weeks before opening service in those markets to the public next year, the company said in a blog.\"Waymo has entered a new phase of commercial scale, doubling the number of cities we operate without a human specialist in the car,\" Waymo Chief Product Officer Saswat Panigrahi said in an emailed statement Tuesday.Waymo had previously announced plans to launch its robotaxi service in Dallas and Miami in 2026, but Tuesday was the first time the company said it planned to launch service next year in the other cities. Waymo will first offer fully autonomous trips to its employees in those markets, a spokesperson said.The company has been gearing up to expand its paid robotaxis service in 2026. The company previously announced plans to expand to Detroit, Las Vegas, Nashville, San Diego, Washington, D.C., and London in 2026.Waymo has also begun testing vehicles in New York City and Tokyo.Last week, Waymo began offering freeway routes in the San Francisco, Phoenix and Los Angeles markets. The Google sister company will gradually extend freeway trips to more riders and locations over time.Already, Waymo operates its paid robotaxi service in Austin, San Francisco, Phoenix, Atlanta and Los Angeles. The company has provided more than 10 million paid rides since first launching in 2020, the company said in May.Waymo's Florida and Texas expansion announcement comes the same day that Amazon-owned Zoox began allowing select San Francisco users to hail its driverless vehicles. San Francisco is the second market where Zoox now offers a free service, after its launch in Las Vegas in September. Zoox has deployed a fleet of 50 robotaxis between San Francisco and Las Vegas, the company told CNBC in September.WATCH: Waymo launches paid robotaxi rides on freewayswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo says it will launch in more Texas and Florida cities in 2026",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107388040-1710503249580-gettyimages-2085256529-mt2_3894_qwq22ibr.jpeg?v=1763484111&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T17:38:21.000Z",
      "dateModified": "2025-11-18T17:38:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zoox begins offering robotaxi rides in San Francisco, facing off with Waymo",
    "url": "https://www.cnbc.com/2025/11/18/zoox-begins-offering-robotaxi-rides-in-san-francisco-t.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108141715-1746551475048-gettyimages-2187651318-ZOOX_ROBOTAXI.jpeg?v=1763064148&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T14:00:01.000Z",
    "description": "A Zoox autonomous robotaxi in San Francisco, California, US, on Wednesday, Dec. 4, 2024. David Paul Morris | Bloomberg | Getty ImagesZoox on Tuesday b",
    "body": "A Zoox autonomous robotaxi in San Francisco, California, US, on Wednesday, Dec. 4, 2024. David Paul Morris | Bloomberg | Getty ImagesZoox on Tuesday began allowing select San Francisco users to hail its driverless vehicles, pitting the Amazon-owned robotaxi service against Alphabet's Waymo in the same market for the first time.Riders can sign up to join the \"Zoox Explorers\" program to take free rides in the company's box-shaped vehicles in certain San Francisco neighborhoods, including SoMa and the Mission and Design districts, the company said.Zoox will take users off the waitlist depending on their location and as it adds more robotaxis to its fleet. The company hopes to remove the waitlist entirely in 2026, Zoox spokesperson Marisa Wiggam said.Founded in 2014 and acquired by Amazon for $1.3 billion in 2020, Zoox is building a robotaxi business that aims to compete with Waymo. But unlike others in the robotaxi space, Zoox's vehicle has no steering wheel, with the company opting to design its robotaxis from the ground up.Zoox notched a major milestone in September when it opened up its robotaxi service to the public for the first time in Las Vegas. The company is offering free rides on and around the Las Vegas Strip while it waits to get regulatory approval for a paid service.The company has been testing its autonomous vehicle technology in San Francisco since 2017 via retrofitted Toyota Highlander SUVs. The company began to deploy its toaster-shaped driverless shuttles on San Francisco streets last year, before allowing friends and family of Zoox employees to hail its robotaxis in parts of the city.Zoox has deployed a fleet of 50 robotaxis between San Francisco and Las Vegas, the company told CNBC in September.Waymo opened up its service to all San Francisco riders in June 2024. Since launching its service in Phoenix in 2020, Waymo has provided more than 10 million paid rides, the company said in May.  Last week, the Google sister company announced that it would begin offering freeway rides in the San Francisco, Los Angeles and Phoenix markets. Waymo also said it was expanding its service to include San Jose and the San Jose Mineta International Airport.As Zoox builds out its service, the Amazon company has deployed its test fleet in Seattle, Austin, Los Angeles, Atlanta and Washington, D.C.WATCH: Amazon's Zoox jumps into U.S. robotaxi race with Las Vegas launchwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zoox begins offering robotaxi rides in San Francisco, facing off with Waymo",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108141715-1746551475048-gettyimages-2187651318-ZOOX_ROBOTAXI.jpeg?v=1763064148&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T14:00:01.000Z",
      "dateModified": "2025-11-18T14:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix is finally leaning into a key piece of the media playbook: Merchandising",
    "url": "https://www.cnbc.com/2025/11/18/netflix-merchandising-toys-events-marketing.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108227030-1763409735043-gettyimages-2245587941-20090101251111-99-600669.jpeg?v=1763501266&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T17:50:21.000Z",
    "description": "People linger in the restaurant of the Netflix House experience center. Andrej Sokolow | Picture Alliance | Getty ImagesNetflix was the early leader i",
    "body": "People linger in the restaurant of the Netflix House experience center. Andrej Sokolow | Picture Alliance | Getty ImagesNetflix was the early leader in streaming. It's been later to another crucial piece of the media playbook — merchandising and live events.The streamer has only recently begun adopting tried-and-true marketing methods that have been in play for the likes of the Walt Disney Co., Universal and Warner Bros. Discovery for decades: namely, consumer product partnerships, special release events and venue destinations that drive fan engagement.In January, the company struck its first master licensing deal with Jazwares, the maker of Squishmallows, to develop a product line for \"Stranger Things,\" including figures, play sets, toy vehicles, costumes and stuffed toys. Jazwares has existing partnerships with brands like Pokemon, Star Wars, Peppa Pig and Hello Kitty.More recently, Netflix signed a landmark licensing deal with toy giants Hasbro and Mattel to develop toys and consumer products based off the smash hit \"KPop Demon Hunters.\"And this month, the company opened Netflix House Philadelphia, a venue in King of Prussia, Pennsylvania, that features immersive experiences, interactive games, live performances and themed dining. A Dallas location of the concept is set to open in December, and another is expected in Las Vegas in 2027.The entrance to the Netflix House experience center. Andrej Sokolow | Picture Alliance | Getty ImagesThe launches play off Netflix's robust slate of titles across television and film, which also includes \"Bridgerton,\" \"Squid Game\" and \"Wednesday.\"\"You need that foundation of IP to really build off to have that consumer product strategy,\" Marian Lee, Netflix's chief marketing officer, told CNBC. \"It's the beauty of working at a place like Netflix, because we are constantly pivoting and looking at new opportunities.\"Netflix is a relative newcomer in Hollywood. Only in the last decade has it been building out its library of original and proprietary content.The streamer's first original series release was 2012's \"Lilyhammer,\" a Norwegian crime show about the misadventures of a mafia underboss living in the witness protection program. Its original programming really took off with 2013's \"House of Cards,\" a political thriller about a ruthless congressman bent on revenge after being passed over for secretary of State — the first series produced exclusively for the streaming service.\"They're still a young company in the grand scheme of things,\" said Alicia Reese, an analyst at Wedbush. \"They had to build out their content first and fandom had to occur organically.\"That's one of the reasons why the company didn't launch a consumer products division until 2019 or an officially licensed online shop until 2021.Before that, the streaming giant had been working with consumer brands to create T-shirts, mugs, plush toys and the like. It was predominantly working with licensees, collecting fees for other companies to design and make the products, or participating in brand partnerships where no fees were exchanged.At the time, those strategies helped Netflix reap the benefit of more exposure. Now, Netflix is taking the reins.\"This is a great turning point for [Netflix] ... the pivot into merchandising efforts,\" Reese said. \"But, also, I wouldn't limit it to merchandising efforts. There is also games and gaming.\"In addition to deals with Epic Games' Fortnite, in which players can purchase cosmetic items from \"Stranger Things,\" \"Squid Game,\" \"Wednesday\" and \"KPop Demon Hunters,\" Netflix also has a collection of mobile games based on its original content.There's also Netflix's growing live entertainment business.Since 2020, the company has launched more than 40 experiences in 300 cities. This includes \"Bridgerton\" events like The Queen's Ball, which took place in nearly a dozen cities globally in 2022 and 2023 and invited guests to dress in their Regency-era finest for a themed party, as well as a concert series through Candlelight featuring music from the show.Shonda Rhimes, Golda Rosheuvel and cast members visit The Queen’s Ball: A Bridgerton Experience in New York on April 30, 2023.Ilya S. Savenok | Getty Images Entertainment | Getty ImagesThere was also an immersive experience centered on \"Stranger Things\" that allowed fans to explore Hawkins Lab and other iconic locations from the series in more than a dozen cities. It's currently running in Abu Dhabi, United Arab Emirates, and will open in Mexico City next month. And, a play called \"Stranger Things: The First Shadow\" has been running in the West End in London since 2023.Netflix's merchandise and live events strategy is not just a way for the company to generate additional revenue outside of its streaming subscriptions. It helps keep fans engaged with its content during show hiatuses and in between movie sequels.\"KPop Demon Hunters,\" for example, isn't expected to have a follow-up film until 2029.\"You know, 2029 that's a long wait,\" Reese said. \"But, having the merchandise, having pop-up shops or live events or some sort of fan engagement in the interim will definitely help to keep that engagement alive until they have the next content release.\"The strategy has been part of Disney's playbook for decades. The company has used its IP as an anchor in its theme parks, cruise lines and resort locations as well as in the retail space to give fans more points of connection for the stories they love and keep them engaged with the brand in between film and television releases.Netflix is now adopting this method and has been deliberate in what kinds of products and experiences it delivers to fans as it dives further into the segment.\"Bridgerton\" merchandise includes tea sets, elegant pajamas, candles, beauty supplies and even curated dog accessories, all with a delicate, pastel color palate. The \"Stranger Things\" product line includes items like specialty Eggo waffles, Dungeons & Dragons sets, '80s-themed fashion items and a bolder, darker color scheme.\"We think about it both as an extension of the fandom, but also as an extension of the storytelling,\" Netflix's Lee said of the company's merchandising strategy. \"A sticker book for 'KPop Demon Hunters' is not going to be a revenue driver for us, but if you're a kid that loves that ... a sticker book might be the perfect thing you pick up, that sort of low-dollar commitment. So, for us, across every IP and across every category, we are balancing a commercial opportunity that we think will drive revenue and also things that bring fans joy.\"Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast's planned spinoff of Versant.Correction: Netflix House Philadelphia is in King of Prussia, Pennsylvania. An earlier version misstated the location.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix is finally leaning into a key piece of the media playbook: Merchandising",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108227030-1763409735043-gettyimages-2245587941-20090101251111-99-600669.jpeg?v=1763501266&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T17:50:21.000Z",
      "dateModified": "2025-11-18T17:50:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Asia-Pacific markets track Wall Street declines as tech-led sell-off deepens",
    "url": "https://www.cnbc.com/2025/11/19/asia-pacific-markets-ai-nikkei-225-hang-seng-index-csi-300.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107217546-1680163021421-gettyimages-1396661609-ec1011553.jpeg?v=1763507905&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-19T00:31:58.000Z",
    "description": "Eschcollection | Digitalvision | Getty ImagesAsia-Pacific markets mostly fell Wednesday, tracking Wall Street declines as concerns about artificial in",
    "body": "Eschcollection | Digitalvision | Getty ImagesAsia-Pacific markets mostly fell Wednesday, tracking Wall Street declines as concerns about artificial intelligence valuations continued to pressure tech stocks.Japan's benchmark Nikkei 225 index fell 0.36% at the open, while the Topix index lost 0.26%. Technology sector dragged the Nikkei 225 index lower in early trading, led by semiconductor testing equipment maker Advantest which fell more than 4%. Semiconductor firm Renesas also lost nearly 5%.South Korea's Kospi index declined 0.67%, and the small-cap Kosdaq retreated 1.02%. Index heavyweights Samsung Electronics and SK Hynix fell 2.25% and 2.46%, respectively. Australia's ASX/S&P 200 added 0.11%.Futures for Hong Kong's Hang Seng Index also pointed to a higher open, trading at 26,033, against the index's previous close of 25,930.03.U.S. equity futures were little changed in early Asian hours after the key indexes fell Tuesday stateside.Overnight, the Dow Jones Industrial Average shed 498.50 points, or 1.07%, to settle at 46,091.74. The S&P 500 lost 0.83% to end the day at 6,617.32. It was the broad-based index's fourth straight losing session, making for its longest slide since August. The Nasdaq Composite declined 1.21% to finish at 22,432.85. The session saw the Dow Jones Industrial Average also drop for a fourth consecutive day, while the tech-heavy Nasdaq Composite recorded its fifth negative day in six sessions. Bitcoin dropped briefly below $90,000, a sign of reduced risk-taking by investors.— CNBC's Sean Conlon and Pia Singh contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Asia-Pacific markets track Wall Street declines as tech-led sell-off deepens",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107217546-1680163021421-gettyimages-1396661609-ec1011553.jpeg?v=1763507905&w=1920&h=1080"
      ],
      "datePublished": "2025-11-19T00:31:58.000Z",
      "dateModified": "2025-11-19T00:31:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration backs Three Mile Island nuclear restart with $1 billion loan to Constellation",
    "url": "https://www.cnbc.com/2025/11/18/trump-nuclear-three-mile-island-crane-loan-constellation-ceg.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108056633-1730555493636-IMG_5247.jpg?v=1731953116&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T21:36:45.000Z",
    "description": "The cooling towers of the Three Mile Island nuclear power plant in Middletown, Pennsylvania, Oct. 30, 2024.Danielle DeVries | CNBCThe Trump administra",
    "body": "The cooling towers of the Three Mile Island nuclear power plant in Middletown, Pennsylvania, Oct. 30, 2024.Danielle DeVries | CNBCThe Trump administration will provide Constellation Energy with a $1 billion loan to restart the Crane Clean Energy Center nuclear plant in Pennsylvania, Department of Energy officials said Tuesday.Previously known as Three Mile Island Unit 1, the plant is expected to start generating power again in 2027. Constellation unveiled plans to rename and restart the reactor in Sept. 2024 through a power purchase agreement with Microsoft to support the tech company's data center demand in the region.Three Mile Island Unit 1 ceased operations in 2019, one of a dozen reactors that closed in recent years as nuclear struggled to compete against cheap natural gas. It sits on the same site as Three Mile Island Unit 2, the reactor that partially melted down in 1979 in the worst nuclear accident in U.S. history.The loan would cover the majority to the project's estimated cost of $1.6 billion. The first advance to Constellation is expected in the first quarter of 2026, said Greg Beard, senior advisor to the Energy Department's Loan Programs Office, in a call with reporters. The loan comes with a guarantee from Constellation that it will protect taxpayer money, Beard said.Constellation's stock was up more than 2% in after hours trading on Tuesday. The control panel in the main control room of the Three Mile Island Nuclear power plant is seen on Oct. 30, 2024 in Middletown, Pennsylvania, U.S.Danielle DeVries | CNBCCEO Joe Dominguez hinted at federal financial support previously, telling investors in Sept. 2024 that Constellation would \"take a look as we finance the project at loan guarantees and other things that will be available.\" Constellation is the largest operator of nuclear plants in the U.S.When asked why Constellation was receiving the loan now, Beard said Tuesday that Constellation could have completed the project without help from the Energy Department. But the loan will help make electricity cheaper for consumers on the grid operated by PJM Interconnection, which serves more than 65 million people across 13 states, Beard said.\"What's important for the administration is to show support for affordable, reliable, secure energy in the U.S.,\" Beard told reporters. \"This loan to Constellation will lower the cost of capital and make power cheaper for those PJM ratepayers.\"Electricity pricesEnergy Secretary Chris Wright said last week that his department's loan office would use most of its money to support the nuclear industry. President Donald Trump signed four executive orders in May that aim to significantly expand new nuclear capacity.Consumers in many states in the PJM region are facing significant electricity price increases as the rapid increase in demand from artificial intelligence data centers outstrips available supply.\"We want to bring as much net addition of dispatchable, reliable electricity onto the grid to stop these price rises in electricity,\" Wright told reporters on Tuesday.The turbine deck of the Three Mile Island Nuclear power plant is seen  on Oct. 30, 2024 in Middletown, Pennsylvania, U.S.Danielle DeVries | CNBCThe Crane Clean Energy Center is one of three shuttered nuclear plants in the U.S. that are aiming to start generating power again this decade subject to approval by the Nuclear Regulatory Commission. Crane had the capacity to power more than 800,000 homes when it closed in 2019, according to Constellation.The Energy Department is supporting the restart of the Palisades nuclear plant in Michigan with a $1.5 billion loan to Holtec International. NextEra Energy announced in October plans to restart the Duane Arnold nuclear plant in Iowa through an agreement Alphabet's Google Unit.When asked whether NextEra will receive a loan for Duane Arnold, Beard told CNBC that Trump's executive orders direct the Energy Department to \"prioritize the restart of nuclear reactors.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration backs Three Mile Island nuclear restart with $1 billion loan to Constellation",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108056633-1730555493636-IMG_5247.jpg?v=1731953116&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T21:36:45.000Z",
      "dateModified": "2025-11-18T21:36:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK government to ban above-face value ticket reselling",
    "url": "https://www.cnbc.com/2025/11/18/uk-government-ticket-resale-ban.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108227753-1763499037394-gettyimages-2245298579-r54a1691.jpeg?v=1763499186&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T22:20:53.000Z",
    "description": "Dua Lipa performs during a concert as part of the \"Radical Optimism Tour\" at Estadio Mas Monumental Antonio Vespucio Liberti on Nov. 8, 2025 in Buenos",
    "body": "Dua Lipa performs during a concert as part of the \"Radical Optimism Tour\" at Estadio Mas Monumental Antonio Vespucio Liberti on Nov. 8, 2025 in Buenos Aires, Argentina.Tomas Cuesta | Getty ImagesThe U.K. government is set to ban the resale of live-event tickets for above face value on Wednesday. The move covers concerts, major sports, and theater, according to multiple British press reports.The move was not a surprise, as the country's Labor Party under Prime Minister Keir Starmer had signaled earlier support for a crackdown on ticket practices, citing the issue of inflated resale prices as a significant consumer protection issue.Dozens of artists including Sam Fender, Dua Lipa and Coldplay signed a recent open letter urging Starmer to move ahead with promises and implement a cap on resale price tickets.Housing Secretary Steve Reed told BBC Breakfast that the government, \"was committed to outlawing it.\"New legislation is expected to include caps on platform fees and price limits to avoid any workarounds that artificially inflate prices using new methods. A U.K. government inquiry begun early in 2025 had been considering a cap on the price of ticket resales in a range from the original price up to as much as a 30% markup, but is now expected to pursue the stricter course of action.The U.K. government's Department for Culture, Media and Sport estimates the move could reduce the average resale ticket price by as much as $48, according to the reports.Ticket reseller StubHub shares closed down near 6% on Tuesday after reports of the impending ban. Its shares have fallen 37% over the past week after it failed to provide guidance when it reported earnings last week.Shares of Live Nation Entertainment, which owns Ticketmaster, were lower on Tuesday but closed in line with the broader market decline. Live Nation released a statement ahead of the expected U.K. ban saying it \"fully supports the UK government's plan\" and noted it already limits all resale in the U.K. to face value prices. \"This is another major step forward for fans – cracking down on exploitative touting to help keep live events accessible. We encourage others around the world to adopt similar fan-first policies.\"The move comes as U.S. regulators have scrutinized bot-based ticket harvesting, and several investigations have focused on deceptive fee structures and inflated resale pricing. For Taylor Swift's \"Eras Tour,\" the average resale ticket was over $1,000.Swift producer and fellow musician Jack Antonoff recently slammed Live Nation CEO Michael Rapino for saying at a CNBC event that concert tickets were underpriced.\"Answer is simple: Selling a ticket for more than its face value should be illegal,\" he wrote.The Federal Trade Commission sued Live Nation and Ticketmaster in September, alleging illegal ticket resale practices. Last year, the Justice Department sued to break up Live Nation and Ticketmaster over alleged antitrust violations, claiming the company had too large a monopoly in the ticketing industry, a move that came after widespread fan complaints after a botched rollout for tickets to Swift's Eras Tour. Pressure has increased for more transparent ticket markets across live music, sports, and large-scale touring.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK government to ban above-face value ticket reselling",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108227753-1763499037394-gettyimages-2245298579-r54a1691.jpeg?v=1763499186&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T22:20:53.000Z",
      "dateModified": "2025-11-18T22:20:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Congress approves Jeffrey Epstein files bill, sending it to Trump to sign",
    "url": "https://www.cnbc.com/2025/11/18/epstein-files-trump-house-vote.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108226911-1763399652306-gettyimages-2245810424-epstein_sign_045_111225.jpeg?v=1763399669&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T23:57:23.000Z",
    "description": "Epstein abuse survivor Lisa Phillips speaks during a news conference with lawmakers on the Epstein Files Transparency Act outside the U.S. Capitol on ",
    "body": "Epstein abuse survivor Lisa Phillips speaks during a news conference with lawmakers on the Epstein Files Transparency Act outside the U.S. Capitol on November 18, 2025 in Washington, DC. Heather Diehl | Getty ImagesThe Senate on Tuesday evening agreed to pass a bipartisan bill ordering the Department of Justice to release all of its files on notorious sex offender Jeffrey Epstein, paving the way for President Donald Trump to sign it into law.A senior White House official told the Reuters news service that Trump will sign the Epstein bill \"whenever it gets to the White House.\"The bill will automatically pass the Senate as soon as it is transferred from the House of Representatives, which earlier Tuesday approved the legislation nearly unanimously Senate Minority Leader Chuck Schumer, D-N.Y., introduced a unanimous consent motion to consider the bill passed without debate. No senators objected to the motion.The Senate \"has now passed the Epstein bill as soon as it comes over from the House,\" Schumer said with a smile. \"I yield the floor.\"The House bill, brought by Reps. Thomas Massie, R-Ky., and Ro Khanna, D-Calif., had passed 427-1.Rep. Clay Higgins, R-La., the only House member to oppose the legislation, said in an X post after the vote that he has \"been a principled 'NO' on this bill from the beginning.\"\"If enacted in its current form, this type of broad reveal of criminal investigative files, released to a rabid media, will absolutely result in innocent people being hurt,\" Higgins wrote.The push to release the Epstein files had previously faced opposition from more GOP lawmakers, following the lead of Trump, whose White House had warned that backing the effort would be considered a \"hostile act.\"Read more about the Epstein filesHouse overwhelmingly passes bill to release Jeffrey Epstein filesTrump calls to revoke ABC's license over reporter's Epstein files questionJeffrey Epstein files: Larry Summers steps back from public commitments over email falloutJeffrey Epstein victims' ad calls for files to be released, Trump urges GOP to vote for House measureTrump reverses stance on Epstein records, presses Republicans to support releaseJeffrey Epstein on Trump: 'I know how dirty donald is'Trump to ask DOJ to probe Jeffrey Epstein involvement with Clinton, JPMorgan, SummersGoldman Sachs stands by top lawyer Kathy Ruemmler after her emails with Jeffrey Epstein exposedJeffrey Epstein files: House speaker announces vote next week on release of docsWhile Trump, in a major shift on Sunday night, urged House Republicans to vote in favor of the bill, he has continued to fume about the continued focus on Epstein in the media and on Capitol Hill.When ABC News reporter Mary Bruce asked Trump about the Epstein files earlier Tuesday afternoon, he lashed out, repeatedly insulting her and calling for ABC's broadcast license to be revoked.He reiterated that the Epstein matter \"is a Democrat hoax to try and get me not to be able to talk about\" his administration's accomplishments.In a Truth Social post sent around the same time that the Senate agreed to pass the bill, Trump wrote, \"I just don't want Republicans to take their eyes off all of the Victories that we've had.\"Plaskett censure measure follows Epstein billAfter the House's rare display of near-unity, lawmakers resumed fighting along partisan lines, as Rep. Ralph Norman, R-S.C., introduced a measure to censure Democratic Del. Stacey Plaskett of the U.S. Virgin Islands over her connections to Epstein.The Washington Post last week first reported that Plaskett exchanged texts with Epstein during a congressional hearing in February 2019 with Michael Cohen, Trump's former personal lawyer and fixer. Copies of the texts were revealed when the House Oversight Committee released thousands of documents from Epstein's estate. The documents include numerous emails from Epstein discussing Trump.Plaskett, defending herself against the censure measure on the House floor, said that the messages from Epstein were among \"innumerable texts\" she received after one of her remarks in the hearing \"went viral.\"Epstein at that time \"was my constituent,\" and it \"was not public knowledge at that time that he was under federal investigation,\" Plaskett said.Epstein bill gathers momentumA discharge petition that would have forced a vote on the bill earlier was delayed for weeks as House Speaker Mike Johnson, R-La., kept representatives out of session during the government shutdown. The prolonged absence also delayed the swearing-in of Democratic Rep. Adelita Grijalva of Arizona, the final signature needed to move the petition forward.The shutdown ended last Wednesday and Grijalva, after being sworn in, signed the discharge petition. But, with pressure mounting, Johnson said he would bring the Epstein bill to a vote earlier than expected.WASHINGTON, DC - NOVEMBER 18: U.S. Rep. Thomas Massie (R-KY) (C) speaks during a news conference with Rep. Marjorie Taylor Greene (R-GA) and U.S. Rep. Ro Khanna (D-CA) on the Epstein Files Transparency Act outside the U.S. Capitol on November 18, 2025 in Washington, DC. Heather Diehl | Getty Images\"Today, we stand in a moment that will decide whether our government still belongs to the American people, or to those who prey on them,\" said a survivor of Epstein's abuse who spoke alongside a group of others at a news conference outside the U.S. Capitol on Tuesday morning.The survivors were joined by Massie, Khanna and GOP Rep. Marjorie Taylor Greene of Georgia, a longtime Trump loyalist who has recently become one of his critics.\"He called me a traitor for standing with these women and refusing to take my name off the discharge petition,\" Greene said of Trump at the presser.\"Today, you are going to see, probably a unanimous vote in the House to release the Epstein files. But the fight, the real fight, will happen after that,\" she said.Johnson said later Tuesday morning that he would vote for the bill, which he acknowledged could get unanimous support. But he nevertheless accused Democrats of \"forcing a political show vote on the Epstein files,\" and spoke at length about his issues with the discharge petition.One of his critiques has been that Epstein's victims may not be adequately protected. Massie, asked earlier Tuesday about Johnson's stance, called it a \"red herring.\"\"The survivors have always been in favor of this legislation,\" he said, noting that the bill instructs the DOJ to redact victims' names and identifying information.Speaker of the House Mike Johnson (R-LA) speaks during a press conference on Capitol Hill on November 18, 2025 in Washington, DC. Johnson addressed the \"Epstein Files\" ahead of a House vote on legislation which instructs the U.S. Department of Justice to release all files related to the late accused sex trafficker Jeffrey Epstein. Roberto Schmidt | Getty ImagesTrump, a former friend of Epstein's who had a falling out with him years earlier, said on the campaign trail that he would support releasing the government's files from its investigations into the wealthy and well-connected financier. Epstein died in jail in 2019 while facing federal sex trafficking charges.But Trump's DOJ said in a July 6 memo that it had conducted an \"exhaustive review\" of Epstein-related matters and determined \"that no further disclosure would be appropriate or warranted.\"That determination, and Trump's repeated insistence that the focus on Epstein was a Democratic \"hoax,\" has spurred outrage across the political spectrum, including from some of Trump's own supporters.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Congress approves Jeffrey Epstein files bill, sending it to Trump to sign",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108226911-1763399652306-gettyimages-2245810424-epstein_sign_045_111225.jpeg?v=1763399669&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T23:57:23.000Z",
      "dateModified": "2025-11-18T23:57:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google announces Gemini 3 as battle with OpenAI intensifies",
    "url": "https://www.cnbc.com/2025/11/18/google-announces-gemini-3-as-battle-with-openai-intensifies.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108227488-1763481857132-gettyimages-2247232148-vcg111604452961.jpeg?v=1763481887&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T16:47:29.000Z",
    "description": "Visual China Group | Getty ImagesGoogle is debuting its latest artificial intelligence model, Gemini 3, as the search giant races to keep pace with Ch",
    "body": "Visual China Group | Getty ImagesGoogle is debuting its latest artificial intelligence model, Gemini 3, as the search giant races to keep pace with ChatGPT creator OpenAI.The new AI model will allow users to get better answers to more complex questions, \"so you get what you need with less prompting,\" Alphabet CEO Sundar Pichai said in one of several blog posts Google published Tuesday.Gemini 3 will be integrated into the Gemini app, Google's AI search products AI Mode and AI Overviews, as well as its enterprise products. The rollout begins Tuesday for select subscribers and will go out more broadly in the coming weeks.The announcement comes about eight months after Google introduced Gemini 2.5 and 11 months after Gemini 2.0. OpenAI, which kicked off the generative AI boom in late 2022 with the public launch of ChatGPT, introduced GPT-5 in August.\"It's amazing to think that in just two years, Al has evolved from simply reading text and images to reading the room,\" Pichai wrote in one of Tuesday's posts. \"Starting today, we're shipping Gemini at the scale of Google.\"The Gemini app now has 650 million monthly active users and AI Overviews has 2 billion monthly users, the company said. OpenAI said in August that ChatGPT hit 700 million weekly users.Pichai added that the newest model is \"built to grasp depth and nuance,\" and said Gemini 3 is also \"much better at figuring out the context and intent behind your request, so you get what you need with less prompting.\" Google's other AI models may still be used for simpler tasks, the company said. Alphabet and its megacap rivals are spending heavily to build out the infrastructure for AI development and to rapidly create more services for consumers and businesses. In their earnings reports last month, Alphabet, Meta, Microsoft and Amazon each lifted their guidance for capital expenditures, and collectively expect that number to reach more than $380 billion this year.Google said AI responses powered by Gemini 3 will be \"trading cliché and flattery for genuine insight — telling you what you need to hear, not what you want to hear,\" according to a statement from Demis Hassabis, CEO of Google's AI unit DeepMind. Industry critics have said today's AI chatbots are too sycophantic.Last week, OpenAI issued two updates to GPT-5. One is \"warmer, more intelligent, and better at following your instructions,\" the company said, and the other is \"faster on simple tasks, more persistent on complex ones.\"watch nowGoogle also announced a new agent platform called \"Google Antigravity,\" which lets developers code \"at a higher, task-oriented level.\"Gemini 3 is the company's \"best vibe coding model ever,\" Josh Woodward, vice president of Google Labs and Gemini, told reporters in a briefing. Vibe coding refers to a rapidly emerging market of tools that allow software developers to generate code with prompts.Google said the new model will enable \"generative interfaces,\" providing certain answers in a way that resembles a digital magazine. As an example, the company asked Gemini to \"explain the Van Gogh Gallery with life context for each piece.\" The result was a colorful, image-based explanation for each painting.Within AI Mode, Gemini 3 will first be available to paid subscribers. It will be able to analyze a question and create a layout with visual elements such as images, tables and grids. Google said it can make a custom-built interactive loan calculator or an interactive simulation about a complicated physics problem.Developers will be able to access the Gemini API and businesses will be able to integrate it through Vertex AI, the Google cloud service designed for building, deploying and managing AI models. For corporate customers, Gemini 3 can do things like create employee onboarding and trainings, more accurately analyze videos and factory floor images, and handle procurement, the company said.WATCH: Google adds Gemini to Chrome for all userswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google announces Gemini 3 as battle with OpenAI intensifies",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108227488-1763481857132-gettyimages-2247232148-vcg111604452961.jpeg?v=1763481887&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T16:47:29.000Z",
      "dateModified": "2025-11-18T16:47:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Millions of federal student loan borrowers will start repayment soon. Here's what to know ",
    "url": "https://www.cnbc.com/2025/11/18/federal-student-loan-repayment.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107391178-1711054454517-GettyImages-532462384.jpg?v=1763469344&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-18T16:25:00.000Z",
    "description": "Chuck Savage | GettyMillions of federal student loan borrowers who graduated in the spring will need to start repaying their debt for the first time s",
    "body": "Chuck Savage | GettyMillions of federal student loan borrowers who graduated in the spring will need to start repaying their debt for the first time soon.That's because the six-month grace period that the Department of Education allows students after they finish school is winding down for May graduates.\"In other words, 'Happy Thanksgiving!'\" said higher education expert Mark Kantrowitz. \"It's time to start making payments on your student loans.\"Outstanding federal education debt in the U.S. exceeds $1.6 trillion, and more than 40 million people hold these loans. Between 4 million and 5 million federal student loan borrowers enter repayment each year, mainly during November and December, Kantrowitz said. The typical monthly student loan payment is around $350.Read more CNBC personal finance coverageHow baby boomers can close a retirement savings gapAfter a layoff, don't forget about your 401(k) — it's 'one of your biggest assets,' CFP saysIRS announces 2026 401(k) contribution limits, raises savings capIRS unveils 2026 IRA contribution limits, raises savings capIRS announces 401(k) catch-up contributions for 2026, raises capIRS unveils Roth IRA income limits for 2026What the Visa, MasterCard settlement means for your rewards credit cardWhere SNAP benefits stand amid negotiations to end the government shutdownWhy the AI stock boom mainly benefits the wealthyBoomers are less bullish on ETFs than younger generations — with good reasonTrump floats $2,000 tariff rebate checks: Here's what you need to knowThis is the 'biggest mistake' you can make with your IRA, attorney saysConsumers on edge as ACA 'subsidy cliff' looms: 'Quite frankly, it's terrifying'How to have tricky money talks as a couple: 'Money Together' authorsCNBC's Financial Advisor 100: Best financial advisors, top firms for 2025 rankedThis year, borrowers begin repayment amid a challenging time for the lending system. More than 5 million people are in default on student loans, and President Donald Trump's \"big beautiful bill\" phases out several repayment plans that were intended to make payments more affordable.Here's what you need to know about starting repayment on your student debt.It's easy to miss your first paymentStudent loan borrowers are more likely to miss their first bill than any other payment, Kantrowitz said, because their debt has been \"out of sight, out of mind, for six months.\" Recent graduates are also often balancing other new expenses, including rent, a car, and new work clothes, Kantrowitz said.As a result, he said, \"I tell students to put a reminder in their calendar two weeks before payments are supposed to start.\"You should get your first bill at least 21 days before your payment is due, according to the Education Department. To avoid being late, borrowers can enroll in automatic payments with their loan servicer.If you don't know which company is managing your student loans on behalf of the government, you can find out at Studentaid.gov.Find a repayment plan you can affordBefore your first bill is due, you'll want to research your repayment options, experts said. As for the right plan, \"there's no simple answer,\" said Betsy Mayotte, president of The Institute of Student Loan Advisors, a nonprofit.\"It can be very borrower-specific,\" Mayotte said.As a result of a lawsuit brought by the American Federation of Teachers against the Trump administration, the Education Department has made available some of the student loan repayment plans it had partially paused.Those options are: the Pay As You Earn Repayment Plan and the Income-Contingent Repayment Plan.Both are income-driven repayment plans, which means they set your monthly bill based on income and family size, and lead to debt forgiveness after a certain period, typically 20 years or 25 years. (However, recent legislation will phase out PAYE and ICR as of July 1, 2028.)Starting July 1, 2026, student loan borrowers will have access to one more option, the \"Repayment Assistance Plan,\" or RAP. The plan leads to student loan forgiveness after 30 years, compared with the typical 20-year or 25-year timeline on other plans, but will offer the lowest monthly bill for some borrowers.Meanwhile, the Standard Repayment Plan is a good option for borrowers who are not seeking, or are not eligible for, loan forgiveness and/or can afford the monthly payments, experts say. Under that plan, payments are fixed and borrowers typically make payments for up to 10 years.There are several tools available online to help you determine how much your monthly bill would be under different plans. Borrowers should also be able to change into a different repayment plan at any time.There are options if you can't payThe start of student loan repayments may cause financial hardship for many borrowers.Struggling borrowers should first see if they qualify for a deferment, experts say. With a deferment, loans may not accrue interest, whereas they almost always do in a forbearance.If you're not working, you can request an unemployment deferment with your servicer. If you're dealing with another financial challenge, meanwhile, you may be eligible for an economic hardship deferment. Those who qualify for a hardship deferment include people receiving certain types of federal or state aid and anyone volunteering in the Peace Corps, Kantrowitz said.Other, lesser-known deferments include the graduate fellowship deferment, the military service and post-active-duty deferment and the cancer treatment deferment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Millions of federal student loan borrowers will start repayment soon. Here's what to know ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107391178-1711054454517-GettyImages-532462384.jpg?v=1763469344&w=1920&h=1080"
      ],
      "datePublished": "2025-11-18T16:25:00.000Z",
      "dateModified": "2025-11-18T16:25:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]