[
  {
    "title": "Trump says he wants 'people to be able to a buy a home'—but banning institutional investors may not improve affordability",
    "url": "https://www.cnbc.com/2026/01/21/trump-says-he-wants-people-to-be-able-to-a-buy-a-home.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108254893-1769003917687-gettyimages-2257408985-_s2_8497_gskxdszt.jpeg?v=1769029506&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-21T21:37:44.000Z",
    "description": "President Donald Trump on Wednesday reiterated his push to restrict large institutional investors from buying single-family homes, arguing that Wall S",
    "body": "President Donald Trump on Wednesday reiterated his push to restrict large institutional investors from buying single-family homes, arguing that Wall Street firms have crowded out would-be homebuyers.\"You have these big companies, these big corporations, buying up thousands of homes and renting them or doing whatever they do with them,\" Trump told CNBC's Joe Kernen in an interview in Davos, Switzerland. \"Some of them are flipping them for a big profit, but it got to be too much. We want people to be able to buy a home.\"Trump's comments followed an executive order he signed Tuesday directing federal agencies to curb institutional investor activity in the single-family housing market. The order gives the Treasury Department 30 days to define \"large institutional investor\" and \"single-family home,\" and directs federal agencies to issue guidance within 60 days to implement restrictions, including limits on acquisitions and the sale of federally owned single-family homes to institutional investors.However, housing analysts remain skeptical, saying a lack of affordability is being driven far more by a lack of supply than by investor demand.Institutional investors are not 'market movers'While Trump said Wednesday that institutional investors are \"gobbling up all the homes,\" they make up only a small share of the U.S. housing market. Firms that own 100 or more single-family homes control roughly 2% of the nation's single-family housing stock, according to John Burns Research and Consulting.In theory, widespread and growing corporate homebuying could drive up prices and make it tougher for families to elbow their way into a competitive housing market. However, the share of home purchases by institutional investors has declined from its pandemic peak, falling from about 3% in the first quarter of 2023 to closer to 1% a year later, as higher interest rates cooled investor activity, John Burns Research and Consulting's data shows.\"The real problem is that we've added far more households than we've built single-family homes,\" Jay Parsons, an analyst who tracks rental housing and development trends, tells CNBC Make It. \"It's all about supply and demand.\"Limiting investor demand does not add new homes to the market, and many housing economists say affordability will not improve without a significant increase in supply. Analysts at Goldman Sachs Research estimate the U.S. would need millions of additional homes above current construction levels to meaningfully ease price pressures.In markets where institutional investors are most concentrated, analysts say their impact on prices and rents appears limited. A 2024 analysis by Parsons found that many of the most investor-saturated markets posted rent growth below the U.S. average, a pattern he linked to higher levels of housing construction.\"Institutional investors are just not the main market movers,\" says Scott Lincicome, vice president of general economics and trade at the Cato Institute. \"It's mainly a supply issue.\"Want to get ahead at work with AI? Sign up for CNBC's new online course, Beyond the Basics: How to Use AI to Supercharge Your Work. Learn advanced AI skills like building custom GPTs and using AI agents to boost your productivity today.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he wants 'people to be able to a buy a home'—but banning institutional investors may not improve affordability",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108254893-1769003917687-gettyimages-2257408985-_s2_8497_gskxdszt.jpeg?v=1769029506&w=1920&h=1080"
      ],
      "datePublished": "2026-01-21T21:37:44.000Z",
      "dateModified": "2026-01-21T21:37:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan's December exports growth drops to 5.1%, missing expectations, as shipments to U.S. plunge ",
    "url": "https://www.cnbc.com/2026/01/22/japan-trade-data-december-exports-imports.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108035613-1726622471539-gettyimages-2157647468-JAPAN_NAGOYA_PORT.jpeg?v=1726622489&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T04:32:34.000Z",
    "description": "Vehicles bound for shipment parked in front of the Dream Angel vehicles carrier ship at the Nagoya Port in Nagoya, Japan, on Tuesday, June 18, 2024.Fr",
    "body": "Vehicles bound for shipment parked in front of the Dream Angel vehicles carrier ship at the Nagoya Port in Nagoya, Japan, on Tuesday, June 18, 2024.Fred Mery | Bloomberg | Getty ImagesJapan's exports growth in the final month of 2025 missed analysts' estimates, rising 5.1% year on year, as shipments to the U.S. saw a double-digit decline. Reuters-polled analysts had estimated exports growth would remain unchanged from November at 6.1%.  Japanese exports fell during the middle of 2025, hit by U.S. tariff worries, but saw a rebound toward the end of the year after a trade deal with the U.S. was announced that saw duties slashed to 15%. Exports to the U.S. in December, however, resumed their decline, dropping 11.1%, after an 8.8% jump in the prior month. The gain in November was the first time exports to the U.S. rose since March.Shipments to mainland China, Japan's largest trading partner, climbed 5.6%, while exports to Hong Kong surged 31.1% compared to the same period last year. Exports to the wider Asia region gained 10.2%.Imports in December rose 5.1% year on year, jumping sharply from the 1.3% rise seen in November, and beating Reuters estimates of a 3.6% rise.For full-year 2025, Japan's exports rose 3.1%, a softer rise compared to the 6.2% increase seen in 2024, as shipments to mainland China and the U.S. — Tokyo's top two trading partners — fell 0.4% and 4.1% respectively. Exports to Hong Kong and Taiwan climbed 17.8% and 15.1% for the whole year, partially offsetting declines in the U.S. and China. The rise in overall exports in 2025 was partly due to front-loading of U.S. shipments ahead of tariff hikes, an artificial intelligence boom that's boosted electronics and machinery shipments, and a weak yen, said Stefan Angrick, head of Japan at Moody's Analytics.  \"Although shipments are holding up for now, the outlook is fraught with risks,\" he warned, pointing out that higher U.S. import levies and fierce competition from abroad are weighing on industrial production and export volumes.Trade threats from China are an added concern, Angrick added. Relations between Tokyo and Beijing have chilled since November after comments from Prime Minister Sanae Takaichi suggested that Japan could intervene militarily if China attempted to seize Taiwan by force.China had suspended imports of seafood from Japan, and early this year, announcing restrictions on the export of dual-use goods to Japan.The trade data comes at a time when Japan is bracing for snap elections on Feb. 8 called by Prime Minister Sanae Takaichi, with its Lower House set to be dissolved Friday.  A victory for Takaichi will allow her to push her fiscal agenda through Japan's parliament with little opposition, analysts have said. It could also involve keeping the yen weak, as it supports Japan's exports.Since the announcement of the elections, Japanese markets have been fueled by the so-called \"Takaichi trade,\" that has seen stocks mostly rise, and the yen stay weak. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan's December exports growth drops to 5.1%, missing expectations, as shipments to U.S. plunge ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108035613-1726622471539-gettyimages-2157647468-JAPAN_NAGOYA_PORT.jpeg?v=1726622489&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T04:32:34.000Z",
      "dateModified": "2026-01-22T04:32:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix's advertising strategy shift is starting to pay off",
    "url": "https://www.cnbc.com/2026/01/21/netflix-advertising-revenue-strategy-paying-off.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108254613-17689455512026-01-20t214313z_48598236_rc225jaoujgc_rtrmadp_0_warner-bros-discovery-m-a-netflix.jpeg?v=1768945834&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-21T21:43:01.000Z",
    "description": "A drone view shows Netflix logos on buildings in the Hollywood neighborhood in Los Angeles, California, U.S., Jan. 20, 2026. Daniel Cole | ReutersNetf",
    "body": "A drone view shows Netflix logos on buildings in the Hollywood neighborhood in Los Angeles, California, U.S., Jan. 20, 2026. Daniel Cole | ReutersNetflix jumped into the advertising business later than its media peers, but its strategy shift is starting to pay off.This week Netflix reported its fourth-quarter earnings, which were mostly overshadowed by the company's recent pursuit to acquire Warner Bros. Discovery's streaming and studio assets. However, beyond the headlines, metrics like customer engagement, subscriber numbers and advertising revenue paint a promising picture. The earnings report provided some long-awaited clarity on the progress of Netflix's advertising strategy, and how it has been factoring into the overall business. On Tuesday Netflix said 2025 advertising revenue exceeded $1.5 billion — about 3% of total full-year revenue for the streaming giant — and is expected to double this year. Overall company revenue jumped almost 16% percent for 2025, while net income rose 26%. \"We're making good progress and the opportunity ahead of us is massive,\" Co-CEO Greg Peters said on Tuesday's call with investors. Wall Street analysts, however, noted that ad revenue disclosure fell short of their previous forecasts, indicating that it could be taking longer than expected to get the ad business off the ground. \"The last couple of years were slower out of the gate than we had estimated. However, advertising revenue growth is hitting its stride and should yield a similar contribution to revenue growth as we had estimated in our pre-4Q forecast,\" analysts at Deutsche Bank said in a research note Wednesday. Robert Fishman of MoffettNathanson noted total ad revenue was lower than the research firm had forecast but welcomed the fresh insights into the company's ad business. \"At least now we can finally have a better understanding of the contribution from advertising to total growth and can back into core subscription revenues,\" Fishman said in a note on Wednesday. Netflix's stock fell about 2% on Wednesday.Advertising has come front and center for media companies after it became clear that a subscription-only streaming model wouldn't be enough to support profitability. Advertisers, despite various headwinds, have been eager to find a place on streaming platforms, especially Netflix. Yet the industry leader was late to the advertising game after leadership long rejected the business model. It launched its cheaper, ad-supported tier in late 2022, coinciding with a brief slowdown in subscriber additions. Advertising and a crackdown on password sharing were put forth as measures to drive growth. And it has, even if slowly. Netflix said Tuesday it had 325 million global subscribers at the end of 2025. That marks an increase of roughly 23 million from the end of 2024, when Netflix last disclosed its global paid memberships. For comparison, Netflix added roughly 41 million subscribers in 2024 and almost 30 million in 2023. Against a backdrop of consistent price increases for streaming services, companies are increasingly leaning on the belief that consumers will opt for cheaper, ad-supported plans rather than drop out altogether. Peters said Tuesday that while there remains a gap between average revenue per membership of the company's standard, no-ads plan subscription and its ad-supported plan, \"that gap is narrowing.\" \"And while, because there's a gap, it means we're under-realizing revenue growth in the near time, it also, therefore, represents an opportunity for us,\" Peters said, pointing to upgrading the tech stack and ad capabilities to help drive growth. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix's advertising strategy shift is starting to pay off",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108254613-17689455512026-01-20t214313z_48598236_rc225jaoujgc_rtrmadp_0_warner-bros-discovery-m-a-netflix.jpeg?v=1768945834&w=1920&h=1080"
      ],
      "datePublished": "2026-01-21T21:43:01.000Z",
      "dateModified": "2026-01-21T21:43:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Natural gas prices soar as Arctic cold to blast Upper Midwest and descend across U.S.",
    "url": "https://www.cnbc.com/2026/01/21/nautral-gas-prices-soar-as-winter-storm-arctic-cold-to-blast-us.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108163101-17507669092025-06-24t081335z_1899629200_rc2f8faevr86_rtrmadp_0_usa-oil.jpeg?v=1750766930&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-21T21:32:30.000Z",
    "description": "A person takes a break from clearing a walkway along Bannock Street as a winter storm sweeps over the intermountain West, plunging temperatures into t",
    "body": "A person takes a break from clearing a walkway along Bannock Street as a winter storm sweeps over the intermountain West, plunging temperatures into the single digits and bringing along a light snow in its wake Saturday, Jan. 18, 2025, in Denver.David Zalubowski | APNatural gas prices soared more than 20% on Wednesday as an Arctic cold front is forecast to blast across the Upper Midwest and descend south to grip much of the U.S. with frigid temperatures through the weekend. Prices surged about 25%, or 97 cents, to close at nearly $4.88 per million British thermal units. Heating demand is expected to spike as wind chills could fall to -50 degrees Fahrenheit across the Upper Midwest and Northern Plains, according to the National Weather Service. The wind chills pose a life-threatening risk of hypothermia and frostbite to exposed skin, the NWS warned. Power outages could prolong the risk, the federal agency said. Families should protect all pets from the cold, it said.Heavy snow is forecast for the southern high plains of Colorado and New Mexico on Friday, said Owen Shieh, a meteorologist at the NWS Weather Prediction Center in a public service announcement on social media. The storm will spread across the southern plains to the Mississippi Valley on Saturday before moving into southern Appalachia, the Carolinas and the Mid-Atlantic on Saturday night into Sunday, Shieh said. A major ice storm threatens to hit Texas on Friday night and extend through the Deep South and the Carolinas into the weekend, the meteorologist said. This could lead to hazardous travel, downed trees and power lines, he said. Frigid subzero and single-digit temperatures will also expand into the Ohio Valley and Northeast by Sunday, according to the NWS. \"Due to the large extent and long duration of the extreme cold accompanying this winter storm, it will take longer for the snow and ice to melt after the storm,\" Shieh said. \"You need to prepare for the possibility of extended impacts, potentially for several days.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Natural gas prices soar as Arctic cold to blast Upper Midwest and descend across U.S.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108163101-17507669092025-06-24t081335z_1899629200_rc2f8faevr86_rtrmadp_0_usa-oil.jpeg?v=1750766930&w=1920&h=1080"
      ],
      "datePublished": "2026-01-21T21:32:30.000Z",
      "dateModified": "2026-01-21T21:32:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tariff tensions cool after business leaders tell CNBC Europe must consider retaliating against Trump’s ‘blackmail’",
    "url": "https://www.cnbc.com/2026/01/22/trump-europe-tariffs-business-blackmail.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108124126-1743513610327-gettyimages-2201578096-contini-aerialvi250222_npmRv.jpeg?v=1769064798&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T08:18:53.000Z",
    "description": "Tariff tensions have cooled after business groups told CNBC that the EU must consider retaliatory measures in response to U.S. President Donald Trump'",
    "body": "Tariff tensions have cooled after business groups told CNBC that the EU must consider retaliatory measures in response to U.S. President Donald Trump's threats to impose tariffs on the bloc.The EU has frozen its EU-US trade deal in response to Trump announcing plans to impose 10% tariffs on six EU nations, alongside the U.K. and Norway from Feb. 1 on Saturday. There were calls for the bloc to consider using its anti-coercion instrument (ACI), a set of measures that allow it to impose sweeping trade sanctions, before Trump announced a tariff climbdown on Wednesday evening.\"All EU trade defense instruments — including the Anti-Coercion Instrument (ACI) — must now be reviewed,\" Volker Treier, chief executive of foreign trade at the German Chamber of Commerce and Industry (DIHK), which represents nearly 4 million businesses, told CNBC on Wednesday afternoon. He added that the ACI should be a \"last resort.\"watch nowEurope should be \"prepared to act decisively if our interests are put at risk\" while continuing to work for de-escalation, Ole Erik Almlid, CEO of the Confederation of Norwegian Enterprise, which represents thousands of businesses, told CNBC on Wednesday afternoon.\"Europe must not allow itself to be blackmailed, not even by the United States,\" Bertram Kawlath, president of the German industrial sector association VDMA, which represents 3,500 engineering companies, said in a statement on Sunday.\"Greenland is part of Europe and must remain so. If the EU gives in here, it will only encourage the American president to make the next ludicrous demand and threaten further tariffs,\" he said, adding that the European Commission should examine whether the ACI can be used.Economic impactWere tariffs to go ahead on February 1, as Trump had previously threatened, the impact of European businesses could be significant, business leaders have warned.Analysis by the British Chambers of Commerce found that 10% tariffs on U.S. exports could cost U.K. businesses £6 billion, rising to £15 billion, or $20 billion, in June — when Trump has said tariffs would increase to 25% if the countries continue to resist his Greenland plans.\"The UK is not without influence, our bilateral trade with the US is worth £300bn, we have £500bn invested in its economy and it has £700bn tied up in ours,\" BCC Director General Shevaun Haviland said. \"There is a high-level of co-dependency. The government should keep everything on the table during talks.\"Deutsche Bank analysts on Monday said European countries' huge holdings in U.S. assets give it an advantage, as it weighed counter-measures.But new tariffs from the U.S. would result in further \"significant\" cuts to trade and transatlantic business for German companies, Treier told CNBC. The European mechanical and plant engineering industry is already disproportionately affected by U.S. tariffs because many products are subject to 50% levies on steel and aluminium, Kawlath said. \"Added to this are high bureaucratic costs, which prevent many transactions,\" he added. \"More than half of all exported machinery could be affected.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tariff tensions cool after business leaders tell CNBC Europe must consider retaliating against Trump’s ‘blackmail’",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108124126-1743513610327-gettyimages-2201578096-contini-aerialvi250222_npmRv.jpeg?v=1769064798&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T08:18:53.000Z",
      "dateModified": "2026-01-22T08:18:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI seeking investments from Middle East sovereign wealth funds for multibillion-dollar round",
    "url": "https://www.cnbc.com/2026/01/21/openai-seek-investments-from-middle-east-for-multibillion-dollar-round.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108202500-17585857512025-02-07t115613z_865237367_rc2npcauossb_rtrmadp_0_openai-germany.jpeg?v=1758585772&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T03:50:10.000Z",
    "description": "Sam Altman, co-founder and CEO of OpenAI, takes part in a panel discussion on artificial intelligence at the Technical University Berlin, in Berlin, G",
    "body": "Sam Altman, co-founder and CEO of OpenAI, takes part in a panel discussion on artificial intelligence at the Technical University Berlin, in Berlin, Germany, February 7, 2025. Axel Schmidt | ReutersOpenAI is in talks with sovereign wealth funds in the Middle East to try to secure investments for a new multibillion dollar funding round, CNBC confirmed on Wednesday. The round is expected to total around $50 billion, but the numbers could change and term sheets have not been signed, according to a source familiar with the discussions who asked not to be named because the details are confidential. Bloomberg was first to report the discussions. OpenAI CEO Sam Altman is in the United Arab Emirates to participate in the investment talks, the person said. The round is expected to close in the first quarter of the year. OpenAI kickstarted the AI boom by launching its artificial intelligence chatbot ChatGPT in 2022, and has since become one of the fastest growing commercial entities on the planet. The company has raised billions of dollars from investors as it's worked to scale and develop new models and roll out new features. Last year, OpenAI closed a $40 billion financing round led by SoftBank, the largest private tech funding on record. The round included participation from core investor Microsoft, as well as Coatue, Altimeter and Thrive.OpenAI also finalized a $6.6 billion share sale in October that boosted its valuation to $500 billion. WATCH: OpenAI CFO Sarah Friar: There’s a massive ‘capability overhang’ in AI that’s occurringwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI seeking investments from Middle East sovereign wealth funds for multibillion-dollar round",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108202500-17585857512025-02-07t115613z_865237367_rc2npcauossb_rtrmadp_0_openai-germany.jpeg?v=1758585772&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T03:50:10.000Z",
      "dateModified": "2026-01-22T03:50:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump signals he has a favorite for Fed chair: 'Down to maybe one, in my mind'",
    "url": "https://www.cnbc.com/2026/01/21/trump-signals-he-has-a-favorite-for-fed-chair-down-to-maybe-one-in-my-mind.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255267-1769025573735-Screenshot_2026-01-21_at_25806_PM.png?v=1769025612&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-21T20:49:19.000Z",
    "description": "watch nowPresident Donald Trump said Wednesday he is nearing the end of a search to replace Federal Reserve Chair Jerome Powell and hinted he has his ",
    "body": "watch nowPresident Donald Trump said Wednesday he is nearing the end of a search to replace Federal Reserve Chair Jerome Powell and hinted he has his candidate in mind.In a CNBC interview at the World Economic Forum in Davos, Switzerland, the president said a search that began in September and once included as many as 11 candidates is nearly over.\"I'd say we're down to three, but we're down to two. And I probably can tell you, we're down to maybe one, in my mind,\" the president said to CNBC's Joe Kernen. Still, Trump declined to name the one.The candidate list included past and current Fed officials, economists and Wall Street investors.The finalists had been widely believed to be Former Fed Governor Kevin Warsh, current Governor Christopher Waller, National Economic Council chief Kevin Hassett and BlackRock fixed income head Rick Rieder. Trump in the interview said Rieder, the last to interview, is \"impressive\" and praised all the candidates.In recent days, Trump said he preferred Hassett stay at the NEC, likely eliminating him from contention. Treasury Secretary Scott Bessent led the interview process. Trump in the past has expressed support for Bessent to take the Fed job, but said Wednesday, \"Scott only wants to stay where he is.\"The statement on the Fed chair is the latest in a series of dramatic twists and turns in the saga following a year of unprecedented tumult for the central bank. Though Trump criticized Powell and his colleagues heavily during his first term in office from 2017 to 2021, he ramped up the pressure considerably in 2025. That included more verbal assaults on policymakers as well as threats to fire Powell and an actual attempt to sack Governor Lisa Cook, a move that was the subject of a Supreme Court hearing earlier Wednesday on presidential authority over the institution.With Powell's removal as chair a near certainty, the next question turns to whether he'll stay on another two years to serve out his remaining term as governor. Staying on would give Powell a continued say over monetary policy and interest rates and could act a bulwark against Trump's efforts to exert control over Fed decisions. Trump indicated some indifference as to what Powell decides.\"We live with the cards you're dealt,\" he said. \"If that happens, his life won't be very, very happy, I don't think, by doing it. I think he wants to get out. He has not done a good job.\"Trump again criticized Powell for the renovation project at Fed headquarters, the price of which has run north of $2.5 billion. The Justice Department has subpoenaed Powell relative to the project.\"I could have done it for $25 million and it would have been nicer than what they're doing,\" Trump said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump signals he has a favorite for Fed chair: 'Down to maybe one, in my mind'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255267-1769025573735-Screenshot_2026-01-21_at_25806_PM.png?v=1769025612&w=1920&h=1080"
      ],
      "datePublished": "2026-01-21T20:49:19.000Z",
      "dateModified": "2026-01-21T20:49:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pending home sales drop sharply in December, dampening 2026 outlook",
    "url": "https://www.cnbc.com/2026/01/21/pending-home-sales-december-drop-sharply.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108251166-1768230337795-gettyimages-2255399241-FLORIDA_OPEN_HOUSES.jpeg?v=1768230445&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-21T16:57:26.000Z",
    "description": "An \"Open House\" sign outside a home in Palm Beach Gardens, Florida, US, on Sunday, Jan. 11, 2026. Zak Bennett | Bloomberg | Getty ImagesStagnant mortg",
    "body": "An \"Open House\" sign outside a home in Palm Beach Gardens, Florida, US, on Sunday, Jan. 11, 2026. Zak Bennett | Bloomberg | Getty ImagesStagnant mortgage rates, falling housing supply and ongoing economic uncertainty weighed heavily on homebuyers in December. Pending home sales, a measure of signed contracts on existing homes, dropped 9.3% last month from November, according to the National Association of Realtors. Analysts were expecting a slight gain. Sales were 3% lower than December 2024.\"The housing sector is not out of the woods yet,\" said Lawrence Yun, chief economist for the Realtors. \"After several months of encouraging signs in pending contracts and closed sales, the December new contract figures have dampened the short-term outlook.\"Sales fell month to month in all regions of U.S. and were higher annually only in the South. Homes also stayed on the market longer in December, at an average of 39 days compared with 35 days in December 2024.Mortgage rates in December, when these deals were inked, barely moved at all. The average rate on the popular 30-year fixed loan sat around 6.25%, according to Mortgage News Daily. That is slightly lower than it was over the summer, but consumers were also facing a market with fewer homes available for sale. Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.There were just 1.18 million homes on the market in December, down 9% from November, and matching the lowest inventory level of 2025. Inventory was up 12% from a year ago, but that is off an extremely low level. \"Consumers prefer seeing abundant inventory before making the major decision of purchasing a home. So, the decline in pending home sales could be a result of dampened consumer enthusiasm about buying a home when there are so few options listed for sale,\" Yun added. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pending home sales drop sharply in December, dampening 2026 outlook",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108251166-1768230337795-gettyimages-2255399241-FLORIDA_OPEN_HOUSES.jpeg?v=1768230445&w=1920&h=1080"
      ],
      "datePublished": "2026-01-21T16:57:26.000Z",
      "dateModified": "2026-01-21T16:57:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Korea economic growth slows to cooler-than-expected 1.5% in fourth quarter as construction and exports fall",
    "url": "https://www.cnbc.com/2026/01/22/south-korea-q4-gdp-exports-semiconductors-tariffs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255018-1769012063577-gettyimages-71006700-57666238CJ009_Walmart.jpeg?v=1769012081&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-22T01:16:51.000Z",
    "description": "INCHEON, SOUTH KOREA - MAY 22:  Shoppers look at goods at a Wal-Mart store May 22, 2006 in Incheon, South Korea. Chung Sung-jun | Getty Images News | ",
    "body": "INCHEON, SOUTH KOREA - MAY 22:  Shoppers look at goods at a Wal-Mart store May 22, 2006 in Incheon, South Korea. Chung Sung-jun | Getty Images News | Getty ImagesSouth Korea's economic growth slowed in the final quarter of last year as a sharp slump in construction investment and a pullback in exports outweighed modest gains in consumption.The economy expanded 1.5% in the October to December period from a year earlier, according to the central bank's advance estimates, missing economists' forecast of 1.9%. That compared with 1.8% growth in the prior quarter, when the economy expanded at its fastest pace in over a year. On a quarterly basis, gross domestic product contracted 0.3%, marking the steepest slowdown since the fourth quarter of 2022. Economists polled by Reuters had expected a 0.1% expansion. For the full year, South Korea's economy grew 1%, its slowest annual expansion since 2020, when output contracted 0.7% during the pandemic.Construction investment shrank 3.9% from the previous quarter as both building and civil engineering activity declined, according to data from the Bank of Korea. Facilities investment fell 1.8%, led by a drop in transportation equipment. Exports pulled back 2.1% from the previous quarter as motor vehicles and machinery shipments fell. Manufacturing and utilities supply, including electricity, gas and water, dropped 1.5% and 9.2%, respectively.  Meanwhile, private consumption expanded 0.3% on services expenditures while government spending rose 0.6%, driven by health care benefits. South Korean President Lee Jae Myung and his American counterpart, Donald Trump, reached a trade agreement in November that included $150 billion in Korean investment in the U.S. shipbuilding sector and an additional $200 billion in investment pledges. In exchange, the Trump administration agreed to reduce tariffs on South Korean cars and auto parts to 15% from 25%. The country's exports have largely held up last year despite heightened trade uncertainties. Its exports rose to a record $709.7 billion in 2025, up 3.8% from a year earlier, driven by semiconductor shipments, which jumped 22% amid surging demand for artificial intelligence chips.Tariff tensions continued to cloud the outlook for the export-oriented economy. Last week, Trump imposed a 25% tariff on certain imported AI chips as part of his push to encourage semiconductor production in the U.S.U.S. Commerce Secretary Howard Lutnick had suggested South Korean and Taiwanese chipmakers could face tariffs of up to 100% unless they commit to increased production in America.Lee on Wednesday downplayed the renewed threat of semiconductor tariffs, saying the costs would likely be passed on to American consumers. watch nowInflation has remained subdued, easing to 2.1% last year from 2.3% in 2024, broadly in line with the central bank's 2% target. The Bank of Korea last week kept its benchmark interest rate unchanged at 2.5%, as policymakers prioritize financial stability amid a sharply weakening won and accelerating capital outflows. The won has faltered more than 6% against the dollar since July last year, hovering near 16-year lows, driven in part by Korean retail investors piling into U.S. equities. Market intervention efforts, including waiving the foreign-exchange stability levy for banks to boost the supply of U.S. dollars, have so far failed to halt the currency's decline. The won has lost nearly 2% against the greenback this year as of Thursday, making it one of Asia's worst-performing currencies.  The Ministry of Economy and Finance last week raised its 2026 GDP forecast, expecting the economic growth to accelerate to 2%, up from its August projection of 1.8%. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Korea economic growth slows to cooler-than-expected 1.5% in fourth quarter as construction and exports fall",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255018-1769012063577-gettyimages-71006700-57666238CJ009_Walmart.jpeg?v=1769012081&w=1920&h=1080"
      ],
      "datePublished": "2026-01-22T01:16:51.000Z",
      "dateModified": "2026-01-22T01:16:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berkshire prepares to exit 28% stake in Kraft Heinz as new CEO aims to move on from rare Buffett gaffe",
    "url": "https://www.cnbc.com/2026/01/21/berkshire-set-to-exit-28percent-stake-in-kraft-heinz-after-rare-buffett-blunder.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108140493-1746283910980-BUFFETT_AND_ABEL_AND_JAIN_1.jpg?v=1746285830&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-21T17:22:52.000Z",
    "description": "Warren Buffett, Greg Abel and Ajit Jain during the Berkshire Hathaway Annual Shareholders Meeting in Omaha, Nebraska on May 3, 2025.CNBCBerkshire Hath",
    "body": "Warren Buffett, Greg Abel and Ajit Jain during the Berkshire Hathaway Annual Shareholders Meeting in Omaha, Nebraska on May 3, 2025.CNBCBerkshire Hathaway, with new CEO Greg Abel in charge, has taken a formal step toward unwinding a rare misstep by Warren Buffett.The conglomerate, which owns Geico insurance and BNSF Railway, registered its entire 27.5% stake in Kraft Heinz in a filing that clears the way for Berkshire to exit its position in the hot dog and macaroni-and-cheese maker. Berkshire is Kraft Heinz's largest shareholder.Shares of Kraft Heinz fell as much as 7.5% at one point in Wednesday trading following the news.The move underscores Abel's willingness to move on from a deal that has long stood out as a rare blemish on Buffett's otherwise storied record. Kraft Heinz shares have plunged about 70% since the 2015 merger that created the ketchup-making giant, weighed down by shifting consumer tastes, rising costs and sluggish growth across core brands. Some of the loss has been offset with billions of dollars in dividends over the years, but last year Berkshire still took a $3.8 billion write-down on the value of its holding. \"We ... view the timing of this sale as being reflective of Abel's desire to clean up and pare down the investment portfolio early in his tenure,\" Greggory Warren, senior equity analyst at Morningstar, said in a note.The latest Berkshire filing also came as Kraft Heinz seeks to separate into two companies: one focused on sauces, spreads and shelf-stable meals and a second that includes North American staples like Oscar Mayer meats, Kraft cheese singles and Lunchables.Buffett himself has acknowledged his frustration with how the merger he orchestrated a decade ago ultimately unraveled.\"It certainly didn't turn out to be a brilliant idea to put them together, but I don't think taking them apart will fix it,\" Buffett, who remains Berkshire's chairman, told CNBC last year.The registration statement gives Berkshire the flexibility to reduce the position, rather than signaling an imminent sale, according to Stifel.\"The registration provides Berkshire Hathaway the ability to reduce its ownership stake; we believe transaction notifications are not required outside of quarterly 13F filings,\" Stifel analysts wrote. \"The next update is likely to be in mid-May, when Berkshire reports its first fiscal quarter activity.\"Stifel reiterated a hold rating on Kraft Heinz and a $26 price target, citing softer U.S. consumption trends and slower growth in emerging markets that could delay any revenue growth, even as the company continues to generate strong cash flow.In 2015, Berkshire teamed up with Brazilian private equity firm 3G Capital to merge Kraft Foods with H.J. Heinz. 3G Capital quietly exited its Kraft Heinz investment in 2023, after years of periodically trimming its stake as the combined company struggled.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berkshire prepares to exit 28% stake in Kraft Heinz as new CEO aims to move on from rare Buffett gaffe",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108140493-1746283910980-BUFFETT_AND_ABEL_AND_JAIN_1.jpg?v=1746285830&w=1920&h=1080"
      ],
      "datePublished": "2026-01-21T17:22:52.000Z",
      "dateModified": "2026-01-21T17:22:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jamie Dimon says U.S. should impose Trump's credit card rate cap in Vermont and Massachusetts ",
    "url": "https://www.cnbc.com/2026/01/21/jamie-dimon-trump-credit-card-rate-cap-vermont-massachusetts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222450-1762446975226-gettyimages-2244831435-AFP_83AN7Q9.jpeg?v=1762447016&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-21T21:59:10.000Z",
    "description": "Jamie Dimon, CEO of JPMorgan Chase, speaks at the American Business Forum at the Kaseya Center in Miami on Nov. 6, 2025.Chandan Khanna | AFP | Getty I",
    "body": "Jamie Dimon, CEO of JPMorgan Chase, speaks at the American Business Forum at the Kaseya Center in Miami on Nov. 6, 2025.Chandan Khanna | AFP | Getty ImagesJPMorgan Chase CEO Jamie Dimon on Wednesday advocated for a test of President Donald Trump's proposed 10% cap on credit card interest rates in two U.S. states: Vermont and Massachusetts.Dimon, speaking on a panel at the World Economic Forum at Davos, Switzerland, addressed a question about Trump's order for banks to voluntarily limit their interest rates for a year. The president had called for the lower rates to take effect Tuesday.Several large credit card lenders contacted by CNBC on Tuesday said they had made no changes to their interest rates, but they all declined to be identified as defying Trump's proposal.\"It would be an economic disaster,\" Dimon said Wednesday. \"In the worst case, you'd have a drastic reduction of the credit card business\" for 80% of Americans, he said. In earnings conference calls last week and behind the scenes, banks have pushed back against Trump's order this month to voluntarily forgo billions of dollars in revenue.Their main argument, that price controls will result in lenders canceling accounts for many card customers, has resonated with several Republican lawmakers, including House Speaker Mike Johnson. Most banking analysts believe that Trump would need legislation to enact a nationwide cap on card rates.'A great idea'Dimon then said he had a \"great idea\" to help quell disagreement over the proposed card cap, suggesting that the U.S. government impose the pricing controls on Americans in just two states.Vermont and Massachusetts are the home states of Sens. Bernie Sanders and Elizabeth Warren, respectively, both of whom support a bill capping card rates at 10% for five years. Dimon didn't mention the lawmakers by name Wednesday.The U.S. government \"should force all the banks to do it in two states, Vermont and Massachusetts, and see what happens,\" Dimon said, drawing laughter from the audience.Dimon said \"the left\" and people who argue for price controls \"will learn a real lesson, and the people crying the most won't be the credit card companies,\" he said.\"It'll be the restaurants, the retailers, the travel companies, the schools, the municipalities, because people miss their water payments,\" he said. \"It would be something else to watch.\"The office of Sanders didn't immediately return calls for comment.Warren had a response which read, in part: \"It's January 21, and unsurprisingly, there is no self-imposed interest rate cap on credit cards by the big banks,\" Warren said. \"But Jamie Dimon and the world's richest people did fly their private jets to a ski resort in Switzerland to complain about how bipartisan action to cap credit card interest rates would destroy life as we know it... It's time to pass a law and get this done.\"Dimon added that JPMorgan was planning on giving the Trump administration its analysis on what would happen under a national credit card rate cap.\"I think it's wrong for the government to get involved extensively in pricing of stuff, but I got to deal with the world I got,\" Dimon said.— CNBC's Stephanie Dhue contributed to this story.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jamie Dimon says U.S. should impose Trump's credit card rate cap in Vermont and Massachusetts ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222450-1762446975226-gettyimages-2244831435-AFP_83AN7Q9.jpeg?v=1762447016&w=1920&h=1080"
      ],
      "datePublished": "2026-01-21T21:59:10.000Z",
      "dateModified": "2026-01-21T21:59:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeff Bezos' Blue Origin launches satellite internet service to rival SpaceX, Amazon",
    "url": "https://www.cnbc.com/2026/01/21/bezos-blue-origin-satellite-internet-spacex-amazon.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106913832-1626805858325-gettyimages-1329731718-b64i7258_20210720114116370.jpeg?v=1769027429&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-21T22:03:19.000Z",
    "description": "Jeff Bezos holds the aviation glasses that belonged to Amelia Earhart as he speaks during a press conference about his flight on Blue Origin’s New She",
    "body": "Jeff Bezos holds the aviation glasses that belonged to Amelia Earhart as he speaks during a press conference about his flight on Blue Origin’s New Shepard into space, in Van Horn, Texas, July 20, 2021.Joe Raedle | Getty ImagesJeff Bezos' space venture Blue Origin announced Wednesday it plans to deploy 5,408 satellites into space for a communications network that will take on SpaceX and Amazon.The network, called TeraWave, is targeted for enterprise, data center and government users. The company said it will provide data speeds of \"up to 6 terabits per second\" from satellites positioned in low Earth orbit and medium Earth orbit, regions of space that are between 100 miles and 21,000 miles from the Earth's surface. Blue Origin said it expects to begin deploying its constellation in the fourth quarter of 2027. Bezos is entering an increasingly crowded satellite internet market that's currently dominated by Starlink, a service operated by Elon Musk's SpaceX. Starlink has more than 9,000 satellites in orbit and roughly 9 million customers. Read more CNBC tech newsTech stocks lead Wall Street sell-off as tensions over Greenland escalateMost of Instagram's ads ran on Reels in 2025, data showsOpenAI to focus on 'practical adoption' in 2026, says finance chief Sarah FriarElon Musk's xAI faces tougher road building out data centers after EPA rule updateAmazon, which Bezos founded in 1994, has also ramped up its own offering in the past year. The service recently rebranded from Project Kuiper to Leo. The company has sent up 180 satellites since last April through a series of rocket launches handled by partners such as United Launch Alliance and SpaceX. Several future deployments are expected to be handled by Blue Origin. Amazon aims to build a constellation of 3,236 low Earth satellites that will serve businesses, governments and consumers. Last November, the company opened up an \"enterprise preview\" to select users ahead of a broader commercial launch.  Bezos predicted in 2024 that Blue Origin would one day be a bigger company than Amazon. He founded Blue Origin in 2000, and Dave Limp, Amazon's former devices boss, serves as its CEO. \"I think it's going to be the best business that I've ever been involved in, but it's going to take a while,\" Bezos said in a 2024 interview at The New York Times' DealBook Summit.Blue Origin is primarily a rocket launch company, flying tourists and research to the edge of space on short trips. Last January, the startup notched a major milestone when it successfully launched its towering New Glenn rocket for the first time, though it was unable to return the rocket's booster back to a barge for reuse. Blue Origin nailed the landing of its New Glenn rocket booster last November following the successful launch of a pair of NASA spacecraft. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeff Bezos' Blue Origin launches satellite internet service to rival SpaceX, Amazon",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106913832-1626805858325-gettyimages-1329731718-b64i7258_20210720114116370.jpeg?v=1769027429&w=1920&h=1080"
      ],
      "datePublished": "2026-01-21T22:03:19.000Z",
      "dateModified": "2026-01-21T22:03:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Intel's stock jumps 11% to highest since early 2022 ahead of earnings",
    "url": "https://www.cnbc.com/2026/01/21/intels-stock-jumps-10percent-to-highest-since-early-2022-ahead-of-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108209988-1760019895734-lib-bu-tan-wafer-ultra-core-3-1024x726.jpg?v=1769029098&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-21T21:33:20.000Z",
    "description": "Intel CEO Lip-Bu Tan holds a wafer of CPU tiles for the Intel Core Ultra series 3, code-named Panther Lake, outside the Intel Ocotillo campus in Chand",
    "body": "Intel CEO Lip-Bu Tan holds a wafer of CPU tiles for the Intel Core Ultra series 3, code-named Panther Lake, outside the Intel Ocotillo campus in Chandler, Arizona.Courtesy: IntelWall Street is piling into Intel ahead of the chipmaker's quarterly earnings report scheduled for after the close on Thursday.The stock jumped about 11% on Wednesday to its highest since January 2022, continuing a rally that lifted it 84% last year and bringing its gains over the past 12 months to 149%.Much of the optimism is tied to strong sales of Intel's latest server chips, which analysts say are benefitting from rising spending on artificial intelligence infrastructure. KeyBanc analysts upgraded the stock to the equivalent of a buy earlier this month, suggesting that Intel is likely sold out of server CPUs for this year, meaning prices could be on the rise. \"We expect outsized data center demand from hyperscalers this year to be a significant tailwind\" for Intel's data center business, the KeyBanc analysts wrote. They have a price target of $60 for the stock, which closed above $54 on Wednesday. Intel is also getting a boost from recent indications that the company's foundry business, which is still seeking an anchor customer, could start to secure orders and become the No. 2 chip foundry behind Taiwan Semiconductor Manufacturing Co. and ahead of Samsung. Intel recently touted its 18A manufacturing technology, seen as equivalent to TSMC's 2 nanometer process technology. The U.S. government has become a key backer of Intel, making it the largest shareholder after an $8.9 billion investment last year, partially because it's the only American company capable of making advanced chips. Nvidia, the leading maker of AI chips and a prospective customer for Intel's factories, is one of the top shareholders in the company after a $5 billion investment last year. Intel and Nvidia agreed to work together to integrate Intel's CPUs with Nvidia's AI chips in Nvidia systems. The government's stake has increased by $14 billion since its deal was agreed to in August. Nvidia's stake has grown by more than $6 billion since its investment the following month. Intel CEO Lip-Bu Tan was appointed to the top job in March, and has since slashed costs, cut jobs and re-organized the leadership structure. Analysts expect Intel to report a 6% drop in year-over-year revenue for the fourth quarter to $13.4 billion, according to LSEG. However, they're projecting data center and AI sales to surge nearly 29% to $4.4 billion, according to FactSet estimates. Other chip stocks rose on Wednesday, including Intel rival Advanced Micro Devices, which gained about 8%, and memory maker Micron Technology, which climbed 7%. The market broadly rose after President Donald Trump said he won't use military force to acquire Greenland. WATCH: Can Intel's New Arizona Chip Fab Bring It Back From The Brink?watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Intel's stock jumps 11% to highest since early 2022 ahead of earnings",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108209988-1760019895734-lib-bu-tan-wafer-ultra-core-3-1024x726.jpg?v=1769029098&w=1920&h=1080"
      ],
      "datePublished": "2026-01-21T21:33:20.000Z",
      "dateModified": "2026-01-21T21:33:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jamie Dimon issues rare CEO criticism of Trump's immigration policy: 'I don’t like what I’m seeing'",
    "url": "https://www.cnbc.com/2026/01/21/jamie-dimon-trump-immigration-policy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108213164-1760638891942-gettyimages-2241014390-IMF_WORLD_BANK.jpeg?v=1769033067&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-21T22:15:47.000Z",
    "description": "Jamie Dimon, chief executive officer of JPMorgan Chase & Co., during the 2025 IIF annual membership meeting in Washington, Oct. 16, 2025.Samuel Corum ",
    "body": "Jamie Dimon, chief executive officer of JPMorgan Chase & Co., during the 2025 IIF annual membership meeting in Washington, Oct. 16, 2025.Samuel Corum | Bloomberg | Getty ImagesJPMorgan Chase CEO Jamie Dimon said Wednesday that he disagreed with President Donald Trump's approach to immigration, offering a rare public rebuke by a U.S. corporate leader of one of Trump's signature policies. Dimon, speaking on a panel at the World Economic Forum in Davos, Switzerland, initially praised Trump's moves to secure the borders of the world's largest economy. Illegal crossings at the U.S.-Mexico border fell to the lowest level in 50 years for the period from October 2024 to September 2025, the BBC reported citing federal data.But Dimon, who has long advocated for immigration reform to boost U.S. economic growth, also made an apparent reference to videos of U.S. Immigration and Customs Enforcement officers rounding up people alleged to be undocumented immigrants.\"I don't like what I'm seeing, five grown men beating up a little old lady,\" Dimon said. \"So I think we should calm down a little bit on the internal anger about immigration.\"It's unclear if Dimon was speaking about a specific incident, or more broadly about ICE confrontations.In the first year of his second term, Trump has overhauled U.S. immigration policy with a focus on mass deportations, tightened asylum access and ramped-up spending for ICE personnel and facilities. Among a torrent of new policies that changed the landscape for seeking American citizenship, the administration also rescinded guidance on where ICE arrests could happen, leading to raids at schools, hospitals and places of worship.Unlike during Trump's first term, American CEOs have mostly avoided public criticism of his policies. Wall Street analysts have speculated that business leaders fear retribution from the Trump administration, which has sued media companies, universities and law firms, and instead choose to appeal to the president out of the public spotlight.On Wednesday, Dimon said that he wanted to know more about who is being swept up in ICE raids: \"Are they here legally? Are they criminals? ... Did they break American law?\"\"We need these people,\" Dimon added. \"They work in our hospitals and hotels and restaurants and agriculture, and they're good people .… They should be treated that way.\"'A climate of fear'For years, in annual shareholder letters and media interviews, Dimon has cited an immigration overhaul as one of the main avenues to unlock higher U.S. economic growth.The veteran CEO of JPMorgan, the world's largest bank by market cap, has previously supported a merit-based system for green cards as well as citizenship for people brought to America as children, and pushed back on proposals to limit H-1B visas. On Wednesday, Dimon urged Trump to allow citizenship \"for hardworking people\" and \"proper asylum\" opportunities.\"\"I think he can, because he controlled the borders,\" Dimon said.Later in the wide-ranging interview, The Economist Editor-in-Chief Zanny Minton Beddoes, told Dimon that she was surprised at how careful he and other CEOs were in speaking about Trump.\"You are one of the more outspoken business leaders,\" Beddoes said. \"I'm genuinely struck by the unwillingness of CEOs in America to say anything critical. There is a climate of fear in your country.\"Dimon pushed back, saying that he let his views be known about Trump's tariffs, immigration policies and stance towards European allies. \"I think they should change their approach to immigration,\" Dimon said. \"I've said it. What the hell else do you want me to say?\"watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jamie Dimon issues rare CEO criticism of Trump's immigration policy: 'I don’t like what I’m seeing'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108213164-1760638891942-gettyimages-2241014390-IMF_WORLD_BANK.jpeg?v=1769033067&w=1920&h=1080"
      ],
      "datePublished": "2026-01-21T22:15:47.000Z",
      "dateModified": "2026-01-21T22:15:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tech stocks rally after Trump says a 'framework' Greenland deal has been reached with NATO",
    "url": "https://www.cnbc.com/2026/01/21/trump-tech-stocks-jump-greenland-military.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108254962-1769009080180-gettyimages-2257418605-mms18684_fv2opla8.jpeg?v=1769027820&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-21T21:01:50.000Z",
    "description": "Traders work on the floor of the New York Stock Exchange during morning trading on Jan. 21, 2026.Michael M. Santiago | Getty ImagesTechnology stocks b",
    "body": "Traders work on the floor of the New York Stock Exchange during morning trading on Jan. 21, 2026.Michael M. Santiago | Getty ImagesTechnology stocks bounced on Wednesday after President Donald Trump said the U.S. has reached a \"framework\" for a deal for Greenland with NATO and dialed back his tariff threats on Europe.Trump announced the development in a post to Truth Social and said he would hold back on tariffs planned for Feb. 1 on several European nations. \"This solution, if consummated, will be a great one for the United States of America, and all NATO Nation,\" he wrote. Chip stocks led the tech sector's gain. Intel rallied nearly 12%, while Advanced Micro Devices, Arm Holdings, Western Digital and Micron Technology jumped more than 6% each. Marvell Technology added 3.5%.Stocks surged earlier in the day after Trump ruled out the use of military force in Greenland, easing geopolitical fears that sparked a global sell off earlier in the week. On Tuesday, tech companies had sold off after Trump pledged new tariffs on eight countries that opposed a U.S. acquisition of Greenland as leaders convened in Davos, Switzerland, for the World Economic Forum A potential peace deal between Russia and Ukraine, along with a takeover of Greenland, are among the agenda items for the president and his team while in Switzerland. Elsewhere, Tesla and Nvidia gained about 3%, while Meta Platforms added 1.5%. Amazon, Salesforce and Apple rose slightly.WATCH: President Trump: I won't use force on Greenlandwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tech stocks rally after Trump says a 'framework' Greenland deal has been reached with NATO",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108254962-1769009080180-gettyimages-2257418605-mms18684_fv2opla8.jpeg?v=1769027820&w=1920&h=1080"
      ],
      "datePublished": "2026-01-21T21:01:50.000Z",
      "dateModified": "2026-01-21T21:01:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]