[
  {
    "title": "Olipop CEO: If I had to start over in my career, I’d prioritize this skillset above all others—it’s not AI",
    "url": "https://www.cnbc.com/2025/09/25/olipop-ceo-if-i-had-to-start-over-in-my-career-id-prioritize-these-skills.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203483-1758738696899-gettyimages-2204193628-mar_5767_o9dozs8a_gkgcbit0.jpeg?v=1758738733&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T18:18:02.000Z",
    "description": "If Olipop co-founder and CEO Ben Goodwin had to start his career over from square one, he would not prioritize learning to use artificial intelligence or any other technical skills, he says. For 40-year-old...",
    "body": "<div><div><p>If Olipop co-founder and CEO Ben Goodwin had to start his career over from square one, he would not prioritize learning to use artificial intelligence or any other technical skills, he says. </p><p>For 40-year-old Goodwin, soft skills are the real driver of success and building those would be his first priority.</p><p>\"Things that have been really important for me have been believing in myself, emotional regulation, things like storytelling, getting as good as possible at leading people as quickly as possible,\" says Goodwin, adding that he's been able to supplement his technical skills by hiring the right talent. \"[There are] a billion people who are better at Excel than me.\"</p><p>Goodwin, alongside co-founder David Lester, launched the prebiotic soda brand Olipop in 2018 to offer consumers a \"healthier\" alternative to the many popular sugar-packed drinks on the market. The company <a target=\"_blank\" href=\"https://www.cnbc.com/2023/09/16/how-olipops-founders-turned-100k-investment-into-healthier-soda-brand.html\">made $852,000</a> in gross revenue in its first year of business. Fast-forward to February 2025, Olipop was valued at $1.85 billion after <a target=\"_blank\" href=\"https://www.cnbc.com/2025/02/12/olipop-prebiotic-soda-valued-at-1point85-billion-in-funding-round.html\">raising $50 million</a> in a Series C funding round.</p><p>Though Goodwin also serves as the company's lead formulator, making him hands-on in creating new Olipop flavors, he says empathy, having a clear vision for the brand and connecting with others are the traits and skills he's needed most to help drive the business forward as CEO. </p><p>'When I think of the arc of all the stuff where I actually can provide long-term value … It's just keeping us really locked on target for the vision of the mission, making sure standards are being set correctly, and just providing that connection and leadership glue,\" says Goodwin. \"Almost all of this is interpersonal.\"</p><p>That's why, though <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/04/employers-are-paying-a-premium-for-ai-skills-most-non-tech-jobs.html\">AI-relevant technical skills are in high demand</a> and many employers and business leaders view them as a nonnegotiable as more work becomes automated, those skills are simply not as important for Goodwin, he says.</p><p>\"I actually have been avoiding AI,\" he says. \"I don't need anything else to chip away at my critical thinking skills. I've not been investing in [my own] AI skills.\"</p></div><h2><a></a>\"Soft skills' aren't so soft</h2><div><p>Goodwin isn't the only CEO touting the importance of soft skills — and the reason actually has everything to do with AI. As workplaces become more automated, employers are <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/13/amazon-aws-ceo-the-most-important-skill-you-need-to-succeed-in-ai-age.html\">placing a lot of value on those interpersonal skills</a> that humans can still master far better than any AI programs, according to Amazon Web Services CEO Matt Garman. LinkedIn's <a href=\"https://www.linkedin.com/pulse/linkedin-skills-rise-2025-15-fastest-growing-us-linkedin-news-hy0le/\" target=\"_blank\">\"Skills on the Rise 2025\" report</a> also shows that people skills are becoming <a target=\"_blank\" href=\"https://www.cnbc.com/2025/04/02/the-top-soft-skills-you-need-to-get-hired-in-2025-according-to-linkedin.html\">more in-demand</a> on the job search platform.</p><p>\"You're going to want to be creative. You're going to want to be [good at] critical thinking. And you're going to want to be flexible,\" Garman <a target=\"_blank\" href=\"https://www.cnbc.com/video/2025/08/08/pro-watch-cnbcas-full-interview-with-aws-ceo-matt-garman.html\">told CNBC's \"Closing Bell Overtime\"</a> on Aug. 8. \"I think the ability to learn new things and adapt is going to be just as important as any particular skill that you learn.\"</p><p>You probably already exercise these people skills — empathy, adaptability, critical thinking, networking and leadership — in some capacity at work or in life, and you can strengthen them with some intentional practice and self-awareness, according to experts like leadership strategist Talia Fox. </p><p>For example, the next time you have a conversation with someone, practice active listening and try to ask deep, insightful questions to build emotional intelligence, <a target=\"_blank\" href=\"https://www.cnbc.com/2024/03/22/ex-harvard-fellow-learning-this-soft-skill-can-make-you-a-genius.html\">Fox told CNBC Make It</a> in March 2024.</p><p>You can boost your critical thinking the same way, <a href=\"https://hbr.org/2022/04/critical-thinking-is-about-asking-better-questions\" target=\"_blank\">research shows</a>: Ask thoughtful questions and step out of your comfort zone. Grabbing lunch with a colleague you don't usually speak to or attending a work conference can build adaptability and networking skills.</p><p>Professionals with these qualities are highly desirable in Goodwin's eyes, he said, as they help create an \"energized and inspired workforce.\"</p><p><em><strong>Want to be your own boss?</strong> Sign up for Smarter by CNBC Make It's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue. Sign up today with coupon code EARLYBIRD for an introductory discount of 30% off the regular course price of $127 (plus tax). Offer valid September 16 through September 30, 2025.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/107301782-Make_It_Youtube_Olipop_Still_01.png?v=1694872501&w=750&h=422&vtcrop=y\" alt=\"We built Olipop: A $20 million a month soda company in 5 years\" /><span></span><span><span></span></span></p></div></div>"
  },
  {
    "title": "Trump would eviscerate Fed independence with Lisa Cook firing, her lawyers tell Supreme Court",
    "url": "https://www.cnbc.com/2025/09/25/federal-reserve-lisa-cook-trump-scotus.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108192448-1756477319590-gettyimages-1258906734-SENATE_FED_NOMINATION.jpeg?v=1758828267&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T20:27:09.000Z",
    "description": "Lisa Cook, governor of the US Federal Reserve and governor nominee for US President Joe Biden, during a Senate Banking Committee nomination hearing in Washington, DC, US, on Wednesday, June 21, 2023. Anna...",
    "body": "<div><div><p>Lisa Cook, governor of the US Federal Reserve and governor nominee for US President Joe Biden, during a Senate Banking Committee nomination hearing in Washington, DC, US, on Wednesday, June 21, 2023. </p><p>Anna Rose Layden | Bloomberg | Getty Images</p></div><div><p>Lawyers for <a href=\"https://www.federalreserve.gov/\" target=\"_blank\">Federal Reserve</a> Governor <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/28/trump-fed-lisa-cook-lawsuit-powell.html\">Lisa Cook</a> on Thursday argued that the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/fed-trump-lisa-cook-supreme-court.html\">Supreme Court</a> should reject President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a>'s request that he be allowed to <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/18/trump-supreme-court-lisa-cook-fed.html\">fire her</a> pending the outcome of her lawsuit challenging her removal.</p><p>\"The President's stay application asks this Court to act on an emergency basis to eviscerate the independence of the Federal Reserve Board,\" Cook's lawyers wrote in a new filing with the Supreme Court.</p><p>Trump has asked the Supreme Court to lift lower court orders that block him from firing Cook while her suit plays out.</p><p>The president said in late August that he was firing her because of allegations she committed mortgage fraud by claiming that two separate properties would be her primary residence. She denies those claims of wrongdoing, which relate to properties she owns i<a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/15/no-evidence-of-primary-residence-violation-by-fed-gov-lisa-cook-says-michigan-official.html\">n Ann Arbor, Michigan</a>, and Atlanta.</p><p>Earlier Thursday, a group that included every living former Federal Reserve chair, along with a number of former Treasury secretaries and former chairs of the White House Council of Economic Advisers, urged the Supreme Court to deny Trump's request to fire Cook for now.</p><p>The Supreme Court could at any time rule on Trump's request.</p><p>If the high court allows Trump to remove Cook, it would leave the door open for her to be reinstated once the justices rule on the merits of her lawsuit.</p><p>The key question in Cook's case is whether Trump has legal cause as required by the Federal Reserve Act to fire her.</p><p>In their filing Thursday, Cook's lawyers said that Trump was citing \"flimsy, unproven allegations of pre-office wrongdoing — allegations conveniently timed following the President's criticisms of the Board's policy decisions.\"</p><p>Trump had complained for months that the Fed's board was not cutting interest rates as he wanted. The Fed last week lowered its benchmark overnight lending rate by a quarter percentage point, with Cook participating in that decision.</p><p>\"This Court should deny the President's extraordinary application because his arguments defy established precedent and longstanding practice,\" Cook's lawyers said in their filing.</p><p>\"This litigation has barely begun, and further factfinding could avoid the need for this Court to decide the high-stakes legal issues raised in the President's application,\" her lawyers wrote. \"On the merits, this Court is likely to reject each of the President's legal theories.\"</p><p>\"Specifically, the Court is likely to hold that because Governor Cook is removable only for cause, she is entitled to notice, opportunity for a hearing, and judicial review before she is removed.\"</p><p>The lawyers wrote that the Supreme Court is \"likely\" to ultimately ruled that the \"for cause\" standard provided by the Federal Reserve Act is meaningful protection for a Fed governor, \"and is not satisfied by manufactured charges based on conduct that pre-dates her service on the Board.\"</p><p>\"The bottom line is this: Contrary to the President's boundless assertion of authority, there must be some meaningful check on the President's ability to remove Governor Cook,\" the lawyers wrote. \"Otherwise, any president could remove any governor based on any charge of wrongdoing, however flawed. That regime is not what Congress envisioned when it protected the Federal Reserve Board from presidential control.\"</p></div></div>"
  },
  {
    "title": "Taylor Swift music producer Jack Antonoff slams Live Nation CEO claims of ‘underpriced’ concert tickets",
    "url": "https://www.cnbc.com/2025/09/25/antonoff-slams-live-nation-ceos-underpriced-concert-claim.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204164-1758831676405-108204164-1758831586585-gettyimages-2229631462-dsc_7969_ejz8uwix.jpeg?v=1758831690&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T20:47:37.000Z",
    "description": "Jack Antonoff speaks on stage at \"Up Close & Personal\" In My Studio With…Jack Antonoff at The Village Recording Studio on Aug. 11, 2025 in Los Angeles, California.Unique Nicole | Getty ImagesAcclaimed...",
    "body": "<div><div><p>Jack Antonoff speaks on stage at \"Up Close & Personal\" In My Studio With…Jack Antonoff at The Village Recording Studio on Aug. 11, 2025 in Los Angeles, California.</p><p>Unique Nicole | Getty Images</p></div><div><p>Acclaimed music producer Jack Antonoff is rejecting claims by <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/LYV/\">Live Nation Entertainment</a><span><span></span></span></span> CEO Michael Rapino that concert tickets are still \"underpriced.\"</p><p>The CEO's comments came at the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/17/live-nation-ceo-demand-concert-tickets-underpriced.html\">CNBC Sport and Boardroom Game Plan</a> conference last week, when he said, \"In sports, I joke it's like a badge of honor to spend [$70,000] for Knicks courtside. ... When you read about the ticket prices going up, it's still an average concert price [of] $72. Try going to a Laker game for that, and there's 80 of them [in a season].\"</p><p>Antonoff responded to those comments in a <a href=\"https://x.com/jackantonoff/status/1971228531205296274\" target=\"_blank\">post on X</a> Thursday saying, \"this really breaks my heart and is a sick way of looking at.\"</p><p>\"Answer is simple: Selling a ticket for more than its face value should be illegal,\" he <a href=\"https://x.com/jackantonoff/status/1971228912756851016\" target=\"_blank\">wrote</a>. \"Then there is no chaos, and you give us back the control instead of creating a bizarre free market of confusion amongst the audience who we love and care for.\"</p><p>Antonoff, famous for working with superstar Taylor Swift, also pointed to <a target=\"_blank\" href=\"https://www.cnbc.com/2025/01/31/funflation-concert-ticket-prices-soar-but-music-fans-dont-care.html\">ticket resellers allegedly hiking prices</a> on the Live Nation site. He went on to say his team tries to find \"new ideas\" to get around things like dynamic pricing to make concerts more affordable for fans.</p><p>\"It could all be so easy if the people up top didn't see the audience as a faceless group to extort money from,\" Antonoff <a href=\"https://x.com/jackantonoff/status/1971229381852053763\" target=\"_blank\">wrote</a>.</p><p>Rapino's comments at the Game Plan conference came just days before the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/18/ftc-ticketmaster-live-nation-ticket-resales.html\">Federal Trade Commission sued Live Nation</a> and its subsidiary Ticketmaster for what it called \"illegal\" ticket resale tactics. In the filing, the FTC explained that the companies \"tacitly worked\" with scalpers that enabled them to \"unlawfully purchase\" tickets to increase profits.</p><p>″[Ticketmaster and Live Nation's] illegal conduct frustrates artists' desire to maintain affordable ticket prices that fit the needs of ordinary American families, costing ordinary fans millions of dollars every year,\" the lawsuit read.</p><p>Live Nation did not immediately respond to a request for comment Thursday.</p><p>Live Nation is also being sued by the <a target=\"_blank\" href=\"https://www.cnbc.com/2024/05/23/justice-department-sues-live-nation-ticketmaster.html\">U.S. Department of Justice</a> to break up the company over alleged antitrust violation.</p><p>\"We allege that Live Nation relies on unlawful, anticompetitive conduct to exercise its monopolistic control over the live events industry in the United States at the cost of fans, artists, smaller promoters, and venue operators,\" said Attorney General Merrick Garland in a May 2024 statement announcing the lawsuit.</p></div></div>"
  },
  {
    "title": "35-year-old tech worker turned baking hobby into 'cake picnic' that's attracted thousands",
    "url": "https://www.cnbc.com/2025/09/25/35-year-old-tech-worker-turned-baking-hobby-into-cake-picnic-thats-attracted-thousands.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203008-1758659094610-elisa_sunga.jpg?v=1758659212&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T13:31:31.000Z",
    "description": "Elisa Sunga picked up baking five years ago; now, she hosts a touring cake festival that's attracted thousands of bakers from around the world.By day Elisa Sunga, 35, is a senior UX program manager for...",
    "body": "<div><div><p>Elisa Sunga picked up baking five years ago; now, she hosts a touring cake festival that's attracted thousands of bakers from around the world.</p><p>By day Elisa Sunga, 35, is a senior UX program manager for Google. Five years ago, like many people, Sunga took up baking during the pandemic \"and just fell in love with it,\" she tells CNBC Make It.</p><p>Then, about a year ago, her sweet tooth got the best of her: \"I really wanted to eat a lot of cake, to be honest,\" she says. \"But at the same time, I didn't want to bake all of the cake, and so I thought to myself, 'What if I just created an event, and the requirement was everyone coming needed to bring a whole cake?'\"</p><p>Thus began her idea of Cake Picnic, where the main rule is \"no cake, no entry.\"</p><p>Sunga initially posted her plans for an informal cake gathering on Instagram thinking 15 people would show up.</p><p>As it turns out, a lot more people wanted in on the sweet chaos. \"Every time I would refresh the RSVP page,\" Sunga says, \"it would just be up 50, 100, 150, 200. It capped at 300.\"</p><p>In April 2024, she hosted her first Cake Picnic event in San Francisco with 183 cakes.</p></div><div><p>Cake Picnic is the brainchild of Elisa Sunga, a San Francisco tech worker who picked up baking during the pandemic and wanted to throw an event for fellow dessert enthusiasts.</p><p>Anadolu | Getty Images</p></div><div><p>Throughout the year, Sunga took Cake Picnic on tour to Los Angeles and New York before hosting a second San Francisco stop in the fall. Things really took off during a March 2025 event, where people brought and tasted over 1,300 cakes at San Francisco's Legion of Honor.</p><p>Cake Picnic's Instagram page went from 20,000 followers to over 100,000 within a day, Sunga says.</p><p>\"It literally changed the Cake Picnic game,\" she says.</p></div><h2><a></a>Why people are drawn to Cake Picnic</h2><div><p>What motivates hundreds of people at a time to bake an entire cake to share with strangers at a park?</p><p>Sunga points to the unique experience, for one. \"It's the opportunity to just see hundreds of cakes at one time, where you have the opportunity to eat a matcha cake, a raspberry cake, an ube cake, a chocolate cake, all in the span of three minutes,\" she says. \"When do you ever really get a cake buffet experience like that?\"</p><p>Events also bring together the baking community, Sunga adds, from beginners to pastry chefs. \"No matter what skills you have, we are all truly just here because we love cake,\" she says.</p></div><div><p>1,387 cakes counted during the massive cake picnic at the Legion Of Honor as hundreds of people attended in San Francisco, California, United States on March 29, 2025.</p><p>Anadolu | Getty Images</p></div><div><p>Gatherings are a source of inspiration where bakers see how other experiment with flavors and designs.</p><p>Then, there's the joy of it all. \"You are attending this event because you love cake, you probably bake, you choose happiness and joy and delightful things,\" Sunga says. \"So the people that come to Cake Picnic are like friends of your heart.\"</p></div><h2><a></a>Keeping up with a growing passion project</h2><div><p>Sunga works on Cake Picnic a few hours each week on nights and weekends, with hours swelling in the weeks leading up to an event date. The project's team consists of Sunga's partner and co-founder, Danny Knight, and a network of friends and collaborators across the U.S.</p><p>Cake Picnic also relies on volunteers in each tour city to bring events to life on the day-of.</p><p>Sunga says managing a sprawling team has helped her practice communication, leadership and delegation skills. \"Ultimately, I think that it's just so fun that our project is cake\" and so \"I don't mind working on it 6 to 9 p.m. every day.\"</p><p>Sunga aims to standardize event tickets to $30 across all tour stops in order to pay herself and Knight for the time they spend on the project (she declined to share how much she and Knight draw from sales). They're also getting to the point of bringing in some profit, Sunga says, which she wants to invest back into the cake community like by commissioning artists to create pieces for events.</p><p>At this time, Sunga has no plans of making Cake Picnic her full-time job but hopes to grow a team to be able to manage it globally.</p><p>Leaning into the project full-time would change her relationship to the joy it brings her, she says.</p><p>\"Initially, I started Cake Picnic because I wanted to eat cakes, and I wanted to meet baker friends,\" Sunga says. \"I think that if I did it full time, that would change how I feel about the event. Like, rather than being excited about eating cake and meeting friends, it would be focused on, like, how do I grow this thing?\"</p><p>Plus, she adds, she likes her job at Google, where she works on community and learning initiatives, which \"keeps me happy.\"</p></div><div><p>Cake Picnic is a gathering for the love of cake and celebrates cake in all of its forms as brings communities and friends together for the sole purpose of breaking cake and enjoying the following butter and sugar highs. </p><p>Anadolu | Getty Images</p></div><h2><a></a>'It's such an honor for me'</h2><div><p>So far, Cake Picnic has hosted seven events featuring over 3,500 cakes. It held its first international picnic in London in July, where guests brought over 400 cakes.</p><p>Tickets for the next event on Saturday in LA sold out in seconds, Sunga says, and resulted in a 11,000-person wait list.</p><p>Attendees have come from out-of-state and countries around the world like Malaysia, Singapore, South Africa, Kuwait, Spain and Ireland, to name a few.</p><p>The project will head to Minneapolis, San Francisco and New York later in the fall.</p><p>Cake Picnic's rapid growth continues to be \"pretty mind-boggling,\"<strong> </strong>Sunga says. \"It's such an honor for me. We have so many options of what we could be doing with our time. There's concerts, there's dinners, there's brunches, there's rotting time at home. And it's such an honor that people are like, 'I'm gonna come to Cake Picnic.'\"</p><p><em><strong>Want to be your own boss?</strong> Sign up for Smarter by CNBC Make It's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue. Sign up today with coupon code EARLYBIRD for an introductory discount of 30% off the regular course price of $127 (plus tax). Offer valid September 16 through September 30, 2025.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108188518-250730-mg-08-mm-wichmann-lisbon_D_clean.png?v=1755696335&w=750&h=422&vtcrop=y\" alt=\"I left the U.S. for Lisbon – and work only 20 hours a week\" /><span></span><span><span></span></span></p></div></div>"
  },
  {
    "title": "Trump approves TikTok deal through executive order, Vance says business valued at $14 billion",
    "url": "https://www.cnbc.com/2025/09/25/trump-approves-tiktok-deal-through-executive-order.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108095552-1738332765318-gettyimages-2196222817-AA_31012025_2059678.jpeg?v=1758745693&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T21:02:19.000Z",
    "description": "Muhammed Selim Korkutata | Anadolu | Getty ImagesPresident Donald Trump on Thursday signed an executive order approving a proposal that would keep TikTok alive in the U.S. in a transaction that Vice President...",
    "body": "<div><div><p>Muhammed Selim Korkutata | Anadolu | Getty Images</p></div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">President Donald Trump</a> on Thursday signed an executive order approving a proposal that would keep TikTok alive in the U.S. in a transaction that Vice President JD Vance said values the business at $14 billion.</p><p>The deal satisfies the requirements of a national security law requiring China-based ByteDance to sell TikTok's U.S. operations or face an effective ban in the country, according to the executive order. Under the terms, which China must still approve, a new joint-venture company will oversee TikTok's U.S. business, with ByteDance retaining less than a 20% stake.</p><p>Enterprise tech giant <a target=\"_blank\" href=\"https://www.cnbc.com/quotes/ORCL/\">Oracle</a>, Silver Lake and the Abu Dhabi-based MGX investment fund will be main investors in TikTok's U.S. business, controlling a roughly 45% stake in the entity, while ByteDance investors and new holders will own 35%, CNBC's David Faber <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/oracle-silver-lake-mgx-tiktok.html\">reported</a> earlier Thursday. </p><p>No representatives from ByteDance were present at the signing, and the company hasn't acknowledged that a transaction is taking place. No purchase price was mentioned, and there's no indication that the Chinese government has made changes to laws that would be necessary for a deal to take place.</p><p>President Trump said Chinese President Xi Jinping gave the deal the go ahead. Vance said the Chinese government put up some resistance before the agreement.</p><p>Under the planned arrangement, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/ORCL/\">Oracle</a><span><span></span></span></span> will oversee the app's security operations and continue providing cloud computing services for the new TikTok U.S. firm, Faber reported, citing sources familiar with the deal. Trump said Oracle CEO <a target=\"_blank\" href=\"https://www.cnbc.com/larry-ellison/\">Larry Ellison</a> is involved in the ownership group and that his company is \"playing a very big part.\"</p><p>\"It's owned by Americans, and very sophisticated Americans,\" Trump said at the signing. \"This is going to be American operated all the way.\"</p><p>ByteDance investors like General Atlantic, Susquehanna and Sequoia, are expected to contribute equity in the new TikTok U.S. entity, sources told Faber. ByteDance was reportedly <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/27/tiktok-owner-bytedance-sets-valuation-at-over-330-billion.html\">valued</a> at $330 billion last month. Analysts have <a target=\"_blank\" href=\"https://www.cnbc.com/2025/01/15/tiktoks-us-unit-could-be-worth-as-much-as-50-billion-in-a-sale.html\">previously estimated</a> TikTok's U.S. operations could be worth between $30 billion to $35 billion.</p><p>The deal does not involve the federal government taking an equity stake or a so-called golden share in TikTok's U.S. operations, CNBC <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/tiktok-golden-share-equity-trump.html\">reported</a> Monday.</p><p>Trump said over the weekend that conservative media baron <a href=\"https://www.nbcnews.com/business/media/trump-murdoch-epstein-lawsuit-deposition-rcna221547\" target=\"_blank\">Rupert Murdoch</a> and his son Lachlan Murdoch could be involved in the TikTok deal as well as Ellison and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/DELL/\">Dell Technologies</a><span><span></span></span></span> CEO <a target=\"_blank\" href=\"https://www.cnbc.com/michael-dell/\">Michael Dell</a>.</p><p>The president last week signed an executive order that <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/16/trump-extends-tiktok-deadline-framework-deal-china.html\">extended</a> ByteDance's deadline to divest TikTok's U.S. operations or be subject to a national security law originally <a target=\"_blank\" href=\"https://www.cnbc.com/2025/04/01/tiktok-creators-partners-remain-optimistic-ahead-of-apps-ban-deadline.html\">signed</a> by former President Joe Biden. </p><p>The order prevents the Department of Justice from enforcing the <a target=\"_blank\" href=\"https://www.cnbc.com/2024/12/16/tiktok-asks-supreme-court-to-block-us-ban-pending-appeal.html\">national security law</a> until Dec. 16. That law would penalize app store operators like <a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AAPL/\">Apple</a> and <a target=\"_blank\" href=\"https://www.cnbc.com/quotes/GOOGL/\">Google</a> and internet service providers for providing services to TikTok's U.S. operations.</p><p><strong>WATCH</strong>: <a target=\"_blank\" href=\"https://www.cnbc.com/video/2025/09/24/white-house-press-secretary-says-trump-will-sign-tiktok-deal-thursday.html\">White House Press Secretary says Trump will sign TikTok deal</a>.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108203503-17587408381758740836-41799538845-1080pnbcnews.jpg?v=1758740837&w=750&h=422&vtcrop=y\" alt=\"White House Press Secretary says Trump will sign TikTok deal Thursday\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div></div>"
  },
  {
    "title": "One of the last paths to student loan forgiveness under Trump — the IBR plan — is in trouble",
    "url": "https://www.cnbc.com/2025/09/25/student-loan-forgiveness-income-based-repayment-plan.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108172791-1752680574442-gettyimages-2222594238-2222594238.jpeg?v=1758741609&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T12:57:35.000Z",
    "description": "Workers leave the Department of Education building during a rain shower in Washington, D.C., on Wednesday, May 21, 2025.Wesley Lapointe | The Washington Post | Getty ImagesRecent changes to the federal...",
    "body": "<div><div><p>Workers leave the Department of Education building during a rain shower in Washington, D.C., on Wednesday, May 21, 2025.</p><p>Wesley Lapointe | The Washington Post | Getty Images</p></div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/30/public-service-loan-forgiveness-pslf-becomes-harder-for-borrowers.html?msockid=2eef7e9809066c2415d868c3081f6df4\">Recent changes</a> to the <a target=\"_blank\" href=\"https://www.cnbc.com/student-loans/\">federal student loan system</a> have left many borrowers with <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/28/student-loan-repayment-plan-changes.html\">fewer repayment options</a>. But even one of the remaining plans — known as the <a href=\"https://studentaid.gov/help-center/answers/article/ibr-plan\" target=\"_blank\">Income-Based Repayment plan</a>, or IBR — is proving hard to access.</p><p>\"Applications are being rejected without clear or logical explanations,\" said Carolina Rodriguez, director of the Education Debt Consumer Assistance Program. Rodriguez and her team members work with clients with student loans.</p><p>\"These ongoing delays continue to erode public trust in the student loan system and are likely to worsen the delinquency and default rates we're already seeing,\" Rodriguez said.</p><p>IBR will be one of only a few repayment options left to many borrowers after recent court actions and the passage by Congress of President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a>'s \"<a target=\"_blank\" href=\"https://www.cnbc.com/guide/what-trumps-one-big-beautiful-bill-means-for-your-money/\">big beautiful bill</a>.\" That legislation phases out several existing student loan repayment plans.</p><p>Here's what student loan borrowers need to know about the challenges with IBR.</p></div><h2><a></a>IBR debt forgiveness is still frozen</h2><div><p>Over the summer, the U.S. Department of Education announced that it would temporarily stop forgiving the debt of borrowers enrolled in IBR. According to the plan's terms, IBR concludes in debt erasure after 20 years or 25 years of payments, depending on the age of a borrower's loans.</p><p>The Education Department told CNBC in July that it paused loan forgiveness under IBR while it responds to recent court actions involving the Biden administration-era SAVE, or Saving on a Valuable Education, plan.</p><p>The department said that the 8th U.S. Circuit Court of Appeals <a target=\"_blank\" href=\"https://www.cnbc.com/2025/02/18/us-appeals-court-blocks-biden-save-plan-for-student-loans.html\">decision</a> in February, which blocked the SAVE plan, had other impacts on student loan repayment. For example, under the rule involving SAVE, certain periods during which borrowers postponed their payments would count toward their forgiveness timeline. With SAVE blocked now, borrowers no longer get credit during those forbearances.</p><p><strong>More from Personal Finance:</strong><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/11/social-security-cola-cost-of-living-adjustment-may-be-higher-in-2026-estimates.html\">Social Security cost-of-living adjustment may be slightly higher in 2026</a><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/10/no-tax-on-tips-deduction-who-qualifies.html\">Some jobs may not qualify for the 'no tax on tips' policy</a><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/10/trump-student-loan-risks.html\">Trump administration to warn families about student debt risks</a></p><p>\"The Department has temporarily paused discharges for IBR borrowers in order to correctly count loan forgiveness amounts under a court injunction regarding the Biden Administration's illegal SAVE repayment plan,\" said Ellen Keast, deputy press secretary at the Education Department.</p><p>\"For any borrower that makes a payment after they became eligible for forgiveness, the Department will refund overpayments when the discharges resume,\" Keast said.</p><p>Earlier this month, the department wrote on its website that the system changes to IBR could take until \"<a href=\"https://studentaid.gov/announcements-events/big-updates\" target=\"_blank\">winter 2025</a>.\"</p><p>\"More than enough time has passed for the Department to fix whatever issues were supposedly affecting IBR forgiveness,\" said higher education expert Mark Kantrowitz. \"That suggests the holdup is intentional.\"</p><p>The pause puts many student loan borrowers who've been in repayment for decades and are now eligible for forgiveness in an especially frustrating bind, Kantrowitz said. IBR is the only income-driven repayment plan still available that leads to loan erasure, he said.</p></div><h2><a></a>Wrongful IBR denials</h2><div><p>When lawmakers <a href=\"https://www.nasfaa.org/uploads/documents/Federal_Student_Aid_Change_OB3.pdf\" target=\"_blank\">phased out several student loan repayment plans</a> over the summer in the <a href=\"https://www.congress.gov/bill/119th-congress/house-bill/1/text\" target=\"_blank\">One Big Beautiful Bill Act</a>, they made a change to IBR aimed at expanding people's eligibility for the program. Experts say that's likely because many borrowers would need access to the plan after the other options became defunct or are set to expire.</p><p>The change eliminated the former requirement that borrowers prove a partial financial hardship to qualify for IBR. In the past, borrowers needed to show, based on their income, that their monthly IBR payment would be less than their bill on the department's standard plan.</p><p>However, \"borrowers are still being rejected due to their income,\" said Elaine Rubin, director of corporate communications at Edvisors.</p><p>Kantrowitz said the same: \"I've heard that some borrowers were denied IBR even though the change was supposed to be effective upon enactment on July 4, 2025.\"</p></div><div><p>There are similar accounts in the American Federation of Teacher's <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.278527/gov.uscourts.dcd.278527.41.0.pdf\" target=\"_blank\">lawsuit</a> against the U.S. Department of Education. The union, which represents some 2 million members, has said the Trump administration is depriving borrowers of their rights.</p><p>One plaintiff, who owes approximately $252,659 in federal student loan debt, has been paying for over 25 years, according to a September court filing in the AFT legal challenge. The woman applied for IBR in July but said that she was denied in August \"on the grounds that she does not have a 'partial financial hardship,' which has not been a requirement for the IBR plan since the enactment of the One Big Beautiful Bill Act,\" the AFT said.</p><p>\"The Department therefore improperly denied her access to a payment plan for which she is eligible and is withholding loan cancellation,\" the union said.</p></div></div>"
  },
  {
    "title": "Health providers could lose $32 billion if ACA credits at center of shutdown fight expire",
    "url": "https://www.cnbc.com/2025/09/25/health-aca-obamacare-federal-government-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204051-1758822211872-gettyimages-2235234083-ah707090.jpeg?v=1758822295&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T19:54:04.000Z",
    "description": "Senate Minority Leader Chuck Schumer (D-NY) speaks at a press conference with other Senate Democrats encouraging the passage of Affordable Care Act tax credits, in Washington, DC on September 16, 2025. Nathan...",
    "body": "<div><div><p>Senate Minority Leader Chuck Schumer (D-NY) speaks at a press conference with other Senate Democrats encouraging the passage of Affordable Care Act tax credits, in Washington, DC on September 16, 2025. </p><p>Nathan Posner | Anadolu | Getty Images</p></div><div><p>Health-care providers could lose more than $32 billion in revenue if<a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/10/aca-enhanced-subsidies-expire-obamacare-premiums-rise.html\"> the Affordable Care Act</a>'s enhanced premium tax credits expire this year, as they are on track to do, according to <a href=\"https://www.rwjf.org/en/insights/our-research/2025/09/how-expiration-of-aca-tax-credits-will-affect-healthcare-spending.html\" target=\"_blank\">an analysis released Thursday.</a></p><p>The lapse in Obamacare subsidies could also lead to an additional $7.7 billion in unpaid medical bills from uninsured patients, the analysis by the <a href=\"https://www.rwjf.org/en/insights/our-research/2025/09/how-expiration-of-aca-tax-credits-will-affect-healthcare-spending.html\" target=\"_blank\">Robert Wood Johnson Foundation</a> and Urban Institute found.</p><p>\"The burden of this increase in uncompensated care would fall on all provider types: about $2.2 billion on hospitals, $1.0 billion on physician offices, $1.5 billion on prescription drugs, and $3.1 billion on other services,\" the report said.</p><p>The subsidies — which help lower the cost of health insurance plans purchased on ACA marketplaces — are at the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-healthcare-government-shutdown-congress.html\">center of the current federal government funding stalemate</a>.</p><p>Democrats demand that any stopgap measure to keep the government open beyond next Tuesday include an extension of the enhanced credits. Those credits will expire at the end of this year without congressional intervention.</p><p>\"The negative effects of allowing these tax credits to expire couldn't be more stark,\" said Katherine Hempstead, senior policy adviser at the Robert Wood Johnson Foundation. </p><p>\"Millions of people will lose coverage, and providers will face the one-two punch of losing revenue and increasing uncompensated care. Healthcare institutions are often the economic engines of entire communities. If the credits expire, the ripple effects will be felt for years to come,\" Hempstead said.</p></div><div><h2>Read more CNBC politics coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/curtis-sliwa-new-york-mayor-trump-mamdani-cuomo.html\">New York City mayor candidate Curtis Sliwa says he was offered money to quit race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/elizabeth-warren-trump-rolex-tennis-invite-apple-nvidia.html\">Trump's tennis invite from Rolex echoes Apple, Nvidia playbook for currying favor, Warren says</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/ice-shooting-dallas-noem.html\">2 dead in Dallas ICE shooting, including suspect; FBI eyes ideological motive</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-un-ga-speech.html\">Trump UN escalator snafu: White House wants investigation of sudden stop</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-democrats-shutdown-schumer-jeffries.html\">Trump cancels meeting with top Democrats as government shutdown looms</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/europes-work-life-balance-could-be-key-in-trumps-h-1b-visa-shake-up.html\">Europe's work-life balance a key talent draw as Trump revamps H-1B visa</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-xi-meeting-likely-to-happen-early-next-year-says-ambassador.html\">Trump-Xi meeting likely to happen next year, says U.S. ambassador to China</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/trump-schumer-jeffries-government-funding-.html\">Trump to meet top Dems as their health care demands fuel government shutdown risk</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/trump-ftc-supreme-court-slaughter.html\">Supreme Court lets Trump fire FTC's Slaughter for now</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/jimmy-kimmel-abc-sacramento-shooting-epstein-kirk.html\">Jimmy Kimmel suspension, Trump book, Epstein note eyed in ABC affiliate shooting</a></li></ul></div></div><div><p>Democrats warn that if the subsidies disappear, the effects on Americans would be widespread.</p><p>Average premiums could rise by about 75% for millions of Americans if the subsidies go away, according to <a href=\"https://www.kff.org/from-drew-altman\" target=\"_blank\">KFF</a>, a nonpartisan health policy research group. </p><p>\"If these subsidies expire, it will be important for federal, state, and local policymakers to consider the potential adverse effects on healthcare access and affordability, as well as revenue losses for providers of all types,\" said Fred Blavin, principal research associate at the Urban Institute.</p><p>Republicans have said that they are open to discussing extending the subsidies. </p><p>But they do not want to include such negotiations in government funding talks.</p><p>\"[That is] a December policy debate and decision, not a September funding matter,\" House Speaker Mike Johnson said last week on <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/17/government-shutdown-trump-health-care.html\">CNBC's \"Squawk Box</a>.\"</p></div></div>"
  },
  {
    "title": "Offshore driller Transocean plunges after offering shares at a discount",
    "url": "https://www.cnbc.com/2025/09/25/offshore-driller-transocean-plunges-after-offering-shares-at-a-discount.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203756-1758800719584-gettyimages-2183690223-AA_12112024_1941453.jpeg?v=1758800744&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T13:39:42.000Z",
    "description": "Transocean Barents, an oil platform passes through Canakkale Strait as vessel traffic suspended in both directions in Canakkale, Turkiye on November 12, 2024. Enishan Keskin | Anadolu | Getty ImagesShares of...",
    "body": "<div><div><p>Transocean Barents, an oil platform passes through Canakkale Strait as vessel traffic suspended in both directions in Canakkale, Turkiye on November 12, 2024. </p><p>Enishan Keskin | Anadolu | Getty Images</p></div><div><p>Shares of <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/RIG/\">Transocean</a><span><span></span></span></span> plunged Thursday after the offshore driller <a href=\"https://www.deepwater.com/news/detail?ID=29651\" target=\"_blank\">announced</a> the sale of a large number of shares at a discount.</p><p>Transocean is planning to sell 125 million shares at a price of $3.05, significantly lower than Wednesday's close of $3.64. It is offering 25 million shares more than it originally planned.</p><p>The Swiss company's stock was last down about 14%. The offering is expected to close on Friday.</p><p>Transocean expects to book about $381 million from the sale. It will use the proceeds to pay off debt.</p><p><em>(Correction: Updates with correct share offering price.)</em></p></div></div>"
  },
  {
    "title": "Democrats dig in on health care demands with government shutdown days away",
    "url": "https://www.cnbc.com/2025/09/25/trump-healthcare-government-shutdown-congress.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203846-1758809140936-gettyimages-2236784404-jeffries_BC_143_092425JPG.jpeg?v=1758809166&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T17:31:51.000Z",
    "description": "House Minority Leader Hakeem Jeffries, D-N.Y., holds a news conference on the government funding deadline in the Will Rogers Corridor in the U.S. Capitol on Thursday, September 24, 2025. Bill Clark | Cq-roll...",
    "body": "<div><div><p>House Minority Leader Hakeem Jeffries, D-N.Y., holds a news conference on the government funding deadline in the Will Rogers Corridor in the U.S. Capitol on Thursday, September 24, 2025. </p><p>Bill Clark | Cq-roll Call, Inc. | Getty Images</p></div><div><p>Congressional Democrats are digging in on their demands to protect Obamacare <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/10/aca-enhanced-subsidies-expire-obamacare-premiums-rise.html\">health insurance subsidies</a> with just days to go before the federal <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/21/trump-schumer-government-shutdown-funding-.html\">government</a> risks shutting down if Republicans do not agree to that ask.</p><p> Congress is set to return to Capitol Hill on Monday, giving lawmakers just two days to reach a deal that will keep the government from shutting down starting Wednesday.</p><p>Republicans are demanding that Senate Democrats help them pass a stopgap bill that squeaked through the House last week. Any such bill would require 60 votes to be adopted.</p><p>Top Democrats insist that any short-term funding bill include protections for health-care programs, including the extension of <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/10/aca-enhanced-subsidies-expire-obamacare-premiums-rise.html\">Affordable Care Act</a> enhanced tax credits.</p><p>Those credits help people lower the cost of health insurance plans purchased on Obamacare marketplaces.</p><p>House Minority Leader Hakeem Jeffries, D-N.Y., warned Wednesday that \"any agreement\" on health care in budget talks \"has to be ironclad and in legislation.\"</p><p>\"There's no trust that exists between House Democrats and House Republicans at this particular point in time, given the fact that they've consistently tried to undermine bipartisan agreements that they themselves have reached,\" Jeffries said at a news conference.</p><p>\"We have to have a conversation with Republicans in order to work toward decisively resolving the health care crisis that they've created,\" Jeffries said. </p><p>\"And part of that health care crisis relates to the Republican refusal to extend the Affordable Care Act tax credits.\" </p><p>Democrats brushed off a warning from the White House's Office of Management and Budget that federal agencies should <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-government-shutdown-layoffs-omb.html\">prepare for mass firings</a> if a funding agreement is not struck.</p><p>Jeffries called OMB Director Russ Vought, a \"malignant political hack.\"</p><p>\"We will not be intimidated by your threat to engage in mass firings,\" Jeffries <a href=\"https://x.com/RepJeffries/status/1971041739948556371\" target=\"_blank\">wrote on X</a>. \"Get lost.\"</p><p>Republicans have balked at Democrats' health-care demands. </p><p>Senate Majority Leader John Thune, R-S.D., in a CNN interview Wednesday, called them \"unreasonable and unserious.\"</p></div><div><h2>Read more CNBC politics coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/curtis-sliwa-new-york-mayor-trump-mamdani-cuomo.html\">New York City mayor candidate Curtis Sliwa says he was offered money to quit race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/elizabeth-warren-trump-rolex-tennis-invite-apple-nvidia.html\">Trump's tennis invite from Rolex echoes Apple, Nvidia playbook for currying favor, Warren says</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/ice-shooting-dallas-noem.html\">2 dead in Dallas ICE shooting, including suspect; FBI eyes ideological motive</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-un-ga-speech.html\">Trump UN escalator snafu: White House wants investigation of sudden stop</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-democrats-shutdown-schumer-jeffries.html\">Trump cancels meeting with top Democrats as government shutdown looms</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/europes-work-life-balance-could-be-key-in-trumps-h-1b-visa-shake-up.html\">Europe's work-life balance a key talent draw as Trump revamps H-1B visa</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-xi-meeting-likely-to-happen-early-next-year-says-ambassador.html\">Trump-Xi meeting likely to happen next year, says U.S. ambassador to China</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/trump-schumer-jeffries-government-funding-.html\">Trump to meet top Dems as their health care demands fuel government shutdown risk</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/trump-ftc-supreme-court-slaughter.html\">Supreme Court lets Trump fire FTC's Slaughter for now</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/jimmy-kimmel-abc-sacramento-shooting-epstein-kirk.html\">Jimmy Kimmel suspension, Trump book, Epstein note eyed in ABC affiliate shooting</a></li></ul></div></div><div><p>Senate Minority Leader Chuck Schumer, D-N.Y., responded to Thune on X: \"What's 'unserious' is ignoring the 93% spike for health insurance coming to Americans on November 1.\"</p><p>\"Democrats are fighting to lower prices, while Republicans are failing families,\" Schumer <a href=\"https://x.com/SenSchumer/status/1970940161526755567\" target=\"_blank\">said</a>.</p><p>Jeffries and Schumer sought a meeting with President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> on their dispute. But Trump on Tuesday <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-democrats-shutdown-schumer-jeffries.html\">canceled that meeting</a>, escalating the chances of a <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-government-shutdown-layoffs-omb.html\">shutdown</a> next week.</p><p>Trump said he had \"decided that no meeting with their Congressional Leaders could possibly be productive.\"</p><p>Jeffries shot back.</p><p>\"Donald Trump wakes up Tuesday morning and goes on an unhinged rant and cancels the meeting,\" Jeffries said. \"Why? Because he doesn't want to discuss the Republican healthcare crisis, and they've decided to shut the government down.\"</p><p>Democrats are betting that Republicans — who hold the White House and narrow majorities in both chambers of Congress — will be blamed for a shutdown.</p><p>And with the 2026 midterm elections just over a year away, they believe voters will punish Republicans if the Obamacare subsidies go away.</p><p>If those tax credits lapse, average premiums could soar by about 75% for millions of Americans, <a href=\"https://www.kff.org/from-drew-altman/explaining-the-muddle-on-aca-tax-credits/\" target=\"_blank\">according</a> to KFF, a nonpartisan health policy research group.</p><p>Republicans, for their part, have said they are open to discussions on extending the subsidies — just not right now.</p><p>\"[That's] a December policy debate and decision, not a September funding matter,\" House Speaker Mike Johnson, R-La., said on <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/17/government-shutdown-trump-health-care.html\">CNBC's \"Squawk Box\" last week.</a></p><p>Republicans are pushing for a \"clean\" stopgap funding bill without policy additions.</p><p>Senate Republicans, with a narrow majority, need a handful of Democrats to vote with them to pass any legislation to keep the government open.</p><p>One major question underpinning talks is whether Senate Democrats — including Schumer — ultimately cave and vote with Republicans to keep the government open, as a number did in March.</p><p>At that time, Schumer voted with Republicans to keep the government open, drawing sharp pushback from the progressive wing of his party.</p><p>At least one Democratic senator, <a href=\"https://x.com/SenFettermanPA/status/1969093539771359514\" target=\"_blank\">John Fetterman</a> of Pennsylvania, has expressed opposition to Democrats' current shutdown strategy.</p></div></div>"
  },
  {
    "title": "Global casting call for top traders: From TV weatherman to dentist, FundSeeder finds hidden talent",
    "url": "https://www.cnbc.com/2025/09/25/global-casting-call-for-top-traders-from-tv-weatherman-to-dentist-fundseeder-finds-hidden-talent.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107375079-1708119566150-gettyimages-1465618017-dsc01776copy.jpeg?v=1744042605&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T17:29:50.000Z",
    "description": "Champpixs | Istock | Getty ImagesBrian Lovern started his career pointing at storm systems on a green screen as a local TV weatherman in western Kentucky. More than two decades later, he was staring at...",
    "body": "<div><div><p>Champpixs | Istock | Getty Images</p></div><div><p>Brian Lovern started his career pointing at storm systems on a green screen as a local TV weatherman in western Kentucky. More than two decades later, he was staring at natural-gas price charts, turning forecasts into profits, producing annual returns upwards of 100%.</p><p>Lovern, 49, had made the unusual jump from broadcast meteorology to Wall Street, working on weather desks at hedge funds and investment banks. But trading wasn't part of the job.</p><p>\"On the trade floors, in most cases, that's not going to happen,\" he said in an interview. \"They kind of frown upon weather guys who trade.\"</p><p>So in 2016, he started trading his own money. For four years, Lovern ran a strategy that combined his expertise in weather models with fundamentals like daily gas production and export flows. He scored his best year in 2018 with a 140% gain.</p><p>\"It's one thing to have the data and say, 'this is what it shows.' But interpreting it, and being able to make a good determination of how that data is going to change—that's really where the money is,\" he said.</p><p>His success didn't go unnoticed. Lovern was identified as one of the top traders by FundSeeder, a platform founded by \"Market Wizards\" author Jack Schwager and Emanuel Balarie that searches for under-the-radar trading talent worldwide and provides them with capital to scale.</p><h3>Finding 'Wizards'</h3><p>Schwager, a longtime trader in his own right and market historian best known for his \"Market Wizards\" book series, which profiled some of the most successful traders of the past half-century, including Paul Tudor Jones and Stanley Druckenmiller.</p><p>His books are required reading for many aspiring traders, making his endorsement a rare seal of legitimacy for investors outside Wall Street's traditional pipelines.</p><p>\"There are lots of great traders globally that are completely unknown,\" Schwager said in an interview. \"They don't know anybody in the finance industry. They have no connections. They may be in an undeveloped or partially developed country, but they've been trading very successfully.\"</p><p>Among the thousands of accounts FundSeeder has reviewed, Lovern stood out as one of the top performers. Earlier this year, the firm backed him with $3 million to scale his strategy. FundSeeder has also seeded a 35-year-old energy derivatives trader in the U.K., Adam Williams, with $10 million in March, and even funded a dentist in Europe who trades markets on the side.</p><h3>Global casting call</h3><p>FundSeeder is now expanding with the launch of the <a href=\"https://www.fundseeder.com/rise\" target=\"_blank\">FundSeeder Accelerator</a>, which aims to do for traders what Y Combinator did for Silicon Valley entrepreneurs: provide infrastructure, mentorship, and, crucially, capital to scale.</p><p>\"It's a global casting call for the next top fund manager,\" Balarie, senior vice president of business development at RQSI, which bought FundSeeder last year. \"We don't believe that Wall Street as a monopoly on the best traders. The problem is not the lack of trading talent, but it's really the barriers to entry that prohibits these traders.\"</p><p>The financial backing could be critical for emerging managers who are trying to raise funds.</p><p>\"There's kind of a chicken and egg problem in hedge funds — you need money to raise money,\" Williams said. \"If we were to approach investors, let's say we just started with $4 million, it will be significantly more difficult for people to write larger checks because they don't want to be a certain percentage of the fund.\"</p><p>Traders selected for FundSeeder Accelerator will present their strategies at an industry conference in Miami early 2026.</p></div></div>"
  },
  {
    "title": "Former Fed, Treasury chiefs urge Supreme Court to block Trump firing Lisa Cook ",
    "url": "https://www.cnbc.com/2025/09/25/fed-trump-lisa-cook-supreme-court.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108190706-1756210091316-gettyimages-1240862464-775816195.jpeg?v=1757506223&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T15:21:22.000Z",
    "description": "Lisa Cook takes the oath of office to serve as a member of the Board of Governors at the Federal Reserve System during a ceremony at the William McChesney Martin Jr. Building of the Federal Reserve May 23,...",
    "body": "<div><div><p>Lisa Cook takes the oath of office to serve as a member of the Board of Governors at the Federal Reserve System during a ceremony at the William McChesney Martin Jr. Building of the Federal Reserve May 23, 2022 in Washington, DC.  </p><p>Drew Angerer | Getty Images</p></div><div><p>Every living former chair of the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/10/trump-fed-powell-omb.html\">Federal Reserve</a>, as well as a slew of ex-Treasury secretaries and former White House economic advisors, urged the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/18/trump-supreme-court-lisa-cook-fed.html\">Supreme Court</a> on Thursday to block President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> from firing Fed Governor <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/25/trump-fires-lisa-cook-fed-powell.html\">Lisa Cook</a> as her lawsuit challenging her removal proceeds.</p><p>The signers said in a legal brief, \"The independence of the Federal Reserve, within the limited authority granted by Congress to achieve the goals Congress itself has set, is a critical feature of our national monetary system.\"</p><p>\"Allowing the removal of Governor Lisa D. Cook while the challenge to her removal is pending would threaten that independence and erode public confidence in the Fed,\" the amicus brief said.</p><p>Signers of the brief included the former Fed chairs Alan Greenspan, Ben Bernanke, Janet Yellen; former Treasury secretaries Robert Rubin, Larry Summers, Hank Paulson, Jack Lew, and Timothy Geithner; former <a href=\"https://www.whitehouse.gov/cea/\" target=\"_blank\">White House Council of Economic Advisers</a> chairs Glenn Hubbard, Greg Mankiw, Christina Romer, Cecilia Rouse, Jared Bernstein, and Jason Furman; and former Fed Governor Dan Tarullo.</p><p>Members of the group had served under, and been appointed by, both Democratic and Republican presidents.</p><p>The economists  Ken Rogoff, Phil Gramm, and John Cochrane also signed the brief, as did Phil Gramm, a Republican who previously served as chairman of the Senate Banking Committee.</p><p>The brief said that allowing Cook to be removed now \"would expose the Federal Reserve to political influences, thereby eroding public confidence in the Fed's independence and jeopardizing the credibility<br />and efficacy of U.S. monetary policy.\"</p><p>The filing comes as Cook's lawyers face a 4 p.m. ET Thursday deadline to respond to arguments by the Justice Department that Trump should be allowed to remove her from the seven-member Fed Board of Governors while the Supreme Court considers whether the president has legal cause to fire her.</p><p>Trump said on Aug. 25 that he was firing Cook because of allegations that she committed mortgage fraud in connection with applications she filed for two residential properties she owns. Cook denies any wrongdoing.</p><p>Cook sued Trump in U.S. District Court in Washington, D.C., asking a judge to block her removal.</p><p>That judge on Sept. 9 barred Trump from firing Cook as her suit plays out. A three-judge panel on the federal appeals court in D.C., in a split decision, later upheld that order.</p><p>Trump then asked the Supreme Court to lift those rulings and allow him to remove Cook.</p></div></div>"
  },
  {
    "title": "Costco tops earnings, revenue estimates as warehouse club wins over younger members",
    "url": "https://www.cnbc.com/2025/09/25/costco-cost-q4-2025-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108199380-1758036121407-gettyimages-2216999918-COSTCO_EARNS.jpeg?v=1758634514&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T21:04:40.000Z",
    "description": "A Costco store in Richmond, California, US, on Thursday, May 29, 2025. David Paul Morris | Bloomberg | Getty ImagesCostco on Thursday posted fiscal fourth-quarter earnings and revenue that topped analyst...",
    "body": "<div><div><p>A Costco store in Richmond, California, US, on Thursday, May 29, 2025. </p><p>David Paul Morris | Bloomberg | Getty Images</p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/COST/\">Costco</a><span><span></span></span></span> on Thursday posted fiscal fourth-quarter earnings and revenue that topped analyst estimates as the warehouse club posted double-digit gains in both membership income and its e-commerce business.</p><p>The warehouse club does not share an annual outlook with Wall Street. It will hold an earnings call at 5 p.m. ET.</p><p>Here's how Costco did in its fiscal fourth quarter compared with what Wall Street was expecting, based on a survey of analysts by LSEG:</p><ul><li><strong>Earnings per share:</strong> $5.87 vs $5.80 expected</li><li><strong>Revenue:</strong> $86.16 billion vs. $86.06 billion expected</li></ul><p>Costco's net income for the three-month period that rose to $2.61 billion, or $5.87 per share, compared with $2.35 billion, or $5.29 per share a year earlier. Revenue increased from $79.7 billion in the year-ago period.</p><p>Same-store sales, an industry metric that takes out one-time factors such as store openings and closures, rose 6.4% excluding the impact from changes in gas prices and foreign exchange. That result, which was reported along with Costco's August sales numbers, marks two quarters in a row of decelerating same-store sales.</p><p>E-commerce sales increased by 13.5% compared with the year-ago period, excluding the impacts from changes in gas prices and foreign exchange.</p><p>As U.S. consumers look for value, Costco and its warehouse club competitors <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/20/costco-sams-club-and-bjs-open-new-stores-and-gain-members-.html\">have opened new locations and attracted more members</a>. Younger shoppers have signed up for the stores as the retailers offer more convenient ways to shop online, a wider variety of merchandise and cheaper meals.</p><p>In an interview this summer, Costco CFO Gary Millerchip told CNBC that the average age of the company's members has fallen, and just under half of its new signups each year from people under 40.</p><p>As members across age groups join, Costco's revenue, which includes net sales and membership fees, has also grown. Its full-year revenue totaled $275.24 billion, up about 8.1% year over year.</p><p>In the quarter, its membership fee total jumped about 14%, which reflects its increase in paying shoppers and its higher fee. Last fall, it <a target=\"_blank\" href=\"https://www.cnbc.com/2024/07/10/costco-hikes-membership-fee-for-the-first-time-since-2017.html\">raised its membership fee</a> for the first time since 2017. Costco shoppers now pay $5 more per year or $10 more annually for its higher-tier membership when their annual fee renews.</p><p>Costco could be in a better position to weather higher tariffs than other retailers because the majority of its sales come from groceries, and its \"treasure hunt\" shopping experience of swapping out merchandise frequently means it can pick and choose which items it carries.</p><p>Even so, the retailer said it's taken action to reduce tariff-related costs. On the company's earnings call in May, CEO Ron Vachris said Costco has reduced tariff-related costs by rushing orders to the U.S. before duties took effect, rerouting some imported goods bound for the U.S. to clubs in other parts of the world and sourcing more items for its private brand in countries or regions where they are sold.</p><p>Shares of Costco have jumped by about 180% over the past five years. Yet the retailer has underperformed the market more recently, as shares are up just over 2% so far this year compared to the S&P 500's more than 12% gains during the same time.</p><p><em>This story is developing. Please check back for updates.</em></p></div></div>"
  },
  {
    "title": "New car sales get surprising boost, for now, as consumers fear tariffs and higher prices",
    "url": "https://www.cnbc.com/2025/09/25/new-car-sales-see-boost-as-consumers-fear-tariffs-higher-prices.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108166356-1751379784113-gettyimages-2206612163-widak-dailylif250322_npo6W.jpeg?v=1758816199&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T20:25:30.000Z",
    "description": "GMC SUVs parked outside a GMC Buick dealership in Edmonton, Alberta, Canada, on March 22, 2025. Artur Widak | Nurphoto | Getty ImagesDETROIT — Uncertainty surrounding U.S. regulations on tariffs, electric...",
    "body": "<div><div><p>GMC SUVs parked outside a GMC Buick dealership in Edmonton, Alberta, Canada, on March 22, 2025. </p><p>Artur Widak | Nurphoto | Getty Images</p></div><div><p>DETROIT — Uncertainty surrounding <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-tariff-threat-looms-over-robotics-and-medical-devices-section232-import-investigation.html\">U.S. regulations on tariffs</a>, electric vehicles and other auto-related issues have given new car sales a surprising boost heading into the fourth quarter, according to a new industry analysis.</p><p>Cox Automotive on Thursday raised its <a href=\"https://www.coxautoinc.com/insights/#snapshot\" target=\"_blank\">2025 new vehicle U.S. sales forecast</a> to 16.1 million from a previous range of 15.6 million to 15.7 million due to stronger-than-expected demand so far this year. That would be up from roughly 16 million vehicles sold domestically in 2024.</p><p>Cox's updated forecast is in-line with other industry estimates of 16.1 million units from J.D. Power and 16.2 million vehicles from Edmunds.</p><p>Cox <a href=\"https://www.coxautoinc.com/insights-hub/cox-automotive-forecast-sept-2025-u-s-auto-sales-forecast/\" target=\"_blank\">analysts said</a> the resilient sales — forecast to be up 4.6% compared with the same time period last year — are due to consumers deciding not to wait to buy a new vehicle for fear of higher prices.</p><p>The first bump occurred <a target=\"_blank\" href=\"https://www.cnbc.com/2025/04/16/us-vehicle-supply-falls-tariff-fear-buying.html\">earlier in the year</a> amid President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a>'s announcements of tariffs. That was followed more recently by a <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/08/ev-sales-trump-tax-credit.html\">surge in EV sales</a> ahead of the end of an up to $7,500 federal credit for the purchase of such vehicles that will be eliminated at the end of this month.</p><p>\"The role of changing policies has been a positive story for the new vehicle market so far, with sales running well ahead of last year's pace,\" Cox Automotive senior economist Charlie Chesbrough said during a<a href=\"https://www.coxautoinc.com/insights-hub/presentation-available-q3-2025-industry-insights-and-sales-forecast-call/\" target=\"_blank\"> Thursday webinar. \"</a>A strong stock market is supporting vehicle demand and uncertainty around future. Higher prices [are] leading many potential vehicle buyers to purchase sooner rather than later.\"</p><p>The pull-ahead in sales has benefitted the U.S. automotive industry so far this year, but Chesbrough said the pace of sales — currently at 16.3 million — is expected to slow in the fourth quarter and into next year.</p></div><div><div><svg width=\"256\" height=\"256\">Stock Chart IconStock chart icon</svg><p><img src=\"https://static-redesign.cnbcfm.com/dist/a54b41835a8b60db28c2.svg\" alt=\"hide content\" /></p></div><p>Auto stocks</p></div><div><p>\"We expect Q4 sales to slow as demand for EVs and plug-ins falls once tax credits expire and tariff costs are incorporated more into pricing for the performance of the manufacturers in 2025,\" he said.</p><p>The robust sales, as well as regulatory changes <a href=\"https://www.reuters.com/business/autos-transportation/us-tells-automakers-they-face-no-fuel-economy-penalties-last-three-years-2025-07-16/\" target=\"_blank\">eliminating fuel efficiency fines</a> and corporate tax change benefits, have helped some automakers offset part of the higher tariff costs, according to Cox analysts.</p><p>Regarding sales, Cox predicts <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/GM/\">General Motors</a><span><span></span></span></span> has benefited the most from the resilient demand through the third quarter, with a 1 percentage point increase in U.S. market share compared with the same period a year earlier. The Detroit automaker is followed by <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/TM/\">Toyota Motor</a><span><span></span></span></span> and Hyundai Motor, both expected to be up 0.6 percentage points, and by <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/F/\">Ford Motor</a><span><span></span></span></span>, forecasted to be up 0.4 percentage points.</p><p>\"The biggest are getting bigger, while smaller and more specialized brands are stalling or losing share,\" Chesbrough said. \"It may be that having more product offerings across more segments is key to capturing more buyers in today's market.\"</p><p>Smaller carmakers in the U.S. such as <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/7201.T-JP/\">Nissan Motor,</a><span><span></span></span></span> Volkswagen, Subaru and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/TSLA/\">Tesla</a><span><span></span></span></span>, are all estimated to have lost market share through the third quarter of this year, according to Cox. Jeep parent <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/STLA/\">Stellantis</a><span><span></span></span></span> also continues to struggle amid a <a target=\"_blank\" href=\"https://www.cnbc.com/2025/01/10/stellantis-aims-to-improve-us-sales-market-share-in-2025.html\">yearslong sales decline</a>, Cox estimated.</p><p>Many automakers are scheduled to release their third-quarter sales starting next week, followed by third-quarter earnings reports beginning late next month.</p></div></div>"
  },
  {
    "title": "CarMax stock plummets 20% following 'challenging' quarter ",
    "url": "https://www.cnbc.com/2025/09/25/carmax-stock-plummets-after-missed-wall-streets-expectations.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108130316-1744310125598-gettyimages-2209603903-_73a8821_9szjr1fd.jpeg?v=1758805680&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T20:18:43.000Z",
    "description": "A sign is posted in front of a CarMax dealership on April 10, 2025 in Santa Rosa, California. Justin Sullivan | Getty Images News | Getty ImagesDETROIT — Shares of CarMax fell 20% in trading Thursday after...",
    "body": "<div><div><p>A sign is posted in front of a CarMax dealership on April 10, 2025 in Santa Rosa, California. </p><p>Justin Sullivan | Getty Images News | Getty Images</p></div><div><p>DETROIT — Shares of <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/KMX/\">CarMax</a><span><span></span></span></span> fell 20% in trading Thursday after the used auto retailer missed Wall Street's quarterly earnings and revenue expectations, leading to the stock's lowest price in more than five years.</p><p>CarMax shares ended Thursday at $45.60 — the stock's lowest close since March 2020, when the coronavirus pandemic closed down U.S. auto production and many retailers. The stock is down about 44% so far this year, with the company's market cap at $6.84 billion. </p><p>The company's quarterly results included revenue of roughly $6.6 billion, down 6% from a year earlier, and adjusted earnings per share of 99 cents. excluding some special factors, according to LSEG. Analysts surveyed by the financial markets data firm had expected earnings per share of $1.05 and revenue of $7.01 billion.</p><p>Other key results, such as sales and net income, were also down compared with a year earlier. The company's overall vehicle sales fell 4.1% compared with the same period a year earlier, assisting in a roughly 28% decline in net income to $95.4 million.</p><p>CarMax CEO Bill Nash described the fiscal second quarter that ended Aug. 31 as \"challenging\" in <a href=\"https://investors.carmax.com/news-and-events/news/news-details/2025/CarMax-Reports-Second-Quarter-Fiscal-Year-2026-Results/default.aspx\" target=\"_blank\">the company's quarterly release.</a> He cited changing market conditions, a pull-ahead in sales earlier in the year due to <a target=\"_blank\" href=\"https://www.cnbc.com/2025/06/06/trump-auto-tariffs-used-vehicle-prices.html\">tariff fear-buying</a> and depreciation in its inventory fleet as some reasons for the company's lackluster performance.</p><p>\"For the quarter, each month was down year over year, and each month got a little weaker throughout the quarter,\" Nash told investors on the company's quarterly call on Thursday. \"But certainly, we put ourselves in a better position with the start of this quarter, both on an inventory position as well as from a pricing standpoint.\"</p><p>Shares of other car retailers were also down after CarMax's results, as many investors and Wall Street analysts watch the company's performance as an early barometer ahead of other quarterly reporting.</p><p>Shares of other vehicle retailers such as <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/GPI/\">Group 1 Automotive,</a><span><span></span></span></span> <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AN/\">AutoNation</a><span><span></span></span></span>, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/SAH/\">Sonic Automotive</a><span><span></span></span></span> and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/LAD/\">Lithia Motors</a><span><span></span></span></span> also fell Thursday, losing between roughly 2% and 6%.</p><p><em>Correction: This story has been updated to reflect that earnings per share for the quarter were adjusted.</em></p></div></div>"
  },
  {
    "title": "AI nuclear stock play Oklo loses 15% in 2 days amid big insider selling, Wall Street caution",
    "url": "https://www.cnbc.com/2025/09/25/oklo-nuclear-shares-fall-ai-data-center.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108157920-17496577902025-05-23t185731z_1398090723_rc2unea051hi_rtrmadp_0_usa-trump.jpeg?v=1749657851&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-25T15:26:25.000Z",
    "description": "Jacob DeWitte, Co-Founder and CEO of Oklo, speaks in the Oval Office as he attends the signing of an executive order by U.S. President Donald Trump, at the White House in Washington, D.C., U.S., May 23, 2025....",
    "body": "<div><div><p>Jacob DeWitte, Co-Founder and CEO of Oklo, speaks in the Oval Office as he attends the signing of an executive order by U.S. President Donald Trump, at the White House in Washington, D.C., U.S., May 23, 2025. </p><p>Kent Nishimura | Reuters</p></div><div><p>Nuclear power startup <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/OKLO/\">Oklo</a><span><span></span></span></span> has tumbled<strong> </strong>15% over the past two days, after several executives unloaded shares and Goldman Sachs told investors to approach the stock with caution.</p><p>Goldman initiated coverage of Oklo on Wednesday with a neutral rating, warning investors that its valuation appears full and its business strategy needs de-risking. The bank sees Oklo shares pulling back about 11% over the next 12 months to $117 per share.</p><p>Oklo has also seen a cluster of insider selling over the past few days. CEO Jacob DeWitte unloaded $3 million of stock in the form of a gift this week and Oklo director Michael Klein dumped $6.7 million worth of shares, according to Verity data. CFO Craig Bealmear sold $9.4 million of stock at the end of last week, according to Verity.</p></div><div><div><svg width=\"256\" height=\"256\">Stock Chart IconStock chart icon</svg><p><img src=\"https://static-redesign.cnbcfm.com/dist/a54b41835a8b60db28c2.svg\" alt=\"hide content\" /></p></div><p>Oklo shares year to date</p></div><div><p>Oklo shares have soared more than 470% this year as investors have grown enthusiastic about the role nuclear power could play in supplying electricity for artificial intelligence data centers.</p><p>But Oklo does not yet have the license it needs from the Nuclear Regulatory Commission to build and operate its first 75-megawatt power plant, called an Aurora Powerhouse. It expects to file its application for the license this year. Oklo is also not generating any revenue yet, has not signed a finalized power purchase agreement, and won't launch commercial operations until late 2027 or early 2028.</p><p>\"Over the past year, OKLO has been a catalyst-driven stock, and while we see a path for continued near-term catalysts, we believe the company needs to secure finalized customer agreements,\" Goldman analyst Brian Lee told clients Wednesday.</p><p>Goldman also views Oklo's business model of owning and operating its power plants as a \"heavy capital burden\" that presents a \"meaningful risk to OKLO's success.\"</p><p>Investors have viewed Oklo as major beneficiary of President Donald Trump's executive orders to speed the deployment of new nuclear, particularly his demand that the NRC approve plants faster. DeWitte attended Trump's signing ceremony and Energy Secretary Chris Wright served as a member of Oklo's board before joining the administration.</p></div></div>"
  }
]