[
  {
    "title": "Humana, UnitedHealth plunge 20% after Trump administration proposes keeping Medicare Advantage rates flat",
    "url": "https://www.cnbc.com/2026/01/26/health-insurers-tumble-after-trump-proposes-keeping-medicare-rates-flat.html",
    "image": "https://image.cnbcfm.com/api/v1/image/105857262-1555513028868rts1lyjk.jpg?v=1697206490&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T19:13:15.000Z",
    "description": "watch nowStock Chart IconStock chart iconHumana shares in the past dayThe proposal entails a net average payment increase of 0.09% for Medicare Advant",
    "body": "watch nowStock Chart IconStock chart iconHumana shares in the past dayThe proposal entails a net average payment increase of 0.09% for Medicare Advantage plans in 2027, according to a release from the Centers for Medicare & Medicaid Services, or CMS, on Monday. That number is significantly less than Wall Street analysts' expectations that the agency would propose a rate increase of between 4% and 6% for next year. CMS typically finalizes Medicare Advantage rates in early April. If the current proposal holds, the rate increase would result in more than $700 million more in payments to Medicare Advantage plans in 2027, according to the agency's release. The closely watched government payment rate determines how much insurers can charge for monthly premiums and plan benefits they offer, and ultimately, their profits. The Wall Street Journal first reported about the government's rate proposal on Monday. Medicare Advantage is a privately run health insurance plan contracted by Medicare. More than half of Medicare beneficiaries are enrolled in such plans, enticed by lower monthly premiums and extra benefits not covered by traditional Medicare, according to health policy research firm KFF.CMS said it is also looking to slash a moneymaking industry billing practice. Part of the proposal aims to improve payment accuracy and ensure Medicare insurers get adequately reimbursed, the Journal reported. \"These proposed payment policies are about making sure Medicare Advantage works better for the people it serves,\" said CMS Administrator Dr. Mehmet Oz in the release. \"By strengthening payment accuracy and modernizing risk adjustment, CMS is helping ensure beneficiaries continue to have affordable plan choices and reliable benefits, while protecting taxpayers from unnecessary spending that is not oriented towards addressing real health needs.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Humana, UnitedHealth plunge 20% after Trump administration proposes keeping Medicare Advantage rates flat",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/105857262-1555513028868rts1lyjk.jpg?v=1697206490&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T19:13:15.000Z",
      "dateModified": "2026-01-27T19:13:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ICE chief ordered to appear in Minnesota federal court, judge threatens contempt ruling",
    "url": "https://www.cnbc.com/2026/01/27/ice-chief-todd-lyons-minnesota-court-contempt.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220731-1762195354742-gettyimages-2244371866-AFP_82W4627.jpeg?v=1769528507&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T22:31:45.000Z",
    "description": "Todd Lyons, acting director of U.S. Immigration and Customs Enforcement, or ICE, participates in a television interview outside the White House, in Wa",
    "body": "Todd Lyons, acting director of U.S. Immigration and Customs Enforcement, or ICE, participates in a television interview outside the White House, in Washington, Nov. 3, 2025.Brendan Smialowski | AFP | Getty ImagesA top federal judge in Minnesota ordered the acting head of U.S. Immigration and Customs Enforcement to personally appear at a hearing in Minneapolis on Friday to explain why he should not be held in contempt of court after his agency repeatedly violated judicial orders related to immigration enforcement actions.The three-page order issued late Monday to ICE acting Director Todd Lyons by U.S. District Court Chief Judge Patrick Schiltz was scathing, accusing federal immigration authorities of failing to comply with \"dozens of court orders\" in recent weeks, including one issued by the judge mandating a bond hearing for a detained immigrant.\"This Court has been extremely patient with respondents, even though respondents decided to send thousands of agents to Minnesota to detain aliens without making any provision for dealing with the hundreds of habeas petitions and other lawsuits that were sure to result,\" Schiltz wrote in the order.\"This Court's patience is at an end,\" Schiltz wrote. The judge said that the Department of Homeland Security and Lyons' agency, which is a division of DHS, \"have continually assured the Court that they recognize their obligation to comply with Court orders,\" and that they would take steps to honor those orders.\"Unfortunately, though, the violations continue,\" Schiltz wrote. \"Accordingly, the Court will order Todd Lyons, the Acting Director of ICE, to appear personally before the Court and show cause why he should not be held in contempt of Court,\" Schiltz wrote.The judge was appointed to the federal bench by former President George W. Bush. He clerked for late conservative Supreme Court Justice Antonin Scalia.DHS spokeswoman Tricia McLaughlin, in a statement on Schiltz's order, called him \"just another activist judge who is clearly more concerned about politics than the safety of the Minnesotans.\"\"Does this judge really think Director Lyons should take time out of his day leading ICE to target the worst of the worst criminal illegals including murderers, rapists, pedophiles, and terrorists into our country to testify at a hearing for one illegal alien's removal proceedings?\" McLaughlin said.\"We will not let anything slow us down from removing criminal illegal aliens from our streets,\" she said.Shiltz called his order \"an extraordinary step.\"\"But the extent of ICE's violation of court orders is likewise extraordinary, and lesser measures have been tried and failed,\" Schiltz wrote.The order comes as Minnesota state officials press for ICE and other federal immigration authorities to cease aggressive actions rounding up undocumented people in Minneapolis and elsewhere in the state.Schiltz's order also came two days after federal agents fatally shot Alex Pretti, a 37-year-old ICU nurse on a Minneapolis street, and weeks after an ICE agent shot and killed mom of three Renee Good in her car. Both Pretti and Good were U.S. citizens.Those, and other incidents, have sparked widespread outrage in the state and nationally.Read more CNBC politics coverageTrump says he wants 'very honorable and honest investigation' of Alex Pretti killingDemocrats to Trump: Fire Kristi Noem or risk her impeachmentThe government is barreling toward a partial shutdown over DHS funding. Here's what to expectICE chief ordered to appear in Minnesota federal court, judge threatens contempt rulingAll eyes are on Trump's reaction to the 'mother of all deals'Hyundai shares fall after Trump says tariffs on South Korean autos, pharma to rise to 25%Treasury cancels Booz Allen contracts after Trump tax records leak; stock fallsThe judge's order does not relate to either shooting but to his previous order that DHS and ICE grant a detained immigrant a bond hearing by last Wednesday.That man remains detained despite Schiltz's directive, according to a court filing by the man's lawyer.\"This is one of dozens of court orders with which respondents have failed to comply in recent weeks,\" Schiltz wrote Monday.\"The practical consequence of respondents' failure to comply has almost always been significant hardship to aliens (many of whom have lawfully lived and worked in the United States for years and done absolutely nothing wrong): The detention of an alien is extended, or an alien who should remain in Minnesota is flown to Texas, or an alien who has been flown to Texas is released there and told to figure out a way to get home,\" the judge wrote.Schiltz said that if, before the hearing, the parties inform him that the detained man \"has been released from custody, the Court will cancel the hearing and will not require Lyons to appear.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ICE chief ordered to appear in Minnesota federal court, judge threatens contempt ruling",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220731-1762195354742-gettyimages-2244371866-AFP_82W4627.jpeg?v=1769528507&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T22:31:45.000Z",
      "dateModified": "2026-01-27T22:31:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "GM expects to top Ford in U.S. vehicle production as it faces up to $4 billion in tariff costs",
    "url": "https://www.cnbc.com/2026/01/27/gm-plans-to-top-ford-in-us-production-amid-trumps-tariff.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106880615-1620662350453-gettyimages-1202279819-GM_LANSING.jpeg?v=1769534936&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T18:44:42.000Z",
    "description": "General Motors Chevrolet Traverse sport utility vehicles sit on the assembly line at the company's Lansing Delta Township Assembly Plant in Lansing, M",
    "body": "General Motors Chevrolet Traverse sport utility vehicles sit on the assembly line at the company's Lansing Delta Township Assembly Plant in Lansing, Michigan, Feb. 21, 2020.Jeff Kowalsky | Bloomberg | Getty ImagesDETROIT — General Motors expects to outproduce crosstown rival Ford Motor to become the top assembler of vehicles in the U.S. in the coming years.GM CEO and Chair Mary Barra announced the target Tuesday as the company reported its 2025 earnings and gave a 2026 outlook that included between $3 billion and $4 billion in expected tariff costs.\"As we look further ahead, our annual production in the U.S. is expected to rise to an industry-leading 2 million units,\" Barra told investors, detailing previously announced plans to increase domestic production.GM's push to increase domestic production comes as tariffs from importing vehicles to the U.S. cost the company $3.1 billion in 2025.Based on the vehicles Barra mentioned, GM could reach its goal as early as 2027, depending on how quickly it ramps up production. The automaker next year is scheduled to add production of gas-powered crossovers currently made in Mexico to plants in Kansas and Tennessee as well as full-size SUVs and pickup trucks to a currently idled plant in Michigan.Aside from helping GM reduce its expected tariff costs, achieving that auto production goal would take the title away from Ford, which has touted it in advertising and marketing efforts in recent years.Ford, which has called itself the \"most American\" automaker, assembled 2.1 million vehicles in the U.S., as of 2024, with 80% of its U.S. sales being assembled domestically.GM, meanwhile, is historically the top-seller of vehicles in the U.S., but also was the largest importer of new vehicles to America in 2024, Bloomberg News reported last year. It imported approximately 1.23 million units that year — nearly half of its 2024 U.S. sales, according to the report.Trucks make their way to the Ambassador Bridge to cross into the United States at Detroit on April 1, 2025 in Windsor, Canada. Bill Pugliano | Getty ImagesFord said it is proud to be America's No. 1 auto producer since 2009 as well as the top exporter of American-assembled vehicles.\"That's who we are and who we always have been regardless of policy or tariffs,\" a Ford spokesman said in an emailed statement to CNBC when asked about GM's target. \"If other automakers who rely heavily on importing foreign-made cars into the U.S. are now 'getting religion,' that's good news for U.S. communities. But they have a long way to go to match Ford's commitment to America.\"GM did not immediately respond to requests for additional comment or details about their current U.S. production.GM's expected tariff costs this year would be in line with the automaker's $3.1 billion in tariff costs in 2025, which came despite the levies not being in effect for the whole year. That was actually below the automaker's previously disclosed expectations of between $3.5 billion and $4.5 billion in tariff costs last year.\"We proactively managed our net tariff exposure, reducing it well below our initial expectations, thanks to self-help initiatives and policy actions that support companies like GM that have substantial and growing commitments to American manufacturing,\" Barra told investors Tuesday.GM's expected tariff costs could be higher this year, largely depending on duties on vehicles imported from South Korea. President Donald Trump on Monday said the U.S. would increase the tariff back to 25% after the South Korean legislature failed to approve the pact. Trump had previously said that the level would be 15%.Barra on Tuesday said GM is \"hopeful\" the U.S. and South Korea can finalize a new trade deal that includes a 15% tariff on vehicles exported to the U.S. from South Korea, which was the number used in GM's 2026 forecast.\"We're really encouraging the countries to get the trade deal done that they agreed to last October,\" Barra told CNBC's Phil LeBeau during \"Squawk Box.\"GM is the second-largest U.S. importer of vehicles from South Korea behind South Korean automaker Hyundai Motor. The Detroit automaker relies heavily on plants in the country for entry-level vehicles such as the Chevrolet Trax and Buick Envista.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "GM expects to top Ford in U.S. vehicle production as it faces up to $4 billion in tariff costs",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106880615-1620662350453-gettyimages-1202279819-GM_LANSING.jpeg?v=1769534936&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T18:44:42.000Z",
      "dateModified": "2026-01-27T18:44:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says 'we're going to de-escalate a little bit' in Minnesota after Alex Pretti killing",
    "url": "https://www.cnbc.com/2026/01/27/alex-pretti-trump-investigation-greg-bovino-homan-minnesota.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257710-1769535600954-gettyimages-2257944328-AFP_947Y6QN.jpeg?v=1769548127&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T22:01:00.000Z",
    "description": "President Donald Trump speaks to the media as he walks to Marine One prior to departure from the South Lawn of the White House on Jan. 27, 2026, as he",
    "body": "President Donald Trump speaks to the media as he walks to Marine One prior to departure from the South Lawn of the White House on Jan. 27, 2026, as he travels to Iowa.Saul Loeb | Afp | Getty ImagesPresident Donald Trump on Tuesday said \"we're going to de-escalate a bit,\" referring to the situation in Minnesota on the heels of the controversial killing of ICU nurse Alex Pretti by a federal agent in Minnesota over the weekend.Trump's comment came as he praised his border czar Tom Homan, whom he dispatched to Minnesota on Monday after outrage over the Trump administration's initial response to Pretti's death.\"He's great,\" Trump said of Homan during an interview with Fox News' Will Cain.\"And they met with the governor, the mayor, everybody else, and we'll, we're going to de-escalate a little bit,\" the president said.On Sunday, several dozen major companies in Minnesota issued a statement calling for an \"immediate deescalation of tensions\" in the state on the heels of Pretti's killing, which was the second time in several weeks that federal agents killed a U.S. citizen in Minneapolis.The Trump administration has flooded that city with Immigration and Customs Enforcement officers, and other Department of Homeland Security officers in what the administration has said is widespread fraud by immigrants there.Trump earlier Tuesday told reporters that he wants \"a very honorable and honest investigation\" into the Pretti's killing.\"We're doing a big investigation,\" Trump told reporters at the White House. \"I want to see the investigation, I'm going to be watching over it,\" he said. \"I want to see it myself.\"Shortly after Trump spoke, MS Now, citing three people briefed on the matter, reported that the Department of Justice had decided not to conduct a civil rights investigation of Pretti's death.\"And instead two units of the Department of Homeland Security will investigate their officers and the man they killed,\" MS Now reported.Trump's comments were the latest in a series of recent statements and moves by him and the White House that have sought to dial back his administration's initially bellicose comments on Pretti's killing on Saturday in Minneapolis.Pretti's death came weeks after an ICE agent in the city fatally shot the U.S. citizen and mother-of-three Renee Good, as she attempted to drive away from another agent telling her to exit her car.On Monday, Trump said that Homan would go to Minnesota to manage ICE's on-the-ground operations there. Read more CNBC politics coverageTrump says he wants 'very honorable and honest investigation' of Alex Pretti killingDemocrats to Trump: Fire Kristi Noem or risk her impeachmentThe government is barreling toward a partial shutdown over DHS funding. Here's what to expectICE chief ordered to appear in Minnesota federal court, judge threatens contempt rulingAll eyes are on Trump's reaction to the 'mother of all deals'Hyundai shares fall after Trump says tariffs on South Korean autos, pharma to rise to 25%Treasury cancels Booz Allen contracts after Trump tax records leak; stock fallsHoman reportedly has been at odds with DHS Secretary Kristi Noem, who initially called Pretti a \"domestic terrorist\" who wanted \"to inflict maximum damage on individuals and to kill law enforcement.\"\"Tom Homan ... is in Minnesota now, he's meeting with governor [Tim Walz], and he's meeting with the mayor [Jacob Frey], I think later,\" Trump said. \"And I hear that's all going very well.\"Trump spoke on the phone with Walz and Frey on Monday. Both officials are Democrats who for weeks have been strongly critical of the Trump administration's surge of immigration enforcement officers to Minneapolis and elsewhere.On Monday, multiple news outlets reported that Greg Bovino, the Border Patrol commander at large, was leaving Minneapolis, where his comments on Pretti's death and other immigration-enforcement related issues had inflamed tensions.Bovino had claimed that Pretti, who had a licensed handgun on his person at the time of the confrontation with federal agents, may have intended to \"massacre law enforcement.\"Noem and Bovino's claims have been undercut by videos taken of Pretti's shooting, which shows him on the ground when he is apparently shot from behind by an agent.During an interview with Fox News' Will Cain on Tuesday, Trump was asked if Homan's arrival and Bovino's departure were a \"pullback.\"\"I don't think it's a pullback. It's a little bit of a change,\" Trump said. \"Everybody in this room that has a business, you know, you make little changes. You know, Bovino is very good, but he's a pretty out there kind of a guy,\" the president said.\"And in some cases, that's good. Maybe it wasn't good here.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says 'we're going to de-escalate a little bit' in Minnesota after Alex Pretti killing",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257710-1769535600954-gettyimages-2257944328-AFP_947Y6QN.jpeg?v=1769548127&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T22:01:00.000Z",
      "dateModified": "2026-01-27T22:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Intel says it will match government's 'Trump Accounts' contribution to kids of employees",
    "url": "https://www.cnbc.com/2026/01/27/intel-says-it-will-match-governments-trump-accounts-contribution.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256437-1769187685916-gettyimages-2257634603-_75a0063_zhsczybu.jpeg?v=1769553607&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T22:55:24.000Z",
    "description": "The Intel logo is displayed on a sign in front of Intel headquarters on Jan. 22, 2026 in Santa Clara, California. Justin Sullivan | Getty ImagesIntel,",
    "body": "The Intel logo is displayed on a sign in front of Intel headquarters on Jan. 22, 2026 in Santa Clara, California. Justin Sullivan | Getty ImagesIntel, which now counts the U.S. government as its largest shareholder, said on Tuesday that it will match the Trump administration's $1,000 payout for children of eligible U.S. employees.The matching funds, which is a benefit for Intel staff, mark the latest sign of a close working relationship between the Trump administration and Intel after the government took a 10% stake in the chipmaker last year through an $8.9 billion investment. The 530A program, often called \"Trump Accounts,\" passed as part of the administration's \"big beautiful bill,\" and is intended to jumpstart wealth-building opportunities for children, allowing their investments to grow and compound for years before they become adults.\"America's future technologists will define the next era of innovation, and the Trump Accounts program helps give them an early financial foundation,\" Lip-Bu Tan, Intel CEO, said in Tuesday's statement. Intel is joining a list of other companies that say they will match the federal $1,000 contribution. They include SoFi, Charter Communications, BNY, BlackRock, Investment Company Institute, Robinhood and Charles Schwab.The program allows parents to open tax-advantaged investment accounts for children under 18, with kids born between 2025 and 2028 getting seed funding of $1,000 from the government. Employer contributions up to $2,500 don't count as taxable income. Parents will be able to open the accounts in July. In December, Dell founder Michael Dell said he would donate $6.25 billion to the program, to seed some Trump Accounts for children born before the Jan. 1 cutoff with $250. WATCH: Intel still a massive turnaround storywatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Intel says it will match government's 'Trump Accounts' contribution to kids of employees",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256437-1769187685916-gettyimages-2257634603-_75a0063_zhsczybu.jpeg?v=1769553607&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T22:55:24.000Z",
      "dateModified": "2026-01-27T22:55:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Homebuyers are backing out of deals at the fastest pace in nearly a decade",
    "url": "https://www.cnbc.com/2026/01/27/homebuyers-backing-out-of-deals.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108108420-1740667756457-gettyimages-2157834117-EXISTING_HOME_SALES.jpeg?v=1769535632&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T20:28:11.000Z",
    "description": "A \"sale pending\" sign in front of a home for sale in Larkspur, California, Nov. 30, 2023.Justin Sullivan | Getty ImagesSerious headwinds in the housin",
    "body": "A \"sale pending\" sign in front of a home for sale in Larkspur, California, Nov. 30, 2023.Justin Sullivan | Getty ImagesSerious headwinds in the housing market and the broader economy are tanking home sales at an alarming rate.More than 40,000 signed home purchase agreements were canceled in December, representing 16.3% of all homes that went under contract, according to Redfin, a real estate brokerage. That's up from 14.9% in December 2024. It's is also the highest share since Redfin began tracking the metric in 2017.\"High housing costs and rising inventory have made homebuyers more selective,\" said Chen Zhao, head of economics research at Redfin. \"Home sellers outnumber buyers by a record margin, meaning the buyers who are in the market have options and may walk away if they believe they can find a better or more affordable home.\" Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.There were roughly 47% more home sellers than buyers in the market in December — or 631,535 more — according to a separate Redfin report. That is the largest gap in records dating back to 2013 and up 7.1 percentage points from the previous month. \"I call 2025 the year of the seller, because I had so many sellers reach out,\" said Ashley Rummage, a real estate agent from Raleigh, North Carolina, who participated in the most recent CNBC Housing Market Survey. \"They were reaching out because they had a lot of fear around the economy. They had a lot of uncertainty around the current administration, mortgage rates, affordability. These are all challenges this year.\"Regionally, Atlanta saw the highest percentage of contract cancellations in December at 22.5%. That was followed by Jacksonville, Florida, at 20.6%; San Antonio at 20.6%; Cleveland at 20.2%; and Tampa, Florida at 19.4%. Cancellations were the least common in the New York metropolitan area, San Francisco and San Jose, California.Pending sales actually dropped an outsized 9% in December from November, according to the National Association of Realtors, so the numbers were already low. Given the high rate of cancellations, closed sales in January and February are likely to be quite weak. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Homebuyers are backing out of deals at the fastest pace in nearly a decade",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108108420-1740667756457-gettyimages-2157834117-EXISTING_HOME_SALES.jpeg?v=1769535632&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T20:28:11.000Z",
      "dateModified": "2026-01-27T20:28:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UPS to cut additional 30,000 jobs in Amazon unwind, turnaround plan",
    "url": "https://www.cnbc.com/2026/01/27/ups-job-cuts-amazon-unwind-turnaround-plan.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218270-1761689543201-gettyimages-2243862832-_l9a2658_dzqlylh1.jpeg?v=1761689575&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T16:59:23.000Z",
    "description": "A worker drives a United Parcel Service (UPS) truck on Oct. 28, 2025 in Los Angeles, California.Mario Tama | Getty ImagesUnited Parcel Service on Tues",
    "body": "A worker drives a United Parcel Service (UPS) truck on Oct. 28, 2025 in Los Angeles, California.Mario Tama | Getty ImagesUnited Parcel Service on Tuesday announced that it was planning to eliminate an additional 30,000 jobs this year as part of winding down its partnership with Amazon and a multiyear turnaround plan.CFO Brian Dykes said on a call with analysts Tuesday following the company's quarterly earnings release that UPS plans to reduce total operational hours by approximately 25 million associated with the Amazon decline.\"In terms of variable costs, we expect to reduce operational positions by up to 30,000,\" Dykes said. \"This will be accomplished through attrition, and we expect to offer a second voluntary separation program for full-time drivers.\"UPS also said it has identified 24 buildings for closure in the first half of 2026, with additional closures possible later in the year. Last year, UPS closed 93 buildings, it reiterated Tuesday. The company is also planning to \"further deploy automation\" across its network, according to Dykes.The planned job cuts come after UPS eliminated 48,000 jobs last year, 34,000 of which were operational and 14,000 of which were management. The company had previously estimated those combined reductions to total around 20,000. In a Tuesday statement, representative for the Teamsters said its union workers \"still know [their] worth\" if UPS brings back its buyout program.\"We're perfectly happy for UPS to realize growth and cost savings on the backs of corporate managers so long as they uphold their contractual commitments to our members and reward the Teamsters who actually make the company run,\" the statement read.UPS is in the midst of a turnaround plan under CEO Carol Tomé, aiming to reinvigorate the business. Though Amazon was previously UPS' largest customer, the two companies are in the process of gliding down operations together. UPS said Tuesday it expects a total of $3 billion in savings related to the Amazon unwind.UPS reported fourth-quarter earnings Tuesday, beating Wall Street estimates and citing encouraging process in its turnaround efforts.Shares of the company were up 4% in morning trading. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UPS to cut additional 30,000 jobs in Amazon unwind, turnaround plan",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218270-1761689543201-gettyimages-2243862832-_l9a2658_dzqlylh1.jpeg?v=1761689575&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T16:59:23.000Z",
      "dateModified": "2026-01-27T16:59:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The government is barreling toward a partial shutdown over DHS funding. Here's what to expect",
    "url": "https://www.cnbc.com/2026/01/27/us-government-shutdown-over-dhs-funding.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257256-1769464521232-gettyimages-2257820820-AA_26012026_2623897.jpeg?v=1769534317&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T22:42:21.000Z",
    "description": "watch nowThe U.S. government is on the brink of a partial shutdown beginning at 12:01 a.m. ET Saturday in large part because of a second recent killin",
    "body": "watch nowThe U.S. government is on the brink of a partial shutdown beginning at 12:01 a.m. ET Saturday in large part because of a second recent killing of a U.S. citizen by federal agents in Minneapolis. It would be different than last year's shutdown.The killing of Alex Pretti, a 37-year-old intensive care nurse, has galvanized fierce Senate Democratic opposition to a House-passed measure providing funding for the Department of Homeland Security and a slew of other agencies. The more-than-$1.2 trillion package cleared the House of Representatives last week and accounts for the bulk of government spending for the fiscal year ending Sept. 30.Democratic support will be required to pass the bill, which needs 60 votes to avert the filibuster in the Senate that Republicans control 53-47. Democrats are demanding the DHS portion be stripped in exchange for their votes, something Republicans have signaled they will not do.Senate Minority Leader Chuck Schumer, D-N.Y., suggested on Tuesday that the Trump administration's recent retreat from its immigration actions in Minnesota would not be enough to drop the shutdown threat — raising the shutdown odds even higher. \"The fix should come from Congress; the public can't trust the administration to do the right thing on its own,\" Schumer said in remarks on the Senate floor.\"In the meantime, I will vote no on any legislation that funds ICE until it is reined in and overhauled, and Senate Democrats are overwhelmingly united on this issue,\" Schumer said. \"If [Senate Majority Leader John] Thune insists on holding a vote on DHS legislation that he knows will not pass, then he will guarantee yet another unnecessary government shutdown this Friday.\"Thune, R-S.D., said Tuesday on the Senate floor that Pretti's death was a \"tragedy\" and warrants a \"full and impartial investigation.\" He also said talks are underway to break a Democratic logjam of the appropriations bill. \"Productive talks are ongoing, and I urge my Democrat colleagues to continue their engagement and find a path forward that will avoid a needless shutdown,\" Thune said. If the Senate alters the bill at all, it would have to be reapproved by the House, which is out on a prescheduled recess and has not announced plans to return before the deadline. In addition to DHS, the bill would fund the departments of Defense, Treasury, State, Health and Human Services, Labor, Housing and Urban Development, Transportation, and Education.Should the bill not pass by the Friday night deadline, those agencies would be deprived of funding and enter a shutdown posture — meaning \"nonessential\" employees would be furloughed and \"essential\" employees would work without pay. Spending bills that President Donald Trump already signed would keep the rest of the government open. \"Activities that are necessary to protect life and property continue, although the workers in those functions may not be paid while they are working,\" said Caleb Quakenbush, associate director of economic policy at the Bipartisan Policy Center. \"Agencies have a lot of discretion in terms of who is essential and at what period.\" Agencies typically release contingency plans before a shutdown. So far, the agencies at risk of losing funding have not publicly released their plans. Certain government functions like Social Security payments and Medicare and Medicaid services typically continue during a shutdown, Quakenbush said. The bill that reopened the government last year included funding for the Department of Agriculture through the fiscal year, meaning the Supplemental Nutrition Assistance Program will not see a disruption as it did last year. Read more CNBC politics coverageTrump says he wants 'very honorable and honest investigation' of Alex Pretti killingDemocrats to Trump: Fire Kristi Noem or risk her impeachmentThe government is barreling toward a partial shutdown over DHS funding. Here's what to expectICE chief ordered to appear in Minnesota federal court, judge threatens contempt rulingAll eyes are on Trump's reaction to the 'mother of all deals'Hyundai shares fall after Trump says tariffs on South Korean autos, pharma to rise to 25%Treasury cancels Booz Allen contracts after Trump tax records leak; stock fallsThere are still a number of services that could see disruptions. A shutdown at the end of the week would be the first during tax season, which began Monday. The Internal Revenue Service is among the agencies that would lose funding during a shutdown. Last year, the agency remained open in some capacity during the shutdown but did have to wind down some operations as the shutdown dragged on.The IRS said in October that most tax refunds would not be issued during the last shutdown, with an exception for Form 1040s that are \"electronically filed, error-free tax returns that can be automatically processed and direct deposited.\"  IRS walk-in taxpayer assistance centers were also shuttered during the last shutdown. The Treasury Department did not respond to emails from CNBC seeking comment on the agency's contingency plans.The Department of Transportation would also be shuttered, though some key functions would remain functioning. Air traffic controllers would be required to work without pay. The Department of Health and Human Services would also be affected. Some Head Start programs were forced to close during the last shutdown, depriving families of critical child care. DHS, however, would be able to largely operate without interruption due to funding provided to the agency through the Republicans' \"One Big Beautiful Bill\" law enacted last year. That bill provided DHS with roughly $178 billion, which could be tapped to continue immigration operations during a shutdown. It's unclear whether the other agencies affected have identified similar pots of money that could be used to keep operations going. The length of a potential shutdown would also be critical in assessing how long those contingency funds would last.\"The longer they go on, the more disruption that people experience,\" Quakenbush said.  This story is developing. Please check back for updates. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The government is barreling toward a partial shutdown over DHS funding. Here's what to expect",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257256-1769464521232-gettyimages-2257820820-AA_26012026_2623897.jpeg?v=1769534317&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T22:42:21.000Z",
      "dateModified": "2026-01-27T22:42:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The market thinks BlackRock's Rick Rieder will be the next Fed chair. Here's what's at stake",
    "url": "https://www.cnbc.com/2026/01/27/market-thinks-blackrocks-rieder-will-next-chair-the-fed-whats-at-stake.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257783-17695414842026-01-27t191227z_119077712_rc2u9jahyqgq_rtrmadp_0_usa-fed-kalshi.jpeg?v=1769541505&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T21:23:21.000Z",
    "description": "A five-month process of finding the next Federal Reserve chair appears to be down to its final days, with one candidate emerging as the betting favori",
    "body": "A five-month process of finding the next Federal Reserve chair appears to be down to its final days, with one candidate emerging as the betting favorite even as others remain in the mix.BlackRock fixed income chief Rick Rieder is seen by prediction markets as the frontrunner to replace Jerome Powell at the helm of the central bank. Kalshi has the Wall Street veteran holding a 48% chance, well ahead of the next-closest competitor, former Governor Kevin Warsh, at 31%.But sentiment has been volatile, and it was Warsh who held a decided advantage less than a week ago.What has swung the pendulum seems tenuous: In a CNBC interview at the World Economic Forum, Trump called Rieder \"very impressive,\" and a Bloomberg News report, citing unnamed sources, said White House officials generally liked Rieder.While that was enough to sway wagers on sites like Kalshi and Polymarket, some on Wall Street are less convinced and still see it as a competitive race yet to be decided by a notoriously fickle president. With Warsh still well in the mix, some analysts also think the market's move away from National Economic Council (NEC) director Kevin Hassett is at least too hasty.The Kevins are still aliveWhile acknowledging market sentiment about Rieder, Tobin Marcus, head of U.S. policy and politics at Wolfe Research, said in a note that \"we remain unconvinced\" on the money manager, adding, \"We think both Kevins are still strong possibilities.\"\"Just last week, Trump was continuing to strongly emphasize 'loyalty' as a criterion, which is an obstacle for Rieder,\" Marcus added. \"If this is still the President's mindset, that seems like an obvious problem for Rieder, who is in no way a loyalist ... We also continue to think betting markets are misinterpreting Trump's comments on Hassett.\"That's a reference to Trump, in a recent White House conversation with reporters, emphasizing that he would miss Hassett at the NEC and would prefer to see him stay in that role. However, neither Trump nor any White House officials who have spoken about the matter have dismissed Hassett as a contender. Marcus wrote off the Trump comment about Hassett as \"a cheeky quip\" that may not represent his feelings about filling the Fed chair.Former Fed Vice Chair Roger Ferguson voiced similar views in a CNBC interview Monday, saying he still thinks the decision comes down to \"one of the Kevins.\"\"Only one person knows, and the rest of us are speculating,\" Ferguson added. He called Rieder a \"qualified person [and] Wall Street favorite ... but I really think it's unlikely that he'll be the first one across the finish line.\"There's also the possibility that Trump could play a wild card in the form of hiring someone not thought to be among the finalists. He has stated previously that he would like to name Treasury Secretary Scott Bessent to the job but that the former hedge fund manager doesn't want it.Neither Rieder nor White House officials returned a request for comment.Looking at RiederShould he look Rieder's way, Trump would get someone who fits his views in many ways, including a desire for lower interest rates and a willingness to use the Fed's balance sheet to guide the economy.After the Fed approved a quarter percentage point cut in December, the third such move in a row, Rieder wrote, \"rates are still too high for the housing market to [recover] its buoyancy, and small businesses (important providers of new jobs) and young households are still struggling.\" He noted that the fed funds rate \"is excessively blunt to deal with issues better resolved through fiscal channels.\"Rieder would be an interesting choice for a number of reasons, not least because he represents a firm that is the face of globalist finance and would serve under a president known for his anti-globalist views. Though Trump has many times expressed his distaste for Powell and threatened to fire him more than once, Rieder would carry a huge similarity to the current chair in that neither has a PhD in economics, instead holding market-rich backgrounds. In Rieder's case, that meant a long stint at Lehman Brothers before the Wall Street investment banking titan imploded in 2008, an event associated with the beginning of the global financial crisis.At BlackRock, Rieder engineers a $2.5 trillion bond portfolio that includes the $14.5 billion iShares Flexible Income Active exchange-traded fund. The entire firm manages $14 trillion in client money and runs the government's Thrift Savings Plan, a federal employees' retirement fund. Moreover, the Fed called on BlackRock during the Covid crisis in 2020 to manage its controversial purchases of corporate bonds aimed at steadying capital flows at a time of extreme economic peril. Like other major financial firms and primary dealers, BlackRock officials, including its influential CEO Larry Fink, are in continuous contact with the Fed.Fed independencePotential downsides, at least from Trump's view, might be that Rieder has stated he'd like to see the Fed's key interest rate around 3%, only about half a percentage point below its current level and above desired by the president and other White House officials. He has also expressed support for Fed independence and seems unlikely to take marching orders from Trump.In a separate appearance at the World Economic Forum — held each year in Davos, Switzerland, where BlackRock plays a huge role — Trump mused about the difficulty in finding a Fed chair who would do his bidding. Few if any presidents in U.S. history have been so open about trying to influence monetary policy.\"They get the job, they're locked in for six years. They get the job and all of a sudden, 'let's raise rates a little bit,'\" Trump said, misstating the length of the four-year terms for chairs. \"It's amazing how people change once they have the job. It's too bad. It's sort of disloyalty. But they've got to do what they think is right.\"While Trump may again become dissatisfied with the next Fed chair, markets likely will welcome whomever Trump chooses, including Rieder, at least among those considered in the running.\"The BlackRock fixed income CIO, who has not worked in a policy position before, would bring a perspective grounded in deep granular bottoms-up analysis of corporate data rather than economic theory and models,\" wrote Krishna Guha, head of global policy and central bank strategy at Evercore ISI. \"The market would likely welcome Rieder as one of its own.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The market thinks BlackRock's Rick Rieder will be the next Fed chair. Here's what's at stake",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257783-17695414842026-01-27t191227z_119077712_rc2u9jahyqgq_rtrmadp_0_usa-fed-kalshi.jpeg?v=1769541505&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T21:23:21.000Z",
      "dateModified": "2026-01-27T21:23:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Fed releases its latest interest rate decision Wednesday. Here's what to expect",
    "url": "https://www.cnbc.com/2026/01/27/fed-preview-january-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240122-1765396115359-gettyimages-2251230236-_s019460_pmineffu.jpeg?v=1769540502&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T19:43:34.000Z",
    "description": "U.S. Federal Reserve Chair Jerome Powell holds a press conference after the Fed cut interest rates by quarter of a percentage point, in Washington, D.",
    "body": "U.S. Federal Reserve Chair Jerome Powell holds a press conference after the Fed cut interest rates by quarter of a percentage point, in Washington, D.C., U.S., October 29, 2025. Kevin Lamarque | ReutersThis week's Federal Reserve meeting offers little suspense and probably not much action, even as massive changes loom over the central bank's longer-term direction.Judging by market expectations and policymakers' comments, there's virtually no chance the Fed will change its benchmark interest rate when the meeting ends Wednesday.Despite a recent spate of disagreements among Federal Open Market Committee members about the longer-term trajectory of monetary policy, the near-term stance likely will be one of patience as a series of cuts made last year work their way through the economy.\"Overall, the Fed just wants to stand pat. They feel they've got time to wait and see,\" former Fed Vice Chair Roger Ferguson said in a CNBC interview Monday. \"This feels like a wait-and-see meeting, and we should all be listening to see if there's any hint or a bias towards a future action.\"watch nowIndications of where the FOMC heads from here would come from the post-meeting policy statement as well as Chair Jerome Powell's news conference afterward. Markets currently expect the Fed to cut once or twice this year — most likely in June and December, according to futures market pricing gauged by the CME Group's FedWatch tool.However, the focus most certainly will lie beyond the interest rate decision and future guidance and into an unprecedented web of intrigue that surrounds the meeting.Storm around PowellFor one, President Donald Trump told CNBC last week that he may have narrowed down his search for Powell's successor to a single candidate, a nomination that could be announced this week and perhaps even timed to coincide with the Fed rate decision.\"If there is a single most likely window, it's during the January FOMC — particularly if Trump is lookingto redirect attention away from a Fed that didn't cut,\" Stephanie Roth, chief economist at Wolfe Research, said in a note. \"More broadly, the decision could come as soon as this week, or within the next couple of weeks.\"Also operating in the background: The Justice Department has served Powell with a subpoena seeking information on the Fed's massive renovation project on its Washington, D.C., headquarters. In an unusually candid videotaped statement, Powell called the probe a \"pretext\" for Trump's desire to bully the Fed into cutting rates even more aggressively than it has in recent months.There's uncertainty elsewhere, too, with Trump's effort to unseat Fed Governor Lisa Cook over mortgage fraud allegations in front of the U.S. Supreme Court last week, and Trump appointee Stephen Miran's term expiring Saturday. Fed governors can serve until they are replaced, so it's not clear how much longer Miran will stay on the board. He dissented from each of last year's three, quarter percentage point rate cuts, favoring even larger moves.So while the market will pay close attention to interest rate developments and indications, much of the scrutiny will go toward the ancillary events that have rocked the central bank.Political pressures\"While the Fed has been politically pressured to cut rates, it is not pressed by the data,\" wrote Gregory Daco, chief economist at EY-Parthenon. However, Powell \"is likely to refrain from commenting directly on the Department of Justice probe involving himself and the Fed, as well as the Supreme Court's pending ruling related to Governor Cook.\"That won't stop media members from asking, though.\"Powell will be asked about his video warning that Trump DoJ subpoenas and other actions seekto subject monetary policy to the 'preferences of the president,'\" Krishna Guha, head of global policy and central bank strategy at Evercore ISI, said in a note. \"We think he will stand by everything he said and express faith in the Supreme Court as the final arbiter of Fed independence.\"Absent further political developments, that will bring the focus back to policy.Markets will look to decipher whether the hold this month is hawkish, the precursor of an extended period of no cuts, or dovish, in which Powell and the committee indicate that more cuts are likely, just not now.Morgan Stanley's chief economist, Michael Gapen, expects to see a tilt toward dovish.\"We think recent stabilization in the labor market and solid activity data will be the main drivers behind the decision to pause rate cuts, while incoming data on inflation will keep the Fed confident enough about disinflation later this year to retain an easing bias,\" Gapen said in a note. \"We do not believe committee members are ready to signal an end to the cutting cycle.\"Gapen is also looking for several changes in the post-meeting statement, likely reflecting an upgrade to economic growth and a removal of language on increased downside risks to employment. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Fed releases its latest interest rate decision Wednesday. Here's what to expect",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240122-1765396115359-gettyimages-2251230236-_s019460_pmineffu.jpeg?v=1769540502&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T19:43:34.000Z",
      "dateModified": "2026-01-27T19:43:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon converting some Fresh supermarkets, Go stores to Whole Foods locations",
    "url": "https://www.cnbc.com/2026/01/27/amazon-fresh-go-supermarkets-whole-foods-convert.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108075678-1734095017432-gettyimages-2188958110-ryder-amazon-17.jpeg?v=1734095347&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T18:22:02.000Z",
    "description": "The exterior of an Amazon Fresh grocery store is seen on December 12, 2024 in Federal Way, Washington. David Ryder | Getty ImagesAmazon said Tuesday i",
    "body": "The exterior of an Amazon Fresh grocery store is seen on December 12, 2024 in Federal Way, Washington. David Ryder | Getty ImagesAmazon said Tuesday it plans to sunset its Fresh and Go brick-and-mortar chains, marking a major pivot in the company's grocery strategy.  \"After a careful evaluation of the business and how we can best serve customers, we've made the difficult decision to close our Amazon Go and Amazon Fresh physical stores, converting various locations into Whole Foods Market stores,\" the company wrote in a blog post. Amazon said the closures are part of an effort to prioritize investments, though it hasn't given up on physical retail. The company still plans to roll out other brick-and-mortar concepts, including \"a mass physical store format.\" It will continue to operate its Fresh grocery service and invest in same-day delivery of groceries, the company said.The company said it expects to open more than 100 new Whole Foods locations over the next few years. It will also expand its line of Whole Foods Daily Shops, which are mini-markets that offer a smaller assortment of grocery items.Last month, Amazon received approval from local officials in a Chicago suburb to construct a big-box store that would offer groceries, household essentials and general merchandise. Amazon declined to share how many Fresh and Go workers will be impacted by the store closures. It said it's working to help employees find roles in its operations network, and that they will be eligible for a severance package.  Read more CNBC tech newsApple, Google host dozens of AI 'nudify' apps like Grok, report findsBlockbuster social media trial kicks off, with more to come this yearMeta inks deal to pay Corning up to $6 billion for fiber-optic cables in AI data centersTikTok blames data center outages for U.S. app problems, denies censorship claimsFor almost two decades, Amazon has been determined to become a bigger player in the grocery market. In 2017, the company spent $13.7 billion to acquire Whole Foods, the largest deal in its history. Amazon debuted its Fresh grocery chain in 2020, with an eye toward mass-market shoppers. The rollout was turbulent in its early days, with Amazon opening a flurry of locations, before it shuttered some stores and halted expansion of the chain as part of broader cost-cutting efforts.The company launched a revamped Fresh store concept in 2023, and then continued to tweak its strategy. Amazon shuttered all of its U.K. Fresh stores last September, and closed a handful of locations in Southern California soon after.Amazon's Go convenience marts, which debuted in 2018, were a pet project of founder Jeff Bezos. The stores were designed to alleviate the headache of standing in a checkout line by allowing shoppers to \"Just Walk Out.\" Locations were outfitted with an array of cameras and sensors that tracked each item shoppers picked off the shelf and automatically charged them as they exited the store.\"No one likes to wait in line,\" then-CEO Bezos wrote in his 2018 letter to shareholders. \"Instead, we imagined a store where you could walk in, pick up what you wanted, and leave.\"The company shifted further away from the cashier-less technology in 2024 when it removed the systems from its grocery stores. In recent years, Amazon has sought to sell the software to other companies, primarily sports stadiums, concert venues, hospitals and colleges. It's also tested the automated grab-and-go technology in its warehouses. Amazon has brought the Whole Foods division closer to its in-house grocery teams since the 2017 acquisition. Last January, Amazon tapped Whole Foods CEO Jason Buechel to oversee its worldwide grocery business. The company also began testing a \"store within a store\" concept at some Whole Foods locations where customers can order a wider array of Amazon products that aren't typically offered at the upscale grocer from an automated warehouse affixed to the store. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon converting some Fresh supermarkets, Go stores to Whole Foods locations",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108075678-1734095017432-gettyimages-2188958110-ryder-amazon-17.jpeg?v=1734095347&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T18:22:02.000Z",
      "dateModified": "2026-01-27T18:22:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dollar suffers worst one-day slide since last April after Trump says currency hasn't fallen too low",
    "url": "https://www.cnbc.com/2026/01/27/dollar-worst-one-day-rout-since-april-trump-says-hasnt-fallen-too-low.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257688-1769534652062-gettyimages-2258511179-_s015678_h1kvlku2.jpeg?v=1769534738&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-28T00:18:42.000Z",
    "description": "watch nowThe U.S. dollar fell 1.3% on Tuesday, the most since last April, after President Donald Trump declined to say that the currency had fallen to",
    "body": "watch nowThe U.S. dollar fell 1.3% on Tuesday, the most since last April, after President Donald Trump declined to say that the currency had fallen too much. Speaking to reporters during a visit to Iowa to promote his economic record, Trump was asked if he was comfortable with the current value of the greenback and if he thought it had fallen too much after sliding 10% over the past year. \"I think it's great,\" Trump said of the weaker dollar. \"I mean the value of the dollar, look at the business we're doing. No, [the] dollar is doing great. You know it's very interesting, if you look at China or Japan, I used to fight like hell with them because they always wanted to devalue their yen ... you know that, the yen and yuan, and they'd always want to devalue it. They devalue, devalue, devalue. And I said, 'not fair.' They devalue, because it's hard to compete when they devalue.\"The Dollar Index, which tracks the U.S. currency against six leading trading partners (but not China), fell the most in a single day since last April 10, when it tumbled almost 2% amid mounting trade disputes and U.S. threats to impose a 145% tariff on China. That same day, the S&P 500 slid 3.5% and the Nasdaq Composite sank 4.3%. On Tuesday, the dollar also dropped to its lowest level since February 2022.Stock Chart IconStock chart iconDollar index futures over the past year",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dollar suffers worst one-day slide since last April after Trump says currency hasn't fallen too low",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257688-1769534652062-gettyimages-2258511179-_s015678_h1kvlku2.jpeg?v=1769534738&w=1920&h=1080"
      ],
      "datePublished": "2026-01-28T00:18:42.000Z",
      "dateModified": "2026-01-28T00:18:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House Democrats to Trump: Fire DHS chief Noem or they'll start impeachment proceedings against her",
    "url": "https://www.cnbc.com/2026/01/27/house-democrats-kristi-noem-impeachment-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257733-1769541811425-108257733-1769537907899-gettyimages-2257115911-AA_23012026_2617637.jpg?v=1769541818&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T21:04:17.000Z",
    "description": "House Minority Leader Hakeem Jeffries (D-NY) speaks at a press conference with other House Democrats at the U.S. Capitol in Washington, DC on Jan. 22,",
    "body": "House Minority Leader Hakeem Jeffries (D-NY) speaks at a press conference with other House Democrats at the U.S. Capitol in Washington, DC on Jan. 22, 2026.Nathan Posner | Anadolu | Getty ImagesHouse Democratic leaders on Tuesday threatened to begin impeachment proceedings against Department of Homeland Security Secretary Kristi Noem if President Donald Trump does not fire her first. Noem has faced increased pressure in recent days for her comments in the wake of the shooting of Alex Pretti, a U.S. citizen killed by federal agents in Minneapolis on Saturday.\"The violence unleashed on the American people by the Department of Homeland Security must end forthwith,\" House Minority Leader Hakeem Jeffries, Democratic Whip Katherine Clark, and Democratic Caucus Chair Pete Aguilar said in a statement.\"Kristi Noem should be fired immediately, or we will commence impeachment proceedings in the House of Representatives,\" the statement said.\"We can do this the easy way or the hard way.\"Read more CNBC politics coverageTrump says he wants 'very honorable and honest investigation' of Alex Pretti killingDemocrats to Trump: Fire Kristi Noem or risk her impeachmentThe government is barreling toward a partial shutdown over DHS funding. Here's what to expectICE chief ordered to appear in Minnesota federal court, judge threatens contempt rulingAll eyes are on Trump's reaction to the 'mother of all deals'Hyundai shares fall after Trump says tariffs on South Korean autos, pharma to rise to 25%Treasury cancels Booz Allen contracts after Trump tax records leak; stock fallsIn the aftermath of Pretti's killing, Noem claimed he had been \"brandishing\" a weapon and that he had responded \"violently\" to officers' attempts to disarm him. Those claims were later contradicted by video evidence and analyses from multiple news outlets. Senate Minority Leader Chuck Schumer, D-N.Y., cited Noem's statements about Pretti on the Senate floor on Tuesday and joined calls for Trump to fire Noem.\"Kristi Noem is a liar, she's vicious. She's also incompetent. Donald Trump must fire her at once before another American is killed under her watch,\" Schumer said.Trump on Tuesday said \"no\" when a reporter at the White House asked him if Noem would leave her post.Noem is doing \"a very good job,\" Trump told reporters before a planned trip to Iowa.Homeland Security spokeswoman Tricia McLaughlin said in an emailed statement that, \"DHS enforces the laws Congress passes, period. If certain members don't like those laws, changing them is literally their job.\"\"While ICE officers are facing a staggering 1,300% spike in assaults, too many politicians would rather defend criminals and attack the men and women who are enforcing our laws and did nothing while Joe Biden facilitated an invasion of tens of millions of illegal aliens into our country. It's time they focus on protecting the American people, the work this Department is doing every day under Secretary Noem's leadership,\" McLaughlin's statement continues.The warning by House Democrats comes as a partial government shutdown looms amid concerns over DHS funding.\"Taxpayer dollars are being weaponized by the Trump administration to kill American citizens, brutalize communities and violently target law-abiding immigrant families. The country is disgusted by what the Department of Homeland Security has done,\" the leaders said in their statement.The House last week passed a more than $1.2 trillion spending package that included funding for DHS and other agencies. But the Senate has only until 12:01 a.m. Saturday to pass the bills and keep the government fully funded.The killing of Pretti, a 37-year-old intensive care nurse, has prompted outrage among Senate Democrats, who have called for the DHS bill to be stripped from the larger spending package in exchange for their votes.Democratic support for the spending bills is needed to clear the 60-vote filibuster in the Senate.\"Senate Democrats have made clear we are ready to quickly advance the five appropriations bills separately from the DHS funding bill before the January 30th deadline,\" Schumer said in a statement Monday. \"The responsibility to prevent a partial government shutdown is on Leader Thune and Senate Republicans,\" Schumer said. \"If [Majority  Leader John] Thune puts those five bills on the floor this week, we can pass them right away. If not, Republicans will again be responsible for another government shutdown.\" Trump and the White House this week softened the administration's stance on Pretti, seemingly walking back earlier statements made by administration officials like Stephen Miller, Trump's homeland security adviser, who labeled Pretti a \"domestic terrorist.\"\"Nobody in the White House, including President Trump, wants to see people getting hurt or killed in America's streets,\" White House press secretary Karoline Leavitt said during a press briefing on Monday.Still, tensions remain high after the deaths of Pretti and Renee Nicole Good, another citizen killed by federal agents in Minneapolis this month.DHS recently launched an immigration enforcement investigation in Minnesota, sending federal agents to the state in response to an ongoing social services fraud scandal and targeting thousands of refugees.Minnesota state officials and congressional Democrats have sharply condemned the tactics used by DHS and ICE, and some congressional Republicans have also called for increased oversight.Sen. Rand Paul, R-Ky., on Monday called on the heads of ICE, Customs and Border Protection and U.S. Citizenship and Immigration Services to testify before the Committee on Homeland Security and Governmental Affairs, which he chairs.He also called for an \"independent investigation\" into the shooting.\"Local police routinely, put officers involved in deadly shootings on administrative leave until an independent investigation is concluded. That should happen immediately. I can't recall ever hearing a police chief immediately describing the victim as a 'domestic terrorist' or a 'would-be assassin,'\" Paul said in a post to X on Tuesday.   \"For calm to be restored, an independent investigation is the least that should be done,\" he wrote.ICE, CPB, and USCIS officials agreed Tuesday to testify at a House Homeland Security Committee hearing on Feb. 10.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House Democrats to Trump: Fire DHS chief Noem or they'll start impeachment proceedings against her",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257733-1769541811425-108257733-1769537907899-gettyimages-2257115911-AA_23012026_2617637.jpg?v=1769541818&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T21:04:17.000Z",
      "dateModified": "2026-01-27T21:04:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Read the memo: Amazon's grocery boss details restructuring, says more 'deliberate' strategy needed",
    "url": "https://www.cnbc.com/2026/01/27/amazons-grocery-boss-details-fresh-go-restructuring-read-the-memo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108075680-1734095017193-gettyimages-2188958302-ryder-amazon-2.jpeg?v=1769541925&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T20:56:54.000Z",
    "description": "On Monday, Amazon's chief merchant, John Farrell, announced in a LinkedIn post that he's leaving the company to \"explore new challenges.\" Farrell over",
    "body": "On Monday, Amazon's chief merchant, John Farrell, announced in a LinkedIn post that he's leaving the company to \"explore new challenges.\" Farrell oversaw buying for its Fresh division and joined Amazon in 2019 from British supermarket chain Tesco.  Amazon is reshaping its grocery business as it continues its nearly two-decade effort to become a giant in the U.S. grocery market. In recent years, Amazon has expanded its selection of fresh food and grocery staples at same-day warehouses in the U.S., while testing 30-minute deliveries of groceries and other items in some areas.The company said Tuesday it expects to open more than 100 new Whole Foods locations over the next few years, expand its line of Whole Foods mini-markets and test new formats, including a superstore outside of Chicago.Last January, Amazon tapped Buechel to oversee its sprawling grocery business. He's taken steps to bring Whole Foods, which Amazon acquired for $13.7 billion in 2017, closer to the company's in-house grocery teams. Buechel has dubbed the effort \"One Grocery.\"Jassy told investors in May that he remains \"very bullish\" about Amazon's grocery business. The company says it's \"one of the top three grocers in the U.S.\" with over $150 billion in gross sales and more than 150 million customers shopping groceries each year. \"It's a very significant business, and then I think we have a bunch of other areas that will allow us to grow in this area,\" Jassy said.As part of the store closures, Buechel said the company is laying off some employees across the grocery organization, and is working to help staffers secure jobs elsewhere at Amazon. He didn't say how many jobs were impacted by the restructuring.\"To our team members who helped develop, build, and run our Fresh and Go stores: thank you,\" Buechel wrote. Hi team,Our Worldwide Grocery Stores organization delivered strong results in 2025, making it easier, faster, and more affordable for customers to shop for groceries. As we look ahead to 2026, we have ambitious plans to build on this momentum and further expand access to fresh food and everyday essentials to millions more customers.To achieve these plans, we need to make deliberate choices about where we invest and how we operate. Today, I'm sharing several significant changes to our business and team structure. These decisions weren't easy, but they position us to deliver even more for customers in the years ahead.Closing Our Amazon Go and Amazon Fresh Physical StoresFirst, after a careful evaluation of the business and how we can best serve customers, we've made the difficult decision to close our Amazon Go and Amazon Fresh physical stores. This decision means we had to eliminate roles across our organization, and notifications to impacted employees have been completed. While we've seen encouraging signals in these formats, we haven't yet created a truly distinctive customer experience with the right economic model needed for large-scale expansion. Importantly, the Amazon Fresh brand will continue online, where customers can shop for fast and convenient delivery.It's never easy when a decision affects talented people who have given so much to our customers and our mission. We're working to help affected employees find roles elsewhere in Amazon and are supporting them with 90 days of full pay and benefits, career transition services, and severance packages.To our team members who helped develop, build, and run our Fresh and Go stores: thank you. You pioneered something new and, most importantly, showed up for our customers and each other every day ready to make a difference. Although we're closing these stores, the impact of your work will shape our next generation of store concepts and customer experiences.Evolving Our Amazon Grocery Logistics (AGL) OrganizationNext, as part of our One Grocery efforts to align work across Amazon to better serve customers, we're transitioning our online grocery fulfillment operations, return logistics, and AGL corporate operations teams to Udit Madan's Worldwide Operations organization. We're also aligning our pickup and return counter operations in Whole Foods Market stores to Store Operations under Bill Jordan. Vishy and Bill will share more on these changes later today.This strategic decision reflects both the maturity of our grocery logistics capabilities and the massive growth opportunity ahead. We began building our chill chain network in 2007 with our first Amazon Fresh delivery service, and our team has evolved into a world-class operation delivering affordable, high-quality groceries across multiple countries. Managing a large perishable supply chain is complex, and I'm proud of our talented team's expertise and innovation.Now it's time to bring this expertise to scale within Worldwide Operations as we accelerate the expansion of fresh groceries through our core fulfillment and delivery network. When we launched perishables as part of Same-Day Delivery in over 2,300 cities and towns last year, fresh groceries quickly became nine of the top 10 bestsellers. This transition brings together our chill chain expertise with Sub Same Day's extensive fulfillment network, advanced automation capabilities, and operational scale to capture this enormous opportunity. This is our One Grocery mindset at scale. Our teams will continue working closely together, similar to how we partner with Worldwide Operations today.I want to thank Vishy for his leadership in building the robust grocery logistics capabilities that position us for this next phase of growth. We will share an update on his next role in the coming weeks.What This Means for Worldwide Grocery StoresYou might be wondering: what does this mean for our organization? We are the stewards of grocery across all of Amazon and that responsibility has never been more important. We're accountable for maintaining the highest standards for selection, freshness, and quality across the entire supply chain, from partnering with farms and suppliers to stocking shelves and delivering to customers' doorsteps.We will continue to partner with teams across Amazon—from fulfillment to technology to product to Prime—to set the standard. Ultimately, it's our job to ensure customers trust Amazon to provide fresh, high-quality food at great value.To support this effort, we are adding a new role focused on grocery quality to our WWGS Leadership Team. This role will be our single-threaded leader for all aspects of quality across our customer experiences, including product and order quality, and will be announced in the coming weeks.When we work together across Amazon, our collective impact is remarkable:    •    Same-Day Delivery of fresh groceries now reaches over 2,300 cities and towns, with expansion to many more areas in 2026.    •    We're opening more than 100 new Whole Foods Market stores in the next few years, including our Daily Shop format.    •    Amazon Grocery, our new unified private brand, now offers over 1,000 items at exceptional value, and we're gearing up for further expansion in 2026.    •    We continue to invest in new physical store experiences like Amazon Grocery, which we launched alongside Whole Foods Market in Chicago, Illinois, and our 'store within a store' in Whole Foods Market in Plymouth Meeting, Pennsylvania, with plans to open new physical store formats in the coming years. As an example, the team is working on a new retail concept in Orland Park, Illinois, designed to make it convenient for customers to shop Amazon's broad selection and low prices across fresh groceries, household essentials, and general merchandise.Looking AheadI know change is hard, especially when it impacts our teammates, and when we're saying goodbye to stores and programs this team has helped build. I want to leave you with this: I'm genuinely optimistic about the future of our grocery business and the opportunities we have to make a positive impact on our customers, suppliers, and communities. The future is bright, and I know we'll continue to find new and better ways to serve our customers, whether through faster delivery options, new physical store formats, or innovations we haven't imagined yet.The entire WWGS leadership team is here to support you during this transition. If you have questions, please reach out to your leader or PXT/TMS partner.Thank you for everything you do, and for the resilience and dedication you bring to this work every day.Jason",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Read the memo: Amazon's grocery boss details restructuring, says more 'deliberate' strategy needed",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108075680-1734095017193-gettyimages-2188958302-ryder-amazon-2.jpeg?v=1769541925&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T20:56:54.000Z",
      "dateModified": "2026-01-27T20:56:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthropic closes latest funding round above $10 billion and could go higher, sources say",
    "url": "https://www.cnbc.com/2026/01/27/anthropic-fundraising-microsoft-nvidia.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108254389-17689275282026-01-20t124808z_1149863023_rc205jas0xak_rtrmadp_0_davos-meeting.jpeg?v=1768927543&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-27T20:35:43.000Z",
    "description": "CEO and Co-Founder of Anthropic Dario Amodei speaks during the 56th annual World Economic Forum (WEF) meeting in Davos, Switzerland, January 20, 2026.",
    "body": "CEO and Co-Founder of Anthropic Dario Amodei speaks during the 56th annual World Economic Forum (WEF) meeting in Davos, Switzerland, January 20, 2026. Denis Balibouse | ReutersAnthropic has closed its latest funding round above the initial $10 billion target at a $350 billion valuation, CNBC confirmed on Tuesday.The round closed at a total between $10 billion and $15 billion, according to three sources familiar with the discussions who asked not to be named because the details are confidential. But that figure could still grow if Microsoft and Nvidia decide to contribute, the people said. In November, Microsoft and Nvidia announced plans to invest up to $5 billion and up to $10 billion into the artificial intelligence startup, respectively. It's not clear if they plan to participate in Anthropic's latest round, or how much they might commit, the people said. Coatue and Singapore sovereign wealth fund GIC are leading the financing, as CNBC previously reported. Sequoia Capital, which is an investor in Anthropic's rival OpenAI, is also participating, according to the people. The Financial Times was first to report Anthropic's oversubscribed funding round. Anthropic was founded in 2021 by former OpenAI research executives, including its CEO, Dario Amodei. The company is best known for developing a family of large language models called Claude, and its AI coding tool Claude Code has exploded in popularity in recent months. Amodei told CNBC earlier this month that Anthropic generated close to $10 billion in revenue last year.WATCH: Anthropic CEO Dario Amodei on AI race: Focused on making our models as smart and capable as possiblewatch nowRead more CNBC tech newsApple, Google host dozens of AI 'nudify' apps like Grok, report findsBlockbuster social media trial kicks off, with more to come this yearMeta inks deal to pay Corning up to $6 billion for fiber-optic cables in AI data centersTikTok blames data center outages for U.S. app problems, denies censorship claims",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthropic closes latest funding round above $10 billion and could go higher, sources say",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108254389-17689275282026-01-20t124808z_1149863023_rc205jas0xak_rtrmadp_0_davos-meeting.jpeg?v=1768927543&w=1920&h=1080"
      ],
      "datePublished": "2026-01-27T20:35:43.000Z",
      "dateModified": "2026-01-27T20:35:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]