[
  {
    "title": "Register now: Applications open for the World's Top Fintech Companies 2026",
    "url": "https://www.cnbc.com/2026/02/25/cnbc-worlds-top-fintech-companies-2026-apply-now.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108264308-1770808330529-gettyimages-1328699091-single_mom_0119.jpeg?v=1770808359&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-24T23:08:25.000Z",
    "description": "A person using a laptop and mobile phone. Tom Werner | Digitalvision | Getty ImagesApplications are now open for the fourth edition of CNBC's World's ",
    "body": "A person using a laptop and mobile phone. Tom Werner | Digitalvision | Getty ImagesApplications are now open for the fourth edition of CNBC's World's Top Fintech Companies list, produced in partnership with market research firm Statista.Each year, CNBC and Statista chart the top fintech players from around the world, ranging from startups to Big Tech names, across segments including payments, wealth technology, insurance and more. Last year's iteration included heavyweights such as Mastercard, Stripe and Visa, as well as many newer scaleups. Credit rewards company Bilt, payments upstart TerraPay and insurance platform Entsia made their debuts on the list. The World's Top Fintech Companies has been expanded this year, with regulation tech — companies helping others meet their financial regulatory obligations — becoming its own segment.Over the years, fintech has progressed from a high-growth challenger segment to a core part of the global financial system, helped by a Covid-fueled race to digitize. Artificial intelligence has spurred the sector further, and has been tipped as a source of transformative change.The global fintech market attracted $44.7 billion in investment across over 2,200 deals in the first half of 2025, according to the most recent report by KPMG, although this was lower than the $54.2 billion investment seen over the six months prior.How to applyCompanies can submit their information for consideration by clicking here. Developing innovative, technology-based financial products and services should be the core business of nominees. The form, hosted by Statista, includes questions about a company's business model and certain key performance indicators, including revenue growth and employee headcount. You can read more about the research project and methodology here.The deadline for submissions is April 24, 2026.For questions about the list or assistance with the form, please email Statista: topfintechs@statista.com.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Register now: Applications open for the World's Top Fintech Companies 2026",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108264308-1770808330529-gettyimages-1328699091-single_mom_0119.jpeg?v=1770808359&w=1920&h=1080"
      ],
      "datePublished": "2026-02-24T23:08:25.000Z",
      "dateModified": "2026-02-24T23:08:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "HSBC annual pre-tax profit drops over 7%, revenue jumps as bank's results top estimates",
    "url": "https://www.cnbc.com/2026/02/25/hsbc-2025-full-year-earnings-results.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108054194-17302078842024-06-17t021456z_819532323_rc27b8aahscy_rtrmadp_0_mexico-hsbc.jpeg?v=1745939516&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T05:31:51.000Z",
    "description": "A view of the logo of HSBC bank on a wall outside a branch in Mexico City, Mexico, on June 14, 2024.Henry Romero | ReutersEurope's largest lender HSBC",
    "body": "A view of the logo of HSBC bank on a wall outside a branch in Mexico City, Mexico, on June 14, 2024.Henry Romero | ReutersEurope's largest lender HSBC on Wednesday reported annual pre-tax profit of $29.91 billion, beating analysts' estimates on the back of a strong performance in its wealth division and Hong Kong businesses.While annual profit declined 7.4%, HSBC's revenue gained 4%, year on year, and both exceeded estimates.Here are HSBC's full-year results compared with the consensus estimates compiled by the bank.Pre-tax profit: $29.91 billion vs. $28.86 billionRevenue: $68.27 billion vs. $67.36 billionThe lender's fourth-quarter profit before tax rose to $6.8 billion, up $4.5 billion from a year earlier, largely due to favorable one-off items linked to business disposals. Operating expenses rose 8% to $9.3 billion, reflecting restructuring costs, technology investment and higher performance-related pay.Its revenue for the final quarter jumped 42% year on year to $16.4 billion. HSBC Group CEO Georges Elhedery said in a statement that 2025 marked a year of \"decisive action and swift execution,\" with all four of the bank's businesses performing well and building strong momentum.The lender now aims to deliver a return on average tangible equity — a measure of profitability — of 17% or more, excluding notable items, in between 2026 and 2028. RoTE was 13.3% in 2025.The results come close on the heels of HSBC completing the privatization of Hang Seng Bank on Jan. 26, with the latter's shares subsequently delisted from the Hong Kong Stock Exchange. HSBC said last year that the deal would be add to its earnings and was a better use of capital than buybacks.\"We do anticipate revenue and cost synergies between the two brands, but we expect that to come through gradually in the medium term,\" Morningstar's equity analyst Kathy Chan said.The take private offer was \"an exciting opportunity to grow both Hang Seng and HSBC,\" Elhedery said last October, adding that the bank would preserve Hang Seng's brand while investing to strengthen its capabilities.Addressing questions on potential job cuts, Elhedery told CNBC's Emily Tan that HSBC was targeting about 8% reduction in payroll costs, but stressed the bank had not not set specific headcount reduction targets. He said the focus was on simplifying the group at scale and removing duplicate roles, pointing to a net 15% reduction in managing director positions through de-duplication.At the start of the month, Bloomberg reported that HSBC was set to award minimal or no bonuses to some bankers as it moves toward a tougher, more performance-driven compensation model similar to that of its Wall Street peers. The bank intends to use the upcoming bonus round to push out underperformers in areas such as investment banking and wealth management, potentially including managing directors, the report said, citing according to people familiar with the matter. While HSBC has not confirmed any final decisions regarding plans to cull underperformers, Morningstar's Chan said she would not be surprised to see further headcount reductions, given the Group's broader goal to improve operational efficiency and deliver cost savings.Hong Kong listed shares of HSBC declined 0.46%.—CNBC's Emily Tan contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "HSBC annual pre-tax profit drops over 7%, revenue jumps as bank's results top estimates",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108054194-17302078842024-06-17t021456z_819532323_rc27b8aahscy_rtrmadp_0_mexico-hsbc.jpeg?v=1745939516&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T05:31:51.000Z",
      "dateModified": "2026-02-25T05:31:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Epstein files: DOJ withheld documents about claim Trump sexually abused minor, MS NOW reports",
    "url": "https://www.cnbc.com/2026/02/24/epstein-trump-doj-garcia.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106074403-1565623685272preview.jpg?v=1771964656&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-24T21:14:12.000Z",
    "description": "In a 1997 photo, Jeffrey Epstein, left, and Donald Trump pose together at the Mar-a-Lago estate in Palm Beach, Fla.Davidoff Studios Photography | Arch",
    "body": "In a 1997 photo, Jeffrey Epstein, left, and Donald Trump pose together at the Mar-a-Lago estate in Palm Beach, Fla.Davidoff Studios Photography | Archive Photos | Getty ImagesThe Department of Justice has withheld from public disclosure in its Epstein files database memos and notes about FBI interviews, including those of a woman who has alleged President Donald Trump sexually abused her when she was a minor, MS NOW reported Tuesday.The woman, who was interviewed in July 2019 by the FBI about allegations against convicted sexual predator Jeffrey Epstein, alleged that \"Trump forced her to perform oral sex on him 35 years ago, when she was 13 or 14 years old, and subsequently hit her,\" MS NOW reported, citing a source who has reviewed unredacted documents.\"That allegation appears in a 2025 PowerPoint presentation detailing each of the FBI's Epstein-related investigations and a spreadsheet of unconfirmed tips called into the bureau's National Threat Operations Center reviewed by MS NOW,\" the outlet reported. \"MS NOW has found that of at least four interviews the FBI conducted with the woman related to the Epstein investigations, only one memo — and no handwritten notes — reflecting such an interview is included on the DOJ site.\"MS NOW's report came hours after NPR first reported that the DOJ withheld from its public database of Epstein documents files related to allegations that Trump sexually abused a minor. DOJ \"also removed some documents from the public database where accusations against Jeffrey Epstein also mention Trump,\" NPR reported.A law signed by Trump in late 2025 requires the DOJ to make public, with few exceptions, all of its investigative files related to Epstein, who killed himself in a New York federal jail in August 2019, weeks after his arrest on federal child sex trafficking charges.Trump is a former friend of Epstein. The two fell out in the early 2000s. The president has never been criminally charged in connection with a claim by an Epstein survivor.Trump last week said the Epstein files had \"totally exonerated\" him.Rep. Robert Garcia, D-Calif., in a statement on Tuesday said, \"For the last few weeks, Oversight Democrats have been investigating the FBI's handling of allegations from 2019 of sexual assault on a minor made against President Donald Trump by a survivor.\"Yesterday, I reviewed unredacted evidence logs at the Department of Justice. Oversight Democrats can confirm that the DOJ appears to have illegally withheld FBI interviews with this survivor who accused President Trump of heinous crimes,\" said Garcia, the ranking Democrat on the House Oversight and Government Reform Committee.\"Oversight Democrats will open a parallel investigation into this.\"Read more CNBC politics coverageState of the Union 2026 live updates: Trump speechEpstein files: Trump sexual abuse claims withheld by DOJSenators tell CFTC prediction market contracts need clear guidanceDemocrats seek to force refunds after Supreme Court blocks Trump tariffsTrump demands Netflix fire Susan Rice as DOJ probes Warner dealGarcia also said that because of a prior subpoena issued by the Oversight Committee, as well as the Epstein Files Transparency Act, \"These records must immediately be shared with Congress and the American public.\"\"Covering up direct evidence of a potential assault by the President of the United States is the most serious possible crime in this White House cover up,\" he said.The DOJ, when contacted by CNBC for comment, pointed to a post on X in which it responded to Garcia's statement.\"@OversightDems should stop misleading the public while manufacturing outrage from their radical anti-Trump base,\" the post said. \"@TheJusticeDept has repeatedly said publicly AND directly to @NPR prior to deadline - NOTHING has been deleted. If files are temporarily pulled for victim redactions or to redact Personally Identifiable Information, then those documents are promptly restored online and are publicly available.\"\"ALL responsive documents have been produced unless a document falls within one of the following categories: duplicates, privileged, or part of an ongoing federal investigation,\" DOJ said.The White House referred CNBC to the DOJ's X post when asked for comment.Trump was asked by a reporter last week about the arrest of Andrew Mountbatten-Windsor, the former British prince, by police in the United Kingdom on suspicion of misconduct in public office. That arrest is believed to be related to an investigation into whether Mountbatten-Windsor, the younger brother of King Charles III, had shared confidential trade reports with Epstein.\"I'm the expert in a way because I've been totally exonerated. That's very nice. I can actually speak about it very nicely,\" Trump said of the arrest.\"I think it's a shame. I did nothing,\" the president said.Disclosure: CNBC and MS NOW are divisions of Versant Media.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Epstein files: DOJ withheld documents about claim Trump sexually abused minor, MS NOW reports",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106074403-1565623685272preview.jpg?v=1771964656&w=1920&h=1080"
      ],
      "datePublished": "2026-02-24T21:14:12.000Z",
      "dateModified": "2026-02-24T21:14:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple to move some Mac Mini production to U.S. this year as part of effort to boost domestic manufacturing",
    "url": "https://www.cnbc.com/2026/02/24/apple-to-move-some-mac-mini-production-to-us-in-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108182688-1754517836176-gettyimages-2228841996-wm024965_rf6pxmp1.jpeg?v=1771956978&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-24T19:44:26.000Z",
    "description": "Apple CEO Tim Cook (R) speaks as U.S. President Donald Trump looks on during an event in the Oval Office of the White House on August 6, 2025 in Washi",
    "body": "Apple CEO Tim Cook (R) speaks as U.S. President Donald Trump looks on during an event in the Oval Office of the White House on August 6, 2025 in Washington, DC. Win Mcnamee | Getty ImagesApple said it's moving production of some of its Mac Mini computers to the U.S. later this year as the company seeks to bolster domestic manufacturing. The iPhone maker last year unveiled plans to invest $600 billion in the U.S., with CEO Tim Cook appearing at the White House with President Donald Trump in August for the announcement of a $100 billion outlay. The company also has said it will purchase parts and expand its relationship with U.S. suppliers. \"As part of our $600B commitment, Mac mini will be produced in the US for the first time later this year!\" Cook wrote in a post on X on Tuesday. \"We're accelerating our progress even further — producing more AI servers and opening an all-new Apple Advanced Manufacturing Center for hands-on training.\"The Mac Mini is Apple's compact, more affordable desktop computer, which start at about $600, according to the company's website. Later this year, production will begin at a new factory in Houston, where Apple started producing AI servers last year, the company said in a statement.  \"We began shipping advanced AI servers from Houston ahead of schedule, and we're excited to accelerate that work even further,\" Cook said in the release.Apple has been hit hard by tariffs imposed by the Trump administration, paying about $3.3 billion since the president initiated the levies last year. Apple is sourcing half of its iPhones for the U.S. from India and most of its other U.S.-bound products like Macs, AirPods and watches from Vietnam. The Supreme Court on Friday struck down a large chunk of President Trump's far-reaching tariff agenda, but uncertainty remains after Trump rebuked the decision. Apple said its 20,000-square-foot advanced manufacturing center in Houston will open its doors later this year. The company said it will provide training in advanced manufacturing techniques to students, supplier employees, and American businesses, teaching them \"the same innovative processes that are used to make Apple products.\"WATCH: How the Supreme Court's tariff ruling could shift Apple's supply chainwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple to move some Mac Mini production to U.S. this year as part of effort to boost domestic manufacturing",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108182688-1754517836176-gettyimages-2228841996-wm024965_rf6pxmp1.jpeg?v=1771956978&w=1920&h=1080"
      ],
      "datePublished": "2026-02-24T19:44:26.000Z",
      "dateModified": "2026-02-24T19:44:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WBD says Paramount raised its bid to $31 per share, board will weigh offer against Netflix deal",
    "url": "https://www.cnbc.com/2026/02/24/warner-bros-discovery-paramount-higher-bid-netflix.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108268783-1771881963429-gettyimages-2263189469-dji_20260223103436_0070_d_odjqpfrl.jpeg?v=1771973387&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-24T22:58:47.000Z",
    "description": "watch nowWarner Bros. Discovery on Tuesday said Paramount Skydance had raised its takeover offer to $31 per share, up from $30 per share, in a proposa",
    "body": "watch nowWarner Bros. Discovery on Tuesday said Paramount Skydance had raised its takeover offer to $31 per share, up from $30 per share, in a proposal that could \"reasonably be expected\" to top an existing deal with Netflix. Last week, WBD announced it would reengage Paramount in deal talks under a seven-day waiver from Netflix. WBD and Netflix have an agreement to sell the legacy media group's studio and streaming businesses to the streamer. Paramount is seeking to buy the entirety of WBD. \"Following engagement with PSKY during the seven-day limited waiver period, we received a revised PSKY proposal to acquire WBD, which we are reviewing in consultation with our financial and legal advisors,\" WBD said in a statement Tuesday morning. \"We will update our shareholders following the Board's review. The Netflix merger agreement remains in effect, and the Board continues to recommend in favor of the Netflix transaction.\"Later Tuesday, WBD said the amended Paramount offer was for $31 per share, all cash, and included a $7 billion breakup fee in the event the proposed merger doesn't win regulatory approval. Paramount has also agreed to pay the $2.8 billion breakup fee that WBD would owe Netflix if it were to abandon that deal, as well as a so-called ticking fee tied to delays in getting regulators' approval, WBD said. \"The Board has not made a determination as to whether the revised PSKY proposal is superior to the merger with Netflix,\" it said in a statement. \"WBD will engage further with PSKY to determine if a proposal that constitutes a 'Company Superior Proposal,' as defined in the Netflix Merger Agreement, can be reached.\"If WBD deems the new Paramount offer superior, Netflix will have four days to improve its previously agreed-upon bid. Netflix agreed to acquire WBD's studio and streaming assets for $27.75 per share in December, valuing the assets at around $72 billion, with a total enterprise value of approximately $82.7 billion. Paramount subsequently launched a hostile tender offer to WBD shareholders for $30 per share for all of WBD, which includes linear cable networks such as CNN, TBS, HGTV and TNT and digital assets including Bleacher Report and House of Highlights.The Warner Bros. Discovery board said Tuesday it continued to advise shareholders not to take action in response to the tender offer. A combined Paramount-WBD would bring together HBO Max with Paramount+ along with merging two of the five largest movie studios by revenue — Warner Bros. and Paramount Skydance Studios. It would also put CNN and CBS News under one ownership structure.  Both the Netflix-WBD deal and a potential Paramount-WBD merger would need U.S. and European regulatory approval for completion, and both deals have raised antitrust concerns among critics. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WBD says Paramount raised its bid to $31 per share, board will weigh offer against Netflix deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108268783-1771881963429-gettyimages-2263189469-dji_20260223103436_0070_d_odjqpfrl.jpeg?v=1771973387&w=1920&h=1080"
      ],
      "datePublished": "2026-02-24T22:58:47.000Z",
      "dateModified": "2026-02-24T22:58:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jamie Dimon says AI is already reshaping JPMorgan Chase's workforce as bank plans 'huge redeployment’",
    "url": "https://www.cnbc.com/2026/02/24/jpm-ceo-jamie-dimon-ai-reshaping-workforce-redeployment.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214915-17610711142025-10-21t151421z_358950546_rc2fghavfya6_rtrmadp_0_jpmorgan-new-york.jpeg?v=1771966417&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-24T21:33:36.000Z",
    "description": "Jamie Dimon, chairman and CEO of JPMorgan Chase, attends the ribbon-cutting ceremony opening the firm’s new headquarters at 270 Park Ave., in New York",
    "body": "Jamie Dimon, chairman and CEO of JPMorgan Chase, attends the ribbon-cutting ceremony opening the firm’s new headquarters at 270 Park Ave., in New York, Oct. 21, 2025.Eduardo Munoz | ReutersJPMorgan Chase CEO Jamie Dimon said the bank is taking steps to address the impact of artificial intelligence on its workers, and part of what he said should be a broader societal response to the potentially disruptive nature of AI.Dimon described at an investor meeting late Monday his bank's internal plans to shift employees into new roles as automation accelerates.\"We already have huge redeployment plans for [our] own people,\" Dimon said. \"In fact, we spoke about it today, and we have to up that a little bit so we can take people who are displaced — and we have displaced people from AI — and we offer them other jobs.\"JPMorgan, the world's biggest bank by market cap, has the industry's largest annual tech budget at nearly $20 billion. Its executives have outlined an ambitious agenda to become \"fundamentally rewired\" for the AI era.Even at this early stage, the bank's workforce provides a snapshot of what happens when corporations employ AI technology, including models from OpenAI and Anthropic, which are both used by JPMorgan's AI portal.The bank's head count was roughly unchanged at 318,512 over the past year, but there were changes below the surface: Operations and support staff fell by 4% and 2%, respectively, as the firm added 4% to roles that involve catering to clients and generating revenue.It did that by using technology to boost the number of accounts that each operations employee can handle (up 6%), reducing the per-unit cost to deal with fraud (down 11%) and making their software engineers 10% more efficient, according to the bank's presentation.  JPMorgan has doubled the use cases for generative AI this year, focusing on customer service and the firm's technology workers, Chief Financial Officer Jeremy Barnum said at the investor meeting.A JPMorgan spokeswoman declined to elaborate on Dimon's comments about plans for redeployment. Disruption risk When an analyst on Monday asked if Dimon was concerned about the risk of widespread unemployment because of AI — one of several fears circulating as every AI model update seemed to wallop the shares of public companies in recent weeks — Dimon had this response: \"We are going to deploy AI as best we can to do a better job for our customers.\" The CEO  has previously likened the potential impact of AI to that of electricity or the printing press.Beyond the \"huge redeployment plans\" for his bank, Dimon expressed concern that the rapid adoption of AI could put entire professions out of work.As a thought experiment, what if autonomous trucks were introduced overnight, he asked.\"Would you do it if you put 2 million people on the street?\" Dimon asked. \"That next job is $25,000 a year, stocking shelves.\"Businesses and governments need to begin planning for this risk now, with ideas including assistance and training for displaced workers, he said.\"Society's got to think through what it wants to do if this becomes that kind of problem,\" Dimon said. \"Now is the time to start thinking about it.\"watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jamie Dimon says AI is already reshaping JPMorgan Chase's workforce as bank plans 'huge redeployment’",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214915-17610711142025-10-21t151421z_358950546_rc2fghavfya6_rtrmadp_0_jpmorgan-new-york.jpeg?v=1771966417&w=1920&h=1080"
      ],
      "datePublished": "2026-02-24T21:33:36.000Z",
      "dateModified": "2026-02-24T21:33:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lucid widely misses earnings expectations, forecasts continued EV growth in 2026",
    "url": "https://www.cnbc.com/2026/02/24/lucid-lcid-q4-2025-results-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108244333-1766172967781-Gravity_Prod_8.jpg?v=1771975495&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-24T23:43:35.000Z",
    "description": "A Lucid Gravity coming off the line at the company's factory in Casa Grande, Arizona.Lucid Group reported mixed fourth-quarter results Tuesday as the ",
    "body": "A Lucid Gravity coming off the line at the company's factory in Casa Grande, Arizona.Lucid Group reported mixed fourth-quarter results Tuesday as the electric vehicle maker continues to face challenging market conditions and internal struggles.The company widely missed Wall Street's quarterly earnings expectations, while beating average revenue estimates by roughly 12%. It also revised its 2025 production results due to internal validation issues, but guided for a notable increase in vehicle production this year.Here's how the company performed in the fourth quarter compared with average estimates compiled by LSEG: Loss per share: $3.62 vs. a loss of $2.62 cents expected Revenue: $523 million vs. $468 million expectedLucid's results come days after the company laid off 12% of its U.S. salaried workforce in an effort to streamline operations and \"operate with greater efficiency and deliver on our commitments to gross margin improvement and long term growth,\" according to a statement from the company.Interim Lucid CEO Marc Winterhoff described the cuts Tuesday to CNBC as a needed realignment of the company's workforce amid broader market and economic concerns as well as needed gains in efficiency. \"We are adjusting and going to a level where we think we want to be and need to be,\" he said. \"But it's nothing that will continue in the future.\"For 2026, the company announced a vehicle production target of between 25,000 and 27,000 units. That would mark an increase of roughly 40% to 51% compared with the year-end figures the company released Tuesday.Lucid said the revision for the year — from 18,378 units to 17,840 units — came as \"538 vehicles had not completed certain internal procedures required under its final validation process to be classified as produced.\"The company said the vehicles are expected to be completed this year, with the change not affecting its previously reported financial results.Winterhoff described the expected growth as \"healthy,\" but not \"outrageous\" given the current slowdown in overall vehicle sales, including EVs.\"Our initial plans were higher, but we wanted to really be conservative and make sure that we are hitting the numbers that we are projecting,\" he told CNBC.watch nowLucid is expected to begin production of a new, less expensive midsize vehicle at the end of this year, but Winterhoff said it will not be material to its 2026 production plans. He said the automaker's Gravity SUV is expected to account for the majority of its production and sales this year, followed by the Air sedan. The company also plans to launch its first Lucid robotaxis with previously announced partners.Winterhoff said the company's main priorities this year are achieving its production target, growing sales, continuing efficiency gains and preparing for production of the midsize vehicle and robotaxis. \"We really want to make sure that we [are] on our path to profitability, make sure that we're not spending money that we don't have to. That's very, very important,\" he told CNBC.Lucid has yet to say when the company expects to be profitable. It is scheduled to host an investor day on March 12 in New York.Lucid said it ended last year with approximately $4.6 billion in total liquidity, which Lucid CFO Taoufiq Boussaid said was \"strong\" and would provide flexibility \"to execute near-term objectives while investing in future growth.\"Lucid reported a net loss of $2.7 billion in 2025, in line with a $2.71 billion loss a year earlier. That includes more than doubling its year-over-year losses during the fourth quarter to $814 million. It reported a loss of $12.09 per share for the year. The company's 2025 revenue was up 68% to $1.35 billion, including more than doubling year-over-year results during the fourth quarter.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lucid widely misses earnings expectations, forecasts continued EV growth in 2026",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108244333-1766172967781-Gravity_Prod_8.jpg?v=1771975495&w=1920&h=1080"
      ],
      "datePublished": "2026-02-24T23:43:35.000Z",
      "dateModified": "2026-02-24T23:43:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cava reports surprise same-store sales growth, driven by menu prices",
    "url": "https://www.cnbc.com/2026/02/24/cava-q4-2025-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222033-1762377839835-gettyimages-2155068073-dsc00302copy_pdyjfhzz.jpeg?v=1762377879&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-24T22:17:31.000Z",
    "description": "watch nowCava, the fast-casual Mediterranean restaurant chain, reported record-breaking revenue for fiscal year 2025 on Tuesday and forecast sales gro",
    "body": "watch nowCava, the fast-casual Mediterranean restaurant chain, reported record-breaking revenue for fiscal year 2025 on Tuesday and forecast sales growth for fiscal year 2026.Shares gained roughly 10% in extended trading Tuesday. \"While there are a lot of factors around us that are creating pressures from a margin perspective, our model has allowed us to be very thoughtful and minimize price increases to our guests and to consumers in general, which really helps elevate our value perception,\" CFO Tricia Tolivar told CNBC. Though the company said last quarter that it saw a pullback among younger consumers, Tolivar said that trend came to an end in the final three months of its fiscal year.\"We actually saw firming in that category, and overall [we're] seeing improvement in our trends across income cohorts, age cohorts, different parts of the country,\" Tolivar said. \"And in fact, we believe there's a little bit of a bridge that we've been able to create in this K-shaped economy, where we want to be accessible for everyone, and we're doing our best to ensure that our amazing culinary and incredible hospitality is there for all customers across the country.\"She added that some of Cava's best performing restaurants are in markets where median household incomes are lower.The restaurant chain reported same-store sales up 0.5% in its fiscal fourth quarter, compared to Wall Street estimates of a 1.1% decline, according to StreetAccount. Much of that growth was thanks to menu prices and product mix, and partially offset by a 1.4% decline in foot traffic, the company said. Tolivar said Cava raised prices about 1.7% at the beginning of 2025 and that 2026 would see \"very modest increases.\"The company also recorded 72 net new restaurant openings in fiscal 2025 for a total of 439 locations.Here's how Cava performed in the period ended Dec. 28 compared with what Wall Street was expecting, based on a survey of analysts by LSEG:Earnings per share: 4 cents vs. 3 cents expectedRevenue: $275 million vs. $268 million expectedIn the fourth quarter, Cava reported net income of $4.9 million, or 4 cents per share, compared to $78.6 million, or 66 cents per share, in the fourth quarter of 2024. Revenue of $275 million marked an increase of nearly 21% year over year. For the full fiscal year, the company reported record-breaking revenue surpassing $1 billion, a growth of more than 20% compared to the year prior. Same-restaurant sales for the year increased by 4%. \"We believe our momentum reflects more than just expansion,\" CEO Brett Schulman said on a call with analysts. \"It signals that our value proposition is resonating with today's increasingly discerning consumer, and as guests become more intentional with their spend, they are choosing brands like Cava that deliver real differentiation through bold flavors, healthy food and hospitality that creates meaningful human connection.\"For fiscal year 2026, Cava said it expects 74 to 76 net new restaurant openings, in addition to same-store sales growth of 3% to 5%. Tolivar said the company is expecting strong results from its upcoming menu additions, including a salmon offering, which will mark Cava's first entry into seafood.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cava reports surprise same-store sales growth, driven by menu prices",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222033-1762377839835-gettyimages-2155068073-dsc00302copy_pdyjfhzz.jpeg?v=1762377879&w=1920&h=1080"
      ],
      "datePublished": "2026-02-24T22:17:31.000Z",
      "dateModified": "2026-02-24T22:17:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Head of Amazon’s AGI lab is leaving the company",
    "url": "https://www.cnbc.com/2026/02/24/head-of-amazons-agi-lab-is-leaving-the-company.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217403-1769610896097-108217403-1761591014974-gettyimages-2233522650-298621final.jpg?v=1771966773&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-24T22:56:50.000Z",
    "description": "Amazon logo on brick office building facade with windows, San Francisco, California, Aug. 29, 2025.Smith Collection | Gado | Archive Photos | Getty Im",
    "body": "Amazon logo on brick office building facade with windows, San Francisco, California, Aug. 29, 2025.Smith Collection | Gado | Archive Photos | Getty ImagesThe head of Amazon's artificial general intelligence lab is leaving the company less than two years after joining through a so-called acqui-hire deal of his startup Adept. David Luan announced his departure Tuesday in a LinkedIn post, saying he will exit at the end of the week \"to cook up something new.\" Amazon tapped Luan in December 2024 to oversee its newly created AGI lab, based in San Francisco. The lab is focused on \"long-term research bets,\" including developing \"useful AI agents.\" Last year, the group released Amazon's Nova Act agent, an extension of its Nova models, which the company hopes will compete with leading AI models like OpenAI's ChatGPT, Anthropic's Claude and Google's Gemini.\"There's incredible work to be done at Amazon and opportunities for me to take on more areas,\" Luan wrote. \"But with AGI so close, I decided to spend 100% of my time on teaching AI systems brand new capabilities.\" Luan's departure comes after Amazon announced a major reorganization of its AGI division late last year, bringing it under Peter DeSantis, a 27-year veteran of the company and a senior vice president in its cloud unit. AGI refers to artificial intelligence that can perform as well or better than humans on most tasks.Amazon in June 2024 hired Luan and other top executives from Adept. It also licensed technology from Adept, including some of its AI models and datasets. The deal size was not disclosed.Federal Trade Commission Chairman Andrew Ferguson in January said his agency would review these AI acqui-hire deals to learn whether tech companies are attempting to evade regulatory reviews. The agency in 2024 opened a probe into Amazon's hiring of Adept employees. AI acqui-hire deals have also come under scrutiny from lawmakers, including Sen. Elizabeth Warren, D-Mass.Amazon representatives declined to comment. WATCH: AWS CEO Matt Garman on Europe's skepticism of U.S. big tech, the AI capex wave and cloud demandwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Head of Amazon’s AGI lab is leaving the company",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217403-1769610896097-108217403-1761591014974-gettyimages-2233522650-298621final.jpg?v=1771966773&w=1920&h=1080"
      ],
      "datePublished": "2026-02-24T22:56:50.000Z",
      "dateModified": "2026-02-24T22:56:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "PayPal pops nearly 7% on report fintech startup Stripe is weighing an acquisition",
    "url": "https://www.cnbc.com/2026/02/24/paypal-stock-stripe-acquisition-report.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217464-1761596590822-gettyimages-2198545732-TFSPI_12022025-4478.jpeg?v=1771968050&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-24T22:10:28.000Z",
    "description": "Thomas Fuller | SOPA Images | Lightrocket | Getty ImagesPayPal's stock surged nearly 7% on Tuesday following a report that fintech startup Stripe is w",
    "body": "Thomas Fuller | SOPA Images | Lightrocket | Getty ImagesPayPal's stock surged nearly 7% on Tuesday following a report that fintech startup Stripe is weighing buying the payments platform. Bloomberg reported the news, citing people familiar with the matter, and said the discussions are in early stages. The report said Stripe is considering buying all or some segments of PayPal's business.The news comes a day after reports that buyer interest has picked up in the company following its recent stock slump.  PayPal and Stripe declined to comment on the report.PayPal, which is grappling with slowing growth in an increasingly competitive financial payments industry, has plummeted more than 19% since the start of the year. The company shed nearly a third of its value in 2025. Read more CNBC tech newsWaymo opens robotaxi service to 'select riders' in Houston, Dallas, San Antonio and OrlandoMeta strikes AI chip deal with AMD days after committing to deploy millions of Nvidia GPUsUber acquiring parking app SpotHero as it moves beyond ride-hailing and food deliveryTesla sues California DMV to reverse ruling that company engaged in false advertising on FSDEarlier this month, the stock plunged on lackluster profit guidance and its board appointed HP's Enrique Lores as its new CEO to start at the beginning of March.Meanwhile, fintech startup Stripe hit a $159 billion valuation on Tuesday following a secondary stock sale for employees and shareholders. That's up from the $91.5 billion a year ago. Stripe said in a business update that its revenue suite is slated to reach an annual run rate of $1 billion this year.Stripe, which ranked 10th on CNBC's Disruptor 50 list last year, has transformed into one of the most valuable private companies yet and recently acquired billing startup Metronome in January.Stripe co-founder and president John Collison told CNBC's Andrew Ross Sorkin on Tuesday that the company isn't yet aiming for an IPO, which would sidetrack its current product and business growth. Read the full Bloomberg article here.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "PayPal pops nearly 7% on report fintech startup Stripe is weighing an acquisition",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217464-1761596590822-gettyimages-2198545732-TFSPI_12022025-4478.jpeg?v=1771968050&w=1920&h=1080"
      ],
      "datePublished": "2026-02-24T22:10:28.000Z",
      "dateModified": "2026-02-24T22:10:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The global M&A boom is rolling into 2026 as AI sparks deal frenzy — but cash is getting tight",
    "url": "https://www.cnbc.com/2026/02/25/global-ma-boom-surges-2026-ai-mega-deals-capital-squeeze-merger-and-acquisition.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108268450-1771854657817-gettyimages-526243022-img_6011.jpeg?v=1771854670&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T02:46:43.000Z",
    "description": "A Goldman Sachs logo is displayed on the floor of the New York Stock Exchange in New York City, on Wednesday, August 11, 2010.  Ramin Talaie | Corbis ",
    "body": "A Goldman Sachs logo is displayed on the floor of the New York Stock Exchange in New York City, on Wednesday, August 11, 2010.  Ramin Talaie | Corbis Historical | Getty ImagesThe global mergers and acquisitions boom that defined 2025 is carrying into 2026, as companies reassess their portfolios and artificial intelligence-led demand fuels large-scale transactions. However, a tightening capital pool is forcing executives to be more selective than ever.Despite a sluggish start as Trump's sweeping tariffs early last year briefly scuttled acquisitions and new public listings, the total value of deal-making activity surged nearly 40% to a record of $4.9 trillion in 2025, according to private market intelligence firm Pitchbook.It surpassed the previous high of $4.86 trillion set in 2021, as deal count and value activity reached records, PitchBook said. Activity accelerated as central banks cut interest rates, valuations improved and companies increased spending on artificial intelligence. Markets are betting that the surge will continue, as Wall Street regains its appetite for large deals amid the prospect of lower borrowing costs.  A Bain & Company survey of 300 M&A executives found that 80% expect to sustain or increase deal activity this year, citing improved macroeconomic conditions and a growing backlog of private equity and venture capital assets awaiting exit. As abrupt shifts in trade policies settled into a pattern of less threatening change, relief turned into confidence and then a fear of missing out. Jake HenryGlobal co-leader, McKinsey's M&A Practice.  Goldman Sachs, drawing on its own poll of 600 corporate and financial sponsor clients, found that 57% believe scale and strategic growth will be the primary driver of deal decisions this year. \"As abrupt shifts in trade policies settled into a pattern of less threatening change, relief turned into confidence and then a fear of missing out,\" said Jake Henry, global coleader of McKinsey's M&A Practice.  Central to the shift is a decisive push by companies to reassess their portfolios, as geopolitical risks, economic fragmentation and uneven global growth force boards to reconsider where they operate and the risks they are willing to take. \"Leaders across industries recognize that many traditional business models have reached the limits of their historical growth engines,\" said Suzanne Kumar, executive vice president of Bain's global M&A and divestiture practice. \"Companies urgently need to reinvent themselves to get out ahead of the big forces of technology disruption, a post-globalization economy, and shifting profit pools,\" Kumar added.watch nowGoldman topped the global M&A ranking last year, advising on nearly 40 deals worth $1.48 trillion in total volume. It marked the strongest period for mega-deals by volume, according to Reuters, citing LSEG records dating back to 1980.  Still, companies remain cautious. Boston Consulting Group's M&A sentiment index rebounded to 75 from its low in late 2022 — but still remained well below the long-term average of 100, reflecting \"an improving but cautious stance.\" A higher value than the prior month indicates that M&A market momentum is accelerating, while a lower value suggests a deceleration. Tightest funding squeeze in decadesWhile the appetite for deals remains strong, the pool of discretionary capital to fund them is historically thin, forcing executives to pursue only transactions that deliver clear returns. The proportion of capital allocated to M&A hit a 30-year low in 2025, according to Bain, as companies directed more cash towards dividends, buybacks, capital expenditures as well as research and development.\"Executives must pressure test whether M&A pathways and specific deals will help the company better compete in the most attractive markets ... rethink portfolio boundaries, and make bigger, bolder decisions about what capabilities they must own vs. access,\" said Kumar. \"As competing demands for capital raise the bar for deals, disciplined reinvention and value creation are essential,\" she added. watch nowThe funding crunch has pushed private capital to the center of dealmaking. Private equity firms are seeking to deploy idle cash, borrowers are turning to private credit funds for flexibility, and sovereign wealth funds are increasingly acting as lead investors rather than passive backers.      Private equity now accounts for roughly 40% of global M&A activity, according to Goldman. Despite signs of stress in the private credit market — now valued at roughly $2.1 trillion — Goldman expects the asset class to more than double by 2030, broadening the pool of capital available to fund large transactions. AI capital expenditure 'supercycle' Blockbuster deals are fueling the resurgence in M&A, powered by AI-related demand, according to industry reports. Mega-deals valued at greater than $5 billion accounted for more than 73% of the increase in deal value in 2025, according to Bain. The number of deals exceeding the $10 billion threshold swelled to 60 last year, the highest level since 2021, said McKinsey's Henry. \"We expect more big deals in 2026, with continued consolidation and geographic expansion,\" Henry said, with AI-related service providers fueling \"big-deal fever\" this year. However, the heavy capital spending in AI could constrain M&A activity in the near term, Brian Levy, global deals industries leader at PwC, said.As AI adoption accelerates, demand for computing power has surged across digital infrastructure, energy, semiconductors, and hardware optimization. In response, many companies are opting to acquire rather than build across the technology stack. Between the first quarter of 2024 and the third quarter of last year, U.S. hyperscalers' capital expenditures averaged $760 million per day, according to Goldman Sachs. The Wall Street bank estimates that by 2030, another 65 gigawatts of data center capacity will come online — more than double the amount added from 2019 to 2024.\"Investment in AI is being directed towards data centres, energy, and other infrastructure as well as technology development and customisation,\" Levy said.\"In the near term, the scale of this multitrillion-dollar investment may divert capital and temper M&A activity.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The global M&A boom is rolling into 2026 as AI sparks deal frenzy — but cash is getting tight",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108268450-1771854657817-gettyimages-526243022-img_6011.jpeg?v=1771854670&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T02:46:43.000Z",
      "dateModified": "2026-02-25T02:46:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jamie Dimon says 'watch out’ as lofty asset prices add to economic risks: ‘My anxiety is high’",
    "url": "https://www.cnbc.com/2026/02/23/jamie-dimon-says-watch-out-as-high-asset-prices-add-to-economic-risks-my-anxiety-is-high.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108213164-1760638891942-gettyimages-2241014390-IMF_WORLD_BANK.jpeg?v=1771892516&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-24T13:17:41.000Z",
    "description": "Jamie Dimon, chief executive officer of JPMorgan Chase & Co., during the 2025 IIF annual membership meeting in Washington, Oct. 16, 2025.Samuel Corum ",
    "body": "Jamie Dimon, chief executive officer of JPMorgan Chase & Co., during the 2025 IIF annual membership meeting in Washington, Oct. 16, 2025.Samuel Corum | Bloomberg | Getty ImagesJPMorgan Chase CEO Jamie Dimon said Monday that he was anxious over the U.S. economy, citing elevated asset prices and a competitive environment in banking that reminded him of the pre-2008 crisis years.Even as economists tout the Trump administration's tax and deregulatory policies as boosting economic growth this year, Dimon said during an annual investor update that his own tendencies were to consider what could go wrong when expectations are riding high. \"My own view is people are getting a little comfortable that this is real, these high asset prices and high volumes, and that we won't have any problems,\" said Dimon, who was dressed in black and wore a brace on one of his hands.Inevitably, Dimon said, the economic cycle will turn, leading to a wave of borrower defaults that would broadly affect lenders, and often impacting industries few people expect, he said.\"There will be a cycle one day … I don't know what confluence of events will cause that cycle. My anxiety is high over it,\" Dimon said. \"I'm not assuaged by the fact that asset prices are high. In fact, I think that adds to the risk.\"While fears over how artificial intelligence models from Anthropic and OpenAI could disrupt a myriad of industries — especially software firms — have churned markets in recent weeks, the broader S&P 500 isn't far off from its all-time record level.At the same time, concerns over loans to software companies at the nexus of AI worries have walloped private credit lenders after Blue Owl spooked markets last week when it announced it had to sell assets to satisfy investors clamoring to exit one of its funds.The episode, which dragged down the shares of larger alternative asset managers including Apollo, KKR and Blackstone, led some market observers to wonder if the start of a broader downturn in credit had begun.Doing 'dumb things'\"There's always a surprise in a credit cycle,\" Dimon said. \"The surprise has often been which industry\" is impacted most, he said. \"You didn't expect utilities and phone companies in '08, '09, and this time around, it might be software, because of AI.\"Dimon also said he endorsed his deputies' comments about private credit from earlier in the investor event.Troy Rohrbaugh, co-head of the firm's commercial and investment bank, said he didn't think issues would likely be contained to private credit lenders, but instead be \"more broad-based.\"\"At this point, it feels a bit isolated to a handful of situations, but that could quite easily change, and we're prepared for that,\" Rohrbaugh said.In response to a question from the veteran banking analyst Mike Mayo, Dimon said the current environment felt similar to the three years leading into the 2008 financial crisis in that \"everyone is making a lot of money, people were leveraging, the sky was the limit.\"The JPMorgan chief said that some financial firms were \"doing some dumb things\" that involved chasing interest income, which is made through lending and investing activities, though he didn't name the companies doing so.\"You feel stupid when everyone's coining money and everyone's great … it does feel really good,\" Dimon said.\"And then when I think about all the factors taking place,\" Dimon added, \"I take a deep breath and say `watch out.'\"Dimon also addressed the perennial question of CEO succession at JPMorgan, which he built into the world's largest bank by market capitalization over his two-decade tenure.While he has often given a specific time frame for the number of years he had remaining as CEO, he avoided doing so on Monday.\"I was told to say this very specifically,\" Dimon said to scattered laughter among the analysts in attendance. \"I'm here for a few years as CEO, and maybe few after that as executive chairman.\"watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jamie Dimon says 'watch out’ as lofty asset prices add to economic risks: ‘My anxiety is high’",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108213164-1760638891942-gettyimages-2241014390-IMF_WORLD_BANK.jpeg?v=1771892516&w=1920&h=1080"
      ],
      "datePublished": "2026-02-24T13:17:41.000Z",
      "dateModified": "2026-02-24T13:17:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Chile is the latest LATAM country to be caught in a U.S.-China power struggle",
    "url": "https://www.cnbc.com/2026/02/25/chile-china-trump-rubio-visa-sanctions-us-latam.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108269144-1771946979053-gettyimages-2159755009-AFP_362K3D7.jpeg?v=1771947014&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T07:50:27.000Z",
    "description": "View of the city of Santiago and the Andes Mountains, taken from the Metropolitan Park on July 2, 2024.Rodrigo Arangua | Afp | Getty ImagesChile is th",
    "body": "View of the city of Santiago and the Andes Mountains, taken from the Metropolitan Park on July 2, 2024.Rodrigo Arangua | Afp | Getty ImagesChile is the latest Latin American country to have become embroiled in a U.S.-China power struggle.The country, which counts Washington as its top foreign investor and Beijing as its largest trading partner, is facing pressure from the White House over a subsea cable project with links to China. In a surprise move, U.S. Secretary of State Marco Rubio said late last week that the Trump administration would impose visa restrictions on three Chilean officials tied to a digital cable project proposed by Chinese firms, alleging a security threat. Chilean President Gabriel Boric, who will leave office on March 11, condemned the visa sanctions and rejected the notion that the country \"promotes any action that threatens our security or that of the region.\" Chile's outgoing left-wing government later said one of the sanctioned officials was the country's Minister of Transport and Telecommunications Juan Carlos Muñoz, without commenting on the identities of the other two.The U.S. ambassador to Chile, Brandon Judd, defended the visa restrictions on Monday, telling reporters that it is Washington's \"sovereign right to take actions when we feel that the region's security is being threatened,\" according to The Associated Press.The spat comes just days before a Latin American leader's summit in Miami, Florida — and two weeks before Chile's incoming right-wing government takes over in Santiago. Chile's President-elect Jose Antonio Kast speaks to journalists after meeting with the Italian Prime Minister at Palazzo Chigi in Rome on Febuary 5, 2026.Filippo Monteforte | Afp | Getty ImagesIt also represents a major test for José Antonio Kast's administration, following the right-wing candidate's election victory late last year.Analysts say U.S. President Donald Trump, who is seeking to counter China's strategic influence in the region, is sending an unequivocal message to Latin American countries. 'A calibrated warning'The U.S.-Chile tensions were, above all, \"a calibrated warning\" to the Kast administration that strategic infrastructure decisions will be treated as geopolitical alignment choices — rather than neutral tenders, according to Mariano Machado, Americas principal analyst at risk intelligence company Verisk Maplecroft.To be sure, digital undersea cables are the backbone of the world's internet and telecommunications infrastructure, enabling everything from international phone calls to financial transactions. By some estimates, as much as 95% of international traffic passes through these largely unseen data super-highways.A map of the world's undersea communication cables.CNBC | Jason Reginato\"The near-term external consequence is that Kast's upcoming Washington engagements – chief among them, in the Shield of the Americas summit – will become early tests of how Chile balances partners under pressure,\" Machado said.\"As US-China competition intensifies in the region, Chile's 'digital hub' ambition becomes investable only if geopolitical concerns are addressed upfront, not retrofitted after a crisis,\" he continued. \"Winning deals will be those that lock in clear governance and credible security assurances early enough to preserve bankability.\" China's embassy in Chile has reportedly accused Washington of \"obvious contempt for the sovereignty, dignity, and national interests of Chile\" following the Trump administration's visa restrictions against Chilean officials.China's strategic and economic influence in Latin America is well established, although it is thought to be the target of Trump's so-called \"Donroe Doctrine\" — a portmanteau of Donald Trump and the Monroe Doctrine, which refers to a 19th century foreign policy position that asserted Washington's influence over the Western Hemisphere.watch nowIn just the last few weeks, for example, Panama's top court ruled against Hong Kong-based CK Hutchison, saying a concession held by a subsidiary of the firm to operate ports at either end of the Panama Canal was unconstitutional. The outcome was widely seen as a victory for Trump's regional security ambitions. The U.S. has also ratcheted up pressure on Cuba's communist-run government, threatening to impose tariffs on any country that provides oil to Havana, and recently conducted an extraordinary military operation to depose Venezuelan President Nicolás Maduro.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Chile is the latest LATAM country to be caught in a U.S.-China power struggle",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108269144-1771946979053-gettyimages-2159755009-AFP_362K3D7.jpeg?v=1771947014&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T07:50:27.000Z",
      "dateModified": "2026-02-25T07:50:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. Supreme Court tariff ruling will likely allow India to keep buying Russian oil",
    "url": "https://www.cnbc.com/2026/02/25/us-tariff-ruling-india-russian-oil-purchases.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108215091-1761096966024-gettyimages-2198746513-AFP_36XT4JQ.jpeg?v=1761096974&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T02:10:50.000Z",
    "description": "US President Donald Trump and Indian Prime Minister Narendra Modi arrive to hold a joint press conference in the East Room of the White House in Washi",
    "body": "US President Donald Trump and Indian Prime Minister Narendra Modi arrive to hold a joint press conference in the East Room of the White House in Washington, DC, on February 13, 2025.    Jim Watson | Afp | Getty ImagesIndia will likely continue buying Russian oil as the U.S. Supreme Court's verdict outlawing President Donald Trump's import tariffs has constrained his trade policy options, analysts said.\"I do expect that India will maintain a healthy relationship with Russia, including on energy,\" Sarang Shidore, director of the Global South Program at the Quincy Institute for Responsible Statecraft told CNBC's Inside India. He added that India could reduce its Russian oil purchases but is unlikely to stop completely.According to energy data provider Kpler, India has imported 1.16 million barrel per day (mbd) of Russian oil so far in February, lower than an average intake of 1.71 million barrels per day in 2025.While it is too early to draw data on March and April arrivals, Muyu Xu, senior research analyst for crude at Kpler, said that \"market chatter indicates\" Indian refiners have refrained from booking April delivery of Russian oil this month following an interim US-India trade deal reached earlier this month.But following the U.S. Supreme Court's ruling on Friday that Trump did not have the legal authority to implement sweeping import tariffs under the International Emergency Economic Powers Act (IEEPA), Xu said India now has the room to maintain Russian oil imports between 800,000 and 1 million barrels per day.According to Shidore, Trump's ability to amend tariffs for reasons such as the purchase of Russian oil or factors unrelated to trade or economics will be constrained due to the court ruling.India's Ministry of Petroleum and Natural Gas did not respond to CNBC's request for comments.watch nowA thorny issueIndia's purchases of Russian oil have been a thorny issue and led to the deterioration of ties between the U.S. and India last year. In August, Trump imposed a 25% additional tariff on Indian goods to punish New Delhi for buying Russian crude, claiming that India was \"fueling [Russia's] war machine\" against Ukraine. This, in addition to the 25% reciprocal tariffs the U.S. already had in place on Indian goods, meant that Indian exports to the U.S. faced total tariffs of 50%, the highest amongst all of the U.S.' trading partners.Following the interim trade deal, the U.S. slashed its tariff on Indian goods to 18% from 50%.In an executive order on Feb 6, U.S. president Donald Trump removed its punitive 25% tariff on India, stating that New Delhi has \"committed to stop directly or indirectly importing Russian Federation oil\" and will purchase \"energy products from the United States\".But the joint statement issued by India and the U.S., announcing the interim trade deal omitted any mention of India committing to curb purchases of Russian oil. However, the statement did feature New Delhi's intentions to buy half a trillion dollars worth of U.S. goods including energy over the next five years as part of the deal.India's commitments to reduce its purchases of Russian oil \"were never formally codified and always appeared difficult to implement in practice,\" said Alexandra Hermann, lead economist at Oxford Economics.Hermann added that India's energy strategy is fundamentally driven by price considerations and a motivation to not being tied to any one supplier. \"US crude is unlikely to displace Russian barrels in any meaningful way,\" Hermann said.Hours after the U.S. Supreme Court's ruling against the IEEPA tariffs last Friday, Trump invoked Section 122 of the Trade Act of 1974 to first impose a 10% global import tariff. He subsequently increased the rate to 15%. But a U.S. Customs and Border Protection memo published Monday evening when the levy came into effect said the rate was 10%.India's trade negotiators have rescheduled their visit to Washington to firm up the interim trade deal. The visit will \"be scheduled after each side has had the time to evaluate the latest developments and their implications,\" a source told CNBC's Amitoj Singh. \"India has continued to import Russian oil despite several tariff tactics,\" said Pankaj Srivastava, senior vice president of commodity markets at Rystad Energy. The U.S. court ruling against Trump's tariffs followed by the implementation of a blanket global tariff rate of 10% dilutes any advantage that Indian exporters to the U.S. would have had from the trade deal, analysts said. In light of the recent developments, Srivastava said that the U.S. would not push India hard on the issue of reducing its Russian oil purchases and risk the \"significant\" U.S. energy exports to India.India regularly buys U.S. crude of 200,000-300,000 barrel per day, according to Kpler. As of end-January, Russia was India's largest supplier of crude oil, while the U.S. ranked sixth, data from Kpler and Rystad Energy show.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. Supreme Court tariff ruling will likely allow India to keep buying Russian oil",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108215091-1761096966024-gettyimages-2198746513-AFP_36XT4JQ.jpeg?v=1761096974&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T02:10:50.000Z",
      "dateModified": "2026-02-25T02:10:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "5 takeaways from Trump's State of Union address",
    "url": "https://www.cnbc.com/2026/02/25/takeaways-trump-state-of-the-union-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108269697-1771995138058-gettyimages-2262903794-AFP_98UU9M3.jpeg?v=1771996242&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-25T07:30:58.000Z",
    "description": "watch nowPresident Donald Trump delivered a nearly two-hour State of the Union address on Tuesday, focusing largely on the economy that he declared wa",
    "body": "watch nowPresident Donald Trump delivered a nearly two-hour State of the Union address on Tuesday, focusing largely on the economy that he declared was set to boom. The president delivered the signature annual address as he sees his poll numbers on the economy plummet ahead of the 2026 midterms, which loom less than nine months away. Those elections threaten to shift control of Congress from Republicans and Trump's control of Washington along with it. Here are five takeaways from Trump's State of the Union: 1. 401(k)'s for everybodyTrump called for the creation of a government-backed 401(k)-like plan for U.S. workers who don't receive a retirement match from their employer. \"My administration will give these oft-forgotten American workers, great people, the people that built our country, access to the same type of retirement plan offered to every federal worker,\" Trump said. \"We will match your contribution with up to $1,000 each year.\"Trump said the plan would \"ensure that all Americans can profit from a rising stock market.\"Trump and his administration have often caught flak for touting stock market gains as evidence of a booming economy, while millions of Americans are not invested in the market.A White House official granted anonymity to discuss the plan said it would grant eligible workers access to savings vehicles similar to the Thrift Savings Plan available to federal workers, which they said \"provides for an efficient savings program that includes a government match and offers diversified, index‑based, investment options and portfolio choices.\"  The plan would tap an existing program known as the \"Savers Match\" tax credit that was enacted under the 2022 Secure 2.0 law to provide an annual match of up to $1,000 to low-income workers beginning in 2027.Read more CNBC politics coverageState of the Union 2026 live updates: Trump speechEpstein files: Trump sexual abuse claims withheld by DOJSenators tell CFTC prediction market contracts need clear guidanceDemocrats seek to force refunds after Supreme Court blocks Trump tariffsTrump demands Netflix fire Susan Rice as DOJ probes Warner deal2. Trump reiterates his call to bar private equity from gobbling up homesThe president reiterated his call on Congress to pass legislation barring large institutional investors from buying up single-family homes, asking Congress to codify an executive order he signed to do so. \"I'm asking Congress to make that ban permanent, because homes for people, really that's what we want,\" Trump said. \"We want homes for people, not corporations; corporations are doing just fine.\" Trump's call to bar institutional investors from gobbling up homes echoes populist proposals from the progressive left, who are hammering the president on affordability. Democrats released another plan earlier Tuesday to limit the ability of larger investors to buy up homes, just before the State of the Union. 3. The economy is doing great, Trump saysTrump said the economy is \"roaring like never before,\" as polls continue to show voters are souring on his performance on the economy and as Democrats hammer him and Republicans on affordability. The president also took credit for what he said was the defeat of inflation, the bane of his predecessor and political nemesis, former President Joe Biden. \"Inflation is plummeting,\" Trump said. \"In 12 months, my administration has driven core inflation to the lowest level in more than five years.\"The consumer price index, a key measure of inflation, rose 2.4% in January from a year earlier, according to the latest numbers from the Bureau of Labor Statistics. That was down from 2.7% in December and lower than expected. Excluding food and energy, which are volatile, the core CPI was up 2.5%, the lowest level since April 2021.4. Democrats offer some, but not explosive, resistance in the chamberDemocrats aired their frustrations with the president at certain points in the speech, but largely avoided outright interference with the president's remarks. Trump goaded Democrats for not standing after he asked lawmakers to \"stand up and show your support\" if they agreed that the first duty of the U.S. government is \"to protect American citizens, not illegal aliens.\"That prompted a brief back-and-forth between Trump and Reps. Ilhan Omar, D-Minn., and Rashida Tlaib, D-Mich. Omar is from Minnesota, where two U.S. citizens were shot dead by federal immigration officers this year while carrying out the president's deportation agenda. Rep. Al Green, D-Texas, was ejected from the chamber for a second year in a row during a speech by Trump after he held a sign that read \"Black People Aren't Apes.\" Trump's personal social media account recently shared a blatantly racist video that depicted the Obamas as apes. 5. Trump (mostly) keeps the speech domesticTrump mostly focused his speech on domestic policy and political issues and avoided getting bogged down in his efforts abroad. The president did, however, speak briefly about Iran, where he has directed a massive military buildup and where he's been hinting he might want to strike. \"We are in negotiations with them. They want to make a deal, but we haven't heard those secret words: 'We will never have a nuclear weapon,'\" Trump said of Iran. \"My preference is to solve this problem through diplomacy. But one thing is certain, I will never allow the world's number one sponsor of terror, which they are by far, to have a nuclear weapon.\"Trump's focus on domestic issues is likely a reflection of the political reality. Democrats have taken an early lead in polling ahead of the midterms and largely swept 2025 off-year elections by focusing on affordability and kitchen-table issues. Republicans seemed to appreciate the life raft. \"What I was hoping he'd do would be to talk about the things moms and dads worry about when they lie down at night to sleep and can't. And he did,\" said Sen. John Kennedy, R-La, after the speech.— CNBC's Justin Papp and Eamon Javers contributed to this report. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "5 takeaways from Trump's State of Union address",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108269697-1771995138058-gettyimages-2262903794-AFP_98UU9M3.jpeg?v=1771996242&w=1920&h=1080"
      ],
      "datePublished": "2026-02-25T07:30:58.000Z",
      "dateModified": "2026-02-25T07:30:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]