[
  {
    "title": "2 tax credits worth thousands expire Dec. 31—how to take advantage now",
    "url": "https://www.cnbc.com/2025/12/19/energy-tax-credits-expiring-at-year-end.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243879-1766092336993-gettyimages-2158223620-hhhphotovportraitgetty2024hhh025.jpeg?v=1766092365&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T14:00:02.000Z",
    "description": "If you've been thinking about making certain energy-efficient improvements to your home, now may be a good time to act. That's because President Donal",
    "body": "If you've been thinking about making certain energy-efficient improvements to your home, now may be a good time to act. That's because President Donald Trump's so-called \"big beautiful\" budget bill, which Congress passed in July, accelerates the expiration date for two credits aimed at helping Americans pay for energy-efficient home upgrades. Both the residential clean energy and energy efficient home improvement tax credits expire Dec. 31, meaning you have just about two weeks to take advantage. The residential clean energy credit generally allows you to claim 30% of the cost of new, qualified clean energy property for your home, whether you own it or rent it — as long as you reside there. Per the IRS, these include: Solar electric panels Solar water heaters Wind turbines Geothermal heat pumps Fuel cells Battery storage technologyIf you make energy-efficient home upgrades before the end of the year, you could also qualify for the energy efficient home improvement credit, which is worth up to $3,200. That includes up to $2,000 for qualified heat pumps, water heaters, biomass stoves or biomass boilers and $1,200 for other energy-efficient property costs, including doors, windows, skylights and home energy audits — with limits per item. Talk with a tax pro before renovatingBefore you start dialing contractors, it may make sense to speak with a tax pro. The language around these credits' expiration is specific. The residential clean energy credit, per the bill's language, expires with respect to \"expenditures made after December 31.\" The energy efficient home improvement credit, meanwhile, expires for any product \"placed in service\" after year-end. For all intents and purposes, this language means the same thing for taxpayers. Any improvements or installations you plan to make must be completed by year-end to qualify for the credit. That means your qualified heat pump, solar panels or energy-efficient doors and windows must be installed, working and paid for by midnight on Dec. 31. \"You have to be very, very careful,\" says Miklos Ringbauer, a certified public accountant and founder of MiklosCPA. \"This is where you have to do your homework as a taxpayer.\"A project you're considering might require a lengthy installation or permitting process, Ringbauer says. Even if you pay for it now, you could find yourself holding the bag tax-wise if the work isn't completed before the applicable tax credit expires, he says. \"With the energy credits, it is incredibly crucial that you have the ability to properly plan it out and [make sure] everything is set,\" Ringbauer says. \"Don't leave it down to the wire.\" Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future. Use coupon code EARLYBIRD for 30% off. Offer valid from Dec. 8 to Dec. 22, 2025. Terms apply.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2 tax credits worth thousands expire Dec. 31—how to take advantage now",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243879-1766092336993-gettyimages-2158223620-hhhphotovportraitgetty2024hhh025.jpeg?v=1766092365&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T14:00:02.000Z",
      "dateModified": "2025-12-19T14:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fusion deal: Why Trump Media is merging with TAE Technologies ",
    "url": "https://www.cnbc.com/2025/12/18/trump-media-merger-fusion-tmtg-tae-technologies.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243573-1766067213002-gettyimages-2183307095-img_7378_bjntyckg.jpeg?v=1766067271&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T13:37:33.000Z",
    "description": "President Donald Trump's social media company will provide the capital needed to bring TAE Technologies' first fusion power plant online in the United",
    "body": "President Donald Trump's social media company will provide the capital needed to bring TAE Technologies' first fusion power plant online in the United States by 2031, TAE CEO Michl Binderbauer told CNBC on Thursday.Binderbauer spoke shortly after his privately held company and Trump Media and Technology Group announced plans for an all-stock merger valued at more than $6 billion.The CEO said the deal would combine Trump Media's \"fortress balance sheet\" with TAE's technologies.\"We've got capability and technology to really scale this,\" Binderbauer told CNBC.\"We've got the engineering prowess to do that, but the last piece of the puzzle was the capital,\" he said. \"Now, you're marrying capital with that underlying base of technical capability.\"Fusion is a form of nuclear power that could one day generate enormous amounts of energy by fusing atoms. The process, which powers the Sun, does not produce the long-life radioactive waste that is the byproduct of fission, the process created in traditional nuclear reactors. Despite decades of research, scientists and companies have so far been unable to commercialize fusion technology. Fusion ignition was only achieved for the first time in a laboratory setting in December 2022. But Binderbauer said he is bullish on his company's prospects to reliably generate — and sell — fusion power, now that it can tap funding from Trump Media.Trump Media, which operates the Truth Social app, will invest up to $200 million in TAE with another $100 million coming after filing with the Securities and Exchange Commission, Binderbauer said. Trump Media has meager revenue relative to its market capitalization, which was above $4 billion on Thursday, and to its balance sheet. For the third quarter that ended on Sept. 30, Trump Media had financial assets of $3.1 billion, which included cash and digital assets, the company announced last month. Trump Media for that quarter reported a net loss of $54.8 million, with sales of just under $973,000.TAE and Trump Media said that their merged company in 2026 plans, subject to regulatory approval, to \"site and begin construction on the world's first utility-scale fusion power plant,\" which would generate 50 megawatts of electrical power, an industry measurement. TAE has plans to scale up future fusion power plants to generate between 350 to 500 megawatts of power, Binderbauer said. A traditional fission nuclear power plant can generate about two to three times that much power, depending on the reactor. \"Fusion power will be the most dramatic energy breakthrough since the onset of commercial nuclear energy in the 1950s,\" Trump Media CEO Devin Nunes said on a call Thursday. \"An innovation that will lower energy prices, boost supply, ensure America's AI supremacy and revive America's manufacturing base and bolster national defense,\" Nunes said.Trump Media's investment comes as the artificial intelligence boom has left utilities scrambling to find enough power to fuel the build-out of data centers across the country. In October, the Energy Department launched a national strategy in October to accelerate the commercialization of fusion. Nunes said, \"Together with TAE, we will have the capital and public market access to scale TAE's vision to put abundant nuclear energy on the grid.\"Nunes, who is a former House member from California, and Binderbauer plan to serve as co-CEOs of the merged company.\"Nunes will continue to lead all Trump Media brand operations. Binderbauer will manage TAE Technologies,\" a news release said.TAE, whose board members include Ernest Moniz, who served as Energy secretary in the Obama administration, was founded in 1998.Since then, the company has raised more than $1.3 billion in private capital in a dozen rounds of funding, from investors such as Chevron and Alphabet's Google. Asked why TAE did not strike a deal with one of its prior investors, Binderbauer said Trump Media moved quickly and boldly.\"We have these partnerships, but this is the one that moved,\" Binderbauer said.\"I just have to reduce it to that simple sort of factor. That's really the difference,\" he said. \"We're going to build a power plant. We're going to take this technology to the commercial level.\" TAE has not yet made siting decisions or reached offtake agreements for its planned plants, Binderbauer said. \"We're in the process on that,\" he said.  \"We're going to announce that when we're ready with that, but we have a game plan.\" Michael Schwab will serve as chairman of the combined company's nine-member board. Donald Trump Jr., Nunes and Binderbauer will serve as directors. The five other members are yet to be chosen. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fusion deal: Why Trump Media is merging with TAE Technologies ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243573-1766067213002-gettyimages-2183307095-img_7378_bjntyckg.jpeg?v=1766067271&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T13:37:33.000Z",
      "dateModified": "2025-12-19T13:37:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Claire's new owner Ames Watson feuds with Asia-based suppliers over millions in unpaid debt",
    "url": "https://www.cnbc.com/2025/12/19/claires-owner-ames-watson-asia-suppliers-bankruptcy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/104929061-GettyImages-482282647.jpg?v=1765830928&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T17:14:43.000Z",
    "description": "Chris Ratcliffe | Bloomberg | Getty ImagesTween retailer Claire's is facing legal challenges from some of its Asia-based suppliers over millions in un",
    "body": "Chris Ratcliffe | Bloomberg | Getty ImagesTween retailer Claire's is facing legal challenges from some of its Asia-based suppliers over millions in unpaid debts as it tries to emerge from a second bankruptcy under new ownership, according to claims the suppliers filed in Hong Kong. The clash with vendors comes as private equity firm Ames Watson navigates its first holiday season as Claire's new owner and works to ensure it has the right merchandise in stock after buying the mall retailer and about 1,000 of its stores out of bankruptcy for $140 million in September.Since acquiring Claire's, Ames Watson has been trying to rebuild what co-founder Lawrence Berger previously told CNBC is a \"broken business.\" Its bid to get the company back to profitability will hinge in part on a successful holiday season and its ability to stock popular merchandise moving forward. The retailer's sprawling supply chain, made up of longtime vendors equipped to handle the rigorous safety standards governing children's products, has long been considered the company's \"secret sauce,\" former Claire's CEO Ron Marshall told CNBC. Without the support of those suppliers during its first bankruptcy in 2018, the retailer's holiday season would've been a \"nightmare,\" said Marshall, who led the company from 2016 to 2019.The dispute with suppliers adds another challenge for Ames Watson as it tries to fix the long struggling retailer. As the U.S. hits the final days of peak shopping, Ames Watson said \"Claire's has inventory in place for the holiday season.\"A clash over ordersClaire's disputes with its suppliers in Asia surround orders placed in the months before the retailer's second bankruptcy filing in August, when it was still owned by hedge fund Elliott Management and having financial difficulties. Claire's ordering volume for one supplier had dropped by 79% in March and 76% in April compared to the prior year, records reviewed by CNBC show. Then ordering ramped back up to the company's regular cadence in May and June, with volume down only 2% and 3% in those months, respectively, compared to 2024, according to the records.At the time Claire's increased its orders again, the company was running out of cash, considering outright liquidation and looking for a buyer to save its business, according to a declaration Claire's CEO Chris Cramer filed with the court after the company filed for bankruptcy. While the vendors, including those who are now pursuing legal action against the retailer, were aware the company was navigating financial difficulties when the orders were placed, they expected to be paid as they had been during the retailer's first bankruptcy filing, said the people, who spoke on the condition of anonymity because the discussions were private. watch nowBut by the time the vendors finished manufacturing the body jewelry, nail polish and friendship bracelets Claire's had ordered ahead of the holiday shopping season, the retailer had filed for bankruptcy protection and the vendors weren't paid for some orders, the people said. When Ames Watson acquired the company, some of the vendors who were owed money agreed to keep working with Claire's without getting paid for those debts, concerned they'd lose one of their largest clients and potentially their business, the people said. But others refused, and have taken legal action against Claire's Hong Kong-based sourcing office RSI International, over millions in unpaid debts, according to claims the suppliers filed in the local court. Meanwhile, about a week after Ames Watson announced it would acquire Claire's out of bankruptcy, RSI International filed a notice to transfer its assets to a new entity. The business transfer gave creditors 30 days to file a claim to recoup unpaid debts, after which transferors aren't responsible for the obligations under Hong Kong Law.  In a statement to CNBC, Ames Watson didn't comment on RSI International. It said it was \"not involved in the operation or purchasing decisions made prior to the acquisition.\" \"Since then, we have focused on responsibly stewarding the business and engaging suppliers in good faith as we strengthen Claire's for the long term,\" the company said. \"We are excited about the company's direction in 2026,\" it added.Hedge fund Elliott Management, which owned Claire's at the time the orders were placed, declined to comment.The holiday stakesAt the core of Ames Watson's strategy to revive Claire's is improving its merchandise, which could become more difficult if the company has strained relationships with some suppliers. Compounding the problem is President Donald Trump's sweeping tariffs, which have already strained retail supply chains globally and raised costs for importers. Marshall, Claire's former CEO, said ensuring vendors in Asia got paid during the company's first bankruptcy was key to having the right products in place for the holiday season that year.\"These were suppliers where we had generational relationships and in many cases, represented 30, 40, 50% or even more of their total volume, and the intellectual capital that represented was core to the success of Claire's,\" Marshall said. \"There's a difference between having product on the shelves, which we could have done, and having the right product on the shelves.\"He said the disputes Claire's is having with its suppliers could \"disrupt the supply chain\" both now and moving forward, making a turnaround more difficult. \"There needs to be fresh, novel product to lure [customers] into the store, and if you don't have that continual replenishment of really exciting product, she's gonna pass you by,\" said Marshall. \"This is literally the most fickle customer in the world: an 8-year-old girl.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Claire's new owner Ames Watson feuds with Asia-based suppliers over millions in unpaid debt",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/104929061-GettyImages-482282647.jpg?v=1765830928&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T17:14:43.000Z",
      "dateModified": "2025-12-19T17:14:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Palo Alto Networks announces multibillion-dollar deal with Google Cloud",
    "url": "https://www.cnbc.com/2025/12/19/palo-alto-networks-google-cloud-ai-threats.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108187120-17555215432025-08-18t075037z_2134280156_rc2j9ga8302u_rtrmadp_0_palo-alto-networks-results.jpeg?v=1755521639&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T19:20:48.000Z",
    "description": "Dado Ruvic | ReutersPalo Alto Networks will migrate key internal workloads to Google Cloud as part of a new multibillion-dollar agreement, the compani",
    "body": "Dado Ruvic | ReutersPalo Alto Networks will migrate key internal workloads to Google Cloud as part of a new multibillion-dollar agreement, the companies announced Friday.The companies said the deal is an expansion of their existing strategic partnership and will deepen their engineering collaboration. Palo Alto Networks is now using Google's Gemini artificial intelligence models to power its copilots, and it is also using Google Cloud's Vertex AI platform, according to a release.  \"Every board is asking how to harness AI's power without exposing the business to new threats,\" BJ Jenkins, president of Palo Alto Networks, said in a statement. \"This partnership answers that question.\"Read more CNBC tech newsGoogle and Nvidia VC arms back vibe coding startup Lovable at $6.6 billion valuationMetaX and Moore Threads' IPOs underscore Chinese chipmakers' growing challenge to NvidiaInstacart shares drop on report that FTC is probing company over AI pricing toolAmazon says AI chief Rohit Prasad is leaving, Peter DeSantis to lead 'AGI' groupPalo Alto Networks, which offers a range of cybersecurity products, already has more than 75 joint integrations with Google Cloud and has completed $2 billion in sales through the Google Cloud Marketplace.As part of the new phase of the partnership, Palo Alto Networks customers will be able to protect live AI workloads and data on Google Cloud, maintain security policies, accelerate Google Cloud adoption, and simplify and unify their security solutions, the companies said. Palo Alto Networks' shares were up nearly 1% on Friday. Shares of Google parent Alphabet rose less than 1%. \"This latest expansion of our partnership will ensure that our joint customers have access to the right solutions to secure their most critical AI infrastructure and develop new AI agents with security built in from the start,\" Google Cloud President Matt Renner said in a statement.WATCH: Google unveils ‘Gemini 3 Flash’ AI model focused on speed and costwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Palo Alto Networks announces multibillion-dollar deal with Google Cloud",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108187120-17555215432025-08-18t075037z_2134280156_rc2j9ga8302u_rtrmadp_0_palo-alto-networks-results.jpeg?v=1755521639&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T19:20:48.000Z",
      "dateModified": "2025-12-19T19:20:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nine of the largest pharma companies ink deals with Trump to lower drug prices",
    "url": "https://www.cnbc.com/2025/12/19/nine-pharma-companies-ink-deals-with-trump-to-lower-drug-prices.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108244347-1766173879887-gettyimages-2252069531-TRUMP_DRUG_PRICING.jpeg?v=1766173905&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T20:12:07.000Z",
    "description": "US President Donald Trump during an announcement in the Roosevelt Room of the White House in Washington, DC, US, on Friday, Dec. 19, 2025. Will Oliver",
    "body": "US President Donald Trump during an announcement in the Roosevelt Room of the White House in Washington, DC, US, on Friday, Dec. 19, 2025. Will Oliver | Bloomberg | Getty ImagesSeveral of the largest U.S. and European-based drugmakers inked deals with President Donald Trump on Friday to voluntarily sell their medications for less, as his administration pushes to link the nation's drug prices to cheaper ones abroad.That includes Merck, Bristol Myers Squibb, Amgen, Gilead, GSK, Sanofi, Roche's Genentech, privately-held Boehringer Ingelheim and Novartis. In exchange, the companies agreed to a three-year grace period during which their products won't face Trump's planned pharmaceutical-specific tariffs – as long as the drugmakers further invest in U.S. manufacturing. Among the most notable pledges on Friday is that Bristol Myers Squibb will offer Eliquis, its blockbuster blood thinner and top-prescribed product, for free to Medicaid.The companies make up the majority of the 17 drugmakers Trump sent letters to in July, calling on them to lower prices as part of his \"most favored nation\" policy. Trump signed an executive order in May to revive that policy, calling for prices to be increased outside of the U.S. and to \"end global freeloading.\"\"As of today, 14 out of the 17 largest pharmaceutical companies ... have now agreed to drastically lower drug prices for … the American people and the American patients,\" Trump said at an event on Friday. \"This represents the greatest victory for patient affordability in the history of American health care, by far, and every single American will benefit.\"Johnson & Johnson, AbbVie and Regeneron are the remaining companies among the largest that haven't signed drug pricing deals. But Trump noted that Johnson & Johnson \"will be here next week.\" How the drug pricing deals will workThe full terms of the deals were not immediately released, which makes it unclear how broad their impact will be.The nine drugmakers agreed to take measures to reduce U.S. drug prices, including selling their existing treatments to Medicaid patients at the lowest \"most favored nation\" prices, and guaranteeing that pricing for new medicines. Trump said the drugmakers also agreed to list their most popular drugs on his upcoming direct-to-consumer website, TrumpRx, which is launching in January. Some companies also launched new or expanded existing direct-to-consumer offerings for certain drugs. For example, Gilead said in a release that it will launch a program that will allow patients to access its Hepatitis C treatment and cure, Epclusa, at a discounted price. Sanofi said it will offer discounts of nearly 70% on certain medicines to treat infections and cardiovascular and diabetic conditions on TrumpRx and other direct-to-consumer platforms. Merck said it will offer three diabetes medications, Januvia, Janumet and Janumet XR, at a roughly 70% discount to cash-paying patients through a direct-to-patient program. That program will be extended to the company's experimental daily cholesterol pill if it gets approved in the U.S., according to the company. \"I reflect on your goal of driving affordability and access to Americans, but equally, getting prices up outside the United States,\" Merck CEO Robert Davis said during the press conference. \"And we're 100% supportive of your actions.\" Meanwhile, Amgen will expand its existing direct-to-patient program to include preventative migraine medication Aimovig and autoimmune treatment Amjevita, at 60% and 80% discounted monthly prices, respectively. Earlier this year, Trump announced agreements with Eli Lilly, Novo Nordisk, Pfizer, AstraZeneca and EMD Serono to sell certain drugs directly to patients at a discount, in exchange for exemptions from his planned pharmaceutical tariffs and other benefits, such as fast-tracked reviews of new drugs. U.S. prescription drug prices on average are nearly three times higher than overseas, according to a 2024 study by RAND Corporation. Prices for branded drugs were more than four times higher, the report found. Trump signed an executive order in May to revive the most favored nation policy, calling for prices to be increased outside of the U.S. and to \"end global freeloading.\"Trade association PhRMA, which represents many major pharma companies, has said that most-favored nation pricing isn't the best way to lower drug costs for Americans, and instead blamed pharmacy benefit managers for the price disparity. The U.S. is the single most important market for many drugmakers, regardless of their home country. Despite being based across the Atlantic, European pharma companies are heavily exposed to the U.S. market, with half of the 10 largest companies on the continent generating a majority of their sales in the U.S.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nine of the largest pharma companies ink deals with Trump to lower drug prices",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108244347-1766173879887-gettyimages-2252069531-TRUMP_DRUG_PRICING.jpeg?v=1766173905&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T20:12:07.000Z",
      "dateModified": "2025-12-19T20:12:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "November home sales struggle as supply stalls",
    "url": "https://www.cnbc.com/2025/12/19/november-home-sales.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108244157-1766154648196-108244157-1766154565483-gettyimages-2251016437-yanow-housingm251212_npETP.jpg?v=1766154667&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T16:39:44.000Z",
    "description": "watch nowHigh home prices, stubbornly high mortgage rates and now less supply are all weighing on potential homebuyers. Sales of previously owned home",
    "body": "watch nowHigh home prices, stubbornly high mortgage rates and now less supply are all weighing on potential homebuyers. Sales of previously owned homes rose just 0.5% in November from October and were 1% lower than November 2024, according to the National Association of Realtors. Sales came in at an annualized rate of 4.13 million units.This count is based on closings, so it reflects contracts likely signed in September and October, when mortgage rates initially came down slightly but then stayed in a tight range.   Supply, which had been gaining for much of this year, fell in November. There were 1.43 million homes for sale at the end of the month, down 5.9% from October but up 7.5% year over year, according to the association. At the current sales pace, that represents a 4.2-month supply. A six-month supply is considered balanced between buyer and seller. \"Inventory growth is beginning to stall,\" Lawrence Yun, chief economist for the Realtors, said in a release. \"With distressed property sales at historic lows and housing wealth at an all-time high, homeowners are in no rush to list their properties during the winter months.\"Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.Sellers who were on the market also began to delist their properties at a higher rate than usual. Sellers often take unsold homes off the market heading into winter, but that dynamic was much stronger this year. And that is keeping pressure on home prices. The median price of a home sold in November was $409,200, an increase of 1.2% from November 2024, and the highest November reading on record. The Realtors use a median measurement, which can skew to what end of the market is selling most. The high end is currently doing much better than the low end. Sales of homes priced in the $100,000 to $250,000 range were down nearly 8% from a year ago, while homes priced at more than $1 million were up 1.4%.\"Wage growth is outpacing home price gains, which improves housing affordability. Still, future affordability could be hampered if housing supply fails to keep pace with demand,\" Yun said.Homes are staying on the market longer, at 36 days compared with 32 days last November. First-time homebuyers made up 30% of sales, unchanged from a year ago, but historically they make up about 40%. Investors stepped back into the market, making up 18% of transactions, up from 13% in November 2024.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "November home sales struggle as supply stalls",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108244157-1766154648196-108244157-1766154565483-gettyimages-2251016437-yanow-housingm251212_npETP.jpg?v=1766154667&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T16:39:44.000Z",
      "dateModified": "2025-12-19T16:39:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeffrey Epstein: Dems say DOJ breaking law with plan to release files over time",
    "url": "https://www.cnbc.com/2025/12/19/jeffrey-epstein-files-doj-release-order-maxwell.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106012127-1562782068149rts2lp7i.jpg?v=1689367248&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T17:30:45.000Z",
    "description": "U.S. financier Jeffrey Epstein appears in a photograph taken for the New York State Division of Criminal Justice Services' sex offender registry March",
    "body": "U.S. financier Jeffrey Epstein appears in a photograph taken for the New York State Division of Criminal Justice Services' sex offender registry March 28, 2017 and obtained by Reuters July 10, 2019.New York State Division of Criminal Justice Services | Handout | ReutersA top Department of Justice official on Friday said the department will not release all of its investigative files about the notorious sex offender Jeffrey Epstein on Friday, but instead will stretch out the release over several weeks.That plan unveiled by Deputy Attorney General Todd Blanche to partially release the files, with an initial batch of several hundred thousand documents, seemed to conflict with the Epstein Files Transparency Act, which set the deadline for the release of all the files for Friday.Democrats in Congress slammed the plan, and President Donald Trump, hours after Blanche spoke.\"Donald Trump and the Department of Justice are now violating federal law,\" Rep. Robert Garcia and Jamie Raskin said in a joint statement. \"We are now examining all legal options in the face of this violation of federal law.\"Blanche, during an interview on Fox News, said, \"I expect that we're going to release several hundred thousand documents today.\"\"I expect that we're going to release more documents over the next couple of weeks, so today several hundred thousand, and then over the next couple weeks,\" Blanche said. \"I expect several hundred thousand more.\"Blanche said the DOJ is reviewing each file to redact names and identities of Epstein's victims. \"There's a lot of eyes looking at these, and we want to make sure that when we do produce the materials that we're producing, that we're protecting every single victim,\" he said. CNBC has asked DOJ for comment on Blanche's statement.Senate Minority Leader Chuck Schumer blasted the DOJ, Blanche, and Attorney General Pam Bondi after the interview, saying, \"This is nothing more than a cover up to protect Donald Trump from his ugly past.\"\"The law Congress passed and President Trump signed was clear as can be — the Trump administration had 30 days to release ALL the Epstein files, not just some,\" Schumer said in a statement.\"Failing to do so is breaking the law. This just shows the Department of Justice, Donald Trump, and Pam Bondi are hellbent on hiding the truth,\" he said.\"Senate Democrats are working closely with attorneys for the victims of Jeffrey Epstein and with outside legal experts to assess what documents are being withheld and what is being covered up by Pam Bondi,\" Schumer said. \"We will not stop until the whole truth comes out.\"The text of the Epstein Files law says: \"Not later than 30 days after the date of enactment of this Act, the Attorney General shall, subject to subsection (b), make publicly available in a searchable and downloadable format all unclassified records, documents, communications, and investigative materials in the possession of the Department of Justice, including the Federal Bureau of Investigation and United States Attorneys' Offices, that relate to: (1) Jeffrey Epstein including all investigations, prosecutions, or custodial matters. (2) Ghislaine Maxwell.\"It is not clear whether there will be any legal consequences if the DOJ fails to meet the deadline for the release, as the department would be the entity to determine whether to prosecute a criminal or civil violation of the statute. Blanche is the second-highest-ranking DOJ official, after Bondi. Blanche previously served as a criminal defense lawyer for Trump.Garcia, D-Calif., and the Maryland Democrat Raskin in their joint statement, said, \"For months, Pam Bondi has denied survivors the transparency and accountability they have demanded and deserve and has defied the Oversight Committee's subpoena.\"\"The Department of Justice is now making clear it intends to defy Congress itself, even as it gives star treatment to Epstein's convicted co-conspirator, Ghislaine Maxwell,\" they said, referring to the fact that Maxwell was transferred to a less restrictive federal prison earlier this year after sitting for a two-day interview with Blanche.Rep. Ro Khanna, a California Democrat who co-sponsored the Epstein Files Act, in a statement after Blanche's interview said, \"If DOJ is producing real documents of interest that are not overly redacted, and if they are clear about timeline for full production then that is a positive step.\"\"They're producing 10x what they've given to our oversight committee, but they ultimately must release all of it,\" Khanna said. \"The north star remains justice for survivors and holding the rich and powerful men who raped young girls or covered up the abuse accountable.\"Khanna noted that \"the law requires to release all unclassified information by today and to provide in the federal register an explanation of anything they redact.\"\"They have had months to prepare this and they have continually rejected our offer to meet with them about this or to meet with survivors' lawyers about the logistics,\" Khanna said.\"\"That said, there are millions of pages of documents they need to go through to protect victim's identities and redact graphic materials. The fact they are even releasing hundreds of thousands of these is a historic moment for survivors across our nation.\"The files' ordered release comes after months of controversy over the Trump administration's decision to renege on past promises by top law enforcement officials to make the documents and other evidence public.In November, Congress overwhelmingly voted to compel the DOJ to release the Epstein files, and Trump signed that legislation despite having urged Republicans in Congress to oppose it.Deputy Attorney General Todd Blanche speaks during a press conference with President Donald Trump in the Oval Office of the White House, in Washington, DC, October 15, 2025. Andrew Caballero-Reynolds | Afp | Getty ImagesTrump, who had been friends with Epstein for years before the two men had a falling out in the early 2000s, had called demands to release the files a Democratic \"hoax.\"But some of the leading voices in favor of making the documents public were his fellow Republicans. Trump has never been accused of wrongdoing in connection with Epstein and has denied having been aware of Epstein's serial sexual abuse of underage girls and young women over the years.The files set to be released are related to federal investigations of Epstein over many years.The first of those probes ended in 2008, when he agreed to plead guilty to state charges in Florida related to prostitution of a person under age 18. The deal allowed him to avoid harsher federal charges. He was sentenced to 18 months in jail.Read more CNBC politics coverageEuropean Union approves over $105 billion toward Ukraine aid package for next two yearsBrown and MIT prof shooter suspect Neves Valente is found dead, authorities saysTrump Media to merge with fusion company TAE Technologies, DJT stock soarsTrump announces 'warrior dividend' of $1,776 to U.S. soldiers in prime-time speechEpstein accomplice Ghislaine Maxwell petitions to vacate sex crime convictionCongressional stock trading ban bill to get a vote in new year: House RepublicansFBI Deputy Director Dan Bongino is stepping down in JanuaryObamacare subsidies extension to get vote after 4 Republicans buck leadershipFCC chief Carr tells Senate that his agency is 'not formally ... independent'Trump vowed to block tankers carrying Venezuela's oil — nearly a dozen at sea nowKennedy Center to be renamed 'Trump-Kennedy Center,' White House saysTrump vowed to block tankers carrying Venezuela's oil — nearly a dozen at sea nowHouse passes bill to ease permits for building out AI infrastructureTrump sues BBC for $10 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationThe 66-year-old Epstein was arrested in July 2019 by federal authorities on child sex trafficking charges.He killed himself in a Manhattan jail weeks later.Epstein's former girlfriend, the British socialite Ghislaine Maxwell, was charged the following year with crimes related to recruiting and grooming underage girls for Epstein to sexually abuse.Maxwell was convicted at trial in 2021 and is serving a 20-year prison sentence.If you are having suicidal thoughts or are in distress, contact the Suicide & Crisis Lifeline at 988 for support and assistance from a trained counselor.This is developing news. Check back for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeffrey Epstein: Dems say DOJ breaking law with plan to release files over time",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106012127-1562782068149rts2lp7i.jpg?v=1689367248&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T17:30:45.000Z",
      "dateModified": "2025-12-19T17:30:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Instacart to pay $60 million to settle FTC claims it deceived customers",
    "url": "https://www.cnbc.com/2025/12/18/instacart-ftc-settlement-deceptive-billing.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107411565-1715095961087-gettyimages-2004544232-PGONCHAR_1316.jpeg?v=1766014773&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T14:00:53.000Z",
    "description": "Pavlo Gonchar | SOPA Images | Lightrocket | Getty ImagesInstacart will pay $60 million to settle allegations by the Federal Trade Commission that it m",
    "body": "Pavlo Gonchar | SOPA Images | Lightrocket | Getty ImagesInstacart will pay $60 million to settle allegations by the Federal Trade Commission that it misled users with false advertising and deployed \"unlawful subscription enrollment\" practices.The federal agency alleged that Instacart used deceptive tactics in its subscription sign-up and \"satisfaction guarantee\" advertising that caused consumers to pay more in fees, and prevented them from securing refunds.For example, the FTC said Instacart falsely dangled promises of \"free delivery\" to consumers on their first order, while shoppers were still required to pay a mandatory service fee to get their groceries delivered.The FTC also said that Instacart falsely advertised full refunds for users who had problems with their order.\"Instacart misled consumers by advertising free delivery services — and then charging consumers to have groceries delivered — and failing to disclose to consumers that signed up for a free trial that they would be automatically enrolled into its subscription program,\" Christopher Mufarrige, director of the FTC's Bureau of Consumer Protection, said in a statement.In a blog post, Instacart acknowledged the FTC settlement but denied \"any allegations of wrongdoing by the agency.\"Read more CNBC tech newsGoogle and Nvidia VC arms back vibe coding startup Lovable at $6.6 billion valuationMetaX and Moore Threads' IPOs underscore Chinese chipmakers' growing challenge to NvidiaInstacart shares drop on report that FTC is probing company over AI pricing toolAmazon says AI chief Rohit Prasad is leaving, Peter DeSantis to lead 'AGI' groupThe grocery delivery platform said it uses \"straightforward marketing, transparent pricing and fees, clear terms, easy cancellation and generous refund policies\" that comply with the law.\"This settlement allows us to move forward and remain focused on what's important to our company: delivering value for customers, shoppers and retail and brand partners in the communities we serve,\" an Instacart spokesperson said.The move comes as Instacart reportedly faces a separate probe by the FTC into its pricing practices. A wide-ranging study was released last week showing that Instacart's algorithmic pricing tools caused shoppers to pay different prices for identical items from the same store.News of the FTC probe sent Instacart shares lower by about 7% in extended trading on Wednesday. The stock closed down more than 1% on Thursday.Instacart said the FTC requested information about its retail partners' pricing practices and its pricing tools as part of the investigation that was settled on Thursday. The FTC didn't include any allegations about Instacart's pricing practices in its settlement, the company said. The FTC has recently ramped its scrutiny of companies alleged to be using deceptive billing and enrollment schemes.It sued Uber in April, claiming the ride-hail provider charged users for Uber One subscriptions without their consent. On Monday, 21 states joined the agency's lawsuit as part of an amended complaint.In September, the agency sued Live Nation and Ticketmaster for allegedly using bait-and-switch pricing tactics and illegally coordinating with ticket brokers.Earlier this month, the FTC said it was sending more than $27.6 million to consumers who were unknowingly enrolled in and charged for plans that shipped them products marketed to promote weight loss, clear skin and other health-care benefits.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instacart to pay $60 million to settle FTC claims it deceived customers",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107411565-1715095961087-gettyimages-2004544232-PGONCHAR_1316.jpeg?v=1766014773&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T14:00:53.000Z",
      "dateModified": "2025-12-19T14:00:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oracle stock jumps 8% as cloud provider joins investor group to run TikTok's U.S. business",
    "url": "https://www.cnbc.com/2025/12/19/oracle-stock-tiktok-us-trump-china.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108079907-1735227329229-108079907-1735218144667-gettyimages-1052778952-ORACLE_OPENWORLD_2018.jpg?v=1765825724&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T18:16:11.000Z",
    "description": "watch nowOracle's stock jumped 8% Friday after the cloud provider joined a group of investors slated to lead TikTok's U.S. operations. In a memo to em",
    "body": "watch nowOracle's stock jumped 8% Friday after the cloud provider joined a group of investors slated to lead TikTok's U.S. operations. In a memo to employees Thursday, TikTok CEO Shou Zi Chew said the social media company's U.S. division will be run by a joint venture that includes Oracle, Silver Lake and Abu Dhabi-based MGX. The deal is expected to close on Jan. 22.The agreement prevents the popular social platform from getting banned after President Joe Biden signed a law requiring a divestiture of the company's U.S. unit due to national security concerns. President Donald Trump extended the deadline for a deal on multiple occasions and signed an executive order in September that approved a potential plan for China-based ByteDance to divest.Oracle will be tasked with auditing and validating that TikTok follows \"agreed upon National Security Terms,\" according to the memo. China has not publicly confirmed the investment deal, but reports in Chinese state media suggest that the deal will go through, CNBC's Eunice Yoon said. State-run media reported comments from a pro-Beijing professor, who said the deal was in line with the country's laws and is \"not a sale of the algorithm.Read more CNBC tech newsGoogle and Nvidia VC arms back vibe coding startup Lovable at $6.6 billion valuationMetaX and Moore Threads' IPOs underscore Chinese chipmakers' growing challenge to NvidiaInstacart shares drop on report that FTC is probing company over AI pricing toolAmazon says AI chief Rohit Prasad is leaving, Peter DeSantis to lead 'AGI' groupOracle's cloud-based computing centers will also house sensitive U.S. data.In a note to clients on Friday, Evercore ISI called the news a \"nice win\" for the cloud company with upside potential. \"We continue to believe the recent pullback represents an interesting entry point with investors that can take a 6-12 month view,\" analysts wrote. The deal comes at the end of what has been a chaotic 2025 for the cloud provider and a massive pullback in shares in recent months over concerns about its AI infrastructure spending. Earlier this week, shares slumped on a report that talks over a $10 billion data center deal with Blue Owl Capital had reached a standstill. That exacerbated concerns over the massive — and potentially risky — funding plans behind the artificial intelligence data center buildout. Oracle shares are up 8% this year and have pulled back more than 20% over the last month. Stock Chart IconStock chart iconOracle one month stock chart.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oracle stock jumps 8% as cloud provider joins investor group to run TikTok's U.S. business",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108079907-1735227329229-108079907-1735218144667-gettyimages-1052778952-ORACLE_OPENWORLD_2018.jpg?v=1765825724&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T18:16:11.000Z",
      "dateModified": "2025-12-19T18:16:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump's name added to Kennedy Center building a day after board votes to rename DC theater",
    "url": "https://www.cnbc.com/2025/12/19/trump-kennedy-center-added-signage.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108244231-1766164097601-108244231-1766161190436-gettyimages-2252720813-_04a2891_xshlawcg.jpg?v=1766164129&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T19:12:35.000Z",
    "description": "Workers stand on lifts in front of the newly added lettering for U.S. President Dondald Trump's name at the facade of the John F. Kennedy Center for t",
    "body": "Workers stand on lifts in front of the newly added lettering for U.S. President Dondald Trump's name at the facade of the John F. Kennedy Center for the Performing Arts, a day after its board announced it would rename the institution The Donald J. Trump and The John F. Kennedy Memorial Center for the Performing Arts, in Washington, D.C., U.S., December 19, 2025. Kevin Lamarque | ReutersPresident Donald Trump's name was added to the facade of the John F. Kennedy Center for the Performing Arts on Friday, a day after the center's board voted to rename that Washington, D.C., institution the \"Trump-Kennedy Center.\" Workers affixed Trump's name to the building, above the center's original name.The center's website had already been updated on Thursday to say it is now \"The Trump Kennedy Center.\"\"Our Chairman, President Donald J. Trump, has not only saved this historic building but also created a truly bipartisan place to celebrate the arts,\" the center said in a statement Friday.Trump took effective control of the Kennedy Center in February, naming himself its chair and appointing the Board of Trustees, which voted for the new name on Thursday.White House Press Secretary Karoline Leavitt said Thursday that the board \"voted unanimously\" for the name change. But Rep. Joyce Beatty, an Ohio Democrat who is an ex officio member of the board, disputed Leavitt's claim.\"As I tried to push my button to voice my concern, to ask questions, and certainly not to vote in support of this, I was muted,\" Beatty said in a post to X. \"Yet it was said at the end it was a unanimous vote.\"Other board members also said they were muted during the vote, and that they would have voted against the name change.The law establishing the center in the 1960s says its name cannot be changed.And the law says \"no additional memorials or plaques in the nature of memorials shall be designated or installed in the public areas of the John F. Kennedy Center for the Performing Arts.\"Sen. Andy Kim, D-N.J., said in a social media post that work on the building \"needs to stop as it's illegal to change without Congress.\"Missouri Republican Rep. Robert Onder in July proposed a bill to change the Kennedy Center's to that of Trump's. The bill has no cosponsors. Kennedy family members were outraged by the center's name change.\"It is beyond comprehension that this sitting president has sought to rename this great memorial dedicated to President Kennedy,\" said Maria Shriver, who is a niece of the late president Kennedy. \"It is beyond wild that he would think adding his name in front of President Kennedy's name is acceptable.\"Kennedy's grandson, Jack Schlossberg, suggested that the renamined was spurred by his decisoin to run for a House seat from New York.\"Trump explicitly motivated to act by JACK FOR NEW YORK,\" he said in a social media post. \"Our campaign represents everything Trump can't stand or defeat.\"CNBC requested comment from Health and Human Services Secretary Robert F. Kennedy Jr. for comment. He is the nephew of the late president.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's name added to Kennedy Center building a day after board votes to rename DC theater",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108244231-1766164097601-108244231-1766161190436-gettyimages-2252720813-_04a2891_xshlawcg.jpg?v=1766164129&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T19:12:35.000Z",
      "dateModified": "2025-12-19T19:12:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump signs executive order reclassifying cannabis, opening door to broader weed access",
    "url": "https://www.cnbc.com/2025/12/18/trump-pot-reclassification-cannabis-stocks-medicare-cbd.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243763-17660841752025-12-18t185041z_661515781_rc26jialkgr4_rtrmadp_0_usa-trump.jpeg?v=1766084220&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T22:11:31.000Z",
    "description": "U.S. President Donald Trump sits in the Oval Office to sign executive orders, at the White House in Washington, D.C., U.S., Dec. 18, 2025. Evelyn Hock",
    "body": "U.S. President Donald Trump sits in the Oval Office to sign executive orders, at the White House in Washington, D.C., U.S., Dec. 18, 2025. Evelyn Hockstein | ReutersPresident Donald Trump signed an executive order Thursday directing federal agencies to reclassify marijuana, loosening long-standing restrictions on the drug and marking the most consequential shift in U.S. cannabis policy in more than half a century.The order, once finalized by the Drug Enforcement Administration, moves cannabis out of Schedule I classification — the most restrictive category under the Controlled Substances Act, alongside heroin and LSD — to a Schedule III classification, which encompasses substances with accepted medical use and a lower potential for abuse, such as ketamine and Tylenol with codeine.\"This action has been requested by American patients suffering from extreme pain, incurable diseases, aggressive cancers, seizure disorders, neurological problems and more, including numerous veterans with service-related injuries, and older Americans who live with chronic medical problems that severely degrade their quality of life,\" Trump said from the Oval Office on Thursday.  Also on Thursday, the Centers for Medicare and Medicaid Services, led by Dr. Mehmet Oz, is expected to launch a pilot program in April enabling certain Medicare-covered seniors to receive free, doctor-recommended CBD products, which must comply with all local and state laws on quality and safety, according to senior White House officials. The products must also come from a legally compliant source and undergo third-party testing for CBD levels and contaminants.Shares of cannabis conglomerates were down following the announcement, likely from worries of new compeititon from international companies.Trulieve's stock finished the day down about 23%, Green Thumb Industries fell more than 16% and Tilray Brands fell about about 4% as of close on Thursday. The AdvisorShares Pure US Cannabis ETF, which tracks American operators, slid almost 27%.\"Millions of registered patients across the United States, many of them veterans, rely on cannabis for relief from chronic and debilitating symptoms. We commend the administration for taking this historic step. This is only the beginning,\" Ben Kovler, founder and CEO of Green Thumb, said in a statement to CNBC. The reclassification is viewed by many analysts as a financial lifeline for the cannabis industry. The move exempts companies from IRS Code Section 280E, allowing them to deduct standard expenses like rent and payroll for the first time. It also opens the door for banking access and institutional capital previously sidelined by compliance fears. Many on Wall Street also expect the changes and the Medicare pilot to draw major pharmaceutical players into the sector to chase federally insured revenue.While CBD has surged in popularity in recent years, with infused consumer goods ranging from seltzers to skin care, the Food and Drug Administration has stopped short of granting the compound its full backing. Studies have found \"inconsistent benefits\" for targeted conditions, while FDA-funded research warns that prolonged CBD use can cause liver toxicity and interfere with other lifesaving medications. Currently, the FDA has only approved one CBD-based drug, Epidiolex, for rare forms of epilepsy.\"I want to emphasize that the order ... doesn't legalize marijuana in any way, shape or form, and in no way sanctions its use as a recreational drug,\" Trump said. Experts and industry insiders told CNBC this week that a reclassification could pave the way for more research into the effects of CBD use. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump signs executive order reclassifying cannabis, opening door to broader weed access",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243763-17660841752025-12-18t185041z_661515781_rc26jialkgr4_rtrmadp_0_usa-trump.jpeg?v=1766084220&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T22:11:31.000Z",
      "dateModified": "2025-12-18T22:11:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NY Fed President Williams says some 'technical factors' distorted November's CPI reading downward",
    "url": "https://www.cnbc.com/2025/12/19/ny-fed-president-williams-says-some-technical-factors-distorted-novembers-cpi-reading-downward.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229871-1763730470574-gettyimages-2233025865-WILLIAMS_ECNY.jpeg?v=1766151272&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T15:48:35.000Z",
    "description": "watch nowNew York Federal Reserve President John Williams said Friday that \"technical factors\" likely distorted November's inflation data, pushing the",
    "body": "watch nowNew York Federal Reserve President John Williams said Friday that \"technical factors\" likely distorted November's inflation data, pushing the headline reading lower than it otherwise would have been.\"There were some special factors or practical factors that really are related to the fact that they weren't able to collect data in October and not in the first half of November. And because of that, I think the data were distorted in some of the categories, and that pushed down the CPI reading, probably by a tenth or so,\" Williams said on CNBC's \"Squawk Box.\"\"It's hard to know, we'll get some when we'll get to December data, I think we'll get a better reading of how much that distortion, how big the effect was, but I do think that that was pushed down a bit by these technical factors,\" he added.The consumer price index rose at a 2.7% annualized rate last month, a delayed report from the Bureau of Labor Statistics showed. Economists polled by Dow Jones expected the CPI to have risen 3.1%.Williams said the data may have a downward bias because it was collected mainly in the second half of November, when sales were widespread, and noted there were also complications with rent and other categories. The New York Fed president said he took some comfort from categories not affected by those issues, seeing cooling price pressures in certain sectors.\"Some of the data that we're seeing is actually pretty encouraging in the sense of the CPI news. and I think it represents a continuation of the disinflationary process we've seen,\" Williams said.Because the October CPI release was canceled, Thursday's report lacked several of the standard data points typically included in a CPI report. The Bureau of Labor Statistics said it could not go back and collect October survey data, though it relied on \"nonsurvey data sources\" to construct the index. As a result, economists may be cautious about interpreting the report as clear evidence that inflation is on a sustained downward path, given the absence of an October comparison. Economists believe some some inputs to the owners' equivalent rent calculation for the canceled October month were estimated by the BLS to have zero inflation, distorting that calculation downward.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NY Fed President Williams says some 'technical factors' distorted November's CPI reading downward",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229871-1763730470574-gettyimages-2233025865-WILLIAMS_ECNY.jpeg?v=1766151272&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T15:48:35.000Z",
      "dateModified": "2025-12-19T15:48:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'FedEx is the heartbeat of the industrial economy,\" CEO says after earnings beat",
    "url": "https://www.cnbc.com/2025/12/18/fedex-heartbeat-industrial-economy-ceo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107187376-1675270681393-AP20066147412202.jpg?v=1675271486&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T23:50:02.000Z",
    "description": "watch nowFedEx CEO Raj Subramaniam reviewed the shipping company's quarter in a Thursday interview with CNBC's Jim Cramer, emphasizing strength in bus",
    "body": "watch nowFedEx CEO Raj Subramaniam reviewed the shipping company's quarter in a Thursday interview with CNBC's Jim Cramer, emphasizing strength in business-to-business transactions.\"FedEx is the heartbeat of the industrial economy — that's the global network that we have put in place,\" Subramaniam said. \"Our focus is always on differentiation and providing new value for our customers.\"\"So we are winning in key verticals,\" he continued, \"Whether it's healthcare, whether it's aerospace, whether it's defense, and now the newly-minted data center, you know, and the AI investments.\"FedEx beat on the top and bottom lines when it posted its quarterly report Thursday after close. Management also raised the low end of its full-year forecast for both earnings and revenue. Shares jumped over 2% in extended trading.Subramaniam described how FedEx is benefiting from the data center boom, saying its customers who invest billions in artificial intelligence technology need to move parts within the countries and across national borders. FedEx's global network positions it well to support large corporations, he suggested. He indicated that the business-to-business arm is growing, saying 66% of FedEx's revenue comes from that segment.International supply chain and trade patterns are changing, Subramaniam suggested, saying the world is in the middle of a transition, \"going from one equilibrium state that has been in place for 30 years or so to another.\" He said FedEx \"flexed down our capacity\" as trade between the U.S. and China has declined over the last sixth months.However, he indicated that business is picking up elsewhere.\"China's trade surplus is actually up, meaning that there's more traffic going to other parts of the world,\" Subramaniam said. \"So our intra-Asia traffic is up, our Asia to Europe — which is primarily B2B, actually —  is up. And Latin America inbound is up, Asia to the Middle East and India is up, India outbound is up.\"watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'FedEx is the heartbeat of the industrial economy,\" CEO says after earnings beat",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107187376-1675270681393-AP20066147412202.jpg?v=1675271486&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T23:50:02.000Z",
      "dateModified": "2025-12-18T23:50:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Data center deals hit record $61 billion in 2025 amid construction frenzy",
    "url": "https://www.cnbc.com/2025/12/19/data-center-deals-hit-record-amid-ai-funding-concerns-grip-investors.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218278-1761690885230-aws-ss3.png?v=1761691961&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T10:59:21.000Z",
    "description": "Global data centers dealmaking surged to hit another record high this year, driven by a rush to build out the infrastructure required for energy-inten",
    "body": "Global data centers dealmaking surged to hit another record high this year, driven by a rush to build out the infrastructure required for energy-intensive AI workloads.That surge came even as investors grew increasingly wary of inflated artificial intelligence valuations and the financing underpinning the rapid expansion of data centers. Global stocks sold off in November as worries of an AI-fueled bubble persisted.But S&P Global reported that more than $61 billion has flowed into the data center market this year, up slightly from $60.8 billion last year, amid what it called a \"global construction frenzy.\"A surge in debt financing contributed to the record high as hyperscalers increasingly tap private equity markets rather than funding the expensive infrastructure themselves. That trend has sparked concerns from some investors as they question the value of the advanced tech that data centers house.Shares of cloud company Oracle fell 5% on Wednesday following a report that Blue Owl Capital was pulling out of a deal to back a $10 billion data center in Michigan. Oracle has denied the report, but Broadcom, Nvidia and Advanced Micro Devices retreated after it was published. The Nasdaq Composite lost 1.81% in its worst day in nearly a month.Iuri Struta, TMT analyst at S&P Global Market Intelligence, said his team expects market concerns around AI and Oracle to be temporary and unlikely to have a \"massive impact\" on data center buildout and M&A in the near future.\"The competitive dynamic among frontier AI model providers, like OpenAI, Alphabet and Anthropic, is changing quickly, and this can have an impact on investor sentiment in public markets. But overall, we see demand for AI applications continuing to grow strongly in 2026.\"watch nowDespite the recent pullback in AI stocks, many analysts remain bullish on the sector. ING expects secular trends to point to healthy investment levels in 2026 driven by AI advancements and growing public and private support for digital innovation.\"There are two sides to the development of AI, one that would cater for optimism such as faster development of medicine and at the same time there would be concerns typically around (public) safety,\" Wim Steenbakkers, global head of datacenters and technology at ING, told CNBC.\"Hence uncertainty remains around the monetisation of the technology and business models. Questions around the high levels of investment will only be answered in the future when the uncertainties diminish and the applications of the technology and its advantages become clearer.\"There were more than 100 data center transactions in the first 11 months of the year, whose total value already exceeds all the deals done in 2024, according to S&P Global Market Intelligence data. The majority of those deals took place in the U.S., followed by the Asia-Pacific region.\"In Europe, the buildout of data centers is expected to grow at a lower rate than other regions, but it remains to be seen if this results in an M&A rush amid scarcity of assets,\" Struta said.The pace of growth in the U.S. is leaving Europe \"in the dust\" according to a recent report from ING which predicted data center investment in the U.S. could be fivefold higher. Growth is also increasingly coming from the Middle East, as the wealthy Gulf States look to position themselves as the next global AI hub.Debt issuance nearly doubles in 2025Debt issuance nearly doubled to $182 billion in 2025, up from $92 billion last year, according to the data from S&P. It noted that Meta and Google were among the most active issuers, with Facebook's owner raising $62 billion in debt since 2022 — nearly half of that total was issued in 2025 alone.Google and Amazon raised $29 billion and $15 billion, respectively, according to the report, which noted that hyperscalers are increasingly working with AI labs to buy assets to finance construction in an \"unusual arrangement\" that underscores the significant capital required to meet demand.Struta expects more \"robust\" M&A investment activity in the data center space in 2026.\"I wouldn't be surprised if already high valuations get even higher,\" he told CNBC. \"The buildout of new data centers can be temporarily tempered by a lack of energy supply, making already built data centers more valuable. As the availability of large data center companies remains scarce, we could see more asset sales by companies that don't view data centers as their core business.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Data center deals hit record $61 billion in 2025 amid construction frenzy",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218278-1761690885230-aws-ss3.png?v=1761691961&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T10:59:21.000Z",
      "dateModified": "2025-12-19T10:59:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump suspends U.S. green card lottery after Brown University shooting",
    "url": "https://www.cnbc.com/2025/12/19/us-green-card-lottery-suspended-after-brown-shooting-officials-say.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240689-17654720522025-12-11t163917z_391446468_rc2geiawcjv6_rtrmadp_0_usa-congress-threats.jpeg?v=1765472080&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T18:54:13.000Z",
    "description": "U.S. Homeland Security Secretary Kristi Noem speaks during a House Homeland Security hearing entitled \"Worldwide Threats to the Homeland,\" on Capitol ",
    "body": "U.S. Homeland Security Secretary Kristi Noem speaks during a House Homeland Security hearing entitled \"Worldwide Threats to the Homeland,\" on Capitol Hill in Washington, D.C., U.S. Dec. 11, 2025.  Elizabeth Frantz | ReutersU.S. Department of Homeland Security Secretary Kristi Noem said she was suspending the diversity visa program at President Donald Trump's direction, saying the man suspected of killing two students at Brown University and a MIT professor had been granted one.Noem posted on X late Thursday that she had instructed the U.S. Citizenship and Immigration Services to pause the (DV1) program \"to ensure no more Americans are harmed by this disastrous program.\"On Dec. 13, two students died and nine others were injured when someone opened fire at the physics building at Brown University in Providence, Rhode Island. Police later identified Portuguese national Claudio Manuel Neves Valente, 48, as the suspect.Valente was a former student at the university and had been enrolled in a Ph.D. program in physics in 2000, the university's president, Christina H. Paxson, said. Valente is also suspected of having killed MIT physics professor Nuno Loureiro, 47, in his home in Brookline, Massachusetts, two days after the Brown shooting. Valente and Loureiro are believed to have attended the same university in their native Portugal.Authorities announced the suspect's identity hours after Valente was found dead in a New Hampshire storage facility on Thursday, Providence Police Chief Oscar Perez said. Guns were also found at the scene.\"There's no longer a threat to the public,\" the U.S. attorney's office in Boston said in a statement after Valente's death was confirmed. Authorities believe Valente acted alone and have not disclosed a motive for the killings. Noem said that Valente entered the U.S. through the DV1 program in 2017 and was granted a green card.\"In 2017, President Trump fought to end this program, following the devastating NYC truck ramming by an ISIS terrorist, who entered under the DV1 program, and murdered eight people,\" she wrote on X.The Diversity Immigrant Visa Program (DV Program) allocates up to 50,000 immigrant visas every year, according to the USCIS website.The program is a lottery. Visas are randomly allocated to individuals from countries with low rates of immigration to the U.S.— Dan Mangan contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump suspends U.S. green card lottery after Brown University shooting",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240689-17654720522025-12-11t163917z_391446468_rc2geiawcjv6_rtrmadp_0_usa-congress-threats.jpeg?v=1765472080&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T18:54:13.000Z",
      "dateModified": "2025-12-19T18:54:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]