[
  {
    "title": "Deutsche Bank beats profit expectations in fourth-quarter earnings",
    "url": "https://www.cnbc.com/2026/01/29/deutsche-bank-q4-earnings-2025-profits-revenues-german-lender.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108010300-1721732502170-gettyimages-2159801467-20240702_deutsche_bank_004.jpeg?v=1769669075&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T06:57:46.000Z",
    "description": "Deutsche Bank said Thursday it had record profits during the fourth quarter of 2025. The German lender's fourth-quarter results statement showed net p",
    "body": "Deutsche Bank said Thursday it had record profits during the fourth quarter of 2025. The German lender's fourth-quarter results statement showed net profit attributable to shareholders came in at 1.3 billion euros ($1.56 billion) for the three-month period. That beat the 1.12 billion euros forecast by analysts.Overall, Deutsche Bank's group revenues came in at 7.73 billion euros for the three-month period ending December, which was in line with an estimate of 7.72 billion euros produced by LSEG.Meanwhile, its CET 1 capital ratio — which offers a snapshot of bank solvency — was 14.2% for the fourth quarter, down slightly from 14.5% in the previous quarter, and up on 13.8% for the same period in 2024.Stock Chart IconStock chart iconDeutsche Bank.Elsewhere, credit impairment — a measure of how a loan portfolio is negatively impacted by credit losses — came in at 395 million euros, down on the 408.3 million euros predicted by analysts, and down from 417 million euros in the third quarter.James Von Moltke, chief financial officer at Deutsche Bank, said the results pointed to \"fantastic record years\" for the bank's fixed income and currencies businesses, and its asset management unit DWS, with growth also seen in its private banking business. On the flipside, 2025 proved a \"slightly weaker year\" for corporate activity, with investment banking and capital markets also slower.Speaking with CNBC's \"Europe Early Edition,\" Von Moltke said that all four of the bank's businesses are \"really well positioned, intrinsically and in this environment\" to perform well in 2026. He said there is optimism for growing the IPO pipeline. He also admitted it's \"hard to speculate\" over a potential market correction.\"There are good reasons to believe [markets] might be overstretched; there are good reasons to believe that the market can continue to perform,\" he said. \"There's currently a risk on sentiment that's pervasive in the marketplace… absent some sort of disruptive events, we actually think the markets are quite constructive.\"He expressed optimism that households in Germany will benefit from the country's fiscal expansion, and said the firm's corporate banking business is well-positioned to capitalize on this investment wave.The fourth-quarter earnings statement comes a day after German federal prosecutors launched a probe into alleged money laundering at the lender, with law enforcement officials searching Deutsche Bank's offices in Frankfurt and Berlin. Von Moltke said the bank is cooperating with investigators on the matter. He declined to comment on specific client transactions, but acknowledged reports on Wednesday that pointed to transactions going back to 2013 and 2018.\"The idea is that through the potentially late, filed or delayed filing of suspicious activity reports, there may be a predicate here for money laundering. Let's see what comes out of it,\" he added.\"It's from transactions that are well in the past. We've invested heavily over the years since in our financial crime risk management capabilities. We think those investments have been really good to position the company well and protect ourselves, as well as as the marketplace, from potential money laundering.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Deutsche Bank beats profit expectations in fourth-quarter earnings",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108010300-1721732502170-gettyimages-2159801467-20240702_deutsche_bank_004.jpeg?v=1769669075&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T06:57:46.000Z",
      "dateModified": "2026-01-29T06:57:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samsung’s profit triples, beating estimates as AI chip demand fuels memory shortage",
    "url": "https://www.cnbc.com/2026/01/29/samsung-record-q4-2025-profit-ai-hbm-ai-memory-chip-shortage.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108179470-1753922208638-gettyimages-1065011358-191112final.jpeg?v=1769641309&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T05:05:53.000Z",
    "description": "Headquarters of Samsung in Mountain View, California, on October 28, 2018. Smith Collection/gado | Archive Photos | Getty ImagesSamsung Electronics re",
    "body": "Headquarters of Samsung in Mountain View, California, on October 28, 2018. Smith Collection/gado | Archive Photos | Getty ImagesSamsung Electronics reported an over threefold surge in fourth-quarter profits on Thursday, hitting a new record and beating analysts' estimates, as a memory chip shortage and strong demand for artificial intelligence servers lifted earnings.Shares of Samsung Electronics rose 2.58% at the open on Thursday before reversing course, falling 1.54% in morning trade.In an earnings call, Samsung executives noted that while surging memory prices have benefited its chip business, rising costs are also expected to impact its smartphone and display businesses moving forward.Samsung also said that its capital expenditure declined for the full year of 2025 as it maintained a \"conservative investment approach,\" though it expected to ramp up its memory investments this year.Here are Samsung's fourth-quarter results compared with LSEG SmartEstimate, which is weighted toward forecasts from analysts who are more consistently accurate:Revenue: 93.8 trillion Korean won ($65.58 billion) vs. 93.318 trillion won expectedOperating profit: 20.1 trillion won vs. 20.018 trillion won expectedThe South Korean technology giant's quarterly revenue rose about 24% from a year earlier to hit a new record. Meanwhile, its operating profit climbed over 200% year over year. The profits surpassed Samsung's long-standing record of 17.6 trillion won set in the third quarter of 2018, while matching Samsung's own guidance of around 20 trillion won. Samsung, South Korea's largest company by market capitalization, is a leading provider of memory chips, semiconductor foundry services and smartphones.The company said in its earnings report that its memory business had helped drive earnings, setting all-time highs for quarterly revenue and operating profit, driven by an overall market price surge, sales of high-bandwidth memory and other high-value-added products. High-bandwidth memory, or HBM, is a type of memory used in chipsets for AI data centers, and Samsung has shifted more focus to the technology over the past year, under its Device Solutions (DS) Division.Makers of AI chipsets, such as Nvidia, have been clamoring for limited supplies of HBM, with demand outpacing supply. As memory companies prioritize capacity to meet that lucrative demand, it has contributed to a shortage across the broader market, pushing up prices of chips used in personal computers and mobile devices.This has been a boon for memory giants like Samsung as well as its rival SK Hynix, which reported record earnings on Wednesday.\"Looking ahead to Q1 2026, the DS Division expects AI and server demand to continue increasing, leading to more opportunities for structural growth,\" the company said.\"In response, the Division will continue to focus on profitability via a strong emphasis on high-performance products,\" it added.Smartphones Samsung's mobile experience and networks businesses, tasked with developing and selling smartphones, tablets, wearables and other devices, posted weaker results in the fourth quarter. Operating profit at the division fell to 1.9 trillion won, down 9.5% from a year earlier and over 45% from the previous quarter. The company said the losses were due to \"reduced launch effects\" from new smartphone models and intense market competition.Looking ahead to the first quarter of 2026, Samsung said it plans to strengthen its AI smartphone push by introducing what it calls \"Agentic AI experiences\" with the launch of its upcoming Galaxy S26 series. The company also aims to address higher component costs by leveraging its supplier partnerships to optimize resources and the supply chain. Meanwhile, profits from Samsung's display business, which supplies screens for consumer electronics, more than doubled to 2 trillion won in the December quarter, boosted by robust sales from smartphone brands.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung’s profit triples, beating estimates as AI chip demand fuels memory shortage",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108179470-1753922208638-gettyimages-1065011358-191112final.jpeg?v=1769641309&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T05:05:53.000Z",
      "dateModified": "2026-01-29T05:05:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Home Depot lays off 800 workers, says corporate employees will return to office 5 days a week",
    "url": "https://www.cnbc.com/2026/01/28/home-depot-layoffs-return-to-office.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108227646-1763490449034-gettyimages-2247325991-dji_20251118092100_0976_d_pnjiyag3.jpeg?v=1769642073&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-28T23:39:57.000Z",
    "description": "A Home Depot logo is displayed at one of their stores in San Diego, Nov. 8, 2025.Kevin Carter | Getty Images News | Getty ImagesHome Depot on Wednesda",
    "body": "A Home Depot logo is displayed at one of their stores in San Diego, Nov. 8, 2025.Kevin Carter | Getty Images News | Getty ImagesHome Depot on Wednesday laid off 800 workers and said corporate employees will have to return to the office five days per week.In a message to employees, CEO Ted Decker said the changes are intended to increase the company's \"speed and agility.\"\"To extend our industry-leading position, we must position the company to move faster and stay even more closely connected to our customers and frontline associates,\" he wrote in the memo.A corporate spokesperson confirmed that the company is cutting 800 roles. About 150 of the employees were based at Home Depot's headquarters in Atlanta and the rest were in remote jobs, with most in the technology organization of the company and some on other corporate teams, she said.In the employee memo, Decker said the five-day in-office policy will begin the week of April 6. He said the changes are \"essential to simplify our business and focus our energy on the priorities ahead.\"\"In-person engagement enables more meaningful support for store and field associates, drives results and reinforces our people-centric culture and inverted pyramid,\" he said.Home Depot's sales have been weaker than expected, as the retail giant waits for housing turnover and significant home improvement spending to pick up again after a boom in demand during the Covid pandemic. Company leaders have attributed slower demand to higher mortgage rates, economic uncertainty and consumers' hesitance to spring for pricier projects.The retailer missed Wall Street's earnings expectations for the third straight quarter when it posted results in November. It said that it expects full-year fiscal 2025 sales to rise about 3% and comparable sales, which take out the impact of one-time factors like store openings and calendar differences, to be slightly positive.Shares of Home Depot have fallen about 10% over the past year, trailing the S&P 500's 15% gains over the same period. So far this year, Home Depot's stock is up about 9%, however, ahead of the S&P 500's nearly 2% gains.Home Depot will report its fiscal fourth-quarter earnings on Feb. 24.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Home Depot lays off 800 workers, says corporate employees will return to office 5 days a week",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108227646-1763490449034-gettyimages-2247325991-dji_20251118092100_0976_d_pnjiyag3.jpeg?v=1769642073&w=1920&h=1080"
      ],
      "datePublished": "2026-01-28T23:39:57.000Z",
      "dateModified": "2026-01-28T23:39:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Advantest shares jump as much as 14% as AI chip boom drives record sales and higher profit outlook",
    "url": "https://www.cnbc.com/2026/01/29/advantest-shares-jump-record-quarterly-sales-ai-tester-demand-q3-2025-forecast-q4-chip-testing.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107218244-1680236397700-gettyimages-150238247-ADVANTEST.jpeg?v=1753663268&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T01:57:23.000Z",
    "description": "Employees move semiconductor testers on the assembly line of the Advantest Corp. plant in Ora, Japan on Aug. 10, 2012.Tomohiro Ohsumi | Bloomberg | Ge",
    "body": "Employees move semiconductor testers on the assembly line of the Advantest Corp. plant in Ora, Japan on Aug. 10, 2012.Tomohiro Ohsumi | Bloomberg | Getty ImagesShares of Japanese semiconductor equipment maker Advantest jumped as much as 14% Thursday after the company posted record quarterly sales, before paring gains to about 7%.Operating profit for the October-December quarter surged 64% year on year to 113.6 billion yen ($741.8 million). The company also raised its operating profit forecast for the year ending March 2026 by 21.4% to 454 billion yen on Wednesday.Growth was driven primarily by its Test System Business, where sales surged 51.1% to 723.1 billion yen as demand surged for system-on-a-chip testers used in high-performance and AI semiconductors.Stock Chart IconStock chart iconAdvantest also cited continued strength in memory testers for high-performance dynamic random-access memory.Its core business is semiconductor test systems, which verify that chips function properly and meet performance and durability standards before they are shipped.As chips used in artificial intelligence and high-performance computing become more complex, demand has grown for more advanced testing equipment to ensure quality and reliability.While Advantest's management said it does not currently expect tariffs to have a major impact, it flagged ongoing risks from geopolitical uncertainty and currency volatility, even as it sees strong tester demand to persist into the fourth quarter.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Advantest shares jump as much as 14% as AI chip boom drives record sales and higher profit outlook",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107218244-1680236397700-gettyimages-150238247-ADVANTEST.jpeg?v=1753663268&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T01:57:23.000Z",
      "dateModified": "2026-01-29T01:57:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump lowered 'temperature' on Minnesota, wants to avoid shutdown: Bessent",
    "url": "https://www.cnbc.com/2026/01/28/trump-ice-minnesota-government-shutdown-bessent.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108258247-1769613619209-Bessent3.jpg?v=1769613676&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-28T17:22:51.000Z",
    "description": "watch nowPresident Donald Trump has \"brought down the temperature\" on Minnesota, the site of major civil unrest over aggressive federal immigration ef",
    "body": "watch nowPresident Donald Trump has \"brought down the temperature\" on Minnesota, the site of major civil unrest over aggressive federal immigration efforts, Treasury Secretary Scott Bessent said Wednesday.Trump is \"urging\" Congress to take action to avoid triggering a partial government shutdown amid disputes over federal funding for the Department of Homeland Security, Bessent told CNBC's \"Squawk on the Street.\"The shutdown could begin at 12:01 a.m. ET on Saturday unless lawmakers come to a resolution on the DHS funding, which a slew of Democrats have rejected in light of the recent killing of nurse Alex Pretti by federal agents in Minneapolis.Trump is \"in constant contact\" with lawmakers \"and he is urging them not to shut down the government,\" Bessent told CNBC.Bessent spoke as the Trump administration tempers its tone after its harsh initial response to two immigration enforcement-related killings in Minneapolis that stirred waves of outrage from Democrats and even some Republicans.The Cabinet secretary declined to make a prediction about whether a shutdown — the second in less than four months — will be averted.\"I don't know what to expect. The Democrats can become unhinged like they were last time, and they don't care. Like, they think this is a way to stop President Trump,\" he said.He also warned that another shutdown could cause further economic harm. \"Especially on the service side, when the government shut down, that never comes back. So, there's a big permanent loss,\" Bessent said.The House of Representatives last week passed a more-than-$1.2 trillion spending package that includes funding for DHS, the agency in charge of federal immigration enforcement.The package, which accounts for the bulk of government spending for the fiscal year ending Sept. 30, requires Democratic support to clear the Senate's 60-vote filibuster threshold. And if the Senate changes what the House already passed, the House would have to return from a prescheduled recess to vote on any amended measure, with little time to spare before a shutdown.Democratic opposition to the spending package rapidly grew after Pretti's killing on Saturday morning. Senate Democrats now say they will vote against the package unless the DHS portion is stripped out, something Republicans have signaled they will not do.Pretti was killed just weeks after another U.S. citizen, Renee Nicole Good, was fatally shot by federal agents in Minneapolis.In both cases, the Trump administration initially came out in full-throated defense of its officers' actions while accusing the slain citizens of domestic terrorism. After widespread blowback — and after new polls showed Trump's immigration approval rating plummeting — the administration has dialed back its tone.Trump said Tuesday, \"we're going to de-escalate a bit\" in Minnesota.But Senate Minority Leader Chuck Schumer, D-N.Y., has suggested that that pivot is not enough for Democrats to drop the shutdown threat.\"The fix should come from Congress; the public can't trust the administration to do the right thing on its own,\" Schumer said Tuesday on the Senate floor.\"In the meantime, I will vote no on any legislation that funds [U.S. Immigration and Customs Enforcement] until it is reined in and overhauled, and Senate Democrats are overwhelmingly united on this issue,\" Schumer said.This is breaking news. Please refresh for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump lowered 'temperature' on Minnesota, wants to avoid shutdown: Bessent",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108258247-1769613619209-Bessent3.jpg?v=1769613676&w=1920&h=1080"
      ],
      "datePublished": "2026-01-28T17:22:51.000Z",
      "dateModified": "2026-01-28T17:22:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here are the five key takeaways from Wednesday's Fed rate decision",
    "url": "https://www.cnbc.com/2026/01/28/here-are-the-five-key-takeaways-from-wednesdays-fed-rate-decision.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108258532-17696302702026-01-28t195514z_1951810165_rc2jaja6xhvh_rtrmadp_0_usa-fed.jpeg?v=1769630313&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-28T21:59:49.000Z",
    "description": "U.S. Federal Reserve Chair Jerome Powell speaks during a press conference following a two-day meeting of the Federal Open Market Committee (FOMC) on i",
    "body": "U.S. Federal Reserve Chair Jerome Powell speaks during a press conference following a two-day meeting of the Federal Open Market Committee (FOMC) on interest rate policy, in Washington, D.C., U.S., Jan. 28, 2026. Jonathan Ernst | ReutersThe Federal Reserve wrapped up a two-day policy meeting Wednesday, delivering pretty much what the market expected and no major surprises from Chair Jerome Powell's news conference. Here are five things worth remembering:The decision: To no one's surprise, the rate-setting Federal Open Market Committee held its benchmark funds rate in a range between 3.5%-3.75%. The move broke a string of three straight cuts and could be a harbinger of a central bank not of a mind to ease again anytime soon.The dissents: As has been the custom for the past six months or so, multiple committee members broke ranks. This time, Governors Stephen Miran and Christopher Waller wanted another quarter percentage point cut. For Miran, though, it represented a bit of a turn as he deviated from three prior dissents in favor of half-point reductions.Powell's post-meeting news conference was, in a word, a snoozer. On five separate occasions, the chair delivered variations on \"I have nothing for you on that\" to questions from reporters looking to bait him into commenting on the multiple political kerfuffles surrounding the Fed. Asked for the advice he would give his successor, Powell responded,  \"Stay out of elected politics.\"From an economic standpoint, the FOMC statement and Powell's commentary reflected expectations for solid growth, a near-term tariff-fueled boost for inflation that ultimately will recede, and a labor market in stasis as the labor force participation rate plus less immigration keep hiring in check while layoffs are also muted.And the markets yawned. With little to go on, the major stock averages closed little changed. Traders are still pricing in about a 60% chance of two additional, quarter percentage point rate cuts this year. What they're saying\"The Fed delivered a rate cut, but it arrived in a somewhat hawkish package. The Fed hasn't shut the door on further cuts, but Chair Powell has raised the bar for further action. We expect the economy to grow at a solid pace next year, but it must be accompanied by job gains. The next round of jobs data may point to the exact opposite.\" — Ellen Zentner, chief economic strategist for Morgan Stanley Wealth Management.\"It's détente at the Fed for now. But a shakeup is coming with the new Fed Chair in May.\" — Heather Long, chief economist at Navy Federal Credit Union.\"Perspectively speaking, we saw this meeting as an affirmation from the Fed of what investors were already thinking. Labor conditions are not worsening, growth has accelerated and inflation has steadied for now. To put it in other words, policy rates are much closer to neutral against the current backdrop and it's time for a long pause.\" — Charlie Ripley, senior investment strategist for Allianz Investment Management.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here are the five key takeaways from Wednesday's Fed rate decision",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108258532-17696302702026-01-28t195514z_1951810165_rc2jaja6xhvh_rtrmadp_0_usa-fed.jpeg?v=1769630313&w=1920&h=1080"
      ],
      "datePublished": "2026-01-28T21:59:49.000Z",
      "dateModified": "2026-01-28T21:59:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gold jumps to fresh highs as Asia stock markets mostly rise after U.S. Fed holds rates",
    "url": "https://www.cnbc.com/2026/01/29/asia-pacific-markets-us-fed-rates-gold-nikkei-225-hsi.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108258011-1769574408496-gettyimages-672152331-bld225810.jpeg?v=1769574417&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T07:57:46.000Z",
    "description": "Traffic moves through the buildings in downtown Jakarta, Indonesia.Bloomberg | Bloomberg | Getty ImagesSpot gold prices rose to a fresh record Thursda",
    "body": "Traffic moves through the buildings in downtown Jakarta, Indonesia.Bloomberg | Bloomberg | Getty ImagesSpot gold prices rose to a fresh record Thursday after the U.S. Federal Reserve overnight kept its benchmark rate steady at a target range of 3.5% to 3.75%.The bullion rose more than 3% to breach the $5,500 per ounce mark for the first time.Asia-Pacific markets mostly rose Thursday. Australia's S&P/ASX 200 declined 0.07% to close at 8,927.5.Japan's Nikkei 225 reversed earlier losses to close slightly above the flatline at 53,358.71, while the Topix added 0.28% to 3,545.3. South Korea's Kospi rose 0.98% to end the trading day at 5,221.25 while the small-cap Kosdaq advanced 2.73% to 1,164.41.Shares of Samsung Electronics rose 2.58% at the open on Thursday before reversing course to end 1.05% lower. The company reported an over threefold surge in fourth-quarter profits Thursday, hitting a new record and beating estimates, on a memory chip shortage and strong demand for artificial intelligence servers.Hong Kong Hang Seng Index rose 0.41% in choppy trade, while mainland's CSI 300 ended the trading day 0.76% higher at 4,753.87.Investors kept an eye on developments in Indonesia after the benchmark Jakarta Composite plunged over 8% on Wednesday following index provider MSCI's statement warning of a potential downgrade of the country to frontier-market status.Trading halted after the benchmark fell 8% on Thursday, according to a press release from the bourse, while the Indonesian rupiah weakened marginally to 16,778 against the greenback. The index pared losses and was last trading 1.2% lower.Goldman Sachs lowered Indonesia to underweight on the back of expectations of further passive selling, the investment bank said in a note published Thursday. The bank's strategists also regarded this development as \"an overhang that will impede market performance.\"Singapore's central bank left its monetary policy unchanged Thursday, while warning of upside risks to inflation and demand as the city-state's economic outlook stays resilient. The country's benchmark Straits Times Index inched 0.24% higher.Overnight in the U.S., the S&P 500 reached a milestone level, hitting 7,000 for the first time, before pulling back as the Federal Reserve left interest rates unchanged and upped its economic growth assessment.The broad market index ended the day down 0.01% at 6,978.03. Earlier, the S&P 500 was up 0.3% on the day, hitting an all-time intraday high of 7,002.28. The Dow Jones Industrial Average added 0.02% to close at 49,015.60. The Nasdaq Composite outperformed and gained 0.17%, settling at 23,857.45.Treasury yields moved up following the Fed's decision, as the central bank's statement revealed that economic activity has been \"expanding at a solid pace\" and that the unemployment rate has \"shown some signs of stabilization.\"\"I think, and many of my colleagues think, it's hard to look at the incoming data and say the policy is significantly restrictive at this time,\" said Fed Chair Jerome Powell during his press conference.—CNBC's Sean Conlon and Pia Singh contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gold jumps to fresh highs as Asia stock markets mostly rise after U.S. Fed holds rates",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108258011-1769574408496-gettyimages-672152331-bld225810.jpeg?v=1769574417&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T07:57:46.000Z",
      "dateModified": "2026-01-29T07:57:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Carvana shares fall 14% following short-seller accusations",
    "url": "https://www.cnbc.com/2026/01/28/carvana-shares-fall-14percent-following-short-seller-accusations.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107164651-1670854978307-gettyimages-1448029009-029a3632_dc3d74bf-0629-47c2-ac3a-512a81ff6ade.jpeg?v=1722270037&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T03:18:31.000Z",
    "description": "A Carvana used-car vending machine displays vehicles in Miami, Dec. 9, 2022.Joe Raedle | Getty ImagesShares of Carvana plummeted 14.2% Wednesday follo",
    "body": "A Carvana used-car vending machine displays vehicles in Miami, Dec. 9, 2022.Joe Raedle | Getty ImagesShares of Carvana plummeted 14.2% Wednesday following short-seller accusations that the online used retailer overstated earnings with the help of businesses controlled by CEO Ernie Garcia III's family.  Gotham City Research alleged Wednesday that the online used car retailer, which entered the S&P 500 last month, overstated its 2023-2024 earnings by more than $1 billion, and is \"far more dependent on related parties\" connected to the family than previously disclosed.Broadly, the firm accuses Carvana's earnings of being dependent on DriveTime's debt issuance, \"toxic\" loans and accounting irregularities.Carvana, in an emailed statement, called the report \"inaccurate and intentionally misleading.\" The company said all of its \"related party transactions are accurately disclosed in our financial statements.\"Carvana also reconfirmed plans to release its 2025 earnings on Feb. 18, following Gotham claiming the company would need to delay its 10-K annual filing.To assist its claims, Gotham published the 2024 audited financials of DriveTime Automotive Group, Inc. and Bridgecrest Acceptance Corp. Both companies are owned by Ernest Garcia II, Carvana's largest shareholder and the father of the online retailer's chief executive.Stock Chart IconStock chart iconCarvana stockCNBC did not independently verify the authenticity of the financial results, which Gotham said it obtained via the Freedom of Information Act.The short-seller report is the latest in a string of short sellers targeting Carvana in recent years.Notably, disbanded short seller Hindenburg Research last year disclosed a bet against Carvana, claiming the online used-car retailer's turnaround was a \"mirage\" that was being propped up by unstable loans and accounting manipulation.Shares of Carvana have been on an unprecedented ride for the company since a bankruptcy scare around late 2022. The stock's price has jumped from less than $5 a share during that time to close Tuesday at more than $477 per share.Carvana shares closed Wednesday at $410.04, down 14.2% — marking the company's second-worst trading day in the past year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Carvana shares fall 14% following short-seller accusations",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107164651-1670854978307-gettyimages-1448029009-029a3632_dc3d74bf-0629-47c2-ac3a-512a81ff6ade.jpeg?v=1722270037&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T03:18:31.000Z",
      "dateModified": "2026-01-29T03:18:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DoubleLine’s Jeffrey Gundlach sees no more Fed rate cuts under Jerome Powell",
    "url": "https://www.cnbc.com/2026/01/28/doublelines-jeffrey-gundlach-sees-no-more-fed-rate-cuts-under-jerome-powell.html",
    "image": "https://image.cnbcfm.com/api/v1/image/102836763-NUP_170121_1425.jpg?v=1726766485&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-28T21:31:24.000Z",
    "description": "watch nowDoubleLine Capital CEO Jeffrey Gundlach said Wednesday he expects the Federal Reserve to stay on hold for the remainder of Jerome Powell's te",
    "body": "watch nowDoubleLine Capital CEO Jeffrey Gundlach said Wednesday he expects the Federal Reserve to stay on hold for the remainder of Jerome Powell's term as chair with a more balanced outlook for the economy.\"I think I would bet pretty heavily that there's not another rate cut under Jay Powell,\" Gundlach said on CNBC's \"Closing Bell.\" \"I think he's going out of his way to emphasize that inflation is a little elevated, but not as bad as maybe it was feared a few months ago, that the unemployment rate is no longer separately rising in any kind of meaningful way.\"Powell has just two policy meetings left as chair — in March and April — before his term expires. A new chair would take the helm for the June meeting, assuming Senate confirmation.On Wednesday, the central bank kept its overnight lending rate steady at a range of 3.5% to 3.75%. The post-meeting statement suggested that economic activity has been \"expanding at a solid pace,\" while policymakers also noted that the unemployment rate has shown some signs of stabilization. \"I think, and many of my colleagues think, it's hard to look at the incoming data and say the policy is significantly restrictive at this time,\" said Powell during his press conference.Fed funds futures trading suggests two quarter percentage point cuts by the end of 2026, according to the CME FedWatch Tool.\"He's talking about less tension between both sides of the mandate, and I really agree with that,\" Gundlach said, referring to the Fed's dual goals of price stability and maximum employment. \"And I think he's setting the stage.\"Gundlach reiterated his preference for international exposure, saying investors should consider allocating 30% to 40% of their portfolios to unhedged international equities. He said such positions could benefit from gains in local currencies against the U.S. dollar.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DoubleLine’s Jeffrey Gundlach sees no more Fed rate cuts under Jerome Powell",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/102836763-NUP_170121_1425.jpg?v=1726766485&w=1920&h=1080"
      ],
      "datePublished": "2026-01-28T21:31:24.000Z",
      "dateModified": "2026-01-28T21:31:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'ICE is not a law unto itself,' Minnesota judge says after immigrant released following contempt threat",
    "url": "https://www.cnbc.com/2026/01/28/ice-immigrant-minnesota-contempt-released.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108258609-17696349132025-10-30t164321z_468514237_rc2gmha87dd9_rtrmadp_0_usa-trump-migration.jpeg?v=1769638718&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-28T23:25:58.000Z",
    "description": "Todd Lyons, acting director of Immigration and Customs Enforcement, speaks during a press conference about \"Operation Midway Blitz,\" an immigration en",
    "body": "Todd Lyons, acting director of Immigration and Customs Enforcement, speaks during a press conference about \"Operation Midway Blitz,\" an immigration enforcement campaign, at a hangar in Gary, Indiana, Oct. 30, 2025.Leah Millis | ReutersA top Minnesota federal court judge on Wednesday blasted the U.S. Immigration and Customs Enforcement agency for violating nearly 100 court orders in the past month.\"This list should give pause to anyone — no matter his or her political beliefs — who cares about the rule of law,\"  Minneapolis U.S. District Court Chief Judge Patrick Schiltz wrote in a new court filing.\"ICE has likely violated more court orders in January 2026 than some federal agencies have violated in their entire existence,\" said Schiltz, who earlier this week said he would hold a hearing where acting ICE Director Todd Lyons would have to explain why the judge should not hold him in contempt of court for repeatedly violating judicial orders.The judge warned that future noncompliance by ICE with federal judicial orders could result in his ordering acting ICE Director Todd Lyons or other government officials to personally appear in court to explain their actions.\"ICE is not a law unto itself,\" Schiltz wrote.\"ICE has every right to challenge the orders of this Court, but, like any litigant, ICE must follow those orders unless and until they are overturned or vacated.\"The cases in which Schiltz accused ICE of failing to comply with judicial orders were all so-called \"habeas\" cases that challenged the legality of a person's detention.The judge's scathing broadside against ICE came as he cancelled the contempt of court proceeding for Lyons, which was scheduled for Friday.A man protests against the fatal shooting of Renee Nicole Good by a U.S. Immigration and Customs Enforcement agent, during a rally outside the Whipple federal building in Minneapolis against increased immigration enforcement across the city, Jan. 8, 2026.Tim Evans | ReutersLyons had been ordered to appear in the judge's courtroom that day to explain why federal officials refused to hold a bond hearing for a detained immigrant as Schiltz had ordered, and to explain why ICE had repeatedly violated court orders in Minnesota over immigration enforcement actions.The immigrant, Juan Hugo Tobay Robles, was released from custody in Texas on Tuesday, a day after Schiltz scheduled the hearing. Tobay Robles' lawyer, Graham Ojala-Barbour, said in a court filing, \"A supporter of Mr. Tobay Robles drove from Minnesota to Texas and is presently driving him back to Minnesota to reunite with his family and reestablish his interrupted medical care.\"Ojala-Barbour said \"a contempt proceeding may still be appropriate,\" given the federal government's violations of a prior order by the judge that a bond hearing be held.But Schiltz had said Monday that if he were told before Friday's hearing that Tobay Robles had been released, he would not require Lyons to appear in court.\"As promised, the Court will cancel the hearing, and Lyons will not be required to appear,\" the judge wrote on Wednesday.\"If Juan wants to seek monetary sanctions, he may file a properly supported motion to that effect,\" Schiltz said.\"That does not end the Court's concerns, however,\" Schiltz also wrote.Read more CNBC politics coverageFed has not yet complied with subpoenas as Powell probe continues: SourceTrump lowered 'temperature' on Minnesota, wants to avoid shutdown: BessentNYC Mayor Mamdani says city must hike taxes on wealthy to fill $12B deficitTrump warns Iran an 'armada' is heading its way and to agree to a nuclear deal, or elseU.S.-India trade talks could get a boost as America sees life going on without itCanada's Carney tells Trump 'I meant what I said in Davos'Trump says he wants 'very honorable and honest investigation' of Alex Pretti killingDemocrats to Trump: Fire Kristi Noem or risk her impeachmentThe government is barreling toward a partial shutdown over DHS funding. Here's what to expectICE chief ordered to appear in Minnesota federal court, judge threatens contempt ruling\"Attached to this order is an appendix that identifies 96 court orders that ICE has violated in 74 cases. The extent of ICE's noncompliance is almost certainly substantially understated,\" the judge said.\"This list is confined to orders issued since January 1, 2026, and the list was hurriedly compiled by extraordinarily busy judges. Undoubtedly, mistakes were made, and orders that should have appeared on this list were omitted.\"When contacted by CNBC, Ojala-Barbour said, \"We stipulated with the government that Mr Tobay Robles has been released from custody,\" but gave no further comment.ICE and the U.S. Attorney's Office for the District of Minnesota did not immediately respond to requests for comment from CNBC sent by email.Schiltz, in his order Monday demanding Lyons' appearance in court, called the order \"an extraordinary step.\"Federal agents conduct an immigration enforcement action in Saint Paul, Minnesota, Jan. 27, 2026.Seth Herald | ReutersBut the judge also said, \"This Court has been extremely patient with respondents, even though  respondents decided to send thousands of agents to Minnesota to detain aliens without making any provision for dealing with the hundreds of habeas petitions and other lawsuits that were sure to result.\"Minneapolis has been flooded with ICE and other federal agents as the Trump administration seeks to round up undocumented immigrants there and elsewhere in the state. Two U.S. citizens, Renee Good and Alex Pretti, have been fatally shot this month by federal agents during separate confrontations. Those killings have led to a nationwide backlash over the administration's aggressive immigration enforcement tactics.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'ICE is not a law unto itself,' Minnesota judge says after immigrant released following contempt threat",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108258609-17696349132025-10-30t164321z_468514237_rc2gmha87dd9_rtrmadp_0_usa-trump-migration.jpeg?v=1769638718&w=1920&h=1080"
      ],
      "datePublished": "2026-01-28T23:25:58.000Z",
      "dateModified": "2026-01-28T23:25:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta's Mark Zuckerberg gets green light from Wall Street to keep pouring money into AI",
    "url": "https://www.cnbc.com/2026/01/28/metas-zuckerberg-gets-green-light-from-wall-street-to-invest-in-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217759-1761656513846-gettyimages-2235448475-META_CONNECT.jpeg?v=1769640322&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T02:16:11.000Z",
    "description": "Mark Zuckerberg, chief executive officer of Meta Platforms Inc., during the Meta Connect event in Menlo Park, California, US, on Wednesday, Sept. 17, ",
    "body": "Mark Zuckerberg, chief executive officer of Meta Platforms Inc., during the Meta Connect event in Menlo Park, California, US, on Wednesday, Sept. 17, 2025. David Paul Morris | Bloomberg | Getty ImagesMeta CEO Mark Zuckerberg plans to ramp up his company's spending on artificial intelligence in 2026. Wall Street seems fine with that strategy. In its fourth-quarter earnings report on Wednesday, Meta beat on the top and bottom lines while also revealing that its AI-related capital expenditures this year will be between $115 billion and $135 billion. That's nearly twice the amount Meta spent on capex last year, when the company revamped its AI unit.Although investors have previously expressed concern about Meta's AI spending spree, they took comfort in the company's latest results, which showed 24% year-over-year revenue growth, driven by online ads. Meta shares, which trailed the market last year, popped as much as 10% in after-hours trading.\"As we plan for the future, we will continue to invest very significantly in infrastructure to train leading models and deliver personal super intelligence to billions of people and businesses around the world,\" Zuckerberg told analysts during the earnings call. Zuckerberg was referring to Meta's ambitious data center buildouts intended to anchor both current and future AI projects.Meta finance chief Susan Li told analysts that the company continues to be \"capacity constrained,\" meaning it needs more computing power to further improve its core ad business while also providing its AI team the necessary resources to create more advanced models and products.\"Our teams have done a great job ramping up our infrastructure through the course of 2025, but demands for compute resources across the company have increased even faster than our supply,\" Li said.Zuckerberg said 2026 will be a major year for AI, with Meta's investments geared towards supporting his mission for \"building personal super intelligence.\"Whether Meta will have much by way of new AI products that can generate revenue remains a major question, and one Zuckerberg hasn't clearly answered. \"I mean, we're going to roll out new products over the course of the year,\" Zuckerberg said on the call. \"I think the important thing is, we're not just launching one thing, and we're building a lot of things.\"Perhaps Zuckerberg's biggest swing last year was the $14.3 billion investment in Scale AI, which brought founder and CEO Alexandr Wang and some of his top engineers and researchers to Meta. Wang is now leading Meta's TBD AI unit, which has been testing a new frontier model code-named Avocado that's intended to be a successor to the company's Llama family of models, CNBC reported.\"I expect our first models will be good but, more importantly, will show the rapid trajectory that we're on,\" Zuckerberg said Wednesday. \"And then I expect us to steadily push the frontier over the course of the year as we continue to release new models.\"Asked on the call why Meta needs to develop its own powerhouse AI foundation model, Zuckerberg said  it's important because Meta is a \"deep technology company.\"Meta can't risk being \"constrained to what others in the ecosystem are building or allow us to build,\" he said, adding that controlling a model allows you to help \"shape the future of these products.\"In the meantime, online advertising still accounts for the overwhelming majority of Meta's revenue. As long as that business continues to dominate in mobile, exceed expectations and throw off billions of dollars of cash a quarter, Zuckerberg is likely to get plenty of leeway to pursue his AI ambitions.WATCH: Meta and Google go to trial over child safety — here's what's at stake.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta's Mark Zuckerberg gets green light from Wall Street to keep pouring money into AI",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217759-1761656513846-gettyimages-2235448475-META_CONNECT.jpeg?v=1769640322&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T02:16:11.000Z",
      "dateModified": "2026-01-29T02:16:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SK Hynix overtakes Samsung in annual profit for the first time as AI reshapes rivalry",
    "url": "https://www.cnbc.com/2026/01/29/sk-hynix-beats-samsung-2025-profit-ai-memory-hbm.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108258730-1769661678815-gettyimages-1953499861-AFP_34GU796.jpeg?v=1769661707&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T07:49:49.000Z",
    "description": "A SK Hynix flag (R) and a South Korean national flag (L) flutter outside the company's Bundang office in Seongnam on Jan. 26, 2024. Jung Yeon-je | Afp",
    "body": "A SK Hynix flag (R) and a South Korean national flag (L) flutter outside the company's Bundang office in Seongnam on Jan. 26, 2024. Jung Yeon-je | Afp | Getty ImagesSK Hynix beat rival Samsung Electronics in operating profit for the first time in 2025, as it retained its lead in high-bandwidth memory used in artificial intelligence chips. The two South Korean memory makers went head-to-head this week, with SK Hynix reporting earnings on Wednesday and Samsung on Thursday morning local time.SK Hynix posted a record operating profit of 47.2 trillion won for the full year, surpassing Samsung's 43.6 trillion won. The comparison underscores SK Hynix's ascension in South Korea's tech space since it was acquired by SK Telecom for about $3 billion in 2012. SK Hynix focuses almost entirely on memory chips, while Samsung operates across multiple businesses, including consumer electronics and contract chip manufacturing. Samsung's memory segment generated operating profits of about 24.9 trillion won in 2025.SK Hynix's success is in large part thanks to its entrenched position as the global leader in high-bandwidth memory, or HBM, a specialized chip used in AI processors and servers such as those produced by Nvidia. \"SK Hynix is clearly an outstanding 'AI Winner' in Asia,\" said MS Hwang, research director at Counterpoint Research, adding that its lead in quality and supply of HBMs and other chips used in AI servers has been crucial in the current phase of the AI infrastructure boom.  SK Hynix has maintained its market lead in both areas, even as Samsung regained the top spot in memory revenue rankings in the fourth quarter of 2025, said Hwang.However, competition is ramping up.  While SK Hynix managed to gain an early lead in HBM and secured the lion's share of Nvidia memory contracts last year, competitors like Samsung and Micron have been making some breakthroughs. Samsung has expanded its HBM sales and said it remains on track to begin delivering HBM4 products — the latest, sixth-generation HBM technology — this year.\"[W]e expect Samsung to show a significant turnaround with HBM4 for Nvidia's new products, moving past last year's quality issues,\" said Ray Wang, an analyst at SemiAnalysis focused on memory and the AI supply chain.  Still, analysts expect SK Hynix to retain high market share in HBM4 and maintain its dominant position.\"⁠⁠The HBM4 race is really between SK Hynix and Samsung as we think [the] two companies are more competitive than Micron,\" said Wang.  \"We expect SK Hynix to maintain its lead in HBM4, while Samsung to make material progress and become more competitive in HBM4 than [previous generations],\" he added.According to a local media report on Wednesday, SK Hynix had secured over two-thirds of HBM supply orders for Nvidia's next-generation Vera Rubin products. In December, Counterpoint estimated that SK Hynix had held a leading 57% revenue share in the HBM market compared to Samsung's 22% in the third quarter of last year. SK Hynix also edged out Samsung in the broader DRAM market. DRAM or Dynamic Random Access Memory, are memory chips used for temporary data storage in computing devices, including PCs, servers and data centers. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SK Hynix overtakes Samsung in annual profit for the first time as AI reshapes rivalry",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108258730-1769661678815-gettyimages-1953499861-AFP_34GU796.jpeg?v=1769661707&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T07:49:49.000Z",
      "dateModified": "2026-01-29T07:49:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China and the UK are attempting to reset their relationship — here's how",
    "url": "https://www.cnbc.com/2026/01/29/china-uk-starmer-xi-relations-visit-businesses-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108258704-1769647951089-gettyimages-2258043536-AFP_94AL7BZ.jpeg?v=1769655988&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T08:14:43.000Z",
    "description": "Britain's Prime Minister Keir Starmer addresses a business delegation following his arrival to China, at a hotel in Beijing on January 28, 2026.  Carl",
    "body": "Britain's Prime Minister Keir Starmer addresses a business delegation following his arrival to China, at a hotel in Beijing on January 28, 2026.  Carl Court | Afp | Getty ImagesAfter years of strained ties, China and the U.K. are looking to develop a long-term strategic partnership following a high-stakes meeting between Chinese President Xi Jinping and British Prime Minister Keir Starmer. Starmer is on a 4-day visit to China, the first trip by a British prime minister in eight years — signaling an attempt at resetting relations between the two countries after years of distrust and acrimony.   The U.K. has often accused China of conducting espionage in the country, and labeled it as a long-term strategic challenge. Financial Times reported on Tuesday that British officials were planning to tighten scrutiny of Chinese activity over concerns about national security risks. Beijing's crackdowns on democratic protests in Hong Kong, a former British colony, and imposition of a sweeping national security legislature in 2020 further strained bilateral ties, while U.K. businesses in China have flagged a challenging business climate in the country.  The British government in December moved to clamp down on two tech companies based in China allegedly for carrying out cyberattacks that it said had undermined U.K. security and prosperity. Against that backdrop, Thursday's developments signal a positive shift in relations. The two countries said they will expand cooperation in key areas including education, healthcare, finance and artificial intelligence research, biological sciences and new energy development, according to a statement published by Chinese state media on Thursday. Beijing will also consider opening visa-free entry for British nationals, the statement said, while urging London to create a fair and non-discriminatory environment for Chinese firms operating in the U.K. Starmer told Xi at the start of the meeting that it was \"vital that we build a more sophisticated relationship\" allowing both sides to identify areas for further collaborations and dialogue, according to Reuters. London will maintain high-level close communications with Beijing and deepen trade and investment partnerships, according to the Chinese readout. Speaking to reporters following the summit with Xi, Starmer described the meeting as \"positive\" and one that delivered \"productive outcome,\" adding that the relationship was in a \"good, strong place,\" Reuters reported. Turning to China?   Starmer's trip comes at a time when U.S. President Donald Trump's foreign policy and tariff threats have unsettled traditional allies, while Beijing has hosted several Western leaders just this month including Canadian Prime Minister Mark Carney, Ireland's Prime Minister Michael Martin — the first visit by an Irish leader in 14 years — and Finnish Prime Minister Petteri Orpo.  Xi told Starmer that \"unilateralism, protectionism and power politics have been rampant, severely impacting the international order.\" Xi also urged major economic powers to \"take the lead\" in implementing international laws, \"otherwise they will regress to a jungle-like world.\" That's according to a CNBC translation of the Chinese statement. Starmer's diplomatic shift appears to mirror that of Canada which signed a trade agreement with China earlier this month following a visit by Carney, as Ottawa appears to diversify trade and investment partners amid persistent frictions with Washington.   On Wednesday, Starmer called on dozens of British business leaders traveling with him to seize opportunities in the world's second largest economy. The U.K. government said in its statement Wednesday that it would pursue a \"strategic and consistent relationship\" with Beijing, seeking to bolster new investment and trade relations while remaining vigilant about potential security threats. Last week, the U.K. government approved plans to open a new sprawling Chinese Embassy in London, after the proposal had stalled for years over political and security concerns.   U.K. businesses in China have been confronted with a deteriorating business environment for the past six consecutive years, according to the British Chamber of Commerce in China. Nearly 60% of the more than 300 British firms surveyed said doing business in the country was harder than it was a year ago, the body said in a report in December. \"Overall business landscape remains complex and often unpredictable,\" it said, citing economic slowdown, regulatory pressures and geopolitical risks. But there have not been strong signs of a broad shift toward withdrawing from the Chinese market, the report said, with many firms continuing to view China as a key market, although they appeared to be more cautious with expansion plans. The U.K.'s trade deficit with China ballooned by over 18% year on year to 42 billion pounds ($58.1 billion) in the 12 months ending June 2025, according to the U.K. government data.— CNBC's Evelyn Cheng contributed to this report. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China and the UK are attempting to reset their relationship — here's how",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108258704-1769647951089-gettyimages-2258043536-AFP_94AL7BZ.jpeg?v=1769655988&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T08:14:43.000Z",
      "dateModified": "2026-01-29T08:14:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Nvidia’s AI boom couldn’t happen without Dutch chip equipment maker ASML",
    "url": "https://www.cnbc.com/2026/01/29/-ai-boom-nvidia-asml-dutch-chip-equipment-maker-lithography-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108258178-1769608364156-asml_high_na_still.jpg?v=1769608421&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T06:25:47.000Z",
    "description": "watch nowNvidia has become the world's most valuable company thanks to its advanced chips that are powering the AI revolution. But it could not succee",
    "body": "watch nowNvidia has become the world's most valuable company thanks to its advanced chips that are powering the AI revolution. But it could not succeed without ASML.The Dutch semiconductor equipment company, one of Europe's most valuable, makes lithography machines needed to print extremely fine patterns on silicon wafers.It's the only company in the world that makes extreme ultraviolet (EUV) lithography machines used to produce the most advanced semiconductors. It has a 90% share of the wider lithography market. Bank of America analyst Didier Scemama predicted it would soon have a monopoly in next-generation EUV lithography. \"ASML has industrialised next gen EUV (Extreme Ultraviolet) lithography technology, which we believe will underpin many of the disruptive trends of this decade,\" he wrote in a Wednesday note. His note came after ASML's earnings report revealed bookings were more than double analyst expectations in the fourth quarter of 2025.Stock Chart IconStock chart iconASML's share priceCatching up to ASML 'is virtually impossible'Javier Correonero, equity analyst at Morningstar, told CNBC that lithography was \"the building block of any chip,\" adding that ASML machines have played a role in the production of 99% of semiconductors.But it's EUVs that are crucial for the AI buildout. ASML makes two types of EUVs: low numerical aperture, used to produce the current generation of AI chips, including the Nvidia Blackwell, and the more-advanced high numerical aperture, used in R&D by companies developing next-generation semiconductors.ASML’s EXE:5000 in the High NA Lab in Veldhoven.Both machines fire powerful lasers at molten tin droplets in a vacuum, which create plasma that emits EUV light. The light is then guided using ultra-precise mirrors and reflected off a mask containing the pattern for one layer of the chip, which is then shrunk and projected onto a silicon wafer. Those systems are bought by chip foundries like Taiwanese company TSMC, which are contracted by chip designers like Nvidia.Correonero said companies like Japan's Nikon and Canon, which ship some lithography machines for non-advanced process nodes, were \"far-away competitors.\"\"They are large conglomerates which have invested only a tiny fraction of what ASML has invested over three decades. At this point, catching up is virtually impossible,\" he added.Looking aheadEUVs make up the majority of ASML's booking value, contributing 7.4 billion euros ($8.8 billion) to a total 13.2 billion euros in net bookings in the fourth quarter of 2025. Across 2025, the company sold 48 EUV systems, generating 11.6 billion euros in revenue.While ASML doesn't publicly reveal what its machines cost, analysts told CNBC that the price tag for its most advanced high NA EUV is between 320 million and 400 million euros. Its low NA EUV sells for around 220 million euros, said Correonero.Companies like TSMC, Intel and Samsung are experimenting with the high NA EUV in a lab setting at the moment, he added.\"Once customers are accustomed to the tool, it is gradually introduced into high volume manufacturing. High NA is expected to reach high volume manufacturing by 2027-2028, with Intel as the first adopter,\" Correonero said.ASML's share price rose 36% last year. It's surged another 32% since Jan. 1. Earlier this month, it became just the third European company to see its valuation hit the half-trillion dollar mark, gains which it has held.Analysts expect the stock to keep rising, as advanced chips remain critical to the continuing AI buildout. ASML predicts that 2026 will see net sales hit between 34 billion and 39 billion euros, ahead of the 32.7 billion euros it picked up in 2025.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Nvidia’s AI boom couldn’t happen without Dutch chip equipment maker ASML",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108258178-1769608364156-asml_high_na_still.jpg?v=1769608421&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T06:25:47.000Z",
      "dateModified": "2026-01-29T06:25:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fed holds key interest rate steady as economic view improves",
    "url": "https://www.cnbc.com/2026/01/28/fed-rate-decision-january-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257631-1769530433478-gettyimages-2244021802-aw1a7042_o5capkwx.jpeg?v=1769540426&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-28T23:54:25.000Z",
    "description": "watch nowThe Federal Reserve on Wednesday voted to take a break from a recent run of interest rate cuts, as the central bank navigates questions about",
    "body": "watch nowThe Federal Reserve on Wednesday voted to take a break from a recent run of interest rate cuts, as the central bank navigates questions about its independence and awaits a new leader.Meeting market expectations, the central bank's Federal Open Market Committee voted to keep its key interest rate in a range between 3.5%-3.75%. The decision put a halt to three consecutive quarter percentage point reductions, billed as maintenance moves to guard against potential downturns in the labor market.In voting to hold the line, the committee raised its assessment of economic growth. It also eased its concerns about the labor market as compared with inflation.\"Available indicators suggest that economic activity has been expanding at a solid pace. Job gains have remained low, and the unemployment rate has shown some signs of stabilization,\" the post-meeting statement said. \"Inflation remains somewhat elevated.\" Importantly, the statement also erased a clause indicating that the committee saw a higher risk from the threat of a weakening labor market than that of heightened inflation. That would argue for a pause on rate cuts at least in the near term as officials see the Fed's dual goals of low inflation and full employment more in balance.There was little in the way of guidance about what's coming next, with markets expecting the Fed to wait until at least June before adjusting its benchmark rate again.\"In considering the extent and timing of additional adjustments to the target range for the federal funds rate, the Committee will carefully assess incoming data, the evolving outlook, and the balance of risks,\" the statement said, repeating language inserted in December that markets saw as a shift away from the easing cycle that began in September 2025.Treasury yields moved higher following the decision, while the S&P 500 hovered just 7,000. Miran, Waller dissent As has been the case for recent meetings, there were dissents.Governors Stephen Miran and Christopher Waller voted against the hold, with both advocating another quarter-point cut. This was Miran's fourth consecutive dissent, however, he had previously advocated for a deeper half-point cut. Both officials were appointed by President Donald Trump, with Miran filing an unexpired board seat in September 2025 and Waller appointed during Trump's first term. Miran's term expires Saturday, while Waller interviewed for the Fed chair's job but is considered a long shot. The other 10 FOMC members approved the hold, a group that included a new group of four regional presidents who joined the seven governors and New York Fed President John Williams as voters.The routine nature of the decision comes at a time when nothing is routine for the central bank.Chair Jerome Powell has just two more meetings before his term at the helm ends, ending a tumultuous eight years at the Fed that has included a global pandemic, a steep recession and a seemingly endless series of battles against Trump. \"If you look at the incoming data since the last meeting, [there is] clear improvement in the outlook for growth,\" Powell said during a news conference. \"Inflation performed about as expected, and ... some of the labor market data came in suggesting evidence of stabilization. So it's overall, a stronger forecast, really.\"Most recently, the Justice Department has subpoenaed Powell over the extensive renovations at the Fed's headquarters in Washington, D.C. Before that, the president threatened on multiple occasions to fire Powell and in fact has moved to sack Governor Lisa Cook, a case that is now pending a decision from the U.S. Supreme Court.When asked about his decision to attend oral arguments at the high court, Powell said the case is \"perhaps the most important\" in the Fed's 113-year history. Underscoring all of the tension has been a battle over the Fed's independence, or its ability to operate without political interference. In confirming the Justice Department probe, an unusually candid Powell attributed the threat to Trump's efforts to control monetary policy. Prior presidents also have criticized Fed decisions and tried to coerce policymakers into rate cuts, but none have been as aggressive or public about it as Trump.The Fed also has a challenging economic backdrop to navigate.Growth as measured by the widest measure, gross domestic product, has been robust. The third quarter motored ahead at a 4.4% clip and the final three months of the year are tracking at a 5.4% rate, according to the Atlanta Fed.At the same time, hiring is slow in the labor market amid a Trump administration crackdown on illegal immigration. However, layoffs also have been tame, with the trend for initial jobless claims running at its lowest level in two years.Inflation, though, has proven more troublesome. While off its 40-year highs back in 2022, the rate is still running closer to 3% than the Fed's 2% goal, causing concern among some FOMC officials who either want rate cuts paused or eliminated until there's more evidence that price increases are easing.Trump's tariffs are running in the background when it comes to inflation, with Fed economists generally seeing the duties as adding near-term pressures that will abate later this year.Futures markets are pricing in at most two rate reductions in 2026 and none in 2027, regardless of the next Fed chair. Predictions markets are pointing to BlackRock bond chief Rick Rieder as the likely candidate to succeed Powell.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fed holds key interest rate steady as economic view improves",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257631-1769530433478-gettyimages-2244021802-aw1a7042_o5capkwx.jpeg?v=1769540426&w=1920&h=1080"
      ],
      "datePublished": "2026-01-28T23:54:25.000Z",
      "dateModified": "2026-01-28T23:54:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]