[
  {
    "title": "Trump attacks Powell again amid Fed independence fears: 'Incompetent' or 'crooked'",
    "url": "https://www.cnbc.com/2026/01/13/trump-powell-fed-dimon-pirro-doj.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108176748-17533904772025-07-24t205335z_1716152589_rc28tfaxc9sf_rtrmadp_0_usa-trump-fed.jpeg?v=1753390550&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T16:19:45.000Z",
    "description": "U.S. President Donald Trump looks at Federal Reserve Chair Jerome Powell holding a document during a tour of the Federal Reserve Board building, which",
    "body": "U.S. President Donald Trump looks at Federal Reserve Chair Jerome Powell holding a document during a tour of the Federal Reserve Board building, which is currently undergoing renovations, in Washington, D.C., U.S., July 24, 2025. Kent Nishimura | ReutersPresident Donald Trump on Tuesday slammed Federal Reserve Chair Jerome Powell as either \"incompetent\" or \"crooked,\" even as his Department of Justice faces growing opposition over its criminal investigation of the central bank leader.Trump threw his latest punch at Powell after being asked whether the unprecedented action undermines confidence in the Fed, which has long enjoyed independence from the executive branch. \"He's billions of dollars over budget,\" Trump said, apparently referencing costs related to a multibillion-dollar renovation of the Fed's Washington headquarters, which is at the center of DOJ's probe.\"So, he either is incompetent or he's crooked,\" Trump said. \"I don't know what he is. But he does a – certainly he doesn't do a very good job.\"Trump's comments to reporters outside the White House came as bipartisan criticism of the investigation, and support for the Fed's independence, continues to grow.\"Everyone we know believes in Fed independence,\" JPMorgan Chase CEO Jamie Dimon told reporters earlier Tuesday after his bank released its fourth-quarter earnings results.\"Anything that chips away at that is probably not a great idea,\" Dimon said. \"And in my view, it will have the reverse consequences, it will raise inflation expectations and probably increase rates over time.\"Dimon's remarks echoed similar concerns from a slew of Republican lawmakers, including some who are reliable supporters of Trump.\"If you wanted to design a system to guarantee that interest rates would go up and not down, the best way to do that would be to have the Federal Reserve and the executive branch of the United States get in a pissing contest,\" Senate Banking Committee member John Kennedy, R-La., said Monday.\"We need this like we need a hole in the head,\" he added.This is breaking news. Please refresh for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump attacks Powell again amid Fed independence fears: 'Incompetent' or 'crooked'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108176748-17533904772025-07-24t205335z_1716152589_rc28tfaxc9sf_rtrmadp_0_usa-trump-fed.jpeg?v=1753390550&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T16:19:45.000Z",
      "dateModified": "2026-01-13T16:19:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SK Hynix to invest $13 billion in new plant amid memory chip shortage ",
    "url": "https://www.cnbc.com/2026/01/13/sk-hynix-invest-13-billion-new-fab-memory-chip-shortage-advanced-packaging-ai-memory.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108175736-1753279844430-gettyimages-2211043740-AFP_43AV29D.jpeg?v=1768268952&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T04:47:19.000Z",
    "description": "A visitor takes a picture of a model of SK hynix's high-bandwidth memory (HBM) technology during the 2025 World IT Show in Seoul on April 24, 2025.Jun",
    "body": "A visitor takes a picture of a model of SK hynix's high-bandwidth memory (HBM) technology during the 2025 World IT Show in Seoul on April 24, 2025.Jung Yeon-je | Afp | Getty ImagesSouth Korea-based memory maker SK Hynix announced Tuesday it will invest 19 trillion Korean won ($12.9 billion) to build a new advanced packaging plant, as it expands production to meet rising demands tied to artificial intelligence. The new facility will be located in the Korean city of Cheongju, building on the company's existing footprint there. Construction is set to begin in April, with completion targeted for the end of 2027, the firm said in a statement.The plant will focus on advanced packaging, which involves combining multiple memory chips into a single, high-density unit to improve performance and energy efficiency while reducing overall size.SK Hynix is among the world's largest producers of memory chips and leads in so-called high-bandwidth memory (HBM), which is used in artificial intelligence processors, including those designed by U.S. chipmaker Nvidia. The investment comes as SK Hynix seeks to meet growing demand for HBM as global AI competition intensifies, a trend that has pushed up prices and made it lucrative for memory giants.SK Hynix rival Samsung Electronics has also announced plans to ramp up HBM production in recent months.According to industry projections cited by SK Hynix, the HBM market is expected to expand at a compound annual growth rate of 33% between 2025 and 2030.However, the process of producing HBM memory is much more demanding than that for memory used in most consumer electronics. As chipmakers shift to meet AI-driven demand, supplies of conventional memory have tightened, contributing to price hikes and raising concerns about higher costs across the broader electronics industry.TrendForce, a Taipei-based tech research firm, said last week that it expects average dynamic random access memory prices, including HBM, to rise by 50% to 55% this quarter compared with the fourth quarter of 2025. Dynamic Random Access Memory, or DRAM, generally refers to the primary, volatile memory found in most computers for temporary data storage.While higher memory prices have created challenges for electronics manufacturers, they have boosted earnings for memory producers. Samsung said last week it expects operating profit for the December quarter to nearly triple from the same period last year. Meanwhile, SK Hynix is weighing a potential U.S. listing following a blockbuster 2025 for its shares in South Korea. The stock is up about 12% since the start of this year, though it fell roughly 2.5% in Tuesday trading.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SK Hynix to invest $13 billion in new plant amid memory chip shortage ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108175736-1753279844430-gettyimages-2211043740-AFP_43AV29D.jpeg?v=1768268952&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T04:47:19.000Z",
      "dateModified": "2026-01-13T04:47:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The top 10 companies hiring for hybrid and remote jobs in 2026, according to FlexJobs",
    "url": "https://www.cnbc.com/2026/01/13/the-top-10-companies-hiring-for-hybrid-and-remote-jobs-in-2026-according-to-flexjobs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250164-1767901112030-gettyimages-1392114708-dsc03705.jpeg?v=1767901139&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T14:26:31.000Z",
    "description": "Despite return-to-office pushes from some employers, plenty of companies are still hiring for flexible roles.A new Flexjobs report identified the top ",
    "body": "Despite return-to-office pushes from some employers, plenty of companies are still hiring for flexible roles.A new Flexjobs report identified the top 100 companies hiring for remote and hybrid roles, based on an analysis of around 60,000 companies and their job postings in 2025 in the FlexJobs database.Offering flexible work options allows companies to access \"a broader and more diverse talent pool,\" among other benefits, according to FlexJobs career expert Keith Spencer.Remote work remains popular among employees: a previous FlexJobs survey found that approximately 98% of surveyed workers prefer working hybrid or remote, as opposed to fully in-person.\"Companies that are willing to offer that type of flexibility to their employees often see higher levels of productivity, higher levels of retention, lower attrition,\" Spencer told CNBC Make It. \"They just have a happier workforce.\"According to the report, the top three career categories with the most remote job postings in 2025 were project management, computer and IT, and operations.The top three job titles were account executive, software engineer, and project manager, which is a departure from years past, according to Spencer.\"That list tends to be kind of dominated by tech and finance roles, or at least it has in recent years, so that was a pretty interesting, significant shift,\" he says.This year, 40 of the top 100 best companies for remote and hybrid jobs were newcomers to the list, Spencer says, which \"definitely is a sign of hope for job seekers\" looking for these roles.\"It shows that there's a wide variety of employers who are committing themselves to offering these flexible career options,\" he says.Based on FlexJobs' data, these are the top 10 companies hiring for remote and hybrid roles in 2026.1. TELUSIndustry: Telecommunications2. Elevance Health Industry: Medical, Health3. Lockheed Martin Industry: Aerospace4. Transcom Industry: Customer Service5. UnitedHealth Group Industry: Medical, Health6. General Dynamics Industry: Aerospace7. BELAY Industry: Professional Services, Staffing8. Centene Corporation Industry: Medical, Health9. General Electric - GE Industry: Aerospace, Healthcare, Technology, Transportation10. U.S. Bank Industry: Banking, FinanceJob seekers should be aware that there's \"a high level of competition\" for these roles, according to Spencer.\"People have lives and a lot of commitments, and things aren't getting cheaper, so not having to travel or having to buy your lunch, it can make a big difference for people,\" he says.Most of the remote and hybrid job postings in FlexJobs' database are for \"highly skilled\" positions, Spencer says.According to the report,  67% of postings were for \"experienced-level\" roles, followed by manager-level roles at 17% and senior-level positions at 8%. Only 7% were listed as entry-level roles.To land a remote role, it's crucial that candidates are able to communicate their \"ability to deliver results in a remote environment,\" Spencer says.\"In a competitive market, you need to pay careful attention to the requirements of different roles [and] really kind of dissect job descriptions so you understand what the employer's needs and priorities are,\" he says.Want to get ahead at work with AI? Sign up for CNBC's new online course, Beyond the Basics: How to Use AI to Supercharge Your Work. Learn advanced AI skills like building custom GPTs and using AI agents to boost your productivity today. Use coupon code EARLYBIRD for 25% off. Offer valid from Jan. 5 to Jan. 19, 2026. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The top 10 companies hiring for hybrid and remote jobs in 2026, according to FlexJobs",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250164-1767901112030-gettyimages-1392114708-dsc03705.jpeg?v=1767901139&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T14:26:31.000Z",
      "dateModified": "2026-01-13T14:26:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "JPMorgan Chase says banks could fight Trump credit card rate cap: 'Everything's on the table' ",
    "url": "https://www.cnbc.com/2026/01/13/trump-credit-card-rate-cap-jpmorgan-chase-banks-fight.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214888-17610696602025-10-21t171855z_1126286995_rc2dghapsvej_rtrmadp_0_jpmorgan-new-york.jpeg?v=1761069721&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T16:00:51.000Z",
    "description": "Dado Ruvic | ReutersJPMorgan Chase CFO Jeremy Barnum hinted Tuesday the industry could fight President Donald Trump's demand for credit card price con",
    "body": "Dado Ruvic | ReutersJPMorgan Chase CFO Jeremy Barnum hinted Tuesday the industry could fight President Donald Trump's demand for credit card price controls, saying \"everything's on the table.\" \"If you wind up with weakly supported directives to radically change our business that aren't justified, you have to assume that everything's on the table,\" Barnum said in a call with reporters following JPMorgan's fourth-quarter earnings report. \"We owe that to shareholders.\"Barnum was responding to a question about whether banks would choose to litigate to block Trump's demand, made late Friday, that card companies cap interest rates at 10% for a year. Last year, the industry successfully fought efforts by the Consumer Financial Protection Bureau to cap card late fees.Banks and industry insiders say that an interest rate limit would result in fewer credit card accounts for Americans and a dip in spending for the U.S. economy, as companies would simply pull accounts rather than offer them at an unprofitable level.The average credit card rate nationally is 19.7% as of this month, according to a weekly survey from Bankrate.com, while rates for subprime borrowers and store-specific cards are typically higher.\"Our belief is that actions like this will have the exact opposite consequence to what the administration wants for consumers,\" Barnum said. \"Instead of lowering the price of credit, we'll simply reduce the supply of credit, and that will be bad for everyone: consumers, the wider economy, and yes, at the margin, for us.\"The CFO declined to directly answer a question on whether JPMorgan would comply with Trump's demand, which has a proposed Jan. 20 start date. Banks that don't follow the directive are \"in violation of the law,\" Trump told reporters on Sunday.Still, it's unclear how Trump's mandate would be enforced. There is no U.S. law capping card rates, though a bill was introduced last year from Sen. Josh Hawley of Missouri and Sen. Bernie Sanders of Vermont that would limit card APRs at 10% for five years. That bill is stalled in Congress. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "JPMorgan Chase says banks could fight Trump credit card rate cap: 'Everything's on the table' ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214888-17610696602025-10-21t171855z_1126286995_rc2dghapsvej_rtrmadp_0_jpmorgan-new-york.jpeg?v=1761069721&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T16:00:51.000Z",
      "dateModified": "2026-01-13T16:00:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Delta CEO sees record earnings in reach again thanks to high-end travel demand",
    "url": "https://www.cnbc.com/2026/01/13/delta-air-lines-dal-4q-2025-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108065742-1732118086016-gettyimages-2183912171-urbanandsport-deltaboe241008_npmh4.jpeg?v=1760010138&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T12:58:41.000Z",
    "description": "A Delta Air Lines Boeing 767-332(ER).Joan Valls | Nurphoto | Getty ImagesDelta Air Lines' earnings could jump more than 20% this year from 2025 thanks",
    "body": "A Delta Air Lines Boeing 767-332(ER).Joan Valls | Nurphoto | Getty ImagesDelta Air Lines' earnings could jump more than 20% this year from 2025 thanks to robust travel demand, particularly at the high end of the market, and potentially reach a record, CEO Ed Bastian said.Delta on Tuesday forecast adjusted earnings per share of between $6.50 and $7.50 this year, compared with analysts' estimate for $7.25 a share.The carrier, the first airline to report quarterly results this year, forecast an increase in sales of as much as 7% in the first three months of 2026 and adjusted earnings of between 50 cents per share and 90 cents per share for the first quarter, compared with 72 cents per share forecast by analysts polled by LSEG.Bastian said Delta sits at the top of the \"K\" in the so-called K-shaped economy, with more revenue coming from higher-spending customers.\"We are looking at our seat growth in the coming year. ... Effectively, none of our growth in seats will be in the main cabin; virtually all will be in the premium sector,\" Bastian told reporters.Main cabin ticket revenue fell 7% in the fourth quarter from a year earlier to $5.62 billion, while premium ticket revenue, for seats at the front of the plane, rose 9% to nearly $5.7 billion, with that segment overtaking the standard coach class, ahead of Delta's estimate for it to occur this year. For the full year, main cabin revenue was still higher than premium classes.Bookings are strong from both leisure customers and corporate travelers in the first few days of the year, Delta said. The airline also started 2025 with expectations for a record year, but it trimmed its estimates after President Donald Trump implemented tariffs early last year and the longest-ever government shutdown, which ended in late November, snarled air travel and bookings fell.Bastian struck a more cautious tone this year, telling reporters \"we're not going to project or commit to a record earnings [forecast] until we understand the uncertainty,\" he said. \"I think we're well aware of the risk factors,\" he said. \"This past year, and I think again this year ... [will] be more of the geopolitical environment, whether that's international or on domestic policy.\"Here's how the company performed in the fourth quarter compared with what Wall Street was expecting, based on consensus estimates from LSEG:Earnings per share: $1.55 adjusted vs. $1.53 expectedRevenue: $14.61 billion adjusted vs. $14.69 billion expectedEven with its reduced forecast, Delta posted a profit of $1.22 billion for the fourth quarter, or $1.86 a share, up close to 45% from a year earlier, on revenue of $16 billion, up 3% from 2024. Adjusting for one-time items, Delta posted earnings of $1.02 billion or $1.55 a share, slightly ahead of estimates. Bastian said premium product growth is outpacing sales growth for the main cabin, continuing an existing trend.Read more CNBC airline newsBoeing's deliveries are highest in 7 years. It's about to pick up the paceWhy airline class wars will intensify in 2026American Airlines no longer lets basic economy flyers earn milesArchitect of Delta's premium strategy to retire in FebruaryFrontier Airlines replaces longtime CEO Barry Biffle with carrier's presidentDelta also said Tuesday it will buy 30 Boeing 787-10 Dreamliners, its first of the long-haul planes from the U.S. manufacturer, as sales pick up for bigger jets. Delta made the Airbus A350 its key long-haul plane almost a decade ago and later increased its reliance on the European plane maker when it retired its Boeing 777s during the pandemic. Delta said deliveries would begin in 2031, the latest sign of how airlines are snatching up delivery slots into the next decade.The carrier has options for 30 more 787-10s from Boeing.Correction: Revenue of $16 billion was up 3% from 2024. An earlier version misstated the year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Delta CEO sees record earnings in reach again thanks to high-end travel demand",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108065742-1732118086016-gettyimages-2183912171-urbanandsport-deltaboe241008_npmh4.jpeg?v=1760010138&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T12:58:41.000Z",
      "dateModified": "2026-01-13T12:58:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here’s the inflation breakdown for December 2025 — in one chart",
    "url": "https://www.cnbc.com/2026/01/13/cpi-inflation-december-2025-breakdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108251734-1768317405097-gettyimages-2251164915-AFP_882U7DU.jpeg?v=1768320805&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T15:51:58.000Z",
    "description": "A grocery store in the Manhattan borough of New York on Dec. 13, 2025.Charly Triballeau | Afp | Getty ImagesProgress in the fight to throttle back inf",
    "body": "A grocery store in the Manhattan borough of New York on Dec. 13, 2025.Charly Triballeau | Afp | Getty ImagesProgress in the fight to throttle back inflation appeared to stall in December amid price pressures from groceries, dining out, utility gas, clothing and other categories of consumer spending. The consumer price index, a key inflation gauge, rose 2.7% in December from 12 months earlier, the Bureau of Labor Statistics said Tuesday. That was unchanged from the previous month and in line with estimates.\"The bottom line is, I think inflation is still uncomfortably high,\" said Mark Zandi, chief economist at Moody's. \"Inflation for staples, necessities, remains elevated.\"Tariffs are pushing up inflationThe Federal Reserve, the U.S. central bank, targets an annual inflation rate that averages roughly 2% over the long term. Tariffs levied by President Donald Trump have put upward pressure on the inflation rate, Zandi said. Tariffs are a tax on imports, paid by the U.S.-based importer. Economists have expected that businesses would pass along at least some of that tax to consumers via higher prices.  \"I think were it not for the tariffs, we would have been back to target already,\" Zandi said. \"But tariffs have pushed up inflation a little over half a [percentage] point.\"That said, the pass-through to consumers has been more muted than expected, likely because businesses have chosen to erode their profit margins rather than risk alienating consumers via higher prices, economists said. Companies with inventory imported to the U.S. before tariffs were implemented were also able to sell those products to consumers at typical prices. The Supreme Court is poised to deliver a ruling in the coming days or weeks that could strike down a legal pathway the Trump administration has leveraged to impose universal tariffs on a broad swath of trading partners. Even without such a ruling, economists said they expect inflation has peaked and that it will likely throttle back in the second half of 2026. \"Short of any new tariffs coming online, we think the direction of inflation is lower,\" said Tom Porcelli, chief economist at Wells Fargo.Good news for the Federal ReserveOverall, the headline inflation rate is higher than it appears on paper, Zandi said. The record-long government shutdown, which ran from Oct. 1 to Nov. 12, prevented federal statisticians from collecting typical inflation data in October. Without that data, the BLS assumed that no price increases had taken place during the month for most categories of goods and services, Zandi said. Moody's estimates the annual CPI inflation rate would be around 3% if that data were included, he said.Read more CNBC personal finance coverageHere's the inflation breakdown for December 2025 — in one chartMore drivers have $1,000-plus car loan payments. What buyers can expect in 2026What the investigation of Fed chair Powell may mean for your moneyWhat Trump's 1-year, 10% credit card interest rate cap means for your moneyThis is one of the 'most important steps' before tax season opens, IRS saysHow tax-efficient investing could boost your portfolio returns in 2026 and beyondFor 2026, these new 401(k) details 'matter more than ever,' advisor saysWe're in a 'hiring recession,' economist says — how job seekers can stand outWar, booze and mopeds: Travel insurance coverage gaps that may surprise youFirst 2026 Social Security payments bring a bigger check in JanuaryConsumer outlook improves despite job worries, New York Fed survey findsIRS will start accepting tax returns Jan. 26 for the 2026 tax seasonWhere Trump's $2,000 tariff dividend checks stand nowAfter a record-breaking holiday shopping season comes a wave of returningWhat Medicaid changes in Trump's 'big beautiful bill' mean for family caregiversCNBC's Financial Advisor 100: Best financial advisors, top firms rankedUltimately, disinflationary trends largely appear positive under the surface, likely a welcome sign for Federal Reserve policymakers as they navigate whether to ease back on interest rate policy in 2026, economists said. \"We expect officials are happy to remain on extended pause, as they wait and see the impact of their recent string of rate cuts, but with inflation fears fading, officials will feel freer to respond to downside risks to the labor market, should conditions deteriorate,\" Michael Pearce, chief US economist at Oxford Economics, wrote in a note Tuesday. Consumer staples spur affordability concernsAffordability has emerged as a key financial focus for consumers and a talking point for politicians. Inflation for certain household necessities increased in December. For example, food prices — for groceries and at restaurants — each increased 0.7% on a monthly basis, from November to December, according to the CPI report. For inflation to get back to target, the monthly inflation rate generally needs to be around 0.2%.Certain categories like coffee and beef have seen high inflation rates over the past year — about 20% and 16%, respectively — due to supply constraints. Clothing prices were also up about 0.6% on a monthly basis. However, some increases may appear larger than in reality due to data distortions caused by the government shutdown, according to economists. \"Goods inflation appeared firmer than underlying trends would suggest, largely because holiday discounts were over-represented in November's CPI report due to how data was gathered during the government shutdown,\" Gargi Pal Chaudhuri, chief investment and portfolio strategist for the Americas at BlackRock, wrote in a note Tuesday. \"Those deeper-than-normal discounts pulled prices down in November, setting up an artificial jump when prices normalized later in December.\"watch nowUtility piped gas service increased 4.4% on the month, and is up 11% for the year. Electricity prices declined by -0.1% for the month but were up about 7% for the year. On a positive note, housing is likely to act as a counterweight pulling down overall inflation in 2026 and into 2027, Zandi said. \"Rent growth remains very weak,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here’s the inflation breakdown for December 2025 — in one chart",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108251734-1768317405097-gettyimages-2251164915-AFP_882U7DU.jpeg?v=1768320805&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T15:51:58.000Z",
      "dateModified": "2026-01-13T15:51:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump’s tariff gambit over Iran risks derailing U.S.–China trade deal",
    "url": "https://www.cnbc.com/2026/01/13/trumps-tariff-iran-25-us-china-trade-deal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108251501-1768264445199-gettyimages-2243544195-AFP_82G73NQ.jpeg?v=1768264457&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T08:44:40.000Z",
    "description": "TOPSHOT - US President Donald Trump (L) and China's President Xi Jinping arrive for talks at the Gimhae Air Base, located next to the Gimhae Internati",
    "body": "TOPSHOT - US President Donald Trump (L) and China's President Xi Jinping arrive for talks at the Gimhae Air Base, located next to the Gimhae International Airport in Busan on October 30, 2025.Andrew Caballero-reynolds | Afp | Getty ImagesPresident Donald Trump's threat of 25% tariffs on countries doing business with Iran has raised the risk of derailing Washington's fragile trade deal with Beijing — Tehran's largest trading partner. Trump said Monday night stateside that the U.S. will start charging a 25% tariff on imports from countries that do business with Iran. The order is \"effective immediately,\" he said in a Truth Social post.   The world's top two economies had secured an interim trade deal in late October that saw a roll back of punitive U.S. tariffs on China, while Beijing paused its sweeping rare earth export controls.In response to Trump's tariff threat China said it \"firmly opposes any illicit unilateral sanctions and long-arm jurisdiction,\" while warning that it would take \"all necessary measures\" to defend its interests, according to a post on X by a spokesperson for the Chinese Embassy in the U.S.If Trump is serious about the 25% rate, \"that is a massive escalation from current tariff levels,\" said Deborah Elms, head of trade policy at the Hinrich Foundation. She warned the situation could easily spiral into fresh rounds of tit-for-tat escalation, not to mention dashing any hopes of U.S. soybean exports to China. \"The last time we played this game, we ended up with tariff levels at 145%.\"    watch nowAs the world's largest importer of oil, Beijing has long bought crude from Iran — and other countries sanctioned by the U.S. — offering a crucial economic lifeline to the Middle Eastern regime reeling from Western curbs. Iranian crude oil shipments to China more than doubled between 2017 and 2024 on a per-day basis to over 1.2 million barrels, according to estimates by Muyu Xu, senior analyst at commodity intelligence firm Kpler. As of 2022, fuel accounted for more than half of China's imports from Iran, according to World Bank's latest data. However, China has since stepped back its trade amid tighter U.S. sanctions. Imports from Iran were on track for a fourth-straight year of decline in 2025, falling 28% in the January to November period from a year earlier, according to official data compiled by Wind Information. China is expected to release full-year trade data on Wednesday.Beijing will not reduce its economic cooperation with Iran due to Trump's tariff threat, Cui Shoujun, an international studies professor at Renmin University of China, told reporters Tuesday morning. \"The Iran situation has certainly entered a very dangerous period. We should all pay closer attention,\" Cui said in Mandarin, translated by CNBC. He attributed Trump's interest in Iran to energy resources — more oil production than Venezuela, just when U.S. electricity demand is surging in order to power AI. While Cui declined to directly address the implications for U.S.-China relations, he said that in-person meetings are an important indicator.After Trump met Chinese President Xi Jinping in South Korea last fall, the two sides agreed to a 1-year trade truce. Tariffs on Chinese exports to the U.S. were set to stay around 47.5%, down from a high of more than 100% during the peak of trade tensions in the spring. The U.S. president is expected to visit Beijing in April, followed by a reciprocal visit by Xi later in the year. \"Trump is eroding the thin trust build around [the] trade truce,\" said Dan Wang, China director at Eurasia Group. \"Trump was already widely viewed by Chinese public and government as inconsistent.\" The U.S. and China have had a history of piling on pressure to build leverage ahead of major diplomatic meetings. Tensions had escalated sharply ahead of the Trump-Xi meeting in October, with Beijing expanding export controls on rare earths and launching anti-trust probes into U.S. chip maker Qualcomm, while Washington reportedly planned to curb chip-design software to China. \"There will likely be several rounds of similar tit-for-tat, leading up to April meeting,\" said Wang.    Wang said China could respond with sanctions on U.S. firms tied to Taiwan arms sales, or antitrust probes of American tech firms operating in China, while ruling out additional rare earths restrictions.It remains to be seen to what extent the tariffs materialize. The U.S. Supreme Court could make a ruling Wednesday on the legality of Trump's use of duties.The threat of tariffs on Iran's trading partners appeared to be driven by Trump's \"ever shifting focus of attention, not as part of an intentional strategy to gain new leverage over China in advance of the likely April summit,\" said Scott Kennedy, a senior adviser at the Center for Strategic and International Studies.   Still, \"China will not hesitate to retaliate in a way that imposes serious costs on the U.S. [and it] has prepared for a variety of scenarios, including this one,\" Kennedy added.  \n\t\t\n\t\t\n\t\t\n\t\t\tWeekly analysis and insights from Asia's largest economy in your inbox\n\t\t\tSubscribe now\n\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump’s tariff gambit over Iran risks derailing U.S.–China trade deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108251501-1768264445199-gettyimages-2243544195-AFP_82G73NQ.jpeg?v=1768264457&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T08:44:40.000Z",
      "dateModified": "2026-01-13T08:44:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI acquires health-care technology startup Torch for $60 million, source says",
    "url": "https://www.cnbc.com/2026/01/12/open-ai-torch-health-care-technology.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236130-17647881752025-11-10t115351z_950930649_rc2lu7aydd2o_rtrmadp_0_openai-healthcare.jpeg?v=1764788189&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T22:47:14.000Z",
    "description": "Dado Ruvic | ReutersOpenAI has acquired the health-care technology startup Torch, the company announced on Monday. OpenAI purchased Torch for roughly ",
    "body": "Dado Ruvic | ReutersOpenAI has acquired the health-care technology startup Torch, the company announced on Monday. OpenAI purchased Torch for roughly $60 million, according to a source familiar with the deal who asked not to be named because the details are confidential.Torch was building a \"unified medical memory\" for artificial intelligence that aimed to bring a patient's health data, which is typically siloed and stored across a number of different vendors and formats, into one place. Torch's employees will join OpenAI as part of the acquisition, the companies said.  \"I can't imagine a better next chapter than to now get to put our technology and ideas in the hands of the hundreds of millions of people who already use ChatGPT for health questions every week,\" Torch CEO Ilya Abyzov wrote in a post on X. Read more CNBC tech newsAlphabet hits $4 trillion market capitalizationMalaysia and Indonesia block Elon Musk's Grok due to nonconsensual sexual contentGoogle bolsters bet on AI-powered commerce with new platform for shopping agentsAre we in an AI bubble? What 40 tech leaders and analysts are saying, in one chartAbyzov previously co-founded another health-care startup called Forward, which was a direct-to-consumer primary care business that carried out patient visits via tech-enabled \"CarePods.\" Forward abruptly shuttered operations in 2024.  OpenAI's acquisition of Torch comes just days after it unveiled ChatGPT Health, a new experience that allows users connect their medical records and wellness apps to the AI chatbot. The company also announced several enterprise-grade products for health-care organizations. Some of its initial partners include large health systems like HCA Healthcare.  In December, OpenAI hired Google's Albert Lee to lead corporate development, a signal that the company will continue to hunt for M&A targets that can help it gain an edge over rivals like Google and Anthropic. The company made several acquisitions in 2025, including Jony Ive's AI devices startup io for more than $6 billion in May.WATCH: OpenAI, SoftBank invest $1 billion in SB Energy as part of Stargatewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI acquires health-care technology startup Torch for $60 million, source says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236130-17647881752025-11-10t115351z_950930649_rc2lu7aydd2o_rtrmadp_0_openai-healthcare.jpeg?v=1764788189&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T22:47:14.000Z",
      "dateModified": "2026-01-12T22:47:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greenland's PM has a blunt message for Trump: We choose Denmark over the U.S.",
    "url": "https://www.cnbc.com/2026/01/13/greenland-denmark-trump-nielsen-frederiksen.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108251703-1768313954423-gettyimages-2255508143-AFP_92JL2BD.jpeg?v=1768314016&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T15:31:06.000Z",
    "description": "Greenland's Head of Government (Naalakkersuisut) Jens-Frederik Nielsen (L) and Denmark's Prime Minister Mette Frederiksen give a statement on the curr",
    "body": "Greenland's Head of Government (Naalakkersuisut) Jens-Frederik Nielsen (L) and Denmark's Prime Minister Mette Frederiksen give a statement on the current situation at a press conference in the Mirror Hall at the Prime Minister's Office in Copenhagen, Denmark, on January 13, 2026. Liselotte Sabroe | Afp | Getty ImagesGreenland Prime Minister Jens-Frederik Nielsen said on Tuesday that the Arctic island chooses Denmark over the U.S., pushing back against Donald Trump's repeated takeover threats.  \"If we have to choose between the USA and Denmark here and now, we choose Denmark. We choose NATO, the Kingdom of Denmark and the EU,\" Nielsen said, according to translated comments reported by Danish public broadcaster DR. He was speaking alongside Danish Prime Minister Mette Frederiksen at a news conference in Copenhagen, ahead of crunch talks between U.S., Danish and Greenlandic officials at the White House on Wednesday.\"The time has come to stand together,\" Nielsen added.\"It has not been easy to stand up to completely unacceptable pressure from our closest allies for a lifetime. But there is much to suggest that the hardest part is still ahead of us,\" Frederiksen said.Trump's renewed interest in acquiring Greenland follows an audacious U.S. military operation to seize Venezuelan President Nicolas Maduro on Jan. 3.Trump, who has long advocated for control over Greenland, has said the U.S. needs the Arctic island to prevent Russia and China from doing the same, telling reporters that Washington would acquire the self-governing Danish territory \"one way or the other.\"watch nowThe U.S. president has also said that the mineral-rich island, which is strategically situated between Europe and North America, is vital \"from the standpoint of national security.\"Opinion polls have previously shown that Greenlanders overwhelmingly oppose U.S. control, while a strong majority support independence from Denmark.Denmark has pledged to boost healthcare spending and infrastructure investments in recent months, while also seeking to defuse tensions with the Trump administration by investing in Arctic defense, including the purchase of 16 additional F-35 fighter jets.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greenland's PM has a blunt message for Trump: We choose Denmark over the U.S.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108251703-1768313954423-gettyimages-2255508143-AFP_92JL2BD.jpeg?v=1768314016&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T15:31:06.000Z",
      "dateModified": "2026-01-13T15:31:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Orsted pops 5% after U.S. judge rules firm can resume wind project halted by Trump",
    "url": "https://www.cnbc.com/2026/01/13/orsted-trump-wind-power-revolution-wind.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108221589-1762332255208-gettyimages-2242717799-REVOLUTION_WIND_ASSEMBLY.jpeg?v=1768291021&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T10:15:32.000Z",
    "description": "A turbine blade is lifted onto a rack near tower sections at the Revolution Wind project assembly site at State Pier in New London, Connecticut, US, o",
    "body": "A turbine blade is lifted onto a rack near tower sections at the Revolution Wind project assembly site at State Pier in New London, Connecticut, US, on Friday, Oct. 24, 2025.Bloomberg | Bloomberg | Getty ImagesShares of Danish renewables giant Orsted rose nearly 5% on Tuesday morning, shortly after a U.S. judge cleared the company to resume work on its nearly finished Revolution Wind project.In a statement, Orsted welcomed the ruling from the U.S. District Court for the District of Columbia, saying the action would allow the company \"to restart impacted activities immediately.\"The ruling is a legal setback for the pro-fossil fuel Trump administration, which moved to block the $5 billion Revolution Wind project.The White House halted five major offshore wind developments at the end of last year, including Orsted's project off the coast of Rhode Island. Officials cited national security concerns identified by the Pentagon as the reason for the suspension.Orsted filed a legal challenge to the Trump administration's decision earlier this month, saying that the lease suspension would cause \"substantial harm\" to the Revolution Wind project.In a hearing on Monday, U.S. District Judge Royce Lamberth said the Court should be \"very skeptical of the government's true motives\" for putting a stop to the project, according to Reuters news agency.\"You want to stop everything in place, costing them one-and-a-half million a day, while you decide what you want to do?\" Lamberth asked Justice Department attorney Peter Torstensen.A spokesperson for the U.S. Interior Department did not immediately respond to CNBC's request for comment.Read moreMichael Field, chief equity strategist at Morningstar, said the U.S. judge's decision was clearly welcome news for the likes of Orsted and Danish wind turbine maker Vestas but warned of further industry uncertainty.\"It's certainly a win for these companies anyway — and they have had such a hard time over the last year or so that they could definitely use that,\" Field told CNBC's \"Squawk Box Europe\" on Tuesday.\"But … whether Trump will find a way around this or find some other way to maybe go at these companies is the question. So, I wouldn't be completely celebrating as of yet,\" he added.Revolution Wind is a 50/50 joint venture between Orsted and Global Infrastructure Partners' Skyborn Renewables. In a filing last year, Orsted and Skyborn Renewables said they had already spent approximately $5 billion on the project.Shares of Orsted traded 4.5% higher at around 10 a.m. London time (5 a.m. ET). Vestas, meanwhile, was last seen up around 1.6%. Shares of Norway's Equinor, whose Empire Wind 1 project was also impacted, were last seen 2.7% higher. U.S.-listed Dominion Energy, the developer of the halted Coastal Virginia Offshore Wind project, the largest of its kind in America, was flat in pre-market trade. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Orsted pops 5% after U.S. judge rules firm can resume wind project halted by Trump",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108221589-1762332255208-gettyimages-2242717799-REVOLUTION_WIND_ASSEMBLY.jpeg?v=1768291021&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T10:15:32.000Z",
      "dateModified": "2026-01-13T10:15:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boeing outsold Airbus last year for first time since 2018, deliveries rise to 600",
    "url": "https://www.cnbc.com/2026/01/13/boeing-orders-deliveries.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250208-1767906027805-gettyimages-2249102569-BOEING_737_MAX.jpeg?v=1767906219&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T16:00:01.000Z",
    "description": "A Boeing Co. 737 Max airplane at the company's manufacturing facility in Renton, Washington, US, on Thursday, Nov. 20, 2025. David Ryder | Bloomberg |",
    "body": "A Boeing Co. 737 Max airplane at the company's manufacturing facility in Renton, Washington, US, on Thursday, Nov. 20, 2025. David Ryder | Bloomberg | Getty ImagesBoeing logged net orders for 1,173 airplanes last year, marking the first time it outsold its European rival Airbus since 2018, the latest sign of Boeing's recovery.Boeing handed over 63 jetliners to customers last month, bringing its annual delivery total to 600 aircraft, the most in seven years, before two deadly crashes and a host of other problems derailed its output. Forty-four of those deliveries were 737 Maxes, Boeing said Tuesday.Airbus still delivered more aircraft last year than Boeing, with 793, though that sum is below the record 863 airplanes the European manufacturer handed over in 2019. Airbus had 889 net orders for 2025.Engine and other supply chain issues continue to hold up aircraft deliveries. Deliveries are key for airplane manufacturers because airlines pay the bulk of a jet's price when they receive the plane.Boeing's net orders last month totaled 174 planes, including more than 100 737 Maxes for Alaska Airlines, which the Seattle carrier announced last week. Delta Air Lines earlier Tuesday said it ordered at least 30 Boeing 787 Dreamliners, its first for the wide-body plane. Deliveries are starting in the early 2030s, a sign of how airlines are locking in delivery slots into the next decade to replace older jets and grow.Boeing executives are scheduled to discuss the manufacturer's production plan when the company reports quarterly results on Jan. 27.Read more CNBC airline newsBoeing's deliveries are highest in 7 years. It's about to pick up the paceWhy airline class wars will intensify in 2026American Airlines no longer lets basic economy flyers earn milesArchitect of Delta's premium strategy to retire in FebruaryFrontier Airlines replaces longtime CEO Barry Biffle with carrier's president",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boeing outsold Airbus last year for first time since 2018, deliveries rise to 600",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250208-1767906027805-gettyimages-2249102569-BOEING_737_MAX.jpeg?v=1767906219&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T16:00:01.000Z",
      "dateModified": "2026-01-13T16:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Novo Nordisk CEO explains why new GLP-1 pill expands access to the weight loss drugs",
    "url": "https://www.cnbc.com/2026/01/12/novo-nordisk-ceo-glp-1-pill-access.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108245068-1766477256303-gettyimages-2228673815-raa-novonord250809_npj4Z.jpeg?v=1768247892&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T23:29:46.000Z",
    "description": "watch nowIn a Monday interview with CNBC's Jim Cramer, Novo Nordisk CEO Mike Doustdar suggested the new pill format of the pharmaceutical giant's weig",
    "body": "watch nowIn a Monday interview with CNBC's Jim Cramer, Novo Nordisk CEO Mike Doustdar suggested the new pill format of the pharmaceutical giant's weight loss drug will allow more people to use the medicine which had previously been available only as an injectable. \"We are seeing, actually, that the pill is able to expand the market for a large group of people that have been waiting,\" Doustdar said. \"Predominantly, I would say the major barrier has been the taboo.\"Many people have a needle phobia, Doustdar said, and he suggested that injectables have societal taboo. He also said injectable GLP-1s come with \"the burden of refrigeration,\" not only for users but for supply chains. Doustdar added that pill and injectable GLP-1s have the same level of efficacy. The Wegovy maker developed the first GLP-1 pill to be approved by the U.S. Food and Drug Administration. Novo Nordisk launched the drug in the U.S. last week. Doustdar said about 100 million people in the U.S. are obese, but only around 15 million use GLP-1 drugs. Many are not taking the drugs because they can't afford to do so, he continued. Doustdar said the initial dose of the pill starts at $149, and with insurance can cost $25 — lower than the standard patients have been paying for the injections.He advocated against compounded GLP-1 drugs, many of which are custom-made alternatives to the name brand medicines. The compounded products are often cheaper, but the FDA does not review their safety and efficacy.\"They're knock off products. So this should be completely illegal,\" Doustdar said. \"And I'm very surprised that in this country this is still legal.\"watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Novo Nordisk CEO explains why new GLP-1 pill expands access to the weight loss drugs",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108245068-1766477256303-gettyimages-2228673815-raa-novonord250809_npj4Z.jpeg?v=1768247892&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T23:29:46.000Z",
      "dateModified": "2026-01-12T23:29:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BNY raises profit target as CEO Robin Vince says 'turnaround' is taking hold",
    "url": "https://www.cnbc.com/2026/01/13/bny-profit-target-ceo-robin-vince-turnaround.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107359381-1705409631922-1J7A9517.JPG?v=1705409721&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T16:10:42.000Z",
    "description": "Robin Vince President & CEO BNY Mellon, speaking on CNBC's Squawk Box at the WEF Annual Meeting in Davos, Switzerland on Jan. 16th, 2024. Adam Galici ",
    "body": "Robin Vince President & CEO BNY Mellon, speaking on CNBC's Squawk Box at the WEF Annual Meeting in Davos, Switzerland on Jan. 16th, 2024. Adam Galici | CNBCBNY, which calls itself the world's largest custody bank, is raising a pair of key performance targets as CEO Robin Vince says a turnaround that began when he took over three years ago is taking hold.The bank is boosting its medium-term targets for pretax margin and return on tangible common equity by 5 percentage points each, to 38% and 28%, respectively, according to materials provided by the bank.Vince, a former Goldman Sachs executive who joined BNY in 2020 and became the bank's CEO in 2022, said that the move demonstrates increased confidence in the company's prospects going forward. Banks overall have also benefited from several deregulatory efforts under Trump administration regulators. \"We're increasing our medium-term targets, because we have the confidence that we think there's a lot more value and potential for us to unlock over the long term,\" Vince said in an interview, adding that medium-term targets had a three- to five-year horizon.\"Three years in, we've really demonstrated a track record of execution and strong performance, which gives us confidence that the strategy is working and that there's a clear turnaround that's happening at the company,\" he said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BNY raises profit target as CEO Robin Vince says 'turnaround' is taking hold",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107359381-1705409631922-1J7A9517.JPG?v=1705409721&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T16:10:42.000Z",
      "dateModified": "2026-01-13T16:10:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Global central bankers unite in defense of Fed Chair Jerome Powell",
    "url": "https://www.cnbc.com/2026/01/13/jerome-powell-defended-european-central-bankers.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108251097-17682230582026-01-12t015619z_1829857749_rc2dziag9dug_rtrmadp_0_usa-fed-powell.jpeg?v=1768223097&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T13:31:33.000Z",
    "description": "Jerome Powell, chairman of the U.S. Federal Reserve, during a news conference following a Federal Open Market Committee (FOMC) meeting in Washington, ",
    "body": "Jerome Powell, chairman of the U.S. Federal Reserve, during a news conference following a Federal Open Market Committee (FOMC) meeting in Washington, DC, on Wednesday, Dec. 10, 2025. Bloomberg | Bloomberg | Getty ImagesGlobal central bankers issued a statement Tuesday defending U.S. Federal Reserve Chair Jerome Powell following the launch of a criminal investigation into the central bank chief. \"We stand in full solidarity with the Federal Reserve System and its Chair Jerome H. Powell,\" central bank chiefs including European Central Bank President Christine Lagarde and Bank of England Governor Andrew Bailey, said in a joint statement. \"The independence of central banks is a cornerstone of price, financial and economic stability in the interest of the citizens that we serve. It is therefore critical to preserve that independence, with full respect for the rule of law and democratic accountability,\" they added.Powell has served with \"integrity, focused on his mandate and an unwavering commitment to the public interest,\" the statement said. \"To us, he is a respected colleague who is held in the highest regard by all who have worked with him.\"Other signatories to the statement included the central bank chiefs of Brazil, Switzerland, Sweden, Denmark, South Korea, Australia and Canada.watch nowThe message of solidarity with Powell comes after the Fed chief issued a statement on Sunday evening confirming that federal prosecutors had launched a criminal investigation into the $2.5 billion renovation of the central bank's headquarters in Washington, D.C., and his related testimony to Congress.Powell, who has come under sustained pressure from U.S. President Donald Trump to lower interest rates, said the probe was the result of the president's frustration to cut rates as quickly and as much as he wanted.\"The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the President,\" Powell said in a video statement tweeted by the Fed's X account.Powell warned that the outcome of the investigation will determine the future of the central bank's decisions.\"This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions — or whether instead monetary policy will be directed by political pressure or intimidation,\" Powell said. — CNBC's Dan Mangan contributed reporting to this story. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Global central bankers unite in defense of Fed Chair Jerome Powell",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108251097-17682230582026-01-12t015619z_1829857749_rc2dziag9dug_rtrmadp_0_usa-fed-powell.jpeg?v=1768223097&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T13:31:33.000Z",
      "dateModified": "2026-01-13T13:31:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Does it really matter who ends up owning Warner Bros.? Media exec Tom Rogers breaks it down",
    "url": "https://www.cnbc.com/2026/01/13/does-it-really-matter-who-ends-up-owning-warner-bros-media-exec-tom-rogers-breaks-it-down.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238506-1765220064257-WarnerParamount.jpg?v=1765220220&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-13T11:00:02.000Z",
    "description": "Paramount Skydance CEO, David Ellison and CEO of Warner Bros. Discovery, David Zaslav.David A. Grogan | CNBC| Patrick T. Fallon | AFP | Getty Images |",
    "body": "Paramount Skydance CEO, David Ellison and CEO of Warner Bros. Discovery, David Zaslav.David A. Grogan | CNBC| Patrick T. Fallon | AFP | Getty Images |It is extremely rare for a merger and acquisition story to break out from the business pages. Yet, when it comes to the sale process of Warner Brothers Discovery it has become mainstream news as probably the most compelling media industry story of the last 12 months. I suppose it is fairly obvious as to why, with such universally known media brands involved in the fray from Netflix, HBO, Paramount, CBS, CNN and MTV. These are media brands of real significance so one might assume who owns it is a significant issue in itself.But is it?There are a number of perspectives from which to answer this question. Should TV viewers care? Should policy makers care? Should the industry care? Should President Donald Trump care? And, probably most importantly, should shareholders care?David Ellison, newly installed CEO of Paramount and son of one of the world's wealthiest billionaires, Larry Ellison, decided to make an aggressive move to attempt to acquire all of Warner prior to Warner's decision to split itself into two companies. One company was to consist of HBO and the Warner movie and TV studios, and another created holding all the Warner cable networks, which include CNN. Ellison made this preemptive move to capture the Warner assets, correctly strategizing that Paramount would be the only bidder for the entire company. However, his move catalyzed the Warner board to entertain bids for just the studios and HBO as well, which then created a highly competitive bidding situation. In a move that industry analysts considered extremely surprising, Netflix made a very aggressive bid for the HBO and the Warner studios, and was able to convince the board that its $27.75 per share offer of mostly cash and some Netflix stock, was more valuable than the $30 per share that Paramount offered for the whole company, because it was leaving behind the cable networks which the Warner board valued as worth more than the difference between the two bids. The Warner board also strongly believed that the Netflix offer had terms that made its offer carry greater certainty to close than the Paramount offer. The Ellisons have now decided to go hostile and take their offer to shareholders and this has sparked enormous debate about who should own these assets. WBD's board told shareholders to reject this latest hostile bid on Jan. 7.Does it matter to viewers?First, from a consumer point of view, television viewers care about having substantial amount of choice, at reasonable prices, with plenty of quality productions. Since all the major streaming services seek today is greater engagement — meaning more viewers watching for longer periods of time — whoever owns the Warner studios and HBO will have plenty of incentive to produce more than they currently do and maintain the perception of high quality that HBO commands amongst consumers. Either buyer will serve this consumer interest.The anti-Netflix argument is that since Netflix is the far bigger streaming service today than Paramount+, that it will command sufficient market power to raise price in a way that will be detrimental to streaming subscribers. However, Netflix has pursued a pricing strategy that actually offers the lowest cost service for subscribers that are willing to accept ads, and the highest price service for those who do not want advertisements. This strategy has worked incredibly well for them and there is little reason to think this approach would change, of offering its entire service at the lowest cost. Moreover, as Netflix has argued, being able to offer Netflix and HBO services as a discounted bundle might well provide substantial savings over the status quo for those subscribers that have both services, which is the vast majority of HBO subs. In addition, Paramount, like some of the other services that are much smaller than Netflix and struggling for profitability, have a need to continue to substantially increase the price of their services.Of particular note when considering the issue of consumer choice, Netflix has indicated it will keep the HBO service alive, whereas Paramount+ and HBO are likely to merge into a single stronger service which one might argue will eliminate some degree of choice for consumers, compared to keeping HBO alive as a separate offering.Nevertheless, whoever wins this bidding war will be subject to regulatory review, and that poses questions of competition which is what policymakers most concern themselves with. It is hard to argue that Paramount+ is not a subscale service that badly needs to combine with another player in order to compete with the larger players in the market such as Disney and Amazon, and of course, Netflix. So, yes, competition will be enhanced by Paramount+ combining with HBO to become a stronger streaming player, but just because it is more pro-competitive for Paramount to acquire Warner, however, that does not mean it is anti-competitive under the antitrust laws for Netflix to absorb the Warner properties. What's best for Hollywood?So, let's look at this issue from an industry perspective. Paramount has announced it plans to cut costs far more aggressively once the companies are merged than Netflix anticipates doing so. While much of those cuts will come on the cable side which Netflix would not be buying, many of those cuts will also come from HBO and Paramount+ combining, and maybe more importantly from the Paramount and Warner studios combining. Beyond jobs, combining the Paramount and Warner studios would reduce the number of major studios producing theatrical motion pictures which clearly reduces competition — just as Disney's acquisition in recent years of 20th Century Fox eliminated the latter as a major studio player. The industry counter argument is that Netflix has not been a believer in movie theater distribution and would look to put its output on its streaming service and substantially reduce what plays theatrically. Yet, the response to that argument is Netflix has made very little impact in the media zeitgeist as a producer of movies as compared to its television series, while it has been able to garner substantial viewership from movies that it licenses from third party studios. The difference there is that those licensed movies have had theatrical runs with all the promotional marketing that goes along with those releases, and there is good reason to believe that in order to drive greater engagement of viewers when it comes to movies on Netflix that they would maintain movie theater distribution in order to drive the type of promotional awareness that have made for successful movie runs on the streaming service. There is the further industry issue of how do you even measure competition when it comes to television viewership. Paramount would like regulators to define the relevant market as being streaming services that air long-form tv shows and movies, because under that analysis Netflix combined with HBO Max would have about a 28% market share, whereas Paramount plus HBO Max would only have about a 7% share. This approach would exclude YouTube's first place share of connected TV streaming viewing of 24%. Yet with YouTube included, the Netflix/HBO Max share of streaming to the tv set audience is only about 20%, still below YouTube's viewing share. With YouTube having just bid the Oscars away from Disney/ABC and the Disney streaming services, it is hard to argue that YouTube should not be considered as part of the relevant TV market. The real critical number though is that HBO Max's share of streaming viewing is only 2.6%, so in any event it adds a nominal amount of increased viewership to Netflix, and the resulting Netflix share would not typically rise to the level of concentration that would cause regulators to upset a transaction. The better argument for Netflix actually is that it doesn't just compete in the streaming universe, but for the majority of television households today that still receive traditional broadcast and cable channels, those channels are still significant competition for viewing eyeballs — and when those traditional channels are included Netflix only has about an 8% viewing share, and is only in sixth place well behind Paramount. In fact, when considering the totality of television channels and streaming services together, Paramount's acquisition of Warner would catapult it to first place, even ahead of YouTube, when it comes to total viewership based on Nielsen's latest numbers.When it comes to the advertising revenue which attaches to this viewership Netflix ad revenues are still very nascent, and with the addition of HBO Max ad revenue, would still be a small percentage of overall TV advertising. Paramount's much larger ad revenue would close to double with the acquisition, but neither outcome would substantially change competitive dynamics in the TV ad industry. Regulators would also look at the industry concern as to whether the number of players available to license or acquire shows produced by others would involve a reduction in competition. Whether the buyer of Warner was Netflix or Paramount in either case there would be one less buyer of third-party produced TV shows. So on that score, it is hard to claim one buyer or the other makes a competitive difference. Netflix today might have a much bigger programming budget, but Paramount has already proven that it will bid more aggressively for key licensing rights than any other bidder in the marketplace.What does it mean for the news business?While Netflix would not be acquiring CNN, Paramount would be, and it plans to combine CBS News and CNN which would be a smart rationalization of substantial news operations overhead. However, in the course of accomplishing that there would be a reduction of six major broadcast and cable news organizations down to five, a clear elimination of a competitor just as the case would be with Paramount's acquisition of the Warner studios. While many industry observers would bemoan CNN coming under more conservative leaning editorial leadership, in terms of editorial diversity in the overall media marketplace, it would be hard to argue that the opinions and editorial approach CNN represents can't otherwise be found by viewers elsewhere in their diet of news programming choices.So, there are pluses and minuses for consumers and the industry depending on who bought the Warner properties, but there is no clear-cut case that one outcome is better or worse than the other for consumers or the industry.Trump's influenceNot that this should play any role here in determining an outcome, what about the interests of President Trump?Paramount very much thought it had the inside track to getting Trump's blessing on the acquisition, and the President has made no secret of the fact that he plans to weigh in on an unprecedented basis regarding regulatory approval. While he has clear political ties to Larry Ellison, the President's outlook towards Netflix looks pretty benign. However, there is no doubt Trump wants CNN under different ownership because of its current editorial slant, which could well mean if Paramount does not succeed in acquiring all of Warner, he would be less pleased with the outcome. Yet, there seems to be interest in third parties acquiring CNN, or the whole Warner cable bundle including CNN, and Trump could influence regulatory approval of a CNN deal to a new owner so that it is not left to be spun-off for current Warner management to operate. The fact is Trump has been less than fully satisfied with the performance of CBS News, which is owned by Paramount, since Ellison took it over. So Trump standing in the way of a Netflix acquisition of HBO and the Warner studios because of the ultimate fate of CNN seems like a long shot.Alternatively, if Netflix was to acquire HBO and the studios, Paramount might still acquire the cable assets as a way of bulking up the traditional side of the company and having an opportunity to still take out very substantial cost, including the consolidation of CNN and CBS News. In the end, it appears that the only ones who should really care about the outcome here are the shareholders of the three respective companies, where Warner shareholders clearly care about getting the highest price with the greatest certainty that it will be paid, and the Warner board is going to have to be meticulous in making sure that whatever decision they make is guided by that metric. Larry Ellison has now agreed to personally guarantee the Paramount bid, which largely removes the uncertainty around the equity financing the Warner board had been concerned about — though the board has raised issues surrounding the debt financing — so the question of which offer provides a better price and greater certainty for shareholders is still at issue. Beyond the interests of shareholders, with there being pros and cons running in both directions, it is hard to see that either outcome rises to the level that anybody should really care who ends up owning Warner. Tom Rogers was the first president, NBC Cable and the founder, CNBC. He is a CNBC contributor, senior advisor to Versant (CNBC's parent company) and executive chairman, of AI company Claigrid, Inc. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Does it really matter who ends up owning Warner Bros.? Media exec Tom Rogers breaks it down",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238506-1765220064257-WarnerParamount.jpg?v=1765220220&w=1920&h=1080"
      ],
      "datePublished": "2026-01-13T11:00:02.000Z",
      "dateModified": "2026-01-13T11:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]