[
  {
    "title": "35-year-old American left the U.S. for the U.K., spends about $2,532 a month: 'This is where I'm supposed to be'",
    "url": "https://www.cnbc.com/2025/11/27/american-left-us-for-uk.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108224681-1762949623809-london_street.jpg?v=1762950183&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T23:29:02.000Z",
    "description": "In 2019, Chanel Rivers took a trip to London that would change the entire trajectory of her life.Born and raised in New York, Rivers, now 35, says she",
    "body": "In 2019, Chanel Rivers took a trip to London that would change the entire trajectory of her life.Born and raised in New York, Rivers, now 35, says she was tired of the dating scene and worrying about her safety in the Big Apple. She booked a trip to London with a friend and realized how comfortable she felt walking around the city, something she no longer felt in New York.\"I remember just walking around London and being like, 'I feel like this is where I'm supposed to be.' It was a feeling that came over me,\" Rivers says. \"In London, I just feel like my anxiety has lessened a lot, which is great.\"Shortly after Rivers got back to New York, she started figuring out how to return to London permanently, but the Covid-19 pandemic brought her plans to a complete halt. During the pandemic, Rivers met her now fiancé, Martin, an architect from Canada who was living and working in New York.Rivers was born and raised in New York.Chanel RiversAfter four and a half years of dating, Rivers brought up moving to London again to her fiancé. She admits that the feeling of wanting to move didn't go away, and she didn't see herself being in New York long-term anymore.\"I considered Canada, and we did look at Vancouver, but it was not city enough for me. Being from New York, I needed a big city. London was always the plan for me in my heart,\" she says.Around the same time that Rivers brought up getting the move to London going, her fiancé's job offered him a position in their office there. It was something she says was \"very serendipitous but meant to be.\"Since Martin was already a U.K. citizen, Rivers only needed to apply for a partner visa, which was approved in March 2024.Chanel is part of small but growing trend of Americans relocating to the U.K. More than 6,000 U.S. citizens applied to either become British subjects or to live and work in the country indefinitely from March 2024 to March 2025, the most since the U.K.'s Home Office began keeping records in 2004, according to The Guardian.Hello, LondonIn October 2024, the couple moved into a two-bedroom, one-bathroom apartment with a private garden in West London without ever seeing it in person. The rent was 2,400 pounds or USD $3,159 when they first moved in and has since increased to 2,515.20 pounds or $3,311, according to documents reviewed by CNBC Make It.The apartment was unfurnished, in a townhouse rather than a larger building, and didn't have a doorman, unlike the modern one they lived in back in New York City. The couple didn't ship any of their furniture over because it was too expensive. The first night they spent in the apartment, they slept in sleeping bags on the floor and used their suitcases as a dining table.\"We wanted something with character. We told ourselves we wanted something different when we moved here and we wanted something that felt very London so that we had a different living experience than we did in the U.S.,\" Rivers says.Rivers, her fiancé and their dog moved to London in October 2024.Chanel RiversRivers was able to keep her $120,000 a year job in event planning and marketing through the end of 2024.After that, she started looking for a position in London, which she says helped her explore the city as she traveled for interviews and worked out of local coffee shops. Rivers says she never had homesickness or regretted the move, but she admits that she was still nervous about being in a new city. \"I was so intimidated by London because it's so big and I was kind of scared to go out on my own. I don't know what happened to that brave girl from 2019, but I guess everything just felt so real now, and it was hitting me,\" she adds.One year later and the cost of living in LondonNow that Rivers and her fiancé have lived in London for a little over a year, they have settled in nicely, she says. Rivers found a London-based job working as an event planner. Rivers did not want to disclose her salary, but says that although she did take a pay cut, she's happy with it and spends less money than she did while living in New York. \"I've found that I generally spend less now, mostly because I'm not socializing as much as I did in New York. In London, life is a bit quieter but in a good way,\" she says. \"I still make time to see new friends and meet new people but I go out less. Plus, since I earn less here, I'm more mindful about where my money goes.\"Rivers and her fiancé also split their expenses proportionally based on their incomes. \"My fiancé makes the equivalent of what he made in the U.S., so he's kind of carrying the team right now, which is great,\" she adds.Rivers and her fiancé moved into an apartment without seeing it in person.Chanel RiversRivers' share of the monthly living expenses breakdown is as follows, according to documents reviewed by CNBC Make It:Rent = 1,215 pounds or $1,599Cellphone = 49.70 pounds or $65Internet/Wi-Fi = 20 pounds or $26Water = 59.78 pounds or $79Electricity = 121 pounds or $159Groceries = 300 pounds or $395Transportation = 115 pounds or $151Amazon Prime = 8.99 pounds or $12Pet insurance = 25.21 pounds or $33Apple TV = $12.99Rivers' biggest monthly expenses are rent, groceries and electricity, she says. She commutes to the office three times a week and tends to buy lunch on those days. Since moving to London, Rivers and her fiancé say they have also been able to take advantage of the city's location by taking local day trips on the train and traveling to Ireland and Mallorca. \"It's really nice to have easier access to traveling. I feel like in the U.S., you go on a trip once a year and that's it. It's nice that we can hop on a train and go to Paris for a night or hop on a plane and go to Spain,\" she says. \"The traveling is also a big part of why we wanted to move. Despite it taking a while to get settled, Rivers says she feels they made the right decision.\"I've only felt like this is the right path and where I'm supposed to be. Even the mundane things I do here excite me,\" she says. \"I feel like I'm probably in a honeymoon phase but I feel every day that I made the right choice. I don't think I see myself living in the U.S. now that I know what it's like to live a lifestyle outside of that.\"Rivers says she doesn't see herself moving back to the U.S.Chanel RiversRivers says moving back to the U.S. probably isn't in the cards for her, but she could eventually get on board with moving to Canada after living out her London dream for a few more years. \"Canada wasn't as exciting for where I'm at in life right now. I wanted something a little bit more exciting, like New York, but different. I think when I get older, if we were to move back and we wanted to be closer to family, then Canada would be the place we move to,\" she says.Conversions from British Pounds to USD were done using the OANDA conversion rate of 0.76 pounds to $1 USD on Nov. 11, 2025. All amounts are rounded to the nearest dollar.Black Friday sale: Want to up your AI skills and be more productive? Get 25% off our most popular course of the year, How to Use AI to Be More Successful at Work, with coupon code GETSMART. Offer valid Nov. 17 through Dec. 5, 2025.DON'T MISS: How to use AI to be more productive and successful at work",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "35-year-old American left the U.S. for the U.K., spends about $2,532 a month: 'This is where I'm supposed to be'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108224681-1762949623809-london_street.jpg?v=1762950183&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T23:29:02.000Z",
      "dateModified": "2025-11-27T23:29:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Psychologists say this 'green flag' is one of the strongest predictors of a successful relationship—it can be 'hard to spot'",
    "url": "https://www.cnbc.com/2025/11/27/psychologists-this-is-one-of-the-strongest-predictors-of-a-happy-relationship.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106713249-1600834060854-gettyimages-1171153205-2019_06_14_nordsee_j14_3652.jpeg?v=1600834089&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T14:00:01.000Z",
    "description": "We're often inundated with relationship advice that rarely captures the complexity of what actually makes love work.As a couples counselor with a deca",
    "body": "We're often inundated with relationship advice that rarely captures the complexity of what actually makes love work.As a couples counselor with a decade of experience working with couples and individuals trying to find and stay in love, I've found that one of the most underrated signs of a healthy and resilient relationship is a concept called \"mutual influence.\"Coined by married psychologists Drs. John and Julie Gottman, mutual influence means that you are willing to let your partner's needs, vulnerabilities, and perspectives shape you, and even change something about your own behavior.This quality generally only comes into focus during moments of tension or disagreement, not during easy harmony. At the beginning of a relationship, everyone is usually on their best behavior, which can make this valuable green flag hard to spot early on. Here's how to identify and develop it in your own relationship.  What mutual influence looks like In a 2020 study, psychologists followed nearly 320 couples and found that when both partners felt their voice truly mattered and could genuinely impact the other, relationship quality stayed high and emotional security deepened over the years. Couples who ignored this dynamic stagnated and became more insecure as their satisfaction with their relationship eroded.​When both partners experience mutual influence, the psychologists found that relationships not only feel fairer, but they actually are more stable and loving. Individuals report less anxiety about their partner's commitment, and small conflicts are less likely to snowball into chronic gridlock.This is what mutual influence looks like in practice:Setting your phone aside when your partner says, \"I need you to really hear me right now.\"Going a different route on a road trip because your partner feels anxious about traffic, even if you think your way is faster. Deciding to spend the holidays with their family this year after hearing how much it means to them, even though your tradition was always different. Choosing to pause a personal project for the evening because your partner asks for some help finishing theirs. Switching off the lights when they mention they have a headache.Accepting their feedback about how you speak during disagreements and choosing to change your tone or words, not because you have to, but because you want them to feel safer and closer to you. Mutual influence isn't about giving up your identity in your relationship or shelving what you need for the sake of keeping the peace. True openness means maintaining your values, while still making room for your partner's experience, especially when the two of you don't see eye-to-eye. You are creating a shared life where both of your voices matter.How to develop mutual influence in your relationshipEach week, consciously make one accommodation that you know is important to them. This could be a habit of yours, or making room for a preference of theirs. This signals to your partner that you hear them. So try their restaurant pick, take their suggested route, adjust the thermostat to their ideal temperature. Being flexible in low-stakes moments makes it far easier to access that quality during high-stakes ones.During conflict, I'm also a big fan of asking the question: \"What am I missing that would help this make more sense?\" It's a disarming query because it shows that you're not fighting to be right, but to better understand what's going on in your partner's head.These are small gestures that might look insignificant from the outside, but over time, they create the sense of being considered, included, and influential, which are the conditions where real intimacy takes root. That is what separates the couples who merely coexist from those who continually grow closer.​Baya Voce is a relationship expert who helps couples come back together after conflict. She holds an MSW from Columbia University. She regularly speaks at SXSW, and her TEDx talk on loneliness has over 5 million views. Earn more and get ahead with CNBC's online courses. Black Friday starts now! Get 25% off select courses and 30% off exclusive bundles with coupon code GETSMART. Offer valid November 17 through December 5, 2025.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Psychologists say this 'green flag' is one of the strongest predictors of a successful relationship—it can be 'hard to spot'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106713249-1600834060854-gettyimages-1171153205-2019_06_14_nordsee_j14_3652.jpeg?v=1600834089&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T14:00:01.000Z",
      "dateModified": "2025-11-27T14:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SEC investigates Jefferies over First Brands collapse, report says",
    "url": "https://www.cnbc.com/2025/11/27/sec-investigates-jefferies-over-first-brands-collapse-report-says.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214446-1760996506866-gettyimages-2241909727-JEFFERIES_HQ.jpeg?v=1760996569&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T18:02:34.000Z",
    "description": "The Jefferies Financial Group Inc. headquarters in New York, US, on Monday, Oct. 20, 2025. Michael Nagle | Bloomberg | Getty ImagesThe U.S. Securities",
    "body": "The Jefferies Financial Group Inc. headquarters in New York, US, on Monday, Oct. 20, 2025. Michael Nagle | Bloomberg | Getty ImagesThe U.S. Securities and Exchange Commission is investigating Jefferies' relationship into bankrupt auto parts maker First Brands Group, The Financial Times reported Thursday. The newspaper, citing people with knowledge of the matter, said the regulator is looking into whether Jefferies gave investors enough information on its Point Bonita fund's exposure to the failed auto business. The inquiry into internal controls and potential conflicts within the bank is at an early stage, the report said. It's not clear whether it will result in any allegations of wrongdoing. Jefferies came under pressure last month after its exposure to First Brands — which collapsed under a series of complex debt agreements — raised fears of other bad loans on Wall Street. Stock Chart IconStock chart iconJefferies, ytd performanceShares of Jefferies are down more than 12% this quarter and 27% this year. When asked for comment, an SEC spokesperson said the agency \"does not comment on the existence or nonexistence of a possible investigation.\"Jefferies did not respond to CNBC's request for comment. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SEC investigates Jefferies over First Brands collapse, report says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214446-1760996506866-gettyimages-2241909727-JEFFERIES_HQ.jpeg?v=1760996569&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T18:02:34.000Z",
      "dateModified": "2025-11-27T18:02:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saba Capital activist Boaz Weinstein calls for removal of Baillie Gifford-run tech investment trust’s entire board",
    "url": "https://www.cnbc.com/2025/11/27/saba-capitals-boaz-weinstein-targets-baillie-gifford-run-tech-trust-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107416509-1715954534877-gettyimages-1258512789-BLOOMBERG_INVEST.jpeg?v=1764240097&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T15:11:28.000Z",
    "description": "Boaz Weinstein is calling for the removal of the entire board of a tech-focused fund managed by Baillie Gifford, in a bid to reverse what the activist",
    "body": "Boaz Weinstein is calling for the removal of the entire board of a tech-focused fund managed by Baillie Gifford, in a bid to reverse what the activist investor sees as \"unprecedented\" value destruction.In a letter to the Edinburgh Worldwide Investment Trust's board on Thursday, Weinstein — whose activist investment firm Saba Capital owns around 30% of shares in the trust — said the board has \"objectively and categorically failed\" to deliver the performance expected by shareholders.EWIT's portfolio comprises a global mix of smaller and emerging public and private companies focused on tech innovation and transformation, that target \"significant disruptive growth potential,\" according to the London-listed Baillie Gifford's website. Its holdings include Elon Musk's Space Exploration Technologies, or SpaceX, which makes up 8.4% of its portfolio.Weinstein said EWIT's net asset value is down 30.8% over the past five years, while its share price return has fallen 35%, having \"massively underperformed\" its self-selected benchmark, the FTSE All-Share Index, which is up 71.4% over the same period.That means the company's NAV return and share price performance ultimately lag the benchmark by more than 100% over the five-year period, Saba noted in the letter.Stock Chart IconStock chart iconEdinburgh Worldwide Investment Trust.\"The magnitude of this value destruction is unprecedented among peer U.K. equity investment trusts over this period,\" Weinstein wrote.Jonathan Simpson-Dent, chair of EWIT, expressed disappointment with Saba's open letter.He said EWIT's benchmark is the S&P Global Small Cap Index — not the FTSE All-Share Index cited in Weinstein's letter.\"It makes little sense to judge a global small-cap trust against a U.K. all-cap benchmark,\" Simpson-Dent said in a statement, adding that EWIT's NAV total return has been 17.5% to date, ahead of the S&P Global Small Cap Index's 4.8%. Saba Capital's representatives did not immediately respond to a request for comment on this point.The trust's total assets stood at £847.15 million ($1.1 billion) as of Oct. 31. Weinstein is calling for a general meeting to appoint a new board composed solely of \"qualified, independent directors… committed to delivering long-term value for all shareholders.\"\"We remain profoundly frustrated by the board's prolonged inertia,\" the activist investor wrote in the letter on Thursday. \"We do not have faith in the current Board's ability to implement the necessary strategic changes.\"Simpson-Dent said EWIT's board will continue to seek \"constructive dialog\" with Weinstein toward an \"equitable and holistic\" solution, including return of capital. But he warned: \"While we are open to discuss Board composition with Saba, we would strongly reject any proposal to replace the entire Board and the ambiguity that would follow.\"He added: \"The company's actions over the last year have supported a tightly managed discount, currently 5.6%, significantly narrower than the Global Smaller Companies peer group weighted average discount of 10.9%.\"The move follows an earlier attempt by Saba last year to shake up the EWI trust's board, a bid which ultimately failed to win investor support.Weinstein — whose New York-based $6 billion hedge fund trades credit relative value opportunities — has built a number of positions across the U.K. investment trust space lately. Outlining two new bets at the annual Sohn London investment conference last week, he said there is \"a storm brewing\" in the U.K. investment trust sector where discounts have widened sharply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saba Capital activist Boaz Weinstein calls for removal of Baillie Gifford-run tech investment trust’s entire board",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107416509-1715954534877-gettyimages-1258512789-BLOOMBERG_INVEST.jpeg?v=1764240097&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T15:11:28.000Z",
      "dateModified": "2025-11-27T15:11:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says U.S. to 'permanently pause migration from all Third World Countries’ after DC shooting",
    "url": "https://www.cnbc.com/2025/11/28/trump-us-to-permanently-pause-migration-from-all-third-world-countries.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108233241-1764307695737-gettyimages-2248193614-AFP_86EZ9GB.jpeg?v=1764307790&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T06:34:10.000Z",
    "description": "U.S. President Donald Trump shows a printed photo during a call with service members from his Mar-a-Lago residence in Palm Beach, Florida, on Nov. 27,",
    "body": "U.S. President Donald Trump shows a printed photo during a call with service members from his Mar-a-Lago residence in Palm Beach, Florida, on Nov. 27, 2025, during the Thanksgiving holiday. US President Donald Trump said Thursday that Sarah Beckstrom, one of the two National Guard troops shot a day earlier near the White House, had died, while the other soldier was \"fighting for his life.\"Jim Watson | Afp | Getty ImagesU.S. President Donald Trump on Thursday announced sweeping plans to tighten immigration rules, including a suspension on migration from \"Third World Countries\" and cancellation of all federal benefits and subsidies to \"noncitizens\" in the country.In a pair of Truth Social posts late Thursday night, Trump said he would \"permanently pause migration from all Third World Countries to allow the U.S. system to fully recover,\" without specifying what would be considered a \"third world\" country. The term loosely referred to countries with higher poverty rates and economic instability.The president said he would also terminate \"millions\" of admissions under his predecessor Joe Biden and remove \"anyone who is not a net asset to the United States, or is incapable of loving our Country.\"Trump added he plans to end all federal benefits and subsidies for noncitizens, \"denaturalize migrants who undermine domestic tranquility,\" and deport any foreign national he described as a \"public charge, security risk, or non-compatible with Western Civilization.\"Read more CNBC politics coverageJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'His comments came after two National Guard members were shot near the White House on Wednesday, one of whom died from her injuries a day later. Investigators said the attack was carried out by an Afghan national.Hours after the shooting, U.S. Citizenship and Immigration Services director Joseph Edlow said in a post on X that the agency would review every immigrant holding a Green Card from a \"country of concern.\"The agency also announced the immediate and indefinite suspension of all immigration requests involving Afghan nationals.Trump has pursued an aggressive immigration agenda since returning to the White House earlier this year. In June, he announced a broad travel ban covering immigrants from 19 countries, including Afghanistan.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says U.S. to 'permanently pause migration from all Third World Countries’ after DC shooting",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108233241-1764307695737-gettyimages-2248193614-AFP_86EZ9GB.jpeg?v=1764307790&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T06:34:10.000Z",
      "dateModified": "2025-11-28T06:34:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CME halts futures trading after 'cooling issue' at data center",
    "url": "https://www.cnbc.com/2025/11/28/cme-halts-fx-commodities-futures-trading-after-data-center-issue.html",
    "image": "https://image.cnbcfm.com/api/v1/image/105910276-1557771677137gettyimages-103142398.jpeg?v=1764313028&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T08:17:50.000Z",
    "description": "The floor of the Chicago Mercantile Exchange (CME)/New York Mercantile Exchange (Nymex) in New York City. CME Group is the world's largest and most di",
    "body": "The floor of the Chicago Mercantile Exchange (CME)/New York Mercantile Exchange (Nymex) in New York City. CME Group is the world's largest and most diverse derivatives exchange.David S. Holloway | Getty ImagesTrading came to a standstill on the Chicago Mercantile Exchange on Friday following a cooling issue at one of its data centers. \"Due to a cooling issue at CyrusOne data centers, our markets are currently halted,\" a spokesperson for the CME said in an emailed statement in the early hours of Friday. \"Support is working to resolve the issue in the near term and will advise clients of Pre-Open details as soon as they are available.\"The CME — the largest exchange operator in the world by market value — trades futures and options across various asset classes, including agricultural commodities, energy, metals and equities. A spokesperson for Dallas, Texas-headquartered CyrusOne was not immediately available for comment. By 2:30 a.m. ET, futures prices for WTI crude, U.S. 10-year Treasurys and the S&P 500 were among those that had not been updated, LSEG data showed. It's not the first time the CME has had to shut down electronic trade. Back in 2014, technical issues shut down some trading on the CME's Globex electronic system, impacting agricultural contracts. Last year, trading of quities, bonds and exchange-traded funds was also temporarily halted in Switzerland after stock exchange SIX had problems disseminating data. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CME halts futures trading after 'cooling issue' at data center",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/105910276-1557771677137gettyimages-103142398.jpeg?v=1764313028&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T08:17:50.000Z",
      "dateModified": "2025-11-28T08:17:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple is challenging India's antitrust body over a potential $38 billion fine",
    "url": "https://www.cnbc.com/2025/11/27/apple-challenges-indias-anti-trust-body-over-potential-38-billion-fine.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108115188-1741833320394-gettyimages-1681507978-INDIA_IPHONE_15.jpeg?v=1748332385&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T12:36:32.000Z",
    "description": "The first day of sale of the iPhone 15 smartphone in Mumbai, India, on Sept. 22, 2023.Dhiraj Singh | Bloomberg | Getty ImagesApple has filed a case in",
    "body": "The first day of sale of the iPhone 15 smartphone in Mumbai, India, on Sept. 22, 2023.Dhiraj Singh | Bloomberg | Getty ImagesApple has filed a case in the Delhi High Court against the country's antitrust body because of how it considers global turnover when calculating penalties.The iPhone maker, which is among the fastest-growing smartphone brands in India, is challenging India's new antitrust law under which the U.S. company could face fines of up to $38 billion, according to a report by Reuters.Apple added that it was \"unconstitutional, grossly disproportionate, unjust\" for the Competition Commission of India (CCI) to use turnover when calculating penalties.Apple did not immediately respond to a request for comment from CNBC.The CCI has been investigating complaints from an alliance of Indian startups and Tinder-owner Match Group that accuse Apple of \"abusive conduct,\" which forces developers to pay high commissions for in-app purchases. Apple denied the charges.The CCI's final verdict is still pending, but it said its \"prima facie view [is] that mandatory use of Apple's IAP for paid apps and in-app purchases restricts the choice available to the app developers to select a payment processing system of their choice,\" in an order in December 2021.Apple recorded its highest-ever quarterly shipments in India of 5 million units in the third quarter of 2025, according to data from IDC. watch nowThe company is expected to sell about 15 million iPhones in India this year and could rank among the top five smartphone companies there, Navkendar Singh, associate vice president with IDC India,  on Nov. 18.Apple is among the global companies diversifying their manufacturing supply chains away from China to India. In 2024, Apple's exports from India hit a record of $12.8 billion, up more than 42% from a year earlier.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple is challenging India's antitrust body over a potential $38 billion fine",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108115188-1741833320394-gettyimages-1681507978-INDIA_IPHONE_15.jpeg?v=1748332385&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T12:36:32.000Z",
      "dateModified": "2025-11-27T12:36:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alibaba's AI glasses to rival Meta go on sale for $500 ",
    "url": "https://www.cnbc.com/2025/11/27/alibaba-quark-ai-glasses-go-on-sale-price-specs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108177567-1753687050071-Alibaba_AI_glasses.jpg?v=1753690514&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T09:07:07.000Z",
    "description": "Alibaba announced plans to release a pair of smart glasses powered by its AI models. The Quark AI Glasses are Alibaba's first foray into the smart gla",
    "body": "Alibaba announced plans to release a pair of smart glasses powered by its AI models. The Quark AI Glasses are Alibaba's first foray into the smart glasses product category.AlibabaAlibaba's artificial intelligence-powered smart glasses went on sale on Thursday as the Chinese tech giant looks to ramp up its focus on consumer AI in an increasingly competitive market. The Quark AI Glasses, first announced in July, come in two variants — the S1, which starts at  3,799 Chinese yuan ($536) and G1 at 1,899 yuan.The tech giant has integrated its Qwen AI models — Alibaba's version of ChatGPT — with the device which also links to its newly-launched Qwen app. This means users can use voice control to get the glasses to carry out tasks.The lenses of the glasses are effectively screens and the device has a camera built into the frame. The main difference between the S1 and G1 is the display, Alibaba said.watch nowThe company said that some of the features include on-the-go translation, AI-generated meeting notes and the ability to ask the virtual assistants questions. Users take pictures of a product using the camera in the lens and then the device will show the price of that product on Taobao, Alibaba's main shopping app in China. Alibaba, like other technology companies such as U.S. giant Meta, are betting that smart glasses could be the next big consumer device after the smartphone.In September, Meta unveiled the $799 Meta Ray-Ban Display glasses, the social media company's first consumer-ready smart glasses with a built-in display. Users can control the device via hand gestures with a special wristband. Alibaba's glasses will initially go on sale in China and compete with domestic rivals, including consumer electronics maker Xiaomi and startup Xreal. The smart glasses market is still small but growing rapidly. By 2026, shipments of AI glasses are expected to exceed more than 10 million units, doubling from 2025, according to a forecast from Omdia. For Alibaba, the glasses are its latest play in the consumer AI market as it looks to build on its recent successes. The company's ChatGPT-style Qwen app got 10 million downloads in the first week of the public beta launch. Meanwhile, Alibaba's cloud computing business, where it books much of its AI-relate revenue, saw an acceleration of growth in the last quarter.The Hangzhou, headquartered company is one of the leaders in China's AI space, and has been investing aggressively in AI alongside rival giants like Baidu and Tencent, and aggressively launching new models.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alibaba's AI glasses to rival Meta go on sale for $500 ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108177567-1753687050071-Alibaba_AI_glasses.jpg?v=1753690514&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T09:07:07.000Z",
      "dateModified": "2025-11-27T09:07:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Korea joins growing number of countries imposing sanctions on Prince Group as probe into Cambodian scams widens",
    "url": "https://www.cnbc.com/2025/11/28/south-korea-sanction-prince-group-chen-zhi-cambodia-scams-huione.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108233200-1764298855195-gettyimages-2241385574-AA_18102025_2475988.jpeg?v=1764298863&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T05:15:40.000Z",
    "description": "INCHEON, SOUTH KOREA - OCTOBER 18: Sixty-four South Koreans who had been detained by Cambodian immigration authorities arrive at Incheon International",
    "body": "INCHEON, SOUTH KOREA - OCTOBER 18: Sixty-four South Koreans who had been detained by Cambodian immigration authorities arrive at Incheon International Airport on a chartered flight in Incheon, South Korea, on October 18, 2025. Anadolu | Anadolu | Getty ImagesSouth Korea became the latest country to impose sanctions on Prince Group, a multinational network accused of running large-scale fraud operations across Southeast Asia. Seoul's move follows similar actions by the U.S., UK, and Singapore.In a statement Thursday, South Korea's Ministry of Foreign Affairs said that the measures mark the country's first independent sanctions regarding transnational crime and the \"largest single sanction measure in history,\" according to a Google translation.\"It shows the government's firm determination to actively respond to online organized crime in Southeast Asia that is causing serious damage at home and abroad,\" the statement added. Prince Group is accused of operating large-scale online 'scam centers' in Cambodia and Myanmar that used trafficked workers to defraud victims around the world. South Korean sanctions target 15 people and 132 entities linked to the network.The documents detailed the completion of two particular facilities staffed with 1,250 mobile\nphones that controlled 76,000 accounts on a popular social media platform.Source: US Eastern District of New YorkSouth Korea and Cambodia agreed in October to set up a joint task force to help tackle online crimes, after a university student died of torture in August in a scam compound.Prince Group has denied any wrongdoing. In a Nov. 11 statement issued through U.S. law firm Boies Schiller Flexner, the group called the allegations \"baseless.\"\"The recent allegations are baseless and appear aimed at justifying the unlawful seizure of assets worth billions of dollars,\" the Cambodia-based network said, adding that it had engaged a team of lawyers from the U.S. legal powerhouse.CNBC has reached out to Prince Group and Boies Schiller Flexner for comment and didn't immediately hear back.Crackdown widensThe latest action against Prince Group builds on broader international efforts to curb scam networks in the region. On Oct. 14, the U.S. and UK announced sweeping sanctions on Prince Group, which the U.S. Treasury Department designated as a \"Transnational Criminal Organization.\"The U.S. Department of Justice also seized about $15 billion worth of bitcoin on Oct. 14, held in cryptocurrency wallets owned by Cambodian national Chen Zhi, the chairman of Prince Group. Zhi, a 38-year-old Chinese-born emigre who is also known as \"Vincent,\" was also charged with wire fraud conspiracy and money laundering conspiracy and remains at large.Chart of The Prince Group Transnational Criminal OrganizationU.S. Treasury DepartmentAnother Cambodian financial network, Huione Group, was also banned from the U.S. financial system on the same day, which the U.S. Treasury Department accused in May of colluding with North Korean cybercriminals.\"Huione Group serves as a critical node for laundering proceeds of cyber heists carried out by the Democratic People's Republic of Korea (DPRK), and for [Transnational Criminal Organizations] in Southeast Asia perpetrating virtual currency investment scams, commonly known as \"pig butchering\" scams, among others,\" the U.S. Treasury Department said.Seoul's sanctions announced Thursday also target the Huione Group. The British government said the centers in Southeast Asia used fake job adverts to lure workers, who were then forced to commit online fraud, including love scams and crypto scams, under threat of torture.In October, Singapore had seized over 150 million Singapore dollars of assets linked to the group. The Singapore Police Force said these included bank accounts, securities accounts and cash.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Korea joins growing number of countries imposing sanctions on Prince Group as probe into Cambodian scams widens",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108233200-1764298855195-gettyimages-2241385574-AA_18102025_2475988.jpeg?v=1764298863&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T05:15:40.000Z",
      "dateModified": "2025-11-28T05:15:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple iPhone shipments to beat Samsung for the first time in 14 years, report says",
    "url": "https://www.cnbc.com/2025/11/26/apple-iphone-shipments-to-beat-samsung-for-the-first-time-in-14-years.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108196778-1757507590799-gettyimages-2234563479-_73a3022_jnkqswz6.jpeg?v=1764165696&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T14:39:06.000Z",
    "description": "Apple CEO Tim Cook holds up a new iPhone 17 Pro during an Apple special event at Apple headquarters on September 09, 2025 in Cupertino, California. Ju",
    "body": "Apple CEO Tim Cook holds up a new iPhone 17 Pro during an Apple special event at Apple headquarters on September 09, 2025 in Cupertino, California. Justin Sullivan | Getty ImagesApple is set to ship more smartphones than Samsung in 2025, the first time it will have done so in 14 years, Counterpoint Research said in a note on Wednesday.Apple will ship around 243 million iPhone units this year versus 235 million shipments from Samsung, Counterpoint told CNBC. Apple is likely to end up with a 19.4% share of the global smartphone market while Samsung's share will be 18.7%.Shipments refer to the number of devices vendors ship to retail channels and do not directly equal sales. However, they provide insights into demand and expectations of sales from smartphone makers.Apple's success is being driven by its iPhone 17 series launched in September, which, according to Counterpoint, had a \"bumper\" holiday sales season.Sales of the iPhone 17 series in the U.S. — including the iPhone Air — during the first four weeks after launch was 12% higher than that of the iPhone 16 series, excluding the iPhone 16e, the research firm said. In China, a critical market for Apple, sales of the iPhone 17 series during the same period were 18% higher than its predecessor.\"Beyond the highly positive market reception for the iPhone 17 series, the key driver behind the upgraded shipment outlook lies in the replacement cycle reaching its inflection point. Consumers who purchased smartphones during the COVID-19 boom are now entering their upgrade phase,\" Counterpoint Research Senior Analyst Yang Wang, said in the note. Samsung meanwhile, could face challenges in the low-to-mid tier of the smartphone market from Chinese players, which could hamper the South Korean giant's ability to reclaim the top spot, Counterpoint said. Apple longer-term boostCounterpoint Research forecasts Apple will hold the top spot in the global smartphone market through 2029. The analysts laid out a few reasons why.Firstly, 358 million second-hand iPhones were sold between 2023 and the second quarter of 2025. \"These users are also likely to upgrade to a new iPhone in the coming years. These factors will form a sizable demand base, which is expected to sustain iPhone shipment growth over the coming quarters,\" Counterpoint Research said.Apple benefited from a lower-than-expected impact from tariffs given the trade truce between the U.S. and China. This helped Apple's broader supply chain and growth in certain regions, such as emerging markets. The tech giant also benefited from a weaker U.S. dollar and a \"resilient economic outlook\" that boosted consumer confidence.\"With these structural tailwinds, Apple is well-positioned to surpass Samsung in annual shipments in 2025,\" Wang said.Meanwhile, Apple is expected to launch the entry level iPhone 17e next year as well as a foldable smartphone, Counterpoint forecast. The research firm said it expects the previously-announced improvements to Apple's virtual assistant Siri as well as a \"major iPhone design revamp\" in 2027, to also underpin Apple's dominance over the next few years.\"By expanding its lineup across multiple price tiers, including the growing \"e\" series, and potential adjustments to the Pro and Base launch cycles, Apple is strategically positioning itself to capture rising demand from aspirational consumers, particularly in emerging markets, and to strengthen its presence in the lower premium segment, which is projected to grow faster than the overall market,\" Counterpoint said.\"Given an increasing preference for the iOS ecosystem, compatibility between devices and a substantial number of older models within Apple's installed base due for renewal, Apple will retain the lead over other smartphone OEMs through the end of the decade.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple iPhone shipments to beat Samsung for the first time in 14 years, report says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108196778-1757507590799-gettyimages-2234563479-_73a3022_jnkqswz6.jpeg?v=1764165696&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T14:39:06.000Z",
      "dateModified": "2025-11-26T14:39:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Baidu is emerging as a major AI chip player in China to fill the Nvidia gap",
    "url": "https://www.cnbc.com/2025/11/28/baidu-is-major-ai-chip-player-in-china-to-fill-nvidia-gap.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108233025-1764244459954-gettyimages-2226761556-tang-notitle250728_npWbw.jpeg?v=1764244509&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T06:20:53.000Z",
    "description": "A general view of the Baidu logo is seen at the Shanghai New Expo Center during the World Artificial Intelligence Conference 2025 in Shanghai, China, ",
    "body": "A general view of the Baidu logo is seen at the Shanghai New Expo Center during the World Artificial Intelligence Conference 2025 in Shanghai, China, on July 28, 2025.Ying Tang | Nurphoto | Getty ImagesTech giant Baidu is emerging as one of China's key artificial intelligence chip players, positioning itself as a challenger to Huawei as both look to fill the void left by industry leader Nvidia being kept out of the country. Best-known as China's biggest search business, Baidu has in recent years refocused its business around driverless cars and AI, including a majority-owned subsidiary, Kunlunxin, which designs chips.Several analysts have upgraded their outlook on Baidu's stock over the past few weeks, citing the semiconductor business and forecasting the unit will gain more domestic orders.This month, Baidu laid out a five-year roadmap for its Kunlun AI chips, beginning with the M100 in 2026 and the M300 in 2027. The company already uses a mix of its self-developed chips in its data centers to run its ERNIE AI models, as well as Nvidia products. Baidu makes money by selling its chips to third parties building data centers as well as renting out computing capacity via its cloud. It has sought to position itself as a so-called \"full stack\" AI offering with infrastructure made up of chips, servers and data centers, as well as AI models and applications.And the chip business appears to be gaining traction. Earlier this year, Kunlunxin won orders from suppliers to China Mobile, one of the country's biggest mobile carriers.\"Kunlunxin has emerged as a leading domestic AI chip developer, focusing on high- performance AI chips for large language model (LLM) training and inference, cloud  computing, and telecom and enterprise workloads,\" analysts at Deutsche Bank said in a note this month.While Nvidia's graphics processing units (GPUs) are widely regarded as the most advanced chips for training and running AI, the company has been blocked by the U.S. government from selling its top-end product to China. Beijing has also reportedly been persuading local tech companies not to buy the H20, a less powerful Nvidia chip designed for the Chinese market and greenlit for export.With Huawei — the leading player through its massive clusters of chips — out of the picture, analysts are suggesting Baidu will fill the void and its chip business is set for explosive growth.\"We believe domestic demand for AI compute in China remains intense, and hyperscalers are increasingly sourcing from local solution providers,\" JPMorgan said in a note on Sunday. \"We view Kunlun AI chip as one of the best positioned.\"The investment bank analysts forecast Baidu chips sales to increase six-fold to reach 8 billion Chinese yuan ($1.1 billion) in 2026.Analysts at Macquarie estimate that Baidu's Kunlun chip unit could be valued at about $28 billion. Baidu is not alone among China's tech giants when it comes to self-developed semiconductors. CNBC reported in August that Alibaba is also developing its next-generation AI chip. AI chip shortages hit ChinaBaidu's chip push comes as Chinese tech giants this month said they're seeing supply shortages.Eddie Wu, CEO of Alibab, said that \"the supply side is going to be a relatively large bottleneck\" over the next two-to-three years, referring to components and chips required to build data centers. Tencent said this month that its 2025 capital expenditure would be lower than initially anticipated. But Tencent President Martin Lau said this this was not because of a lack of demand, but more a shortage of available chips to spend the money on. \"It is not a reflection of our change in AI strategy ... It is indeed a change in terms of the AI chip availability,\" Lau said. watch nowPart of this shortage has been driven by global demand and resulting bottlenecks in the semiconductor supply chain. But China's effective block of Nvidia chips has also reduced the supply.Chinese tech firms have tried to mitigate the shortage by using stockpiled chips, as well as trying to make their AI models more efficient to do more with the semiconductors they have.Meanwhile, China has its own challenges with manufacturing because its biggest chipmaker SMIC, is unable to compete on the scale and technology with leaders like Taiwan Semiconductor Manufacturing Co. That makes it hard for the China to manufacture enough domestic chips to fill the shortfall. Like their U.S. counterparts, Chinese tech companies have continually reported strong demand for AI. \"We see that customer demand for AI is and remains very strong. In fact, we are not even able to keep pace with the growth in customer demand … in terms of the pace at which we can deploy new servers,\" Alibaba's Wu said this week. That gives Baidu an opportunity in China.\"Baidu's chip push is both a necessity and an opportunity. It's a necessity, because Chinese platforms can no longer assume a steady diet of US GPUs; opportunity, because there's now a semi‑captive, multi‑billion‑dollar domestic market for AI hardware that is compliant with both US export rules and Beijing's self‑reliance agenda,\" Nick Patience, practice lead for AI at The Futurum Group, told CNBC.\"If Baidu can ship competitive Kunlun generations on time, it doesn't just solve its own supply problem — it becomes a strategic supplier to the rest of China's AI industry.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Baidu is emerging as a major AI chip player in China to fill the Nvidia gap",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108233025-1764244459954-gettyimages-2226761556-tang-notitle250728_npWbw.jpeg?v=1764244509&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T06:20:53.000Z",
      "dateModified": "2025-11-28T06:20:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chinese giants rush to pledge millions after Hong Kong’s deadliest fire since 1948 kills 94",
    "url": "https://www.cnbc.com/2025/11/27/chinese-firms-rush-to-pledge-millions-in-fire-rescue-as-hong-kong-fire-death-toll-climbs-to-55.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232973-1764230663993-gettyimages-2248064620-167a4923.jpeg?v=1764230761&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T03:13:57.000Z",
    "description": "Firefighters walk near residential buildings that continue to burn at Wang Fuk Court in the Tai Po district on Nov. 27, 2025 in Hong Kong, China.Isaac",
    "body": "Firefighters walk near residential buildings that continue to burn at Wang Fuk Court in the Tai Po district on Nov. 27, 2025 in Hong Kong, China.Isaac Lawrence | Getty Images News | Getty ImagesChinese private firms pledged tens of millions of dollars to support rescue and relief efforts after a deadly residential fire in Hong Kong killed at least 94 people and left hundreds missing.Alibaba Group and its affiliate Ant Group together committed 30 million Hong Kong dollars to support fire relief efforts. Alibaba founder Jack Ma, one of the most recognizable Chinese entrepreneurs, also pledged HK$30 million through his charity foundation to provide emergency aid to those affected. Sportswear maker Anta, which owns brands such as Jack Wolfskin and Fila, said it would donate HK$30 million in cash and equipment. Xiaomi Corp and ByteDance each pledged HK$10 million to aid the rescue efforts and support victims of the blaze. Tencent, which initially donated HK$10 million, later increased its pledge to $30 million.More than 40 private enterprises have committed over HK$600 million in donations to the rescue effort as of Wednesday, according to estimates by The Paper, a news outlet backed by the Shanghai government.      The fire rescue efforts have also drawn HK$10 million from China's private equity firm HongShan Capital Group (HSG), formerly known as Sequoia Capital China. Separately, private equity titan Jean Eric Salata, Chairperson of EQT Asia, also pledged HK$10 million through his family office, Central Cove, to fund grief and psychological support, education resources for displaced children, and financial relief for victims' families.  The wave of donations followed comments from President Xi Jinping, who urged all-out efforts to reduce casualties and rallied relevant authorities and parties to provide \"necessary support.\" Organizations pledge millions after Hong Kong fireChina Red Cross: 2 million yuanXiaomi: HK$10 millionAnta Group: HK$30 millionTencent Charity Foundation: HK$30 millionByteDance: HK$10 millionAnt Group: HK$10 millionAlibaba Group: HK$20 millionFuguiniao Group: HK$5 millionBe Friends Holdings: HK$1 millionXpeng: HK$5 millionBYD: HK$10 millionGeely: HK$10 millionNetEase: HK$10 millionTrip.com: HK$10 millionWens Foodstuff: HK$40 millionMidea Group: HK$10 millionDu Xiaoman: HK$10 millionXtep Group: HK$20 millionLenovo: HK$10 millionS.F. Holding: HK$20 millionBaidu: HK$10 millionPDD: HK$10 millionShangri-la Group: HK$10 millionChina Merchants Group: HK$20 millionHKEX Foundation: HK$10 millionMixue: HK$20 millionCATL: HK$15 millionAIA Hong Kong: HK$20 millionSource: ReutersChinese entrepreneurs have ramped up their charitable commitments in recent years to heed Beijing's call to put social responsibility before profits, amid tightened regulatory scrutiny of the private sector. Xiaomi's co-founder, Lei Jun, has donated more than 1.7 billion yuan ($240 million) since launching his philanthropic foundation in 2019 to support cutting-edge technology development and provide financial assistance to students from low-income families. In 2021, Meituan's founder, Wang Xing, contributed shares worth about $2.3 billion to his philanthropic foundation, which promotes education and scientific research. ByteDance's Zhang Yiming has also given away parts of his fortune to charitable causes. A woman is seen crying near residential buildings that continue to burn at Wang Fuk Court in the Tai Po district on Nov. 27, 2025 in Hong Kong, ChinaIsaac Lawrence | Getty Images News | Getty ImagesWorst fire since 1948China's state-run Xinhua News Agency said Friday morning that the death toll had risen to 94, citing the fire department. It is the city's deadliest blaze since 1948, when a warehouse fire killed 176 people.The latest blaze tore through Wang Fuk Court, an eight-tower public housing complex in northern Hong Kong, home to 4,600 people in 2,000 apartments, according to Reuters.On Thursday morning, Reuters reported, citing authorities, that the fire in four of the seven affected blocks had been brought under control nearly a full day after the fire began. Firefighters were still working to contain the blaze in the remaining areas.Officials said the blaze may have started on a section of bamboo scaffolding encasing the complex, then spread to other buildings through the wooden poles and protective netting — prompting public scrutiny of the city's housing standards.  Hong Kong's police pointed to a \"grossly negligent\" construction company for using \"highly inflammable\" foam material, protective mesh sheets and plastic that may not have met fire standards. Three men from the construction company have been arrested on suspicion of \"manslaughter.\"  Volunteers give out food to residents after a major fire swept through several apartment blocks at the Wang Fuk Court residential estate in Hong Kong's Tai Po district on Nov. 27, 2025. Peter Parks | Afp | Getty Images",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chinese giants rush to pledge millions after Hong Kong’s deadliest fire since 1948 kills 94",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232973-1764230663993-gettyimages-2248064620-167a4923.jpeg?v=1764230761&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T03:13:57.000Z",
      "dateModified": "2025-11-28T03:13:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Putin breaks his silence on Ukraine peace plan, says Moscow ready for 'serious' talks",
    "url": "https://www.cnbc.com/2025/11/27/putin-moscow-ready-for-serious-talks-on-ukraine-peace-plan.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108233058-1764251945985-gettyimages-2248081649-AFP_86C62Q7.jpeg?v=1764252021&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T18:40:30.000Z",
    "description": "In this pool photograph distributed by the Russian state agency Sputnik, Russia's President Vladimir Putin attends a meeting of the Collective Securit",
    "body": "In this pool photograph distributed by the Russian state agency Sputnik, Russia's President Vladimir Putin attends a meeting of the Collective Security Treaty Organisation (CSTO) Heads of State Council at the Yntymak Ordo (Palace of Unity) presidential residence in Bishkek on November 27, 2025. Alexander Kazakov | Afp | Getty ImagesRussian President Vladimir Putin has broken his silence on a U.S.-backed peace plan to end the war in Ukraine, saying Moscow is ready for \"serious\" discussions about the draft proposals.Putin said Thursday that the outlines of a fledgling peace plan that has been reached by the U.S. and Ukraine could be the basis of a deal that ends the almost four-year long conflict.\"In general, we agree that this can be the basis for future agreements,\" Putin said in comments made during a trip to Kyrgyzstan and translated by Reuters.The president added that the U.S. appeared to be taking Russia's position on a peace settlement \"into account\" and that Moscow was ready for \"serious discussions\" when U.S. special envoy Steve Witkoff travels to Moscow next week for talks.It's the first time Putin has publicly addressed a peace plan since a flurry of diplomacy between the U.S. and Ukraine in the last few days. Those talks came after reports last week of a U.S.-Russia devised 28-point peace plan, which appeared to heavily favor Russia's demands.  Ukraine and its European allies' scrambled to mount a response, amending the plan and inserting counter proposals which were discussed in Geneva last weekend with a U.S. delegation led by U.S. Secretary of State Marco Rubio. All eyes on RussiaThe current draft plan, which has reportedly been slimmed down to 19 key proposals, appears to have received Ukraine's tentative backing, putting the ball back in Russia's court as to whether it could accept the framework and build upon it.On Wednesday, Putin's close aide Yuri Ushakov had claimed that Russia had not even seen an official version of the latest U.S.-backed draft deal for Ukraine, but that it had seen an unofficial version.Regarding the plan it had seen, Ushakov said the Kremlin viewed some aspects of the plan positively while \"several of its points require serious analysis.\"Sergei Ryabkov, Russia's deputy foreign minister, said Moscow welcomed U.S. efforts on peace proposals but said \"there are no concessions on key issues on the Ukraine settlement,\" suggesting there could be some distance to travel before a deal is actually reached. Putin's Press Secretary Dmitry Peskov warned on Wednesday against jumping to conclusions regarding an end to the war, which Russia launched when it invaded Ukraine in Feb. 2022.\"Wait. It's too early to say that,\" Peskov told reporters, state news agency TASS reported, when asked whether this was the closest Russia and Ukraine had ever been to concluding a peace agreement. Putin on Thursday praised Russian advances in Ukraine and told reporters that the fighting in Ukraine would stop only when Ukrainian troops withdraw from their positions in key areas. If they did not do so, then Russian forces would achieve their objectives by force, he added, appearing to suggest that Moscow was not willing to give up one of its key objectives in the war (and contained within the initial peace plan secretly drafted with the U.S.) which was to have full control of Ukraine's eastern Donbas region.CNBC has contacted the Kremlin for further comment and is awaiting a response.Ukraine on board, tentativelyMultiple outlets reported Tuesday that a Ukrainian delegation that had held talks with U.S. officials in Abu Dhabi on Tuesday appeared to tentatively support the basis of a U.S.-backed peace plan — though key details remained unresolved.ABC News and CBS News both reported an unnamed U.S. official had said that the Ukrainians \"have agreed\" to the deal, while adding there were still points that had to be ironed out. It was unclear if both stories quoted the same U.S. official.Ukraine President Volodymyr Zelenskyy said later Tuesday that Kyiv was ready to advance the peace framework, Reuters reported, citing a copy of a speech the president gave to a coalition of allied countries.U.S. President Donald Trump said at the White House on Tuesday, \"I think we're getting very close to a deal. We'll find out ... I think we're making progress.\"In a Truth Social post later Tuesday afternoon, Trump said, \"there are only a few remaining points of disagreement.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Putin breaks his silence on Ukraine peace plan, says Moscow ready for 'serious' talks",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108233058-1764251945985-gettyimages-2248081649-AFP_86C62Q7.jpeg?v=1764252021&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T18:40:30.000Z",
      "dateModified": "2025-11-27T18:40:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Asia-Pacific stocks trade mixed as Tokyo inflation runs hotter than expected",
    "url": "https://www.cnbc.com/2025/11/28/asia-markets-live.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108115939-1741929513555-gettyimages-1220737608-shibuyacrossrushhour-5.jpeg?v=1742947637&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T08:11:28.000Z",
    "description": "Pedestrians walking across a crowded traffic at Shibuya crossing square in Tokyo, Japan.Jaczhou | E+ | Getty ImagesAsia-Pacific markets traded mixed F",
    "body": "Pedestrians walking across a crowded traffic at Shibuya crossing square in Tokyo, Japan.Jaczhou | E+ | Getty ImagesAsia-Pacific markets traded mixed Friday as U.S. stock futures stayed flat over Thanksgiving Day, leaving the Nasdaq Composite on track to end a seven-month winning streak.Traders in Asia will parse fresh economic data, including Tokyo's inflation print, a leading indicator of Japan's broader price trends.Headline inflation in Japan's capital eased to 2.7% in October from 2.8% the month before. Core inflation, which strips out prices of fresh food but includes energy prices, came in at 2.8%, slightly higher than the 2.7% expected by economists polled by Reuters. This was above the central bank's 2% target, boosting the case for a near-term rate hike.Investors will also watch India's GDP for its fiscal second quarter through September, later in the day.Japan's Nikkei 225 rose 0.17% to 50,253.91, while the broad-based Topix was 0.29% higher to end at 3,378.44. Both Japanese indexes marked their third day of gains.South Korea's Kospi was down 1.51% and closed at 3,926.59, and the small-cap Kosdaq gained 3.71% and finished at 912.67.Enchem, a battery materials maker listed on the Kosdaq, surged by over 16% after South Korean media reported it had won an order from Chinese battery maker Contemporary Amperex Technology Limited, or CATL. LG Energy Solution slipped over 6.8%, making it the largest loser on the Kospi after parent LG Chem said it would pare its stake to about 70% from its current level of almost 80%, in order to improve shareholder returns.Australia's S&P/ASX 200 was marginally lower, closing at 8,614.1.Hong Kong's Hang Seng index dropped 0.34% finishing at 25,858.89, while the mainland Chinese CSI 300 rose 0.25% to end at 4,526.67. Shares of property developer China Vanke gained 1.12% in Hong Kong after falling to an all-time low.India's Nifty 50 was flat, and the BSE Sensex index climbed 0.1%.Overnight in the U.S., all three major indexes were little changed. Dow Jones Industrial Average futures rose just 10 points. S&P 500 futures and Nasdaq-100 futures traded just above the flatline.Stocks are on pace for a losing month when trading resumes on Friday. A pullback in tech stocks has weighed on the major averages in November, as doubt swirled around the future profitability of AI companies.Yet some investors are hopeful that this month's slide will signal a year-end rally for the major averages, as they step in to buy stocks that have been unduly punished at more attractive valuations.U.S. markets were closed Thursday for Thanksgiving Day. The stock market will close early at 1 p.m. ET on Friday.— CNBC's Sean Conlon and Pia Singh contributed to this report. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Asia-Pacific stocks trade mixed as Tokyo inflation runs hotter than expected",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108115939-1741929513555-gettyimages-1220737608-shibuyacrossrushhour-5.jpeg?v=1742947637&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T08:11:28.000Z",
      "dateModified": "2025-11-28T08:11:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China industrial profits drop 5.5% in October, worst performance in five months  ",
    "url": "https://www.cnbc.com/2025/11/27/china-industrial-profits-drop-in-october-worst-level-in-five-months-trade-uncertainty.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232846-1764201290410-gettyimages-2197358286-ECP_fc1233819.jpeg?v=1764201304&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T03:35:57.000Z",
    "description": "QINGDAO, CHINA - FEBRUARY 05 2025: Workers assemble cars at a car plant of SAIC-GM-Wuling in Qingdao city in east China's Shandong province Wednesday,",
    "body": "QINGDAO, CHINA - FEBRUARY 05 2025: Workers assemble cars at a car plant of SAIC-GM-Wuling in Qingdao city in east China's Shandong province Wednesday, Feb. 05, 2025. ZHANG JINGANG | Future Publishing | Getty Images Chinese industrial firms saw their earnings take a hit in October as trade tensions with the U.S. flared that month while broader growth momentum in the economy faltered. Industrial profits dropped 5.5% from a year earlier in October, the biggest decline since June, the National Bureau of Statistics data showed, reversing the double-digit growth seen in August and September. For the first ten months of the year, profits at major industrial firms grew 1.9% from a year ago, the official data showed, decelerating from a 3.2% rise in the January to September period.   Trade tensions between China and the U.S. had escalated that month over export controls, with U.S. President Donald Trump threatening additional 100% tariffs on imports from China, before the two economic superpowers reached a deal in South Korea at the month's end. The mining sector saw profits plunge 27.8% in the January to October period, while profits for the manufacturing and utilities sectors, comprising suppliers for electricity, heat, fuel and water, rose 7.7% and 9.5% respectively.    Profits for carmakers gained 4.4% in the first ten months of the year, compared to a 3.4% climb in the first nine months. Profits at state-owned enterprises were flat, compared with gains of 3.5% for industrial firms with foreign investment, including those with investment from Hong Kong, Macau and Taiwan, and 1.9% for private companies. Yu Weining, chief statistician at NBS, attributed the drop in October to high-base effects from last year and rapid expansion in corporate spending. China's manufacturing activity contracted more than expected in October, with the official manufacturing purchasing managers' index slumping to a six-month low of 49.0. A reading above the 50 benchmark indicates growth, while one below that suggests contraction.Tepid consumer demandwatch nowChina's consumer prices unexpectedly returned to growth in October, rising 0.2% from a year ago, after staying in negative territory for most of the year. Core inflation, stripping out food and energy prices, jumped 1.2%, the highest since February 2024. The reality, however, was less rosy than the core inflation reading suggested, according to Ting Lu, chief China economist at Nomura Bank, who estimated that about a quarter of the 1.2% core inflation readings had \"almost nothing to do with local consumption\" but were mainly caused by surging gold prices.  The \"underestimated decline of rents also contributed to the overstatement of headline inflation data,\" Lu said, suggesting that the country has been mired in a \"moderate recession\" since late 2022.    \"It will take more time for China to truly escape the deflationary conundrum it currently faces, especially as economic growth has stumbled since mid-2025,\" Lu added. Growth faltersThe economy has slowed significantly, expanding just 4.8% in the third quarter, and recent indicators suggest it has lost further momentum at the start of the fourth quarter.  Retail sales grew 2.9% in October, slowing for a fifth straight month and marking the weakest growth in over a year. Fixed-asset investment shrank 1.7% for the first ten months of the year, unseen since 2020 during the pandemic. Industrial output also expanded by a smaller-than-expected 4.9%. Meanwhile, the urban unemployment rate remained elevated at 5.1% in October. Chinese policymakers have signaled a shift towards boosting consumption over the next five years, but have yet to roll out new meaningful stimulus. Economists widely expect Beijing to hold off large-scale stimulus as the economy is on track to hit its growth target of \"around 5%\" this year. \"Policymakers don't want to miss or over-achieve the target,\" said Larry Hu, chief China economist at Macquarie Group, expecting China's economy may continue to grow 5% in 2026 on robust export growth.  That said, \"deflationary pressure\" will likely continue to weigh on the economy as strong external demand reduces the urgency for domestic stimulus, Hu added. \n\t\t\n\t\t\n\t\t\n\t\t\tWeekly analysis and insights from Asia's largest economy in your inbox\n\t\t\tSubscribe now\n\t\t\n\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China industrial profits drop 5.5% in October, worst performance in five months  ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232846-1764201290410-gettyimages-2197358286-ECP_fc1233819.jpeg?v=1764201304&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T03:35:57.000Z",
      "dateModified": "2025-11-27T03:35:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]