[
  {
    "title": "Greenspan, Bernanke, Yellen and other past officials say Trump using 'prosecutorial attacks' to undermine Fed",
    "url": "https://www.cnbc.com/2026/01/12/greenspan-bernanke-yellen-trump-fed.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107132013-1665426592460-ben.jpg?v=1665426669&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T16:03:29.000Z",
    "description": "Former Federal Reserve chairman Ben Bernanke speaks after he was named among three U.S. economists awarded the 2022 Nobel Economics Prize, during a ne",
    "body": "Former Federal Reserve chairman Ben Bernanke speaks after he was named among three U.S. economists awarded the 2022 Nobel Economics Prize, during a news conference at the Brookings Institution in Washington, October 10, 2022.Ken Cedeno | ReutersA chorus of previous Federal Reserve chairs, Treasury secretaries and prominent economists came together Monday to support Jerome Powell as the central bank leader faces potential perjury allegations from the Justice Department.\"The reported criminal inquiry into Federal Reserve Chair Jay Powell is an unprecedented attempt to use prosecutorial attacks to undermine that independence,\" a statement backed by more than a dozen signatories said. \"This is how monetary policy is made in emerging markets with weak institutions, with highly negative consequences for inflation and the functioning of their economies more broadly,\" it continued. \"It has no place in the United States whose greatest strength is the rule of law, which is at the foundation of our economic success.\"watch nowAmong the signers of the statement were former Fed Chairs Ben Bernanke, Janet Yellen and Alan Greenspan among with former Treasury Secretaries Henry Paulson, Timothy Geithner, Robert Rubin and Jacob Lew. Economists such as Glenn Hubbard, Kenneth Rogoff and Jared Bernstein also signed on.Powell on Sunday confirmed that he'd been notified from the U.S. Attorney's Office in Washington, D.C. that he is the subject of a probe into statements he made to Congress last June. In testimony on Capitol Hill, Powell answered questions regarding the massive renovation project at the central bank's headquarters in the nation's capital.At the time, President Donald Trump and other officials used cost overruns to intensify their criticism of Powell. Trump threatened to fire the Fed chair but backed off. It's not clear that the president would have the authority to remove Powell, with an unrelated case against Fed Governor Lisa Cook set for a hearing before the U.S. Supreme Court next week that also addresses the president's power over the central bank.\"The Federal Reserve's independence and the public's perception of that independence are critical for economic performance, including achieving the goals Congress has set for the Federal Reserve of stable prices, maximum employment, and moderate long-term interest rates,\" the statement said.Jonahtan Kantner, former assistant U.S. attorney general, told CNBC on Monday that the bar for convicting someone in cases like these is \"very high\" particularly if there's a sense that the prosecution is politically motivated. Trump has been a longtime critic of Powell as he has pushed the Fed to lower interest rates. The central bank approved three reductions in 2025.In a statement Sunday, Powell alleged that the accusations are a pretext to remove him from office. If that is established, it would \"set into motion a whole bunch of other legal disputes,\" Kantner said. \"This could get quite messy.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greenspan, Bernanke, Yellen and other past officials say Trump using 'prosecutorial attacks' to undermine Fed",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107132013-1665426592460-ben.jpg?v=1665426669&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T16:03:29.000Z",
      "dateModified": "2026-01-12T16:03:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tech investors assess minerals mining as U.S. takeover talk on Greenland grows, CEO tells CNBC",
    "url": "https://www.cnbc.com/2026/01/12/tech-investors-probe-mining-viability-if-us-acquires-greenland-ceo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108083544-17363407032025-01-07t104832z_1066594217_rc2xn8av1kuq_rtrmadp_0_usa-trump-greenland.jpeg?v=1736340828&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T15:18:13.000Z",
    "description": "Tech investors are sounding out how the U.S. taking Greenland would affect the viability of critical and rare earth minerals mining there, CNBC has le",
    "body": "Tech investors are sounding out how the U.S. taking Greenland would affect the viability of critical and rare earth minerals mining there, CNBC has learned, as Washington ramps up its pursuit of the Arctic island.Greenland has found itself at the center of a geopolitical firestorm over the past week as the U.S. has threatened to annex the self-governing Danish territory, citing national security concerns. Commercial opportunities have also come into the spotlight.In the past week, Critical Metals Corp, a company with a mining project in development on the Arctic island, has fielded questions from tech investors about how the U.S. acquiring Greenland would impact that asset and its development strategy, CEO Tony Sage told CNBC. The NASDAQ-listed company's stock is up 116% since the start of 2026.The project is in the early stages of building a plant to extract heavy rare earth elements (HREE), which can be used to provide heat resistance and magnetic stability in advanced technology ranging from EVs to AI data center infrastructure.Sage said U.S. President Donald Trump's rhetoric about Greenland had generated additional \"buzz\" for the project from investors. Without naming specific shareholders, he said Critical Metals Corp backers included those who invest in Magnificent Seven U.S. tech companies.Last week, the CEO of Amaroq, a mining company with projects in Greenland, told CNBC it was having discussions with U.S. government bodies about potential investment opportunities in the territory.The White House has said it's \"actively\" discussing a potential offer to buy Greenland, though it hasn't ruled out military action to acquire the territory, ahead of planned talks this week between U.S. Secretary of State Marco Rubio and Danish officials. Mining in GreenlandInterest in critical minerals and rare earth mining in Greenland from tech investors has picked up in the past year. In January 2025, Trump reasserted his desire to acquire the territory — a massive, strategically-placed island with a population of just 57,000 — ahead of taking office.Amaroq chief Eldur Ólafsson said the company had seen an increase in attention from investors, including tech investors, over the last 12 months, in an interview with CNBC last week, as geopolitical tensions brought supply chains for critical minerals into focus.In November, the company said that \"commercial levels\" of germanium and gallium, critical minerals that are crucial for building advanced AI chips, were present in a mining project it owns in Greenland. \"When Trump put tariffs on China, the first two metals China stopped exporting were germanium and gallium,\" Ólafsson told CNBC. \"Why? Because you need it in AI, you need it in defense, you need it in tech, it's absolutely critical.\"watch nowChina's export ban on several rare earth minerals in 2025 highlighted to tech investors the challenge of the country's dominance in the space, said Critical Metals Corp's Sage. \"The heavy rare earths, which include Yttrium, Gadolinium, Terbium, Dysprosium, Holmium, Erbium, Thulium, Ytterbium, Lutetium, and Gallium are the minerals that generate the most interest,\" he told CNBC. \"These are the materials that are essential for defence technologies, robotics, semiconductors and aerospace applications. We can't fly rockets into space, build nuclear submarines or next-generation fighter jets without these materials.\"Sage added that Critical Metals Corp had \"strong relationships\" with the governments of both Greenland and the U.S. and did not expect its plans to change.The company's stock surged 62% in a day in October after Reuters reported the U.S. Government was considering buying a stake. It shed the gains to finish 2025 up 2% for the year.Others are more skeptical about whether Greenland's critical and rare earth minerals can significantly reduce the West's dependence on China, which produced 70% of rare earths in 2024, according to Statista. \"Getting rare earths from exploration to the mighty magnet involves five to six distinct stages — and right now, what's in Greenland is still only in the exploration stage,\" Tracy Hughes, founder and executive director at industry group the Critical Minerals Institute, told CNBC.\"Rare earths in Greenland won't materially move markets in the next decade,\" she added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tech investors assess minerals mining as U.S. takeover talk on Greenland grows, CEO tells CNBC",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108083544-17363407032025-01-07t104832z_1066594217_rc2xn8av1kuq_rtrmadp_0_usa-trump-greenland.jpeg?v=1736340828&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T15:18:13.000Z",
      "dateModified": "2026-01-12T15:18:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What a U.S. intervention in Iran could look like as Trump weighs options",
    "url": "https://www.cnbc.com/2026/01/12/iran-trump-military-intervention-strikes-venezuela-islamic-protests.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250926-1768176463058-gettyimages-2255173378-710a2861.jpeg?v=1768176479&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T06:44:05.000Z",
    "description": "LONDON, ENGLAND - JANUARY 11: People take part in a rally in solidarity with protesters in Iran on January 11, 2026 in London, England. Alishia Abodun",
    "body": "LONDON, ENGLAND - JANUARY 11: People take part in a rally in solidarity with protesters in Iran on January 11, 2026 in London, England. Alishia Abodunde | Getty Images News | Getty ImagesU.S. President Donald Trump is readying for a likely intervention in Iran, as the country cracks down on protestors, with several hundreds reportedly killed and internet access cut off.   The possible next steps could include boosting antigovernment sources online, deploying cyber weapons against the Iranian military and civilian sites, placing more sanctions on the regime as well as military strikes, The Wall Street Journal reported. Trump's aides are set to brief him on Tuesday on a possible intervention.The options being presented to Trump range from targeted strikes inside Iran to offensive cyber attacks, Politico also reported, citing an unnamed official familiar with the ongoing development. \"If the U.S. decides it needs to act to protect personnel or assets, or to protect energy flows, then it has a range of tools, from cyber and sabotage, to drones and missile strikes from air and sea,\" said Matt Gertken, chief geopolitical strategist at BCA Research.  The U.S. could also attack nuclear or military infrastructure or government facilities to reduce the regime's abilities and \"deter the regime from disruptive actions,\" Gertken added.  The unrest in Iran, which started in late December over soaring prices and the collapse of Iran's currency, has intensified and morphed into wider antigovernment protests that threaten the Islamic regime. Tehran has over the weekend stepped up action against protestors, with more the 500 people killed,  according to U.S.-based Human Rights Activists News Agency. Iran has warned the U.S. and Israel against any intervention, with President Masoud Pezeshkian on Sunday, blaming them for fueling the unrest. \"Iran is far more capable of retaliating against the U.S., especially by attacking regional energy infrastructure,\" Gertken said, adding that the Trump administration was \"not necessarily eager to destroy the regime\" unless it deteriorates \"so significantly that the U.S. finds it cannot pass up the opportunity to intervene to force a change of regime.\" Trump takes aim Trump's administration's playbook often \"changes day by day,\" but his threats still carry weight as Iran has long been on his agenda and the unrest swells into the \"deepest and most widespread protest\" in years that the regime does not have under control, Dan Yergin, vice chairman at S&P Global, told CNBC's \"Access Middle East.\"  Trump has openly backed Iranian protestors and telegraphed his interest in intervening several times on his Truth Social platform, saying that the U.S. would come to the \"rescue\" of Iranians if the authorities there continued to kill protesters. \"Iran is looking at FREEDOM, perhaps like never before. The USA stands ready to help!!!\" Trump said in a social media post Saturday. \"We're looking at it very seriously. The military is looking at it, and we're looking at some very strong options,\" Trump told reporters Sunday on Air Force One as he returned to Washington from his Mar-a-Lago home in Florida. \"We'll make a determination.\" The dilemma is at its peak: a strong strike could potentially undermine the regime's repression efforts, but at the same time it might lead to greater cohesion within the regime and a broader escalation.Danny CitrinowiczSenior Researcher, Institute for National Security StudiesTrump is also considering non-kinetic measures including cyber and covert action, according to Politico, noting the U.S. President was not expected to send American forces into the country and there has been no major movement of U.S. military assets. The U.S. is looking at restoring internet communications in Iran as its leaders have cut off internet and phone services in the country. \"We may get the internet going, if that's possible,\" Trump told reporters. \"We may speak to Elon Musk. I'm going to call him as soon as I'm finished with you.\" Iran has reportedly jammed Musk's Starlink during the latest protests. Even if the U.S. administration considers a \"symbolic\" kinetic strike, it could trigger a \"much broader escalation,\" said Danny Citrinowicz, a senior researcher at the Institute for National Security Studies.  \"The dilemma is at its peak: a strong strike could potentially undermine the regime's repression efforts, but at the same time it might lead to greater cohesion within the regime and a broader escalation,\" Citrinowicz said. \"Given the absence of leadership in the opposition, such a strike may achieve an operational success but not a strategic one,\" he added. Mohammad Baqer Qalibaf, Iranian Parliament speaker, warned during a session broadcast live by state television that Israel and \"all American military centers, bases and ships in the region will be our legitimate targets\" if the U.S. attacks Iran. Iran's Supreme Leader Ayatollah Ali Khamenei said last Friday that Iran's government will \"not back down\" amid the protests. The unrest comes as the Islamic republic has been increasingly vulnerable with leaders facing mounting internal and domestic strains and a population growing angrier over a deepening economic crisis. Its official currency rial has lost half of its value over the past year, plunging to record-lows of about 1 million rials per U.S. dollar, according to LSEG data. \"These protests, whatever the outcome, will further damage an already fractured legitimacy for a state system that is at the end of its life,\" said Sanam Vakil, director of Middle East and North Africa program at Chatham House. — CNBC's Dan Murphy contributed to this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What a U.S. intervention in Iran could look like as Trump weighs options",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250926-1768176463058-gettyimages-2255173378-710a2861.jpeg?v=1768176479&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T06:44:05.000Z",
      "dateModified": "2026-01-12T06:44:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Inside GM's new world headquarters: Modernized midcentury designs with artifacts, surprises from the American icon ",
    "url": "https://www.cnbc.com/2026/01/11/gm-hq-detroit-artifacts-company-history.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250740-1767989464225-1_lighted_General_Motors_corporate_logo_shines_from_the_Hudsons_Detroit_building.jpg?v=1767991996&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-11T09:00:01.000Z",
    "description": "A 1963 Chevrolet K20 pickup truck and a new Chevrolet Silverado EV sit outside General Motors' new world headquarters on Jan. 6, 2026 in Detroit.Micha",
    "body": "A 1963 Chevrolet K20 pickup truck and a new Chevrolet Silverado EV sit outside General Motors' new world headquarters on Jan. 6, 2026 in Detroit.Michael Wayland | CNBCDETROIT – Outside General Motors' new world headquarters, between the 12-story building and the city's first new skyscraper in more than 30 years, sit two red Chevrolet pickup trucks. One is a 1963 Chevrolet K20. The other is a new Silverado EV. The trucks, while part of a temporary holiday display, are symbolic of what's inside the new global offices for the Detroit automaker: its past and present, woven together.GM is occupying four of six office floors of the building and has filled them with artifacts, design nods and \"Easter eggs\" tied to the Detroit automaker's history. They range from a blueprint of GM's iconic design dome and an early map of its nearby proving grounds to an interior wallpaper of 300 patented technologies and a decorative wall of cassette tapes with songs featuring the automaker's brands as well playful references to executive stalwarts such as CEO Mary Barra and President Mark Reuss.One of the centerpiece objects of GM's new headquarters is the McCormick Speed Form, an aerodynamic wind-tunnel model developed at the Warren Technical Center.Courtesy: GM\"Leadership asked when we were helping design the space to bring in some Easter eggs and details to represent who we are at GM, you know, honoring our culture and our history and our innovation,\" Rebecca Waldmeir, GM industrial design architecture and experience manager, told CNBC during a tour of the new headquarters.Other surprises include references to relevant Detroit streets, design influences from GM's famed design campus in suburban Detroit and artwork and sculptures of its products.Aside from the aesthetics, GM officials say the new offices will assist with collaboration and are more relevant to how the company expects its employees to work in a post-pandemic world. It will house executive offices and other corporate functions such as marketing, legal and finance.\"A headquarters really should be, at some level, a beacon for the culture of the company,\" said David Massaron, GM vice president of infrastructure and corporate citizenship. \"When you come in here, it should help people understand who we want to be.\"A wall inside GM's new Detroit headquarters includes cassette tape cases featuring songs referencing the automaker's brands and vehicles as well as custom ones featuring GM executives such as CEO Mary Barra and President Mark Reuss.Michael Wayland | CNBCFrom fortress to functionalityThe new headquarters marks a significant square-foot reduction for the automaker's corporate office — from a towering complex called the Renaissance Center along the city's riverfront to just four floors, roughly 200,000 square feet, in the new building.GM's new HQ is less than a mile from the RenCen, as it's commonly called, which has been a symbol for the city since, ironically, Ford Motor built the complex but decided not to make it its headquarters in the 1970s. GM purchased the building in 1996 as its third headquarters, all of which have been in the Motor City.The RenCen is Detroit's fortress, a 5.6-million-square-foot complex complete with a more-than-700-foot center tower surrounded by four 500-foot towers and two smaller adjacent ones. GM's new headquarters at the Hudson's Detroit development in the city's downtown.Courtesy: GMThe complex is infamously difficult to get in and out of and to navigate. For much of its existence, it was surrounded by concrete barriers before a redesign around the turn of the millennium. It has long been something of a physical permutation of GM's historically siloed culture, which Barra has made a priority to change during her roughly 11-year tenure as CEO.\"The RenCen was designed in a different era, in a pre-Covid era where everybody went to work five days a week, everybody went to their desk,\" Massaron said. \"Particularly, in a post-pandemic world, you need office space that people want to come to, because we have options.\"GM's roughly 50,000 U.S. salaried employees are currently required to work in-office Tuesday through Thursday, but the rules are more flexible than before regarding location and remote working. The Renaissance Center (complex of skyscrapers with the Chrevrolet sign) by the Detroit River.Roberto Machado Noa | Lightrocket | Getty ImagesMost of the company's new executive offices on the top floor of the building will be open for executives to use as they please, Massaron said. Only four of the offices will be permanently assigned to top GM executives, such as Barra and Reuss, he said.GM declined to disclose how many employees are expected to regularly work at the new headquarters, saying foot traffic will fluctuate based on priorities and workflows. The company also declined to disclose financial details of its 15-year lease at the new headquarters.The building complex, known as Hudson's Detroit, is owned by a real estate company of Rocket Companies chairman and billionaire Dan Gilbert, who has been purchasing and renovating properties in Detroit for more than a decade.Showroom, pickleball Aside from the office areas and the executive floor, which all overlook an open atrium, GM also plans to open a semi-public space to display products and host events on the first floor of the building. Other amenities include social gathering areas and lounges, food and beverage services and a pickleball court and recreation area. A common area outside of the executive offices of GM's new headquarters in downtown Detroit.Michael Wayland | CNBCGM's new headquarters, which remains under construction, comes months after Ford christened a new 2.1-million-square-foot global HQ and product design and development center in nearby Dearborn, Michigan.Ford's new facility includes offices, design and industrial operations and a host of amenities such as a 160,000-square-foot dining area with eight \"kitchen concepts,\" multiple courtyards and other upgrades.The notable difference in the size between GM's and Ford's new headquarters comes down to location, headcount and the automakers' portfolios of offices and operations throughout the region.A pickleball court and seating area inside the building that includes GM's new headquarters in Detroit.Michael Wayland | CNBCGM, for example, has a vast technology and design center that occupies 710 acres in nearby Warren, Michigan. That campus houses more than 24,000 employees. Massaron said GM didn't feel it needed to create \"a city within a city\" for its new headquarters, because it's actually \"a building within a city.\"Here's a look inside GM's new world headquarters:The entry of the executive floor inside GM's new global headquarters in Detroit.Michael Wayland | CNBCThe executive hallway of GM's new headquarters in Detroit.Courtesy: GMOne of a dozen or so executive offices inside GM's new headquarters in downtown Detroit.Michael Wayland | CNBCOne of a dozen or so executive offices inside GM's new headquarters in downtown Detroit.Michael Wayland | CNBCThe interior design draws inspiration from Eero Saarinen’s iconic GM Global Technical Center, incorporating golden\nmetallic finishes, wood feature walls, warm recessed lighting and a blend of clean linear geometries with subtle\ncurves.Courtesy: GMPatent wall graphics highlight 300 of more than 49,000\npatents granted since the company’s founding in 1911.Courtesy: GMA wall of cassette tapes celebrates GM’s broad cultural impact, nodding to the more than 78,000 songs that\nreference GM brands and vehicles.Courtesy: GMA model of the Chevrolet Corvette CX concept hangs on the wall outside the executive boardroom of GM's new headquarters.Courtesy: GMThe executive boardroom inside GM's new headquarters in Detroit.Courtesy: GMInside the common atrium area of GM's new global headquarters in Detroit.Michael Wayland | CNBCA coffee shop and cafe inside the atrium area of GM's new global headquarters in Detroit.Michael Wayland | CNBCA common lounge area near the atrium of the building that houses GM's new headquarters in Detroit.Michael Wayland | CNBCThree-dimensional sound-wave art profiles feature engine and EV tones from notable GM vehicles across\nperformance, EV and ICE categories, transforming acoustic engineering into sculptural expression.Courtesy: GMA statue of GM's \"Cadillac Goddess\" sits on a table inside the executive floor of its new headquarters in Detroit.Michael Wayland | CNBC",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inside GM's new world headquarters: Modernized midcentury designs with artifacts, surprises from the American icon ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250740-1767989464225-1_lighted_General_Motors_corporate_logo_shines_from_the_Hudsons_Detroit_building.jpg?v=1767991996&w=1920&h=1080"
      ],
      "datePublished": "2026-01-11T09:00:01.000Z",
      "dateModified": "2026-01-11T09:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paramount Skydance sues Warner Bros. Discovery in hostile takeover attempt",
    "url": "https://www.cnbc.com/2026/01/12/paramount-skydance-warner-bros-discovery-suit.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238518-1765220921385-108238518-17652208212025-12-08t155407z_15273980_rc2dcia5ox8f_rtrmadp_0_warner-bros-dis-m-a-paramount-skydan.jpg?v=1766425555&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T15:21:58.000Z",
    "description": "David Ellison, CEO of Paramount Skydance, exits following an interview at the New York Stock Exchange, Dec. 8, 2025.Brendan Mcdermid | ReutersParamoun",
    "body": "David Ellison, CEO of Paramount Skydance, exits following an interview at the New York Stock Exchange, Dec. 8, 2025.Brendan Mcdermid | ReutersParamount Skydance is suing Warner Bros. Discovery and CEO David Zaslav as its latest step in a hostile pursuit to acquire WBD, CEO David Ellison outlined in a letter to WBD shareholders on Monday. The lawsuit asks a Delaware court to direct Warner Bros. Discovery to provide information about its sale process and pending deal with Netflix. \"WBD has failed to include any disclosure about how it valued the Global Networks stub equity, how it valued the overall Netflix transaction, how the purchase price reduction for debt works in the Netflix transaction, or even what the basis is for its 'risk adjustment' of our $30 per share all-cash offer,\" Ellison said in the letter on Monday. \"We filed suit this morning in Delaware Chancery Court to ask the court to simply direct WBD to provide this information so that WBD shareholders have what they need to be able to make an informed decision as to whether to tender their shares into our offer,\" Ellison said. Ellison also informed WBD shareholders on Monday that Paramount intends to nominate directors for election to WBD's board at the company's 2026 annual meeting, in a move that would add a proxy fight to the equation. Paramount's latest escalation comes days after WBD's board once again recommended that shareholders reject Paramount's amended offer, which was made in late December. The company has repeatedly said its offer is superior to the company's deal with Netflix and has previously argued that the sale process was unfairly skewed. A WBD spokesman didn't immediately respond to request for comment Monday. Warner Bros. Discovery last month agreed to sell its streaming and studio business to Netflix for $72 billion. The proposed deal was the result of a sale process in which Paramount was bidding for all of WBD's assets, including its portfolio of cable TV channels, known as Discovery Global. As part of the Netflix deal Warner Bros. Discovery plans to separate Discovery Global into its own publicly traded entity. Soon after WBD reached a deal with Netflix, Paramount went public with its hostile bid. Paramount has offered $30 per share, all cash for all of Warner Bros. Discovery's assets. WBD's board told shareholders in December to reject the initial offer in favor of the Netflix deal, citing concerns about the backing of Ellison's father, billionaire Larry Ellison. Paramount responded with an amended offer in which the Oracle co-founder agreed not to revoke the family trust or adversely transfer its assets during a pending transaction. Paramount has stopped short of increasing the size of its bid, however. The newly merger Paramount Skydance first took interest in Warner Bros. Discovery in the fall, making three unsolicited offers that were each rejected. Warner Bros. Discovery then opened up a sale process seeking offers for some or all of its company. At the same time, Warner Bros. Discovery said it would carry on with a plan that was announced earlier in the year to split its company into two publicly traded entities — Warner Bros., consisting of the streaming platform HBO Max and film studio, and Discovery Global, comprised of the pay TV networks like TNT and CNN. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paramount Skydance sues Warner Bros. Discovery in hostile takeover attempt",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238518-1765220921385-108238518-17652208212025-12-08t155407z_15273980_rc2dcia5ox8f_rtrmadp_0_warner-bros-dis-m-a-paramount-skydan.jpg?v=1766425555&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T15:21:58.000Z",
      "dateModified": "2026-01-12T15:21:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What the Big Oil executives told Trump about investing in Venezuela",
    "url": "https://www.cnbc.com/2026/01/10/what-the-big-oil-executives-told-trump-about-investing-in-venezuela.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250797-1767993431085-gettyimages-2255449568-aw1a3909_ixnjfdqj.jpeg?v=1768220417&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-10T12:59:40.000Z",
    "description": "watch nowLeading U.S. oil executives told President Donald Trump at the White House on Friday that Venezuela will need major reforms to attract invest",
    "body": "watch nowLeading U.S. oil executives told President Donald Trump at the White House on Friday that Venezuela will need major reforms to attract investment. Trump said Friday the industry would invest at least $100 billion to rebuild Venezuela's energy sector with U.S. security guarantees. But the CEOs of big oil companies like ExxonMobil and ConocoPhillips did not commit at the meeting to quickly re-enter Venezuela. Exxon CEO Darren Woods told Trump that the Venezuelan market is \"uninvestable\" in its current state. Venezuela seized Exxon's and Conoco's assets in 2007, and Caracas owes the companies billions of dollars in outstanding claims from arbitration cases.\"We've had our assets seized there twice, and so you can imagine to re-enter a third time would require some pretty significant changes from what we've historically seen here,\" Woods told Trump at the White House. \"If we look at the legal and commercial constructs and frameworks in place today in Venezuela today, it's uninvestable.\" Exxon is prepared to send a technical team to evaluate the current state of Venezuela's oil industry and assets, Woods said. ConocoPhillips CEO Ryan Lance congratulated Trump on ousting former President Nicolás Maduro. He said the banking sector will need to help restructure Venezuela's debt and provide billions of dollars in financing for the restore the country's infrastructure. Lance also called for the restructuring of state-owned oil company Petróleos de Venezuela (PDVSA).\"As we think that big and bold, we need to be also thinking about even restructuring the entire Venezuelan energy system including PDVSA,\" Lance told the president. Trump told the Conoco CEO that the U.S. government is not looking at recovering the assets the company lost during the 2007 nationalization. \"We're not going to look at what people lost in the past, because that was their fault,\" Trump said. \"That was a different president. You're going to make a lot of money, but we're not going to go back.\"Chevron is the only U.S. oil major operating in Venezuela through joint ventures with PDVSA. Vice Chairman Mark Nelson said Chevron has a way forward to rapidly ramp up its production, which currently stands at about 240,000 barrels per day. \"We have a path forward here very shortly to be able to increase our liftings from those joint ventures 100% essentially effective immediately,\" Nelson told Trump. \"We are also able to increase our production within our own disciplined investment schemes by about 50% just in the next 18 to 24 months.\"Treasury Secretary Scott Bessent indicated Thursday that the U.S. might rely more on smaller oil companies, rather than the majors, to invest in Venezuela. \"The big oil companies who move slowly, who have corporate boards, are not interested,\" Bessent said Thursday at the Economic Club of Minnesota. \"I can tell you that the independent oil companies and individuals, wildcatters – our phones are ringing off the hook,\" Bessent said. \"They want to get to Venezuela yesterday.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What the Big Oil executives told Trump about investing in Venezuela",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250797-1767993431085-gettyimages-2255449568-aw1a3909_ixnjfdqj.jpeg?v=1768220417&w=1920&h=1080"
      ],
      "datePublished": "2026-01-10T12:59:40.000Z",
      "dateModified": "2026-01-10T12:59:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Capital One drops 7%, other banks hit after Trump calls for credit card rate cap",
    "url": "https://www.cnbc.com/2026/01/12/trump-credit-card-limit-banks-jpmorgan-citi.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108251054-1768220028983-gettyimages-2233929081-McGregor250908NYCbusinesses03.jpeg?v=1768220098&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T15:49:13.000Z",
    "description": "Sign at the entrance to a Capital One Bank branch in Manhattan. Erik Mcgregor | Lightrocket | Getty ImagesBanks and financial services stocks slid Mon",
    "body": "Sign at the entrance to a Capital One Bank branch in Manhattan. Erik Mcgregor | Lightrocket | Getty ImagesBanks and financial services stocks slid Monday after U.S. President Donald Trump called for a 10%, one-year cap on credit card interest rates. Capital One shares dropped 7% in early trading and Synchrony Financial tumbled 8%. Credit cards account for a large share of both banks' business models. Other banks that are more diversified saw smaller losses. Citigroup lost almost 4%, JPMorgan Chase shed 2% and Bank of America fell 1%. Visa and Mastercard, credit card processors that don't put any of their capital at risk, were down 2% each. Other financial services names were caught in the downdraft. American Express slumped 5%, while Wells Fargo and Morgan Stanley declined about 1%. The proposed cap would come into force on Jan. 20, according to a post on Truth Social on Friday, though Trump didn't provide details on how it would work. \"Effective January 20, 2026, I, as President of the United States, am calling for a one year cap on Credit Card Interest Rates of 10%,\" Trump wrote, echoing a pledge he made in the 2024 presidential campaign. \"Please be informed that we will no longer let the American Public be 'ripped off' by Credit Card Companies,\" he added.A cap would require approval from Congress. There has long been interest in curbing fees, and bipartisan bills to cap credit card interest rates at 10% have previously been introduced, highlighting potential appetite for the move.When asked about his post, Trump said Sunday to reporters that if banks don't limit rates they would be \"in violation of the law.\"Critics said over the weekend that Trump's plan, if enacted, would cause banks to pull back on lending, causing many consumers to lose access to credit and dampening personal spending, which accounts for roughly two-thirds of all economic activity.Bank industry insiders say the White House proposal would have unintended consequences for consumers and the American economy.The move would make large swaths of the credit card industry unprofitable, especially tied to customers with less-than-ideal credit profiles, according to banks and analysts. Rather than offer unprofitable products to consumers, the industry would simply stop offering access to customers with subprime credit, and make other changes in card programs, including scaling back rewards, insiders say.Consumers would either spend less or rely on other forms of unsecured debt, they say.Buy-now-pay-later stocks were higher in early trading on the notion more consumers would be forced to use those lenders if banks pulled back on extending credit, but soon gave back those gains after the market formally opened.Affirm Holdings slid more than 6% after rallying in premarket trading, and PayPal fell about 1%.— CNBC's Hugh Son contributed reporting ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Capital One drops 7%, other banks hit after Trump calls for credit card rate cap",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108251054-1768220028983-gettyimages-2233929081-McGregor250908NYCbusinesses03.jpeg?v=1768220098&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T15:49:13.000Z",
      "dateModified": "2026-01-12T15:49:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gold smashes new record of $4,600 as Powell probe and global flashpoints ignite safe-haven rush",
    "url": "https://www.cnbc.com/2026/01/12/gold-record-haven-powell-venezuela-iran.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108234177-1764563718395-gettyimages-2240539484-AUSTRALIA_GOLD.jpeg?v=1767720612&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T08:41:24.000Z",
    "description": "One kilogram gold bars stacked at the Perth Mint Refinery, operated by Gold Corp.Matt Jelonek | Bloomberg | Getty ImagesGold hit a fresh record high o",
    "body": "One kilogram gold bars stacked at the Perth Mint Refinery, operated by Gold Corp.Matt Jelonek | Bloomberg | Getty ImagesGold hit a fresh record high on Monday, extending a blistering rally as investors piled into havens amid a swirl of geopolitical and policy shocks in recent days.Spot gold advanced 2% to hit over $4,600 an ounce for the first time, before paring gains slightly, data from LSEG showed. Prices have risen around 6% this year alone so far.An investigation into Federal Reserve Chairman Jerome Powell and speculation over whether it could hasten a leadership change at the Fed has added a fresh layer of policy risk: \"Especially if it results in him stepping down and then leaving the Fed earlier than scheduled and is replaced by someone more in favor of rate cuts,\" said Morningstar equity analyst Jon Mills.Federal prosecutors are examining a $2.5 billion renovation of the Fed's Washington headquarters and Powell's testimony to Congress, Powell said Sunday night. The Fed Chair added that the investigation stems from President Donald Trump's long-running frustration with the Fed's reluctance to cut interest rates as aggressively or as quickly as he has urged.The scenario that the appointment of a new Fed Chair may pave the way for faster interest-rate cuts, is traditionally supportive for gold. Lower interest rates tend to lift gold by reducing the opportunity cost of holding a metal that pays no yield. That effect has been amplified by recent U.S. economic data that pointed to a cooling labor market. Latest flashpoints involving Iran and Venezuela also further catalyzed gold's appeal as a safe haven.Tensions with Iran have resurfaced after Washington signaled it is weighing options to respond to unrest in the country. The U.S. also launched a military operation in Venezuela at the start of the year that saw the capture of the country's president Nicolas Maduro last weekend.\"They all add to the narrative of heightened geopolitical uncertainty that led us to pick gold as one of highest conviction asset classes this year,\" said Rajat Bhattacharya, senior investment strategist at Standard Chartered.While the U.S. action in Venezuela has appeared to reach a relatively swift resolution, the episode still highlights the persistence of geopolitical uncertainty and the risk of flare-ups across multiple regions, Bank of Singapore's Eli Lee similarly echoed.watch nowIn such an environment, Lee expects gold prices to see further support amid an ongoing backdrop of geopolitical unpredictability. Beyond geopolitics, the structural case for gold remains intact, the bank added, as investors reassess portfolio allocations following years of sanctions, geopolitical fragmentation and fiscal-monetary complexity. HSBC said trading momentum could carry prices to $5,000 an ounce in the first half of 2026, even as volatility remains elevated and pullbacks may become more frequent.The London-headquartered bank attributed the rally to a combination of safe-haven demand, a weaker U.S. dollar and policy uncertainty, noting that its FX strategists expect the greenback to remain soft in 2026. \"Mounting fiscal deficits in the U.S. and other nations are encouraging gold demand and may be a key factor going forward,\" the bank said.Central banks are also expected to remain strong buyers this year as they diversify away from the dollar, although HSBC cautioned that purchases may fall below the peaks seen between 2022 and 2024 due to high prices.Gold prices saw a nearly 65% yearly gain in 2025, the highest in decades.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gold smashes new record of $4,600 as Powell probe and global flashpoints ignite safe-haven rush",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108234177-1764563718395-gettyimages-2240539484-AUSTRALIA_GOLD.jpeg?v=1767720612&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T08:41:24.000Z",
      "dateModified": "2026-01-12T08:41:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boeing's airplane deliveries are the highest in 7 years. Now it's about to pick up the pace",
    "url": "https://www.cnbc.com/2026/01/11/boeing-plane-deliveries-production-pace.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250215-1767906239901-gettyimages-2249102626-BOEING_737_MAX.jpeg?v=1767906284&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-11T12:00:01.000Z",
    "description": "A Boeing Co. 737 Max airplane at the company's manufacturing facility in Renton, Washington, US, on Thursday, Nov. 20, 2025. David Ryder | Bloomberg |",
    "body": "A Boeing Co. 737 Max airplane at the company's manufacturing facility in Renton, Washington, US, on Thursday, Nov. 20, 2025. David Ryder | Bloomberg | Getty ImagesBoeing is set to report this week that it delivered the most airplanes since 2018 last year after it stabilized its production, the clearest sign of a turnaround yet after years of safety crises and snowballing quality defects. Now, the aerospace giant is planning to ramp up production.\"It's a long road back from a ... shall we say, a rather dysfunctional culture, but they're making big progress,\" said Richard Aboulafia, managing director at AeroDynamic Advisory, an aerospace industry consulting firm.Boeing was forced to scale back production in recent years following two fatal crashes of its popular 737 Max aircraft in 2018 and 2019 and a midair blowout of a door plug from one of its planes in the first week of 2024. The Covid pandemic snarled airplane assembly at both Boeing and its chief rival, Airbus, with supply chain delays and loss of experienced workers, even after the worst of the health crisis subsided.A Boeing 737 approaches San Diego International for a landing, May 10, 2025.Kevin Carter | Getty ImagesBoeing's leaders, including CEO Kelly Ortberg — a longtime aerospace executive who came out of retirement to take the top job months after the midair door plug accident — are gearing up to increase production this year of its cash cow 737 Max aircraft and the longer-range 787 Dreamliners.That could help the manufacturer, the top U.S. exporter by value, return to profitability, as analysts expect this year, territory that was out of reach for seven years as its leaders focused on damage control and were stuck reassuring frustrated airline executives who were awaiting late planes.Their tone has changed as Boeing has become more predictable and increased production, with the Federal Aviation Administration's blessing. In a sign of the FAA's increased confidence in Boeing, the agency in September said Boeing could issue its own air worthiness certificates before customers receive some of its 737s and 787s after years of restrictions.Boeing's commercial aircraft business is its largest unit, accounting for about 46% of sales in the first nine months of last year, with the rest coming from its defense and services business. Boeing last reported a full-year profit in 2018.Investors are optimistic for further improvement. Boeing shares have gained 36% over the last 12 months, outpacing the S&P 500's nearly 20% advance. \"Boeing is definitely better and more stable,\" said Bob Jordan, CEO of all-Boeing airline Southwest Airlines, in an interview Dec. 10. The company is scheduled to outline its production plans for 2026 later this month when it reports quarterly results on Jan. 27.Getting into gearFor Boeing, the recent turnaround has taken place largely on the assembly floor. Under Ortberg, the manufacturer has slashed so-called traveled work, in which assembly tasks are done out of order, to avoid costly mistakes. The company has made other manufacturing changes, as well, including added training.The National Transportation Safety Board in June said inadequate training and management oversight had been among the problems at the company, according to its investigation into what led to the door plug blowout in January 2024.On Dec. 8, Boeing also completed its acquisition of fuselage maker Spirit AeroSystems, which Boeing had spun out of the company two decades ago. It now has more direct control of the crucial supplier.Moving out jetsBoeing handed over 537 aircraft in the first 11 months of last year. It reports December deliveries on Tuesday, but Jefferies estimates the company delivered 61 commercial jets last month, 44 of them Boeing's bestseller, the 737 Max.Boeing delivered 348 aircraft in 2024 and 528 in 2023. Last year's total would still be far off the 806 airplanes it handed over in 2018.Last October, the FAA raised its production cap on Boeing's 737 Max from 38 a month to 42. (The FAA required its sign-off after the door plug accident.) CFO Jay Malave said at a UBS conference on Dec. 2 that he expects the company to get to that rate in early 2026. Ortberg told investors in October that further rate increases are on the table, in increments of five planes.Kelly Ortberg, chief executive officer of Boeing Co., during a media event at the Boeing Delivery Center in Seattle, Washington, US, on Wednesday, Jan. 7, 2026. M. Scott Brauer | Bloomberg | Getty ImagesHandovers to airlines in 2026 will likely be new production, compared with clearing out older inventory, Malave had said. Boeing is also likely to produce about eight Dreamliners a month as of early this year, he added.Deliveries are key for airplane makers, because airlines and other customers pay the bulk of an airplane's price when they receive the aircraft. Boeing's chief competitor, Airbus, is scheduled to report 2025 orders and deliveries on Monday.Still, several planes that were expected to already flying passengers aren't certified yet, including the Boeing 777X as well as the Max 7 and Max 10 variants, depriving Boeing of cash and driving up costs.Southwest is awaiting the delayed Max 7, the smallest plane of the Max family. The model is important for airline routes that have lower demand so airlines can avoid oversupplying the market with seats, pushing down fares.Southwest CEO Jordan last month said that he doesn't expect the airline to fly the Max 7 before the first half of 2027 as Boeing certification work continues. Boeing at one point expected it to enter service in 2019.\"They're still very short in terms of delivering the aircraft that we need, but I'm glad to see the progress on the Max 7,\" Jordan told CNBC. watch nowRobust demandOrders for both Boeing and Airbus jets look solid, with demand set to continue outstripping supply into the next decade, Bernstein aerospace analyst Douglas Harned said in a note last week.Airbus outpaced Boeing in deliveries last year, though Boeing appears to have outsold its European competitor in new orders.Through November, Boeing logged 1,000 gross orders compared with 797 from Airbus. Airline customers have started to look beyond this decade, snagging delivery slots into the mid-2030s as they plot out growth and international expansions.On Wednesday, Alaska Airlines said it is ordering 105 Boeing 737 Max 10 jets, the longest aircraft of the Max group. Alaska fleet chief Shane Jones told CNBC the order is a sign of \"our confidence in the Max 10 certification\" as well as \"our confidence in Boeing and their turnaround and their ability to produce quality aircraft on time.\"  Alaska also exercised options for five 787 Dreamliners for more international routes just over a year after it acquired Hawaiian Airlines — a combination that handed Alaska more Dreamliners and Airbus A330s to reach for destinations that it couldn't get to before, like Japan, South Korea and Italy.The wide-body aircraft market is now picking up steam, said Ron Epstein, aerospace analyst at Bank of America, with orders starting to get handed over faster to customers. Read more CNBC airline newsBoeing's deliveries are highest in 7 years. It's about to pick up the paceWhy airline class wars will intensify in 2026American Airlines no longer lets basic economy flyers earn milesArchitect of Delta's premium strategy to retire in FebruaryFrontier Airlines replaces longtime CEO Barry Biffle with carrier's presidentInternational travel, especially at the high end, has been particularly strong in the years after the pandemic as travelers splash out on vacations around the world. More and more global airlines are looking at snagging long-haul jets like Boeing's Dreamliner and Airbus' A330 and A350s for the coming years, heating up the wide-body airplane market, analysts said.Globally, airplanes flew nearly 84% full in November, the highest level on record, according to the latest data available from the International Air Transport Association, an airline industry group.With travel demand still robust, orders to replace older jets and secure new ones will continue to fuel growth.\"The magic, if you will, of air transportation is until somebody comes up with a transporter, you know, [like] 'Star Trek,' where you sort of vaporize and show up someplace else, we're going to be flying,\" Epstein said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boeing's airplane deliveries are the highest in 7 years. Now it's about to pick up the pace",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250215-1767906239901-gettyimages-2249102626-BOEING_737_MAX.jpeg?v=1767906284&w=1920&h=1080"
      ],
      "datePublished": "2026-01-11T12:00:01.000Z",
      "dateModified": "2026-01-11T12:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cold applying is still the No. 1 way to get a new job, but this method is quickly getting more common",
    "url": "https://www.cnbc.com/2026/01/12/cold-applying-is-still-the-no-1-way-to-get-a-new-job-but-this-method-is-quickly-getting-more-common.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108011836-1721923662443-gettyimages-1492169466-dscf1233.jpeg?v=1767932795&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T13:37:55.000Z",
    "description": "Job scams, thousands of applicants, getting ghosted by recruiters (if you hear from them at all): There are endless and completely valid reasons why p",
    "body": "Job scams, thousands of applicants, getting ghosted by recruiters (if you hear from them at all): There are endless and completely valid reasons why people are tired of applying to jobs online.But like it or not, it's still the No. 1 way to land a job interview and offer, according to new Glassdoor data.Online applications accounted for 60% of all job offers reported on Glassdoor in 2025 and accounted for twice as many interviews and 1.5 times as many offers than other sources, including referrals, being recruited and other methods.But they're also losing their edge: That share is down from a high in 2023 when cold applications led to 73% of all job offers.Meanwhile, the share of people being recruited into roles is climbing. The proportion of recruiter-sourced candidates increased 72% since 2023 to nearly 15% last year, per Glassdoor data.And though fewer people are being referred into new roles, those who choose this job-searching route have a higher rate of success: Interviews stemming from a referral were 35% more likely to result in a job offer than those starting with an online application, and referrals made up about 10% of job offers between July 2024 and July 2025.Cold applying could have even less of a pull in 2026, says HR and recruiting expert J.T. O'Donnell.\"I think you're going to just see a huge shift away from public job posting because it's become so broken\" with people mass applying and overwhelming recruiters, O'Donnell tells CNBC Make It. She predicts the upcoming year's data will involve \"fewer people getting jobs from applying online, and a lot more being contacted proactively by recruiters, because we're seeing a very big switch into quiet hiring this year.\"Here are her best tips for striking the right job opportunities no matter which route you take.Get recruiters to notice youActive recruitment into roles could see a boost thanks to new AI tools that make it easier for hiring teams to \"control the candidate flow\" and \"surface candidates that they've never been able to surface before,\" O'Donnell says.So how do you get on a recruiter's radar? Build out your personal brand online, she says.Choose an online social platform and be consistent when talking about your work, perspective and skills. \"If a recruiter wants to find you, they need to know that you have industry experience and you have skill set experience,\" she says.If you're using LinkedIn, O'Donnell says she's found that five types of content formats do well:Industry observations: What's going on in the news of your field?Hot takes: Do you have a contrarian view of what's happening in your industry?Then vs. now: How has your work changed over time, say, in the last five years?Listicles: Can you break down your thoughts, your process or your learnings on a subject in few key takeaways?Storytelling: Talk a bit about yourself as an employee. For example, can you answer a behavioral question often asked in job interviews, like how you problem-solved a difficult situation at work?\"You are literally creating a space where recruiters can find you and contact you, and that's how you start getting interviews in this market,\" O'Donnell says.Ask for the right referralsWhether you're approaching people for informational interviews or want a referral to a specific opening at their company, \"think carefully about who you're asking to introduce you,\" O'Donnell says. People might be more willing to refer you to roles that aren't in their own department she says, especially as people are worried about their own security and job hugging.Research has also shown that \"weak ties,\" like friends of friends, are more likely than direct contacts to help you land a new job.As for how to ask for a referral, \"give them the valid business reasons why you're impressed by the company and that you're looking to earn an interview,\" O'Donnell says. Be specific in explaining why you want the job, why you're qualified and why you're hoping they'll introduce you.Best tips for cold applying onlineO'Donnell's No. 1 tip for applying to a job online is to be first. Set alerts for your target job titles, functions and companies to be within the first 20 to 40 people to apply, she says.If you see a job being reposted, consider the window to apply closed, she says. This often happens because a company has paid the platform to repost an opening in advance based on their contract, not because the role is actually vacant and being hired for. \"It's very likely it just got reposted automatically, or if they did, they've already made the decision on you, and you can't go back and apply again,\" O'Donnell says.Otherwise, in addition to being first, make sure your application is complete. Plenty of people rush to fill out job forms without being thorough and accurate, which can \"easily get you disqualified,\" O'Donnell says.Finally, make sure your online presence, like your LinkedIn profile or professional website, is up to date. As recruiters deal with spam applicants and fake resumes on their side, they're using your online footprint to prove you're real, credible and actually a fit for the role, she says.Want to get ahead at work with AI? Sign up for CNBC's new online course, Beyond the Basics: How to Use AI to Supercharge Your Work. Learn advanced AI skills like building custom GPTs and using AI agents to boost your productivity today. Use coupon code EARLYBIRD for 25% off. Offer valid from Jan. 5 to Jan. 19, 2026. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cold applying is still the No. 1 way to get a new job, but this method is quickly getting more common",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108011836-1721923662443-gettyimages-1492169466-dscf1233.jpeg?v=1767932795&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T13:37:55.000Z",
      "dateModified": "2026-01-12T13:37:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump seeks to stop courts, creditors from seizing Venezuelan oil revenue in the U.S.",
    "url": "https://www.cnbc.com/2026/01/10/trump-venezuela-oil-revenue.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250829-1767997853861-gettyimages-2255451655-aw1a4398_rkpfxvhq.jpeg?v=1767997903&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-10T20:32:41.000Z",
    "description": "U.S. President Donald Trump takes questions from members of the media during a meeting with oil and gas executives in the East Room of the White House",
    "body": "U.S. President Donald Trump takes questions from members of the media during a meeting with oil and gas executives in the East Room of the White House on Jan. 9, 2026 in Washington, DC. Alex Wong | Getty ImagesU.S. President Donald Trump on Friday signed an executive order that aims to block the seizure of Venezuelan oil revenue held in U.S. Treasury accounts.The executive order states that the revenue, which is held in foreign government deposit funds, are \"held solely for sovereign purposes\" and that any court attempt to seize the funds will \"materially harm the national security and foreign policy\" of the U.S. The order, which declared a national emergency, said the funds are the sovereign property of Venezuela held in U.S. custody for governmental and diplomatic means, and are not assets subject to private claims. Any use of judicial process against the funds will interfere with efforts to \"ensure economic and political stability in Venezuela,\" the order says.Trump signed the order nearly one week after U.S. military forces captured Venezuelan leader Nicolás Maduro and his wife, Cilia Flores, in Caracas. Both were indicted on drug-trafficking charges and have pleaded not guilty. Since the military operation, Trump has said that both nations \"are working well together\" on rebuilding Venezuela's oil and gas infrastructure and that American oil giants will invest at least $100 billion in the South American country.Trump met with major oil industry executives on Friday afternoon in an effort to get U.S. oil companies to invest in Venezuela. In that meeting, ExxonMobil CEO Darren Woods told Trump that right now Venezuela is \"uninvestable.\"ConocoPhillips and ExxonMobil exited Venezuela after its government, under President Hugo Chávez, nationalized the country's oil sector along with several other key industries. Both companies have filed arbitration cases against Venezuela seeking billions of dollars in compensation for assets that were expropriated by the government.Chevron is the only major U.S. oil company currently operating in Venezuela through a special license issued by the Trump administration.In his Friday order, Trump cited the 1977 International Emergency Economic Powers Act and the 1976 National Emergencies Act as legal justification for safeguarding Venezuelan oil revenue in U.S. accounts. The White House did not immediately respond to a CNBC request for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump seeks to stop courts, creditors from seizing Venezuelan oil revenue in the U.S.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250829-1767997853861-gettyimages-2255451655-aw1a4398_rkpfxvhq.jpeg?v=1767997903&w=1920&h=1080"
      ],
      "datePublished": "2026-01-10T20:32:41.000Z",
      "dateModified": "2026-01-10T20:32:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump threatens to sideline Exxon from Venezuela's oil: 'They're playing too cute’",
    "url": "https://www.cnbc.com/2026/01/12/oil-trump-venezuela-exxon-mobil-darren-woods.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108251071-1768220660480-gettyimages-2255277403-President_Trump_Spends_Weekend_At_Mar-a-Lago_In_Palm_Beach_Florida.jpeg?v=1768230562&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T15:52:31.000Z",
    "description": "Darren Woods, chairman and chief executive officer Exxon Mobil Corp., during a meeting with oil executives in the East Room of the White House in Wash",
    "body": "Darren Woods, chairman and chief executive officer Exxon Mobil Corp., during a meeting with oil executives in the East Room of the White House in Washington, DC, US, on Friday, Jan. 9, 2026.Bloomberg | Bloomberg | Getty ImagesU.S. President Donald Trump threatened to sideline Exxon Mobil from Venezuela's energy market, saying he didn't like their response to his calls for oil companies to quickly reenter the South American country.\"I didn't like Exxon's response. You know we have so many that want it. I'd probably be inclined to keep Exxon out,\" Trump told reporters onboard Air Force One on Sunday. \"They're playing too cute,\" he added. His comments come shortly after Exxon CEO Darren Woods made headlines for saying at a White House meeting with Trump that the Venezuelan market is \"uninvestable\" in its current state. An Exxon spokesperson did not immediately respond to a request for comment. Shares of Exxon were down less than 1% in morning trading Monday.Speaking alongside several other American oil executives on Friday, Woods said Exxon would need to see \"some pretty significant changes\" if it was to reenter the country for a third time. Venezuela seized Exxon's and ConocoPhillips' assets in 2007, and Caracas owes the companies billions of dollars in outstanding claims from arbitration cases. Read moreWoods said the company would need to see changes to commercial frameworks, the legal system and hydrocarbon laws, alongside what he described as \"durable\" investment protections.\"We're confident that with this administration and President Trump working hand‑in‑hand with the Venezuelan government that those changes can be put in place,\" Woods said.He added that Exxon was prepared to send a technical team to evaluate the current state of Venezuela's oil industry and assets.$100 billion pushTrump has been pushing for U.S. oil companies to invest at least $100 billion in Venezuela's energy sector, pledging to support them with government security assistance.The call follows an audacious U.S. military operation in Venezuela on Jan. 3 to depose Venezuelan President Nicolas Maduro and his wife, Cilia Flores. U.S. President Donald Trump takes questions from the members of the press aboard Air Force One on January 11, 2026 en route back to the White House from Palm Beach, Florida.Samuel Corum | Getty Images News | Getty ImagesAsked by a reporter for clarity on the type of backstops and security guarantees that would be provided to oil companies, Trump did not provide specific details. \"We are going to have guarantees,\" Trump said. \"They had problems in the past because they didn't have Trump as a president,\" he added. U.S. oil firms acknowledged that Venezuela, which boasts the world's largest oil reserves, represents an intriguing opportunity but some have expressed caution about rushing to reenter.Chevron is currently the only major American oil firm still operating in Venezuela.— CNBC's Spencer Kimball contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump threatens to sideline Exxon from Venezuela's oil: 'They're playing too cute’",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108251071-1768220660480-gettyimages-2255277403-President_Trump_Spends_Weekend_At_Mar-a-Lago_In_Palm_Beach_Florida.jpeg?v=1768230562&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T15:52:31.000Z",
      "dateModified": "2026-01-12T15:52:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Republican Sen. Thom Tillis vows to block Trump's Fed nominees following Powell probe",
    "url": "https://www.cnbc.com/2026/01/12/republican-sen-thom-tillis-vows-to-block-trumps-fed-nominees-following-powell-probe.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240122-1765396115359-gettyimages-2251230236-_s019460_pmineffu.jpeg?v=1765396925&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T15:30:03.000Z",
    "description": "Federal Reserve Chair Jerome Powell speaks during a press conference following the Federal Open Markets Committee meeting at the Federal Reserve on De",
    "body": "Federal Reserve Chair Jerome Powell speaks during a press conference following the Federal Open Markets Committee meeting at the Federal Reserve on December 10, 2025 in Washington, DC. Chip Somodevilla | Getty Images News | Getty ImagesPresident Donald Trump will face an important obstacle — from within his own party — as he seeks to replace Federal Reserve Chair Jerome Powell.Sen. Thom Tillis, R-N.C., said Sunday he will block any Trump appointees to the central bank, including for the new chair, in light of revelations over the weekend that the Justice Department is investigating Powell for potential perjury charges.\"If there were any remaining doubt whether advisers within the Trump Administration are actively pushing to end the independence of the Federal Reserve, there should now be none. It is now the independence and credibility of the Department of Justice that are in question,\" Tillis said in a statement.\"I will oppose the confirmation of any nominee for the Fed — including the upcoming Fed Chair vacancy — until this legal matter is fully resolved,\" he added.That position substantially complicates the road to replacing Powell, whose term as chair expires in May. The banking committee, of which Tillis is a member, has 13 Republicans and 11 Democrats, so even one defection sets up a stalemate.Tillis usually supports Trump but occasionally has broken with the president. For instance, he was one of just two GOP senators to vote against the \"one big beautiful bill\" spending package last year.Powell's position isn't the only one at stake.Stephen Miran's term as governor ends in January, and there has been chatter about potential retirements, particularly Vice Chair Philip Jefferson.However, news that the office of U.S. Attorney Jeanine Pirro, a Trump confidant and former Fox News host, is investigating Powell for perjury clouds the situation. Powell on Sunday released a statement acknowledging the investigation and alleging it is a pretext for giving Trump power over the Fed.\"No one, certainly not the chair of the Federal Reserve, is above the law, but this unprecedented action should be seen in the broader context of the administration's threats and ongoing pressure,\" Powell said.Tillis isn't the only banking panel member to criticize Trump over the move.Sen. Elizabeth Warren, D-Mass., who once called Powell \"a dangerous man\" and opposed his reappointment, accused Trump of wanting a \"sock puppet\" to lead the Fed and do his bidding by lowering interest rates.\"Trump is abusing the authorities of the Department of Justice like a wannabe dictator so the Fed serves his interests, along with his billionaire friends. This Committee and the Senate should not move forward with any Trump nominee for the Fed, including Fed Chair,\" Warren said in a statement.While Powell's term as chair ends in May, he can stay on as governor until 2028. He has not indicated yet whether he will do so.The White House has been conducting an extensive search for the new chair, with the candidate field whittled down to five. Trump has indicated he will put forth a nominee this month.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Republican Sen. Thom Tillis vows to block Trump's Fed nominees following Powell probe",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240122-1765396115359-gettyimages-2251230236-_s019460_pmineffu.jpeg?v=1765396925&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T15:30:03.000Z",
      "dateModified": "2026-01-12T15:30:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Walmart teams up with Google's Gemini to make it easier for shoppers to find and buy products",
    "url": "https://www.cnbc.com/2026/01/11/walmart-partners-with-google-gemini-on-shopping-tool.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229495-1763673071760-gettyimages-2247687115-jr_12925_4e6vzwin.jpeg?v=1763673473&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-11T15:42:17.000Z",
    "description": "A Walmart sign hangs on the exterior of the store on Nov. 20, 2025 in Hollywood, Florida. Joe Raedle | Getty ImagesWalmart and Google said Sunday that",
    "body": "A Walmart sign hangs on the exterior of the store on Nov. 20, 2025 in Hollywood, Florida. Joe Raedle | Getty ImagesWalmart and Google said Sunday that shoppers will soon be able to use Google's artificial intelligence assistant Gemini to more easily discover and buy products from the retail giant and its warehouse club, Sam's Club.Incoming Walmart CEO John Furner and Google CEO Sundar Pichai announced that the companies have teamed up on stage at the National Retail Federation's Big Show, an annual industry conference held at New York City's Javits Center. The CEOs did not say when the new feature will launch or share financial terms. The company said the experience will start first in the U.S. and then expand internationally.With the Google deal, Walmart is boosting its effort to keep up with customers who are using AI chatbots to save time or look for inspiration. Walmart announced a deal with a rival to Gemini, OpenAI's ChatGPT, in October to allow shoppers to make purchases with \"Instant Checkout,\" a feature that allows them to buy an item without leaving the AI chatbot. OpenAI recently launched that feature with Walmart and it has Instant Checkout deals with other retailers, including Etsy and several Shopify merchants like Skims, Vuori and Spanx.Walmart also has its own AI chatbot, a yellow smiley-faced assistant on its app called Sparky.\"The transition from traditional web or app search to agent-led commerce represents the next great evolution in retail,\" Furner said in a news release. \"We aren't just watching the shift, we are driving it.\"In his remarks on stage, Furner, who will step into Walmart's top role on Feb. 1, said Walmart is \"rewriting the retail playbook\" and, with AI, it's \"trying to close the gap between I want it and I have it.\"Pichai said that Google is excited to work with Walmart and described the adoption of AI as a \"transformative\" moment.For Walmart, the evolution of customers' shopping habits — such as searches that start in an AI chatbot rather than its own app or website — is reshaping the retailer's digital strategy. In a statement, David Guggina, Walmart U.S.'s chief ecommerce officer, said agentic AI \"helps us meet customers earlier in their shopping journey and in more places.\" \"Over time, these agents will make it easier for customers to find what they need, want and love,\" he said.Walmart leaders have also been vocal about how AI will change the workforce and employees' roles, comments that carry additional weight as the company is the largest private employer in the U.S.Walmart CEO Doug McMillon, who is retiring and will be succeeded by Furner, has spoken about the sweeping impact of the technology, saying that \"it's very clear that AI is going to change literally every job.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Walmart teams up with Google's Gemini to make it easier for shoppers to find and buy products",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229495-1763673071760-gettyimages-2247687115-jr_12925_4e6vzwin.jpeg?v=1763673473&w=1920&h=1080"
      ],
      "datePublished": "2026-01-11T15:42:17.000Z",
      "dateModified": "2026-01-11T15:42:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yellen says Powell probe 'extremely chilling' for Fed independence, market should be concerned",
    "url": "https://www.cnbc.com/2026/01/12/yellen-says-powell-probe-extremely-chilling-for-fed-independence-market-should-be-concerned.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108039653-1768232024445-108039653-1727360940312-untitled-2-2.jpg?v=1768232055&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T15:58:42.000Z",
    "description": "watch nowFormer Federal Reserve Chair Janet Yellen on Monday condemned an investigation into her successor, Jerome Powell, saying it compromises the c",
    "body": "watch nowFormer Federal Reserve Chair Janet Yellen on Monday condemned an investigation into her successor, Jerome Powell, saying it compromises the central bank's independence.Yellen, who served as Treasury secretary after leaving the Fed, added that she thinks financial markets should be more concerned about a situation that she called \"extremely chilling.\"\"I'm surprised the market isn't more concerned. It seems to me that the market should be concerned,\" Yellen said, according to CNBC's Sara Eisen.The comments come the day after Powell confirmed he'd been made aware that the U.S. Attorney's Office in Washington, D.C., is looking into whether the central bank leader lied during testimony he provided to Congress last June about an expensive renovation project at the Fed's headquarters. The office is led by Jeanine Pirro, a Trump confidante and former Fox News host. The Justice Department has not officially confirmed the investigation into what would be perjury charges.Yellen bristled at the notion that Powell might have lied.\"Knowing Powell as well as I do, the odds that he would have lied are zero so I do believe they're going after him because they want his seat and want him gone,\" she said.Treasury Secretary Janet Yellen speaks with CNBC from the New York Federal Reserve on Sept. 26th, 2024.David A. Grogan | CNBCYellen served during the first year of Trump's initial term as president but was replaced the following year by Powell after her term ended. She went on to serve under former President Joe Biden as the head of Treasury, the first woman to hold either position.During her time at Treasury, critics charged Yellen used the levers of debt issuance to underwrite a ballooning national debt. Trump has badgered the Fed to lower rates, in part to ease financing costs of a debt burden currently at $38.4 trillion.Yellen said using the Fed's key overnight borrowing rate to manage the debt is irresponsible.\"You have a president that says the fed should be cutting rates to lower rate payments on the federal debt,\" Yellen said, adding she \"completely [disagrees] with that. It is the road to banana republic.\"Other former Fed and Treasury officials joined the chorus against the Powell investigation.\"The reported criminal inquiry into Federal Reserve Chair Jay Powell is an unprecedented attempt to use prosecutorial attacks to undermine that independence,\" the officials said in a statement. Signatories included former Fed Chairs Ben Bernanke and Alan Greenspan, former Treasury Secretaries Timothy Geithner and Henry Paulson, and a number of prominent economists.\"This is how monetary policy is made in emerging markets with weak institutions, with highly negative consequences for inflation and the functioning of their economies more broadly. It has no place in the United States whose greatest strength is the rule of law, which is at the foundation of our economic success,\" the statement said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yellen says Powell probe 'extremely chilling' for Fed independence, market should be concerned",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108039653-1768232024445-108039653-1727360940312-untitled-2-2.jpg?v=1768232055&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T15:58:42.000Z",
      "dateModified": "2026-01-12T15:58:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]