[
  {
    "title": "Home Depot lays off 800 workers, says corporate employees will return to office 5 days a week",
    "url": "https://www.cnbc.com/2026/01/28/home-depot-layoffs-return-to-office.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108227646-1763490449034-gettyimages-2247325991-dji_20251118092100_0976_d_pnjiyag3.jpeg?v=1769642073&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-28T23:39:57.000Z",
    "description": "A Home Depot logo is displayed at one of their stores in San Diego, Nov. 8, 2025.Kevin Carter | Getty Images News | Getty ImagesHome Depot on Wednesda",
    "body": "A Home Depot logo is displayed at one of their stores in San Diego, Nov. 8, 2025.Kevin Carter | Getty Images News | Getty ImagesHome Depot on Wednesday laid off 800 workers and said corporate employees will have to return to the office five days per week.In a message to employees, CEO Ted Decker said the changes are intended to increase the company's \"speed and agility.\"\"To extend our industry-leading position, we must position the company to move faster and stay even more closely connected to our customers and frontline associates,\" he wrote in the memo.A corporate spokesperson confirmed that the company is cutting 800 roles. About 150 of the employees were based at Home Depot's headquarters in Atlanta and the rest were in remote jobs, with most in the technology organization of the company and some on other corporate teams, she said.In the employee memo, Decker said the five-day in-office policy will begin the week of April 6. He said the changes are \"essential to simplify our business and focus our energy on the priorities ahead.\"\"In-person engagement enables more meaningful support for store and field associates, drives results and reinforces our people-centric culture and inverted pyramid,\" he said.Home Depot's sales have been weaker than expected, as the retail giant waits for housing turnover and significant home improvement spending to pick up again after a boom in demand during the Covid pandemic. Company leaders have attributed slower demand to higher mortgage rates, economic uncertainty and consumers' hesitance to spring for pricier projects.The retailer missed Wall Street's earnings expectations for the third straight quarter when it posted results in November. It said that it expects full-year fiscal 2025 sales to rise about 3% and comparable sales, which take out the impact of one-time factors like store openings and calendar differences, to be slightly positive.Shares of Home Depot have fallen about 10% over the past year, trailing the S&P 500's 15% gains over the same period. So far this year, Home Depot's stock is up about 9%, however, ahead of the S&P 500's nearly 2% gains.Home Depot will report its fiscal fourth-quarter earnings on Feb. 24.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Home Depot lays off 800 workers, says corporate employees will return to office 5 days a week",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108227646-1763490449034-gettyimages-2247325991-dji_20251118092100_0976_d_pnjiyag3.jpeg?v=1769642073&w=1920&h=1080"
      ],
      "datePublished": "2026-01-28T23:39:57.000Z",
      "dateModified": "2026-01-28T23:39:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "IBM jumps 8% on earnings beat",
    "url": "https://www.cnbc.com/2026/01/28/ibm-earnings-q4-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108094473-17381853142025-01-22t112733z_951578715_rc2yecalvcw1_rtrmadp_0_davos-meeting.jpeg?v=1738189844&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-28T22:40:49.000Z",
    "description": "Chairman, President and CEO of IBM Arvind Krishna attends the 55th annual World Economic Forum meeting in Davos, Switzerland, on Jan. 22, 2025.Yves He",
    "body": "Chairman, President and CEO of IBM Arvind Krishna attends the 55th annual World Economic Forum meeting in Davos, Switzerland, on Jan. 22, 2025.Yves Herman | ReutersIBM reported better-than-expected fourth-quarter results on Wednesday and issued a forecast that slightly topped estimates. Here how the company did compared to LSEG consensus estimates:Earnings per share: $4.52 adjusted vs. $4.32 expectedRevenue: $19.69 billion vs. $19.23 billion expected.Revenue rose 12% during the period from $17.6 billion a year earlier. Net income increased to $5.6 billion, or $5.88 per share, from $2.92 billion, or $3.09 per share, in the year-ago period. IBM said it expects full-year revenue growth to exceed 5%, decelerating from 8% last year. Analysts expect sales growth of 4.6% in 2026, according to LSEG. Free cash flow should increase by $1 billion after reaching $14.7 billion in 2025, the company said.  CEO Arvind Krishna said in a release that the company's generative artificial intelligence book of business hit more than $12.5 billion.\"This capped a strong 2025 for IBM where we exceeded expectations for revenue, profit and free cash flow,\" Krishna wrote. He also said the company is on pace to deliver its first large scale quantum computer by 2029 during an earnings call with analysts.IBM said software revenue rose 14% to $9 billion in fourth quarter, benefitting from automation, data and  Red Hat products. Infrastructure sales increased 21% to $5.1 billion, with 67% year-over-year growth in its IBM Z Systems line of mainframe computers.The company's board of directors approved a per-share dividend of $1.68, payable on March 10. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "IBM jumps 8% on earnings beat",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108094473-17381853142025-01-22t112733z_951578715_rc2yecalvcw1_rtrmadp_0_davos-meeting.jpeg?v=1738189844&w=1920&h=1080"
      ],
      "datePublished": "2026-01-28T22:40:49.000Z",
      "dateModified": "2026-01-28T22:40:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Comcast posts mixed quarter as broadband pressures weigh on business",
    "url": "https://www.cnbc.com/2026/01/29/comcast-cmcsa-earnings-q4-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207296-1759453014582-gettyimages-1229306222-_RMN2023.jpeg?v=1769686473&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T12:21:36.000Z",
    "description": "UNIVERSAL STUDIOS, ORLANDO, FLORIDA, UNITED STATES - 2019/07/18: Comcast sign logo in the wall of a building at Universal Studios. (Photo by Roberto M",
    "body": "UNIVERSAL STUDIOS, ORLANDO, FLORIDA, UNITED STATES - 2019/07/18: Comcast sign logo in the wall of a building at Universal Studios. (Photo by Roberto Machado Noa/LightRocket via Getty Images)Roberto Machado Noa | Lightrocket | Getty ImagesComcast posted mixed results for its fourth quarter on Thursday, beating analyst expectations on earnings but slightly missing on revenue. Once again, Comcast's broadband business showed signs of significant competition facing cable companies. Comcast said it lost 181,000 domestic broadband customers during the period, although said the losses were offset by an increase in international subscribers. The company's mobile offering remained a bright spot, notching 364,000 additions during the period and bringing its total to more than 9.3 million mobile customers for Comcast's newest business. Last year, Comcast said it was shifting its strategy to focus more on growing its mobile business after facing continued pressure in broadband, mainly due to competition from wireless providers like Verizon and T-Mobile. Here's how Comcast performed in the period ended Dec. 31 compared with average analyst estimates, according to LSEG: Earnings per share: 84 cents adjusted vs. 75 cents expectedRevenue: $32.31 billion vs. $32.35 billion expected Net income attributable to Comcast decreased 54.6% to $2.17 billion, or 60 cents per share, compared with $4.78 billion, or $1.24 per share a year earlier. Adjusting for certain one-time items — like the value of intangible assets, charges associated with investments, and prior-year tax benefits that Comcast said made for an \"unfavorable comparison\" — the company reported adjusted net income of $3.06 billion, or 84 cents per share. Comcast's adjusted earnings before interest, taxes, depreciation and amortization was down 10% to $7.9 billion. The company's overall quarterly revenue was up more than 1% to $32.31 billion. Revenue for Comcast's connectivity and platforms unit – which includes its Xfinity-branded services across broadband, pay TV and mobile – was down 1% to $20.24 billion. In particular, revenue was down 1% for the domestic broadband unit to roughly $6.32 billion. While this reflected the decrease in broadband customers, it was partially offset by higher average rates, Comcast said. In addition to the broadband customer losses and mobile additions, Comcast lost 245,000 pay TV customers during the fourth quarter. The company now has 11.27 million total pay TV customers. Meanwhile, revenue for the company's media unit, which includes NBCUniversal, rose 5.5% to $7.62 billion. This marks the final quarter that NBCUniversal's earnings report includes its full portfolio of cable networks, as Comcast spun out most of its pay TV networks, including CNBC and MS Now, into the publicly traded entity, Versant. Domestic advertising revenue for the media business was up 1.5% due to the addition of the NBA on NBC, which helped propel overall revenue.  NBC's streaming service, Peacock, added 3 million paid customers after three quarters of essentially no change. It ended the year with 44 million paid subscribers. The streaming service reported losses of $552 million for the fourth quarter, deeper than the $372 million in losses it recorded in the prior year period.Those losses were due in part to the impact of the NBA rights deal, which began during the quarter. Peacock saw $1.6 billion in revenue compared to $1.3 billion the year-ago quarter.Comcast's Universal film studio revenue was down 7.4% to $3.03 billion due to a drop in licensing and theatrical revenue when compared with the prior-year quarter. The releases of \"Wicked: For Good\" and \"Black Phone 2\" fell short of last year's \"Wicked\" and \"The Bad Robot.\"Universal theme parks revenue, however, was up 22% to roughly $2.9 billion, driven by last year's opening of Epic Universe.Disclosure: Versant Media is the parent company of CNBC. Comcast was the parent company of CNBC through the fourth quarter of 2025. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Comcast posts mixed quarter as broadband pressures weigh on business",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207296-1759453014582-gettyimages-1229306222-_RMN2023.jpeg?v=1769686473&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T12:21:36.000Z",
      "dateModified": "2026-01-29T12:21:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China and the UK are attempting to reset their relationship — here's how",
    "url": "https://www.cnbc.com/2026/01/29/china-uk-starmer-xi-relations-visit-businesses-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108258704-1769647951089-gettyimages-2258043536-AFP_94AL7BZ.jpeg?v=1769655988&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T11:23:13.000Z",
    "description": "Britain's Prime Minister Keir Starmer addresses a business delegation following his arrival to China, at a hotel in Beijing on January 28, 2026.  Carl",
    "body": "Britain's Prime Minister Keir Starmer addresses a business delegation following his arrival to China, at a hotel in Beijing on January 28, 2026.  Carl Court | Afp | Getty ImagesAfter years of strained ties, China and the U.K. are looking to develop a long-term strategic partnership following a high-stakes meeting between Chinese President Xi Jinping and British Prime Minister Keir Starmer. Starmer is on a 4-day visit to China, the first trip by a British prime minister in eight years — signaling an attempt at resetting relations between the two countries after years of distrust and acrimony.   Beijing's crackdowns on democratic protests in Hong Kong, a former British colony, and imposition of a sweeping national security legislation in 2020 strained bilateral ties, while U.K. businesses in China have flagged a challenging business climate in the country.  The U.K. has often accused China of conducting espionage in the country, and labeled it as a long-term strategic challenge. Financial Times reported on Tuesday that British officials were planning to tighten scrutiny of Chinese activity over national security concerns. The British government as recently as December moved to clamp down on two tech companies based in China, allegedly for carrying out cyberattacks that it said had undermined U.K. security and prosperity. Against that backdrop, Thursday's developments signal a positive shift in relations. The two countries said they will expand cooperation in key areas including education, healthcare, finance and artificial intelligence research, biological sciences and new energy development, according to a statement published by Chinese state media on Thursday. Beijing will also consider opening visa-free entry for British nationals, the statement said, while urging London to create a fair and non-discriminatory environment for Chinese firms operating in the U.K. Starmer told Xi at the start of the meeting that it was \"vital that we build a more sophisticated relationship\" allowing both sides to identify areas for further collaborations and dialogue, according to Reuters. London will maintain high-level close communications with Beijing and deepen trade and investment partnerships, according to the Chinese readout. Speaking to reporters following the summit with Xi, Starmer described the meeting as \"positive\" and one that delivered \"productive outcome,\" adding that the relationship was in a \"good, strong place,\" Reuters reported. Turning to China?   Starmer's trip comes at a time when U.S. President Donald Trump's foreign policy and tariff threats have unsettled traditional allies, while Beijing has hosted several Western leaders just this month including Canadian Prime Minister Mark Carney, Ireland's Prime Minister Michael Martin — the first visit by an Irish leader in 14 years — and Finnish Prime Minister Petteri Orpo.  Xi told Starmer that \"unilateralism, protectionism and power politics have been rampant, severely impacting the international order.\" Xi also urged major economic powers to \"take the lead\" in implementing international laws, \"otherwise they will regress to a jungle-like world.\" That's according to a CNBC translation of the Chinese statement. Starmer's diplomatic shift appears to mirror that of Canada which signed a trade agreement with China earlier this month following a visit by Carney, as Ottawa appears to diversify trade and investment partners amid persistent frictions with Washington.   On Wednesday, Starmer called on dozens of British business leaders traveling with him to seize opportunities in the world's second largest economy. The U.K. government said in its statement Wednesday that it would pursue a \"strategic and consistent relationship\" with Beijing, seeking to bolster new investment and trade relations while remaining vigilant about potential security threats. Last week, the U.K. government approved plans to open a sprawling Chinese Embassy in London, after the proposal had stalled for years over political and security concerns.   The positive developments come as U.K. businesses in China have been battling a deteriorating business environment for the past six consecutive years, according to the British Chamber of Commerce in China. Nearly 60% of the more than 300 British firms surveyed said doing business in the country was harder than it was a year ago, the body said in a report in December. \"Overall business landscape remains complex and often unpredictable,\" it said, citing economic slowdown, regulatory pressures and geopolitical risks. But there have not been strong signs of a broad shift toward withdrawing from the Chinese market, the report said, with many firms continuing to view China as a key market, although they appeared to be more cautious with expansion plans. The U.K., like several other countries, faces a skewed trade relationship with Beijing. Its trade deficit with China ballooned by over 18% year on year to 42 billion pounds ($58.1 billion) in the 12 months ending June 2025, according to the U.K. government data.— CNBC's Evelyn Cheng contributed to this report. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China and the UK are attempting to reset their relationship — here's how",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108258704-1769647951089-gettyimages-2258043536-AFP_94AL7BZ.jpeg?v=1769655988&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T11:23:13.000Z",
      "dateModified": "2026-01-29T11:23:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World’s largest sovereign wealth fund posts record $1.4 billion annual return, driven by tech and banking rally",
    "url": "https://www.cnbc.com/2026/01/29/norway-sovereign-wealth-fund-2025-return-nbim-trillion-oil-stocks-tech-ai-banks-silver.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107404948-1713866521437-gettyimages-1236042741-NORWAY_ECON.jpeg?v=1769681036&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T10:16:52.000Z",
    "description": "A view of Oslo seen from the roof of the Oslo Opera House in Oslo, Norway, on Thursday, Oct. 21, 2021.Bloomberg | Bloomberg | Getty ImagesNorway's $2 ",
    "body": "A view of Oslo seen from the roof of the Oslo Opera House in Oslo, Norway, on Thursday, Oct. 21, 2021.Bloomberg | Bloomberg | Getty ImagesNorway's $2 trillion sovereign wealth fund posted a record $1.4 billion return in 2025, its management team said Thursday, thanks to rallying tech, financial and mining stocks. By the end of last year, the fund's total value stood at 21.27 trillion Norwegian kroner ($2.2 trillion). Over the course of 2025, the fund returned 13,456.8 billion kronor, or $1.38 billion — its highest annual return since its inception in the 90s.The overall return was 0.28 percentage points lower than the return on its benchmark index. Equities, which make up about 71% of the fund's investments, returned 19.3% last year. Norges Bank Investment Management (NBIM) manages the fund on behalf of the Norwegian population. Set up in the 1990s to invest excess revenues from Norway's oil and gas industry, the fund is currently an investor in more than 7,000 companies across 60 countries.Its most valuable investments include a 1.3% stake in Nvidia, a 1.2% stake in Apple and a 1.3% stake in Microsoft. \"Stocks in technology, financials and basic materials stood out, making a significant contribution to the overall return\", Nicolai Tangen, NBIM's CEO, said in a statement on Thursday.NBIM's holdings in the basic materials sector include mining giant Fresnillo — the best-performing stock on London's FTSE 100 last year, which surged 452.5% amid a silver boom and its acquisition of Probe Gold.In the financial sector, NBIM holds significant stakes in Bank of America, JPMorgan Chase and Goldman Sachs. The fund also has various holdings in global lenders, including European banking giants Santander, UBS, HSBC and UniCredit. Europe's banking sector has been a source of major returns for investors in recent years.Outside equities, NBIM's fixed income investments returned 5.4% in 2025, while unlisted real estate returned 4.4%. Its renewable energy infrastructure holdings returned 18.1% last year. The fund increased in value by 1.53 trillion kroner — around $159.2 billion — in 2025.This is a developing story. Please refresh for updates. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World’s largest sovereign wealth fund posts record $1.4 billion annual return, driven by tech and banking rally",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107404948-1713866521437-gettyimages-1236042741-NORWAY_ECON.jpeg?v=1769681036&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T10:16:52.000Z",
      "dateModified": "2026-01-29T10:16:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SK Hynix overtakes Samsung in annual profit for the first time as AI reshapes rivalry",
    "url": "https://www.cnbc.com/2026/01/29/sk-hynix-beats-samsung-2025-profit-ai-memory-hbm.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108258730-1769661678815-gettyimages-1953499861-AFP_34GU796.jpeg?v=1769661707&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T07:49:49.000Z",
    "description": "A SK Hynix flag (R) and a South Korean national flag (L) flutter outside the company's Bundang office in Seongnam on Jan. 26, 2024. Jung Yeon-je | Afp",
    "body": "A SK Hynix flag (R) and a South Korean national flag (L) flutter outside the company's Bundang office in Seongnam on Jan. 26, 2024. Jung Yeon-je | Afp | Getty ImagesSK Hynix beat rival Samsung Electronics in operating profit for the first time in 2025, as it retained its lead in high-bandwidth memory used in artificial intelligence chips. The two South Korean memory makers went head-to-head this week, with SK Hynix reporting earnings on Wednesday and Samsung on Thursday morning local time.SK Hynix posted a record operating profit of 47.2 trillion won for the full year, surpassing Samsung's 43.6 trillion won. The comparison underscores SK Hynix's ascension in South Korea's tech space since it was acquired by SK Telecom for about $3 billion in 2012. SK Hynix focuses almost entirely on memory chips, while Samsung operates across multiple businesses, including consumer electronics and contract chip manufacturing. Samsung's memory segment generated operating profits of about 24.9 trillion won in 2025.SK Hynix's success is in large part thanks to its entrenched position as the global leader in high-bandwidth memory, or HBM, a specialized chip used in AI processors and servers such as those produced by Nvidia. \"SK Hynix is clearly an outstanding 'AI Winner' in Asia,\" said MS Hwang, research director at Counterpoint Research, adding that its lead in quality and supply of HBMs and other chips used in AI servers has been crucial in the current phase of the AI infrastructure boom.  SK Hynix has maintained its market lead in both areas, even as Samsung regained the top spot in memory revenue rankings in the fourth quarter of 2025, said Hwang.However, competition is ramping up.  While SK Hynix managed to gain an early lead in HBM and secured the lion's share of Nvidia memory contracts last year, competitors like Samsung and Micron have been making some breakthroughs. Samsung has expanded its HBM sales and said it remains on track to begin delivering HBM4 products — the latest, sixth-generation HBM technology — this year.\"[W]e expect Samsung to show a significant turnaround with HBM4 for Nvidia's new products, moving past last year's quality issues,\" said Ray Wang, an analyst at SemiAnalysis focused on memory and the AI supply chain.  Still, analysts expect SK Hynix to retain high market share in HBM4 and maintain its dominant position.\"⁠⁠The HBM4 race is really between SK Hynix and Samsung as we think [the] two companies are more competitive than Micron,\" said Wang.  \"We expect SK Hynix to maintain its lead in HBM4, while Samsung to make material progress and become more competitive in HBM4 than [previous generations],\" he added.According to a local media report on Wednesday, SK Hynix had secured over two-thirds of HBM supply orders for Nvidia's next-generation Vera Rubin products. In December, Counterpoint estimated that SK Hynix had held a leading 57% revenue share in the HBM market compared to Samsung's 22% in the third quarter of last year. SK Hynix also edged out Samsung in the broader DRAM market. DRAM or Dynamic Random Access Memory, are memory chips used for temporary data storage in computing devices, including PCs, servers and data centers. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SK Hynix overtakes Samsung in annual profit for the first time as AI reshapes rivalry",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108258730-1769661678815-gettyimages-1953499861-AFP_34GU796.jpeg?v=1769661707&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T07:49:49.000Z",
      "dateModified": "2026-01-29T07:49:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Starbucks to unveil long-term outlook at investor day, as Niccol says turnaround is just beginning",
    "url": "https://www.cnbc.com/2026/01/29/starbucks-investor-day-updates-brian-niccol-turnaround.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257930-1769552835068-gettyimages-2257971728-STARBUCKS_EARNS.jpeg?v=1769552887&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T12:06:46.000Z",
    "description": "watch nowStarbucks is expected to release a long-term forecast and share more details about how it plans to hit those financial targets at an investor",
    "body": "watch nowStarbucks is expected to release a long-term forecast and share more details about how it plans to hit those financial targets at an investor presentation held in New York City on Thursday.When Starbucks suspended its outlook in October 2024, its long-term forecast projected global same-store sales would grow at least 5%, revenue would climb at least 10% and earnings per share would rise at least 15%. Shares of Starbucks have fallen roughly 5% over the last year, dragging its market value down to about $108 billion. In addition to the company's  challenges, investors are concerned about the broader pullback in consumer spending and higher coffee prices.The investor day comes a day after the company released its fiscal first-quarter earnings report. Customers enter a Starbucks coffee shop in San Francisco, California, US, on Tuesday, Jan. 27, 2026. David Paul Morris | Bloomberg | Getty ImagesFor the first time in two years, the coffee chain's traffic rose, fueling same-store sales growth of 4%. The company has made progress on some of its goals, like making every drink in under four minutes, CEO Brian Niccol said on CNBC's \"Squawk Box\" on Thursday morning.\"This is really just the beginning,\" Niccol said of the company's turnaround.Menu changes like protein cold foam have helped Starbucks draw both loyal and infrequent customers, he  told CNBC's Andrew Ross Sorkin. Ahead, the company has more menu innovation on deck, plus changes to its rewards program and an improved digital experience, he added.But while Starbucks' turnaround strategy is bearing fruit on the top line, investments in its restaurants and labor weighed on profits during its fiscal first quarter. The company's quarterly earnings per share missed Wall Street's estimates.Executives on Wednesday also shared the company's first annual forecast since Niccol suspended its outlook more than a year ago, shortly after taking the helm at Starbucks. For fiscal 2026, Starbucks is projecting adjusted earnings per share in a range of $2.15 to $2.40 and global and U.S. same-store sales growth of at least 3%.Under Niccol's leadership, the company has been trying to get \"back to Starbucks,\" after years of prioritizing mobile orders and profits at the expense of the customer and employee experience. Small touches have included bringing back seating to its cafes, requiring baristas to write messages on cups again and trimming its menu. Bigger swings, like revamping cafes to be cozier and staffing more baristas, are dragging down earnings, but executives expect that margins will eventually recover.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Starbucks to unveil long-term outlook at investor day, as Niccol says turnaround is just beginning",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257930-1769552835068-gettyimages-2257971728-STARBUCKS_EARNS.jpeg?v=1769552887&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T12:06:46.000Z",
      "dateModified": "2026-01-29T12:06:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SAP shares see biggest drop since 2020 after fourth-quarter cloud contract growth disappoints",
    "url": "https://www.cnbc.com/2026/01/29/sap-earnings-q4-shares-cloud-contract-value.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108175537-1753251376103-gettyimages-2225992639-img_9367.jpeg?v=1769675601&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T11:12:51.000Z",
    "description": "German software giant SAP plunged as much as 14% Thursday after reporting weaker-than-expected growth in its cloud contract backlog in the fourth quar",
    "body": "German software giant SAP plunged as much as 14% Thursday after reporting weaker-than-expected growth in its cloud contract backlog in the fourth quarter.It's the biggest daily fall since October 2020, when its stock dropped 22% following disappointing third-quarter results. The stock is also on track to close at its lowest price since mid-2024.SAP's current cloud backlog rose by 16% in the fourth quarter to 21.1 billion euros [$25.3 billion]. UBS analysts noted Thursday that the cloud backlog growth will be a \"disappointment\" based on previous expectations of 26% growth.\"Large transformational deals with high cloud revenue ramps in outer years and termination for convenience clauses required by law negatively impacted fourth quarter constant currency current cloud backlog growth by approximately 1 percentage point,\" SAP said in its earnings statement.Chief Executive Officer Christian Klein said the current cloud backlog in the last quarter of the year had laid a \"strong foundation\" to accelerate revenue growth through 2027.The German company did however, guide for cloud backlog growth to \"slightly decelerate\" in 2026.watch nowSAP also reported that total revenue had risen to 9.7 billion euros in the fourth quarter, up slightly from 9.4 billion euros in the same period last year. Operating profit rose to 2.6 billion euros from 2 billion euros. While SAP has shifted from selling on premises software licences in recent years to focusing on cloud services, the AI boom has led to concerns from investors around legacy software providers. \"What is clear is that one of the killer applications of AI is to completely transform the way companies develop code, i.e. software,\" Chief Financial Officer Dominik Asam told CNBC's \"Squawk Box Europe\" on Thursday. \"So there is the question, will the customers now not be able to do everything themselves, and that means the pie will shrink?\"\"So it's all about how quickly can we as SAP actually also embark [on] these technologies in our R&D portfolio to keep the relative economies of scale advantage,\" he added. \"Day in, day out, we work on that and try to actually be a frontrunner on AI adoption amongst our 35,000 developers.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SAP shares see biggest drop since 2020 after fourth-quarter cloud contract growth disappoints",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108175537-1753251376103-gettyimages-2225992639-img_9367.jpeg?v=1769675601&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T11:12:51.000Z",
      "dateModified": "2026-01-29T11:12:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What tariffs? Toyota hits record sales in 2025, despite Trump’s auto levies",
    "url": "https://www.cnbc.com/2026/01/29/toyota-hits-record-hybrids-sales-in-2025-as-the-auto-giant-adjusted-to-trumps-tariffs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108228162-1763556790562-gettyimages-2247416479-bb1_9190_cxs0mw2b.jpeg?v=1763556808&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T09:07:30.000Z",
    "description": "A Toyota dealership is seen on November 19, 2025 in Austin, Texas. Brandon Bell | Getty ImagesToyota Motor has retained its position as the world's to",
    "body": "A Toyota dealership is seen on November 19, 2025 in Austin, Texas. Brandon Bell | Getty ImagesToyota Motor has retained its position as the world's top-selling automaker in 2025, posting record sales of 10.5 million units, the Japanese auto giant reported on Thursday.  Sales of Toyota and its luxury Lexus marque rose 3.7% from a year earlier, edging out Volkswagen Group's 9 million units and Hyundai Motor Group's 7.27 million units. Notably, demand was buoyed by strong U.S. sales of hybrid vehicles, such as the Prius and RAV4 models. Toyota's strength in the U.S. came despite an aggressive tariff regime rolled out by U.S. President Donald Trump, who initially imposed 25% levies on Japanese automotives, before reducing them to 15%.In the U.S., Toyota and Lexus vehicle sales climbed 7.3% to 2.93 million units. The results reflect success in Toyota's strategy of absorbing tariff-related costs rather than passing them on to consumers through broad price hikes, while focusing on local production and other cost controls.While the company estimated in November that U.S. tariffs would still cost it 1.45 trillion yen ($9.7 billion) in its fiscal year ending March 2026, it also raised its full-year operating profit forecast, citing successful cost reductions and strong demand outside the U.S.Tariffs hit rivalIn another sign of demand for global automotives, Toyota rival Hyundai Motor reported global revenue growth of over 6% in 2025 from a year ago, supported by strong hybrid sales in the U.S.However, its operating profit took a hit from tariffs, falling 19.5% from the previous year, with U.S. levies costing the South Korean automaker 4.1 trillion won.South Korea and the U.S. agreed to a trade deal last year that lowered tariffs on most South Korean products, including cars, to 15% starting in November.However, Trump on Monday threatened to raise the duty back to 25%, saying that the country's legislature had not moved fast enough to implement the deal. Hyundai shares fell by nearly 5% on the news.Hyundai's sales in the U.S. are more reliant on imports, with the company saying in September that only about 40% of U.S. sales were produced domestically in 2025. The company hopes to ramp up local manufacturing at its Georgia facilities to over 80% by 2030.  Toyota — which relied on imports for only about one-fifth of its U.S. sales — has also pursued aggressive U.S. manufacturing expansion, focusing on hybrids.Toyota Motor is scheduled to report its fiscal third-quarter earnings on Feb. 6. Analysts expect the firm's operating profits to rebound nearly 30% from the same period last year, according to estimates compiled by Reuters.Shares of Toyota popped 3% in trading on Thursday.Stock Chart IconStock chart icon",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What tariffs? Toyota hits record sales in 2025, despite Trump’s auto levies",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108228162-1763556790562-gettyimages-2247416479-bb1_9190_cxs0mw2b.jpeg?v=1763556808&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T09:07:30.000Z",
      "dateModified": "2026-01-29T09:07:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "India bets on up to 7.2% growth next year, outpacing most major economies",
    "url": "https://www.cnbc.com/2026/01/29/india-economy-growth-7-point-2-percent.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107406774-1714117717241-gettyimages-1237670725-AFP_9VZ4KZ.jpeg?v=1726227236&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T12:09:28.000Z",
    "description": "Laborers work at a coastal road project construction site in Mumbai on January 12, 2022.Punit Paranjpe | Afp | Getty ImagesIndia has forecasted its ec",
    "body": "Laborers work at a coastal road project construction site in Mumbai on January 12, 2022.Punit Paranjpe | Afp | Getty ImagesIndia has forecasted its economy to grow between 6.8% to 7.2% in the fiscal year 2027, outpacing most major economies.The world's fourth-largest economy is targeting this growth on the back of a stable domestic economy and fewer external uncertainties as it aims to conclude a trade deal with the U.S. \"this year,\" India's finance ministry said in its economy survey for the financial year 2026. India is expected to remain the fastest-growing economy in the world, according to the International Monetary Fund, which has pegged its growth at 6.4% in 2026 and 2027. In contrast, the IMF projects the world economy to grow by 3.3% in 2026, marginally shrinking to 3.2% in 2027. Major economies like Germany, the U.K and Japan are likely to grow in the low single digits.The outlook for the Indian economy in the next fiscal year is \"one of steady growth amid global uncertainty, requiring caution, but not pessimism,\" the report said.Unfazed GrowthAs reported earlier this month, India's economy is projected to grow 7.4% in the fiscal year ending March 2026, higher than the 6.5% growth in the last fiscal. Since August, Indian exports to the U.S. have been tariffed at over 50%, and while negotiations are ongoing, a deal remains elusive.But according to the economic survey, India's economic growth has not been hampered by the slowdown in exports to the U.S.Textiles, marine products, gems and jewelry, auto components, and leather goods are the key exports from India, which have been affected due to U.S. tariffs. But according to the data shared by the Indian government, these products have found alternative markets.watch nowIndia's marine products are now being sold in countries like China and Malaysia, while the country's exports of auto components to the UAE are also on the rise, the report said.Despite tariff shocks, the finance ministry said India's growth \"accelerated\" in the current fiscal year due to a slew of structural reforms and policy measures.In September last year, India lowered its goods and services tax rates across products and services to boost domestic consumption. The country has also announced multiple trade deals as it looks to diversify markets for its exports.Risky currencyBut even as India retains its growth story amid an increasingly uncertain global economic environment, its weak currency is a cause of concern for the government.India runs a trade deficit in goods that its net trade surplus in services and remittances cannot fully cover. The country needs foreign capital flows to maintain a healthy balance of payments. When these flows run dry, the rupee weakens, the report highlighted.In 2025, the rupee emerged as the weakest Asian currency due to a record outflow of capital from foreign investors. Most experts see the currency falling further against the dollar. While the economic survey points to the global system as the reason for India's macroeconomic success not translating into currency stability and capital inflows, economic experts take a different view.Global investors will not consider investing in India while global interest rates remain high in other major economies. \"If an investor can make 4%-4.5% in the U.S. without currency risk,\" capital flows will not come to India, explains Anubhuti Sahay, head of India economics research at Standard Chartered Bank.She added that while India's growth story makes a strong investment case, India needs to improve the ease and speed of doing business in the country to attract capital.The return that investors expect from a strong growth market like India gets eroded because it takes a lot of time to set up a business in the country, Sahay said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "India bets on up to 7.2% growth next year, outpacing most major economies",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107406774-1714117717241-gettyimages-1237670725-AFP_9VZ4KZ.jpeg?v=1726227236&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T12:09:28.000Z",
      "dateModified": "2026-01-29T12:09:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Advantest shares jump as much as 14% as AI chip boom drives record sales and higher profit outlook",
    "url": "https://www.cnbc.com/2026/01/29/advantest-shares-jump-record-quarterly-sales-ai-tester-demand-q3-2025-forecast-q4-chip-testing.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107218244-1680236397700-gettyimages-150238247-ADVANTEST.jpeg?v=1753663268&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T01:57:23.000Z",
    "description": "Employees move semiconductor testers on the assembly line of the Advantest Corp. plant in Ora, Japan on Aug. 10, 2012.Tomohiro Ohsumi | Bloomberg | Ge",
    "body": "Employees move semiconductor testers on the assembly line of the Advantest Corp. plant in Ora, Japan on Aug. 10, 2012.Tomohiro Ohsumi | Bloomberg | Getty ImagesShares of Japanese semiconductor equipment maker Advantest jumped as much as 14% Thursday after the company posted record quarterly sales, before paring gains to about 7%.Operating profit for the October-December quarter surged 64% year on year to 113.6 billion yen ($741.8 million). The company also raised its operating profit forecast for the year ending March 2026 by 21.4% to 454 billion yen on Wednesday.Growth was driven primarily by its Test System Business, where sales surged 51.1% to 723.1 billion yen as demand surged for system-on-a-chip testers used in high-performance and AI semiconductors.Stock Chart IconStock chart iconAdvantest also cited continued strength in memory testers for high-performance dynamic random-access memory.Its core business is semiconductor test systems, which verify that chips function properly and meet performance and durability standards before they are shipped.As chips used in artificial intelligence and high-performance computing become more complex, demand has grown for more advanced testing equipment to ensure quality and reliability.While Advantest's management said it does not currently expect tariffs to have a major impact, it flagged ongoing risks from geopolitical uncertainty and currency volatility, even as it sees strong tester demand to persist into the fourth quarter.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Advantest shares jump as much as 14% as AI chip boom drives record sales and higher profit outlook",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107218244-1680236397700-gettyimages-150238247-ADVANTEST.jpeg?v=1753663268&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T01:57:23.000Z",
      "dateModified": "2026-01-29T01:57:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ServiceNow posts better-than-expected fourth-quarter results",
    "url": "https://www.cnbc.com/2026/01/28/servicenow-now-q4-2025-earnings-report.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108156736-1749495545159-gettyimages-2218821486-AFP_49PR8WN.jpeg?v=1749495582&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-28T22:32:11.000Z",
    "description": "ServiceNow CEO Bill McDermott looks on during an \"Invest America\" roundtable discussion with US President Donald Trump in the State Dining Room of the",
    "body": "ServiceNow CEO Bill McDermott looks on during an \"Invest America\" roundtable discussion with US President Donald Trump in the State Dining Room of the White House in Washington, DC on June 9, 2025. Brendan Smialowski | AFP | Getty ImagesServiceNow topped Wall Street's fourth-quarter estimates after the bell on Wednesday, but shares fell more than 3%. Here's how the company performed versus LSEG estimates:Earnings per share: 92 cents adjusted vs. 88 cents expectedRevenue: $3.57 billion vs. $3.53 billion expected. Revenues grew 20.5% from $2.96 billion in the year-ago period. Net income came in at $401 million, or 38 cents per share, up slightly from $384 million, or 37 cents per share, a year ago.\"Hopefully these results continue to demonstrate the fact that the strength of our business really is unwavering, and we're truly a one-of-one company in the software space,\" finance chief Gina Mastantuono told CNBC. The board also approved additional $5 billion for share buybacks. ServiceNow is forecasting subscription revenues between $3.65 billion and $3.66 billion in the first quarter and $15.53 billion and $15.57 billion for the 2026 fiscal year. The enterprise software company said its acquisition of artificial intelligence company Moveworks will contribute 100 basis points to full-year and first-quarter subscription revenue growth and first-quarter current remaining performance obligations growth, which accounts for backlog.Read more CNBC tech newsMeta shares jump on stronger-than-expected revenue forecastTesla tops estimates for quarter, but wraps up first annual revenue drop on recordIBM stock jumps on earnings beatServiceNow posts better-than-expected fourth-quarter resultsThe company is in the middle of a major spending spree to boost its AI and security capabilities as it positions itself as an \"AI control tower\" for businesses. That deal blitz has raised some concerns over whether the company is looking to acquire to reinvigorate growth, especially as fears mount that the software sector is losing ground to AI. \"Our acquisitions are 100% not a pivot away from organic growth,\" Mastantuono said. \"They represent an acceleration of it.\" She said the company is acquiring to gain key capabilities that unlock value. Last month, ServiceNow said it would buy cybersecurity startup Armis for $7.75 billion to bolster its cybersecurity offering and identity security platform Veza, and closed its nearly $3 billion Moveworks deal. ServiceNow said subscription revenues, which account for a large chunk of sales, rose 21% from a year ago to about $3.47 billion during the period and beat the StreetAccount expectation of $3.42 billion. Subscription revenues for fiscal 2025 grew 21% to $12.88 billion.The Santa Clara, California-based company's fourth-quarter current remaining performance obligations jumped 25% from a year ago to $12.85 billion.ServiceNow also announced an expanded partnership with Anthropic to better integrate its Claude models for customers. Earlier this month, ServiceNow made a similar, three-year deal, with competitor OpenAI.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ServiceNow posts better-than-expected fourth-quarter results",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108156736-1749495545159-gettyimages-2218821486-AFP_49PR8WN.jpeg?v=1749495582&w=1920&h=1080"
      ],
      "datePublished": "2026-01-28T22:32:11.000Z",
      "dateModified": "2026-01-28T22:32:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government shutdown: Republicans consider escape hatch as Congress careens toward deadline",
    "url": "https://www.cnbc.com/2026/01/28/government-shutdown-republicans-mull-escape-hatch-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257917-1769551530129-gettyimages-2258553847-090a2409_jf80h84l.jpeg?v=1769641413&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T12:12:56.000Z",
    "description": "U.S. Senate Majority Leader John Thune, R-S.D., is followed by reporters as he walks to the Senate Chambers in the U.S. Capitol in Washington, Jan. 27",
    "body": "U.S. Senate Majority Leader John Thune, R-S.D., is followed by reporters as he walks to the Senate Chambers in the U.S. Capitol in Washington, Jan. 27, 2026.Anna Moneymaker | Getty ImagesRepublican senators appear to be opening the door to preventing a partial government shutdown as the chamber prepares to start voting on a House-passed package to fully fund a group of federal agencies through the remaining fiscal year. The Senate is set to start voting on the funding bills Thursday morning. If the chamber doesn't pass all of them, much of the federal government would shut down Saturday at 12:01 ET.The bills would fund the Department of Homeland Security and several other agencies, including the Treasury and Defense departments. While the package once looked certain to clear the Senate and avoid a shutdown, the killing of U.S. citizen Alex Pretti by federal immigration agents Saturday in Minneapolis derailed it. Democrats are demanding that the DHS portion of the bill be stripped from the package and weighed separately to make changes to how the agency operates, a move that Republicans have so far resisted. On Wednesday, some Senate Republicans began to embrace the idea of splitting off DHS, as a shutdown looms just months after a record 43-day closure last year. The measure will require 60 votes to clear the Senate filibuster. Republicans hold only 53 seats in the upper chamber, meaning Democrats can block it if they withhold their votes.\"Rather than scuttling the whole package, I say let's go and pass what we can,\" Sen. John Kennedy, R-La., said in an interview with reporters at the Capitol on Wednesday. \"I think all the bills will pass except Homeland Security, and then we can sit down and talk about Homeland Security,\" said Kennedy, who sits on the Senate Appropriations Committee. Asked how many of his Republican colleagues support such a move, Kennedy said: \"A bunch.\"Indeed, numerous Republicans said Wednesday that while they would like to see the entire package pass the Senate, splitting off DHS is a palatable off-ramp. \"We are going to see what happens when that vote comes up,\" said Sen. John Hoeven, R-N.D., another member of the appropriations committee. \"[But] if the Democrats block it, [Senate Minority Leader Chuck] Schumer has already said that he's willing to move the five, and so I certainly have an open mind on that.\"Sen. Thom Tillis, R-N.C., told CNBC that if Democrats are \"okay with five of the six bills,\" then \"we ought to figure out a way to get those done.\"Senate Majority Leader John Thune, R-S.D., said in a press conference Wednesday that such proposals are so far \"hypotheticals\" and that he would \"reserve optionality.\" \"I think the best path forward, as I've said, is to keep the package intact,\" Thune said. \"If there are things that the Democrats want that the administration can agree with them about, then let's do that.\"Democrats are warning that a separate negotiation with the administration would not be enough to assuage their concerns. President Donald Trump has attempted a turnabout in recent days after the fallout from the shooting of Pretti in Minnesota, recently saying he will deescalate his immigration crackdown in the state. \"This has to be in the bill,\" said Sen. Angus King of Maine, an independent who caucuses with Democrats. \"I don't think we could settle for promises.\" King repeatedly voted to reopen the government during the last shutdown, bucking his caucus. \"I can't in good conscience vote for a DHS budget under these circumstances,\" King said, calling for the DHS component to be separated so the rest of the bills can pass. DHS is conducting immigration operations in Maine. Sen. Angus King, I-Maine, arrives for a vote in the Capitol on Thursday, September 28, 2023.Bill Clark | CQ-Roll Call, Inc. | Getty ImagesSchumer, D-N.Y., listed Democrats' demands in a press conference Wednesday. He said Democrats want a DHS funding package to include new guardrails for federal immigration enforcement. Those guardrails include a requirement for warrants for arrests, a ban on federal agents wearing masks, mandatory body cameras and a uniform code of conduct for federal agents. \"Democrats stand ready today to pass the five bipartisan bills in the Senate, but the DHS bill needs serious work,\" Schumer said. \"It's now on Leader Thune to separate out the DHS bill ... and start working with Democrats to rein in ICE.\"Republicans appear to be plowing ahead with plans to vote on all six bills. \"We're voting on this tomorrow,\" said Sen. Markwayne Mullin, R-Okla. \"Anything can change in 24 hours, but our plan is to vote on six bills.\" Should that vote fail and Senate Republicans decide to split off the DHS portion, it would likely require a unanimous consent request on the Senate floor to alter the bill, given the short timeline. Any one senator could object to such a move, drawing out the timeline and further risking a shutdown. \"I've got concerns with that, but I'd have to examine it,\" said Sen. Mike Lee, R-Utah, when asked by CNBC if he would object to stripping out the DHS bill from the package. Republicans also note that a shutdown at DHS would also mean that the Federal Emergency Management Agency would go unfunded during a winter cold snap that has brought bitter temperatures, ice and snow to a large part of the country. King suggested that a short-term continuing resolution could keep FEMA and other agencies afloat. Any changes the Senate makes to the package would also require reapproval by the House. The House is out of Washington on recess, with plans to return next week — after the shutdown deadline. \"If the bill changes much from what the House already passed, then you've got another steep hill to climb over there,\" Thune said. DHS would largely also be able to keep operating its immigration enforcement apparatus even if it enters into a shutdown. Republicans gave the agency hundreds of billions of dollars in supplemental appropriations as part of the tax and spending package passed last year.Correction: This story has been updated to reflect the correct day of the shutdown.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government shutdown: Republicans consider escape hatch as Congress careens toward deadline",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257917-1769551530129-gettyimages-2258553847-090a2409_jf80h84l.jpeg?v=1769641413&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T12:12:56.000Z",
      "dateModified": "2026-01-29T12:12:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Drugmakers Roche and Sanofi talk up their pipelines, as earnings fail to excite",
    "url": "https://www.cnbc.com/2026/01/29/roche-sanofi-earnings-pharma-drug-pipeline-obesity.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108117484-1742300899522-gettyimages-1982130704-20090101240206-99-889432.jpeg?v=1753739868&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-29T11:31:38.000Z",
    "description": "Drugmakers Roche and Sanofi's latest earnings were largely as expected, with the companies talking up the potential of experimental medicines ahead of",
    "body": "Drugmakers Roche and Sanofi's latest earnings were largely as expected, with the companies talking up the potential of experimental medicines ahead of a looming \"patent cliff\" for Big Pharma.Both companies' stocks were down less than 1% on Thursday after reporting earnings before the bell.They are both among the pharmaceutical companies that could see revenue fall dramatically in the coming years unless they top up their pipelines by developing drugs internally or acquiring drug candidates developed by others.\"On the pipeline side, we've had an amazing run of a number of Phase 3 readouts that are going to be instrumental for future growth,\" the CEO Thomas Schinecker told CNBC's \"Squawk Box Europe\" on Thursday.\"We have a number of medicines that we've now moved into the late stage of development, and we will have up to 19 new medicines that we can launch by the end of the decade.\"watch nowInnovation in focusSanofi posted a quarterly beat on both top and bottom lines, and issued 2026 guidance largely in line with expectations.It reported fourth-quarter sales growth of 13% at constant currencies and earnings per share of 1.53 euros ($1.20), both above forecasts, even with headwinds in its vaccine business thanks to changes in U.S. vaccine policy. \"Growth was supported by new medicines and Dupixent, reaching a new quarterly high,\" CEO Paul Hudson said in a statement.Similar to Roche, Sanofi also sees sales growing by high-single digits in 2026, with profit growth \"slightly higher than revenue.\" \"We anticipate profitable growth to continue over at least five years,\" the company said.Despite the beat and a newly announced 1 billion euro share buyback, the focus for Sanofi investors remains on the company's research and development.The need to expand the pipeline will put long-term R&D spend and the potential future M&A front and center in Sanofi's earnings call on Thursday afternoon, Jefferies analyst Michael Leuchten said in a note after earnings.The obesity entryApart from its experimental breast cancer drug giredestrant and MS treatment fenebrutinib, Roche is betting big on a slice of the lucrative obesity market in the coming years.The company is facing key loss of exclusivity for some of its best-selling drugs, but CEO Schinecker told CNBC's that this was \"absolutely manageable.\" On Tuesday, the company reported positive Phase 2 clinical trial results for its weight-loss candidate CT-388. It showed that the drug resulted in a 22.5% weight reduction over 48 weeks, on par with market rivals Novo Nordisk's Wegovy and Eli Lilly's Zepbound. The company hopes it to be able to compete in the increasingly crowded market through differentiation.Read moreLast year, Roche also entered into a partnership with Danish Zealand Pharma to co-develop Zealand's drug petrelintide, an amylin analog, as a stand-alone as well as in combination with CT-388.\"We're not investing in [the] first generation of these medicines – we're investing in the next generation,\" CEO Schinecker told CNBC on Thursday.\"We can differentiate in combination with other therapies we have in house, because there are more than 200 comorbidities in neurology, in immunology, in cancer, and none of the other players have the kind of portfolio that we have for combinations,\" he said, adding that there was also windows for differentiation with the longer lasting molecule itself, as well as in diagnostics.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Drugmakers Roche and Sanofi talk up their pipelines, as earnings fail to excite",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108117484-1742300899522-gettyimages-1982130704-20090101240206-99-889432.jpeg?v=1753739868&w=1920&h=1080"
      ],
      "datePublished": "2026-01-29T11:31:38.000Z",
      "dateModified": "2026-01-29T11:31:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump lowered 'temperature' on Minnesota, wants to avoid shutdown: Bessent",
    "url": "https://www.cnbc.com/2026/01/28/trump-ice-minnesota-government-shutdown-bessent.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108258247-1769613619209-Bessent3.jpg?v=1769613676&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-28T17:22:51.000Z",
    "description": "watch nowPresident Donald Trump has \"brought down the temperature\" on Minnesota, the site of major civil unrest over aggressive federal immigration ef",
    "body": "watch nowPresident Donald Trump has \"brought down the temperature\" on Minnesota, the site of major civil unrest over aggressive federal immigration efforts, Treasury Secretary Scott Bessent said Wednesday.Trump is \"urging\" Congress to take action to avoid triggering a partial government shutdown amid disputes over federal funding for the Department of Homeland Security, Bessent told CNBC's \"Squawk on the Street.\"The shutdown could begin at 12:01 a.m. ET on Saturday unless lawmakers come to a resolution on the DHS funding, which a slew of Democrats have rejected in light of the recent killing of nurse Alex Pretti by federal agents in Minneapolis.Trump is \"in constant contact\" with lawmakers \"and he is urging them not to shut down the government,\" Bessent told CNBC.Bessent spoke as the Trump administration tempers its tone after its harsh initial response to two immigration enforcement-related killings in Minneapolis that stirred waves of outrage from Democrats and even some Republicans.The Cabinet secretary declined to make a prediction about whether a shutdown — the second in less than four months — will be averted.\"I don't know what to expect. The Democrats can become unhinged like they were last time, and they don't care. Like, they think this is a way to stop President Trump,\" he said.He also warned that another shutdown could cause further economic harm. \"Especially on the service side, when the government shut down, that never comes back. So, there's a big permanent loss,\" Bessent said.The House of Representatives last week passed a more-than-$1.2 trillion spending package that includes funding for DHS, the agency in charge of federal immigration enforcement.The package, which accounts for the bulk of government spending for the fiscal year ending Sept. 30, requires Democratic support to clear the Senate's 60-vote filibuster threshold. And if the Senate changes what the House already passed, the House would have to return from a prescheduled recess to vote on any amended measure, with little time to spare before a shutdown.Democratic opposition to the spending package rapidly grew after Pretti's killing on Saturday morning. Senate Democrats now say they will vote against the package unless the DHS portion is stripped out, something Republicans have signaled they will not do.Pretti was killed just weeks after another U.S. citizen, Renee Nicole Good, was fatally shot by federal agents in Minneapolis.In both cases, the Trump administration initially came out in full-throated defense of its officers' actions while accusing the slain citizens of domestic terrorism. After widespread blowback — and after new polls showed Trump's immigration approval rating plummeting — the administration has dialed back its tone.Trump said Tuesday, \"we're going to de-escalate a bit\" in Minnesota.But Senate Minority Leader Chuck Schumer, D-N.Y., has suggested that that pivot is not enough for Democrats to drop the shutdown threat.\"The fix should come from Congress; the public can't trust the administration to do the right thing on its own,\" Schumer said Tuesday on the Senate floor.\"In the meantime, I will vote no on any legislation that funds [U.S. Immigration and Customs Enforcement] until it is reined in and overhauled, and Senate Democrats are overwhelmingly united on this issue,\" Schumer said.This is breaking news. Please refresh for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump lowered 'temperature' on Minnesota, wants to avoid shutdown: Bessent",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108258247-1769613619209-Bessent3.jpg?v=1769613676&w=1920&h=1080"
      ],
      "datePublished": "2026-01-28T17:22:51.000Z",
      "dateModified": "2026-01-28T17:22:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]