[
  {
    "title": "Kamala Harris reveals how refusing to take ‘no’ for an answer served her career",
    "url": "https://www.cnbc.com/2025/11/02/kamala-harris-on-why-never-taking-no-for-answer-served-her-career.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108179301-17539024712025-02-23t020802z_1016364369_rc200dagdj00_rtrmadp_0_awards-naacp.jpeg?v=1761840333&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-02T08:04:47.000Z",
    "description": "Former U.S. Vice President Kamala Harris attends the 56th NAACP Image Awards at the Pasadena Civic Auditorium in Pasadena, California, U.S. February 2",
    "body": "Former U.S. Vice President Kamala Harris attends the 56th NAACP Image Awards at the Pasadena Civic Auditorium in Pasadena, California, U.S. February 22, 2025.Etienne Laurent | ReutersFormer Vice President Kamala Harris said that during her career, she never took \"no\" for an answer — and attributed much of her success to this attitude.Harris, who served as vice president of the United States under President Joe Biden from 2021 to 2025, shared some candid insights about her early career on Steven Bartlett's Diary of a CEO podcast.When asked what she was like as a 25-year-old prosecutor, Harris responded: \"She was fearless. She didn't hear 'no it can't be done.'\"Harris recalled the first case she had as a young prosecutor: it was a Friday evening, and the person who had been arrested was a young woman with children at home.\"All the courts were shutting down and I went to the courtroom, and I asked the judge: 'Please take the bench again. She has young children. She can't stay in over the weekend,'\" Harris said.\"And the clerk was like: 'no, he's gone for the day. He's leaving for the day.' And I would not leave, and they called the case.\"This persistence has served Harris well throughout her career. She became the first Black, South Asian American, and female vice president after serving as a U.S. senator and attorney general in California.\"Not hearing no, that has probably been a throughline of my life. I don't rest easy with the idea that something is not possible, at least I don't rest easy with the idea without trying to show that it is possible and that's probably not changed,\" she added.In 2024, Harris replaced Biden as the Democratic presidential nominee after he dropped out of the race, but lost to President Donald Trump.Overcoming imposter syndromeHarris admitted that she experienced imposter syndrome in her career, especially when she was first elected district attorney in 2004.\"And there I was, sitting in the office, and I thought: 'Oh my god, I'm now the elected DA of a major city in the United States,'\" the former vice president said on the podcast, adding that she felt a great responsibility in her role.However, she put a positive spin on imposter syndrome, saying there's nothing wrong with having a little humility.\"I think there is a lot that is good with having a certain level of humility, and in particular when the people have vested you with great power, to understand that it's not about you. I think that is part and parcel of what we call imposter syndrome ... I think often it is because they understand how serious the job is on behalf of others, and I applaud a bit of honest humility, not feigned humility, \" she said.At other points in the podcast, Harris recalled walking into meetings and people wondering where her boss was. She said that deprioritizing other people's opinions greatly benefited her.\"When I'm mentoring people, I will often say to them: 'Don't ever limit yourself based on other people's limited ability to see who you are,\" she added.  \"That's their limitation… don't impose those limitations on yourself.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kamala Harris reveals how refusing to take ‘no’ for an answer served her career",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108179301-17539024712025-02-23t020802z_1016364369_rc200dagdj00_rtrmadp_0_awards-naacp.jpeg?v=1761840333&w=1920&h=1080"
      ],
      "datePublished": "2025-11-02T08:04:47.000Z",
      "dateModified": "2025-11-02T08:04:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I've studied over 200 kids—these 7 'magic phrases' can calm any tantrum instantly",
    "url": "https://www.cnbc.com/2025/11/02/ive-studied-over-200-kidsthese-7-magic-phrases-can-calm-any-tantrum-instantly.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219563-1761848790870-GettyImages-1311549168.jpg?v=1761848832&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-02T14:28:29.000Z",
    "description": "When your kid is in the middle of a tantrum, logic and lectures don't work.I've studied over 200 kids and worked with hundreds of families, and one th",
    "body": "When your kid is in the middle of a tantrum, logic and lectures don't work.I've studied over 200 kids and worked with hundreds of families, and one thing is clear: Tantrums aren't about defiance. Research shows that during emotional overwhelm, a child's prefrontal cortex (the part of the brain responsible for reasoning and language) essentially goes offline. It's why \"use your words\" falls flat when they're screaming.What they need in that moment is connection. These seven magic phrases work with your child's nervous system by calming the storm, restoring safety, and teaching emotional regulation — the real skill behind resilience.1. Say nothingWhen your child is mid-meltdown, your instinct is to make it stop... fast. You want the screaming to end, the tears to dry, the chaos to pass. So you start talking: \"Calm down,\" \"Use your words,\" \"Tell me what's wrong.\"But often, the fastest way to end a tantrum is silence. When your child's body is in full distress, every word you add is like oxygen to a fire. Their \"thinking brain\" has shut down. Words simply can't land. But your nervous system can reach them instantly.Sit close. Stay relaxed. Saying nothing essentially communicates an important phrase: \"You're safe, and I can handle this.\" Once their breathing slows and the peak has passed, that's when your spoken words can start to land.2. 'I'm right here.'This short phrase is a lifeline. You're not walking away, threatening consequences, or trying to reason. You're anchoring them back into connection.A tantrum often triggers a primal fear: Am I still loved when I'm out of control? Your calm presence answers that question instantly. Connection regulates the stress response faster than correction ever can. Emotional safety quiets the body's alarm system.3. 'This feeling is really big, huh?'Instead of minimizing their emotions or rushing them through it, this phrase acknowledges the size of the feeling. It helps kids see what's happening inside rather than being consumed by it.Validation activates the brain's calming pathways. When children feel seen, their bodies release tension. And that's the first step toward emotional awareness.4. 'It's okay to feel angry. It's not okay to hit.'Parents often swing between being too permissive or too harsh. This phrase strikes the balance. You're separating the feeling from the behavior, and validating the emotion while holding the boundary.Consistent limits paired with emotional acceptance build impulse control — the foundation of self-discipline.5. 'Let's take a break together.'Sometimes, a \"time-in\" works better than a \"time-out.\" This phrase teaches your child to regulate with you. Invite them to sit, breathe, or just be still until the storm passes. Proximity restores safety faster than isolation ever could.When children are dysregulated, they need your nervous system to co-regulate theirs. Your calm is contagious.6. 'I can see how much you wanted that.'This phrase helps acknowledge the emotion underneath your child's behavior: disappointment, frustration, or longing. When kids feel seen, they don't need to keep screaming to prove their feelings are real.Validation lowers the brain's threat response. Once a child feels understood, their nervous system begins to settle — and the tantrum ends naturally, without punishment or bribes.7. 'You can be mad, and I'll still love you.'Unconditional safety is what every child needs most. Tantrums often test an unspoken question: \"Will you still love me when I'm not lovable?\"This phrase answers it clearly and teaches emotional security for life. It also rewires the shame response. Children learn that love isn't withdrawn for imperfection, and that's the beginning of self-worth.Reem Raouda is a leading voice in conscious parenting and the creator of FOUNDATIONS, a step-by-step guide that helps parents heal and become emotionally safe. She is widely recognized for her expertise in children's emotional safety and for redefining what it means to raise emotionally healthy kids. Connect with her on Instagram.Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I've studied over 200 kids—these 7 'magic phrases' can calm any tantrum instantly",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219563-1761848790870-GettyImages-1311549168.jpg?v=1761848832&w=1920&h=1080"
      ],
      "datePublished": "2025-11-02T14:28:29.000Z",
      "dateModified": "2025-11-02T14:28:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What keeps Ella Emhoff motivated during tumultuous times: 'Small changes impact big change'",
    "url": "https://www.cnbc.com/2025/11/02/what-keeps-ella-emhoff-motivated-during-tumultuous-times.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219615-1761852934344-gettyimages-2242725956-sc1_4563_35dptu0b.jpeg?v=1761853000&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-02T14:30:01.000Z",
    "description": "With politics among the biggest stressors for Americans, and the political gender gap growing among young people, it can be hard to stay motivated whe",
    "body": "With politics among the biggest stressors for Americans, and the political gender gap growing among young people, it can be hard to stay motivated when divisions feel more contentious than ever.Few people understand that like Ella Emhoff, the daughter of former U.S. Second Gentleman Doug Emhoff and stepdaughter of former Vice President Kamala Harris.Getting offline is a good first step.\"I think what has kept me the most invigorated around politics and just social change is seeing everyone else empowered by it, coming to things like ZCON and being able to talk about it,\" Emhoff recently told CNBC Make It at the Gen Z-focused conference put on by United Talent Agency. \"When we're online, it can feel so insular and feel like everything's happening to us, whether it be with immigration, with wars, with genocide, with the climate.\"With so much happening, Emhoff says she finds power in focusing on small changes within her control, and actions she can take toward them.\"Small changes impact big change,\" she says. \"Even going and volunteering at a shelter or with dogs or feeding the homeless, anything like that is going to create positive impact. The more you engage with that in your day-to-day, bigger things will feel more achievable.\"These small and ongoing projects of purpose are more achievable and enjoyable no matter the result, versus large and intangible goals, Dr. Jordan Grumet, a hospice medical director and author writing about purpose, previously told Make It.On the other hand, scrolling and consuming every bad headline won't do much for your emotions or your feelings of being able to enact small changes. \"Get off your phone, engage in your community,\" Emhoff says. \"It's going to make you feel better. I promise.\"Dealing with setbacksThe 26-year-old says turning to offline creative pursuits, like her work as a textile artist and her recently relaunched Soft Hands Knit Club, helps too.Working in a creative field has its own challenges. But Emhoff says her mother, Kerstin, who works as a film producer and heads a creative entertainment studio, has always given her the best outlook on her career.\"One of the best things she's told me is just don't give up,\" she says. \"When you're in a non-traditional career path like I am, it's really easy to want to give up when the stream of income is lost, or you're feeling like your engagement is down and you want to just quit and get a normal job. I love to threaten her that I'm going to go and just get a corporate job, but she's always been a really big proponent of the message I have in mental health and crafting and community, and it's pushed me a lot farther than I ever thought.\"Emhoff says she's also gotten good advice from her stepmother Harris, especially about recovering from a setback after losing the 2024 presidential election.\"After she gave her concession speech, she sat down with us and said, 'This is not the end. This is just a bump in the road.' And I really do believe that,\" Emhoff says. \"There have been hard times before. We are in an especially hard time. But we have gotten out of hard times, and the only way to get through that is with believing and not letting up.\"\"I think we collectively need to get into that same headspace of just kicking butt,\" she adds.Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What keeps Ella Emhoff motivated during tumultuous times: 'Small changes impact big change'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219615-1761852934344-gettyimages-2242725956-sc1_4563_35dptu0b.jpeg?v=1761853000&w=1920&h=1080"
      ],
      "datePublished": "2025-11-02T14:30:01.000Z",
      "dateModified": "2025-11-02T14:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "VC who bet on billion-dollar AI firm shares two red flags that stop him investing in a founder ",
    "url": "https://www.cnbc.com/2025/11/01/vc-who-backed-billion-dollar-ai-firm-shares-two-red-flags-in-founders-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108002114-17201904052024-07-05t022401z_1040404780_rc2io8aqgddl_rtrmadp_0_storm-beryl-mexico.jpeg?v=1720190496&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-02T08:19:36.000Z",
    "description": "Man and woman having a small business meeting in smart casual clothesIppei Naoi | Moment | Getty ImagesOne successful angel investor has revealed two ",
    "body": "Man and woman having a small business meeting in smart casual clothesIppei Naoi | Moment | Getty ImagesOne successful angel investor has revealed two red flags that prevent him from investing in a founder in the first meeting.Carles Reina is an angel investor who backed voice cloning AI startup Eleven Labs when it was still in its very early stages in 2022. The firm was co-founded by Mati Staniszewski and Piotr Dąbkowski, and raised $180 million at a valuation of $3.3 billion, in its Series C funding earlier this year.In September, the company announced it was letting employees sell shares at a $6.6 billion valuation. Reina is now a vice president of revenue at the AI firm.When Reina first met Eleven Lab's co-founder Staniszewski, he told CNBC Make It that nobody wanted to invest in voice AI at the time. However, Reina decided to take a chance on Eleven Labs after just one meeting.\"We started talking, and within 30 minutes of the first conversation, I told him, 'How much money do you want?'\" Reina shared.He explained that the first meeting is critical when making a decision and Staniszewski displayed certain traits that attracted him as an investor.\"If the first signs are just not there, I usually don't want to waste anyone's time… I think you end up optimizing always for high quality interactions, [it's] like you're trying to triage if this is something that you really like and that you want to spend more time with the founders or not.\"Reina opened up about two reasons why he wouldn't want to invest in a founder after a first meeting.Two red flagsOne of the key traits that Reina looks for when meeting a founder is technicality.\"This is very personal, especially in different stages. But for me, if one of the founders is not technical, like literally cannot build products, is not a researcher or something like that, I just don't see the value in that because they're not going to be able to move as quickly,\" he said in the interview.Reina saw this quality in Eleven Lab's Staniszewski, who has a first-class honors degree in mathematics from Imperial College London.\"It was really interesting to see he was thinking about the problems of the entire ecosystem before even actually having any product, or before even actually talking to any real potential customer,\" he said.The second red flag is if the founder is trying to build a company in a \"very crowded market\" which Reina often tries to steer clear of.\"if there is a lot of venture capitalists looking at that market, because it is sexy, I'm just not interested because then valuations skyrocket and you end up going into a pricing war where everyone's trying to give them term sheets and so on,\" he said.When too many VCs want to invest in a company, it inflates the valuation of that company which then puts unnecessary pressure on the founders to show rapid growth and maintain or increase that valuation, according to Reina.Other reasons might be that the founder is in an industry he just isn't interested in and it doesn't fit his profile of investments.\"If someone sends me a pitch, or I get introduced to someone that just doesn't really bring my attention straight away, I will tell them straight away 'happy to help you on anything that you need [but] from an angel perspective or investing perspective, it's just not one of my things.'\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "VC who bet on billion-dollar AI firm shares two red flags that stop him investing in a founder ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108002114-17201904052024-07-05t022401z_1040404780_rc2io8aqgddl_rtrmadp_0_storm-beryl-mexico.jpeg?v=1720190496&w=1920&h=1080"
      ],
      "datePublished": "2025-11-02T08:19:36.000Z",
      "dateModified": "2025-11-02T08:19:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Voters express frustration with Trump's handling of economy, NBC News poll shows",
    "url": "https://www.cnbc.com/2025/11/02/trump-economy-nbc-news-poll.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214327-1760985093871-gettyimages-1696426637-lola-shopping-3157-edit.jpeg?v=1762104849&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-02T18:10:42.000Z",
    "description": "Jasondoiy | E+ | Getty ImagesA recent NBC News poll showed growing frustration among Americans regarding President Donald Trump's handling of the econ",
    "body": "Jasondoiy | E+ | Getty ImagesA recent NBC News poll showed growing frustration among Americans regarding President Donald Trump's handling of the economy less than a year after entering office.In a poll of 1,000 voters taken between Oct. 25-28, 63% said Trump had fallen short of expectations regarding the economy. Separately, 65% said Trump had fallen short of looking out for the middle class, and 66% expressed the same sentiment for the handling of inflation and the cost of living.Trump's overall approval rating in the poll has fallen 4 points to 43% since March, while 55% disapprove of the president's job performance.The negativity appears to be bleeding into voters' feelings of dissatisfaction with Republican lawmakers. With just a year to go before the 2026 midterm elections, Democrats are favored to win control of Congress by an 8-point margin, 50% to 42%, among those polled. Democrats led by just one point, 48% to 47%, in the March survey.The results come as the government shutdown has stretched past a month, affecting critical government programs, including SNAP food benefits. The NBC News poll also indicated that voters are split on which party would have a better handle on the economy.According to the poll, 38% of voters found Republicans would do a better job, while 37% found Democrats would be more effective.This follows a recent CNBC All-America Economic Survey, which showed views on the U.S. economy turned more negative.See the complete NBC News poll here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Voters express frustration with Trump's handling of economy, NBC News poll shows",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214327-1760985093871-gettyimages-1696426637-lola-shopping-3157-edit.jpeg?v=1762104849&w=1920&h=1080"
      ],
      "datePublished": "2025-11-02T18:10:42.000Z",
      "dateModified": "2025-11-02T18:10:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top Wall Street analysts suggest these 3 dividend stocks for enhanced total returns",
    "url": "https://www.cnbc.com/2025/11/02/top-wall-street-analysts-suggest-these-3-dividend-stocks-for-enhanced-total-returns-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/104705823-GettyImages-839005266-valero.jpg?v=1761909539&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-02T14:10:22.000Z",
    "description": "The Valero Energy refinery in Texas City, Texas.F. Carter Smith | Bloomberg | Getty ImagesThe focus on dividend stocks is growing, as the U.S. Federal",
    "body": "The Valero Energy refinery in Texas City, Texas.F. Carter Smith | Bloomberg | Getty ImagesThe focus on dividend stocks is growing, as the U.S. Federal Reserve announced another rate cut. Investors can consider stocks that offer dividends and also have the potential to drive capital appreciation, enhancing the total return.In this regard, recommendations of top Wall Street analysts can help us identify stocks that have solid upside and pay attractive dividends. The stock picks of these experts are backed by in-depth analysis of a company's growth opportunities and ability to pay dividends consistently.Here are three dividend-paying stocks, highlighted by Wall Street's top pros, as tracked by TipRanks, a platform that ranks analysts based on their past performance.Valero EnergyWe start this week with Valero Energy (VLO), a manufacturer of petroleum-based and low-carbon liquid transportation fuels and petrochemical products. In Q3 2025, Valero returned $1.3 billion to stockholders via $351 million in dividends and $931 million in share repurchases. On Oct. 29, Valero declared a quarterly dividend of $1.13 per share. At an annualized dividend of $4.52, VLO stock offers a yield of 2.7%.Valero Energy recently reported upbeat Q3 results, backed by strong refining margins. Keeping in view the Q3 performance, strong refining outlook, and the company's attractive capital returns strategy, Goldman Sachs analyst Neil Mehta reiterated a buy rating on VLO stock and raised his price target to $197 from $180.\"We continue to view VLO as a key beneficiary of our more constructive refining outlook, given the company's balance sheet strength, low-cost operations, and operational execution,\" said Mehta.The 5-star analyst noted that during the third-quarter earnings call, management discussed a constructive refining outlook, driven by limited net capacity additions and widening crude differentials. Mehta also highlighted that Valero's non-refining businesses performed better than Goldman Sachs' expectations. Looking ahead, Mehta believes that low inventories, resilient demand, and limited net refining capacity additions support tighter supply/demand expectations for 2026.In particular, Mehta noted management's continued focus on capital returns and commitment to allocating excess free cash flow to shareholders. The analyst expects a stronger refining backdrop to contribute to meaningful free cash flow generation, which could support about $4.6 billion of capital returns in 2026, implying a 9% capital return yield.Mehta ranks No. 812 among more than 10,000 analysts tracked by TipRanks. His ratings have been profitable 58% of the time, delivering an average return of 8.7%.AlbertsonsWe move on to the next dividend-paying stock, Albertsons Companies (ACI). The food and drug retailer recently announced upbeat results for the second quarter of fiscal 2025, driven by strong pharmacy sales and digital business. On October 14, Albertsons announced a quarterly dividend of 15 cents per share, payable on November 7. At an annualized dividend of 60 cents per share, ACI stock offers a dividend yield of 3.3%.Following Albertsons' better-than-expected fiscal second-quarter results, Tigress Financial analyst Ivan Feinseth reiterated a buy rating on ACI stock and modestly increased his price target to $29 from $28. The analyst is bullish on Albertsons as the company \"accelerates growth through AI-powered digital sales, expanding loyalty ecosystem, and high-margin retail media platform.\"Feinseth highlighted that Albertsons is transforming from a traditional grocery operator into a data‑driven, digitally integrated food and wellness platform. This change is being fueled by the company's e-commerce expansion, loyalty integration, and rapidly expanding Albertsons Media Collective advertising network, which Feinseth believes is well-positioned to become one of its most profitable long-term growth engines.The top-rated analyst pointed out that ACI's For U loyalty program is driving both digital engagement and spending growth. In fact, For U membership increased more than 13% year-over-year in Q2 FY25, reaching over 48 million active participants. The growing member base boosts ACI's business as members transact more frequently, spend more, and are increasingly using cross-channel rewards, noted Feinseth.Additionally, Feinseth highlighted that Albertsons is enhancing shareholder returns through ongoing dividend increases and share repurchases, including the recently announced additional $750 million accelerated share repurchase authorization. He expects ACI stock to deliver a total return of close to 50%, including dividends.Feinseth ranks No. 296 among more than 10,000 analysts tracked by TipRanks. His ratings have been profitable 62% of the time, delivering an average return of 14.2%.Williams CompaniesFinally, let's look at energy infrastructure provider Williams Companies (WMB). On October 28, Williams announced a quarterly cash dividend of 50 cents per share, payable on December 29, 2025, and reflecting a 5.3% year-over-year increase. At an annualized dividend of $2 per share, WMB stock offers a 3.5% yield.Ahead of Williams' Q3 results scheduled after the market closes on November 3, RBC Capital analyst Elvira Scotto reiterated a buy rating on WMB stock with a price forecast of $75. In a preview on the Q3 results of the companies in the U.S. midstream space, Scotto stated that Williams and Targa Resources (TRGP) are her favored names into the earnings.Scotto noted that the secular tailwind for natural gas due to rising power demand for electrification and artificial intelligence (AI)/data center growth is driving the need for more energy infrastructure. The 5-star analyst believes that among the stocks within her coverage, \"WMB is best positioned to benefit given its gas transmission asset footprint and its Power Innovation projects.\"Furthermore, Scotto expects WMB to deliver a CAGR (compound annual growth rate) of about 10% in its EBITDA (earnings before interest, taxes, depreciation, and amortization) from 2025 through 2030. The analyst looks forward to additional information on WMB's recently announced Power Innovation projects and any new projects. Scotto expects an uptick in Q3 2025 numbers on a quarter-over-quarter basis across all business segments, with Transmission, Gulf, and Power driving the biggest absolute increase.Scotto views WMB's February analyst day as the next catalyst for the stock. The analyst expects WMB to increase its EBITDA growth target from the range of 5% to 7% to high single digits or more.Scotto ranks No. 270 among more than 10,000 analysts tracked by TipRanks. Her ratings have been successful 64% of the time, delivering an average return of 13.7%.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top Wall Street analysts suggest these 3 dividend stocks for enhanced total returns",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/104705823-GettyImages-839005266-valero.jpg?v=1761909539&w=1920&h=1080"
      ],
      "datePublished": "2025-11-02T14:10:22.000Z",
      "dateModified": "2025-11-02T14:10:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Evolve Bank CEO fired after propositioning FBI agent who pretended to be a teen boy",
    "url": "https://www.cnbc.com/2025/11/01/evolve-bank-ceo-fired-propositioning-fbi-agent-posing-as-teen-boy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220325-1762004191924-Hartheimer-mug.png?v=1762004290&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-01T21:56:49.000Z",
    "description": "Evolve Bank CEO Bob Hartheimer booking photo.Source: Shelby County JailBob Hartheimer, CEO of Tennessee's Evolve Bank & Trust, was fired after U.S. la",
    "body": "Evolve Bank CEO Bob Hartheimer booking photo.Source: Shelby County JailBob Hartheimer, CEO of Tennessee's Evolve Bank & Trust, was fired after U.S. law enforcement officials caught him propositioning a law enforcement officer posing as a 15-year-old boy on gay dating app Grindr.On Oct. 19, an employee of the Federal Bureau of Investigation logged onto Grindr while pretending to be a teen boy, and a user called \"Tomm\" wrote a message to that person saying, \"Hey any chance u would hu with an older and chill guy,\" according to an affidavit from a special agent with the Federal Bureau of Investigation that was unsealed on Tuesday.The two discussed getting together in person later in the week, according to the affidavit. On Snapchat, they talked about the sex acts they might perform. \"Tomm\" asked for a photo of the \"boy\" without shorts on, and he also sent the undercover agent a picture of himself naked. The FBI was able to obtain an IP address for \"Tomm\" from Snapchat, as well as an address from Comcast, the affidavit showed.Hartheimer was arrested in Memphis on Oct. 23 for attempted production of child pornography and transfer of obscene material to a minor, according to a warrant.An Evolve spokesperson and Blake Ballin, a lawyer representing Hartheimer, told CNBC on Saturday that Evolve has fired the CEO.\"Bob's family is aware of the charges,\" Ballin wrote in an email. \"His family loves and supports him and requests privacy during this difficult period in their lives. We have no further comment at this time.\"The Wall Street Journal reported on Hartheimer's firing from Evolve Bank on Friday. Evolve said its finance chief, Mark Mosteller, and its general counsel, Joelle Weltzin, will be in charge of the bank's operations, as they were before the bank hired Hartheimer in August.\"We are in close contact with the U.S. Attorney's office and have been assured that this is a personal matter and does not relate to the Bank or its operations in any way,\" the spokesperson wrote in an email.Last year, Evolve was caught up in the bankruptcy of financial technology startup Synapse, which cut off access to a system for handling transactions and account details. Fintech apps such as Yotta worked with Evolve and other banks, with Synapse acting as a middleman.Synapse's method of keeping app users' money in various banks, including Evolve, created accounting problems, and up to $96 million in deposits went missing. Thousands of Americans lost money, CNBC reported.In 2024, Evolve also suffered a cyberattack, during which hackers obtained customer information and demanded a ransom. The bank said it did not pay any ransom and the data was eventually posted online.\"This is a structural change, demonstrating our continued commitment to doing the hard work to earn back the trust of our customers, employees, regulators, and investors,\" Evolve said in an August statement announcing the selection of Hartheimer to replace CEO Scott Stafford, who retired after joining in 2004.The bank touted Hartheimer's experience as director of the Federal Deposit Insurance Corporation's Division of Resolutions, as well as his years as a regulatory consultant for fintech companies.\"Over the past four decades, I've led, turned around, and advised institutions across the financial landscape,\" Hartheimer wrote on his LinkedIn profile. The 100-year-old bank reported net losses for each of the first three quarters of 2025 after being profitable since 2003, according to data on file with the Federal Financial Institutions Examination Council.— CNBC's Dan Mangan and Hugh Son contributed reporting.Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast's planned spinoff of Versant.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Evolve Bank CEO fired after propositioning FBI agent who pretended to be a teen boy",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220325-1762004191924-Hartheimer-mug.png?v=1762004290&w=1920&h=1080"
      ],
      "datePublished": "2025-11-01T21:56:49.000Z",
      "dateModified": "2025-11-01T21:56:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump tariffs could add $40 billion to holiday shoppers' and sellers' costs, LendingTree warns",
    "url": "https://www.cnbc.com/2025/11/02/trump-trade-holiday-shopping-lending-tree-tariffs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108069619-1732905541932-gettyimages-2186822529-a9i00377.jpeg?v=1735235688&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-02T14:18:26.000Z",
    "description": "A person walks down a street with shopping bags in New York City on Nov. 29, 2024.David Dee Delgado | Getty ImagesAmerican consumer wallets will be bi",
    "body": "A person walks down a street with shopping bags in New York City on Nov. 29, 2024.David Dee Delgado | Getty ImagesAmerican consumer wallets will be billions of dollars lighter this holiday season because of President Donald Trump's tariffs, according to LendingTree.Sunday marked six months since Trump announced his broad \"liberation day\" tariffs.Prices for select food and consumer goods rose in the wake of that announcement.And consumers are set to see more of the impact from those tariffs as holiday items that have been stored in warehouses for months are finally hitting store shelves.LendingTree, which operates on an online lending marketplace, used 2024 winter holiday spending data as a reference point for its analysis of the upcoming season.The company estimated that the new tariffs will increase total holiday costs for consumers and retailers by a total of $40.6 billion.Consumers will be on the hook for most of the extra costs from tariffs, an estimated $28.6 billion.That translates to around $132 per shopper.Retailers are expected to eat the remaining $12 billion in extra costs from the tariffs.\"For most Americans, spending an extra $132 at the holidays is significant,\" said Matt Schulz, LendingTree's chief consumer finance analyst.\"While it may not be earth-shattering, it can have a real impact on many families. It could prompt people to cut back on gift-giving this year or lead to them taking on extra debt,\" Schulz said.\"That's a choice no one wants to have to make.\"Retail analysts have told CNBC that retailers expect consumers to buy fewer items this holiday season due to higher costs from tariffs.Schultz agreed, calling it an \"unfortunate reality\" that many consumers will have to face.\"That might mean giving fewer of those items as gifts, or it could mean having to suck up the higher costs to give your loved ones what they want,\" Schulz said.\"I doubt that we'll see a huge drop-off in the amount of electronics and clothes that are gifted this year, simply because they're what so many people want,\" he said. \"However, for some, higher prices may leave them no choice.\"LendingTree estimated that buyers of holiday electronics will see the biggest hit from the tariffs, with an average extra cost of $186 per shopper.Clothing or accessories have the next highest added cost, at $82 per shopper, the company said.Buyers of personal care items, beauty products, and toys will pay $14 more per shopper, and food and candy will cost $12 more per buyer as a result of the tariffs.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump tariffs could add $40 billion to holiday shoppers' and sellers' costs, LendingTree warns",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108069619-1732905541932-gettyimages-2186822529-a9i00377.jpeg?v=1735235688&w=1920&h=1080"
      ],
      "datePublished": "2025-11-02T14:18:26.000Z",
      "dateModified": "2025-11-02T14:18:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft plans to hire more but with 'a lot more leverage' thanks to AI, CEO Satya Nadella says",
    "url": "https://www.cnbc.com/2025/11/01/microsoft-ceo-headcount-leverage-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108139003-1746040294896-gettyimages-2207879673-MICROSOFT_COPILOT.jpeg?v=1762032586&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-01T22:08:30.000Z",
    "description": "Microsoft CEO Satya Nadella speaks during an event commemorating the 50th anniversary of the company at Microsoft headquarters in Redmond, Washington,",
    "body": "Microsoft CEO Satya Nadella speaks during an event commemorating the 50th anniversary of the company at Microsoft headquarters in Redmond, Washington, on April 4, 2025. Microsoft Corp., determined to hold its ground in artificial intelligence, will soon let consumers tailor the Copilot digital assistant to their own needs.David Ryder | Bloomberg | Getty ImagesMicrosoft will expand its employee base once again, CEO Satya Nadella told investor Brad Gerstner on a podcast that aired on Friday.The software maker's workforce didn't budge in the 2025 fiscal year, which ended in June. It stood at 228,000, with multiple rounds of layoffs lowering the total number by at least 6,000. In July, Microsoft let go of another 9,000 workers.\"I will say we will grow our headcount, but the way I look at it is, that headcount we grow will grow with a lot more leverage than the headcount we had pre-AI,\" Nadella said on the BG2 podcast. OpenAI, which has a broad partnership with Microsoft, introduced its ChatGPT assistant in 2022. Microsoft's headcount grew by 22% in the 2022 fiscal year.Employees will figure out how to do their jobs differently, Nadella said, adding that the company wants to ensure they can access artificial intelligence features in Microsoft 365 productivity software and the GitHub Copilot AI coding assistant. Those services draw on AI models from Anthropic and OpenAI.\"It's the unlearning and learning process that I think will take the next year or so, then the headcount growth will come with max leverage,\" he said.A similar adjustment played out at corporations decades ago, Nadella said. To prepare forecasts, inter-office memos would circulate across multiple sites by fax, and then came email and Excel spreadsheets, he said.\"Right now, any planning, any execution, starts with AI. You research with AI, you think with AI, you share with your colleagues and what have you,\" Nadella said.This week, Amazon, which is racing against Microsoft to rent out cloud infrastructure for running AI models, cut 14,000 corporate employees.Amazon's senior vice president of people experience and technology, Beth Galetti, told workers in a memo that \"this generation of AI is the most transformative technology we've seen since the Internet, and it's enabling companies to innovate much faster than ever before (in existing market segments and altogether new ones).\"On the podcast, Nadella talked about a Microsoft executive who deals with networking fiber. As the company ramped up data center operations to meet rising cloud demand, the executive realized she wouldn't be able to hire all the people she thought she needed, and so she built AI agents to handle maintenance, Nadella said.\"That is an example of you, to your point, a team with AI tools being able to get more productivity,\" Nadella told Gerstner, who is founder and CEO of technology investment firm Altimeter Capital.On Wednesday, Microsoft reported 12% year-over-year revenue growth and showed the widest operating margin since 2002.WATCH: Microsoft earnings beat estimates, Azure revenue jumps 40%watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft plans to hire more but with 'a lot more leverage' thanks to AI, CEO Satya Nadella says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108139003-1746040294896-gettyimages-2207879673-MICROSOFT_COPILOT.jpeg?v=1762032586&w=1920&h=1080"
      ],
      "datePublished": "2025-11-01T22:08:30.000Z",
      "dateModified": "2025-11-01T22:08:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Treasury Secretary Bessent says SNAP food benefits could restart by Wednesday",
    "url": "https://www.cnbc.com/2025/11/02/bessent-trump-snap-food-stamps-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108212399-17605379272025-10-15t134447z_658872475_rc2dcha2sdp6_rtrmadp_0_imf-worldbank-bessent.jpeg?v=1760538006&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-02T15:52:38.000Z",
    "description": "U.S. Treasury Secretary Scott Bessent speaks as he and U.S. Trade Representative Jamieson Greer hold a press conference on the sidelines of the IMF/Wo",
    "body": "U.S. Treasury Secretary Scott Bessent speaks as he and U.S. Trade Representative Jamieson Greer hold a press conference on the sidelines of the IMF/World Bank annual meetings in Washington, D.C., U.S., Oct. 15, 2025. Ken Cedeno | ReutersSNAP food benefits could restart as early as Wednesday, Treasury Secretary Scott Bessent said on Sunday morning.Two federal judges in Massachusetts and Rhode Island ruled on Friday that the Trump administration must use emergency funds to pay SNAP benefits, which help feed 42 million Americans, during the government shutdown.  Judge Jack McConnell of Rhode Island also directed that these be paid out of emergency funds \"as soon as possible.\" Boston Judge Indira Talwani gave the administration until Monday to tell her if it will authorize at least reduced SNAP benefits for November.The administration was originally set to cut off the aid on Nov. 1.In an interview on CNN's \"State of the Union,\" Bessent said that the administration would not appeal the court ruling, while adding that finding the funds to pay SNAP benefits by Wednesday \"could be\" done.\"There's a process that has to be followed. So, we've got to figure out what the process is,\" the Treasury secretary said.On Friday, President Donald Trump said in a Truth Social post that the government was exploring its options to restart SNAP.\"I do NOT want Americans to go hungry just because the Radical Democrats refuse to do the right thing and REOPEN THE GOVERNMENT,\" the president wrote. \"Therefore, I have instructed our lawyers to ask the Court to clarify how we can legally fund SNAP as soon as possible.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Treasury Secretary Bessent says SNAP food benefits could restart by Wednesday",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108212399-17605379272025-10-15t134447z_658872475_rc2dcha2sdp6_rtrmadp_0_imf-worldbank-bessent.jpeg?v=1760538006&w=1920&h=1080"
      ],
      "datePublished": "2025-11-02T15:52:38.000Z",
      "dateModified": "2025-11-02T15:52:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berkshire's operating earnings jump 34%, Buffett buys back no stock and raises cash hoard to $381 billion",
    "url": "https://www.cnbc.com/2025/11/01/berkshire-hathaway-brk-earnings-q3-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108140408-1746278498531-untitled-218-82.jpg?v=1746557643&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-01T12:49:38.000Z",
    "description": "Warren Buffett and Greg Abel walkthrough the Berkshire Hathaway Annual Shareholders Meeting in Omaha, Nebraska on May 3, 2025.David A. Grogen | CNBCWa",
    "body": "Warren Buffett and Greg Abel walkthrough the Berkshire Hathaway Annual Shareholders Meeting in Omaha, Nebraska on May 3, 2025.David A. Grogen | CNBCWarren Buffett's Berkshire Hathaway reported a sharp rebound in operating profit on Saturday, while its cash pile swelled to a new high with no buybacks.Berkshire's operating profit generated from the conglomerate's wholly owned businesses including insurance and railroads jumped 34% year over year to $13.485 billion in the third quarter. The gains were driven by a more than 200% surge in insurance underwriting income, which rose to $2.37 billion.Buffett once again refrained from repurchasing shares despite a significant pullback in the stock. The company said there were no share buybacks during the first nine months of 2025. Class A and B shares of the conglomerate are up 5% each in 2025, while the S&P 500 is up 16.3%.Without any buybacks, Berkshire's cash hoard swelled to a record $381.6 billion, surpassing the previous high of $347.7 billion set in the first quarter of this year.Berkshire also didn't find other stocks attractive, net selling equities in the third quarter for a taxable gain of $10.4 billion.Stock Chart IconStock chart iconBerkshire Hathaway class A shares year to dateThe 95-year-old Buffett in May announced he's stepping down as CEO at the year-end after six legendary decades. Greg Abel, Berkshire's vice chairman of non-insurance operations, is set to take over as chief executive, while Buffett will remain chairman of the board. Abel will also start writing annual letters in 2026.The Omaha-based conglomerate's shares have tumbled double digits from all-time highs following the announcement. The sell-off partially reflects the so-called Buffett premium, or the extra price investors are willing to pay because of the billionaire's unmatched record and exceptional capital allocation skills.Last month, Berkshire announced a deal to buy Occidental Petroleum's petrochemical unit, OxyChem, for $9.7 billion in cash. The deal marks Berkshire's largest since 2022, when it paid $11.6 billion for insurer Alleghany.Overall earnings, which include gains from Berkshire's investments in other publicly traded companies, rose 17% to $30.8 billion year on year. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berkshire's operating earnings jump 34%, Buffett buys back no stock and raises cash hoard to $381 billion",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108140408-1746278498531-untitled-218-82.jpg?v=1746557643&w=1920&h=1080"
      ],
      "datePublished": "2025-11-01T12:49:38.000Z",
      "dateModified": "2025-11-01T12:49:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where the Nexperia auto chip crisis stands now as the U.S., China and EU race to contain fallout",
    "url": "https://www.cnbc.com/2025/11/01/where-the-nexperia-auto-chip-crisis-stands-now.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220234-17619405512025-10-23t103823z_1905056082_rc2mhhav54c5_rtrmadp_0_volkswagen-production-chips.jpeg?v=1761940606&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-01T17:58:54.000Z",
    "description": "The logo of Chinese-owned semiconductor company Nexperia is displayed at the chipmaker's German facility, after the Dutch government seized control an",
    "body": "The logo of Chinese-owned semiconductor company Nexperia is displayed at the chipmaker's German facility, after the Dutch government seized control and auto industry bodies sounded the alarm over the possible impact on car production, in Hamburg, Germany, Oct. 23, 2025. Jonas Walzberg | ReutersNetherlands-based chipmaker Nexperia is at the heart of a standoff between the European Union, the U.S. and China that has triggered a near-crisis for global automakers.The Dutch government seized control of Nexperia, owned by the Chinese company Wingtech, in October, citing national security concerns. The move prompted Beijing to block Nexperia products from leaving China.Meetings are underway in Europe Saturday to attempt to defuse the escalating issue, and Chinese and U.S. authorities appear to be opening up a pathway for Nexperia's China-based operations to resume exporting critical automotive chips.Spokespeople for the White House and Nexperia did not immediately respond to a request for comment. For now, however, the auto industry's supply chain still hangs in the balance.The dispute is threatening vehicle production worldwide as automakers warn of looming shortages of the chipmaker's components, which are critical to basic electrical functions in cars and challenging to replace on short notice.The battle has unfolded amid heightened scrutiny of Chinese-linked tech firms from Western governments, including the U.S., which recently tightened export-control rules to limit technology transfers to Chinese-owned entities.Nexperia's owner, Wingtech, was put on a U.S. blacklist in December 2024 for its alleged role \"in aiding China's government's efforts to acquire entities with sensitive semiconductor manufacturing capability.\"Here's what to know about where the dispute stands, and why it matters. Why are Nexperia chips so important?Nexperia manufactures billions of so-called foundation chips — transistors, diodes and power management components — that are produced in Europe, assembled and tested in China, and then re-exported to customers in Europe and elsewhere. Around 70% of chips made in the Netherlands are sent to China to be completed and re-exported to other countries.The chips are basic and inexpensive, but are needed in almost every device that uses electricity. In cars, those chips are used to connect the battery to motors, for lights and sensors, for braking systems, airbag controllers, entertainment systems and electric windows. Nexperia had sales of $2 billion last year.In late October, automakers, such as Volkswagen, Nissan Motor and Mercedes-Benz, sounded the alarm about potential production cuts if Nexperia's chip exports are curtailed for long.While automakers typically have some stockpiles and alternative suppliers, it is difficult to switch supply sources overnight. What happened and where do things stand?In September, the Dutch government invoked a Cold War-era law to effectively take control of Nexperia, amid concerns that its Chinese owner was planning to shift intellectual property to another company it owned. A Dutch court also suspended Nexperia CEO, Wingtech founder Zhang Xuezhen, citing mismanagement.Beijing retaliated weeks later by imposing export controls on certain Nexperia products made in China, escalating tensions and fueling fears of a broader supply chain shock. That prompted the company to tell carmakers it could no longer guarantee supplies.But signs of a breakthrough have started to emerge.On Friday, reports said the U.S. plans to announce that Nexperia will resume sending chips under a framework agreement reached during talks between President Donald Trump and Chinese leader Xi Jinping, citing sources familiar with the matter. And on Saturday, China said it will exempt some Nexperia chips from its export ban. Chinese officials did not specify what those exemptions could entail.\"We will comprehensively consider the actual situation of the enterprise and exempt eligible exports,\" The Chinese Commerce Ministry said in a statement. If finalized, the exemptions could ease immediate pressure on automakers. But the broader dispute over ownership, technology control and security oversight remains unresolved.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where the Nexperia auto chip crisis stands now as the U.S., China and EU race to contain fallout",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220234-17619405512025-10-23t103823z_1905056082_rc2mhhav54c5_rtrmadp_0_volkswagen-production-chips.jpeg?v=1761940606&w=1920&h=1080"
      ],
      "datePublished": "2025-11-01T17:58:54.000Z",
      "dateModified": "2025-11-01T17:58:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Impactive Capital sees a structural shift creating upside for this wastewater company ",
    "url": "https://www.cnbc.com/2025/11/01/impactive-capital-sees-a-structural-shift-creating-upside-for-this-wastewater-company-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220032-1761921555804-gettyimages-2008254880-img_5607--exmr24-018.jpeg?v=1761921587&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-01T11:56:15.000Z",
    "description": "Onuma Inthapong | E+ | Getty ImagesCompany: Advanced Drainage Systems (WMS)Business: Advanced Drainage Systems is a manufacturer of stormwater and ons",
    "body": "Onuma Inthapong | E+ | Getty ImagesCompany: Advanced Drainage Systems (WMS)Business: Advanced Drainage Systems is a manufacturer of stormwater and onsite wastewater solutions. The company and its subsidiary, Infiltrator Water Technologies, provide stormwater drainage and onsite wastewater products used in a wide variety of markets and applications, including commercial, residential, infrastructure and agriculture, while delivering customer service. Its pipe segment manufactures and markets thermoplastic corrugated pipe throughout the United States. Its infiltrator segment is a provider of plastic leachfield chambers and systems, septic tanks and accessories, primarily for use in residential applications. Its international segment manufactures and markets products in regions outside the United States, with a strategy focused on its owned facilities in Canada and those markets serviced through its joint ventures in Mexico and South America. Its Allied Products segment manufactures a range of products which are complementary to their pipe products.Stock Market Value: : $11.98 billion ($144.10 per share)Activist: Impactive CapitalOwnership: 2.14%Average Cost: n/aActivist Commentary: Impactive Capital is an activist hedge fund founded in 2018 by Lauren Taylor Wolfe and Christian Alejandro Asmar. Impactive Capital is an active ESG investor that launched with a $250 million investment from CalSTRS and now has approximately $3 billion. In just seven years, they have made quite a name for themselves as AESG investors. Wolfe and Asmar realized that there was an opportunity to use tools, notably on the social and environmental side, to drive returns. Impactive focuses on positive systemic change to help build more competitive, sustainable businesses for the long run. Impactive will use traditional operational, financial and strategic tools that activists use, but will also implement ESG change that they believe is material to the business and drives profitability of the company and shareholder value. Impactive looks for high quality businesses that are usually complex and mispriced, where they can underwrite a minimum of a high teens or low 20% internal rate of return over a three- to five-year holding period, and have active engagement with management to set up multiple ways to win.What's happeningOn Oct. 21, Impactive said they had taken a position in Advanced Drainage Systems.Behind the scenesAdvanced Drainage Systems is the market share leader in plastic stormwater and onsite septic wastewater management solutions. The company is a pioneer in the development and manufacturing of plastic drainage products, primarily utilizing high-density polyethylene (HDPE) and polypropylene. Recycled materials made up 46% of WMS' purchased inputs in fiscal year 2025, making it one of the largest recyclers in North America. The company has three primary business lines: (i) Pipe - storm and drainage pipe, 56% of FY25 revenue; (ii) Allied Products - complementary products to its pipe offerings like storm chambers, structures and fittings, 26%; and (iii) Infiltrator - chambers, tanks and advanced wastewater treatment solutions, 18%. Between its three segments, the company has a $15 billion addressable market and is the clear industry leader with 75% to 95% market share across its segments.There is a lot to like about WMS, as it is an extremely high-quality and well-run company with a long history of compounding growth and secular tailwinds. As a result, WMS has an impressive track record, having grown earnings per share almost 10x since its initial public offering, and has a 28% EPS compound annual growth rate with returns on invested capital consistently above 20%. Management is also very focused on shareholder value and are great capital allocators, increasing dividends and launching buybacks in most years where it does not see a compelling M&A opportunity. Despite this, the company's share price performance has been lackluster over the past 1- and 3-year periods, underperforming the Russell 2000, and its stock has re-rated down to a P/E multiple in the low-to-mid 20s. The reason for this is twofold: investor fears regarding the cyclicality of construction spending and margin compression. However, Impactive Capital believes that both concerns appear to be overblown or misplaced and that management has built this business to protect its top line from market cyclicality and make margin expansion structural, not cyclical. As to the cyclicality of construction spending, construction spending is down 3% year to date as higher interest rates and affordability concerns have dampened residential and non-residential construction spending, setting this up to be the worst year for construction in the past two decades aside from the global financial crisis. But company revenue has not been declining and is not expected to decline for several reasons. First, plastic pipes have been stealing market share from concrete and steel. Only about 20% of the market in 2010, plastic now exceeds 40% due to it being 20% cheaper than alternatives and offering superior performance. Second, with the 2019 acquisition of Infiltrator and the upcoming acquisition of National Diversified Sales, WMS has increased its exposure to the residential repair and remodel end-market, adding resiliency to its revenue streams. This should also make WMS a natural beneficiary of the reversion in existing home sales, which are currently at a 15-year low. Third, billion-dollar storm events have quintupled since the 1980s, necessitating increased investment in resiliency and more complex stormwater infrastructure. The company also has a wide moat, enabled by its high brand loyalty from contractors, its vertical integration and excellent distribution network. As for margin concerns, there are fears that weakness in construction will lead to margin compression. However, this is something else that management has taken a lot of steps and adopted many initiatives to avoid. Over the past six years, the company has been diversifying its business toward its higher-margin Allied Product and Infiltrator offerings, both of which have adjusted operating margins in the mid-50s, whereas pipe is around 30%. Additionally, one of its largest input costs are oil and resin, and WMS has a unique way to mitigate these costs. The company toggles between recycled and virgin resins depending on the price of oil. So, when oil spikes, they use recycled resin, and when it drops, they switch to virgin resin and capture better margins. WMS is the only one of its competitors who can do this at scale. Moreover, when construction is weak, oil and resin prices tend to decline. So, loss to the top line can be made up on the bottom line as the decline in resin prices is more than enough to offset end-market weaknesses (i.e., construction spending is down about 3% YTD, resin prices are down 15% to 20%). As a result, pipe and Allied Products adjusted EBITDA margins have expanded by about 8 percentage points since 2020, but some fear that this will eventually normalize.However, Impactive believes that this shift is structural, not cyclical and WMS will not only avoid margin compression but could see gross margin expand by 100 bps over the next 12-24 months; something that is not factored into forward consensus estimates.As a result of this confluence of factors, Impactive models that WMS will return to mid-teens EPS growth and projects a base case three-year total return and IRR of 69% and 19%, respectively, and an upside case of 146% and 34%, respectively.Ken Squire is the founder and president of 13D Monitor, an institutional research service on shareholder activism, and the founder and portfolio manager of the 13D Activist Fund, a mutual fund that invests in a portfolio of activist investments.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Impactive Capital sees a structural shift creating upside for this wastewater company ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220032-1761921555804-gettyimages-2008254880-img_5607--exmr24-018.jpeg?v=1761921587&w=1920&h=1080"
      ],
      "datePublished": "2025-11-01T11:56:15.000Z",
      "dateModified": "2025-11-01T11:56:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft AI chief says only biological beings can be conscious",
    "url": "https://www.cnbc.com/2025/11/02/microsoft-ai-chief-mustafa-suleyman-only-biological-beings-can-be-conscious.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107360187-1705498131263-1J7A0183.JPG?v=1710865691&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-02T15:49:05.000Z",
    "description": "Mustafa Suleyman, CEO of Microsoft AI, speaks at an event commemorating the 50th anniversary of the company at Microsoft headquarters in Redmond, Wash",
    "body": "Mustafa Suleyman, CEO of Microsoft AI, speaks at an event commemorating the 50th anniversary of the company at Microsoft headquarters in Redmond, Washington, on April 4, 2025.David Ryder | Bloomberg | Getty ImagesMicrosoft AI chief Mustafa Suleyman says only biological beings are capable of consciousness, and that developers and researchers should stop pursuing projects that suggest otherwise.\"I don't think that is work that people should be doing,\" Suleyman told CNBC in an interview this week at the AfroTech Conference in Houston, where he was among the keynote speakers. \"If you ask the wrong question, you end up with the wrong answer. I think it's totally the wrong question.\"Suleyman, Microsoft's top executive working on artificial intelligence, has been one of the leading voices in the rapidly emerging field to speak out against the prospect of seemingly conscious AI, or AI services that can convince humans they're capable of suffering.In 2023, he co-authored the book \"The Coming Wave,\" which delves into the risks of AI and other emerging technologies. And in August, Suleyman penned an essay titled, \"We must build AI for people; not to be a person.\"It's a controversial topic, as the AI companion market is swiftly growing, with products from companies including Meta and Elon Musk's xAI. And it's a complicated issue as the generative AI market, led by Sam Altman and OpenAI, pushes towards artificial general intelligence (AGI), or AI that can perform intellectual tasks on par with the capabilities of humans.Read more CNBC reporting on AIThis Meta alum has spent 10 months leading OpenAI's nationwide hunt for its Stargate data centersAI Sam Altman and the Sora copyright gamble: 'I hope Nintendo doesn't sue us'Anthropic launches Claude Sonnet 4.5, its latest AI model that's 'more of a colleague'Sam Altman on worries about OpenAI’s $850 billion in planned buildouts: ‘I totally get that’Altman told CNBC's \"Squawk Box\" in August that AGI is \"not a super useful term\" and that what's really happening is models are advancing quickly and that we'll rely on them \"for more and more things.\"For Suleyman, it's particularly important to draw a clear contrast between AI getting smarter and more capable versus its ability to ever have human emotions.\"Our physical experience of pain is something that makes us very sad and feel terrible, but the AI doesn't feel sad when it experiences 'pain,'\" Suleyman said. \"It's a very, very important distinction. It's really just creating the perception, the seeming narrative of experience and of itself and of consciousness, but that is not what it's actually experiencing. Technically you know that because we can see what the model is doing.\"Within the AI field, there's a theory called biological naturalism, proposed by philosopher John Searle, that says consciousness depends on processes of a living brain. \"The reason we give people rights today is because we don't want to harm them, because they suffer. They have a pain network, and they have preferences which involve avoiding pain,\" Suleyman said. \"These models don't have that. It's just a simulation.\"watch nowSuleyman and others have said that the science of detecting consciousness is still in its infancy. He stopped short of saying that others should be prevented from researching the matter, acknowledging that \"different organizations have different missions.\"But Suleyman emphasized how strongly he opposes the idea. \"They're not conscious,\" he said. \"So it would be absurd to pursue research that investigates that question, because they're not and they can't be.\"'Places that we won't go'Suleyman is on a speaking tour, in part to inform the public of the risks of pursuing AI consciousness.Prior to the AfroTech Conference, he spoke last week at the Paley International Council Summit in Silicon Valley. There, Suleyman said that Microsoft will not build chatbots for erotica, a stance that's in conflict with others in the tech industry. Altman announced in October that ChatGPT will allow adult users to engage in erotic conversations, while xAI offers a risque anime companion.\"You can basically buy those services from other companies, so we're making decisions about what places that we won't go,\" Suleyman reiterated at AfroTech. Suleyman joined Microsoft in 2024 after the company paid his startup, Inflection AI, $650 million in a licensing and acquihire deal. He previously co-founded DeepMind and sold it to Google for $400 million over a decade ago.During his Q&A session at AfroTech, Suleyman said he decided to join Microsoft last year in part because of the company's history, stability and vast technological reach. He was also pursued by CEO Satya Nadella.\"The other thing to say is that Microsoft needed to be self-sufficient in AI,\" he said onstage. \"Satya, our CEO, set about on this mission about 18 months ago, to make sure that in house we have the capacity to train our own models end to end with all of our own data, pre training, post training, reasoning, deployment in products. And that was part of bringing on my team.\"Since 2019, Microsoft has been a major investor and cloud partner to OpenAI, and the companies have used their respective strengths to build big AI businesses. But the relationship has shown signs of tension of late, with OpenAI partnering with Microsoft rivals like Google and Oracle, and Microsoft focusing more on its own AI services.Suleyman's concerns about consciousness have gained resonance. In October, California Gov. Gavin Newsom signed SB 243, which requires that chatbots disclose they are AI and tell minors every three hours to \"take a break.\"Last week, Microsoft announced new features for its Copilot AI service, including an AI companion called Mico and the ability to engage with Copilot in group chats with others. Suleyman said Microsoft is building services that are aware that they're AI. \"Quite simply, we're creating AIs that are always working in service of the human,\" he said. There's plenty of room for personality, he added.\"The knowledge is there, and the models are very, very responsive,\" Suleyman said. \"It's on everybody to try and sculpt AI personalities with values that they want to see, they want to use and interact with.\"Suleyman highlighted a feature Microsoft launched last week called real talk, which is a conversation style of Copilot designed to challenge users' perspectives instead of being sycophantic.Suleyman described real talk as sassy and said it had recently roasted him, calling him \"the ultimate bundle of contradictions\" for warning of the dangers of AI in his book while also accelerating its development at Microsoft. \"That was just a magical use case because in some ways I was like, I actually do feel kind of seen by this,\" Suleyman said, noting that AI itself full of contradictions. \"It is both underwhelming in some ways and, at the same time, it's totally magical,\" he said. \"And if you're not afraid by it, you don't really understand it. You should be afraid by it. The fear is healthy. Skepticism is necessary. We don't need unbridled accelerationism.\"WATCH: Microsoft is making money on AI, says Jefferies' Brent Thillwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft AI chief says only biological beings can be conscious",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107360187-1705498131263-1J7A0183.JPG?v=1710865691&w=1920&h=1080"
      ],
      "datePublished": "2025-11-02T15:49:05.000Z",
      "dateModified": "2025-11-02T15:49:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Couple earns $28,000 a month but constantly fights about money: 'Everything for me is a fire'",
    "url": "https://www.cnbc.com/2025/10/31/couple-earns-28000-dollars-a-month-but-constantly-fights-about-money.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108015868-1722631698653-gettyimages-1746936876-20230605-imgl4293.jpeg?v=1761927110&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T19:32:53.000Z",
    "description": "Ellen and Edward earn $28,000 a month, or an annual income of around $336,000 a year — more than triple their home state of Hawaii's median household ",
    "body": "Ellen and Edward earn $28,000 a month, or an annual income of around $336,000 a year — more than triple their home state of Hawaii's median household income.But their high income doesn't prevent the couple from having constant financial disagreements, they told money expert, author and self-made millionaire Ramit Sethi on a recent episode of his Money for Couples podcast. Their last names were not used.Edward is terrified of ever returning to a poor financial situation similar to what he grew up in, while Ellen wants the freedom to reasonably spend their money without asking permission, they said.\"We are pretty financially well-off, and my brain does not compute that,\" Edward said on the podcast. \"Everything for me is a fire. A blown tire that's $200, $300 is a huge deal for me.\"It's not just emergencies, either. Edward oversees the all of couple's finances, and Ellen said she has to get his approval to buy virtually anything, even everyday beauty products or essentials like her prenatal vitamins.\"I feel like every time I ask for anything ... I have to over-explain why I need it for him to say yes,\" Ellen said. \"That constant, 'let me ask,' 'let's see what he says,' 'let me go in detail about why I need it,' is not a good feeling.\"Here's why their disagreements keep happening and Sethi's advice for how to manage money together better.How to manage money as a coupleEllen and Edward aren't bad partners, Sethi said. \"More likely, it's [a] bad structure\" for how they manage their money.The couple understands some basics of setting up a financial system that works for both of them, Sethi said, like the idea that they should have money dedicated to discretionary spending. However, Edward has been including items like prenatal vitamins in Ellen's discretionary spending, which Sethi strongly disagreed with.\"You don't just need a better budget. In fact, you probably don't even need a budget at all,\" Sethi said. \"You need a better system that is built together.\"For both partners to start feeling better about money and hopefully have fewer disagreements going forward, Sethi offered three pieces of advice — and anyone in a similar situation can follow them.1. Encourage your partner to engage with your finances In Edward and Ellen's situation, Edward handles all of the money, while Ellen is hands off. But as spouses and co-parents, both parties need to be treated as equals, Sethi said.Sethi suggests the partner who has more experience with managing the household budget — Edward, in this case — encourage the other to get involved. He recommends telling yourself from \"day one,\" \"I am not going to do this on my own. I want my partner to become good with money.\"2. Talk about money regularlyIn the past, Ellen has avoided money conversations because she felt like her needs were dismissed and she didn't understand where Edward was coming from when he worried about their finances. Having regular money conversations could help them clear up miscommunications going forward and allow both partners to feel empowered to make decisions on how the family spends their money, Sethi said. 3. Find a structure that works for both partnersEllen and Edward's current system, in which Edward approves all of the couple's spending, isn't working for both of them. Sethi suggested they adopt a new structure together. One idea: They could each have \"no-questions-asked money\" along with a joint account and work together to decide how much goes in each, Sethi said.Additionally, they should create some general rules for money in their relationship, such as a no-debt policy or a limit on how long to spend flipping a house, which has been a point of contention in the past.The couple needs to make a more concerted effort to work together and create a shared vision for their money or else they'll \"forever feel resentful, behind, insecure, unworthy, misaligned, sometimes even in danger around your finances,\" Sethi said. \"Money is important,\" he added. \"My wish for you is that you give it the attention and respect that it deserves.\"Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Couple earns $28,000 a month but constantly fights about money: 'Everything for me is a fire'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108015868-1722631698653-gettyimages-1746936876-20230605-imgl4293.jpeg?v=1761927110&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T19:32:53.000Z",
      "dateModified": "2025-10-31T19:32:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]