[
  {
    "title": "Estée Lauder expects $100 million tariff hit to full-year profitability; stock sinks more than 20%",
    "url": "https://www.cnbc.com/2026/02/05/este-lauder-el-tariffs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107144953-1667411401260-gettyimages-1239307569-TPRUDENCIO_220310_ILU_RT_SPUT-196.jpeg?v=1667411749&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T19:44:05.000Z",
    "description": "In this photo illustration the Estee Lauder Companies Inc. logo seen displayed on a smartphone with Estee Lauder Companies Inc. logo in the background",
    "body": "In this photo illustration the Estee Lauder Companies Inc. logo seen displayed on a smartphone with Estee Lauder Companies Inc. logo in the background. Thiago Prudencio | Lightrocket | Getty ImagesEstée Lauder said Thursday it's expecting a $100 million hit to its full-year profitability because of tariff impacts. The beauty company's stock tumbled more than 20% in midday trading.The company is currently in the midst of a turnaround plan, dubbed \"Beauty Reimagined,\" that's expected to cost between $1.2 billion and $1.6 billion and is aimed at revitalizing its growth. In its fiscal second-quarter earnings report on Thursday, the company said it still expects net workforce reductions of 5,800 to 7,000 as part of its restructuring.Estée Lauder said it has been \"actively evaluating developments and mitigation strategies\" to reduce tariff impacts. The company said it has leveraged trade programs, optimized its regional manufacturing footprint and increased supply chain agility, all of which have offset more than half of the expected impacts.The company said it expects tariff headwinds to impact profitability mostly in the second half. It also identified assumed tariff rates in Switzerland, Canada, China, Mexico, the European Union and Japan, where it has a facility, as part of its calculation. Still, Estée Lauder said it continues to monitor the active tariff situations and is working to implement further strategies to offset those costs even more, including \"potential pricing actions.\"The company also said it was raising its fiscal outlook after solid performance in the first half of the year, though it said it would remain cautious about the macroeconomic environment. \"In this pivotal year, Beauty Reimagined has invigorated our business as we execute the biggest operational, leadership, and cultural transformation in our history,\" CEO Stéphane de La Faverie said in a statement. \"On its one-year anniversary, we raise our fiscal 2026 outlook confident in the strength of our turnaround, even as our second half reflects previously-expected headwinds and now-greater consumer-facing investments, as we expect to restore organic sales growth and expand our operating margin for the first time in four years.\"Correction: Stéphane de La Faverie is CEO of Estee Lauder. An earlier version misspelled his name. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Estée Lauder expects $100 million tariff hit to full-year profitability; stock sinks more than 20%",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107144953-1667411401260-gettyimages-1239307569-TPRUDENCIO_220310_ILU_RT_SPUT-196.jpeg?v=1667411749&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T19:44:05.000Z",
      "dateModified": "2026-02-05T19:44:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bob's Discount Furniture rises 2% in NYSE trading debut after pricing at $17 a share",
    "url": "https://www.cnbc.com/2026/02/05/bobs-discount-furniture-bobs-to-start-trading-on-nyse-after-ipo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108262005-1770309980404-BOBS-OB-Photo-20260205-CC-PRESS-14.jpg?v=1770310177&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T19:28:22.000Z",
    "description": "CEO Bill Barton of Bob’s Discount Furniture rings the Opening Bell at the New York Stock Exchange on Feb. 5, 2026. NYSEShares of Bob's Discount Furnit",
    "body": "CEO Bill Barton of Bob’s Discount Furniture rings the Opening Bell at the New York Stock Exchange on Feb. 5, 2026. NYSEShares of Bob's Discount Furniture climbed on the New York Stock Exchange on Thursday after the company priced its initial public offering at $17 per share.That price was within Bob's expected range of $17 to $19 per share and valued the company at about $2.22 billion. The stock, trading on the NYSE under the ticker symbol BOBS, was last up about 2%.The Manchester, Connecticut-based company, which was founded in 1991, has grown to 206 showrooms across 26 states, as of Sept. 28, according to its S-1 filing. It plans to more than double that store count to over 500 locations by 2035, the filing said.In an interview with CNBC, CEO Bill Barton said that even in a slow housing market and during a time when consumers have hesitated to splurge on some big-ticket items, Bob's has seen demand for buying furniture across all incomes. \"People still need furniture, but in challenging times they are often looking for good value and we are the value leader,\" he said.Many of its customers are motivated by life changes, such as setting up a new apartment, buying a home, having a child or downsizing for retirement, he said.Barton said Bob's has seen more significant customer gains among higher-income households in recent years. About 27% of its customers have an annual household income of more than $150,000, and that part of the customer base is growing the fastest. He said that group is up by about 3% as a share of Bob's shoppers in the past two years.About half of its customers have an annual household income of more than $100,000, he said.Bob's is known for selling lower-priced couches, rugs, dining room tables and other furniture. It has an average order value of about $1,400 per transaction, excluding sales at its outlets, according to its S-1 filing. The retailer estimates its prices are on average about 10% lower than its value-focused furniture competitors' lowest promoted prices or about 20% to 25% below their listed prices.To keep prices low, the company said it relies on a \"curated merchandising strategy, longstanding sourcing relationships and efficient supply chain,\" according to the filing. It carries roughly one-third fewer items than value-oriented competitors, but orders in larger quantities, the filing said.It's also tried to stand apart from other furniture retailers with quicker deliveries. Instead of customers waiting for weeks or months, most purchases can be delivered in as few as three days, the company said in the filing. With its new locations, Bob's plans to add to both existing and new markets, Chief Financial Officer Carl Lukach told CNBC. It plans to open stores in regions where it already has high density, such as in the Midwest and the New England area, but also expand to new states this year, including South Carolina and Tennessee. Initial public offerings in the U.S. are expected to gain momentum this year, as waning inflation and interest rate cuts are expected to nudge late-stage private companies off the sidelines, according to a report by consulting firm PwC. They'll build on a decent past year for IPOs, too. Traditional IPOs raised $33.6 billion in 2025, which represented the best year since 2021.This year, IPO activity may be led by artificial intelligence infrastructure, insurance and specialty risk companies, and AI-enabled software platforms, according to PwC. Industrials and manufacturing, including reshoring, aerospace and defense, and energy or grid-related infrastructure have gotten higher interest, too.One of the widely anticipated IPOs this year is of Elon Musk's company SpaceX. News of the potential IPO broke in December and Musk called reports about the planned offering \"accurate.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bob's Discount Furniture rises 2% in NYSE trading debut after pricing at $17 a share",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108262005-1770309980404-BOBS-OB-Photo-20260205-CC-PRESS-14.jpg?v=1770310177&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T19:28:22.000Z",
      "dateModified": "2026-02-05T19:28:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Peloton shares plunge more than 20% on weak holiday quarter, sluggish demand for splashy new products",
    "url": "https://www.cnbc.com/2026/02/05/peloton-pton-earnings-q2-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107327243-1698864973814-gettyimages-1757875748-PELOTON_EARNS.jpeg?v=1770291808&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T17:18:29.000Z",
    "description": "A Peloton Bike inside a showroom in New York, US, on Wednesday, Nov. 1, 2023. Peloton Interactive Inc. is scheduled to release earnings figures on Nov",
    "body": "A Peloton Bike inside a showroom in New York, US, on Wednesday, Nov. 1, 2023. Peloton Interactive Inc. is scheduled to release earnings figures on November 2.Michael Nagle | Bloomberg | Getty ImagesPeloton posted a worse-than-expected holiday quarter on Thursday after shoppers failed to shell out for its new AI-driven product line and turned away from higher subscription prices, sending shares down more than 20% in early trading. The connected fitness company missed Wall Street's estimates on the top and bottom lines and fell short of its own internal sales targets in the three months ended Dec. 31 – typically the strongest for Peloton's hardware revenue. The company said it expects sluggish sales to continue in the current quarter. Peloton forecasts revenue between $605 million and $625 million, below expectations of $638 million, according to LSEG. The weak results, coupled with soft guidance, are the first clues investors have that Peloton's product overhaul may not be the sales driver the company hoped it would be. The revamped assortment, which came with artificial intelligence-powered tracking cameras, speakers, 360-degree swivel screens and hands-free control, was designed to grow sales and bring in new customers. But Peloton's results show demand has been sluggish. \"I will not be satisfied until this company is back to healthy, sustained top line growth,\" CEO Peter Stern said on a call with analysts. He said the company has seen improvement in the sense that its revenue declines are getting less steep, but he acknowledged that is \"not enough.\"While Peloton's top line might be disappointing to investors, the company is still making gains in improving its profitability. Over the holiday quarter, the company generated $81 million in adjusted earnings before interest, taxes, depreciation and amortization, better than the $73 million analysts had expected, according to StreetAccount. After it announced plans to lay off 11% of its staff last week, the company expects to generate between $120 million and $135 million in adjusted EBITDA in the current quarter, better than the $119 million analysts had expected, according to StreetAccount.It raised its full-year adjusted EBITDA guidance to between $450 million and $500 million, up from a prior range of between $425 million and $475 million. That's welcome news to investors because it shows Peloton was able to innovate its product line without draining profitability. Also on Thursday, the company announced CFO Liz Coddington is leaving Peloton to \"pursue an opportunity outside the industry.\" She's staying on through March as the company searches for its next finance chief.Here's how Peloton did in its fiscal second quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:Loss per share: 9 cents vs. 6 cents expectedRevenue: $657 million vs. $674 million expectedThe company's net loss for the quarter was $38.8 million, or 9 cents per share, a significant improvement from the $92 million, or 24 cents per share, it lost in the year ago period. Sales fell to $656.5 million, down about 3% from $673.9 million a year earlier.Since Peter Stern took over as Peloton's CEO, he's worked to generate new revenue streams and build on the company's progress of improving its profitability. The revamped product assortment was one of his first big moments as CEO and included new prices for both subscriptions and hardware. Despite higher prices, revenue for both hardware and subscription came in lower than expected, indicating unit sales have been weak. Hardware sales drove $244 million in revenue during the quarter while subscriptions saw $413 million in sales, both below expectations of $253 million and $424 million, respectively, according to StreetAccount. Part of the issue was Peloton had expected more of its current members to swap out their old hardware. \"We simply overestimated the rate with which existing members would want to upgrade their existing equipment to new equipment. The only historical data point we had as a company on this was when we launched Bike Plus a few years ago, and that was a really fundamental reinvention of the entire frame of the Bike,\" said Stern. \"And so we did not, as it turns out, see the same rate of upgrade from existing members.\" Looking ahead, investors want to see if Stern can bring the company back to growth now that expenses have stabilized and profitability is improving. In an economy where value is more important than ever, it's been tough to convince shoppers to spend thousands on stationary bikes and treadmills. One glimmer could be the company's growing commercial business unit, which includes commercial versions of its Bike+, Tread+ and Row+ that will be marketed to places that have small gyms, like hotels, apartment buildings, corporate wellness centers and country clubs. During the quarter, revenue in Peloton's commercial business unit was up 10%.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Peloton shares plunge more than 20% on weak holiday quarter, sluggish demand for splashy new products",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107327243-1698864973814-gettyimages-1757875748-PELOTON_EARNS.jpeg?v=1770291808&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T17:18:29.000Z",
      "dateModified": "2026-02-05T17:18:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Corporate DEI index sees 65% drop in participation from Fortune 500 companies",
    "url": "https://www.cnbc.com/2026/02/04/corporate-dei-index-hrc.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108071288-1733330890976-gettyimages-2187618148-AFP_36PF8JQ.jpeg?v=1733330976&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T20:43:56.000Z",
    "description": "People hold flags outside the US Supreme Court on December 4, 2024 in Washington, DC, during oral argument on whether states can ban certain gender tr",
    "body": "People hold flags outside the US Supreme Court on December 4, 2024 in Washington, DC, during oral argument on whether states can ban certain gender transition medical treatments for young people. Roberto Schmidt | AFP | Getty ImagesNew research from the LGBTQ+ group Human Rights Campaign showed a drastic drop in Fortune 500 companies willing to publicly disclose their diversity, equity and inclusion practices.The HRC's 2026 Corporate Equality Index saw a 65% drop in participation this year, falling from 377 Fortune 500 companies in 2025 to just 131 companies in 2026. HRC noted many of the companies that dropped out hold federal contracts.\"Our research shows the strength and the strain of this moment on LGBTQ+ workers, consumers and the companies that count on us,\" HRC President Kelley Robinson said in a statement.Of the 1,450 companies that participated, 534 earned a score of 100, representing nearly 6 million U.S. employees, according to HRC. HRC's index launched in 2002 and rates companies based on their social responsibility and equity in the workplace.Over the past two years, the anti-DEI movement, championed by the White House, began to reframe the index, making it a conservative target.The Corporate Equality Index has increasingly seen more companies exiting its orbit, beginning with Tractor Supply and including big names like Walmart, Ford and Lowe's. Walmart, the largest U.S. retailer and grocer, said it had conversations with conservative activist Robby Starbuck, who has publicly advocated for a shift away from DEI, before the company pulled out.It was a significant change from years prior, when companies like Ford and Walmart issued public statements supporting DEI and touting their achievements in their workplaces.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Corporate DEI index sees 65% drop in participation from Fortune 500 companies",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108071288-1733330890976-gettyimages-2187618148-AFP_36PF8JQ.jpeg?v=1733330976&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T20:43:56.000Z",
      "dateModified": "2026-02-04T20:43:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kalshi expands surveillance, enforcement efforts ahead of Super Bowl 60",
    "url": "https://www.cnbc.com/2026/02/05/kalshi-expands-surveillance-enforcement-efforts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108141257-1746480026270-gettyimages-2198224769-CRYPTOCOM_KALSHI.jpeg?v=1770309102&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T16:51:40.000Z",
    "description": "Gabby Jones | Bloomberg | Getty ImagesKalshi on Thursday announced efforts to expand its surveillance and enforcement frameworks as skepticism builds ",
    "body": "Gabby Jones | Bloomberg | Getty ImagesKalshi on Thursday announced efforts to expand its surveillance and enforcement frameworks as skepticism builds around the booming prediction market industry. The announcement comes days before Super Bowl 60, which has already drawn more than $160 million in prediction market trading volume, according to Kalshi. The platform and its peers allow users to buy event contracts for outcomes in politics, pop culture, financial markets and sports. Prediction trades on predetermined outcomes — for example, on which companies will air Super Bowl ads on Sunday — have prompted questions of possible insider trading. New York Attorney General Letitia James on Monday issued a warning about what she called \"unregulated prediction markets.\" \"Being federally regulated means that Kalshi bans market manipulation, insider trading, has limits on the types of markets it lists, runs Know-Your-Customer (KYC) and Anti-Money Laundering (AML) checks on every user before they can trade, and publicly reports all trades to the CFTC daily,\" the company said in a release. \"Kalshi also spent years building custom prediction market trade surveillance and enforcement systems that are similar to those used in the stock market.\"Kalshi said Thursday it has taken further steps, forming an independent surveillance advisory committee, which will provide quarterly analysis to the company's outside counsel and publish statistics on investigations into suspicious activity on its platform. The company also announced surveillance partnerships with Solidus Labs and the director of the Wharton Forensic Analytics Lab.The prediction market will also now work with a former undersecretary of the Treasury for terrorism and financial intelligence to advise Kalshi on \"market integrity, trading surveillance and financial compliance matters.\" Kalshi lawyer Robert DeNault has been appointed to the role of head of enforcement, where he will work with the advisory committee to identify insider trading and market manipulation, the company said.Kalshi said it has also created hubs on its website to provide resources for consumers on responsible trading and market integrity.In a post on X, CEO Tarek Mansour said if the company finds any wrongdoing, the penalties include fines and referrals to the Commodity Futures Trading Commission — which regulates event contracts in the U.S. — and the Department of Justice for prosecution. \"In the past year, we ran over 200 investigations and froze relevant accounts,\" Mansour wrote. \"Of these, over a dozen have become active cases and several have been referred to law enforcement.\"Mansour said Kalshi has based its market surveillance system on those used by the New York Stock Exchange and the Nasdaq, flagging suspicious behavior by running trades through pattern recognition models. \"All industries have bad actors and no system is perfect, Kalshi's included,\" Mansour wrote. \"But we are committed to improving daily. Lots of work ahead!\"Disclosure: CNBC and Kalshi have a commercial relationship that includes customer acquisition and a minority investment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kalshi expands surveillance, enforcement efforts ahead of Super Bowl 60",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108141257-1746480026270-gettyimages-2198224769-CRYPTOCOM_KALSHI.jpeg?v=1770309102&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T16:51:40.000Z",
      "dateModified": "2026-02-05T16:51:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hillary Clinton wants testimony on Jeffrey Epstein in public: 'Let's stop the games'",
    "url": "https://www.cnbc.com/2026/02/05/jeffrey-epstein-hillary-clinton-public-hearing-congress.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108260481-1770075484026-108260481-17700753502025-01-20t185718z_1619722364_rc2sdcaq4kwk_rtrmadp_0_usa-trump-inauguration.jpeg?v=1770075638&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T20:00:03.000Z",
    "description": "Former President Bill Clinton and former Secretary of State Hillary Clinton arrive ahead of the 60th inaugural ceremony on Jan. 20, 2025, at the US Ca",
    "body": "Former President Bill Clinton and former Secretary of State Hillary Clinton arrive ahead of the 60th inaugural ceremony on Jan. 20, 2025, at the US Capitol in Washington, DC.Melina Mara | Via ReutersFormer Secretary of State Hillary Clinton on Thursday challenged Republicans on the House Oversight Committee to take the testimony of her and former President Bill Clinton about sex offender Jeffrey Epstein in public and not in a closed session as those lawmakers plan.Hillary Clinton made the demand after she and Bill Clinton dropped their efforts to resist subpoenas to testify before that committee, whose Republican leadership had threatened a vote on holding them in contempt of Congress if they refused to appear.\"For six months, we engaged Republicans on the Oversight Committee in good faith,\" Hillary Clinton said in a post on X. \"We told them what we know, under oath. They ignored all of it. They moved the goalposts and turned accountability into an exercise in distraction.\"\"So let's stop the games. If you want this fight, @RepJamesComer, let's have it — in public,\" Clinton wrote, naming the panel's chairman. \"You love to talk about transparency. There's nothing more transparent than a public hearing, cameras on.\"House Oversight Committee Chairman James Comer, R-Ky., told reporters on Tuesday that the Clintons would not be \"treated differently than everyone else,\" and said the subpoenas for them called for depositions to be taken by the committee, not for a public hearing.\"If they get through the depositions and they still want a public hearing, we'll try to do something,\" Comer said that day.A spokeswoman for the Oversight Committee, in a statement Thursday to CNBC when asked about Hillary Clinton's X post, said, \"The Clintons are going to Clinton and try to spin the facts since no one is buying their claims. The only ones moving the goalposts are, as usual, the Clintons and their attorneys.\"\"The Clintons were issued bipartisan subpoenas for depositions — not a hearing. Republicans and Democrats on the Oversight Committee voted to recommend the House hold the Clintons in contempt of Congress for defying duly issued subpoenas for six months,\" the statement said.\"In the wake of facing contempt of Congress proceedings, the Clintons' attorney finally agreed to filmed, transcribed depositions on February 26 and 27,\" the spokeswoman said.\"These depositions are in accordance with House and Committee rules. All witnesses appearing for interviews as part of our Epstein investigation are being treated fairly and consistently. The Committee has filmed interviews with all witnesses, including former U.S. Attorney General Bill Barr and U.S. Labor Secretary Alex Acosta — both of whom are Republican witnesses.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hillary Clinton wants testimony on Jeffrey Epstein in public: 'Let's stop the games'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108260481-1770075484026-108260481-17700753502025-01-20t185718z_1619722364_rc2sdcaq4kwk_rtrmadp_0_usa-trump-inauguration.jpeg?v=1770075638&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T20:00:03.000Z",
      "dateModified": "2026-02-05T20:00:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Novo Nordisk says it will take legal action after Hims & Hers reveals $49 copy of Wegovy pill",
    "url": "https://www.cnbc.com/2026/02/05/eli-lilly-novo-nordisk-stock-wegovy-hims-hers-pill.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261298-17702146372026-02-04t141023z_346821360_rc20fjakic3w_rtrmadp_0_novo-nordisk-results.jpeg?v=1770311641&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T19:35:54.000Z",
    "description": "The logo of pharmaceutical company Novo Nordisk is displayed in front of its offices in Bagsvaerd, Copenhagen, Denmark, Feb. 4, 2026.Tom Little | Reut",
    "body": "The logo of pharmaceutical company Novo Nordisk is displayed in front of its offices in Bagsvaerd, Copenhagen, Denmark, Feb. 4, 2026.Tom Little | ReutersNovo Nordisk said Thursday it will take legal action against Hims & Hers after the telehealth provider announced it would launch a cheaper copycat version of Novo's Wegovy weight loss pill.\"The action by Hims & Hers is illegal mass compounding that poses a significant risk to patient safety,\" Novo said in a statement. \"Novo Nordisk will take legal and regulatory action to protect patients, our intellectual property and the integrity of the US gold-standard drug approval framework. \"This is another example of Hims & Hers' historic behaviour of duping the American public with knock-off GLP-1 products, and the FDA has previously warned them about their deceptive advertising of GLP-1 knock-offs,\" the statement said. Shares of Novo Nordisk as well as rival Eli Lilly each fell roughly 7% after Hims announced the cheaper Wegovy copy for $49, far less than the $149 Novo sells the branded pill for. Hims stock initially spiked on the announcement, but pared gains after Novo said it would fight the rollout. Novo launched its Wegovy pill in the U.S. in early January, and CEO Mike Doustdar told CNBC on Wednesday that 170,000 people were already taking the medication. Hims & Hers had previously been offering compounded semaglutide, the active ingredient in Novo's blockbuster drugs Ozempic and Wegovy, in an injectable format, and is now extending the offering to include the oral version. Hims said the Wegovy pill copy would cost $49 for the first month and $99 thereafter with a 5-month plan.Semaglutide's patent is protected in the U.S. until 2032, but Hims says its copies are \"personalized,\" and therefore legal.\"This compounded product uses a different formulation and delivery system than FDA-approved oral semaglutide,\" Hims said.\"This once-a-day pill has the same active ingredient as Wegovy and empowers providers to tailor treatment plans specifically for those who prefer to avoid needles or need smaller doses to help to balance side-effects,\" it said. Novo highlighted that it manufactures its Wegovy pill using so-called SNAC technology, which facilitates absorption when administered orally. It's not clear exactly how Hims' copy formula could match the level of absorption.As recently as last year, Novo and Hims partnered to offer discounted weight loss jabs to the telehealth company's customers. Novo, however, ended the collaboration just two months later and said Hims used \"deceptive\" marketing that put patient safety at risk.Lilly doesn't yet have an oral GLP-1 option on the market but is expected to launch a rival pill, orforglipron, in the first half of this year, pending Food and Drug Administration approval.\"With the ... current legal backdrop, there is no reason why HIMS shouldn't evaluate these launches for every subsequent weight loss product as the market continues to evolve,\" Leerink analyst Michael Cherny said in a note to clients. Eli Lilly didn't immediately respond to a request for comment.Mounting challengesThursday's news from Hims adds to the pressure Novo has been facing over the past year. In 2025, the stock fell nearly 50% in its worst year ever as investors lost confidence in the Danish drugmaker's ability to keep sales growing amid ever-increasing competition. Shares are down another 15% year to date.Stock Chart IconStock chart iconNovo Nordisk shares have trailed Eli Lilly stock over the past year. Hims' announcement comes days after Novo forecast sales and profits declining between 5% and 13% in 2026, mainly due to pricing pressures in the U.S. and loss of exclusivity for semaglutide in certain markets outside of the U.S., like Canada and China, this year.In contrast, Lilly sees sales growing by about 25% this year.Doustdar explained Novo's worse-than-expected outlook as an indication that things will get worse before they get better. \"We are creating affordability for the patients, millions of patients that are right now in need of GLP-1 products but simply could not afford it. To do that short term, you have to take a headwind. But of course, there's a very long tail wind for years to come,\" he told CNBC. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Novo Nordisk says it will take legal action after Hims & Hers reveals $49 copy of Wegovy pill",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261298-17702146372026-02-04t141023z_346821360_rc20fjakic3w_rtrmadp_0_novo-nordisk-results.jpeg?v=1770311641&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T19:35:54.000Z",
      "dateModified": "2026-02-05T19:35:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paul Weiss Chairman Brad Karp resigns after Jeffrey Epstein email disclosures",
    "url": "https://www.cnbc.com/2026/02/05/paul-weiss-brad-karp-resigns-jeffrey-epstein.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261749-1770309742817-108261749-1770268060081-gettyimages-2245235017-_ll_5199_kimzemnh.jpeg?v=1770309767&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T13:07:38.000Z",
    "description": "Brad Karp attends the Paley Museum's 50th anniversary celebration at the Paley Museum on Nov. 5, 2025 in New York City.John Lamparski | Getty Images E",
    "body": "Brad Karp attends the Paley Museum's 50th anniversary celebration at the Paley Museum on Nov. 5, 2025 in New York City.John Lamparski | Getty Images Entertainment | Getty ImagesBrad Karp, chairman of the major corporate law firm Paul Weiss, resigned that post on Wednesday after fallout over emails between him and notorious sex offender Jeffrey Epstein were made public.\"Leading Paul, Weiss for the past 18 years has been the honor of my professional life,\" Karp said in a statement. \"Recent reporting has created a distraction and has placed a focus on me that is not in the best interests of the firm.\"Karp, who was appointed chairman in 2008, will remain at the firm, where he \"will continue to focus his full-time attention to client service,\" Paul Weiss said in a statement.Scott Barshay, who had been chair of Paul Weiss' corporate department, was appointed chairman of the firm, effective immediately, according to the firm.Karp had been at Paul Weiss for more than four decades.His resignation as chairman comes two days after the firm said \"Mr. Karp attended two group dinners in New York City and had a small number of social interactions by email\" with Epstein, \"all of which he regrets.\"The emails were among millions of documents related to Epstein that were released last week by the Department of Justice.Bloomberg reported that one email from Karp asked Epstein for help securing a job for Karp's son on a Woody Allen movie.Paul Weiss, in response to that Bloomberg article, had said, \"Paul Weiss was retained by Leon Black, then the CEO of the firm's longtime client Apollo, to negotiate a series of fee disputes with Jeffrey Epstein that spanned several years.\"\"The firm was adverse to Epstein, and at no point did Paul Weiss or Brad Karp ever represent him,\" the firm said.The firm's new chairman, Barshay, in a statement Wednesday, said Karp made \"immense contributions\" during his tenure.\"As Chairman of the firm, he transformed Paul, Weiss in an unprecedented way to the great benefit of our clients,\" Barshay said. \"We are grateful to him for his extraordinary dedication and service over his many years as Chairman.\"Karp last March signed off on a controversial agreement to provide $40 million worth of legal work, at no charge, for causes supported by President Donald Trump. The president, in turn, rescinded an executive order he previously issued targeting the firm.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paul Weiss Chairman Brad Karp resigns after Jeffrey Epstein email disclosures",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261749-1770309742817-108261749-1770268060081-gettyimages-2245235017-_ll_5199_kimzemnh.jpeg?v=1770309767&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T13:07:38.000Z",
      "dateModified": "2026-02-05T13:07:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google parent Alphabet shares fall 5% after earnings beat. Here's what's happening ",
    "url": "https://www.cnbc.com/2026/02/05/alphabet-earnings-share-price-google-beat-artifical-intelligence.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108175923-1753295096870-gettyimages-2217999388-BLOOMBERG_TECH.jpeg?v=1770286533&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T15:33:30.000Z",
    "description": "watch nowAlphabet's shares fell 5% on Thursday after the company beat Wall Street's expectations on earnings and revenue, with artificial intelligence",
    "body": "watch nowAlphabet's shares fell 5% on Thursday after the company beat Wall Street's expectations on earnings and revenue, with artificial intelligence spending projected to increase hugely this year. The Google parent closed nearly 2% lower on Wednesday. After the bell, Alphabet reported fourth-quarter revenue of $113.83 billion, above the $111.43 billion estimate from analysts polled by LSEG.Its Google Cloud division had $17.66 billion in revenue versus a forecast of $16.18 billion, according to StreetAccount. YouTube Advertising posted $11.38 billion in revenue versus the estimated $11.84 billion. The tech giant said it would significantly increase its 2026 capital expenditure to between $175 billion and $185 billion — more than double its 2025 spend. A significant portion of capex spending would go toward investing in AI compute capacity for Google DeepMind.What analysts are sayingBarclays analysts said in a note Thursday that Infrastructure, DeepMind and Waymo costs \"weighed on overall Alphabet profitability,\" and will continue to do so in 2026. \"Cloud's growth is astonishing, measured by any metric: revenue, backlog, API tokens inferenced, enterprise adoption of Gemini. These metrics combined with DeepMind's progress on the model side, starts to justify the 100% increase in capex in '26,\" they said. \"The AI story is getting better while Search is accelerating - that's the most important take for GOOG,\" they added.Deutsche Bank analysts said in a note Thursday that Alphabet has \"stunned the world\" with its huge capex spending plan. \"With tech in a current state of flux, it's not clear whether that's a good or a bad thing,\" they wrote.Correction: This story has been updated to correct that Alphabet shares were down on Thursday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google parent Alphabet shares fall 5% after earnings beat. Here's what's happening ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108175923-1753295096870-gettyimages-2217999388-BLOOMBERG_TECH.jpeg?v=1770286533&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T15:33:30.000Z",
      "dateModified": "2026-02-05T15:33:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cheaper tequila and canned cocktails were the only bright spots for booze during a rough 2025",
    "url": "https://www.cnbc.com/2026/02/05/tequila-canned-cocktails-top-selling-liquors-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261842-1770295724004-gettyimages-1922423647-dsc_2390_4nhe8rnt.jpeg?v=1770315573&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T19:32:27.000Z",
    "description": "Various cans of alcoholic ready-to-drink beverages, including Captain Morgan's rum and cola; Bacardi's mango mojito; Archers' schnapps and lemonade; M",
    "body": "Various cans of alcoholic ready-to-drink beverages, including Captain Morgan's rum and cola; Bacardi's mango mojito; Archers' schnapps and lemonade; Malibu's pineapple and piña colada cocktails; and Gordon's gin and tonic cocktails, are displayed for sale in a supermarket on Jan. 10, 2024.John Keeble | Getty ImagesThe U.S. alcohol industry had another sobering year in 2025.Spirits supplier revenue fell 2.2% to $36.4 billion for the year, according to new data by industry trade group the Distilled Spirits Council of the United States, or Discus. The decline came as economic pressure and weaker consumer confidence weighed on discretionary spending.\"While total U.S. spirits sales edged down 2.2% in 2025, the spirits industry remains resilient,\" said Chris Swonger, Discus CEO and president, in a statement.Overall volumes for the year rose 1.9% to 318.1 million 9-liter cases, indicating growing demand. But the revenue decline suggests that while Americans are still drinking, they are also trading down — opting for lower-priced spirits and pulling back on premium purchases.Nearly every major spirits category posted revenue declines. Vodka sales fell 3% to $7 billion. Sales of tequila and mezcal — the industry's fastest-growing segment for several years now — slipped 4.1% to $6.4 billion. American whiskey and cordials revenue dipped 0.9% and 3.2%, respectively.The exception was in convenience and value.Last call for optimismSales of premixed cocktails, including spirits-based ready-to-drink beverages, surged over 16% compared to the year prior, reaching $3.8 billion. The category, known as RTD, has more than doubled its market share since 2021 as consumers gravitate toward a lower price point.Within tequila, the shift has also been toward more affordable bottles, as macro headwinds make consumers rethink splurges on premium brands. Volume in the lowest tequila/mezcal price point the trade group tracks grew 6.5% in 2025, along with a 2.8% climb in the next tier higher. Volume for whiskey, vodka, rum and gin all fell at those price points.As consumers move toward more-affordable spirits, companies like Diageo and Brown-Forman may be best positioned, as they have the most exposure to lower-priced tequila and the fast-growing RTD category. Diageo owns Casamigos tequila and has built out a sizable portfolio of spirit-based RTDs, while Brown-Forman controls key mixed-price tequila brands like El Jimador. On the other hand, beer-heavy players like AB InBev and Molson Coors have minimal tequila exposure, although they have been expanding their RTD portfolios. Modelo and Corona owner Constellation Brands is in a unique position with both beer and tequila exposure, but a smaller RTD footprint. Overall, the beverage alcohol market has softened after years of pandemic-fueled growth, and Discus' new data reinforces that normalization is now turning into contraction.\"The companies that have started to report are posting weak numbers but no worse than expected,\" said Trevor Stirling, Bernstein European and American beverages analyst. \"The rate of decline is not getting worse, might be slowing and one can dream of a return to volume growth.\"Lingering trade tensionsDistillers have also been navigating headwinds abroad. American spirits exports fell 9% year over year in the second quarter of 2025, amid lingering trade tensions and the removal of U.S. products from many Canadian retail shelves following President Donald Trump's tariff hikes on the U.S. neighbor last year.Industry leaders say tariff uncertainty is making it difficult to plan long term. \"The unpredictability surrounding global trade issues continues to weigh heavily on the U.S. spirits sector,\"  Swonger said. \"Reinstating zero-for-zero tariffs on distilled spirits must be a priority to get our American distillers back on a path to growth and prosperity.\"Despite the revenue pullback, spirits actually maintained its market share lead of the total beverage alcohol market at 42.4%, compared to beer and wine at 41.8% and 15.7%, respectively. Still, the message from 2025 is clear: Consumers are drinking less, but those who are still drinking are being more selective. In a tougher economic environment, cheaper tequila and canned cocktails are winning out over premium bottles behind the bar. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cheaper tequila and canned cocktails were the only bright spots for booze during a rough 2025",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261842-1770295724004-gettyimages-1922423647-dsc_2390_4nhe8rnt.jpeg?v=1770315573&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T19:32:27.000Z",
      "dateModified": "2026-02-05T19:32:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sweden’s Volvo Cars fell over 22% in its worst trading day ever. Here’s why",
    "url": "https://www.cnbc.com/2026/02/05/volvo-cars-shares-autos-tariffs-profit.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107335503-1700212059373-gettyimages-1749111487-widak-carmanuf231026_npdRh.jpeg?v=1770279601&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T17:05:49.000Z",
    "description": "This photograph shows a partial view of a Volvo X30 electric car with the company logo at the Volvo factory in Ghent on April 25, 2025. This factory w",
    "body": "This photograph shows a partial view of a Volvo X30 electric car with the company logo at the Volvo factory in Ghent on April 25, 2025. This factory will produce the Volvo X30 100% electric model for the European market.   Nicolas Tucat | Afp | Getty ImagesShares of Sweden's Volvo Cars tumbled more than 22.5% on Thursday, with the company recording its worst trading day ever.The automaker, which is owned by China's Geely Holding, posted a substantial drop in fourth-quarter operating profit, citing the impact of U.S. tariffs, negative currency effects and weak demand, before Thursday's opening bell.Volvo Cars said fourth-quarter operating income excluding items affecting comparability came in at 1.8 billion Swedish krona ($200.46 million), reflecting a 68% drop compared to the same period a year prior. \"We have a very challenging market, especially in China, very tough competition. All of our European colleagues have the same problem,\" Volvo Cars CEO Hakan Samuelsson told CNBC's \"Europe Early Edition\" on Thursday.He added the discontinuation of EV incentives in the U.S. and China were also contributing to \"a very challenging external environment.\"\"But internally we have had very good work done with lowering our costs and securing a positive cash flow, so that I would highlight as the most important positive things that we have reached during the year,\" he added.watch nowShares of Volvo Cars lost 22.5%, having been down more than 28% earlier in the day. Its previous worst single-session fall was 11.1%.Analysts at UBS said that based on Volvo Cars' profit miss, they anticipate 10%-15% downgrades to full-year 2026 consensus earnings before interest and taxes (EBIT), \"possibly more given the underlying EBIT margin was close to 0%\" in the final three months of 2025.A tough year aheadThe U.S. and EU agreed to a framework trade deal in July last year, one which saw the Trump administration impose a blanket tariff of 15% on most EU goods, a significant reduction from Trump's threat of 30% and almost halving the tariff rate on Europe's auto sector from 27.5%.Industry groups, which tentatively welcomed the trade deal at the time, expressed deep concern about the costs associated with the new tariffs.Volvo Cars has long been considered one of the most exposed European carmakers to U.S. tariffs.Looking ahead, Volvo Cars said deliveries of its new and fully electric EX60 mid-size SUV will ramp up during the second half of the year. However, it warned that 2026 is likely to be another challenging one, with continued pricing pressure, tariff effects, regulatory uncertainty and softer consumer sentiment likely to weigh on the industry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sweden’s Volvo Cars fell over 22% in its worst trading day ever. Here’s why",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107335503-1700212059373-gettyimages-1749111487-widak-carmanuf231026_npdRh.jpeg?v=1770279601&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T17:05:49.000Z",
      "dateModified": "2026-02-05T17:05:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World's largest jeweler jumps as CEO says firm wants to pivot from silver",
    "url": "https://www.cnbc.com/2026/02/05/pandora-stock-pndora-silver-price-jeweler-platinum.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108142042-1746613916225-gettyimages-1162844937-DENMARK_PANDORA.jpeg?v=1746614079&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T12:20:26.000Z",
    "description": "Pandora, the world's largest jeweler by volume, rose Thursday after the company addressed investor concerns about its reliance on silver. Copenhagen-l",
    "body": "Pandora, the world's largest jeweler by volume, rose Thursday after the company addressed investor concerns about its reliance on silver. Copenhagen-listed shares rose as much as 7% after it guided for largely flat organic growth in 2026 alongside its quarterly earnings report, and said it would introduce platinum-plated jewelry after the price of silver had more than doubled over the past year. Shares were last seen trading 4.9% higher. \"If you look at our volatility of silver, one of the things that we have to [do] for the company is to decouple that from the silver trading,\" CEO Berta de Pablos-Barbier told CNBC's \"Squawk Box Europe.\"\"Varying our basket from new metals is going to help us, because we will not be so dependent on only one metal, which is today silver,\" she said, adding that about 60% of Pandora's business today was silver. While spot silver was down over 12% early Thursday at around $80 an ounce, it is still up more than 150% from about $30 an ounce a year ago.Analysts have warned that the volatile price of silver was a \"pernicious problem\" for the Danish jeweler. A more pressured consumer has also impacted sales. Jefferies analysts on Tuesday said investors will be hesitant to engage with Pandora given recent silver moves. \"The challenges of the last few months will mean, even in a more normal silver price world, [Pandora] will remain substantially cheaper than even a year ago.\"Pandora stock has fallen around 60% over the past 12 months. Cautious consumersThis year, Pandora expects organic growth to land somewhere between negative 1% and 2%, and a profit (earnings before interest and tax) margin of between 21% and 22%.De Pablos-Barbier, who took up the role as CEO last month, told CNBC that moving to a platinum-plated material and expanding its portfolio would allow the company to keep margins in the 20's. In the fourth quarter, organic growth was 4% as demand in the U.S. market, which accounts for about a third of its business, remained soft.\"The reality is that we are seeing the lowest consumer sentiment since the 60s in that market,\" De Pablos-Barbier said. \"This is nothing I can control, what I can control is what I bring to the brand and how much excitement and new products I can bring to the U.S. consumers, so that they continue to be loyal and they continue to come to our stores.\"Like-for-like growth, which measures sales across comparable stores, was flat in the quarter as well as during the first month of 2026, Pandora said.watch nowIt was also the first quarter of negative like-for-like growth since late 2022 in Pandora's strategically important \"Fuel with More\" segment, which focuses on expanding beyond the traditional charms it's known for into new categories like rings, necklaces and lab-grown diamonds, Citi analysts noted. \"Extreme precious metals inflation has materially reduced earnings visibility,\" the analysts said. \"Near-term confidence is further undermined by a volatile US and European macro backdrop (~80% of sales) and potential signs of brand fatigue and broader jewellery consumption softening.\"The jeweler posted a 6% organic growth for 2025, preannounced in January, down from 13% in the previous year and missing its own guidance of between 7% and 8%.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World's largest jeweler jumps as CEO says firm wants to pivot from silver",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108142042-1746613916225-gettyimages-1162844937-DENMARK_PANDORA.jpeg?v=1746614079&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T12:20:26.000Z",
      "dateModified": "2026-02-05T12:20:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Layoffs in January were the highest to start a year since 2009, Challenger says",
    "url": "https://www.cnbc.com/2026/02/05/layoff-and-hiring-announcements-hit-their-worst-january-levels-since-2009-challenger-says.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108257746-1769538385929-gettyimages-2257950756-AMAZON_STORES.jpeg?v=1769538452&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T15:57:40.000Z",
    "description": "An Amazon Go store in New York, US, on Tuesday, Jan. 27, 2026. Michael Nagle | Bloomberg | Getty ImagesLayoff plans hit their highest January total si",
    "body": "An Amazon Go store in New York, US, on Tuesday, Jan. 27, 2026. Michael Nagle | Bloomberg | Getty ImagesLayoff plans hit their highest January total since the global financial crisis while hiring intentions reached their lowest since the same period, outplacement firm Challenger, Gray & Christmas reported Thursday.U.S. employers announced 108,435 layoffs for the month, up 118% from the same period a year ago and 205% from December 2025. The total marked the highest for any January since 2009, while the economy was in the final months of its steepest downturn since the Great Depression.At the same time, companies announced just 5,306 new hires, also the lowest January since 2009, which is when Challenger began tracking such data. The crisis recession officially ended in March 2009.With the recent narrative centering on a no-hire, no-fire labor market, the Challenger data suggests that the layoff part of the equation could be stepping up.\"Generally, we see a high number of job cuts in the first quarter, but this is a high total for January,\" said Andy Challenger, workplace expert and chief revenue officer for the firm. \"It means most of these plans were set at the end of 2025, signaling employers are less-than-optimistic about the outlook for 2026.\"To be sure, if employers are stepping up plans to furlough workers, it hasn't been showing up much in official government data. watch nowHowever, initial jobless claims for the week ended Jan. 31 totaled a seasonally adjusted 231,000, the highest since early December though the spike likely had something to do with a brutal winter storm that hit large parts of the country. The longer-term trend still was at its lowest since October 2024.Some high-profile layoff announcements have boosted fears of wider damage in the labor market. Amazon, UPS and Dow Inc. recently have announced sizeable job cuts. Indeed, transportation had the highest level from a sector standpoint in January, due largely to plans from UPS to cut more than 30,000 workers. Technology was second on the back of Amazon's announcement to shed 16,000 mostly corporate level jobs.Planned hiring dropped 13% from January 2025 and was off 49% from December.Challenger data also can be volatile and not correlated to official statistics. However, filings with the Labor Department in January under Worker Adjustment and Retraining Notification regulations indicate more than 100 companies have given notice of significant layoffs.In a separate report Thursday, the Bureau of Labor Statistics reported that job openings fell sharply in December to 6.54 million, a slide of 386,000 on a monthly basis and down more than 900,000 from the October level. Openings are now at their lowest since September 2020.The decrease in available positions put the ratio of available jobs to unemployed workers at 0.87 to 1, down from more than 2 to 1 at its peak in mid-2022.  On Wednesday, ADP reported that private employers added just 22,000 jobs in January.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Layoffs in January were the highest to start a year since 2009, Challenger says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108257746-1769538385929-gettyimages-2257950756-AMAZON_STORES.jpeg?v=1769538452&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T15:57:40.000Z",
      "dateModified": "2026-02-05T15:57:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Warren to call for reversal of Trump's UAE chip sales after 'Spy Sheikh' revelations",
    "url": "https://www.cnbc.com/2026/02/05/warren-trump-chip-sales-spy-sheikh.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261999-1770309505372-Untitled-2.jpg?v=1770313340&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T18:58:45.000Z",
    "description": "Sen. Elizabeth Warren (D-MA) (L), and Sheikh Tahnoon bin Zayed Al NahyanGetty Image | ReutersSen. Elizabeth Warren, D-Mass., will ask the Senate on Th",
    "body": "Sen. Elizabeth Warren (D-MA) (L), and Sheikh Tahnoon bin Zayed Al NahyanGetty Image | ReutersSen. Elizabeth Warren, D-Mass., will ask the Senate on Thursday to condemn and call for the reversal of the sale of 500,000 advanced artificial intelligence chips to the United Arab Emirates. Warren's resolution, shared exclusively with CNBC, comes after a report in The Wall Street Journal last week that Sheikh Tahnoon bin Zayed Al Nahyan of the United Arab Emirates, also known as the \"Spy Sheikh,\" purchased a secret 49% stake in the Trump family’s World Liberty Financial days before President Donald Trump's inauguration. The stake reportedly saw roughly $187 million flow to Trump family entities.The chip deal came just months after Tahnoon's purchase in World Liberty Financial, prompting allegations of bribery. Prior U.S. administrations have warned against selling chips to the UAE, citing concern that they will fall into the hands of China. Tahnoon's own AI enterprise, G42, will receive chips as part of the deal. \"Why in the world was Donald Trump trying to ship off our state-of-the-art chips to the UAE — and China — when American startups, universities, and small businesses need them here at home?\" Warren is expected to ask on the floor when she introduces her resolution. A draft of it has been viewed by CNBC. \"Well, now we know that the UAE greased the skids months earlier when it secretly agreed to pour hundreds of millions of dollars into a Trump family crypto venture just four days before President Trump's inauguration.\"President Donald Trump shakes hands with Tahnoun bin Zayed Al Nahyan, National Security Advisor of UAE, next to UAE President Mohammed bin Zayed Al Nahyan, left, after arriving on Air Force One at Abu Dhabi International Airport, Thursday, May 15, 2025, in Abu Dhabi, United Arab Emirates.Alex Brandon | APIf agreed to on the Senate floor, the resolution would resolve that the Senate \"Condemns Donald Trump's decision to allow the sale of advanced AI chips to the United Arab Emirates and calls for the reversal of this decision.\"The chip deal would send 500,000 of Nvidia's chips to the UAE annually, including the most advanced silicon the U.S. company makes. The U.S. is battling with China over AI dominance, and tightly guards its technology.Warren's push for a vote on the resolution is likely to be blocked on the Senate floor, where any senator could object to the measure. But it could put Republicans — who have also warned about AI chips reaching China — in a difficult spot. \"Trump is profiting from decisions that make it easier for countries like China to get their hands on some of our most sensitive and advanced technology,\" Warren, the top Democrat on the Senate banking committee, is expected to say. \"Congress needs to grow a spine. We cannot allow American national security to be sold to the highest bidder,\" she's expected to add. The Trump administration has denied wrongdoing related to Tahnoon's purchase and the chip deal. Trump, asked about the deal this week, said, \"Well, I don't know about it.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Warren to call for reversal of Trump's UAE chip sales after 'Spy Sheikh' revelations",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261999-1770309505372-Untitled-2.jpg?v=1770313340&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T18:58:45.000Z",
      "dateModified": "2026-02-05T18:58:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China's Xi reasserts Taiwan stance in call with Trump, while U.S. president pushes trade",
    "url": "https://www.cnbc.com/2026/02/05/chinas-xi-taiwan-trump-trade-talks-iran-russia.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108251501-1768264445199-gettyimages-2243544195-AFP_82G73NQ.jpeg?v=1770248295&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-05T03:21:40.000Z",
    "description": "TOPSHOT - US President Donald Trump (L) and China's President Xi Jinping arrive for talks at the Gimhae Air Base, located next to the Gimhae Internati",
    "body": "TOPSHOT - US President Donald Trump (L) and China's President Xi Jinping arrive for talks at the Gimhae Air Base, located next to the Gimhae International Airport in Busan on October 30, 2025.Andrew Caballero-reynolds | Afp | Getty ImagesU.S. President Donald Trump said Wednesday that he had a \"long and thorough call\" with his Chinese counterpart Xi Jinping, naming Iran, Russia's war in Ukraine, China's energy purchases and his upcoming visit in April among the key talking points.  Beijing's statement, however, singled out Taiwan as \"the most important issue\" in bilateral relations, urging the U.S. to \"handle the issue of arms sales to Taiwan with prudence.\" China maintains Taiwan is part of its territory, claims that have been rejected by the democratically governed island.Washington approved arms sales to Taiwan worth as much as $11.15 billion in December last year — one of its biggest ever — to strengthen the island's defenses and deter any military aggression by Beijing. China appears to be reminding Washington \"where the red lines are\" while seeking to avoid any action that could jeopardize Trump's plans to visit China in April, said David Meale, practice head for China at Eurasia Group.    Trump during his call stressed on the commercial ties between the two countries, including China's purchase of oil and gas, agricultural products and airline engine deliveries.   China agreed to increase its purchase of American soybeans to 20 million tones for the current season, 25 million for next, Trump said. \"The 'transaction-oriented' mindset of Trump should be a gift to Beijing as opposed to an ideology-driven one reinforced by coalition-building,\" said Neo Wang, lead China macro analyst at Evercore ISI in New York. The U.S. ambassador to China, David Purdue, reportedly said in a closed-door meeting in Hong Kong last month that Boeing was involved in the ongoing negotiations ahead of Trump's visit. Wang expects a signing ceremony for a deal covering as many as 500 Boeing aircraft to be witnessed by the two leaders during Trump's trip to Beijing. With a potential aircraft deal being the \"headline victory,\" Trump could remove the remaining 10% fentanyl-related tariffs on Chinese exports, \"during or shortly after\" the April meeting, Wang added. While Trump portrayed the call as an \"excellent\" discussion and touted his personal relationship with Xi was \"an extremely good one,\" Xi took a more measured tone, saying that \"the U.S. has its concerns and China has its concerns\" but a solution could be found if both sides approached each other with \"reciprocity.\"    Missing: rare earths, Venezuela Both sides did not mention China's supplies of rare earth minerals — an issue that flared up last year after Beijing used its dominance in critical minerals to gain leverage and push Trump to temper his tariff threats.    That could be a sign that the flow to the U.S. has been \"satisfactory,\" Wang said. Trump also sought to ramp up the U.S. stockpile of critical minerals through a new initiative, dubbed \"Project Vault,\" aimed at strengthening its supply chain to counter China's dominance in the sector.   The official readouts from both sides also left out the simmering tensions around Venezuela after the U.S. captured Venezuelan President Nicolas Maduro and his wife in a stunning military operation earlier this year and seized the country's oil industry. Following the military operation, Trump had demanded that Venezuela cut its economic ties with several countries including China, but later softened his tone to say that Chinese investment would be welcome.   Iran flashpoint   Trump's call with Xi came hours after the Chinese president held a video conference with Russian president Vladimir Putin to discuss geopolitical flashpoints in the region. Putin's foreign affairs adviser Yuri Yshakov told reporters at a briefing following the Xi-Putin call that the two leaders sought to align their positions on global flashpoints including over Iran, Venezuela and Cuba. watch nowAccording to the official readouts, Xi and Putin appeared to be projecting a strong united front, with Moscow calling bilateral relations an important stabilizing factor at a time of growing global turmoil.Trump's call with Xi, where they discussed \"the current situation with Iran,\" came ahead of a critical talks between Washington and Tehran on Friday, although debates continued over the scope of the talk's agenda.    The Trump-Xi call suggested \"both sides have asks of each other for how they approach third country issues,\" said Meale, expecting the Middle East tensions to continue to be in play in the lead up to Trump's April visit. Trump had threatened strikes against Iran following Tehran's violent crackdown on protestors and earlier this week deployed a naval task force including aircraft carriers to the region. China is the largest buyer of Iranian oil. \"The broad swathe of topics covered in the call points to Trump's carrot and stick approach with China,\" said Reva Goujon, director at Rhodium Group, as the American leader takes aim at Russia's oil exports and seeks Beijing's cooperation in bringing Putin to the negotiation table to ultimately broker a peace deal in Ukraine. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China's Xi reasserts Taiwan stance in call with Trump, while U.S. president pushes trade",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108251501-1768264445199-gettyimages-2243544195-AFP_82G73NQ.jpeg?v=1770248295&w=1920&h=1080"
      ],
      "datePublished": "2026-02-05T03:21:40.000Z",
      "dateModified": "2026-02-05T03:21:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]