[
  {
    "title": "Bill Gates: Read these 5 books—each one 'sparks your curiosity' and reveals 'how something important really works'",
    "url": "https://www.cnbc.com/2025/11/25/bill-gates-book-list-read-these-during-the-2025-holidays.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231351-1764026740924-Bill_Gates_Holiday_Books.jpg?v=1764081336&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T18:00:01.000Z",
    "description": "Colder weather and, for many, some time off for the holidays makes winter a perfect time of year to \"catch up on reading,\" according to billionaire an",
    "body": "Colder weather and, for many, some time off for the holidays makes winter a perfect time of year to \"catch up on reading,\" according to billionaire and avid reader Bill Gates.\"There's something about the quieter days around the holidays that makes it easier to sit down with a good book,\" Gates wrote in a blog post published on Tuesday that includes his latest annual list of holiday season book recommendations.Gates' list of \"recent favorites\" includes a wide variety of authors and genres, from a book by a Harvard psychologist that dissects the concept of \"common knowledge\" to a fictional work about an aging night janitor in an aquarium. The list also features a media mogul's recent memoir, a book that Gates calls a \"hopeful, fact-driven overview\" of the current climate crisis, and a nonfiction political bestseller about government regulations and American innovation.DON'T MISS: Exclusive Black Friday discounts on courses to help you earn more money and get ahead at work\"Each of these books pulls back the curtain on how something important really works: how people find purpose later in life, how we should think about climate change, how creative industries evolve, how humans communicate, and how America lost its capacity to build big things — and how to get it back,\" wrote Gates.Here are the five books Gates recommends reading during this holiday season:'Remarkably Bright Creatures' by Shelby Van PeltTold partially from the perspective of an octopus, Van Pelt's 2022 novel meets Gates' top condition for any work of fiction, he wrote: \"I want to read about interesting characters who help me see the world in a new way.\"Gates, who turned 70 in October, also wrote that he related to the book's human protagonist: a 70-year-old widow named Tova, a janitor working the night shift at the aquarium housing Marcellus the octopus. The book follows a developing friendship between Tova and Marcellus, and Gates referred to it as a thought-provoking exploration of \"relationships and getting older,\" particularly struggles with loneliness and the search for meaning as one enters the final chapter of their life.\"Van Pelt's story made me think about the challenge of filling the days after you stop working — and what communities can do to help older people find purpose,\" wrote Gates, who has previously said that retirement \"sounds awful.\"'Clearing the Air' by Hannah RitchieHannah Ritchie is a University of Oxford data scientist who Gates has previously touted for her \"surprisingly optimistic\" analyses of the ongoing fight against climate change. Her latest book — which published in the U.K. on Sept. 18, and is set to publish in the U.S. in March 2026 — \"is one of the clearest explanations of the climate challenge I've read,\" Gates wrote.In \"Clearing the Air,\" Ritchie focuses on 50 questions about the climate crisis — like, whether renewable energy alternatives are too expensive to be effective, or if it's too late to limit global warming and avoid further climate disasters — offering answers that are \"realistic about the risks but grounded in data that shows real progress,\" Gates wrote.Like Ritchie, Gates has touted the environmental movement's progress — from increased use of solar and wind power to the popularity of electric vehicles — and rejected a \"doomsday outlook\" of climate change that the billionaire worries could distract us from other areas of concern, he wrote in a separate blog post in October.Gates has spent decades, and billions of dollars, on combatting climate change. He recently drew some criticism from scientists for arguing that some of the resources earmarked for climate initiatives would be better used on issues like welfare and poverty.\"If you want a hopeful, fact-driven overview of where climate solutions stand, this is a great pick,\" Gates wrote of Ritchie's book on Tuesday.'Who Knew' by Barry DillerBarry Diller, the billionaire IAC and Expedia chairman who also co-founded Fox Broadcasting, published his memoir in May 2025. Even though Gates considers Diller a longtime friend, he wrote, the media mogul's book \"still managed to surprise and teach me a lot about him, his career, and the many industries he's transformed.\"Diller is credited with inventing concepts like the made-for-television movie and TV miniseries during his years as an entertainment executive. Later, Diller \"was early to see the internet's potential and willing to bet on it when others weren't,\" including buying Expedia from Microsoft in 2001 and building IAC into one of the earliest media and internet conglomerates, Gates noted.Gates considered Diller's book to be insightful about the mogul's rise to corporate power, he wrote — and \"raw and honest\" about Diller's personal life, including a decision to come out as gay earlier this year at age 83.'When Everyone Knows That Everyone Knows' by Steven Pinker\"Few people explain the mysteries of human behavior better than Steven Pinker,\" Gates wrote about the professor of psychology at Harvard University who studies how humans interact. Pinker's latest book, which published on Sept. 23, \"is a must-read for anyone who wants to learn more about how people communicate,\" Gates wrote.In \"When Everyone Knows That Everyone Knows,\" Pinker explores how \"common knowledge\" shapes so many aspects of our lives, including how we communicate and work with others. And as Gates wrote: \"Most people would benefit from understanding how common knowledge props up every conversation we have,\" and how to used that shared understanding to more effectively collaborate with others.\"Although the topic itself is pretty complicated, the book is readable and practical, and it made me see everyday social interactions in a new light,\" Gates wrote.'Abundance' by Ezra Klein and Derek ThompsonWritten by two journalists — Thompson is a contributing writer at The Atlantic and Klein is a columnist at The New York Times and co-founder of Vox — \"Abundance\" offers \"a sharp look at why America seems to struggle to build things and what it will take to fix that,\" wrote Gates.Klein and Thompson argue that regulations, particularly some championed by progressive politicians, have stymied U.S. development in areas ranging from infrastructure and affordable housing to scientific breakthroughs. To fix the bottleneck, the writers propose an \"abundance agenda\" that would promote spending on development while cutting back on red tape to help accelerate the pace of new projects.The book has critics on both sides of the political aisle, and Gates wrote that it \"doesn't have all the answers.\" However, the writers \"are asking the right questions\" based on Gates' own experiences working with government agencies on large-scale global health and climate technology projects, he wrote.\"I've seen how the bottlenecks discussed in 'Abundance' impede progress in global health — whether we're trying to improve seeds, design better toilets, or eradicate polio,\" Gates wrote. \"Sometimes the science itself is hard. But often, the logistics and execution are even harder.\"Earn more and get ahead with CNBC's online courses. Black Friday starts now! Get 25% off select courses and 30% off exclusive bundles with coupon code GETSMART. Offer valid November 17 through December 5, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bill Gates: Read these 5 books—each one 'sparks your curiosity' and reveals 'how something important really works'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231351-1764026740924-Bill_Gates_Holiday_Books.jpg?v=1764081336&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T18:00:01.000Z",
      "dateModified": "2025-11-25T18:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Musk's xAI to close $15 billion funding round in December: sources",
    "url": "https://www.cnbc.com/2025/11/25/musk-xai-funding-december.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108228483-17635766642025-11-19t182054z_1051193980_rc2tzhaclwp5_rtrmadp_0_usa-saudi-forum.jpeg?v=1763576679&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T15:49:20.000Z",
    "description": "Elon Musk attends the U.S.-Saudi Investment Forum in Washington, D.C., U.S., November 19, 2025. Evelyn Hockstein | ReutersElon Musk's artificial intel",
    "body": "Elon Musk attends the U.S.-Saudi Investment Forum in Washington, D.C., U.S., November 19, 2025. Evelyn Hockstein | ReutersElon Musk's artificial intelligence startup xAI is expected to close a $15 billion round at a $230 billion pre-money valuation next month, sources familiar with the matter told CNBC's David Faber.The deadline for allocation is the end of day on Tuesday, with the round expected to close on Dec. 19, the sources said.This confirms earlier CNBC reporting that the company was raising $15 billion. The Tesla CEO later called the report on the round \"False\" in a post on the social media platform X.At the time, sources told CNBC that xAI would use a large portion of the money for funding graphics processing units responsible for powering large language models. CNBC had previously reported in September that the startup was looking to raise $10 billion at a $200 billion valuation.The funding round is yet another sign of the insatiable demand for AI tools. Companies, including OpenAI and Anthropic, have raised billions and reached sky-high valuations as investors pour more money into companies building foundational AI models. Sam Altman's OpenAI finalized a $6.6 billion-share sale at a $500 billion valuation last month, and Reuters recently reported that the ChatGPT maker was eying a $1 trillion initial public offering.Anthropic closed a $13 billion funding round in September that roughly tripled its valuation from March.Musk's xAI is responsible for creating the Grok chatbot that has come under fire for disseminating hate speech, including antisemitic content. The company recently debuted Grokipedia, an AI-powered competitor to Wikipedia. In March, Musk announced the merger of xAI with X in a deal valuing the social media platform at $33 billion.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Musk's xAI to close $15 billion funding round in December: sources",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108228483-17635766642025-11-19t182054z_1051193980_rc2tzhaclwp5_rtrmadp_0_usa-saudi-forum.jpeg?v=1763576679&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T15:49:20.000Z",
      "dateModified": "2025-11-25T15:49:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia says its GPUs are a 'generation ahead' of Google's AI chips",
    "url": "https://www.cnbc.com/2025/11/25/nvidia-says-its-gpus-are-a-generation-ahead-of-googles-ai-chips.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108228210-1763560872768-2025-11-04T124305Z_639437890_RC2MPHA3CMAC_RTRMADP_3_GERMANY-TELEKOM-AI.JPG?v=1763585187&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T23:19:59.000Z",
    "description": "Nvidia founder and CEO Jensen Huang looks on as US President Donald Trump speaks at the US-Saudi Investment Forum at the John F. Kennedy Center for th",
    "body": "Nvidia founder and CEO Jensen Huang looks on as US President Donald Trump speaks at the US-Saudi Investment Forum at the John F. Kennedy Center for the Performing Arts in Washington, DC on November 19, 2025. Brendan Smialowski | Afp | Getty ImagesNvidia on Tuesday said its tech remains a generation ahead of the industry, in response to Wall Street's concerns that the company's dominance of AI infrastructure could be threatened by Google's AI chips.\"We're delighted by Google's success — they've made great advances in AI and we continue to supply to Google,\" Nvidia said in a post on X. \"NVIDIA is a generation ahead of the industry — it's the only platform that runs every AI model and does it everywhere computing is done.\"The post came after Nvidia saw its shares fall 3% on Tuesday after a report that Meta, one of its key customers, could strike a deal with Google to use its tensor processing units for its data centers. In its post, Nvidia said its chips are more flexible and powerful compared with so-called ASIC chips — such as Google's TPUs — which are designed for a single company or function. Nvidia's latest generation of chips are known as Blackwell. \"NVIDIA offers greater performance, versatility, and fungibility than ASICs,\" Nvidia said in its post. Nvidia has more than 90% of the market for artificial intelligence chips with its graphics processors, analysts say, but Google's in-house chips have gotten increased attention in recent weeks as a viable alternative to the Blackwell chips, which are expensive but powerful. Unlike Nvidia, Google doesn't sell its TPU chips to other companies, but it uses them for internal tasks and allows companies to rent them through Google Cloud. Earlier this month, Google released Gemini 3, a well-reviewed state-of-the-art AI model that was trained on the company's TPUs, not Nvidia GPUs. \"We are experiencing accelerating demand for both our custom TPUs and Nvidia GPUs,\" a Google spokesperson said in a statement. \"We are committed to supporting both, as we have for years.\"Nvidia CEO Jensen Huang addressed rising TPU competition on an earnings call earlier this month, noting that Google was a customer for his company's GPU chips and that Gemini can run on Nvidia's technology. He also mentioned that he was in touch with Demis Hassabis, the CEO of Google DeepMind. Huang said that Hassabis texted him to say that the tech industry theory that using more chips and data will create more powerful AI models — often called \"scaling laws\" by AI developers — is \"intact.\" Nvidia says that scaling laws will lead to even more demand for the company's chips and systems. WATCH: Meta reportedly in talks to use Google's AI chipswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia says its GPUs are a 'generation ahead' of Google's AI chips",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108228210-1763560872768-2025-11-04T124305Z_639437890_RC2MPHA3CMAC_RTRMADP_3_GERMANY-TELEKOM-AI.JPG?v=1763585187&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T23:19:59.000Z",
      "dateModified": "2025-11-25T23:19:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A third high-profile tech leader is leaving GM as part of a software-product restructuring ",
    "url": "https://www.cnbc.com/2025/11/25/gm-software-leader-baris-cetinok-leaving.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231940-1764097268489-GMForward21.jpg?v=1764097395&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T21:30:02.000Z",
    "description": "Mary Barra, Chair and CEO of General Motors (right to left), Mark Reuss, President, Sterling Anderson, Chief Product Officer, and Dave Richardson, Sen",
    "body": "Mary Barra, Chair and CEO of General Motors (right to left), Mark Reuss, President, Sterling Anderson, Chief Product Officer, and Dave Richardson, Senior Vice President Software and Services Engineering at \"GM Forward\" on Wednesday, October 22, 2025 in New York.GMDETROIT – A third high-profile technology executive is leaving General Motors amid a restructuring of the automaker's software and product businesses, CNBC has learned.Baris Cetinok, GM senior vice president of software and services product management, will depart the company effective Dec. 12, the automaker confirmed Tuesday after an internal announcement to employees.Cetinok is the third tech-turned-auto executive to leave GM in roughly a month as the company combines its vehicle software engineering and global product units under one organization, led by new Chief Product Officer Sterling Anderson.\"Baris has built a strong software product management team at GM. We're grateful for his contributions and wish him continued success. With hardware and software engineering unified under Global Product, we're integrating product management with engineering to accelerate the delivery of exceptional in-vehicle experiences,\" GM said in an emailed statement to CNBC.Cetinok, who joined GM in September 2023 after stints with companies such as Apple, Microsoft and Amazon, could not immediately be reached for comment. The announcement of his departure comes a month after he described his position as \"a product person's dream\" in an interview with CNBC.GM's senior vice president of software and services engineering, Dave Richardson, and its head of GM artificial intelligence, Barak Turovsky, have also left the company since October. Richardson was with GM for more than two years, while Turovsky was hired in March.GM Chief Product Officer Sterling Anderson during the automaker's \"GM Forward\" event on Oct. 22, 2025 in New York City.Michael Wayland / CNBCAnderson left the self-driving company he cofounded, Aurora Innovation, to join GM. He told CNBC last month that in order for the automaker to succeed, software and product must be thought of as one and the same.\"That's the point of the role, I think, is it brings together all of these pieces into a unified approach to how we do product going forward,\" Anderson said during an Oct. 22 interview at a GM technology event in New York.Anderson, a former McKinsey & Co. consultant who later led Tesla's AutoPilot program, said his goal is to accelerate the pace of GM's innovations.When Anderson's appointment with GM was announced in May, Cetinok said in a LinkedIn post he was \"delighted to welcome\" the executive to the company. GM CEO Mary Barra and GM President Mark Reuss also hailed Anderson as being equipped to \"evolve\" and \"reinvent\" the automaker's operations.The global automotive industry has battled for years to better integrate technology into vehicles – from their production to consumer-facing software and remote, or \"over-the-air,\" updates like Tesla pioneered.GM has taken an aggressive approach to combat such challenges by hiring leaders from Tesla and technology companies such as Apple and Google. However, many times, such executives have had short tenures with the company.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A third high-profile tech leader is leaving GM as part of a software-product restructuring ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231940-1764097268489-GMForward21.jpg?v=1764097395&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T21:30:02.000Z",
      "dateModified": "2025-11-25T21:30:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Rush Hour 4’ revived after Trump urged Paramount Skydance to resurrect franchise: Reports",
    "url": "https://www.cnbc.com/2025/11/25/trump-pushed-paramount-revive-rush-hour-4-reports-say.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231981-1764100830002-gettyimages-75880729-14590923.jpeg?v=1764100906&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T02:33:04.000Z",
    "description": "Actors Chris Tucker and Jackie Chan arrive to the premiere of \"Rush Hour 3\" at Mann's Chinese Theater on July 30, 2007 in Hollywood, California. Jeff ",
    "body": "Actors Chris Tucker and Jackie Chan arrive to the premiere of \"Rush Hour 3\" at Mann's Chinese Theater on July 30, 2007 in Hollywood, California. Jeff Vespa | WireImage | Getty ImagesA push from President Donald Trump led Paramount Skydance to revive its \"Rush Hour\" buddy cop movie series, two decades after the last installment, according to multiple reports Tuesday.Paramount has secured funding for \"Rush Hour 4\" and struck a distribution arrangement with Warner Bros. Discovery, which previously owned the franchise under its New Line banner, Puck's Matthew Belloni reported. The project had been in limbo for years.Studios were repeatedly approached about a new installment, but had balked at working with director Brett Ratner.Ratner's career collapsed in 2017 after several female actors accused him of sexual misconduct. He has denied the allegations and was never charged.Belloni reported that Paramount's decision to release \"Rush Hour 4\" came \"after prodding from Trump on behalf of Brett Ratner,\" who will direct the film.Ratner, in late 2024, was tapped to direct a documentary about first lady Melania Trump for Amazon Prime, which reportedly paid $40 million for the rights to make it.In the \"Rush Hour 4\" deal, Paramount will collect a flat distribution fee to release the film in theaters, Variety first reported. Warner Bros. will take an undisclosed share of box-office receipts before financiers recoup costs.Paramount Skydance and Warner Bros. did not respond to requests for comment. The White House also did not respond to a request for comment.The first three \"Rush Hour\" films were global hits, particularly in China, earning more than $850 million worldwide, according to box office estimates. They also turned Jackie Chan and Chris Tucker into major stars.But the new sequel faces a changed theatrical landscape where comedies have struggled at the box office.And at 71 years old, Chan has scaled back U.S. studio work, while Tucker has not headlined a major film since 2007.Both Chan and Tucker are expected to be in the new film.Trump's intervention in Hollywood has drawn criticism. He has informally tapped allies including Sylvester Stallone, Jon Voight, and Mel Gibson as cultural emissaries, and has repeatedly said he wants to restore what he calls \"classical masculinity\" to studio filmmaking.For Paramount, the \"Rush Hour\" revival comes as the newly combined studio aims to nearly double its output, targeting 15 films in 2026 and up to 18 by 2028.The timing also overlaps with a major industry shake-up: Paramount Skydance, Comcast, and Netflix have all submitted first-round bids to acquire Warner Bros. The company's portfolio includes some of entertainment's most valuable franchises, from DC to Harry Potter.Paramount is bidding for all of Warner Bros. Its proposal, previously valued at about $23.50 per share, would bring the entire company — the studio, HBO Max, and the cable networks — under one owner.Comcast is reportedly interested in the studio and streaming assets, including Warner Bros. and HBO Max. The deal would fold those pieces into NBCUniversal and let Warner Bros. Discovery spin off CNN and TNT Sports before the deal closes. Netflix is also interested in the film and streaming assets, people familiar with the matter previously told CNBC.Warner Bros. Discovery aims to have its sale process wrapped by mid- to late-December, CNBC previously reported.Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast's planned spinoff of Versant.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Rush Hour 4’ revived after Trump urged Paramount Skydance to resurrect franchise: Reports",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231981-1764100830002-gettyimages-75880729-14590923.jpeg?v=1764100906&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T02:33:04.000Z",
      "dateModified": "2025-11-26T02:33:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon faces FAA probe after delivery drone snaps internet cable in Texas",
    "url": "https://www.cnbc.com/2025/11/25/amazon-faa-probe-delivery-drone-incident-texas.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207077-1759421802812-gettyimages-1732229069-AFP_33YJ8RL.jpeg?v=1764114154&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T02:58:03.000Z",
    "description": "Amazon's new MK30 Prime Air drone is displayed during Amazon's \"Delivering the Future\" event at the company's BFI1 Fulfillment Center, Robotics Resear",
    "body": "Amazon's new MK30 Prime Air drone is displayed during Amazon's \"Delivering the Future\" event at the company's BFI1 Fulfillment Center, Robotics Research and Development Hub in Sumner, Washington on Oct. 18, 2023.Jason Redmond | AFP | Getty ImagesAmazon is facing a federal probe after one of its delivery drones downed an internet cable in central Texas last week. The probe comes as Amazon vies to expand drone deliveries to more pockets of the U.S., more than a decade after it first conceived the aerial distribution program, and faces stiffer competition from Walmart, which has also begun drone deliveries. The incident occurred on Nov. 18 around 12:45 p.m. Central in Waco, Texas. After dropping off a package, one of Amazon's MK30 drones was ascending out of a customer's yard when one of its six propellers got tangled in a nearby internet cable, according to a video of the incident viewed and verified by CNBC. The video shows the Amazon drone shearing the wire line. The drone's motor then appeared to shut off and the aircraft landed itself, with its propellers windmilling slightly on the way down, the video shows. The drone appeared to remain in tact beyond some damage to one of its propellers. The Federal Aviation Administration is investigating the incident, a spokesperson confirmed. The National Transportation Safety Board said the agency is aware of the incident but has not opened a probe into the matter. Amazon confirmed the incident to CNBC, saying that after clipping the internet cable, the drone performed a \"safe contingent landing,\" referring to the process that allows its drones to land safely in unexpected conditions.\"There were no injuries or widespread internet service outages. We've paid for the cable line's repair for the customer and have apologized for the inconvenience this caused them,\" an Amazon spokesperson told CNBC, noting that the drone had completed its package delivery.watch nowThe incident comes after federal investigators last month opened a separate probe into a crash involving two of Amazon's Prime Air drones in Arizona. The two aircrafts collided with a construction crane in Tolleson, a city west of Phoenix, prompting Amazon to temporarily halt drone deliveries in the area.For over a decade, Amazon has been working to realize founder Jeff Bezos' vision of drones whizzing toothpaste, books and other goods to customers' doorsteps in 30 minutes or less. The company began drone deliveries in 2022 in College Station, Texas, and Lockeford, California.But progress has been slowed by a mix of regulatory hurdles, missed deadlines and layoffs in 2023 that coincided with broader cost-cutting efforts by Amazon CEO Andy Jassy. The company has previously said its goal is to deliver 500 million packages by drone per year by the end of the decade. The hexacopter-shaped MK30, the latest generation of Amazon's Prime Air drone, is meant to be quieter, smaller and lighter than previous versions. Amazon says the drones are equipped with a sense-and-avoid system that enables them to \"detect and stay away from obstacles in the air and on the ground.\" The company recommends that customers maintain \"about 10 feet of open space\" on their property so drones can complete deliveriesThe company began drone deliveries in Waco earlier this month for customers within a certain radius of its same-day delivery site who order eligible items weighing 5 pounds or less. The drone deliveries are supposed to drop packages off in under an hour. Amazon has brought other locations online in recent months, including Kansas City, Missouri, Pontiac, Michigan, San Antonio, Texas, and Ruskin, Florida. Amazon has also announced plans to expand drone deliveries to Richardson, Texas. Walmart began offering drone deliveries in 2021, and currently partners with Alphabet's Wing and venture-backed startup Zipline to make drone deliveries in a number of states, including in Texas.WATCH: Amazon unveils satellite terminal for enterprise customers — but Starlink still dominateswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon faces FAA probe after delivery drone snaps internet cable in Texas",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207077-1759421802812-gettyimages-1732229069-AFP_33YJ8RL.jpeg?v=1764114154&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T02:58:03.000Z",
      "dateModified": "2025-11-26T02:58:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michael Burry's next 'Big Short': An inside look at his analysis showing AI is a bubble",
    "url": "https://www.cnbc.com/2025/11/25/michael-burrys-next-big-short-an-inside-look-at-his-analysis-showing-ai-is-a-bubble.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231273-1764019497413-gettyimages-498541178-88290510.jpeg?v=1764019698&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T16:29:35.000Z",
    "description": "watch nowMichael Burry — the investor known for predicting the housing meltdown ahead of 2008 — has turned his attention to one of the market's most b",
    "body": "watch nowMichael Burry — the investor known for predicting the housing meltdown ahead of 2008 — has turned his attention to one of the market's most beloved themes: artificial intelligence.Burry recently deregistered his hedge-fund firm, Scion Asset Management, removing it from routine regulatory disclosures. But he remains actively investing, and he is doubling down on what he sees as the next major mispricing in markets.Central to that view is Phil Clifton, Scion's former associate portfolio manager, whose research underpins the skepticism. Clifton argues that while generative AI adoption is accelerating, the economics behind the industry's massive infrastructure buildout have yet to justify the cost.In his farewell letter to Scion investors in late October, Burry called Clifton \"the most prodigious thinker\" he's ever encountered. CNBC obtained several of Clifton's research notes from earlier this year, written before he launched his own firm, Pomerium Capital, that help outline Scion's bearish thesis on AI.The investment world is \"expecting far more economic importance out of this technology than is likely to be provided,\" Clifton wrote. \"Just because a technology is good for society or revolutionizes the world doesn't mean that it's a good business proposition.\"Low marginsOn the surface, AI usage appears ubiquitous. More than 60% of U.S. adults say they interact with AI at least several times a week, according to Pew Research Center. Yet Clifton said the economics on the demand side are \"surprisingly small.\" OpenAI — market leader and cultural phenomenon — is set to surpass $20 billion in annualized revenue this year, but that figure is tiny compared with the size of the AI build-out. Hyperscalers have quadrupled their capex spend in recent years to almost $400 billion annually, with expectations of $3 trillion over the next five years, according to Man Group.\"We assume other generative AI services in aggregate are insufficient to justify the sums being spent on infrastructure,\" Clifton wrote.History's warningsScion sees a clear historical parallel with the early-2000s telecom boom, when heavy investment in fiber-optic networks far outpaced actual usage. U.S. capacity utilization fell to about 5%, and wholesale telecom pricing collapsed roughly 70% in a single year, Scion noted.Clifton argues the cloud giants are now in a comparable race, expanding AI infrastructure on the assumption that future demand will catch up eventually. But if mass AI adoption takes longer than expected, the economics on these massive data center deals could become untenable.Some Big Tech companies are starting to wobble on commitments already, he noted. Microsoft has canceled data center projects set to use 2 gigawatts of electricity in the U.S. and Europe, citing an oversupply. Alibaba's chairman has warned a bubble is forming in AI infrastructure. The Nvidia ExposureNo company has benefited more from AI spending than Nvidia. The stock has surged alongside unprecedented GPU orders from cloud providers. But Scion questions whether those customers will ever generate economic returns on that investment.Stock Chart IconStock chart iconNvidia one yearA key element here is depreciation policy. Tech giants have lengthened server lifespans on the books to six years. Yet Nvidia's product cycles run every year now, making older chips functionally obsolete and less energy-efficient, long before they've been written down, Scion claims.Nvidia has pushed back at this claim, saying its hardware remains productive far longer than critics say, thanks to efficiencies driven by the company's CUDA software system.Still, Burry and other critics are seizing on a contradiction. Nvidia says the newest chips are superior in performance, efficiency and capability, at the same time as it promises that older chips remain economically viable. One of those defenses, they say, has to give.Burry has launched a new Substack newsletter to lay out his bearish thesis on AI. Whether generative AI ultimately proves to be a bubble remains to be seen, but for now, Burry is again positioning himself on the cautious side of a fast-moving story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michael Burry's next 'Big Short': An inside look at his analysis showing AI is a bubble",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231273-1764019497413-gettyimages-498541178-88290510.jpeg?v=1764019698&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T16:29:35.000Z",
      "dateModified": "2025-11-25T16:29:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia stock falls 4% on report Meta will use Google AI chips",
    "url": "https://www.cnbc.com/2025/11/25/nvidia-shares-today-google-meta-ai-chip-report.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108228213-1763561227417-108228213-1763561133114-gettyimages-2244308088-_cho5546_p4bef2c1.jpg?v=1763561236&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T19:19:29.000Z",
    "description": "Jensen Huang, NVIDIA founder and CEO, has a Q&A session at a press conference during the APEC CEO summit  on October 31, 2025 in Gyeongju, South Korea",
    "body": "Jensen Huang, NVIDIA founder and CEO, has a Q&A session at a press conference during the APEC CEO summit  on October 31, 2025 in Gyeongju, South Korea.Woohae Cho | Getty Images News | Getty ImagesNvidia shares fell on Tuesday after The Information reported that Meta is considering using chips designed by Google. Shares of Nvidia fell as much as 7% before recovering to trade down 4.3% later in the day. Google parent Alphabet was 4.2% higher after a more than 6% rally on Monday.On Monday, The Information reported that Meta is considering using Google's tensor processing units, or TPUs, in its data centers in 2027. Meta may also rent TPUs from Google's cloud unit next year, the publication reported. \"Google Cloud is experiencing accelerating demand for both our custom TPUs and NVIDIA GPUs; we are committed to supporting both, as we have for years,\" a Google spokesperson told CNBC.Google launched its first-generation TPU in 2018 and it was initially designed for its own internal use for its cloud computing business. Since then, Google has launched more advanced versions of its chip that are designed to handle artificial intelligence workloads. TPUs are a customized chip and experts say this gives Google an advantage over rivals as it can offer customers a highly efficient product for AI.If Meta uses the TPUs, it would be big win for Google and potential validation of the technology.Shares of Broadcom, which helps Google design its TPUs, were up more than 1% on Tuesday after an 11% rise the day before.watch nowNvidia remains the market leader with its graphics processing units, GPUs, that have become the main piece of hardware underpinning the huge AI infrastructure build-out. While Nvidia's dominance is unlikely to be dislodged in the near term, Google's TPUs add further competition into the AI semiconductor market.Shares of Advanced Micro Devices, previously seen as offering the most credible challenger to Nvidia's GPUs, were trading 6% lower on Tuesday. Chip designer Arm's shares fell 4.2%.\"There was some sense that [AMD] could be the number two [in the market] and now it's become clear that there may not be room for that,\" Gil Luria, head of technology research at D.A. Davidson, told CNBC.Companies building AI infrastructure have been searching for a more diversified supply of chips to reduce reliance on Nvidia. Meta is among the biggest spenders on AI infrastructure, with the company projecting its capital expenditures to stand between $70 billion and $72 billion this year. The share price moves come amid continued debate around whether there is an \"AI bubble\" and stretched tech company valuations. Nvidia has been central to the debate and the company last week reported a stronger-than-expected sales forecast for the current quarter but technology stocks fell after. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia stock falls 4% on report Meta will use Google AI chips",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108228213-1763561227417-108228213-1763561133114-gettyimages-2244308088-_cho5546_p4bef2c1.jpg?v=1763561236&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T19:19:29.000Z",
      "dateModified": "2025-11-25T19:19:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump pardons Thanksgiving turkeys, blasts Biden and says Ukraine peace deal is ‘very close’",
    "url": "https://www.cnbc.com/2025/11/25/trump-turkey-pardon-biden-ukraine-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231861-17640921532025-11-25t173253z_89963273_rc2s3iaukfyf_rtrmadp_0_usa-thanksgiving-trump.jpeg?v=1764092166&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T21:33:45.000Z",
    "description": "U.S. President Donald Trump looks at Gobble one of two turkeys to ceremonially pardoned for Thanksgiving in the Rose Garden at the White House in Wash",
    "body": "U.S. President Donald Trump looks at Gobble one of two turkeys to ceremonially pardoned for Thanksgiving in the Rose Garden at the White House in Washington, D.C., U.S., November 25, 2025. Jonathan Ernst | ReutersGobble and Waddle won't get gobbled this Thanksgiving — they're waddling off to freedom instead after President Donald Trump granted pardons to those two turkeys on Tuesday.During the traditional Rose Garden ceremony in which the birds get spared from the butcher, Trump also suggested a U.S.-brokered peace deal between Ukraine and Russia soon could come to fruition.\"I think we're getting very close to a deal; we'll find out,\" Trump said. \"I think we're making progress.\"Trump also bashed former President Joe Biden, claiming that his predecessor used an autopen to sign last year's turkey pardons, making them \"totally invalid.\" Trump cracked that he has \"officially pardoned\" those other birds, Peach and Blossom, adding that he \"saved them in the nick of time.\"Gobble and Waddle were raised on a small farm in Wayne County, North Carolina, owned by Travis and Amanda Pittman, who raised turkeys for Butterball.First lady Melania Trump's office had encouraged Americans to text \"Gobble\" or \"Waddle\" to 45470 to decide which bird would receive the formal pardon. Earlier this year, she posted a poll on X to name the birds.Born in July and weighing 52 and 50 pounds respectively, Gobble and Waddle spent the past week getting used to noise, lights, and crowds before checking into their ceremonial suite at the Willard InterContinental Hotel — a long-running perk of being a presidential turkey.The National Thanksgiving Turkeys from North Carolina, named Waddle and Gobble, wait in their room a day ahead of their Thanksgiving holiday pardoning at the White House, at the Willard InterContinental Hotel in Washington, D.C., U.S., November 24, 2025. Nathan Howard | ReutersWhite House Press Secretary Karoline Leavitt holds her son Nicholas as Waddle, one of the National Thanksgiving turkeys, visits the press briefing room of the White House, prior to the turkey pardoning ceremony with US President Donald Trump on November 25, 2025, in Washington, DC. Alex Wroblewski | Afp | Getty ImagesExperts previously told CNBC that retailers who ordered turkeys early locked in lower prices, while others relying on the spot market are facing steeper costs. Wells Fargo's agriculture team said there could be a $20 difference in the price of comparably sized turkeys depending on where consumers shopped.Major retailers have offered holiday promotions to lure cost-conscious shoppers.Walmart is advertising a dinner bundle for 10 people for under $56; Aldi has one for $40; Amazon is offering a $25 dinner promotion; and Target announced a $20 Thanksgiving deal for four.Despite elevated turkey prices, the broader Thanksgiving meal for 10 is less expensive for the third straight year, according to the AFBF. A \"classic\" 16-pound turkey dinner with sides averages $55.18 nationwide.The annual turkey presentation dates to the 1940s and became a formal presidential pardon in 1989 under George H. W. Bush. But presidents have been gifted turkeys since the 1870s, according to the White House Historical Association. Over time, the rite has evolved into soft marketing for America's multibillion-dollar  poultry industry.This year's moment of pageantry comes in a second term where Trump has leaned heavily on his actual pardon power, granting relief to more than 1,000 January 6 rioters and high-profile figures including former Illinois Gov. Rod Blagojevich, disgraced former representative George Santos and former New York City Mayor Rudy Giuliani. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump pardons Thanksgiving turkeys, blasts Biden and says Ukraine peace deal is ‘very close’",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231861-17640921532025-11-25t173253z_89963273_rc2s3iaukfyf_rtrmadp_0_usa-thanksgiving-trump.jpeg?v=1764092166&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T21:33:45.000Z",
      "dateModified": "2025-11-25T21:33:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dell misses on revenue, offers strong forecast driven by AI sales ",
    "url": "https://www.cnbc.com/2025/11/25/dell-earnings-report-q3-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108228572-1763579955659-gettyimages-2235098957-ibc_amsterdam019.jpeg?v=1763580069&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T22:47:02.000Z",
    "description": "The Dell Technologies logo is on display at the International Broadcasting Convention (IBC2025) on Sept. 12, 2025 in Amsterdam, Netherlands.Michel Por",
    "body": "The Dell Technologies logo is on display at the International Broadcasting Convention (IBC2025) on Sept. 12, 2025 in Amsterdam, Netherlands.Michel Porro | Getty ImagesDell reported fiscal third-quarter earnings on Tuesday that missed Wall Street expectations for revenue, but the company forecasted a stronger-than-expected fourth quarter driven by increased AI sales.Dell shares rose 5% in extended trading. Here's how Dell did versus LSEG consensus estimates:EPS: $2.59 adjusted versus $2.47 estimatedRevenue: $27.01 billion versus $27.13 billion estimatedDell said it expects about $31.5 billion in sales in the fourth quarter versus $27.59 billion estimated by analysts. The company said it expects fourth-quarter earnings per share of $3.50 versus $3.21 expected. The company said it was raising its expectations for AI server shipments during the year to $25 billion, up from $20 billion, and raised its full-year revenue guidance to $111.7 billion from $107 billion.Dell reported $1.54 billion in net income, or $2.28 per diluted share, during the quarter, versus $1.17 billion, or $1.64, in the year-ago period. The company is an important bellwether for the health of the AI infrastructure industry as one of the top vendors for systems based around Nvidia's graphics processors. Overall revenue in the quarter rose 11% on an annual basis. Dell's main customers for its artificial intelligence systems are big businesses, governments and so-called neoclouds like CoreWeave. Dells sells less to big cloud companies typically called hyperscalers, which have been the most voracious Nvidia buyers so far. The company said it expects to sell $9.4 billion of AI servers in the fourth quarter, and that doesn't include a deal announced in November to sell Nvidia-based GB300 systems to Iren, a neocloud that plans to rent them out to Microsoft. Dell's data center business, called Infrastructure Solutions Group, reported $14.11 billion in sales, in-line with analyst estimates. Of that, $10.1 billion was for servers and networking parts, which was up 37% on an annual basis. Much of that increase was driven by $5.6 billion in AI server shipments. Dell said it sold $4 billion of storage gear during the quarter.But the company said that its laptop and PC business, called Client Solutions Group, reported $12.48 billion in sales, which was up 3% year-over-year but slightly lower than the $12.65 billion expected by analysts. Dell's laptop and PC business was hit particularly hard, declining 7% on an annual basis. The company said it spent $1.6 billion during the quarter on share repurchases and dividends. WATCH: AI narrative is shifting towards Google with its complete stack, says Plexo Capital's Lo Toneywatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dell misses on revenue, offers strong forecast driven by AI sales ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108228572-1763579955659-gettyimages-2235098957-ibc_amsterdam019.jpeg?v=1763580069&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T22:47:02.000Z",
      "dateModified": "2025-11-25T22:47:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Asia-Pacific markets track Wall Street gains on rising Fed rate-cut expectations",
    "url": "https://www.cnbc.com/2025/11/26/asia-pacific-markets-live-nikkei-225-hang-seng-csi300-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107171168-1672097408734-gettyimages-1401627252-vcg111386428608.jpeg?v=1764113031&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T04:10:11.000Z",
    "description": "SHANGHAI, CHINA - JUNE 08: Aerial view of skyscrapers standing at the Lujiazui Financial District at sunrise on June 8, 2022 in Shanghai, China.Vcg | ",
    "body": "SHANGHAI, CHINA - JUNE 08: Aerial view of skyscrapers standing at the Lujiazui Financial District at sunrise on June 8, 2022 in Shanghai, China.Vcg | Visual China Group | Getty ImagesAsia-Pacific markets rose Wednesday, tracking Wall Street gains on hopes that the U.S. Federal Reserve could cut benchmark interest rates in December.Expectations rose after Bloomberg reported that White House National Economic Council Director Kevin Hassett was being considered as the frontrunner to become the next Fed chair. Investors see Hassett as someone more likely to push the central bank toward a lower-rate environment favored by President Donald Trump. Treasury Secretary Scott Bessent told CNBC on Tuesday that there was a \"very good chance\" that Trump could name a new Fed chair before Christmas.  Markets are pricing in a more than 84% chance that the Fed would cut rates in December, according to the CME FedWatch tool. New York Fed President John Williams also said on Friday that there was room to lower rates \"in the near term.\"Japan's benchmark Nikkei 225 jumped 1.94%, led by the utilities, healthcare and financials sectors. Among the top movers on the index were printing company Toppan Holdings, which advanced 7.54%, tech-focused investment firm SoftBank Group, which rose 6.89%, and Otsuka Holdings, a pharmaceutical company, which rose 6.84%.Japanese tech stocks advanced for a second consecutive session, with semiconductor testing equipment supplier Advantest rising 2.5% and Tokyo Electron trading 0.61% higher. Lasertec and chipmaker Renesas Electronics rose more than 2% and 1%, respectively. The Topix index rose 0.9%. Shares of Japanese memory chip maker Kioxia, however, plunged more than 12% after Nikkei reported late Monday that U.S. private equity firm Bain Capital was planning to unload about 350 billion yen ($2.24 billion) worth of its shares. The block trade will trim Bain's combined ownership in Kioxia to 44%, from 51%, the report said.The Japanese supplier to Apple reported fiscal second-quarter earnings and guidance that missed expectations after the bell on Nov. 13. The company's shares plummeted 23.03% the next day.South Korea's Kospi advanced 1.83%, and the small-cap Kosdaq climbed 1.69%.Australia's ASX/S&P 200 was trading 0.86% higher. The country's inflation accelerated in October, beating analysts' estimates and rising at its fastest pace in seven months, the Australian Bureau of Statistics said Wednesday. The consumer price index rose 3.8% year on year in October, the fastest pace since adopting a new headline inflation measure in April, according to the official release. Hong Kong's Hang Seng Index rose 0.22%, and mainland China's CSI 300 was up 0.41%. Hong Kong-listed shares of Alibaba Group fell 1.27% after its fiscal second-quarter report on Tuesday showed adjusted EBITA, a profitability measure closely watched by analysts, fell 78% year on year, dragged by its instant commerce business segment. Revenue topped estimates.Taiwan's Taiex index rose 1.4%, with shares of Hon Hai Precision Industry, or Foxconn, climbing more than 2%. The Nvidia supplier said Wisconsin Economic Development Corporation had approved a contract amendment providing up to $16 million in additional performance-based tax incentives to Foxconn to help expand its operations in Racine County and invest an additional $569 million. India's Nifty 50 rose 0.33% in early trading, while the BSE Sensex index fell 0.1%. Shares of Bharti Airtel fell 2.2% after reports that its promoter, Indian Continent Investment, an entity led by billionaire Sunil Mittal, plans to sell 34.3 million of its shares in bulk deals worth at least $806 million.Overnight, the key U.S. benchmarks closed higher after a volatile session.The Dow Jones Industrial Average index advanced 664.18 points, or 1.43%, to close at 47,112.45. The S&P 500 gained 0.91% to settle at 6,765.88, while the Nasdaq Composite climbed 0.67% to finish at 23,025.59. That marks a turnaround from the losses seen earlier in the day. At session lows, the S&P 500 was down about 0.7%, while the Dow and tech-heavy Nasdaq had dropped more than 100 points, or 0.2%, and more than 1%, respectively.— CNBC's Anniek Bao, Sean Conlon and Pia Singh contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Asia-Pacific markets track Wall Street gains on rising Fed rate-cut expectations",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107171168-1672097408734-gettyimages-1401627252-vcg111386428608.jpeg?v=1764113031&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T04:10:11.000Z",
      "dateModified": "2025-11-26T04:10:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sellers are taking their homes off the market at the fastest pace in nearly a decade",
    "url": "https://www.cnbc.com/2025/11/25/home-sellers-delisting-redfin.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108200319-1758141740155-gettyimages-2235983392-dji_20250917121755_0386_d_rzemy12u.jpeg?v=1758141958&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T17:03:37.000Z",
    "description": "watch nowWeak buyer demand, weakening home prices and overall uncertainty in the economy are combining to make home sellers change their minds and ste",
    "body": "watch nowWeak buyer demand, weakening home prices and overall uncertainty in the economy are combining to make home sellers change their minds and step out of the market. Close to 85,000 U.S. sellers took their homes off the market in September, up 28% from September 2024 and the highest level for that month in eight years, according to Redfin. Sellers are delisting because so many listings are going stale, sitting on the market longer and longer. Redfin reported that 70% of listings in September were on the market for 60 days or longer. Homeowners are seeing prices weaken significantly and would rather wait than accept a low offer. Prices in September were 1.3% higher year over year, down from a 1.4% rise in August, according to the S&P Cotality Case-Shiller U.S. National Home Price NSA Index. Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.\"The frequency of delistings is keeping inventory tighter than it looks on paper,\" said Asad Khan, a senior economist at Redfin. \"When tens of thousands of homeowners pull their homes off the market rather than accept a low offer, it effectively reduces the supply of homes that are actually available for buyers. That keeps sale prices elevated.\" Some sellers are lowering prices — even multiple times. The typical price cut is roughly $10,000, but multiple reductions are becoming more common as homes take longer to sell, according to Zillow. The typical listing saw $25,000 in cumulative price cuts in October, matching the largest discounts Zillow has ever recorded.The housing market is now heading into its slowest season. While 1 in 5 homes that are delisted are relisted, that may not happen for several months, as sellers will likely wait for the much busier spring season to try again. Home prices are still 50% higher than they were just five years ago, but some sellers who bought in the last few years are facing potential losses. Roughly 15% of the homes that were delisted in September were at risk of selling at a loss, the highest share in five years, according to Redfin.The supply of homes for sale is about 15% higher now than it was a year ago, according to Realtor.com, but that is likely to shrink in the coming weeks, both because of the season and because of weakening consumer sentiment among buyers and sellers alike. Pending sales in October, which are based on signed contracts, were up 1.9% month to month and basically flat from a year ago, according to the Realtors. The monthly bump may have been due to a small drop in mortgage rates, which then turned higher again in November. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sellers are taking their homes off the market at the fastest pace in nearly a decade",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108200319-1758141740155-gettyimages-2235983392-dji_20250917121755_0386_d_rzemy12u.jpeg?v=1758141958&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T17:03:37.000Z",
      "dateModified": "2025-11-25T17:03:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bessent says there's a 'very good chance' Trump names new Fed chair before Christmas",
    "url": "https://www.cnbc.com/2025/11/25/bessent-says-theres-a-very-good-chance-trump-names-new-fed-chair-before-christmas.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108198735-17579397502025-09-15t071608z_559056879_rc27sgav0bpi_rtrmadp_0_usa-trump-tariffs-china.jpeg?v=1757939833&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T17:43:21.000Z",
    "description": "watch nowTreasury Secretary Scott Bessent said Tuesday he expects President Donald Trump to make a decision on the new Federal Reserve chair by the ho",
    "body": "watch nowTreasury Secretary Scott Bessent said Tuesday he expects President Donald Trump to make a decision on the new Federal Reserve chair by the holiday season.In a CNBC interview, Bessent, who has been heading the search for a successor to current Chair Jerome Powell, said he still has one interview to go and was not ready to speculate on who might get the job.\"I think there's a very good chance that the president will make an announcement before Christmas,\" he said. \"But it's his prerogative, whether it's before the Christmas holidays or in the new year. But I think things are moving along very well.\"Trump has been a fierce Fed critic and recently said he'd \"love\" to fire Powell and encouraged Bessent to \"work on\" the chair to get the central bank to lower its key interest rate. Referring to Bessent, Trump even joked that \"if you don't get it fixed fast, I'm gonna fire your ass.\"\"If you were in the room, he was joking,\" Bessent said. \"We've gotten to this point where monetary policy has gotten very complicated, and it's more than just cutting rates.\"Powell's term expires in May 2026, and before then he is expected to have his hands full with a suddenly divided Federal Open Market Committee that is split over the need for further cuts. Based on a recent statement from New York Fed President John Williams, markets largely expect the FOMC to approve a third consecutive cut at the December meeting.In the meantime, Bessent is continuing to interview chair candidates. The slate of finalists is believed to include National Economic Council Director Kevin Hassett, former Governor Kevin Warsh, BlackRock executive Rick Rieder, and current Fed Governors Christopher Waller and Michelle Bowman. Bloomberg News, citing sources familiar with matter, reported Tuesday that Hassett is the front-runner for the job. The White House downplayed speculation about Trump's preference.\"Until an announcement is made by President Trump, discussion about Fed nominations is speculation,\" White House spokesman Kush Desai told CNBC.com Bessent said he envisions a different role for the Fed from the dominating position it has had since the financial crisis over the economy and financial markets.\"I think we've got to kind of simplify things,\" he said. \"I think it's time for the Fed just to move back into the background, like, it used to do, calm things down and work for the American people.\"watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bessent says there's a 'very good chance' Trump names new Fed chair before Christmas",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108198735-17579397502025-09-15t071608z_559056879_rc27sgav0bpi_rtrmadp_0_usa-trump-tariffs-china.jpeg?v=1757939833&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T17:43:21.000Z",
      "dateModified": "2025-11-25T17:43:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": " TSMC stock falls as it sues former exec alleging he took trade secrets to Intel",
    "url": "https://www.cnbc.com/2025/11/25/-tsmc-stock-lawsuit-former-executive-trade-secrets-intel.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108193540-1756885982276-gettyimages-2209504202-vcg111560411382.jpeg?v=1764080718&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T15:13:21.000Z",
    "description": "TSMC on Tuesday filed a lawsuit against a former senior vice president it accused of leaking \"confidential information\" to Intel.Wei-Jen Lo joined Int",
    "body": "TSMC on Tuesday filed a lawsuit against a former senior vice president it accused of leaking \"confidential information\" to Intel.Wei-Jen Lo joined Intel after 21 years at TSMC, having left in July, the Taiwanese chip maker said in a statement, announcing the lawsuit.The lawsuit is based on Lo's employment contract and non-compete agreement with TSMC, and regulations such as the Trade Secrets Act, the statement said. \"There is a high probability that Lo uses, leaks, discloses, delivers, or transfers TSMC's trade secrets and confidential information to Intel,\" it said. TSMC's share price fell on Tuesday and was last seen over 3% lower. Intel did not immediately respond to CNBC's request for comment.It follows earlier reports by local media and later by Reuters, which stated Lo may have taken TSMC's technology data to Intel. Taiwan's High Prosecutors opened an investigation into the allegations. Intel CEO Lip-Bu Tan told Bloomberg News last week that his \"company respects intellectual property rights\" and denied any wrongdoing. The U.S. firm's stock price moved 1.5% lower in mid-morning trade.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": " TSMC stock falls as it sues former exec alleging he took trade secrets to Intel",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108193540-1756885982276-gettyimages-2209504202-vcg111560411382.jpeg?v=1764080718&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T15:13:21.000Z",
      "dateModified": "2025-11-25T15:13:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia's consumer inflation accelerates to 3.8% in October, overshooting estimates",
    "url": "https://www.cnbc.com/2025/11/26/australia-inflation-cpi-in-october-estimates-beat.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232118-1764112908663-gettyimages-2226072368-AUSTRALIA_RETAIL.jpeg?v=1764112936&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T02:13:20.000Z",
    "description": "Pedestrians at Pitt Street Mall in Sydney, Australia, on Thursday, July 24, 2025. Brendon Thorne | Bloomberg | Getty Images  Australia's inflation acc",
    "body": "Pedestrians at Pitt Street Mall in Sydney, Australia, on Thursday, July 24, 2025. Brendon Thorne | Bloomberg | Getty Images  Australia's inflation accelerated in October, exceeding analysts' estimates and rising at its fastest pace in seven months, data from Australian Bureau of Statistics showed Wednesday. The consumer price index rose 3.8% in October, year on year, marking its fastest pace since April, according to the official release. That was higher than economists' average estimate for a 3.6% rise in a Reuters poll. This is the first time that the ABS has released the complete monthly consumer price index, as the government transitions from quarterly CPI to using the monthly gauge as the primary measure for headline inflation. \"The shift to a complete monthly CPI means we now see all expenditure classes each month,\" said Sunny Nguyen, head of Australia economics at Moody's Analytics, noting that the headline and trimmed mean inflation figures ran \"a little hotter\" than the earlier indicators had suggested. The largest contributor to consumer inflation was the housing sector that saw price growth of 5.9%, driven by higher costs in electricity, rents and new dwellings. Electricity costs surged 37.1% in October as households used up government rebates for power bills.  \"With national home prices at new record highs, housing affordability has reached a new record low,\" said Shane Oliver, chief economist at AMP, citing a dire undersupply of housing. Prices for food and non-alcoholic beverages, recreation and culture rose 3.2% from a year earlier. The trimmed mean measure of underlying inflation that excludes volatile items came in at 3.3% in October, compared with 3.2% in the prior month, the official data showed.  On a monthly basis, the headline CPI was flat compared to September and analysts' estimates for a 0.2% contraction. The Reserve Bank of Australia held interest rates at 3.6% earlier this month, saying it was cautious about easing further given higher inflation, a stronger-than-expected recovery in consumer demand and a revival in the housing market.   RBA Governor Michele Bullock said month that the current interest rate cutting cycle could be close to an end, with the central bank forecasting inflation to stay above its target range of 2% to 3% until the second half of next year. \"It's possible that there are no more rate cuts. It's possible there's some more. But as I said earlier, we didn't go as high, so we might not have to come down as far,\" she said in a speech following the November decision. The central bank expects headline inflation to peak at 3.7% in June next year before easing to closer to the midpoint of the target range toward end-2027. \"The October figures again lean toward the 'more persistent inflation' narrative,\" said Nguyen, predicting that any discussion of easing will be pushed into mid or late 2026.Improved business conditions and robust economic growth offer the Australian central bank room to keep rates steady to rein in inflation.A gauge on Australian business conditions picked up in October, rising to the highest level since March 2024, according to a survey by National Australia Bank earlier this month, as companies reported better sales and profits.Australia's economy expanded more than expected in the second quarter, growing 1.8% year on year, accelerating from 1.3% in the prior quarter, underpinned by domestic spending including household and government consumption. The GDP data for the July to September period will be released on Dec. 3.Australia's benchmark stock index, S&P/ASX 200, was 0.73% higher on Wednesday. The Australian dollar depreciated 0.36% to 0.6491 against the U.S. dollar. Yield on the 10-year government gained 4 basis points to 4.474%. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia's consumer inflation accelerates to 3.8% in October, overshooting estimates",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232118-1764112908663-gettyimages-2226072368-AUSTRALIA_RETAIL.jpeg?v=1764112936&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T02:13:20.000Z",
      "dateModified": "2025-11-26T02:13:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]