[
  {
    "title": "Chinese tech giant Tencent's quarterly revenue rises 15%, fueled by AI",
    "url": "https://www.cnbc.com/2025/11/13/chinese-tech-giant-tencents-quarterly-revenue-rises-15percent-fueled-by-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107429671-1718626670294-gettyimages-2157328594-raa-tencentp240616_npGK5.jpeg?v=1763020455&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T10:03:15.000Z",
    "description": "Tencent on Thursday posted 15% year-on-year revenue growth, with AI boosting the Chinese tech giant's performance in advertising targeting and gaming.",
    "body": "Tencent on Thursday posted 15% year-on-year revenue growth, with AI boosting the Chinese tech giant's performance in advertising targeting and gaming.Here's how Tencent performed in the third quarter of 2025, per earnings released on Thursday: Revenue: 192.9 billion Chinese yuan ($27.12 billion), surpassing the 189.2 billion Chinese yuan expected analysts, according to data compiled by LSEG. Operating profit: 63.6 billion yuan, versus 58.01 billion yuan expected by the street.  Gaming, marketing and social media services, which makes up Tencent's core business, raked in 95.9 billion Chinese yuan, representing 16% year-on-year growth.Domestic games venues rose 15% over the same period, driven by the recently-released \"Delta Force\" and \"VALORANT MOBILE,\" the latter of which has become \"China's most successful mobile game launch year-to-date,\" Tencent said.International gaming efforts, which has been its fastest-growing segment in recent times, soared 43% year-on-year to 20.8 billion Chinese yuan. The firm attributed this growth to \"Clash Royale\" and \"Dying Light: The Beast,\" as well as higher revenues from Supercell's games and an acquisition.Tencent boosted its capital expenditure earlier this year as it ramped up AI and eyed European expansion for its cloud computing services, which would compete against market leaders Amazon Web Services, Google Cloud and Microsoft Azure.The Shenzhen-headquartered company noted higher cloud services revenues, including increased demand for AI-related services.\"Our strategic investments in AI are benefitting us in business areas such as ad targeting and game engagement, as well as in efficiency enhancement areas such as coding, and game and video production,\" said CEO Ma Huateng.The company updated its foundational AI model, HunYuan, improving its coding, math, and science capabilities. The tech firm also uses DeepSeek in some products. Tencent shares are up 56.7% year-to-date. The WeChat owner's financial and business services rose 10% year-on-year to 58.2 billion Chinese yuan for the third quarter of 2025, thanks to higher commercial payments and consumer loans and payments. Tencent recently launched a payment platform, TenPay Global Checkout, which allows some Weixin merchants to accept funding outside of the Chinese mainland.Capital expenditures, which are primarily investments in IT infrastructure, slowed in the third-quarter, totaling 13 billion Chinese yuan.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chinese tech giant Tencent's quarterly revenue rises 15%, fueled by AI",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107429671-1718626670294-gettyimages-2157328594-raa-tencentp240616_npGK5.jpeg?v=1763020455&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T10:03:15.000Z",
      "dateModified": "2025-11-13T10:03:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boston Fed President Collins advocates holding rates steady, sees 'high bar' for further cuts",
    "url": "https://www.cnbc.com/2025/11/12/boston-fed-president-collins-advocates-holding-rates-steady-sees-high-bar-for-further-cuts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225045-1762981409598-gettyimages-2230615538-FED_SYMPOSIUM.jpeg?v=1762981480&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T21:05:40.000Z",
    "description": "Susan Collins, president and chief executive officer of the Federal Reserve Bank of Boston, during a Bloomberg Television interview at the Kansas City",
    "body": "Susan Collins, president and chief executive officer of the Federal Reserve Bank of Boston, during a Bloomberg Television interview at the Kansas City Federal Reserve's Jackson Hole Economic Policy Symposium in Moran, Wyoming, US, on Friday, Aug. 22, 2025. David Paul Morris | Bloomberg | Getty ImagesBoston Federal Reserve President Susan Collins on Wednesday said she will be reluctant to support further interest rate cuts anytime soon with inflation still high and policymakers hampered by a lack of data due to the government shutdown.\"Given my baseline outlook, it will likely be appropriate to keep policy rates at the current level for some time to balance the inflation and employment risks in this highly uncertain environment,\" the central bank official said in remarks delivered in her home district. \"I see several reasons to have a relatively high bar for additional easing in the near term.\"Collins's comments are notable because she is a voting member of the rate-setting Federal Open Market Committee. Her remarks put her on the hawkish side of the rate debate, highlighting a fissure among committee members that led Chair Jerome Powell to say in October that a cut at the December meeting is not a foregone conclusion, despite market pricing of a high probability.Collins supported the quarter percentage point rate cut at the October meeting but indicated that further easing could thwart the Fed's efforts to get inflation lower.While Collins said softness in the labor market \"bears watching,\" she added that the risks of inflation staying above the Fed's 2% target warrant caution.\"Against this backdrop, providing additional monetary support to economic activity runs the risk of slowing – or possibly even stalling – the return of inflation to target,\" she said. \"And with resilient demand, the downside risks to employment, while present, do not seem to have increased further since the summer.\"Collins also noted the role that the government shutdown is playing in her decision making. The impasse appears to be over, but White House press secretary said Wednesday that key reports on inflation and employment may not be available at all for October.\"Absent evidence of a notable labor market deterioration, I would be hesitant to ease policy further, especially given the limited information on inflation due to the government shutdown,\" Collins said.The FOMC in October voted 10-2 for the cut. Governor Stephen Miran voted no because he wanted a bigger reduction, while Kansas City Fed President Jeffrey Schmid opposed because he favored no cut.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boston Fed President Collins advocates holding rates steady, sees 'high bar' for further cuts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225045-1762981409598-gettyimages-2230615538-FED_SYMPOSIUM.jpeg?v=1762981480&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T21:05:40.000Z",
      "dateModified": "2025-11-12T21:05:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Toyota opens new U.S. battery plant, confirms $10 billion in new investments",
    "url": "https://www.cnbc.com/2025/11/12/toyota-battery-plant-north-carolina.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108224954-1762974033885-gettyimages-2245822324-TOYOTA_BATTERY_MANUFACTURING.jpeg?v=1762974166&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T19:07:51.000Z",
    "description": "Toyota's battery manufacturing plant in Liberty, North Carolina, US, on Wednesday, Nov. 12, 2025. Allison Joyce | Bloomberg | Getty ImagesToyota Motor",
    "body": "Toyota's battery manufacturing plant in Liberty, North Carolina, US, on Wednesday, Nov. 12, 2025. Allison Joyce | Bloomberg | Getty ImagesToyota Motor on Wednesday said it has started production at a new $13.9 billion battery plant in North Carolina and confirmed plans to invest up to $10 billion more than previously expected over the next five years in the United States.The Japanese automaker did not release details about the increased investment other than Toyota Motor North America CEO Tetsuo Ogawa calling it a \"pivotal moment\" in the company's history along with the new battery plant, according to a release.The facility is Toyota's first in-house battery plant outside of Japan. It was first announced in December 2021 amid the Biden administration's push to onshore production of batteries for hybrids and all-electric vehicles.Since then, market conditions for EVs have soured, while demand for hybrids continues to grow exponentially. Those changes are positive for Toyota, which is the U.S. leader in hybrid sales with a more than 51% market share through the third quarter of this year, according to Motor Intelligence data.It's unclear how much of the investment was already planned but not made previously public, but the announcement follows President Donald Trump last month saying Toyota would invest $10 billion in the U.S.Toyota and the entire automotive industry have been attempting to navigate production plans amid regulatory changes impacting EVs and Trump's litany of tariffs on new vehicles and parts.Toyota's U.S. sales through the third quarter of this year were up 9.9% to more than 1.3 million vehicles sold.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Toyota opens new U.S. battery plant, confirms $10 billion in new investments",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108224954-1762974033885-gettyimages-2245822324-TOYOTA_BATTERY_MANUFACTURING.jpeg?v=1762974166&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T19:07:51.000Z",
      "dateModified": "2025-11-12T19:07:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Firefly Aerospace shares jump 15% on strong revenues, boosted guidance",
    "url": "https://www.cnbc.com/2025/11/12/firefly-aerospace-fly-q3-earnings-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108183148-1754585171199-gettyimages-2228207223-FIREFLY_IPO.jpeg?v=1762984969&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T04:17:34.000Z",
    "description": "Jason Kim, chief executive officer of Firefly Aerospace, center, during the company's initial public offering at the Nasdaq MarketSite in New York, US",
    "body": "Jason Kim, chief executive officer of Firefly Aerospace, center, during the company's initial public offering at the Nasdaq MarketSite in New York, US, on Thursday, Aug. 7, 2025. Michael Nagle | Bloomberg | Getty ImagesFirefly Aerospace's stock surged 15% on Wednesday after the space technology company issued better-than-expected third-quarter results and lifted its guidance.Revenues in the third quarter jumped nearly 38% to $30.8 million from $22.4 million in the year-ago period and nearly doubled from the previous quarter.Firefly's net loss totaled $140.4 million, or $1.50 per share. The company said net loss included costs tied to its IPO, foreign exchange and executive severanceThe company also lifted its outlook for the year, saying it now expects revenues to range between $150 million and $158 million. That's up from previous guidance in the range of $133 million and $145 million.This is Firefly's second quarterly report as a public company. Last quarter, shares slumped after it posted a bigger loss and lower revenues than analysts were expecting. The Cedar Park, Texas, company went public on the Nasdaq in August during a period of heightened enthusiasm toward space technology. The U.S. government and NASA have leaned on more contracts with companies like Firefly and Elon Musk's SpaceX to support moon missions.But shares of Firefly have lost 70% of their value since their opening day close, and the company's market capitalization has plummeted from about $8.5 billion to about $2.7 billion on Wednesday.In September, Firefly shares sank after a rocket exploded during a ground test at the company's Texas facility, days after receiving clearance from the Federal Aviation Administration over a separate incident. Firefly has since put \"corrective measures\" in place, the company said on Wednesday. Shares dropped 35% in September and are down 24% this month.Firefly in July won a nearly $177 million contract with NASA for an upcoming moon mission, and in October, it announced its acquisition of defense tech firm SciTec to boost its national security portfolio.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Firefly Aerospace shares jump 15% on strong revenues, boosted guidance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108183148-1754585171199-gettyimages-2228207223-FIREFLY_IPO.jpeg?v=1762984969&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T04:17:34.000Z",
      "dateModified": "2025-11-13T04:17:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China’s Singles' Day stumbles as frugal shoppers shrink the world’s biggest sale",
    "url": "https://www.cnbc.com/2025/11/13/chinas-singles-day-stumbles-as-frugal-shoppers-shrink-the-worlds-biggest-sale.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107352703-1703866504733-gettyimages-1885175456-cfoto-illustra231229_npClN.jpeg?v=1762847018&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T09:36:23.000Z",
    "description": "JD.com and Alibaba are operating in Suqian City, Jiangsu Province, China, on Dec. 29, 2023.Costfoto | Nurphoto | Getty ImagesBEIJING — Preliminary fig",
    "body": "JD.com and Alibaba are operating in Suqian City, Jiangsu Province, China, on Dec. 29, 2023.Costfoto | Nurphoto | Getty ImagesBEIJING — Preliminary figures for China's biggest shopping event of the year indicated slower sales as consumers tie their purse strings tighter amid weak economic growth.The Double 11 shopping festival this year recorded 1.695 trillion yuan (about $238 billion) in sales across all platforms, marking a 14.2% jump year on year, according to Chinese consumer research firm Syntun. That's slower than the 26.6% year on year growth last year.Consumers were \"more rational and willing to pay for real value, exhibiting a \"tiered system based on needs\" characteristic,\" according to a Google translation of the report.Singles' Day, also known as Double 11, is China's biggest shopping event of the year and, in terms of value of goods sold, far exceeds that of Black Friday in the U.S.But as China's economic growth has slowed, companies have increasingly extended the promotional period, and stopped reporting gross merchandise volume — an industry measure of sales over time.China's top leaders last month signaled they will increase efforts to support consumption. Beijing has preferred to subsidize consumer purchases of targeted goods such as electronics, rather than handing out cash.The country is expected to report 2.8% year-on-year growth in retail sales for October, according to a Reuters poll. That would be down from 3% growth in September.Jacob Cooke, co-founder and CEO of WPIC Marketing + Technologies, which helps Western consumer brands sell online in China, estimated overall sales growth this year will be in the \"high-single digits to low-double digits\" versus in 2024.Still, more than 10 flagship online stores selling from fashion to health products saw orders at least 30% above expectations, Cooke said.\"That's really rare for us,\" he added. \"We wouldn't like to underestimate or overestimate our internal numbers.\"AI boostDuring the sales period, e-commerce platforms received a boost from integrating artificial intelligence in their supply chain.JD.com reported a record transaction value for this Singles' Day as of Tuesday midnight, without disclosing the amount. The consumer electronics-focused platform reported a nearly 60% increase in orders and over 40% growth in users placing orders.The Chinese giant kicked off its promotions this year on Oct. 9, several days earlier than last year.Alibaba in contrast is pushing its shopping event through Nov. 14 this year, after kicking off promotions on Oct. 15.The two companies, along with Tiktok shop, ushered in 67 billion yuan solely on instant retail sale, a 138.4% year-on-year increase, according to data from Syntun.In contrast, community group-buying, where consumers create groups to buy groceries in bulk, brought in 9 billion yuan – a 35.3% year-on-year decrease, the report showed.Chinese smartphone and consumer electronics giant Xiaomi said that as of 11:59 p.m. Tuesday, it had sold 29 billion yuan worth of goods across online platforms and physical stores for the Singles' Day period.Last year, Xiaomi started its campaign one day earlier and reported 31.9 billion yuan in sales.Across all product categories, Syntun recorded that home appliances ranked first for 16.5% of total sales (266.8 billion yuan) followed by mobile phones and digital products (14.6% of total sales), and apparels (14%).Changing consumption patternsThe Singles' Day numbers are a significant indicator of fourth-quarter spending trends that help consumer brands determine how to position for the next two quarters of the upcoming year, WPIC Marketing + Technologies' Cooke said.Consumption trends during the sales period showed that growth may be uneven across categories.The mother and baby category underperformed during the Singles' Day period, while pet products were in line with expectations, Cooke observed. Meanwhile, toys aimed at older audiences were \"coming down to earth\" after skyrocketing in popularity last year, he added.Syntun's data showed that the mother and baby category ranked 9th place in sales, bringing in about 61.1 billion yuan, while pet food reached 9.4 billion yuan sales across four e-commerce platforms – Alibaba, JD.com, TikTok shop, and Kuaishou.Syntun's report also showed that consumers were more focused on health, convenience and purchasing from brands that reflected their values.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China’s Singles' Day stumbles as frugal shoppers shrink the world’s biggest sale",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107352703-1703866504733-gettyimages-1885175456-cfoto-illustra231229_npClN.jpeg?v=1762847018&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T09:36:23.000Z",
      "dateModified": "2025-11-13T09:36:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK economy barely grows in the third quarter, missing forecasts ahead of crucial budget",
    "url": "https://www.cnbc.com/2025/11/13/uk-q3-gdp-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107419659-1716532406111-gettyimages-2151314667-20240506_oxford_street_rain_003.jpeg?v=1716532444&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T07:58:23.000Z",
    "description": "Shoppers and visitors on London's Oxford Street brave the bad weather using Union Flag umbrellas on 6th May 2024.Mike Kemp | In Pictures | Getty Image",
    "body": "Shoppers and visitors on London's Oxford Street brave the bad weather using Union Flag umbrellas on 6th May 2024.Mike Kemp | In Pictures | Getty ImagesThe U.K. economy grew a meager 0.1% in the third quarter, according to preliminary figures from the Office for National Statistics, marking one of the last major pieces of economic data to be released ahead of the Autumn Budget.Economists polled by Reuters expected the economy to have grown 0.2% over the July-September period, following an expansion of 0.3% in the second quarter.Month-on-month, the economy shrank by 0.1% in September, following no growth in August (which was revised down from a 0.1% expansion in the ONS' previous data).\"Growth slowed further in the third quarter of the year with both services and construction weaker than in the previous period. There was also a further contraction in production,\" Liz McKeown, director of Economic Statistics at the ONS, said on Thursday.Across the quarter as a whole manufacturing drove the weakness in production, the ONS said, highlighting the cyber attack on Jaguar Land Rover, which halted production for five weeks, as a major source of economic disruption.\"There was a particularly marked fall in car production in September, reflecting the impact of a cyber incident, as well as a decline in the often-erratic pharmaceutical industry,\" McKeown said in comments posted on social media platform X.Budget boost, or blow?The data comes ahead of the British government's highly anticipated Autumn Budget on Nov. 26, at which Finance Minister Rachel Reeves is expected to announce fresh tax hikes in order to fill a fiscal black hole.There are concerns that tax hikes could put a dampener on consumer spending and economic activity, but the economy could get a pre-Christmas boost if the Bank of England cuts interest rates at its last meeting of the year on Dec. 18.Responding to the latest growth data, Reeves said: \"At my Budget later this month, I will take the fair decisions to build a strong economy that helps us to continue to cut waiting lists, cut the national debt and cut the cost of living.\"Rachel Reeves, U.K. chancellor of the exchequer, delivers a speech in London, UK, on Tuesday, Nov. 4, 2025. Bloomberg | Bloomberg | Getty Images\"All eyes will now be on the upcoming Budget with another weak GDP reading only adding to debates around which levers the Chancellor can pull to stimulate growth,\" Scott Gardner, investment strategist at JPMorgan Personal Investing, said in emailed analysis.\"In our view, boosting housing market activity is key to unlocking decent, sustained growth ... That said, with tax rises all but confirmed, consumption and, in turn, services spending could face more headwinds from the second quarter of next year when tax and spend measures could come into place. It remains all to play for,\" he added.Amanda Blanc, chief executive of Aviva, told CNBC's \"Squawk Box Europe\" on Thursday that the budget \"can't come soon enough,\" with businesses and consumers seemingly nervous about what's in store. \"You can deal with certainty, what you can't deal with is speculation,\" she said.Read moreAt its most recent meeting last week, the Bank of England held off trimming rates with BOE Governor Andrew Bailey telling CNBC that he and the bank's monetary policy committee wanted to see another batch of inflation and labor market prints before acting.Rob Wood, chief U.K. economist at Pantheon Macroeconomics, was among the economists expecting a Christmas rate cut whether the latest GDP data showed a bounce, or not.\"We believe the MPC [BOE's monetary policy committee) would reduce rates in December even with an upside GDP surprise, as a likely contractionary Budget on November 26 dominates its deliberations,\" Wood said in emailed analysis ahead of the GDP data.\"But growth is proving resilient, running close to the U.K.'s potential of 0.3% quarter-to-quarter despite strong headwinds from fiscal and global uncertainty.\"Wood believed that resilient growth would limit the emergence of spare capacity, making it trickier for the BOE to cut interest rates again in 2026, although some economists predict there could be two rate cuts next year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK economy barely grows in the third quarter, missing forecasts ahead of crucial budget",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107419659-1716532406111-gettyimages-2151314667-20240506_oxford_street_rain_003.jpeg?v=1716532444&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T07:58:23.000Z",
      "dateModified": "2025-11-13T07:58:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI startup Code Metal is going beyond vibe coding with the help of $36 million in fresh capital",
    "url": "https://www.cnbc.com/2025/11/12/ai-startup-code-metal-raises-36-million-in-funding-round-led-by-accel.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108224891-1762968392253-CodeMetal_cofounders.jpeg?v=1762969890&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T18:24:22.000Z",
    "description": "Code Metal co-founders (L-R): SVP of technology Alex Showalter-Bucher, and CEO Peter MoralesCourtesy Code Metal Inc.Peter Morales started Code Metal t",
    "body": "Code Metal co-founders (L-R): SVP of technology Alex Showalter-Bucher, and CEO Peter MoralesCourtesy Code Metal Inc.Peter Morales started Code Metal two years ago, jumping into the market for artificial intelligence coding tools at a time when AI companies were rapidly changing the market for software development.Now he's got $36.5 million in the bank, thanks to an investment led by venture firm Accel Partners, known for early bets on Facebook, Dropbox and Atlassian.Code Metal's technology allows software engineers to write code once, then automatically translate it into any other programming language so they can ship new features faster and to a wider swath of users. Morales, who was previously technology chief at a gaming company, said Code Metal's offering is particularly appealing to developers working on software to run appliances, consumer electronics, factory robotics, autos and medical devices.Those are industries with products that contain a wide array of chips, which come with different software development kits, operating systems and code libraries. Morales gave the example of an automaker creating a feature for a new model sports car running on the latest Nvidia chip, and the challenge of porting the code behind the feature to the company's older line of minivans. Code Metal's AI would automatically handle the translation.Morales is positioning the company as distinct from so-called vibe-coding platforms like Cursor or Anthropic's Claude Code, which allow users to automate much of the process of writing software with text prompts.\"Vibe coding is all about explaining an initial idea in text, and generating code that will get you started developing your minimum viable product,\" Morales said. \"This is not where most companies spend their time. Code Metal focuses on bringing code to production. That requires strong guarantees the code we're converting is accurate, compliant and working as expected.\"Morales said large language models alone can't provide this level of certainty, so Code Metal employs what computer scientists call formal methods to check the code and make it's been translated correctly.The company, based in Boston, says it's already struck contracts worth tens of millions of dollars with commercial and public sector clients, including the U.S. Air Force, L3Harris and Raytheon as well as some automotive suppliers and consumer electronics brands.Accel's Steve Loughlin, who led the deal, said Code Metal is the fastest growing company in his firm's portfolio of early-stage startups, and that demand for its technology is surging.\"The market opportunity is practically uncapped here,\" Loughlin said, \"to help people develop on the edge much faster and modernize legacy code.\"Code Metal's earlier backers J2 ventures and Shield Capital also participated in the round, along with Bosch ventures and Raytheon's RTX Ventures.WATCH: The rise of AI 'vibe coding'watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI startup Code Metal is going beyond vibe coding with the help of $36 million in fresh capital",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108224891-1762968392253-CodeMetal_cofounders.jpeg?v=1762969890&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T18:24:22.000Z",
      "dateModified": "2025-11-12T18:24:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Skims valued at $5 billion after new funding round as it accelerates store expansion",
    "url": "https://www.cnbc.com/2025/11/12/skims-5-billion-valuation-funding-round.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108121079-1742927804135-gettyimages-2206877420-img_4433_cd0vuqds.jpeg?v=1742927844&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T20:06:38.000Z",
    "description": "Skims underwear is displayed on a shelf at a Nordstrom store on March 25, 2025 in Corte Madera, California. Justin Sullivan | Getty ImagesKim Kardashi",
    "body": "Skims underwear is displayed on a shelf at a Nordstrom store on March 25, 2025 in Corte Madera, California. Justin Sullivan | Getty ImagesKim Kardashian's Skims brand has raised $225 million in new funding led by Goldman Sachs Alternatives, valuing the shapewear and apparel company at $5 billion — up from roughly $4 billion after its 2023 round.The deal comes as Skims nears $1 billion in annual net sales, six years after its 2019 launch, and marks one of the largest private raises for a U.S. consumer brand this year. BDT & MSD Partners' affiliated funds also joined the round, Skims said Wednesday.Skims plans to use the new capital to accelerate brick-and-mortar and international expansion, as well as product innovation and category diversification. The company has 18 stores across the U.S. in cities including New York, Los Angeles, Austin and Atlanta and one in Mexico, with plans to open additional stores overseas in 2026.Skims said it's laying the groundwork to become a \"predominantly physical business\" in the coming years, a pivot for a company that built its reputation as a digital-first direct-to-consumer brand.\"This milestone reflects continued confidence in our long-term vision and coupled with disciplined execution, positions Skims to unlock its next phase of growth,\" CEO and co-founder Jens Grede said in a statement.The new funding follows the debut of NikeSkims, a partnership with Nike that launched earlier this year and sold out within hours. The collaboration signals Skims' ambitions to scale beyond its core shapewear products and into activewear, apparel and performance categories, pushing the brand further into the mainstream athleticwear market dominated by Lululemon, a handful of upstarts and Nike itself.The new capital infusion could further delay an IPO from Skims. The company has been eyeing a public debut since at least 2024, based on statements by Grede.The consumer IPO market has been largely stagnant in 2024 and 2025, with few fashion or beauty brands debuting as investors turn cautious on discretionary retail. By raising new private funding, Skims can continue to scale without immediate pressure to list.\"Skims stands as a solutions-driven apparel innovator, pioneering new categories and redefining everyday wear,\" said Beat Cabiallavetta, global head of hybrid capital at Goldman Sachs Alternatives. \"We look forward to partnering with management to pursue significant opportunities and deliver disruptive, sustained growth.\"Since its launch, Skims has built a cult following with its inclusive sizing, minimalist aesthetic and high-profile campaigns featuring global athletes and celebrities. Kardashian, who serves as chief creative officer, said the new funding marks \"an exciting new chapter\" for the company.\"We can't wait to take Skims to the next level as we continue to innovate and set the standard for our industry,\" Kardashian said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Skims valued at $5 billion after new funding round as it accelerates store expansion",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108121079-1742927804135-gettyimages-2206877420-img_4433_cd0vuqds.jpeg?v=1742927844&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T20:06:38.000Z",
      "dateModified": "2025-11-12T20:06:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney posts mixed results as streaming growth is offset by legacy TV declines",
    "url": "https://www.cnbc.com/2025/11/13/disney-dis-earnings-q4-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108016949-1722962216313-gettyimages-2155779205-img_2019_wd10_05312024.jpeg?v=1762962226&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T12:08:26.000Z",
    "description": "A statue of Walt Disney and Mickey Mouse stands in a garden in front of Cinderella's Castle at the Magic Kingdom Park at Walt Disney World on May 31, ",
    "body": "A statue of Walt Disney and Mickey Mouse stands in a garden in front of Cinderella's Castle at the Magic Kingdom Park at Walt Disney World on May 31, 2024, in Orlando, Florida.Gary Hershorn | Corbis News | Getty ImagesDisney reported fiscal fourth-quarter earnings on Thursday that topped analyst expectations for earnings but missed on revenue as the company's entertainment business was weighed down by its TV networks and a lackluster theatrical film slate.Disney stock fell more than 3% in premarket trading.Here is what Disney reported for the period ended Sept. 27, compared with what Wall Street expected, according to LSEG: Earnings per share: $1.11 adjusted vs. $1.05 expectedRevenue: $22.46 billion vs. $22.75 billion expectedNet income for the quarter was $1.44 billion, or 73 cents a share, more than double the $564 million, or 25 cents per share, that Disney reported in the same period last year. Adjusting for one-time items Disney reported earnings per share of $1.11. The company's overall revenue for the quarter was nearly $22.5 billion, slightly less than the same quarter last year. \"Overall we're leaving the year with a lot of momentum,\" Disney CFO Hugh Johnston told CNBC's \"Squawk Box\" regarding the company's streaming and experiences businesses.Revenue for the entertainment unit fell 6% from last year to $10.21 billion, dragged down by the linear TV networks and theatrical releases. Streaming remained the bright spot in the business as consumers continued to turn away from the pay TV bundle. Operating income for the linear networks dropped 21% to $391 million while it rose 39%, to $352 million, for streaming. The higher operating income for streaming occurred as prices increased for Disney's streaming services. Advertising revenue for the networks, which includes broadcast network ABC and pay TV channels like FX, also suffered.DIsney's TV networks, including ESPN, have been unavailable for customers of Google's YouTube TV, a streaming provider of the pay TV bundle since Oct. 31 due to an ongoing carriage dispute between the two companies.The flagship streaming service Disney+ added 3.8 million paid subscribers, bringing its total to 131.6 million, while Hulu had 64.1 million customers. Disney has been in the process of integrating Hulu — which it took full control of earlier this year — into the Disney+ app. This marks the last time the company will report subscriber numbers and the average revenue per unit, or ARPU, for its streaming services, which includes Disney+ and Hulu.Instead, Disney will follow in the footsteps of streaming behemoth Netflix, which earlier this year stopped updating investors on its subscriber count.Revenue for Disney's sports division, namely ESPN, was up 3% to roughly $4 billion, while operating income was flat at $898 million when compared with the same period last year. ESPN's domestic operating income in particular decreased due to costs associated with the launch of the ESPN direct-to-consumer streaming app in August, as well as higher programming costs. Meanwhile, revenue for the experiences segment, which consists of theme parks, resorts and cruises, as well as consumer products, rose 6% to $8.77 billion. Operating income for the segment was up 13% to $1.88 billion. Disney attributed the growth in its cruise business to its gains, despite being offset by higher fleet expansion costs. Disney's fleet will expand once again later this month.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney posts mixed results as streaming growth is offset by legacy TV declines",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108016949-1722962216313-gettyimages-2155779205-img_2019_wd10_05312024.jpeg?v=1762962226&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T12:08:26.000Z",
      "dateModified": "2025-11-13T12:08:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Starbucks workers union launches strike in at least 40 cities on chain's key holiday sales day",
    "url": "https://www.cnbc.com/2025/11/13/starbucks-workers-united-union-strike-red-cup-day.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108206636-17593432022025-10-01t182508z_1342327388_rc213ha4h81h_rtrmadp_0_starbucks-labor.jpeg?v=1759343263&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T10:03:49.000Z",
    "description": "Workers picket in front of a Starbucks outlet in New York City, U.S., Oct. 1, 2025.Brendan McDermid | ReutersStarbucks Workers United launched an open",
    "body": "Workers picket in front of a Starbucks outlet in New York City, U.S., Oct. 1, 2025.Brendan McDermid | ReutersStarbucks Workers United launched an open-ended strike in at least 40 cities Thursday on Red Cup Day, one of the chain's biggest sales days of the year.The protest, which the union says involves more than 1,000 baristas in over 65 stores, comes after Workers United voted to authorize an open-ended strike after baristas and the coffee giant failed to reach a collective bargaining agreement.The strike could hurt business during Starbucks' busy holiday season, which typically provides a sales boost and will be key to the chain's plan to turn around performance in the U.S. under new CEO Brian Niccol. Starbucks broke a nearly two-year streak of same-store sales declines in its most recently reported quarter. Past strikes have impacted less than 1% of its stores, the company said.The union is pushing for improved hours, higher wages and the resolution of hundreds of unfair labor practice charges levied against Starbucks. The two parties have not been in active negotiations to reach a contract after talks between them fell apart late last year.Starbucks and the union entered into mediation in February, and hundreds of barista delegates voted down the economic package Starbucks proposed in April. Both sides have pointed blame at the other for failure to reach a bargaining agreement, and say they're ready to negotiate.Workers United, which began organizing at Starbucks in 2021, says it now represents more than 12,000 workers across more than 550 stores. The company last week told CNBC that the union only represents 9,500 workers at 550 cafes.The baristas say they are prepared to escalate the work stoppage, threatening to make this \"the largest, longest strike in company history if Starbucks fails to deliver a fair union contract and resolve unfair labor practice charges.\" It is seeking new proposals that address its top issues to finalize a contract.\"If Starbucks keeps stonewalling a fair contract and refusing to end union-busting, they'll see their business grind to a halt,\" Starbucks Workers United spokesperson Michelle Eisen, a former barista who spent 15 years at the company, said in a statement. \"No contract, no coffee is more than a tagline — it's a pledge to interrupt Starbucks operations and profits until a fair union contract and an end to unfair labor practices are won. Starbucks knows where we stand.\"In response to the strike vote results last week, Starbucks previously said it will be ready to serve customers across its nearly 18,000 company-operated and licensed stores this holiday season.\"Starbucks offers the best job in retail, including more than $30 an hour on average in pay and benefits for hourly partners. Workers United, which represents only 4% of our partners, chose to walk away from the bargaining table. We've asked them to return—many times. If they're ready to come back, we're ready to talk. We believe we can move quickly to a reasonable deal,\" Starbucks spokesperson Jaci Anderson told CNBC in a statement Monday.In a letter to workers addressing the strike authorization vote last week, Sara Kelly, chief partner officer at Starbucks, echoed the belief that the sides could reach an agreement swiftly.\"For months, we were at the bargaining table, working in good faith with Workers United and delegates from across the country to reach agreements that make sense for partners and for the long-term success of Starbucks,\" Kelly said. \"We reached more than 30 tentative agreements on full contract articles.\"\"Our commitment to bargaining hasn't changed,\" she added. \"Workers United walked away from the table but if they are ready to come back, we're ready to talk. We believe we can move quickly to a reasonable deal.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Starbucks workers union launches strike in at least 40 cities on chain's key holiday sales day",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108206636-17593432022025-10-01t182508z_1342327388_rc213ha4h81h_rtrmadp_0_starbucks-labor.jpeg?v=1759343263&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T10:03:49.000Z",
      "dateModified": "2025-11-13T10:03:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scotland to launch 'kilt' bonds as it seeks to become an investor friendly destination",
    "url": "https://www.cnbc.com/2025/11/13/scotland-to-launch-government-kilt-bonds.html",
    "image": "https://image.cnbcfm.com/api/v1/image/103760654-GettyImages-543132636.jpg?v=1763030930&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T12:10:21.000Z",
    "description": "The Scottish Parliament is  pictured at sunset from Salisbury Crags in Holyrood Park, Edinburgh, ScotlandOli Scarff | AFP | Getty ImagesThe Scottish g",
    "body": "The Scottish Parliament is  pictured at sunset from Salisbury Crags in Holyrood Park, Edinburgh, ScotlandOli Scarff | AFP | Getty ImagesThe Scottish government announced plans on Thursday to issue its first sovereign bonds in 2026/27, as it looks to raise funds for infrastructure investments.It will be the first issuance in a planned £1.5 billion ($1.97 billion) bond program that's set to be rolled out over the next parliamentary period, which begins with elections in May next year. However, officials noted that the plans were subject to the outcome of the government elections.Scotland is part of the U.K., but operates as a devolved nation, which means it has its own government. While the Scottish parliament has certain limited powers over income tax and parts of the economy, decisions on macroeconomic policy are reserved to the U.K. government.On Wednesday, S&P Global and Moody's gave the Scottish government its first credit ratings, with agencies awarding Scotland ratings equivalent to the U.K. – and higher ratings than the governments of Spain, Italy and Japan.'Investor friendly destination'\"The Scottish Government's high credit ratings are testament to Scotland's strong institutions, track record of responsible fiscal management and pro-business environment,\" Scotland's First Minister John Swinney said in a statement on Thursday.He argued the issuance of Scottish government bonds — which have become colloquially known as kilts — are a step toward \"a prosperous future where our country takes responsibility for its own decisions.\"\"Whilst specific issuance plans will be subject to market conditions closer to the time, we will shortly commence engagement with banks to act as joint lead managers to enable the next Scottish Government to proceed without delay,\" Swinney added on Thursday.Scotland's government was granted the power to issue its own bonds almost a decade ago, but until now has borrowed money using the U.K.'s National Loans Fund.In 2023, the Scottish Government's Investor Panel recommended floating sovereign bonds on the public market as a means of raising the country's profile and attracting inward investment.Scotland's credit rating would help the country make progress toward these ambitions, said Angus Macpherson, chairman of financial advisory firm Noble and Co, and former co-chair of the Investor Panel.\"This is a positive step forward and demonstrates they are serious about becoming a more investor friendly destination,\" he said in a Thursday statement.Accounting giant EY is advising the Scottish government on its bond issuance.Scottish independenceBoth Moody's and S&P Global stressed this week that the credit rating given to Scotland were granted to the country as a devolved U.K. nation.\"We could … lower the rating if Scotland took material steps toward independence from the U.K.,\" S&P Global said on Wednesday. \"Our rating on Scotland reflects our view of the U.K.'s supportive and clearly defined institutional framework for devolved regions (nations), as well as Scotland's prudent financial policies.\"The agency noted that Scotland will continue to receive a large grant from the U.K. to cover most of its spending, including infrastructure investments.\"Limited borrowing requirements and gradually maturing liabilities will result in very low total debt at only 10% of operating revenue through 2027,\" S&P Global added.Meanwhile, Moody's said a downgrade to the U.K.'s sovereign rating would likely have similar implications for Scotland.\"Difficulties in balancing its budget either as a result of rapidly rising expenditure pressures or large reductions in the block grant would also put downward pressure on the rating,\" the agency said as it explained the rationale behind its rating for Scotland.Read more\"Although not our baseline scenario, Scottish independence could exert downward pressure on the rating by introducing heightened uncertainty about the institutional framework and potentially raising financial stability risks.\"Scotland's electorate narrowly voted against breaking away from the U.K. in a 2014 referendum, but Swinney's government has insisted the country should continue to pursue independence.\"Scotland is a wealthy country with enormous potential, yet too many people in Scotland today are finding it difficult to make ends meet,\" he said in a paper that made the case for independence when it was published last month.\"That is because standards of living in the U.K. have barely improved in over 15 years due to decisions taken by Westminster, like the imposition of austerity and the disastrous decision to leave the European Union.\"U.K. economic growth slowed to a lower-than-expected 0.1% in the third quarter of this year, data released on Thursday showed. Later this month, U.K. Finance Minister Rachel Reeves is widely expected to raise the country's tax burden as the country reels from a cost of living crisis that took hold in the wake of the Covid-19 pandemic.The U.K. currently has the highest long-term borrowing costs of any G-7 government, with its 30-year government bond yield trading well above the critical 5% threshold.— CNBC's Hugh Leask contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scotland to launch 'kilt' bonds as it seeks to become an investor friendly destination",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/103760654-GettyImages-543132636.jpg?v=1763030930&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T12:10:21.000Z",
      "dateModified": "2025-11-13T12:10:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Supreme Court to hear arguments on Trump bid to fire Fed Gov. Lisa Cook on Jan. 21",
    "url": "https://www.cnbc.com/2025/11/12/trump-fed-lisa-cook-supreme-court.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220769-1762199243507-gettyimages-2244375890-COOK_FED.jpeg?v=1762199273&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T19:32:39.000Z",
    "description": "Lisa Cook, governor of the US Federal Reserve, at The Brookings Institute in Washington, DC, US, on Monday, Nov. 3, 2025. Aaron Schwartz | Bloomberg |",
    "body": "Lisa Cook, governor of the US Federal Reserve, at The Brookings Institute in Washington, DC, US, on Monday, Nov. 3, 2025. Aaron Schwartz | Bloomberg | Getty ImagesThe Supreme Court said Wednesday that it will hear oral arguments in the case challenging President Donald Trump's authority to fire Federal Reserve Gov. Lisa Cook on Jan. 21.Trump said on Aug. 25 that he was firing Cook, one of seven Fed governors, citing claims that she committed mortgage fraud in connection with two residences that she owns.Cook, who denies any wrongdoing, filed a lawsuit seeking to block her removal.A federal district court judge in Washington, D.C., in early September ruled that Cook could not be fired from the board while her suit was pending. The U.S. Court of Appeals for the District of Columbia soon after upheld that ruling, leading Trump to ask the Supreme Court to rule on his power to fire her.Read more CNBC politics coverageDemocrats win big on Election Night in key racesZohran Mamdani wins New York City mayor's race, NBC News projectsDemocratic candidate Mikie Sherrill wins New Jersey governor's race, NBC News projectsDemocrats win Virginia governor, attorney general races, NBC News projectsSNAP update: Trump admin will pay 50% of food stamp benefits in November amid shutdownTrump says he has 'no idea who' Binance's CZ is after pardoning himTrump backtracks on attending Supreme Court tariffs case argumentsIn the initial ruling blocking Cook's removal, District Court Judge Jia Cobb wrote, \"Cook has made a strong showing that her purported removal was done in violation of the Federal Reserve Act's 'for cause' provision.\"\"The best reading\" of that provision is that legal cause for removing a Fed governor is limited to actions related to their \"behavior in office,\" Cobb wrote.The allegations against Cook relate to conduct that predates her serving on the Fed.Solicitor General D. John Sauer, who is representing the Trump administration in the case, has argued in a filing with the Supreme Court that the president should be allowed to remove her while her suit is pending because she does not have \"a Fifth Amendment property interest in her continued service as a Governor of the Federal Reserve System.\"Sauer also wrote that although the Federal Reserve Act rules out removal for \"no reason at all, or for policy disagreement ... so long as the President identifies a cause, the determination of 'some cause relating to the conduct, ability, fitness, or competence of the officer' is within the President's unreviewable discretion.\"Trump tried to fire Cook, who is the first Black woman to serve on the Fed's Board of Governors, after months of unsuccessfully pressuring the board and Fed Chair Jerome Powell to lower interest rates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Supreme Court to hear arguments on Trump bid to fire Fed Gov. Lisa Cook on Jan. 21",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220769-1762199243507-gettyimages-2244375890-COOK_FED.jpeg?v=1762199273&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T19:32:39.000Z",
      "dateModified": "2025-11-12T19:32:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Defense startup Govini founder Eric Gillespie charged in child sex sting",
    "url": "https://www.cnbc.com/2025/11/12/govini-eric-gillespie-sex-sting-pentagon.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108132334-17447457472025-03-21t152931z_1089295807_rc2qhday7xzp_rtrmadp_0_usa-trump-musk-china.jpeg?v=1744745785&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T10:25:33.000Z",
    "description": "Mug shot of Eric Gillespie, Govini Founder and Chairman.Courtesy: Pennsylvania Attorney GeneralThe founder of Virginia-based defense startup Govini wa",
    "body": "Mug shot of Eric Gillespie, Govini Founder and Chairman.Courtesy: Pennsylvania Attorney GeneralThe founder of Virginia-based defense startup Govini was arrested on charges of attempting to solicit a pre-teen girl for sexual contact in Pennsylvania, authorities said Monday.The founder, Eric Gillespie, 57, was charged with four felonies, including multiple counts of unlawful contact with a minor, according to the Pennsylvania Attorney General's Office.Gillespie, who lives in Pittsburgh, was denied bail by the judge, citing flight risk and concerns over public safety.His company, which placed him on administrative leave on Monday, has a $900-million U.S. government contract, and multiple deals with the Defense Department.Govini last month announced it had passed $100 million in annual recurring revenue. It is considered a prominent \"unicorn\" in the defense technology space, is a key partner in the U.S. Army's Next Generation Command Control program.Pentagon officials told CNBC they are looking into Gillespie's arrest and possible security issues.\"While the Department cannot comment on individual security clearances in accordance with the Privacy Act, we take these allegations very seriously,\" a senior War Department official said in a statement.Gillespie lists himself as executive chairman of Govini on his LinkedIn page.Gillespie was considered an expert in transparency in government and was appointed to the Freedom of Information Act Advisory Committee by the Obama Administration in 2014.The White House referred all security clearance questions about him to the Pentagon.A Govini spokesperson, in a statement on Wednesday, said that the company \"was notified of felony charges against Eric Gillespie\" on Monday.\"As soon as we learned of these charges, we took immediate action to place Mr. Gillespie on administrative leave,\" the spokesperson said.\"The Company will fully cooperate with law enforcement in connection with their investigation. We acknowledge the severity of these charges and as a Company will hold all our employees to the highest ethical standards. We stand steadfast in support of all victims of abuse of any kind.\"According to the Attorney General's office, an agent posed as an adult on an online chat platform, which is often utilized by offenders who try to arrange meetings with children, and engaged in a conversation with Gillespie.Read more CNBC tech newsAI spending is not all equal. Wall Street rewards hyperscalers, punishes DoorDash and DuolingoOura expects close to $2 billion in 2026 sales, almost doubling for the second consecutive yearTesla investor support for Elon Musk's massive pay plan was lower in 2025 than in 2018Former Google, Meta executives raise $100 million for high-capacity AI servers startupGillespie then tried to arrange a meeting with someone he believed to be a pre-teenage girl in Lebanon County, near Hershey, the office said.\"During the investigation, Gillespie alluded to methods he accessed children, and other evidence was found regarding contact with children,\" the office said.The AG's office would not comment on questions about electronic devices seized during the sting. The office is asking the public to come forward with any other information on the case.Govini, along with Anduril Industries, Palantir, Striveworks, Instant Connect Enterprise, Research Innovations, Inc., Microsoft and Lockheed Martin are also a part of the $99.6 million U.S. Army's Next Generation Command and Control program.NGC2 is a program for the U.S. Army to transform command and control operations by ensuring commanders have access to critical real-time data and infrastructure in areas where communications may be disrupted.According to the company, Govini's suite of AI-enabled applications is used by every department of the U.S. military and other federal agencies. The access to sensitive information is vast.The software analyzes supply chains and critical details of companies being considered by the U.S. government for acquisition, enabling the U.S. military to make informed decisions.In a recent Bain Capital press release announcing a $150m investment of Govini, Scott Kirk, Partner at Bain Capital Tech Opportunities, said, \"We're thrilled to support Govini's next phase of growth as it continues to revolutionize how the U.S. government acquires and deploys the capabilities that keep us safe.\"Bain has not responded to CNBC's multiple emails for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Defense startup Govini founder Eric Gillespie charged in child sex sting",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108132334-17447457472025-03-21t152931z_1089295807_rc2qhday7xzp_rtrmadp_0_usa-trump-musk-china.jpeg?v=1744745785&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T10:25:33.000Z",
      "dateModified": "2025-11-13T10:25:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cisco's stock jumps on earnings beat, strong guidance and $1.3 billion in AI orders",
    "url": "https://www.cnbc.com/2025/11/12/cisco-csco-q1-2026-earnings-report.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108090587-1737562466454-1U8A1107.JPG?v=1737562641&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T23:26:28.000Z",
    "description": "Chuck Robbins, Cisco CEO, speaking on CNBC's Squawk Box outside the World Economic Forum in Davos, Switzerland on Jan. 22, 2025.Gerry Miller | CNBCCis",
    "body": "Chuck Robbins, Cisco CEO, speaking on CNBC's Squawk Box outside the World Economic Forum in Davos, Switzerland on Jan. 22, 2025.Gerry Miller | CNBCCisco reported better-than-expected profit and revenue for its fiscal first quarter on Wednesday. The stock rose more than 7% in extended trading.Here's how the company did in comparison with consensus estimates from LSEG:Earnings per share: $1 adjusted vs. 98 cents expectedRevenue: $14.88 billion vs. $14.77 billion expectedRevenue increased 8% from $13.84 billion in the same period a year earlier, Cisco said in a statement. Net income climbed to $2.86 billion, or 72 cents per share, from $2.71 billion, or 68 cents per share, a year ago.It's the fourth straight quarter of growth for Cisco following a stretch of four consecutive year-over-year revenue declines, as the company contended with economic uncertainty and delayed spending from government agencies.Cisco's networking business, its biggest unit, saw sales climb 15% to $7.77 billion. Analysts were expecting revenue for that segment of $7.47 billion, according to StreetAccount.Most of the growth in data center spending is focused on artificial intelligence, as companies bolster their investments in servers packed with graphics processing units, primarily from Nvidia. Cisco is trying to tie itself more closely to the AI boom, and last month introduced a new Ethernet switch based on Nvidia silicon.Cisco said that AI infrastructure orders from \"hyperscaler customers\" reached $1.3 billion, \"reflecting a significant acceleration in growth.\"\"Our relevance in AI continues to build,\" CFO Mark Patterson said in the press release. \"We have a multi-year, multi-billion-dollar campus refresh opportunity starting to ramp, with strong demand for our refreshed networking products.\" For the fiscal second quarter, Cisco said it expects revenue of $15 billion to $15.2 billion, topping the $14.6 billion average estimate, according to LSEG. Adjusted earnings will be $1.01 to $1.03 per share, exceeding the 99-cent average estimate.Revenue for the full fiscal year will be between $60.2 billion and $61 billion, with earnings per share of $4.08 to $4.14, Cisco said. Analysts expect sales of $59.7 billion and EPS of $4.04.While networking is growing and performing better than expected, Cisco's other two main segments saw revenue declines and missed Wall Street's expectations.Sales in the company's security unit fell 2% from a year earlier to $1.98 billion, missing the average estimate of $2.16 billion, according to StreetAccount. And collaboration sales slipped 3% to $1.06 billion, trailing the $1.09 billion average estimate.Cisco shares are up 25% this year as of Wednesday's close, topping the 21% gain for the Nasdaq.WATCH: Cisco's product chief on AI agentswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cisco's stock jumps on earnings beat, strong guidance and $1.3 billion in AI orders",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108090587-1737562466454-1U8A1107.JPG?v=1737562641&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T23:26:28.000Z",
      "dateModified": "2025-11-12T23:26:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House to vote on bill to end shutdown around 7 p.m. ET Wednesday, Rep. Scalise says ",
    "url": "https://www.cnbc.com/2025/11/12/house-to-vote-on-bill-to-end-shutdown-around-7-pm-et-wednesday-scalise.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108224755-1762955903289-gettyimages-2244362343-US_GOV_FUNDING.jpeg?v=1762955925&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-12T15:31:09.000Z",
    "description": "watch nowThe U.S. House of Representatives will vote early Wednesday evening to end the longest government shutdown in history, Rep. Steve Scalise, R-",
    "body": "watch nowThe U.S. House of Representatives will vote early Wednesday evening to end the longest government shutdown in history, Rep. Steve Scalise, R-La., said.\"We'll start the process probably around 4, 5 o'clock. The actual vote on the bill to fund the government will probably come later, around 7 o'clock,\" the House majority leader told CNBC. \"There'll be, I'm sure, a good, thorough debate, but it's so important that this gets done.\"If the spending bill gets through as planned, it will end an impasse that has lasted more than six weeks, resulting in furloughs for government workers, the closing of all federal government activities, the suspension of the Supplemental Nutrition Assistance Program and increased delays at airports heading into the holiday travel season.The Senate on Monday approved the package, which would keep the government open until Jan. 30 and provide funding for agriculture, military programs and legislative agencies, while also providing back pay for workers affected by the shutdown.Read more CNBC politics coverageDemocrats win big on Election Night in key racesZohran Mamdani wins New York City mayor's race, NBC News projectsDemocratic candidate Mikie Sherrill wins New Jersey governor's race, NBC News projectsDemocrats win Virginia governor, attorney general races, NBC News projectsSNAP update: Trump admin will pay 50% of food stamp benefits in November amid shutdownTrump says he has 'no idea who' Binance's CZ is after pardoning himTrump backtracks on attending Supreme Court tariffs case argumentsPresident Donald Trump has indicated he will sign the bill into law.Though the majority in the House is expected to be razor thin, Scalise said he expects to peel off enough Democrats to get the package through.\"Some Democrats still want to play games and inflict pain on families across America, but we've got enough,\" he said. \"We may get a few more than that in the House who want to end this madness and just let people get back to their lives.\"Both sides have traded blame over who is responsible for the shutdown. Polls have indicated voters more put the onus on Republicans, though an NBC News poll earlier this month showed Democrats faulted at the highest level in 30 years when compared with previous shutdowns.\"It's madness, but it's going to end today, hopefully, and let's move on,\" Scalise said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House to vote on bill to end shutdown around 7 p.m. ET Wednesday, Rep. Scalise says ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108224755-1762955903289-gettyimages-2244362343-US_GOV_FUNDING.jpeg?v=1762955925&w=1920&h=1080"
      ],
      "datePublished": "2025-11-12T15:31:09.000Z",
      "dateModified": "2025-11-12T15:31:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]