[
  {
    "title": "6 ways to tell people you're spending less this holiday season—without awkwardness or guilt",
    "url": "https://www.cnbc.com/2025/12/03/want-to-spend-less-this-holiday-let-people-know-with-6-phrases-says-expert.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108234792-1764625826000-gettyimages-2244664105-r5__1078.jpeg?v=1764693228&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T18:53:52.000Z",
    "description": "The holiday season brings out a mix of emotions for many of us: joy, pressure, love, expectations, excitement, and sometimes financial anxiety. Betwee",
    "body": "The holiday season brings out a mix of emotions for many of us: joy, pressure, love, expectations, excitement, and sometimes financial anxiety. Between gift exchanges, gatherings, the perfect decor, and travel, the pressure to show up big can feel heavier than the holiday ham. As a financial therapist, I am here to tell you that this holiday and every holiday going forward: You're allowed to set limits and protect your financial well-being without giving a long explanation.To be more intentional with your money this holiday season, use these six phrases to speak up with confidence.1. 'I have a few pressing financial priorities, so I have to scale back this year.'This is a calm and clear way to let people know your focus has shifted. It reminds them that you have responsibilities outside of the holiday season and that you're choosing to honor them. It also opens the door for understanding without inviting questions or explanations you don't want to give.2. 'Let's do a gift exchange instead of buying gifts for everyone. My wallet needs a breather.'Many people feel the same holiday pressure but are afraid to say it first. When you bring this up, you create space for an honest conversation about what feels manageable. This approach helps everyone simplify while also honoring your financial limits.3. 'I can contribute time, but not money. Put me on setup or cleanup duty!'Acts of service are still acts of love. You're showing up in a way that doesn't drain your bank account but shows you care. Most people will appreciate the offer and gladly accept.4. 'Can we play board games and chill this holiday season? My money is looking a little funny.'A little humor softens the message and makes the moment relatable. This is honest and keeps the conversation light. It could be a board game, a craft, or something your family enjoyed before holiday spending became a competition. This could even become a new tradition that honors connection instead of cost.5. 'I love y'all, but I can't host this year. My capacity just isn't there. How can we switch it up this year?'Some families have rituals where everyone naturally gathers at one person's home every year. But circumstances change, and you're allowed to change with them. Speaking up early helps others adjust their expectations and make new plans without stress or confusion.6. 'I'm trying to avoid overspending, so I've signed out of Amazon and anything else that might tempt me outside of my budget.'This one is straightforward and easy for others to understand. It names a financial habit that most people can relate to, and the humor softens the reality. It keeps things honest without making the moment awkward.Your finances may change, but your love for your family does not.It's one thing to be honest about your situation, but in these moments, guilt can creep in. This can make you feel like you're letting people down, especially in a season that celebrates generosity and togetherness — but guilt often has little to do with the money itself. It usually comes from the fear that changing what we can give means changing who we are to the people we love, which is not true at all. So a few things to keep in mind to help combat any guilt as you navigate this time of year.Remember your \"why.\" Protecting your peace, honoring your budget, focusing on your mental health and preventing debt are valid reasons to make different choices. Lead with clarity. When you communicate early and honestly, you stop imagining people's reactions and start building understanding. Most of the time, others are relieved you spoke up because they were feeling the same way.It's okay to evolve. You do not have to keep up traditions that no longer fit your financial reality. It's okay to shift, simplify, and create new traditions that feel emotionally and financially safe. Use language that sounds like you. If you're direct, choose something straightforward. If you're shy, choose something soft. If you use humor to ease tension, lean into that. With these phrases, when your words feel more like you, the guilt loses its power.Love is not measured by how much you spend. Changing your capacity is not the same as changing your love. Your financial situation may shift, but your love and care for your family does not. Jasmine Johnson is a certified financial therapist and financial counselor. She blends behavioral psychology with practical strategy to guide people through budgeting, debt, financial anxiety, and real life money decisions. Jasmine is is a bi-weekly financial expert on BakersfieldNOW News, and the founder of Happi Money. Earn more and get ahead with CNBC's online courses. Black Friday starts now! Get 25% off select courses and 30% off exclusive bundles with coupon code GETSMART. Offer valid November 17 through December 5, 2025.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "6 ways to tell people you're spending less this holiday season—without awkwardness or guilt",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108234792-1764625826000-gettyimages-2244664105-r5__1078.jpeg?v=1764693228&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T18:53:52.000Z",
      "dateModified": "2025-12-03T18:53:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "November private payrolls unexpectedly fell by 32,000, led by steep small business job cuts, ADP reports",
    "url": "https://www.cnbc.com/2025/12/03/adp-jobs-report-november-2025-private-payrolls-unexpectedly-fell-by-32000-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229419-1763667547092-gettyimages-2247675584-6k4a2080_ifl55xjd.jpeg?v=1763667673&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T19:13:15.000Z",
    "description": "A hiring sign is displayed in the window of a business in Manhattan on Nov. 27, 2025 in New York City.Spencer Platt | Getty ImagesThe U.S. labor marke",
    "body": "A hiring sign is displayed in the window of a business in Manhattan on Nov. 27, 2025 in New York City.Spencer Platt | Getty ImagesThe U.S. labor market slowdown intensified in November as private companies cut 32,000 workers, with small businesses hit the hardest, payrolls processing firm ADP reported Wednesday.With worries intensifying over the domestic jobs picture, ADP indicated the issues were worse than anticipated. The payrolls decline marked a sharp step down from October, which saw an upwardly revised gain of 47,000 positions, and was well below the Dow Jones consensus estimate from economists for an increase of 40,000.Larger businesses, entailing companies with 50 or more employees, actually reported a net gain of 90,000 workers.However, establishments with fewer than 50 workers saw a decline of 120,000, including a drop of 74,000 among firms with 20 to 49 employees. The total loss was the biggest drop since March 2023.Education and health services led gainers with 33,000 hires, while leisure and hospitality added 13,000. But a broad-based decline across industries drove the total lower.The biggest loss came in professional and business services, which saw a decline of 26,000. Others shedding jobs included information services (-20,000), manufacturing (-18,000), and financial activities and construction, both of which saw losses of 9,000.The rate of pay also slowed, with workers staying in their jobs seeing a 4.4% year-over-year increase, down 0.1 percentage point from October.\"Hiring has been choppy of late as employers weather cautious consumers and an uncertain macroeconomic environment,\" said ADP's chief economist, Nela Richardson. \"And while November's  slowdown was broad-based, it was led by a pullback among small businesses.\"The ADP report is the last jobs picture the Federal Reserve gets before it meets Dec. 9-10. Futures traders are assigning a nearly 90% probability that the central bank will approve another quarter percentage point cut in its key interest rate, despite misgivings from some officials over whether further easing is needed. The probability was about the same following the ADP release.In recent weeks, Fed policymakers have expressed a divergence of opinions. One side sees cuts as necessary to head off further labor market troubles, while the other worries that additional reductions could aggravate inflation, which has held considerably above the Fed's 2% target.The Bureau of Labor Statistics will release its take on the nonfarm payrolls picture on Dec. 16, a date delayed because of the government shutdown.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "November private payrolls unexpectedly fell by 32,000, led by steep small business job cuts, ADP reports",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229419-1763667547092-gettyimages-2247675584-6k4a2080_ifl55xjd.jpeg?v=1763667673&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T19:13:15.000Z",
      "dateModified": "2025-12-03T19:13:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthropic reportedly preparing for one of the largest IPOs ever in race with OpenAI: FT",
    "url": "https://www.cnbc.com/2025/12/03/anthropic-claude-reportedly-preparing-ipo-race-openai-chatgpt-ft-wilson-sonsini-goodrich-rosati.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108227464-1763479721013-gettyimages-2245836911-kokovlis-notitle251112_nppPs.jpeg?v=1763479768&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T03:31:55.000Z",
    "description": "Nurphoto | Getty ImagesAnthropic, the AI startup behind the popular Claude chatbot, is in early talks to launch one of the largest initial public offe",
    "body": "Nurphoto | Getty ImagesAnthropic, the AI startup behind the popular Claude chatbot, is in early talks to launch one of the largest initial public offerings as early as next year, the Financial Times reported Wednesday. For the potential IPO, Anthropic has engaged law firm Wilson Sonsini Goodrich & Rosati, which has previously worked on high-profile tech IPOs such as Google, LinkedIn and Lyft, the FT said, citing two sources familiar with the matter.The start-up, led by chief executive Dario Amodei, was also pursuing a private funding round that could value it above $300 billion, including a $15 billion combined commitment from Microsoft and Nvidia, per the report. It added that Anthropic has also discussed a potential IPO with major investment banks, but that sources characterized the discussions as preliminary and informal. If true, the news could position Anthropic in a race to market with rival ChatGPT-maker OpenAI, which is also reportedly laying the groundwork for a public offering. The potential listings would also test investors' appetite for loss-making AI startups amid growing fears of a so-called AI bubble. However, an Anthropic spokesperson told the FT: \"It's fairly standard practice for companies operating at our scale and revenue level to effectively operate as if they are publicly traded companies,\" adding that no decisions have been made on timing or whether to go public.CNBC was unable to reach Anthropic and Wilson Sonsini, which has advised Anthropic for a few years, for comment. According to one of the FT's sources, Anthropic has been working through internal preparations for a potential listing, though details were not provided. The FT report follows several notable changes at the company of late, including the hiring of former Airbnb executive Krishna Rao, who played a key role in the firm's 2020 IPO.CNBC also reported last month that Anthropic was recently valued to the range of $350 billion after receiving investments of up to $5 billion from Microsoft and $10 billion from Nvidia. In its race to overtake OpenAI in the AI space, the startup has also been expanding aggressively, recently announcing a $50 billion AI infrastructure build-out with data centers in Texas and New York, and tripling its international workforce.According to the FT report, investors in the company are enthusiastic about Anthropic's potential IPO, which could see it \"seize the initiative\" from OpenAI.While OpenAI has been rumoured to be considering an IPO, its chief financial officer recently said the company is not pursuing a near-term listing, even as it closed a $6.6 billion share sale at a $500 billion valuation in October.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthropic reportedly preparing for one of the largest IPOs ever in race with OpenAI: FT",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108227464-1763479721013-gettyimages-2245836911-kokovlis-notitle251112_nppPs.jpeg?v=1763479768&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T03:31:55.000Z",
      "dateModified": "2025-12-03T03:31:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mortgage rates finally moved lower last week, but that didn't do much for demand",
    "url": "https://www.cnbc.com/2025/12/03/mortgage-rates-finally-moved-lower-last-week-but-that-didnt-do-much-for-demand.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225444-1763044515565-gettyimages-2245906514-MORTGAGE_APPLICATION_FIGURES.jpeg?v=1763044637&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T12:46:59.000Z",
    "description": "Homes in Hercules, California, US, on Wednesday, Nov. 12, 2025. David Paul Morris | Bloomberg | Getty ImagesAfter rising for several weeks, mortgage r",
    "body": "Homes in Hercules, California, US, on Wednesday, Nov. 12, 2025. David Paul Morris | Bloomberg | Getty ImagesAfter rising for several weeks, mortgage rates moved decidedly lower last week, but not enough to make much of a difference in demand from current borrowers or potential homebuyers. Total mortgage application volume fell 1.4% for the week, according to the Mortgage Bankers Association's seasonally adjusted index. An additional adjustment was made for the Thanksgiving holiday. The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, $806,500 or less, decreased to 6.32% from 6.40%, with points falling to 0.58 from 0.60, including the origination fee, for loans with a 20% down payment. \"Mortgage rates moved lower in line with Treasury yields, which declined on data showing a weaker labor market and declining consumer confidence,\" said Joel Kan, vice president and deputy chief economist at the MBA. Even with that drop, applications to refinance a home loan fell 4% for the week but were 109% higher than the same week one year ago, when interest rates were much higher.  Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.Applications for a mortgage to purchase a home rose 3% for the week and were 17% higher than the same week one year ago. Buyer demand has been pretty weak this fall, as still-elevated home prices, relatively high mortgage rates and uncertainty over the state of the economy all weigh on consumers.\"We continue to see mixed results each week as the broader economic outlook remains cloudy, even as cooling home-price growth and increasing for-sale inventory bring some buyers back into the market,\" Kan added. The adjustable-rate mortgage share of activity increased to 8% of total applications, as consumers continue to look for more savings. ARMs offer lower rates and can be fixed for up to 10 years. They tend to be more popular in higher rate environments.Interest rates were mixed to start this week. They rose sharply on Monday but then pulled back a little bit Tuesday, according to a separate survey from Mortgage News Daily. There wasn't much economic data to impact rates.\"That could change on Wednesday with the confluence of ADP and ISM Services--both capable of influencing the bond market, even before the shutdown data dynamics temporarily magnified private data's importance,\" wrote Matthew Graham, chief operating officer at Mortgage News Daily.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mortgage rates finally moved lower last week, but that didn't do much for demand",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225444-1763044515565-gettyimages-2245906514-MORTGAGE_APPLICATION_FIGURES.jpeg?v=1763044637&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T12:46:59.000Z",
      "dateModified": "2025-12-03T12:46:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration to announce new fuel economy standards Wednesday, sources say",
    "url": "https://www.cnbc.com/2025/12/03/trump-fuel-economy-standards.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235849-1764766166360-gettyimages-2248020860-THANKSGIVING_TRAVEL.jpeg?v=1764766190&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T17:49:25.000Z",
    "description": "Traffic on Interstate 80 in San Pablo, California, US, on Wednesday, Nov. 26, 2025. David Paul Morris | Bloomberg | Getty ImagesThe White House will a",
    "body": "Traffic on Interstate 80 in San Pablo, California, US, on Wednesday, Nov. 26, 2025. David Paul Morris | Bloomberg | Getty ImagesThe White House will announce new fuel economy standards on Wednesday, according to administration sources. The Trump administration will propose rolling back the standards implemented by former President Joe Biden last year, sources told Reuters. Biden required passenger cars and light trucks to have a fuel efficiency of about 50 mpg by 2031. President Donald Trump is scheduled to make an announcement at 2:30 p.m. ET from the Oval Office. Executives from Ford, General Motors and Stellantis are expected to attend the announcement.The Biden fuel efficiency standards were expected to stimulate the sale of electric vehicles in the U.S. Trump has sought to roll back all federal support for EVs since taking office. The oil industry group the American Petroleum Institute has lobbied the Trump administration to repeal the Biden fuel economy standards, contending that they aim to phase out liquid fuel vehicles. The Corporate Average Fuel Economy, or CAFE, standards date back to 1975 and have been tightened over the years to make vehicles more efficient. Stellantis CEO Antonio Filosa, who is expected to be in attendance at the White House, said in a statement that the automaker \"appreciates the Trump Administration's actions to re-align the Corporate Average Fuel Economy (CAFE) standards with real world market conditions as part of its wider vision for a growing U.S. automotive industry.\"— CNBC's Michael Wayland contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration to announce new fuel economy standards Wednesday, sources say",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235849-1764766166360-gettyimages-2248020860-THANKSGIVING_TRAVEL.jpeg?v=1764766190&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T17:49:25.000Z",
      "dateModified": "2025-12-03T17:49:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Airbus expects to deliver fewer aircrafts this year after a difficult few days. Here's how we got here.",
    "url": "https://www.cnbc.com/2025/12/03/airbus-cut-its-delivery-guidance-a320.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235990-1764777072086-gettyimages-148110841-FARNBOROUGH_2012.jpeg?v=1764779722&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T16:35:05.000Z",
    "description": "French planemaker Airbus cut its delivery guidance early Wednesday after a series of issues related to its A320 aircraft.On Monday, reports emerged of",
    "body": "French planemaker Airbus cut its delivery guidance early Wednesday after a series of issues related to its A320 aircraft.On Monday, reports emerged of a flaw said to affect dozens of A320-family aircraft. Airbus later said it had identified a quality issue regarding a \"limited number\" of metal panels, and that the source of the issue has been \"identified and contained.\" It came after the company ordered an immediate software fix for around 6,000 A320-series aircrafts on Friday, forcing a large chunk of it's narrow-body fleet to be grounded, stranding travellers worldwide.The Paris-traded stock dropped on the news of the panel issue. It fell nearly 7% Monday and Tuesday as investors appeared spooked by the prospect of more widespread quality issues, like the ones that embroiled its rival Boeing.The company attributed the revised delivery guidance to \"recent supplier quality issue on fuselage panels impacting its A320 Family delivery flow.\" The company is now targeting 790 commercial aircraft deliveries in 2025, 30 fewer than its previous guidance.It maintained its financial guidance given in late October, still seeing adjusted earnings before interest and taxes of 7 billion euros and free cash flow before customer financing of around 4.5 billion euros.Shares were up 4.3% as of 3:45 p.m. Paris time (9:45 a.m. ET) following the renewed guidance, issued early Wednesday morning. Stock Chart IconStock chart iconAirbus share price this year\"The 30 aircraft removed from the delivery guide this year are not all expected to require a parts change, but for now only require a non-destructive test to be performed,\" noted Jefferies analysts. \"As a reminder, this part is dual-sourced with only one of the supplier facing a quality escape, which has already been resolved at the production level.\"The issue with Airbus' fuselage panels was related to parts supplied by Spanish company Sofitec Aero, a person familiar with the matter, who preferred to remain anonymous, told CNBC.CNBC reached out to Sofitec Aero for comment.Sector-wide problemsThe software update Airbus issued followed a Oct. 30 incident where an Airbus A320, operated by JetBlue, experienced a sudden drop in altitude after a flight control issue, resulting in injuries. The plane, which was en route from Cancun, Mexico to New Jersey, made an emergency landing in Tampa, Florida. Airbus' woes come as rival Boeing has been battling stubborn quality issues and increased scrutiny after a door plug blew out mid-flight on a Alaska Airlines 737 MAX in January last year. There have been signs of recovery for the firm as CFO Jay Malave said Tuesday that Boeing expects deliveries of both its 737 and 787 jets to be up next year.CEO Kelly Ortberg, who was brought in last year to turn the company around, said the company was starting to see improvements in its business, including slashing its quarterly losses.— Laya Neelakandan contributed to this report",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Airbus expects to deliver fewer aircrafts this year after a difficult few days. Here's how we got here.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235990-1764777072086-gettyimages-148110841-FARNBOROUGH_2012.jpeg?v=1764779722&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T16:35:05.000Z",
      "dateModified": "2025-12-03T16:35:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Delta says government shutdown cost it $200 million, but forecasts strong travel demand into 2026",
    "url": "https://www.cnbc.com/2025/12/03/delta-government-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223531-1762779498528-gettyimages-2245369615-planes_BC_057_110925JPG.jpeg?v=1762779522&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T17:50:04.000Z",
    "description": "A Delta Airlines Boeing 757-200 plane passes by the U.S. Capitol dome in Washington as it comes in for a landing at Ronald Reagan Washington National ",
    "body": "A Delta Airlines Boeing 757-200 plane passes by the U.S. Capitol dome in Washington as it comes in for a landing at Ronald Reagan Washington National Airport on Sunday, November 9, 2025. Bill Clark | Cq-roll Call, Inc. | Getty ImagesDelta Air Lines said the government shutdown that ended last month cost it approximately $200 million in pretax profit as bookings softened during the longest such impasse in U.S. history.The airline said the earnings impact would be approximately 25 cents a share for the current quarter. In October, Delta forecast adjusted fourth-quarter earnings of $1.60 to $1.90 a share.Travel demand, however, is still healthy, and bookings are strong going into 2026, Delta reiterated in a securities filing on Wednesday ahead of an industry conference.Read more CNBC airline newsThe government shutdown is over. The air traffic controller shortage is notPrivate-jet demand is on the rise amid government shutdown, says Flexjet CEOBoeing stems cash burn for first time since 2023 but takes $4.9 billion charge on 777X delaysAmerican Airlines is late to the luxury travel boom. Can it catch up?Air traffic controller shortages worsened during the shutdown, and the Trump administration forced airlines to trim their schedules to relieve pressure on controllers. But even with that move, delays and cancellations ended up being higher than expected in the days before the shutdown ended. Air traffic controllers, already stretched thin before the shutdown, were required to work without their regular paychecks during that period.Delta CEO Ed Bastian and other airline executives have repeatedly pressed lawmakers and officials in Washington to ensure that air traffic controllers, Transportation Security Administration officers and other workers tied to air travel are paid in the event of another shutdown.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Delta says government shutdown cost it $200 million, but forecasts strong travel demand into 2026",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223531-1762779498528-gettyimages-2245369615-planes_BC_057_110925JPG.jpeg?v=1762779522&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T17:50:04.000Z",
      "dateModified": "2025-12-03T17:50:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bessent says Trump admin will be able to replicate tariffs even if it loses Supreme Court decision",
    "url": "https://www.cnbc.com/2025/12/03/bessent-says-us-will-be-able-to-replicate-tariffs-even-if-it-loses-supreme-court-decision.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235927-1764773395481-gettyimages-2249743401-mms20362_2vlicpse.jpeg?v=1764773423&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T17:25:13.000Z",
    "description": "watch nowNEW YORK — Treasury Secretary Scott Bessent on Wednesday predicted that the administration still will be able to implement its tariff agenda ",
    "body": "watch nowNEW YORK — Treasury Secretary Scott Bessent on Wednesday predicted that the administration still will be able to implement its tariff agenda regardless of whether it prevails in a pending case before the Supreme Court.Repeating assertions he had made prior to the high court hearing a month ago, Bessent cited several sections of 1962 Trade Act that give the president sweeping powers over import duties.\"We can recreate the exact tariff structure with [sections] 301, with 232, with 122,\" he said during an onstage interview at The New York Times DealBook Summit.Asked by host Andrew Ross Sorkin — the founding editor of DealBook and co-host of CNBC's \"Squawk Box\" — whether the administration had to implement those measures permanently, Bessent replied, \"permanently.\"Section 122 allows for tariff power up to 150 days, but 301 and 232 are less definitive on a time frame. Bessent also cited the International Emergency Economic Powers Act as providing broad tariff authority, though that is the use under scrutiny by the Supreme Court.President Donald Trump has used tariffs as a favorite negotiating tool against U.S. trading partners. The president has slapped duties on a wide range of products and virtually all imports that come into the country, though he has backed off on many of the more aggressive measures.Bessent cited some of the successes the administration has enjoyed thus far, naming China specifically despite ongoing tensions between the two nations.\"Because of the fentanyl tariffs, the Chinese are making the first the step forward that they've made\" on trade, he said. Bessent added that China has made \"a robust effort\" at halting the drug's import into the U.S.He added that he still thinks the U.S. stands a good chance of prevailing in the Supreme Court case.On a separate matter, Bessent dodged a question on Trump's pick for the next Federal Reserve chair and noted the limited power the central bank leader has over interest rates. Recent reports have indicated that National Economic Council Director Kevin Hassett is the front-runner.\"The important thing to remember here is that it's a board and [there are] several other voters from the from the regional banks,\" he said. \"The chair of the Federal Reserve has the ability to move and start the discussion, but at the end of the day ... he or she is one vote.\"Bessent told CNBC recently that he thought Trump could make the decision by Christmas, but the president indicated it may not come until the new year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bessent says Trump admin will be able to replicate tariffs even if it loses Supreme Court decision",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235927-1764773395481-gettyimages-2249743401-mms20362_2vlicpse.jpeg?v=1764773423&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T17:25:13.000Z",
      "dateModified": "2025-12-03T17:25:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Micron stops selling memory to consumers as demand spikes from AI chips",
    "url": "https://www.cnbc.com/2025/12/03/micron-stops-selling-memory-to-consumers-demand-spikes-from-ai-chips.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108164009-1750872052854-gettyimages-2222120700-_75a8714_ahdmj3cp.jpeg?v=1764787805&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T19:05:29.000Z",
    "description": "A person walks by a sign for Micron Technology headquarters in San Jose, California, on June 25, 2025.Justin Sullivan | Getty ImagesMicron said on Wed",
    "body": "A person walks by a sign for Micron Technology headquarters in San Jose, California, on June 25, 2025.Justin Sullivan | Getty ImagesMicron said on Wednesday that it plans to stop selling memory to consumers to focus on meeting demand for high-powered artificial intelligence chips. \"The AI-driven growth in the data center has led to a surge in demand for memory and storage,\" Sumit Sadana, Micron business chief, said in a statement. \"Micron has made the difficult decision to exit the Crucial consumer business in order to improve supply and support for our larger, strategic customers in faster-growing segments.\"Micron's announcement is the latest sign that the AI infrastructure boom is creating shortages for inputs like memory as a handful of companies commit to spend hundreds of billions in the next few years to build massive data centers. Memory, which is used by computers to store data for short periods of time, is facing a global shortage.Micron shares are up about 175% this year, though they slipped 3% on Wednesday to $232.25. AI chips, like the GPUs made by Nvidia and Advanced Micro Devices, use large amounts of the most advanced memory. For example, the current-generation Nvidia GB200 chip has 192GB of memory per graphics processor. Google's latest AI chip, the Ironwood TPU, needs 192GB of high-bandwidth memory. Memory is also used in phones and computers, but with lower specs, and much lower quantities — many laptops only come with 16GB of memory. Micron's Crucial brand sold memory on sticks that tinkerers could use to build their own PCs or upgrade their laptops. Crucial also sold solid-state hard drives. Micron competes against SK Hynix and Samsung in the market for high-bandwidth memory, but it's the only U.S.-based memory supplier. Analysts have said that SK Hynix is Nvidia's primary memory supplier. Micron supplies AMD, which says its AI chips use more memory than others, providing them a performance advantage for running AI. AMD's current AI chip, the MI350, comes with 288GB of high-bandwidth memory.  Micron's Crucial business was not broken out in company earnings. However, its cloud memory business unit showed 213% year-over-year growth in the most recent quarter. Analysts at Goldman on Tuesday raised their price target on Micron's stock to $205 from $180, though they maintained their hold recommendation. The analysts wrote in a note to clients that due to \"continued pricing momentum\" in memory, they \"expect healthy upside to Street estimates\" when Micron reports quarterly results in two weeks.A Micron spokesperson declined to comment on whether the move would result in layoffs.\"Micron intends to reduce impact on team members due to this business decision through redeployment opportunities into existing open positions within the company,\" the company said in its release.WATCH: Winners and losers from surge in prices for memory chipswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Micron stops selling memory to consumers as demand spikes from AI chips",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108164009-1750872052854-gettyimages-2222120700-_75a8714_ahdmj3cp.jpeg?v=1764787805&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T19:05:29.000Z",
      "dateModified": "2025-12-03T19:05:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeffrey Epstein island photos and videos released as top banks share files with House Oversight Committee ",
    "url": "https://www.cnbc.com/2025/12/03/epstein-files-jpmorgan-deutsche-bank-virgin-islands.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236050-1764781746751-IMG_5373S.jpg?v=1764787172&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T19:46:09.000Z",
    "description": "Photo released by the House Oversight Committee Democrats shows the property of Jeffrey Epstein's private island home on Little St. James.Source: Hous",
    "body": "Photo released by the House Oversight Committee Democrats shows the property of Jeffrey Epstein's private island home on Little St. James.Source: House Oversight Committee DemocratsHouse Democrats on Wednesday revealed new photos and videos from Jeffrey Epstein's private island in the U.S. Virgin Islands, and revealed that two major banks have handed over records related to the notorious sex offender.The tranche of images was shared by the U.S. Virgin Islands Department of Justice in response to a request from the House Oversight Committee, the panel's Democratic minority said in a press release. They also received records from JPMorgan Chase and Deutsche Bank related to Epstein, the wealthy and well-connected financier who killed himself in jail in 2019 while facing federal sex trafficking charges.Photo released by the House Oversight Committee Democrats shows a room inside Jeffrey Epstein's private island home on Little St. James.Source: House Oversight DemocratsThe Democrats said they plan to publicly release the banks' materials \"in the days ahead\" after a review.A spokesperson for Oversight's Republican majority said in a statement that the committee \"has received approximately 5,000 documents in response to [GOP Chairman James Comer of Kentucky's] subpoenas\" to the two banks, along with his request to the Virgin Islands.\"The Majority is reviewing these materials and will make them public soon, just as the Committee has already done with the more than 65,000 pages produced during this investigation,\" the spokesperson said.Photo released by the House Oversight Committee Democrats shows a room inside Jeffrey Epstein's private island home on Little St. James.Source: House Oversight DemocratsThe developments come two weeks after President Donald Trump, a former friend of Epstein's, signed a bipartisan bill ordering the Department of Justice to release files from its investigations into the registered sex offender.Trump's signature started a 30-day timer for Attorney General Pam Bondi to publicly release unclassified files relating to Epstein and his convicted accomplice Ghislaine Maxwell.On Wednesday, a bipartisan group of five lawmakers asked Bondi for a briefing and status update on DOJ's efforts to gather those files in advance of the upcoming deadline, NBC News reported.Oversight ranking Rep. Robert Garcia, D-Calif., separately urged the president to release all of the government's Epstein files immediately.Photo released by the House Oversight Committee Democrats shows a room inside Jeffrey Epstein's private island home on Little St. James. (Some words on the chalkboard were redacted before their release).Source: House Oversight Democrats\"These new images are a disturbing look into the world of Jeffrey Epstein and his island,\" Oversight ranking Rep. Robert Garcia, D-Calif., said in a statement accompanying his committee's latest disclosure.\"We are releasing these photos and videos to ensure public transparency in our investigation and to help piece together the full picture of Epstein's horrific crimes. We won't stop fighting until we deliver justice for the survivors,\" Garcia said.\"It's time for President Trump to release all the files, now,\" he added.The spokesperson for the committee majority criticized Democratic members' move, saying, \"It is odd that Democrats are once again releasing selective information, as they have done before.\"The Democrats had previously released thousands of documents — including emails showing Epstein discussing Trump — that it obtained through a subpoena to Epstein's estate.Photo released by the House Oversight Committee Democrats shows a room inside Jeffrey Epstein's private island home on Little St. James.Source: House Oversight DemocratsThe photos released Wednesday include shots of multiple partially furnished bedrooms and bathrooms. Another shot appears to show a dentist's chair in a small room decorated with plastic masks of men's faces on the walls.One photo shows a telephone with a speed-dial index.Another shows a close-up of a blackboard, on which various words including \"Power,\" \"Deception,\" \"Political,\" \"Truth\" and \"Music\" appear to be scrawled. Some words on the chalkboard were redacted before their release.Photo released by the House Oversight Committee Democrats shows a room inside Jeffrey Epstein's private island home on Little St. James.Source: House Oversight DemocratsPhoto released by the House Oversight Committee Democrats shows a room inside Jeffrey Epstein's private island home on Little St. James.Source: House Oversight DemocratsA zoomed-out shot of that same room shows what looks to be an office, with an ornate wooden bookshelf, a large desk strewn with various items, and a quartet of plush chairs with red velvet pillows facing each other.The videos include a walkthrough of an outdoor portion of the island, including a large statue overlooking a swimming pool.Maxwell is currently serving a 20-year prison sentence for acting as Epstein's procurer of young girls. She was interviewed in July by top DOJ official Todd Blanche, during which time she said she did not know of any wrongdoing by Trump.About a week later, Maxwell was moved to a minimum-security women's prison in Texas.In a letter filed Wednesday in Manhattan federal court, Maxwell said through her attorney that she intends to file a petition seeking her release from prison, NBC and The New York Times reported.Read more CNBC politics coverageJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeffrey Epstein island photos and videos released as top banks share files with House Oversight Committee ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236050-1764781746751-IMG_5373S.jpg?v=1764787172&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T19:46:09.000Z",
      "dateModified": "2025-12-03T19:46:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo expanding to Baltimore, Pittsburgh and St. Louis with manual test drives",
    "url": "https://www.cnbc.com/2025/12/03/waymo-baltimore-pittsburgh-stlouis.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108162912-1750726025648-Waymo_on_Uber_Photo_2.jpg?v=1750726148&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T14:00:01.000Z",
    "description": "Waymo partners with Uber to bring robotaxi service to Atlanta and Austin.Uber Technologies Inc.Waymo on Wednesday said humans will begin test driving ",
    "body": "Waymo partners with Uber to bring robotaxi service to Atlanta and Austin.Uber Technologies Inc.Waymo on Wednesday said humans will begin test driving the Alphabet-owned company's robotaxi vehicles in Baltimore, Pittsburgh and St. Louis. The three cities represent the latest additions to Waymo's quickly growing list of cities where the Google sister company is either operating its robotaxis, planning to launch service or starting to test its vehicles. That list now stands at 26 markets. Waymo will begin manual drives in the trio of new cities this week with hopes to eventually begin serving fully-autonomous rides there, spokesperson Ethan Teicher told CNBC. Over the past month, Waymo has been aggressively making announcements for new markets and developments at the Google sister company. This comes as tech rivals Amazon and Tesla made advancements in the robotaxi market in 2025. Amazon's Zoox began offering free rides in Las Vegas and San Francisco, and Tesla this year launched ride-hailing service with human supervisors in the Austin and San Francisco markets.In November, Waymo announced that it will soon begin manually driving in Minneapolis, Tampa and New Orleans. The company also added Houston, San Antonio and Orlando to its list of cities where it'll launch service in 2026. Waymo also began offering rides on freeways in the San Francisco, Los Angeles and Phoenix markets, and it named a new finance chief. With more than 250,000 weekly paid trips, Waymo's robotaxi service currently operates in Austin, the San Francisco Bay Area, Phoenix, Atlanta and Los Angeles markets. The company in May said it had provided more than 10 million paid rides since launching in 2020.The new cities further signal that Waymo is increasingly confident its service can work well in locations with colder weather conditions.WATCH: Waymo launches paid robotaxi rides on freewayswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo expanding to Baltimore, Pittsburgh and St. Louis with manual test drives",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108162912-1750726025648-Waymo_on_Uber_Photo_2.jpg?v=1750726148&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T14:00:01.000Z",
      "dateModified": "2025-12-03T14:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI to acquire Neptune, a startup that helps with AI model training  ",
    "url": "https://www.cnbc.com/2025/12/03/openai-to-acquire-neptune-an-ai-model-training-assistance-startup.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236133-17647882242025-11-06t201852z_653951074_rc2umcacl8qk_rtrmadp_0_openai-outlook.jpeg?v=1764788251&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T19:59:31.000Z",
    "description": "OpenAI CEO Sam Altman attends an event to pitch AI for businesses in Tokyo, Japan February 3, 2025. Kim Kyung-hoon | ReutersOpenAI has entered into a ",
    "body": "OpenAI CEO Sam Altman attends an event to pitch AI for businesses in Tokyo, Japan February 3, 2025. Kim Kyung-hoon | ReutersOpenAI has entered into a definitive agreement to acquire Neptune, a startup that builds monitoring and de-bugging tools that artificial intelligence companies use as they train models. Neptune and OpenAI have collaborated on a metrics dashboard to help teams that are building foundation models. The companies will work \"even more closely together\" because of the acquisition, Neptune CEO Piotr Niedźwiedź said in a blog. The startup will wind down its external services in the coming months, Niedźwiedź said. The terms of the acquisition were not disclosed.\"Neptune has built a fast, precise system that allows researchers to analyze complex training workflows,\" OpenAI's Chief Scientist Jakub Pachocki said in a statement. \"We plan to iterate with them to integrate their tools deep into our training stack to expand our visibility into how models learn.\"OpenAI has acquired several companies this year. It purchased a small interface startup called Software Applications Incorporated for an undisclosed sum in October, product development startup Statsig for $1.1 billion in September and Jony Ive's AI devices startup io for more than $6 billion in May.Neptune had raised more than $18 million in funding from investors including Almaz Capital and TDJ Pitango Ventures, according to its website. Neptune's deal with OpenAI is still subject to customary closing conditions.\"I am truly grateful to our customers, investors, co-founders, and colleagues who have made this journey possible,\" Niedźwiedź said. \"It was the ride of a lifetime already, yet still I believe this is only the beginning.\"WATCH: Sam Altman hits reset at OpenAI, pausing side bets to defend ChatGPT’s AI leadwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI to acquire Neptune, a startup that helps with AI model training  ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236133-17647882242025-11-06t201852z_653951074_rc2umcacl8qk_rtrmadp_0_openai-outlook.jpeg?v=1764788251&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T19:59:31.000Z",
      "dateModified": "2025-12-03T19:59:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft stock sinks on report AI product sales are missing growth goals",
    "url": "https://www.cnbc.com/2025/12/03/microsoft-stock-ai-foundry-sales.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108147619-1764777659107-108147619-1747681492573-gettyimages-2215431528-AFP_47CD63U.jpg?v=1764777670&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T19:51:44.000Z",
    "description": "watch nowMicrosoft pushed back on a report Wednesday that the company lowered growth targets for artificial intelligence software sales after many of ",
    "body": "watch nowMicrosoft pushed back on a report Wednesday that the company lowered growth targets for artificial intelligence software sales after many of its salespeople missed those goals in the last fiscal year.The company's stock sank more than 2% on The Information report.A Microsoft spokesperson said the company has not lowered sales quotas or targets for its salespeople.The sales lag occurred for Microsoft's Foundry product, an Azure enterprise platform where companies can build and manage AI agents, according to The Information, which cited two salespeople in Azure's cloud unit.AI agents can carry out a series of actions for a user or organization autonomously.Less than a fifth of salespeople in one U.S. Azure unit met the Foundry sales growth target of 50%, according to The Information. In another unit, the quota was set to double Foundry sales, The Information reported. The quota was dropped to 50% after most salespeople didn't meet it.In a statement, the company said the news outlet inaccurately combined the concepts of growth and quotas.Read more CNBC tech newsFormer cyber spy raises $60 million to fight AI threatsYouTube's new AI deepfake tracking tool is alarming experts and creatorsApple names former Microsoft, Google exec to succeed retiring AI chiefInstagram orders employees back to the office 5 days a week\"Aggregate sales quotas for AI products have not been lowered, as we informed them prior to publication,\" a Microsoft spokesperson said.The AI boom has presented opportunities for businesses to add efficiencies and streamline tasks, with the companies that build these agents touting the power of the tools to take on work and allow workers to do more.OpenAI, Google, Anthropic, Salesforce, Amazon and others all have their own tools to create and manage these AI assistants.But the adoption of these tools by traditional businesses hasn't seen the same surge as other parts of the AI ecosystem.The Information noted AI adoption struggles at private equity firm Carlyle last year, in which the tools wouldn't reliably connect data from other places. The company later reduced how much it spent on the tools.Read the full story from The Information here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft stock sinks on report AI product sales are missing growth goals",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108147619-1764777659107-108147619-1747681492573-gettyimages-2215431528-AFP_47CD63U.jpg?v=1764777670&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T19:51:44.000Z",
      "dateModified": "2025-12-03T19:51:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Macy’s posts strongest growth in more than 3 years, but strikes cautious note on holidays",
    "url": "https://www.cnbc.com/2025/12/03/macys-m-earnings-q3-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108233430-1764765438132-108233430-1764337028507-gettyimages-2248237179-BLACK_FRIDAY_SHOPPING.jpg?v=1764765456&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T14:27:50.000Z",
    "description": "watch nowMacy's on Wednesday beat Wall Street's sales expectations for the third quarter in a row and posted its strongest growth in more than three y",
    "body": "watch nowMacy's on Wednesday beat Wall Street's sales expectations for the third quarter in a row and posted its strongest growth in more than three years as the company's turnaround strategy showed signs of momentum.The department store operator raised its full-year sales and earnings outlook after its better-than-expected fiscal third quarter. The retailer now expects adjusted earnings per share of between $2 and $2.20, up from its previous expectation of $1.70 to $2.05, and net sales of $21.48 billion to $21.63 billion, compared with its prior outlook of $21.15 billion and $21.45 billion.Macy's said it expects flat to roughly 0.5% comparable sales growth from the previous year. That compares with its previous expectations for a year-over-year decline of between 0.5% and 1.5%. The industry metric takes out one-time dynamics like store openings and closures, and Macy's includes merchandise that it owns, items for brands that pay for space within its stores and its third-party online marketplace.It marked the second consecutive quarter Macy's raised its full-year sales and earnings outlook. The company had cut its full-year earnings outlook in May because of higher tariffs, more promotions and \"some moderation\" in discretionary spending. Even so, the projected annual sales would represent a drop from year-ago net sales of $22.29 billion. Macy's said about $700 million of that annual net sales decrease is due to the 64 stores it shuttered at the end of the last fiscal year, which ended Feb. 1, and in the early part of this fiscal year. And Macy's said in its news release that its outlook anticipates two challenging dynamics – selective spending by consumers and higher tariffs – will persist in the holiday quarter.The company's shares dropped nearly 5% in premarket trading Wednesday.In an interview with CNBC, CEO Tony Spring said the company is taking a \"prudent view\" of the fourth quarter because it faces tough year-over-year comparisons and because it's not sure how \"aspirational customers,\" those who like to shop at its stores but are more financially pressured, may spend during the season.\"We're pleased with the fourth quarter to date, but we have a big holiday in front of us,\" he said. Spring said Macy's department store model is an advantage during the gift-giving season because it offers a wide variety of merchandise and a range of prices, from off-price to luxury.Here's how the department store operator did during its fiscal third quarter compared with what Wall Street expected, based on a survey of analysts by LSEG:Earnings per share: 9 cents adjusted vs. an expected loss of 14 cents Revenue: $4.71 billion vs. $4.62 billion expectedMacy's is trying to put up better and more consistent sales, particularly for its namesake brand. Macy's department stores account for the majority of the New York City-based legacy retailer's business, but their performance has lagged behind the company's higher-end department store, Bloomingdale's, and beauty chain, Bluemercury. To try to reverse that trend, the retailer has stepped up investments in staffing, sharper merchandise and eye-catching displays at Macy's stores. It first rolled out that strategy at 50 locations, which were dubbed the \"First 50,\" and has since expanded that approach to a total of 125 Macy's locations. That's more than a third of the 350 namesake stores that Macy's plans to keep open.Along with the added investment, it has shuttered lower-performing Macy's locations. It announced in early 2024 that it would permanently close about 150 of its namesake stores by early 2027, while planning to add locations for Bloomingdale's and Bluemercury. The company hasn't yet said how many additional stores it may close this fiscal year. In the three-month period that ended Nov. 1, Macy's net income fell to $11 million, or 4 cents per share, compared with $28 million, or 10 cents per share, in the year-ago period. Adjusting for some one-time items, including gains on the sale of real estate, it reported earnings per share of 9 cents.Revenue decreased from $4.74 billion in the year-ago quarter.In the fiscal third quarter, companywide comparable sales rose 3.2% including owned and licensed merchandise and its third-party marketplace. When the company excluded stores that won't be part of its go-forward business, that growth was 3.4%.Bloomingdale's posted the strongest performance of the company's brands, with comparable sales jumping 9% year over year on an owned-plus-licensed basis, including its third-party marketplace. And Bluemercury's comparable sales increased 1.1%.Spring attributed the company's better performance to shoppers responding to changes that Macy's has made to its legacy department stores – such as additional staff ready to help and newer brands like high-end home goods company MacKenzie-Childs.He said he visited Macy's stores, and those of its competitors, on Black Friday and was pleased by what he saw. \"I like the way we're showing up,\" Spring said. \"We look crisp. We look clean. We look interesting, compelling, inspiring, easy to shop.\"The snap to cooler weather helped, too, he said. As temperatures dropped in October, shoppers bought items including cashmere sweaters, outerwear and boots. For the holiday season, Spring said he expects promotions to be at similar levels to the year-ago period at Macy's stores and website, along with those of its competitors.Higher tariffs, however, will mean higher prices for some items. Macy's has worked with vendors and manufacturers to blunt the impact of the duties, and the hit to margins in the third quarter came in lower than the company expected, he said. Still, Spring said Macy's has made \"selective\" price increases in almost every category, with some items costing more because of improved quality or an added embellishment and some simply due to higher import costs.As of Tuesday's close, Macy's shares have risen about 34% so far this year. That outpaces the S&P 500's 16% gains during the same period. Macy's stock closed Tuesday at $22.71, bringing the company's market cap to about $6.10 billion.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Macy’s posts strongest growth in more than 3 years, but strikes cautious note on holidays",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108233430-1764765438132-108233430-1764337028507-gettyimages-2248237179-BLACK_FRIDAY_SHOPPING.jpg?v=1764765456&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T14:27:50.000Z",
      "dateModified": "2025-12-03T14:27:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Putin threatens Europe with war if it wants one, as Ukraine peace talks falter",
    "url": "https://www.cnbc.com/2025/12/03/russia-ready-for-war-with-europe-putin-says-before-ukraine-peace-talks.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236025-1764779806083-gettyimages-2249105260-RUS_Russian_President_Vladimir_PutinParticipates_In_A_Volunteers_Forum_In_Moscow.jpeg?v=1764779832&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-03T16:38:15.000Z",
    "description": "Russian President Vladimir Putin smiles while visiting the We Are Together Fourm and Awards Ceremony, on December 3, 2025 in Moscow, Russia. Contribut",
    "body": "Russian President Vladimir Putin smiles while visiting the We Are Together Fourm and Awards Ceremony, on December 3, 2025 in Moscow, Russia. Contributor | Getty ImagesPeace talks held between the U.S. and Russia on Tuesday failed to deliver a breakthrough with Russian President Vladimir Putin ahead of discussions doubling down on threats toward Europe, saying Russia was \"ready\" for war with the Continent.U.S. President Donald Trump's special envoy, Steve Witkoff, and son-in-law Jared Kushner had traveled to Moscow for talks with Putin and his closest aides on a draft peace plan aimed at ending the almost four-year war in Ukraine. The talks lasted five hours, Russian presidential aide Yuri Ushakov told reporters after the discussions, saying the meeting focused on a U.S.-drafted peace plan and was \"very useful, constructive, and highly informative\" but that there was more work to be done. \"We agreed on some things ... while others caused criticism, and the President [Putin] also made no secret of our critical, even negative, attitude toward a number of proposals. But the main thing is that we had a very useful discussion,\" Ushakov said, in comments translated by NBC News. It's unclear which peace plan was presented to the Russians after an initial 28-point plan, secretly devised by the U.S. and Russia, was presented to Ukraine a few weeks ago. Kyiv and its European allies hastily amended that plan, whittling it down to 19 proposals, with Ukrainian officials travelling to Florida last weekend for more talks on the proposals.Russian President Vladimir Putin at a meeting with U.S. special envoy Steve Witkoff and U.S. President Donald Trump's son-in-law Jared Kushner at the Kremlin, aimed at finding a solution to end the Ukraine war, in Moscow, Russia on December 2, 2025.Kremlin Press Office/Anadolu via Getty ImagesRussia and Ukraine are miles apart when it comes to central elements of a framework peace agreement, with Moscow demanding that Kyiv cede partially occupied territory in the east of the country to Russia, and disagreeing over Western-backed security guarantees for Ukraine.Putin aide Ushakov said Tuesday that both sides had discussed a 27-point plan and had received more documents from the U.S. side, although he did not elaborate as to what those contained. He added that Russia and the U.S. had agreed to not disclose details of the talks.Speaking to reporters on Wednesday, Kremlin spokesperson Dmitry Peskov said it would be incorrect to say Putin had rejected the proposals put to him by the U.S. delegation. \"A direct exchange of views took place yesterday for the first time,\" Peskov said, in comments cited by the Reuters news agency. \"Some things were accepted, some things were marked as unacceptable — this is a normal working process of finding a compromise.\"'Ready' for warThe talks in Moscow came after Putin launched a tirade against Europe, saying that its counter peace proposals were \"absolutely unacceptable\" for Russia, and that the region's leadership had \"no peace agenda.\" \"We're not going to war with Europe; I've said that a hundred times. But if Europe suddenly wants to fight us and starts, we're ready right now,\" Putin told journalists ahead of his meeting with Witkoff and Kushner.European officials have expressed consternation in recent weeks that they, and Ukraine, were excluded from initial talks between the U.S. and Russia that led to an original draft peace plan seen to heavily favor Russia. Russian President Vladimir Putin speaks, as he visits the command post of the Russian forces \"West\" grouping in the course of Russia-Ukraine conflict, in unidentified location, in this still image taken from video released Nov. 20, 2025. Kremlin.ru | Via ReutersEU foreign policy chief Kaja Kallas said Monday that \"this week could be pivotal for diplomacy. It is clear that Russia does not want peace, and therefore we need to make Ukraine as strong as possible.\"Europe will have watched Tuesday's talks in Russia closely. There are concerns that Trump, who has appeared to have a warmer relationship with Putin than with Ukraine's president, Volodymyr Zelenskyy, at times, could throw his support behind Russia's peace proposals in a bid to end the war sooner rather than later.Eager to appear optimistic over the prospect of peace, Zelenskyy told Irish lawmakers on Tuesday that Ukraine was \"closer to peace than ever before\" and that there was a \"real, real chance\" of an agreement after talks with Washington.No hurry for a dealGeopolitical experts say the Kremlin is willing to eke out the peace process for as long as possible, with Russia maintaining that it has the advantage on the battlefield and can extract heavy concessions from Ukraine in the peace process.Paul Skinner, investment director at Wellington Management, was also pessimistic over any near-term progress toward peace.\"We think the Ukraine-Russia story is going to grind on, and on, and on,\" he told CNBC's \"Squawk Box Europe\" on Wednesday.\"It's very unlikely we're going to get a resolution. While Putin is still making ground, he's unlikely to sue for peace. I'm afraid that our prognosis, and it has been from the start, is that this is going to be a very long drawn-out problem.\"Michael Froman, president of the Council on Foreign Relations, said it was in Putin's \"interest just to keep the process going, to have a long process of diplomatic engagement.\" watch now\"He wants to have a broader conversation about Russia's reintegration with the West and relations with the United States, commercial agreements with the United States, and to make this long and drawn out while he continues to bomb Ukraine's energy infrastructure and makes incremental progress on the ground,\" Froman told CNBC's \"Squawk Box\" on Tuesday.Amos Hochstein, TWG Global managing partner and former senior advisor to the president in the Biden administration, agreed that Russia would likely drag its heels over a deal.watch now\"I think it's difficult to get to a point of a deal where a lot of territory has to be given up by the Ukrainians in return for security guarantees that are a bit loose and flimsy, and for the Ukrainians who fought so much over the last several years, that's hard to swallow,\" he said Tuesday on CNBC's \"Squawk Box.\"\"I think the problem is that the Ukrainians probably can compromise in some of this, but any concessions they would get from the U.S. on that deal would be difficult to get the Russians to agree to [as they] depend on the war, want to win, but also have a war economy.\"\"The Russians are not in a hurry for a deal here,\" he added.Read more CNBC politics coverageJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Putin threatens Europe with war if it wants one, as Ukraine peace talks falter",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236025-1764779806083-gettyimages-2249105260-RUS_Russian_President_Vladimir_PutinParticipates_In_A_Volunteers_Forum_In_Moscow.jpeg?v=1764779832&w=1920&h=1080"
      ],
      "datePublished": "2025-12-03T16:38:15.000Z",
      "dateModified": "2025-12-03T16:38:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]