[
  {
    "title": "Private payroll losses accelerated in the past four weeks, ADP reports ",
    "url": "https://www.cnbc.com/2025/11/25/private-payroll-losses-accelerated-in-the-past-four-weeks-adp-reports-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108228688-1763588355689-gettyimages-2247519637-jr_12638_mensqoss.jpeg?v=1763588472&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T16:21:59.000Z",
    "description": "A 'Now Hiring' sign sits in the window of a Denny's restaurant on Nov. 19, 2025 in Miami, Florida.Joe Raedle | Getty ImagesThe U.S. labor market is sh",
    "body": "A 'Now Hiring' sign sits in the window of a Denny's restaurant on Nov. 19, 2025 in Miami, Florida.Joe Raedle | Getty ImagesThe U.S. labor market is showing further signs of weakening as the pace of layoffs has picked up over the past four weeks, payrolls processing firm ADP reported Tuesday.Private companies lost an average of 13,500 jobs a week over the past four weeks, ADP said as part of a running update it has been providing. That's an acceleration from the 2,500 jobs a week lost in the last update a week ago.With the government shutdown still impacting data releases, alternative information like ADP's has been filling in the blanks on the economic picture. Government agencies such as the Bureaus of Labor Statistics and Economic Analysis have released revised schedules, but critical reports such as the monthly nonfarm payrolls count won't come out until December.Policymakers at the Federal Reserve won't have much of the usual data they use to make forecasts when they meet again Dec. 9-10. However, in recent days, several officials have advocated for additional interest rate cuts, causing the market to recalibrate expectations to now expecting a reduction at next month's meeting.\"With the next jobs report now scheduled for December 16 and CPI for December 18, there is little on the calendar to derail a cut on December 10,\"  Jan Hatzius, chief economist at Goldman Sachs, said in a client note Sunday.When the releases do start rolling out, Hatzius said he expects that \"alternative indicators show renewed job losses in October\" even though the BLS last week reported better-than-expected 119,000 growth in payrolls for September.The Goldman team expects the Fed to react with a cut in December and two more quarter percentage point reductions in 2026.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Private payroll losses accelerated in the past four weeks, ADP reports ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108228688-1763588355689-gettyimages-2247519637-jr_12638_mensqoss.jpeg?v=1763588472&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T16:21:59.000Z",
      "dateModified": "2025-11-25T16:21:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FBI seeks to interview Sen. Mark Kelly, other Democrats Trump accused of seditious behavior",
    "url": "https://www.cnbc.com/2025/11/25/trump-fbi-mark-kelly-democrats-pentagon-video.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231704-1764080581721-Untitled-1.jpg?v=1764080654&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T20:01:56.000Z",
    "description": "U.S. Senator Mark Kelly (D-AZ) looks on at a press conference calling for the release of the Epstein files, on Capitol Hill in Washington, D.C., U.S.,",
    "body": "U.S. Senator Mark Kelly (D-AZ) looks on at a press conference calling for the release of the Epstein files, on Capitol Hill in Washington, D.C., U.S., November 18, 2025. Picture taken November 18, 2025.Annabelle Gordon | ReutersThe FBI is seeking to interview Sen. Mark Kelly of Arizona and five other congressional Democrats in connection with their appearance in a video encouraging members of the U.S. military to refuse to follow illegal orders, those lawmakers confirmed Tuesday.President Donald Trump last week blasted the video, accusing Kelly and the other lawmakers of \"seditious behavior,\" calling them \"traitors,\" and saying that, \"In the old days, if you said a thing like that, that was punishable by death.\"The other lawmakers on the video were Michigan Sen. Elissa Slotkin, as well as House Reps. Jason Crow of Colorado, Maggie Goodlander of New Hampshire, and Chris Deluzio and Chrissy Houlahan, both of Pennsylvania.Slotkin said the FBI's Counterterrorism Division \"appeared to open an inquiry into me in response to a video President Trump did not like.\"\"The President directing the FBI to target us is exactly why we made this video in the first place,\" Slotkin said in a tweet. \"He believes in weaponizing the federal government against his perceived enemies and does not believe laws apply to him or his Cabinet. He uses legal harassment as an intimidation tactic to scare people out of speaking up.\"Goodlander, Crow, Deluzio, and Houlahan, in a joint statement, said, \"President Trump is using the FBI as a tool to intimidate and harass members of Congress,\" \"Yesterday, the FBI contacted the House and Senate  Sergeants at Arms requesting interviews,\" the statement said. \"No amount of intimidation or  harassment will ever stop us from doing our jobs and honoring our Constitution,\" the lawmakers said. \"We swore an oath to support and defend the Constitution of  the United States. That oath lasts a lifetime, and we intend to keep  it. We will not be bullied. We will never give up the ship.\"Kelly's office told NBC News, \"Senator Kelly won't be silenced by President Trump and Secretary Hegseth's attempt to intimidate him and keep him from doing his job as a U.S. Senator.\"Fox News first reported on the FBI's efforts.Earlier Tuesday, Defense Secretary Pete Hegseth lashed out online over Kelly's display of his U.S. Navy medals after the Pentagon began investigating him for encouraging service members to refuse to obey unlawful orders.\"So 'Captain' Kelly, not only did your sedition video intentionally undercut good order & discipline … but you can't even display your uniform correctly,\" Hegseth snapped in a post on X, which replied to a tweet by Kelly showing his medals.\"Your medals are out of order & rows reversed. When/if you are recalled to active duty, it'll start with a uniform inspection,\" said Hegseth, a former Fox News host and a former major in the Army National Guard.The Pentagon on Monday said it was investigating \"serious allegations of misconduct\" against Kelly, who is a retired Navy captain, for his role in the video. Sen. Mark Kelly (D-AZ) military uniform.Source: @SenMarkKelly | XThe Pentagon said Kelly could be recalled to active military duty and face a possible court-martial for potential violations of the Uniform Code of Military Justice.The UCMJ requires service members to obey \"any lawful general order or regulation.\"Kelly, in response Monday, posted on X a statement saying that the Pentagon's probe \"won't work\" if \"this is meant to intimidate me and other members of Congress from doing our jobs and holding this administration accountable.\"His post also included a close-up photo of Kelly in his Naval uniform, showing the medals on the shirt's breast pocket.\"Our laws are clear: you can refuse illegal orders,\" Kelly said on the video, which was tweeted on Nov. 18 by Slotkin of Michigan, a former CIA analyst.Slotkin wrote in her tweet: \"We want to speak directly to members of the Military and the Intelligence Community. The American people need you to stand up for our laws and our Constitution. Don't give up the ship.\"Read more CNBC politics coverageJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'The video was made as the U.S. military, under Trump, has carried out more than 20 airstrikes on boats in the Caribbean and eastern Pacific Ocean against purported drug smugglers, killing scores of people on those vessels.The legality of those strikes, which were made without congressional authorization, has been questioned.On Monday, a group of Democratic senators, including Kelly and Slotkin, wrote Hegseth and Attorney General Pam Bondi to request that they declassify a Department of Justice Office of Legal Counsel's written opinion from September on the domestic and international legal basis for the strikes.FBI Director Kash Patel, speaks during a press conference related to arrests of NBA players and coaches for illegal gambling schemes, at the U.S. Attorney's Office in Brooklyn, New York, October 23, 2025.   Eduardo Munoz | Reuters\"Few decisions are more consequential for a democracy than the use of lethal force,\" the letter said.\"We therefore believe that the declassification and public release of this important document would enhance transparency in the use of deadly force by our Nation's military and is necessary to ensure Congress and the American people are fully informed of the legal justification supporting these strikes,\" it said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FBI seeks to interview Sen. Mark Kelly, other Democrats Trump accused of seditious behavior",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231704-1764080581721-Untitled-1.jpg?v=1764080654&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T20:01:56.000Z",
      "dateModified": "2025-11-25T20:01:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sen. Jim Justice, wife sued for $5 million in unpaid taxes from 2009 as legal woes mount",
    "url": "https://www.cnbc.com/2025/11/24/jim-justice-sued-taxes-west-virginia-coal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107232403-1682632158127-AP22028096038632.jpg?v=1682632367&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T13:21:07.000Z",
    "description": "West Virginia Gov. Jim Justice holds up his dog Babydog as he comes to the end of his State of the State speech in the House chambers, at the West Vir",
    "body": "West Virginia Gov. Jim Justice holds up his dog Babydog as he comes to the end of his State of the State speech in the House chambers, at the West Virginia State Capitol in Charleston, W.Va., Thursday, Jan. 27, 2022.Chris Dorst | Charleston Gazette | APThe U.S. government on Monday sued Sen. Jim Justice, a West Virginia Republican, and his wife for more than $5 million in unpaid federal income taxes, penalties, and interest dating to the 2009 tax filing year.\"Despite notice and demand for payment of the assessments ...James C. Justice, II, and Cathy L. Justice have neglected or refused to make full payment of those assessments to the United States,\" the lawsuit filed in U.S. District Court in Beckley, West Virginia, alleged.The lawsuit, filed by the Tax Division of the Department of Justice, asks a judge to enter a judgment in favor of the U.S. against the couple in the amount of $5,164,739.75, the amount owed to the Internal Revenue Service as of Aug. 4, according to the filing.Hours after the suit was docketed, a lawyer for the Justices and the DOJ filed a joint motion asking a judge to enter a consent judgment in favor of the U.S. for the amount requested.The motion, which still requires a judge's approval, indicates that the couple agreed to resolve their case by being ordered to pay the amount requested. But it does not say when they would or could pay that money.The suit was filed nearly two months after the IRS filed notices of tax liens for more than $8 million against Justice, who is the former governor of West Virginia, in Greenbrier County.One of the notices referenced a federal income tax assessment of more than $3 million for the tax year 2009, which was assessed on Nov. 25, 2015 — the same date as the assessment referenced in the lawsuit filed Monday.The second federal income tax assessment, for nearly $5 million, was for the tax filing year 2017. A third such assessment, for the 2024 tax year, was for nearly $11,000./ Politico, which first broke the news of the tax lien on Oct. 10, noted then that the IRS website says \"generally the IRS can pursue collection of a tax liability up to 10 years from the date it was assessed. A Notice of Federal Tax Lien may be filed any time within that 10-year period.\"Tuesday is the end of a 10-year period that would have begun on Nov. 25, 2015.Justice was elected to the Senate in November 2024, replacing Sen. Joe Manchin, an independent who quit the Democratic caucus earlier that year. The coal mining heir previously served as West Virginia's governor from 2017 until he entered the Senate in January.Read more CNBC politics coverageJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'The tax-related lawsuit comes weeks after a federal judge in Tennessee found Justice liable for more than $29 million in civil damages and prejudgment interest to Lexon Insurance Company over a breached surety-bond contract tied to his coal mining business.CNBC has requested comment on the tax lawsuit from Justice's Senate office and from attorneys who have represented him.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sen. Jim Justice, wife sued for $5 million in unpaid taxes from 2009 as legal woes mount",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107232403-1682632158127-AP22028096038632.jpg?v=1682632367&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T13:21:07.000Z",
      "dateModified": "2025-11-25T13:21:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia stock falls 4% on report Meta will use Google AI chips",
    "url": "https://www.cnbc.com/2025/11/25/nvidia-shares-today-google-meta-ai-chip-report.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108228213-1763561227417-108228213-1763561133114-gettyimages-2244308088-_cho5546_p4bef2c1.jpg?v=1763561236&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T19:19:29.000Z",
    "description": "Jensen Huang, NVIDIA founder and CEO, has a Q&A session at a press conference during the APEC CEO summit  on October 31, 2025 in Gyeongju, South Korea",
    "body": "Jensen Huang, NVIDIA founder and CEO, has a Q&A session at a press conference during the APEC CEO summit  on October 31, 2025 in Gyeongju, South Korea.Woohae Cho | Getty Images News | Getty ImagesNvidia shares fell on Tuesday after The Information reported that Meta is considering using chips designed by Google. Shares of Nvidia fell as much as 7% before recovering to trade down 4.3% later in the day. Google parent Alphabet was 4.2% higher after a more than 6% rally on Monday.On Monday, The Information reported that Meta is considering using Google's tensor processing units, or TPUs, in its data centers in 2027. Meta may also rent TPUs from Google's cloud unit next year, the publication reported. \"Google Cloud is experiencing accelerating demand for both our custom TPUs and NVIDIA GPUs; we are committed to supporting both, as we have for years,\" a Google spokesperson told CNBC.Google launched its first-generation TPU in 2018 and it was initially designed for its own internal use for its cloud computing business. Since then, Google has launched more advanced versions of its chip that are designed to handle artificial intelligence workloads. TPUs are a customized chip and experts say this gives Google an advantage over rivals as it can offer customers a highly efficient product for AI.If Meta uses the TPUs, it would be big win for Google and potential validation of the technology.Shares of Broadcom, which helps Google design its TPUs, were up more than 1% on Tuesday after an 11% rise the day before.watch nowNvidia remains the market leader with its graphics processing units, GPUs, that have become the main piece of hardware underpinning the huge AI infrastructure build-out. While Nvidia's dominance is unlikely to be dislodged in the near term, Google's TPUs add further competition into the AI semiconductor market.Shares of Advanced Micro Devices, previously seen as offering the most credible challenger to Nvidia's GPUs, were trading 6% lower on Tuesday. Chip designer Arm's shares fell 4.2%.\"There was some sense that [AMD] could be the number two [in the market] and now it's become clear that there may not be room for that,\" Gil Luria, head of technology research at D.A. Davidson, told CNBC.Companies building AI infrastructure have been searching for a more diversified supply of chips to reduce reliance on Nvidia. Meta is among the biggest spenders on AI infrastructure, with the company projecting its capital expenditures to stand between $70 billion and $72 billion this year. The share price moves come amid continued debate around whether there is an \"AI bubble\" and stretched tech company valuations. Nvidia has been central to the debate and the company last week reported a stronger-than-expected sales forecast for the current quarter but technology stocks fell after. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia stock falls 4% on report Meta will use Google AI chips",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108228213-1763561227417-108228213-1763561133114-gettyimages-2244308088-_cho5546_p4bef2c1.jpg?v=1763561236&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T19:19:29.000Z",
      "dateModified": "2025-11-25T19:19:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "IRS releases guidance for Trump's tips, overtime deductions. What workers need to know",
    "url": "https://www.cnbc.com/2025/11/25/irs-guidance-trump-tips-overtime-deductions.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108200911-1758222716420-gettyimages-1479789937-20230403-dsc07142-edit.jpeg?v=1758222734&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T19:48:02.000Z",
    "description": "Ugur Karakoc | E+ | Getty ImagesAs tax season approaches, the IRS has released guidance for workers who can claim the federal deduction for tips and o",
    "body": "Ugur Karakoc | E+ | Getty ImagesAs tax season approaches, the IRS has released guidance for workers who can claim the federal deduction for tips and overtime pay enacted via President Donald Trump's \"big beautiful bill.\"The guidance released last week covers how to report these deductions on tax returns. But workers could still face questions at tax time, experts say. The tip provision allows certain workers to deduct up to $25,000 in \"qualified tips\" from 2025 through 2028. The tax break phases out once modified adjusted gross income exceeds $150,000, or $300,000 for married couples filing jointly.      Meanwhile, Trump's tax break for eligible overtime pay offers a deduction of up to $12,500 for single filers or $25,000 for joint filers, with the same income phaseouts. This provision is also temporary, in effect from 2025 through 2028.    Read more CNBC personal finance coverageIRS releases guidance for Trump's tips, overtime deductions. What workers need to knowWhy ACA subsidy cliff may discourage people from workingMost retirees don't tell adult children about their inheritance. What to knowShoppers curtail Black Friday plans to stretch their budgets, limit debtCash can feel safe, 'but it doesn't grow your wealth,' portfolio strategist saysMany retirees soon must take year-end required withdrawals — and mistakes can be costlyRecent college grads face one of the toughest job markets in a decade56-year-old man just got over $170,000 in student loan forgiveness under TrumpSocial Security 2026 benefit notices: Here are the changes to monitorRoth conversions could trigger a ‘tax torpedo’ under Trump’s ‘big beautiful bill’Why AI may kill career advancement for many young workersConcerns mount for student loan borrowers amid Education Department restructuringNew Social Security scam uses ‘high pressure’ scare tactics. What to watch forTrump administration takes further steps to dismantle Department of EducationMillions of federal student loan borrowers will start repayment soon. Here’s what to knowCNBC's Financial Advisor 100: Best financial advisors, top firms for 2025 rankedWorkers can deduct tips or overtime pay if those earnings are reported via so-called information returns, such as Forms W-2 or 1099, according to the legislation. While the IRS is \"strongly encouraging\" employers to provide this reporting, it's not required for tax year 2025, said Thomas Gorczynski, a Tempe, Arizona-based enrolled agent, which is a tax license to practice before the IRS. Gorczynski, who also educates tax professionals on legislation changes, said: \"We're going to have this hodgepodge, weird year of rules that's going to make reporting very difficult for employees.\"Approximately 6 million workers report tipped wages, according to IRS estimates. And nationally, about 6% of workers reported overtime pay in 2024, according to the Peter G. Peterson Foundation, an economic organization. These taxpayers will soon have to navigate Trump's tip and overtime deductions for 2025, which apply to their returns filed in 2026.  \"Taxpayer confusion will be off the charts at tax time on these provisions,\" Terry Lemons, former communications and liaison chief for the IRS, said in a LinkedIn post last week. 'Transition relief' for some tipped workersThe new IRS guidance also includes \"transition relief\" for certain workers who receive tips via a so-called \"specified service trade or businesses,\" or SSTBs.Trump's 2017 tax law outlined the list of SSTBs to limit eligibility for a 20% deduction for certain businesses, and includes sectors like health care, legal, financial services, performing arts and more.SSTB workers are excluded from claiming the new tip deduction under Trump's \"big beautiful bill.\" But these workers may briefly be eligible for the tip deduction until the Treasury Department and IRS finalize regulations.\"I don't want people to think that this new waiver is the permanent provision or a permanent guidance,\" Gorczynski said.It's a \"temporary waiver\" for some SSTB workers to claim the tip deduction for 2025, he said. But there could be an \"unhappy surprise\" in 2026 and future years if eligibility goes away.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "IRS releases guidance for Trump's tips, overtime deductions. What workers need to know",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108200911-1758222716420-gettyimages-1479789937-20230403-dsc07142-edit.jpeg?v=1758222734&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T19:48:02.000Z",
      "dateModified": "2025-11-25T19:48:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bill Gates: Read these 5 books—each one 'sparks your curiosity' and reveals 'how something important really works'",
    "url": "https://www.cnbc.com/2025/11/25/bill-gates-book-list-read-these-during-the-2025-holidays.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231351-1764026740924-Bill_Gates_Holiday_Books.jpg?v=1764081336&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T18:00:01.000Z",
    "description": "Colder weather and, for many, some time off for the holidays makes winter a perfect time of year to \"catch up on reading,\" according to billionaire an",
    "body": "Colder weather and, for many, some time off for the holidays makes winter a perfect time of year to \"catch up on reading,\" according to billionaire and avid reader Bill Gates.\"There's something about the quieter days around the holidays that makes it easier to sit down with a good book,\" Gates wrote in a blog post published on Tuesday that includes his latest annual list of holiday season book recommendations.Gates' list of \"recent favorites\" includes a wide variety of authors and genres, from a book by a Harvard psychologist that dissects the concept of \"common knowledge\" to a fictional work about an aging night janitor in an aquarium. The list also features a media mogul's recent memoir, a book that Gates calls a \"hopeful, fact-driven overview\" of the current climate crisis, and a nonfiction political bestseller about government regulations and American innovation.DON'T MISS: Exclusive Black Friday discounts on courses to help you earn more money and get ahead at work\"Each of these books pulls back the curtain on how something important really works: how people find purpose later in life, how we should think about climate change, how creative industries evolve, how humans communicate, and how America lost its capacity to build big things — and how to get it back,\" wrote Gates.Here are the five books Gates recommends reading during this holiday season:'Remarkably Bright Creatures' by Shelby Van PeltTold partially from the perspective of an octopus, Van Pelt's 2022 novel meets Gates' top condition for any work of fiction, he wrote: \"I want to read about interesting characters who help me see the world in a new way.\"Gates, who turned 70 in October, also wrote that he related to the book's human protagonist: a 70-year-old widow named Tova, a janitor working the night shift at the aquarium housing Marcellus the octopus. The book follows a developing friendship between Tova and Marcellus, and Gates referred to it as a thought-provoking exploration of \"relationships and getting older,\" particularly struggles with loneliness and the search for meaning as one enters the final chapter of their life.\"Van Pelt's story made me think about the challenge of filling the days after you stop working — and what communities can do to help older people find purpose,\" wrote Gates, who has previously said that retirement \"sounds awful.\"'Clearing the Air' by Hannah RitchieHannah Ritchie is a University of Oxford data scientist who Gates has previously touted for her \"surprisingly optimistic\" analyses of the ongoing fight against climate change. Her latest book — which published in the U.K. on Sept. 18, and is set to publish in the U.S. in March 2026 — \"is one of the clearest explanations of the climate challenge I've read,\" Gates wrote.In \"Clearing the Air,\" Ritchie focuses on 50 questions about the climate crisis — like, whether renewable energy alternatives are too expensive to be effective, or if it's too late to limit global warming and avoid further climate disasters — offering answers that are \"realistic about the risks but grounded in data that shows real progress,\" Gates wrote.Like Ritchie, Gates has touted the environmental movement's progress — from increased use of solar and wind power to the popularity of electric vehicles — and rejected a \"doomsday outlook\" of climate change that the billionaire worries could distract us from other areas of concern, he wrote in a separate blog post in October.Gates has spent decades, and billions of dollars, on combatting climate change. He recently drew some criticism from scientists for arguing that some of the resources earmarked for climate initiatives would be better used on issues like welfare and poverty.\"If you want a hopeful, fact-driven overview of where climate solutions stand, this is a great pick,\" Gates wrote of Ritchie's book on Tuesday.'Who Knew' by Barry DillerBarry Diller, the billionaire IAC and Expedia chairman who also co-founded Fox Broadcasting, published his memoir in May 2025. Even though Gates considers Diller a longtime friend, he wrote, the media mogul's book \"still managed to surprise and teach me a lot about him, his career, and the many industries he's transformed.\"Diller is credited with inventing concepts like the made-for-television movie and TV miniseries during his years as an entertainment executive. Later, Diller \"was early to see the internet's potential and willing to bet on it when others weren't,\" including buying Expedia from Microsoft in 2001 and building IAC into one of the earliest media and internet conglomerates, Gates noted.Gates considered Diller's book to be insightful about the mogul's rise to corporate power, he wrote — and \"raw and honest\" about Diller's personal life, including a decision to come out as gay earlier this year at age 83.'When Everyone Knows That Everyone Knows' by Steven Pinker\"Few people explain the mysteries of human behavior better than Steven Pinker,\" Gates wrote about the professor of psychology at Harvard University who studies how humans interact. Pinker's latest book, which published on Sept. 23, \"is a must-read for anyone who wants to learn more about how people communicate,\" Gates wrote.In \"When Everyone Knows That Everyone Knows,\" Pinker explores how \"common knowledge\" shapes so many aspects of our lives, including how we communicate and work with others. And as Gates wrote: \"Most people would benefit from understanding how common knowledge props up every conversation we have,\" and how to used that shared understanding to more effectively collaborate with others.\"Although the topic itself is pretty complicated, the book is readable and practical, and it made me see everyday social interactions in a new light,\" Gates wrote.'Abundance' by Ezra Klein and Derek ThompsonWritten by two journalists — Thompson is a contributing writer at The Atlantic and Klein is a columnist at The New York Times and co-founder of Vox — \"Abundance\" offers \"a sharp look at why America seems to struggle to build things and what it will take to fix that,\" wrote Gates.Klein and Thompson argue that regulations, particularly some championed by progressive politicians, have stymied U.S. development in areas ranging from infrastructure and affordable housing to scientific breakthroughs. To fix the bottleneck, the writers propose an \"abundance agenda\" that would promote spending on development while cutting back on red tape to help accelerate the pace of new projects.The book has critics on both sides of the political aisle, and Gates wrote that it \"doesn't have all the answers.\" However, the writers \"are asking the right questions\" based on Gates' own experiences working with government agencies on large-scale global health and climate technology projects, he wrote.\"I've seen how the bottlenecks discussed in 'Abundance' impede progress in global health — whether we're trying to improve seeds, design better toilets, or eradicate polio,\" Gates wrote. \"Sometimes the science itself is hard. But often, the logistics and execution are even harder.\"Earn more and get ahead with CNBC's online courses. Black Friday starts now! Get 25% off select courses and 30% off exclusive bundles with coupon code GETSMART. Offer valid November 17 through December 5, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bill Gates: Read these 5 books—each one 'sparks your curiosity' and reveals 'how something important really works'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231351-1764026740924-Bill_Gates_Holiday_Books.jpg?v=1764081336&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T18:00:01.000Z",
      "dateModified": "2025-11-25T18:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Applying to jobs from Thanksgiving to New Year's isn't pointless, experts say: 'You actually have more opportunity to stand out'",
    "url": "https://www.cnbc.com/2025/11/25/applying-to-jobs-from-thanksgiving-to-new-years-isnt-pointless-experts-say.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107430025-1718656003797-gettyimages-1448338850-dsc_1473.jpeg?v=1763666509&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T14:20:01.000Z",
    "description": "You may have heard of the September Surge. With summer vacations ending, kids back in school, and end-of-year goals coming back into focus, some emplo",
    "body": "You may have heard of the September Surge. With summer vacations ending, kids back in school, and end-of-year goals coming back into focus, some employers go on a hiring spree. Even in the rockier job market this year, delayed Bureau of Labor Statistics data shows the U.S. added 119,000 jobs in September, far more than expected. On the other side of the equation, job seekers are often busy applying left and right in September. But around the holidays, many press pause on their job search.\"People assume that companies aren't hiring or that they just stop hiring from Thanksgiving through New Year's, and that is not true,\" Vicki Salemi, career expert at Monster, tells CNBC Make It.\"Some job seekers may say, 'It's Thanksgiving and then the holidays; I'll wait until January,'\" she adds. But \"if the majority of people do that, then you actually have more opportunity to stand out because there's less competition.\"Behind the scenesKarolina Severova, a senior talent acquisition specialist in higher education, says the fourth quarter was always one of her strongest when she was an agency recruiter, filling positions across businesses and industries.\"Some companies have to spend the remainder of their budget, or they will lose it going into next year,\" she says. Teams could be rushing to fill spots that have already been guaranteed for this year, since they don't know what they'll get next year.If an employer has a big project kicking off in the new year or just wants to start the year strong, they might want to onboard talent now so they can hit the ground running in January.A good time to connectThe end of the year can also be fruitful for networking.\"The holidays just present a very natural opening for reconnecting with others,\" career expert Amanda Augustine previously told Make It.Industry or vocational groups often have year-end parties, and the added festivity around the holidays can alleviate some of the usual pressure of networking events.Outside of events, you can send a quick note to check in with people in your network, share an update from your work and life, and wish them happy holidays and a wonderful year ahead; even a short message can help bring you to mind for job openings. Since November and December are slower at work for many people, you may also be able to schedule time to catch up.Of course, there are many reasons people might want to scale back their job search around the holidays. It's often a time for family, celebrations, and rest. Job seekers may also want a break from this tough job market. But if your holdup is that you think hiring has ended for the year, think again. If a team needs to fill a position before the end of the year, Severova says, \"they will make sure to do everything in their power to pursue a new hire.\"Earn more and get ahead with CNBC's online courses. Black Friday starts now! Get 25% off select courses and 30% off exclusive bundles with coupon code GETSMART. Offer valid November 17 through December 5, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Applying to jobs from Thanksgiving to New Year's isn't pointless, experts say: 'You actually have more opportunity to stand out'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107430025-1718656003797-gettyimages-1448338850-dsc_1473.jpeg?v=1763666509&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T14:20:01.000Z",
      "dateModified": "2025-11-25T14:20:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": " TSMC stock falls as it sues former exec alleging he took trade secrets to Intel",
    "url": "https://www.cnbc.com/2025/11/25/-tsmc-stock-lawsuit-former-executive-trade-secrets-intel.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108193540-1756885982276-gettyimages-2209504202-vcg111560411382.jpeg?v=1764080718&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T15:13:21.000Z",
    "description": "TSMC on Tuesday filed a lawsuit against a former senior vice president it accused of leaking \"confidential information\" to Intel.Wei-Jen Lo joined Int",
    "body": "TSMC on Tuesday filed a lawsuit against a former senior vice president it accused of leaking \"confidential information\" to Intel.Wei-Jen Lo joined Intel after 21 years at TSMC, having left in July, the Taiwanese chip maker said in a statement, announcing the lawsuit.The lawsuit is based on Lo's employment contract and non-compete agreement with TSMC, and regulations such as the Trade Secrets Act, the statement said. \"There is a high probability that Lo uses, leaks, discloses, delivers, or transfers TSMC's trade secrets and confidential information to Intel,\" it said. TSMC's share price fell on Tuesday and was last seen over 3% lower. Intel did not immediately respond to CNBC's request for comment.It follows earlier reports by local media and later by Reuters, which stated Lo may have taken TSMC's technology data to Intel. Taiwan's High Prosecutors opened an investigation into the allegations. Intel CEO Lip-Bu Tan told Bloomberg News last week that his \"company respects intellectual property rights\" and denied any wrongdoing. The U.S. firm's stock price moved 1.5% lower in mid-morning trade.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": " TSMC stock falls as it sues former exec alleging he took trade secrets to Intel",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108193540-1756885982276-gettyimages-2209504202-vcg111560411382.jpeg?v=1764080718&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T15:13:21.000Z",
      "dateModified": "2025-11-25T15:13:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Abercrombie shares soar 30% on Hollister growth, strong earnings beat",
    "url": "https://www.cnbc.com/2025/11/25/abercrombie-fitch-anf-earnings-q3-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108052688-1729806026824-gettyimages-2180831339-abricombe540368_pac1xn4q.jpeg?v=1756224041&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T16:32:20.000Z",
    "description": "An Abercrombie & Fitch store stands in midtown Manhattan in New York City on Oct. 24, 2024.Spencer Platt | Getty ImagesShares of Abercrombie & Fitch s",
    "body": "An Abercrombie & Fitch store stands in midtown Manhattan in New York City on Oct. 24, 2024.Spencer Platt | Getty ImagesShares of Abercrombie & Fitch soared 30% in morning trading on Tuesday after the company showed investors it's set to keep growing, even as its namesake brand slows down. During the apparel retailer's fiscal third quarter, Abercrombie brand sales fell 2%. But for at least the third quarter in a row, Hollister saved the retailer, as sales climbed 16%. CEO Fran Horowitz said sales at Abercrombie are expected to be flat in the current quarter, indicating growth at Hollister is set to drive the company's holiday shopping season. Companywide, sales rose 7%, beating expectations. Here's how the apparel retailer did in the period ended Nov. 1 compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:Earnings per share: $2.36 vs. $2.16 expectedRevenue: $1.29 billion vs. $1.28 billion expectedThe company's reported net income for the quarter was $113 million, or $2.36 per share, compared with $131.98 million, or $2.50 per share, a year earlier.  Sales rose to $1.29 billion, up about 7% from $1.21 billion a year earlier.  The company's namesake banner has fueled its comeback in recent years, but now that the Abercrombie brand's growth has started to moderate, Hollister has picked up the baton. During the quarter, Abercrombie's sales fell to $617.35 million while comparable sales declined by a staggering 7%. Sales came in far below the $631.8 million analysts were expecting, according to StreetAccount. Meanwhile, Hollister's revenue rose to $673.27 million, well above the $649.7 million analysts had expected, according to StreetAccount. Comparable sales rose 15%.As the retailer heads into the peak shopping season, \"Hollister's exciting campaigns and collaborations planned will highlight some must haves,\" Horowitz said on a call with analysts. \"We are just getting started and importantly, our team has been reading and reacting and has the right product to support sales throughout the season.\" She also said Abercrombie is investing more in the Hollister brand, as the company is on pace to open 25 stores and refresh 35 others this year.At the Abercrombie brand, Horowitz said last quarter that the slowdown was related to old inventory the company needed to mark down to sell. She said she expected the brand to be back to growth by the end of the year, but that no longer seems to be the case. During Abercrombie's conference call, executives didn't answer when asked when the brand will return to growth. It spoke about the \"sequential improvement\" Abercrombie saw after a 5% decline in revenue in the previous quarter. Horowitz pointed to recent collaborations with the NFL and luxury retailer Kemo Sabe as bright spots for the brand. \"Abercrombie Brands has inventory in the right place and a strong marketing plan heading into holiday,\" said Horowtiz. \"We've opened 30 new stores in the third quarter, aiming for a total of 36 stores this year. We remain focused on bringing the brand back to growth.\" For its holiday quarter, Abercrombie is expecting companywide sales to climb between 4% and 6%, which is largely below Wall Street expectations of 5.6% growth, according to LSEG. It anticipates earnings per share will be between $3.40 and $3.70, roughly in line with expectations of $3.55 per share. For the full year, it now expects sales to rise between 6% and 7%, largely beating expectations of 6.2% growth, according to LSEG. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Abercrombie shares soar 30% on Hollister growth, strong earnings beat",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108052688-1729806026824-gettyimages-2180831339-abricombe540368_pac1xn4q.jpeg?v=1756224041&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T16:32:20.000Z",
      "dateModified": "2025-11-25T16:32:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dick's Sporting Goods to shutter some Foot Locker stores to protect profits",
    "url": "https://www.cnbc.com/2025/11/25/dicks-sporting-goods-dks-earnings-q3-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231263-1764018749519-gettyimages-2247742047-DICKS_EARNS.jpeg?v=1764018781&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T17:33:56.000Z",
    "description": "A Dick's Sporting Goods store in Pleasant Hill, California, US, on Monday, Nov. 24, 2025. David Paul Morris | Bloomberg | Getty ImagesDick's Sporting ",
    "body": "A Dick's Sporting Goods store in Pleasant Hill, California, US, on Monday, Nov. 24, 2025. David Paul Morris | Bloomberg | Getty ImagesDick's Sporting Goods is planning to close a slew of Foot Locker stores now that its acquisition of the sneaker company is complete, the company said Tuesday when announcing fiscal third-quarter earnings.  It's unclear how many stores Dick's plans to shutter, but the closures are part of a larger restructuring it's implementing so Foot Locker isn't a drag on its profits come fiscal 2026, Dick's Executive Chairman Ed Stack told CNBC's Courtney Reagan. \"We need to clean out the garage,\" said Stack. \"We've taken pretty aggressive markdowns to clean out old merchandise. We're impairing some store assets. We'll close some stores … everything we're doing is there to protect 2026 and just kind of do this one time.\" The company declined to say how many stores would be impacted and whether the restructuring will include layoffs. As a result, Foot Locker's comparable sales are expected to be down in the mid- to high-single digits in the current quarter with margins projected to fall between 10 and 15 percentage points.The entrance to a Footlocker retail store in the Barton Creek Square Mall on Sept. 8, 2025 in Austin, Texas.Brandon Bell | Getty ImagesShares of Dick's Sporting Goods fell roughly 3% in early trading Tuesday. Beyond the Foot Locker business, Dick's stores saw comparable sales rise 5.7% during the quarter, well ahead of the 3.6% analysts had expected, according to StreetAccount. For its namesake banner, the company is now expecting comparable sales to rise between 3.5% and 4%, up from its prior range of 2% to 3.5%. That's ahead of expectations for 3.6% growth, according to StreetAccount. Dick's is also now expecting full-year earnings per share to be between $14.25 and $14.55, up from a previous forecast of $13.90 to $14.50 and in line with expectations of $14.44 per share, according to LSEG. Here's how the big-box sporting goods store performed compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:Earnings per share: $2.78 adjusted vs. $2.71 expectedRevenue: $4.17 billion vs. $3.59 billion expectedThe company's reported net income for the three-month period that ended Nov. 1 was $75.2 million, or 86 cents per share, compared with $227.8 million, or $2.75 per share, a year earlier. Excluding one-time items including the impact of the Foot Locker acquisition, Dick's posted earnings per share of $2.78.Dick's has been a standout performer across the retail industry and now has the challenge of fixing Foot Locker's business so it doesn't weigh on its typically pristine results. Dick's $2.4 billion acquisition of Foot Locker gave it a massive competitive edge in the wholesale sneaker market, most importantly for Nike products, and access to both an international and urban consumer. It's also supercharging the company's growth. Thanks to Foot Locker's revenue, almost $931 million during the quarter, Dick's sales rose a staggering 36% to $4.17 billion from $3.06 billion a year earlier.However, it also acquired some risks. Foot Locker has about 2,400 stores globally and has underperformed for years. Its consumer tends to skew lower income than Dick's' and hasn't held up as well in a softening economy. Under CEO Mary Dillon, Foot Locker had worked to refresh its stores and change the way it merchandises sneakers. Since its acquisition, it began testing changes in 11 stores in North America to see if the fixes improve sales, including cutting products by more than 20%, bringing back apparel and changing Foot Locker's \"footwear wall.\" \"If you'd walked into a Foot Locker store before and you looked at the footwear wall … it was nothing but a run on sentence,\" said Stack. \"It was just a whole bunch of shoes thrown up on the wall, and we took all of that down, we re-merchandised it, focused on shoes we really wanted to sell. ... It's early on, but we're pretty enthusiastic about what we've done.\" — CNBC's Courtney Reagan contributed to this report. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dick's Sporting Goods to shutter some Foot Locker stores to protect profits",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231263-1764018749519-gettyimages-2247742047-DICKS_EARNS.jpeg?v=1764018781&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T17:33:56.000Z",
      "dateModified": "2025-11-25T17:33:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says 'only a few' sticking points remain in Ukraine-Russia peace talks as Kyiv reportedly backs framework",
    "url": "https://www.cnbc.com/2025/11/25/ukraine-russia-peace-trump-abu-dhabi.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231622-17640763492025-11-20t190359z_1557694418_rc2i0ia55dzm_rtrmadp_0_ukraine-crisis-zelenskiy-usa.jpeg?v=1764076379&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T20:09:29.000Z",
    "description": "Ukrainian President Volodymyr Zelenskyy attends a meeting of the Ukraine Defence Contact Group at the Ramstein Air Base in Germany, September 6, 2024.",
    "body": "Ukrainian President Volodymyr Zelenskyy attends a meeting of the Ukraine Defence Contact Group at the Ramstein Air Base in Germany, September 6, 2024. Heiko Becker | ReutersUkrainian officials are willing to move forward with a U.S.-backed framework for a peace deal that would end Kyiv's war with Russia, multiple outlets reported Tuesday — though key details remain unresolved.Reports from ABC News and CBS News both cited an unnamed U.S. official who said that the Ukrainians \"have agreed\" to the deal, while noting that some points still need to be ironed out.It was not clear if the same U.S. official was quoted in both stories.Ukraine President Volodymyr Zelenskyy said later Tuesday that Kyiv was ready to advance the peace framework, Reuters reported, citing a copy of a speech the president gave to a coalition of allied countries.President Donald Trump said at the White House on Tuesday, \"I think we're getting very close to a deal. We'll find out ... I think we're making progress.\"In a Truth Social post later Tuesday afternoon, Trump said, \"there are only a few remaining points of disagreement.\"He directed U.S. special envoy Steve Witkoff to meet with Russian President Vladimir Putin in Moscow and said U.S. Army Secretary Dan Driscoll \"will be meeting with the Ukrainians.\"\"I look forward to hopefully meeting with President Zelenskyy and President Putin soon, but ONLY when the deal to end this War is FINAL or, in its final stages,\" Trump wrote.The post followed U.S. officials meeting with a Ukrainian delegation in Geneva over the weekend for talks that resulted in significant revisions to Washington's initially proffered 28-point peace plan.That plan — which was widely seen as being highly favorable to Russia, the invading force — \"has been fine-tuned, with additional input from both sides,\" Trump acknowledged in Tuesday's post.\"Our delegations reached a common understanding on the core terms of the agreement discussed in Geneva,\" Ukraine National Security Secretary Rustem Umerov said in an X post.But it was far from certain if Russia would assent to the revised peace plan, which has reportedly been narrowed to 19 points.Russian Foreign Minister Sergey Lavrov said any agreement must reflect the understandings reached by Trump and Putin during their August summit in Alaska.On Tuesday, officials from Kyiv and Moscow reportedly met with Driscoll in Abu Dhabi, capital of the United Arab Emirates.The Kremlin was tight-lipped about the discussions taking place there, with Putin's press secretary, Dmitry Peskov, telling reporters overnight that \"we still have nothing to say\" and that the Kremlin was \"monitoring media reports.\"\"We understand that negotiations between the Americans and the Ukrainians are ongoing. We understand that some adjustments are being made to the text that was published; we understand that the text that we unofficially received earlier has already undergone changes, but at some point, the time will probably come when we will also establish contacts with the Americans and we will officially receive some information,\" Peskov said. \"For now, we have no new information.\"The initial, 28-point plan, which Ukraine had not participated in, included controversial terms, such as Ukraine making territorial concessions by handing over the eastern Donbas region that is partially occupied by Russian forces.The original deal also demanded that Ukraine reduce its army by 50%, along with other proposals that crossed Ukraine's \"red lines.\"Trump had pushed Ukraine to accept that deal by the U.S. Thanksgiving Day holiday on Nov. 27, prompting Zelenskyy to declare on Friday that Ukraine faced the difficult choice between \"losing its dignity or losing a key partner,\" referring to the U.S.That deadline appears to have been scrapped. It was unclear how many of the original deal's points remained in the latest version of a potential peace agreement.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says 'only a few' sticking points remain in Ukraine-Russia peace talks as Kyiv reportedly backs framework",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231622-17640763492025-11-20t190359z_1557694418_rc2i0ia55dzm_rtrmadp_0_ukraine-crisis-zelenskiy-usa.jpeg?v=1764076379&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T20:09:29.000Z",
      "dateModified": "2025-11-25T20:09:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best Buy hikes sales forecast as shoppers upgrade tech, splurge on devices",
    "url": "https://www.cnbc.com/2025/11/25/-best-buy-bby-q3-2026-earnings-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108230986-1763999639653-gettyimages-2247701450-BEST_BUY_EARNS.jpeg?v=1763999683&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T18:21:15.000Z",
    "description": "A Best Buy store in Pinole, California, US, on Monday, Nov. 24, 2025. Best Buy Co. is expected to release earnings figures on November 25. David Paul ",
    "body": "A Best Buy store in Pinole, California, US, on Monday, Nov. 24, 2025. Best Buy Co. is expected to release earnings figures on November 25. David Paul Morris | Bloomberg | Getty ImagesBest Buy hiked its full-year forecast Tuesday, as it topped Wall Street's quarterly sales expectations and customers turned to the retailer to upgrade laptops and splurge on new gaming consoles and smartphones. The consumer electronics retailer said it now expects revenue of between $41.65 billion to $41.95 billion for the full year, higher than its previous range of $41.1 billion to $41.9 billion. It expects adjusted earnings per share of $6.25 to $6.35, compared with its prior range of $6.15 to $6.30.Best Buy said it expects full-year comparable sales, a metric that tracks sales online and at stores open at least 14 months, to range between a 0.5% rise to a 1.2% increase, compared with its previous expectations for a 1% decline and a 1% climb.On the company's earnings call, CEO Corie Barry said Best Buy saw \"better-than-expected\" sales in the quarter because of strong results across computing, gaming and mobile phones, as well as growth in wearables and headphones. She said sales rose across both its website and stores. She said customer shopping behavior in the most recent three-month period was about the same as what Best Buy has seen for the past several quarters. \"Customers remain resilient, but deal focused and attracted to more predictable sales moments,\" such as back-to-school sales and Best Buy's October sale that coincided with Amazon's Prime Day event, she said.And she said, \"while customers continued to be thoughtful about big ticket purchases in the current environment, they are willing to spend on high priced point products when they need to or when there is technology innovation.\"Here's how the retailer did for the three-month period that ended Nov. 1 compared with what Wall Street was expecting, according to a survey of analysts by LSEG:Earnings per share: $1.40 adjusted vs. $1.31 expectedRevenue: $9.67 billion vs. $9.59 billion expected Shares were up about 6% in afternoon trading on Tuesday. As of Monday's close, Best Buy's stock has dropped by about 12% this year. That compares with the 14% gains of the S&P 500 during the same period.Best Buy has been waiting for some of the key catalysts that tend to drive its business, such as higher housing turnover that leads to appliance purchases, the tech innovations that spark demand for devices and expert advice, and the increased willingness by inflation-weary consumers to splurge on discretionary items. Some of that tech innovation appears to be gaining momentum with sales of the Nintendo Switch 2, new iPhones and AI-enabled laptops. The company called out those merchandise categories as strengths in the most recent three-month period.Best Buy's net income for the fiscal third quarter fell to $140 million, or 66 cents per share, from net income of $273 million, or $1.26 per share, in the year-ago period. Adjusting for one-time items, including stock-based compensation and restructuring charges, Best Buy reported earnings of $1.40.Revenue rose from $9.45 billion in the year-ago quarter. Best Buy's comparable sales increased 2.7% year over year. That was the company's highest comparable sales growth in four years, Barry said.In the U.S., the metric jumped 2.4%, as shoppers bought computers, gaming systems and mobile phones, but purchased fewer appliances and home theaters. Getting ready for the holidaysBest Buy's annual revenue has dropped for the past three years. With the updated guidance, the company expects annual revenue to be slightly higher than last year's total of $41.53 billion.Still, like other retailers, Best Buy said it's continuing to see shoppers spend selectively and seek out value, and anticipates that will carry into the holiday season, Barry said on a call with reporters.\"We absolutely are seeing people make trade offs,\" she said. For instance, she said, some customers are buying TVs in the middle or lower tier of its price range rather than premium TVs. However, she said Best Buy's reputation as a specialty retailer with many different brands and price points is helping it attract more low-income and younger customers.As the holiday season heats up, Barry said the company is ready for key sales days like Black Friday and Cyber Monday and will have \"deals across the spectrum for whenever people want to shop.\"Even so, the retailer gave a cautious outlook for the holiday quarter, saying it expects sales trends to decelerate from the previous quarter. Bilunas said the company expects comparable sales during the period to range from a 1% decline to a 1% increase.On the company's earnings call, he said Best Buy is seeing \"positive growth\" in the fourth quarter and a roughly similar trend to the third quarter, but faces tougher year over year comparisons and may see waning trends in some categories like gaming and wearables. In gaming, Nintendo Switch 2 sales haven't been as strong as they were closer to the June launch.\"Obviously, the holiday is never easy to predict,\" he said.\" What we do believe is that we have a range of scenarios and the range we've provided gives us a great place to plan and plan our business operationally.\" Higher tariffs will be a complicating factor for the rest of the year, both in how they affect the company's costs and consumer spending. On the company's earnings call, Bilunas said higher tariffs so far haven't had a meaningful impact on Best Buy's prices or its sales. He said growth is coming from more unit sales. Compared to other industries, he said, consumer electronics are a very promotional category and that's muted the impact on average selling prices, he said. Trying out Meta glasses, Sharkninja appliancesAt Best Buy's stores, the company has tried to give customers more reasons to try products by adding more vendor demos, Barry said on the company's earnings call. For example, she said more than 50 of its locations have immersive showcase areas for Meta's latest AI-enabled glasses, and demand for in-person demos has outpaced available appointments. It has launched most of its pilot showrooms with Ikea, which it is testing in 10 stores across Texas and Florida. And other vendors, including Breville and Sharkninja, are also showing off items for home baristas and chefs or customers looking for health and beauty devices in its stores, she said. Barry said \"very early reads are positive and we are excited to monitor customer response during the holidays.\"To help drive growth, Best Buy also launched a third-party marketplace in mid-August to expand the brands and the items that it sells. About three months into the launch, the company has more than 1,000 sellers and 11 times more individual items available for online customers than it did before, Barry said on the earnings call.So far, she said the company is seeing higher sales in categories like accessories and small appliances. She said customer return rates for marketplace items have run lower than first-party purchases, and more than 80% of marketplace product returns by customers have been at stores. As the marketplace grows, she said it's driving higher profits and creating new opportunities for Best Buy to sell online ads.Despite the positive signs, some of Best Buy's categories, including appliances, continue to lag.Chief Financial Officer Matt Bilunas said the appliance category is \"probably the most difficult one that we have in the market today.\" He said historically, the company has sold new premium appliances and sets of appliances. With the slower housing market, he said the company is seeing more shoppers replace a product that's broken rather than buy a washer and dryer pair, and promotions haven't been as effective. To speed up sales, Best Buy plans to increase its labor in the department, speed up deliveries to better compete with rivals and even make some items available same day, he said.\"And hopefully as housing and different things change, then the market starts to swing back to something that might be a little bit more normal,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best Buy hikes sales forecast as shoppers upgrade tech, splurge on devices",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108230986-1763999639653-gettyimages-2247701450-BEST_BUY_EARNS.jpeg?v=1763999683&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T18:21:15.000Z",
      "dateModified": "2025-11-25T18:21:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump pardons Thanksgiving turkeys, blasts Biden and says Ukraine peace deal is ‘very close’",
    "url": "https://www.cnbc.com/2025/11/25/trump-turkey-pardon-biden-ukraine-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231861-17640921532025-11-25t173253z_89963273_rc2s3iaukfyf_rtrmadp_0_usa-thanksgiving-trump.jpeg?v=1764092166&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T18:43:41.000Z",
    "description": "U.S. President Donald Trump looks at Gobble one of two turkeys to ceremonially pardoned for Thanksgiving in the Rose Garden at the White House in Wash",
    "body": "U.S. President Donald Trump looks at Gobble one of two turkeys to ceremonially pardoned for Thanksgiving in the Rose Garden at the White House in Washington, D.C., U.S., November 25, 2025. Jonathan Ernst | ReutersPresident Donald Trump extended his pardon power to both Thanksgiving turkeys — Gobble and Waddle — during a ceremony at the White House on Tuesday, extending the holiday tradition.During the Rose Garden ceremony, Trump also touched on recent developments for a possible U.S.-brokered peace deal in Ukraine.\"I think we're getting very close to a deal, we'll find out,\" Trump said. \"I thought that one would have been gone quicker … but I think we're making progress.\"Trump also bashed former President Joe Biden, claiming that Biden used an autopen to sign last year's turkey pardon and declared those pardons \"totally invalid.\" He said he had \"officially pardoned\" the birds, Peach and Blossom, adding that he \"saved them in the nick of time.\"First lady Melania Trump's office had encouraged Americans to text \"Gobble\" or \"Waddle\" to 45470 to decide which bird would receive the formal pardon. Earlier this year she also posted a poll on X to name the birds.Born in July and weighing 52 and 50 pounds respectively, Gobble and Waddle spent the past week acclimating to the noise, lights and crowds before checking into their ceremonial suite at the Willard InterContinental Hotel — a long-running perk of being a presidential turkey.The National Thanksgiving Turkeys from North Carolina, named Waddle and Gobble, wait in their room a day ahead of their Thanksgiving holiday pardoning at the White House, at the Willard InterContinental Hotel in Washington, D.C., U.S., November 24, 2025. Nathan Howard | ReutersWhite House Press Secretary Karoline Leavitt holds her son Nicholas as Waddle, one of the National Thanksgiving turkeys, visits the press briefing room of the White House, prior to the turkey pardoning ceremony with US President Donald Trump on November 25, 2025, in Washington, DC. Alex Wroblewski | Afp | Getty ImagesExperts previously told CNBC that retailers who ordered turkeys early locked in lower prices, while others relying on the spot market are facing steeper costs. Wells Fargo's agriculture team warned that where consumers shop could swing the price of the same sized bird by $20 or more.Major retailers have tried using holiday promotions to keep shoppers from pulling back. Walmart is advertising a dinner bundle for 10 people for under $56; Aldi has one for $40; Amazon is offering a $25 dinner promotion; and Target announced a $20 Thanksgiving deal for four.Despite elevated turkey prices, the broader Thanksgiving meal for 10 is less expensive for the third straight year, according to the AFBF. A \"classic\" 16-pound turkey dinner with sides averages $55.18 nationwide.The annual turkey presentation dates to the 1940s and became a formal presidential pardon in 1989 under George H. W. Bush. But presidents have been gifted turkeys since the 1870s, according to the White House Historical Association. Over time, the rite has evolved into soft marketing for America's multibillion dollar poultry industry.This year's moment of pageantry comes in a second term where Trump has leaned heavily on his actual pardon power, granting relief to more than 1,000 January 6 rioters and high-profile figures including former Illinois Gov. Rod Blagojevich, disgraced former representative George Santos and former New York City Mayor Rudy Giuliani. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump pardons Thanksgiving turkeys, blasts Biden and says Ukraine peace deal is ‘very close’",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231861-17640921532025-11-25t173253z_89963273_rc2s3iaukfyf_rtrmadp_0_usa-thanksgiving-trump.jpeg?v=1764092166&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T18:43:41.000Z",
      "dateModified": "2025-11-25T18:43:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bessent says there's a 'very good chance' Trump names new Fed chair before Christmas",
    "url": "https://www.cnbc.com/2025/11/25/bessent-says-theres-a-very-good-chance-trump-names-new-fed-chair-before-christmas.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108198735-17579397502025-09-15t071608z_559056879_rc27sgav0bpi_rtrmadp_0_usa-trump-tariffs-china.jpeg?v=1757939833&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T17:43:21.000Z",
    "description": "watch nowTreasury Secretary Scott Bessent said Tuesday he expects President Donald Trump to make a decision on the new Federal Reserve chair by the ho",
    "body": "watch nowTreasury Secretary Scott Bessent said Tuesday he expects President Donald Trump to make a decision on the new Federal Reserve chair by the holiday season.In a CNBC interview, Bessent, who has been heading the search for a successor to current Chair Jerome Powell, said he still has one interview to go and was not ready to speculate on who might get the job.\"I think there's a very good chance that the president will make an announcement before Christmas,\" he said. \"But it's his prerogative, whether it's before the Christmas holidays or in the new year. But I think things are moving along very well.\"Trump has been a fierce Fed critic and recently said he'd \"love\" to fire Powell and encouraged Bessent to \"work on\" the chair to get the central bank to lower its key interest rate. Referring to Bessent, Trump even joked that \"if you don't get it fixed fast, I'm gonna fire your ass.\"\"If you were in the room, he was joking,\" Bessent said. \"We've gotten to this point where monetary policy has gotten very complicated, and it's more than just cutting rates.\"Powell's term expires in May 2026, and before then he is expected to have his hands full with a suddenly divided Federal Open Market Committee that is split over the need for further cuts. Based on a recent statement from New York Fed President John Williams, markets largely expect the FOMC to approve a third consecutive cut at the December meeting.In the meantime, Bessent is continuing to interview chair candidates. The slate of finalists is believed to include National Economic Council Director Kevin Hassett, former Governor Kevin Warsh, BlackRock executive Rick Rieder, and current Fed Governors Christopher Waller and Michelle Bowman. Bloomberg News, citing sources familiar with matter, reported Tuesday that Hassett is the front-runner for the job. The White House downplayed speculation about Trump's preference.\"Until an announcement is made by President Trump, discussion about Fed nominations is speculation,\" White House spokesman Kush Desai told CNBC.com Bessent said he envisions a different role for the Fed from the dominating position it has had since the financial crisis over the economy and financial markets.\"I think we've got to kind of simplify things,\" he said. \"I think it's time for the Fed just to move back into the background, like, it used to do, calm things down and work for the American people.\"watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bessent says there's a 'very good chance' Trump names new Fed chair before Christmas",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108198735-17579397502025-09-15t071608z_559056879_rc27sgav0bpi_rtrmadp_0_usa-trump-tariffs-china.jpeg?v=1757939833&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T17:43:21.000Z",
      "dateModified": "2025-11-25T17:43:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sellers are taking their homes off the market at the fastest pace in nearly a decade",
    "url": "https://www.cnbc.com/2025/11/25/home-sellers-delisting-redfin.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108200319-1758141740155-gettyimages-2235983392-dji_20250917121755_0386_d_rzemy12u.jpeg?v=1758141958&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-25T17:03:37.000Z",
    "description": "watch nowWeak buyer demand, weakening home prices and overall uncertainty in the economy are combining to make home sellers change their minds and ste",
    "body": "watch nowWeak buyer demand, weakening home prices and overall uncertainty in the economy are combining to make home sellers change their minds and step out of the market. Close to 85,000 U.S. sellers took their homes off the market in September, up 28% from September 2024 and the highest level for that month in eight years, according to Redfin. Sellers are delisting because so many listings are going stale, sitting on the market longer and longer. Redfin reported that 70% of listings in September were on the market for 60 days or longer. Homeowners are seeing prices weaken significantly and would rather wait than accept a low offer. Prices in September were 1.3% higher year over year, down from a 1.4% rise in August, according to the S&P Cotality Case-Shiller U.S. National Home Price NSA Index. Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.\"The frequency of delistings is keeping inventory tighter than it looks on paper,\" said Asad Khan, a senior economist at Redfin. \"When tens of thousands of homeowners pull their homes off the market rather than accept a low offer, it effectively reduces the supply of homes that are actually available for buyers. That keeps sale prices elevated.\" Some sellers are lowering prices — even multiple times. The typical price cut is roughly $10,000, but multiple reductions are becoming more common as homes take longer to sell, according to Zillow. The typical listing saw $25,000 in cumulative price cuts in October, matching the largest discounts Zillow has ever recorded.The housing market is now heading into its slowest season. While 1 in 5 homes that are delisted are relisted, that may not happen for several months, as sellers will likely wait for the much busier spring season to try again. Home prices are still 50% higher than they were just five years ago, but some sellers who bought in the last few years are facing potential losses. Roughly 15% of the homes that were delisted in September were at risk of selling at a loss, the highest share in five years, according to Redfin.The supply of homes for sale is about 15% higher now than it was a year ago, according to Realtor.com, but that is likely to shrink in the coming weeks, both because of the season and because of weakening consumer sentiment among buyers and sellers alike. Pending sales in October, which are based on signed contracts, were up 1.9% month to month and basically flat from a year ago, according to the Realtors. The monthly bump may have been due to a small drop in mortgage rates, which then turned higher again in November. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sellers are taking their homes off the market at the fastest pace in nearly a decade",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108200319-1758141740155-gettyimages-2235983392-dji_20250917121755_0386_d_rzemy12u.jpeg?v=1758141958&w=1920&h=1080"
      ],
      "datePublished": "2025-11-25T17:03:37.000Z",
      "dateModified": "2025-11-25T17:03:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]