[
  {
    "title": "32-year-old woman and her husband built her mom a tiny home in their backyard for under $32,000—take a look inside",
    "url": "https://www.cnbc.com/2026/02/03/couple-built-mom-tiny-home-backyard-texas.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108259327-1769736666346-tiny_home_living_room.jpeg?v=1769736901&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T20:22:44.000Z",
    "description": "When Yeli Heidecker and her husband, Benjamin, both 32, decided they were going to downsize to a barndominium — a building designed to look like a bar",
    "body": "When Yeli Heidecker and her husband, Benjamin, both 32, decided they were going to downsize to a barndominium — a building designed to look like a barn, but with a traditional living space inside — they started looking for the perfect lot. In early 2024, the couple purchased a two-acre lot in west-central Texas for $45,000 and began construction on the barndominium. Around the same time, they convinced Yeli's mom, Liliana Villanueva, to move down and live in an RV on the property. Yeli says Villanueva was experiencing some health issues at the time. And because she is a stay-at-home mom and content creator, Yeli says it would be easy to be around to help her mom. Plus, the idea of having her kids' grandmother close by sounded amazing, she adds. The couple was able to build Yeli's mom a tiny home for under $32,000.Yeli HeideckerBut shortly after the couple moved into the barndominium in late 2025, they began considering a more permanent living arrangement for Villanueva, Yeli says.\"We were afraid she was gonna trip and fall and hurt herself or something. We had the bright idea to do a tiny barndo like ours, but we'll do it ourselves,\" Yeli tells CNBC Make It. Going the DIY routeBefore taking the DIY route, the Heideckers obtained quotes for a small barndominium measuring about 400 square feet. The quotes ranged from $63,000 to $93,000, so they decided the best option was to do it themselves and stick to a $30,000 budget.  On top of that, Yeli and Benjamin decided to surprise Villanueva by building the tiny home while she was in Mexico visiting family for six weeks. \"I'm not going to sugarcoat it, it was chaotic,\" Yeli says. \"It was definitely hard, but at the same time, it was so incredibly fulfilling and amazing to see all the work we did.\"The couple hired contractors to handle the shell, electrical work and concrete flooring for the barndominium. The rest of the work, including installing the kitchen, painting the house and putting up the walls and drywall, was done mostly by Benjamin, Yeli says, but she helped out when she wasn't taking care of their four young children.\"It was special because we built this for Abuela,\" Yeli says, using the word for grandmother in Spanish. \"It was emotional seeing it finished because of all the memories of my husband and I working on it. It feels like it bonded us on a deeper level.\"The bedroom is big enough to fit a queen-sized bed.Yeli HeideckerWhen Villanueva returned to Texas in November 2025, she moved into the tiny home even though it wasn't fully finished. \"It was the most beautiful surprise I could have found after getting back from my trip. I am very happy with it,\" Villanueva tells CNBC Make It. \"I laugh because the house is small, but I have absolutely everything I need. It's perfect. I love that I'm close to my daughter and my grandchildren. I feel protected and feel safe.\"\"As immigrants, when you come here, you're fighting the American Dream, and while she's never owned a home on paper, just seeing her have that for herself was very emotional,\" Yeli adds. Inside the tiny homeThe one-bedroom, one-bathroom tiny home fits a washer and dryer as well as a full-size oven, stove and refrigerator. The Heideckers created the layout of the home with Villanueva's specific needs in mind.The tiny home has a washer and dryer, and a full-size stove, oven and refrigerator.Yeli HeideckerAs of January, the only remaining task is tiling the bathroom, which Yeli says will happen soon. Here's a breakdown of the major expenses for the tiny home, according to documents reviewed by CNBC Make It. All expenses are rounded.Trim: $250Paint: $350Flooring: $600AC mini split: $750Cabinets: $1,300Plumbing: $1,500Drywall and lumber: $1,700Electricity: $1,775Appliances: $2,000Insulation: $2,100Miscellaneous: $6,500Barn shell: $12,500In total, the home cost $31,325, including a number of miscellaneous expenses, such as power tools, countertops, lighting and faucets.Because the tiny home is on the same property as the Heideckers', it doesn't have separate utility bills. Instead, the couple covers all monthly expenses, such as water, electricity and gas, while Villanueva pays about $100 a month for cable TV. Villanueva says she loves that the tiny home has everything she needs.Yeli HeideckerSince Villanueva moved in, Yeli says the only thing the couple regrets is not making the tiny home a little bigger, specifically in the bedroom. But for the mother and daughter, the best part is being able to live next to each other. \"It's nice to see my kids being able to have Grandma just there, especially after we lived away from family for a very long time,\" Yeli says. Although the tiny home isn't officially finished, Yeli and Villanueva say the barndominium and tiny home are their forever homes, respectively. \"I'm doing very well here and have no plans on ever leaving,\" Villanueva says. \"I have it very good here and get to enjoy it alongside my family.\"The couple built the tiny home to look like a mini version of their house.Yeli HeideckDespite how chaotic the process was for the couple to get the tiny house done in such a short amount of time, Yeli says she would do it all over again — and recommends it to others, too. \"It's definitely worth it if you have aging parents, but even if you don't have an aging parent, having a special unit for someone, or when you have family coming over, or something like that, it's nice,\" Yeli says.  Want to get ahead at work with AI? Sign up for CNBC's new online course, Beyond the Basics: How to Use AI to Supercharge Your Work. Learn advanced AI skills like building custom GPTs and using AI agents to boost your productivity today.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "32-year-old woman and her husband built her mom a tiny home in their backyard for under $32,000—take a look inside",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108259327-1769736666346-tiny_home_living_room.jpeg?v=1769736901&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T20:22:44.000Z",
      "dateModified": "2026-02-03T20:22:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "KKR and Singtel to acquire remaining stake in data center firm STT GDC for over $5 billion",
    "url": "https://www.cnbc.com/2026/02/04/kkr-and-singtel-stake-in-stt-gdc-for-over-5-billion.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106972887-16364810552021-11-09t173605z_1096561720_rc25rq9nxj42_rtrmadp_0_onestream-ipo.jpeg?v=1753331750&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T00:54:55.000Z",
    "description": "A KKR logo displayed on the floor of the New York Stock Exchange on Aug. 23, 2018.Brendan McDermid | ReutersPrivate equity firm KKR and Singapore Tele",
    "body": "A KKR logo displayed on the floor of the New York Stock Exchange on Aug. 23, 2018.Brendan McDermid | ReutersPrivate equity firm KKR and Singapore Telecommunications will acquire the remaining 82% stake in data center operator ST Telemedia Global Data Centres for 6.6 billion Singapore dollars ($5.1 billion), KKR said in a statement on Wednesday.The deal pegs STT GDC's enterprise value at S$13.8 billion and comes at a time when there has been a jump in data center demand led by the boom in artificial intelligence.Following completion, KKR will hold a 75% stake in STT GDC, while Singtel will own the remaining 25%, taking into account the conversion of existing preference shares held by both investors.KKR said the deal represents its largest infrastructure investment in Asia Pacific to date, as global investment in data centers accelerates on rising need for cloud computing and artificial intelligence workloads.Global data centers' dealmaking hit a fresh record last year, driven by a rush to build out the infrastructure required for energy-intensive AI workloads, with S&P Global reporting that over $61 billion had flowed into the data center market, up from $60.8 billion last year.\"Digital infrastructure remains one of the most compelling long-term investment themes globally,\" said David Luboff, co-head of KKR Asia Pacific and head of Asia Pacific infrastructure, citing STT GDC's diversified footprint and development pipeline.Founded in 2014 and headquartered in Singapore, STT GDC operates data centers across 12 markets in Asia Pacific, the United Kingdom and Europe, with 2.3 gigawatts of design capacity. The company provides colocation, connectivity and support services to hyperscalers and enterprise customers.\"STT GDC's diverse geographical footprint increases our exposure to new markets and makes the Singtel Group a stronger data centre player with global reach,\" said Arthur Lang, group chief financial officer at Singtel.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "KKR and Singtel to acquire remaining stake in data center firm STT GDC for over $5 billion",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106972887-16364810552021-11-09t173605z_1096561720_rc25rq9nxj42_rtrmadp_0_onestream-ipo.jpeg?v=1753331750&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T00:54:55.000Z",
      "dateModified": "2026-02-04T00:54:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lennar shares jump on report it’s working on a ‘Trump Homes’ plan",
    "url": "https://www.cnbc.com/2026/02/03/lennar-shares-jump-on-report-its-working-on-a-trump-homes-plan.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107419247-1716474869682-gettyimages-2120209340-64393_48_ms_2421.jpeg?v=1770138752&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T17:20:11.000Z",
    "description": "Homes in Lexington Waters in Blaine, Minnesota.Michael Siluk | Getty ImagesShares of homebuilders Lennar and Taylor Morrison Home rose on Tuesday foll",
    "body": "Homes in Lexington Waters in Blaine, Minnesota.Michael Siluk | Getty ImagesShares of homebuilders Lennar and Taylor Morrison Home rose on Tuesday following a Bloomberg News report that the two companies were among a cohort working on a proposed \"Trump Homes\" plan aimed at easing the U.S. housing affordability crunch.The two stocks both jumped 4% on Tuesday.Stock Chart IconStock chart iconLEN, TMHC 5D chartBuilders including Lennar and Taylor Morrison Home have discussed a large-scale program that would sell entry-level homes into a pathway-to-ownership program funded by private investors, Bloomberg wrote, citing people familiar with the plan. One version of the plan sees investors renting the homes out to tenants, with a portion of monthly payments counting toward a future down payment should they choose to buy after three years.Amid elevated interest rates and prices, housing affordability has emerged as a key issue for President Donald Trump. Earlier this month, Trump said that the U.S. should ban large institutional investors from buying single-family homes, arguing that corporate ownership has only exacerbated the housing affordability crisis. The president has also repeatedly said he wants to help first-time buyers, but without triggering a broad decline in existing home prices.\"I don't want to drive housing prices down. I want to drive housing prices up for people who own homes,\" he said at the World Economic Forum in Davos, Switzerland.The proposal, dubbed \"Trump Homes\" by industry players, could ultimately involve as many as one million homes, Bloomberg reported. A White House official told the outlet that the administration is not actively considering the plan.After a rough year last year, Lennar shares are off to a good start for 2026, up 9%.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lennar shares jump on report it’s working on a ‘Trump Homes’ plan",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107419247-1716474869682-gettyimages-2120209340-64393_48_ms_2421.jpeg?v=1770138752&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T17:20:11.000Z",
      "dateModified": "2026-02-03T17:20:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chipotle stock sinks as restaurant chain reports falling traffic, weak guidance",
    "url": "https://www.cnbc.com/2026/02/03/chipotle-cmg-q4-2025-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108135737-1745443795624-gettyimages-2211664111-anotherday22623916_qcsliau4.jpeg?v=1770156871&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T22:54:05.000Z",
    "description": "A Chipotle in the Bronx in New York, April 23, 2025.Spencer Platt | Getty ImagesChipotle Mexican Grill on Tuesday reported quarterly earnings and reve",
    "body": "A Chipotle in the Bronx in New York, April 23, 2025.Spencer Platt | Getty ImagesChipotle Mexican Grill on Tuesday reported quarterly earnings and revenue that topped analysts' expectations, although traffic to its restaurants fell for the fourth straight quarter.For 2026, the company is projecting flat same-store sales growth, signaling that the burrito chain's woes are not expected to disappear quickly. Chipotle ended a bumpy 2025 with a full-year same-store sales decline of 1.7%, marking the first annual decline since 2016.However, executives said the outlook is \"conservative,\" citing unpredictable consumer trends. Last year, the company cut its full-year forecast for same-store sales three times as dining habits shifted from quarter to quarter.Shares of the company fell as much as 11% in extended trading.Here's what the company reported compared with what Wall Street was expecting, based on a survey of analysts by LSEG:Earnings per share: 25 cents adjusted vs. 24 cents expectedRevenue: $2.98 billion vs. $2.96 billion expectedThe fast-casual chain reported fourth-quarter net income of $330.9 million, or 25 cents per share, down from $331.8 million, or 24 cents per share, a year earlier.Excluding impairment costs, gains from terminating restaurant leases and other items, Chipotle earned 25 cents per share.Net sales rose 4.9% to $2.98 billion.The company's same-store sales fell 2.5% for the quarter, making this reporting period the third quarter of the year with same-store sales declines. However, Wall Street was anticipating a steeper same-store sales decrease of 3%, according to StreetAccount estimates.Traffic to Chipotle restaurants fell by 3.2%. Executives have previously said they have seen a pullback in spending from consumers of all income cohorts, although low-income diners have made the most significant shift to their behavior.Over the past year, shares of Chipotle have lost roughly a third of their value, dragging the company's market value down to about $51 billion, as of Tuesday's close. Investor enthusiasm for the stock waned after the fast-casual chain began reporting shrinking traffic to its restaurants.To bring back customers, Chipotle is focusing on improving the chain's operations and adding new menu items, rather than leaning into discounts. In December, at the tail end of the quarter, the company unveiled \"protein cups,\" with the goal of convincing protein-obsessed customers to stop by for a snack, not just lunch or dinner.\"I think having a taco at $3.50 and a protein cup around $3.80 across the country is really an approachable price point that really gives the consumer a meaningful way into the brand, but also solves for those people that are looking for a different choice, whether they're GLP-1 users or looking for other dietary restrictions, more high protein or high fiber,\" CEO Scott Boatwright said on a conference call with analysts.Chipotle is trying to raise menu prices at a slower pace than inflation in the hopes of attracting price-conscious consumers. However, the company also has a strong base of high-income customers.\"After looking at the data last week, we learned that 60% of our core users are over $100,000 a year in income and average household income,\" Boatwright said, adding that the chain plans to target those customers more this year.Chipotle opened 132 company-owned locations and seven restaurants run by international licensees during the quarter. That brought its total to 334 company-owned locations and 11 international partner restaurants opened for the year. In 2026, the company is projecting that it will open 350 to 370 new restaurants, including 10 to 15 international locations that will be run by licensees.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chipotle stock sinks as restaurant chain reports falling traffic, weak guidance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108135737-1745443795624-gettyimages-2211664111-anotherday22623916_qcsliau4.jpeg?v=1770156871&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T22:54:05.000Z",
      "dateModified": "2026-02-03T22:54:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bitcoin briefly breaks below $73,000 to lowest since November 2024 as heavy selling resumes ",
    "url": "https://www.cnbc.com/2026/02/03/bitcoin-price-today.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235234-1764690993224-gettyimages-2247341381-AFP_84UC93G.jpeg?v=1770145577&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T22:26:44.000Z",
    "description": "Justin Tallis | Afp | Getty ImagesBitcoin briefly dived below the $73,000 mark on Tuesday, hitting its lowest price in nearly 16 months.   The world's",
    "body": "Justin Tallis | Afp | Getty ImagesBitcoin briefly dived below the $73,000 mark on Tuesday, hitting its lowest price in nearly 16 months.   The world's oldest cryptocurrency sank as low as $72,884.38, falling more than 6% on the day. That's its lowest level since Nov. 6, 2024, when the token traded at $68,898. Bitcoin was last down more than 3% at $75,658.95 around 5:25 p.m. ET.Strategy, a bitcoin treasury firm, ended the trading session down more than 4%. Stock Chart IconStock chart iconBitcoin performance over the past year.Bitcoin has fallen 16% year to date as investors have continued to rotate out of risk-on assets amid growing geopolitical concerns. Those losses mounted this week as the release of crucial U.S. economic data was delayed due to a partial government shutdown.  Adding to the investors' jitters is ongoing uncertainty around lawmakers' efforts to create legislative guardrails for the cryptocurrency industry, in addition to liquidation overhang in the digital assets market, Rob Hadick, general partner at Dragonfly Capital told CNBC. \"BTC's pullback doesn't appear driven by any single factor,\" Hadick said. \"Crypto and bitcoin prices have always been volatile and this market is no different.\"He noted that fundamentals for the crypto market remain strong, particularly as stablecoins and tokenized assets continue to gain traction with retail and institutional investors. \"We expect the medium and long-term outlook to remain constructive as markets continue to restructure themselves,\" Hadick added. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bitcoin briefly breaks below $73,000 to lowest since November 2024 as heavy selling resumes ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235234-1764690993224-gettyimages-2247341381-AFP_84UC93G.jpeg?v=1770145577&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T22:26:44.000Z",
      "dateModified": "2026-02-03T22:26:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. could issue general license for oil companies to produce in Venezuela this week, source says",
    "url": "https://www.cnbc.com/2026/02/03/us-could-issue-general-license-for-oil-companies-to-produce-in-venezuela.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108260416-17700685722026-02-02t213906z_10101598_rc2dica2pzoo_rtrmadp_0_usa-venezuela-oil-maracaibo.jpeg?v=1770154504&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T21:44:21.000Z",
    "description": "Workers of Venezuelan state oil company PDVSA operating pumpjack in Lake Maracaibo, in Cabimas, Venezuela, Jan. 27, 2026.Leonardo Fernandez Viloria | ",
    "body": "Workers of Venezuelan state oil company PDVSA operating pumpjack in Lake Maracaibo, in Cabimas, Venezuela, Jan. 27, 2026.Leonardo Fernandez Viloria | ReutersThe Trump administration could issue a general license as soon as this week for companies to produce oil and gas in Venezuela, a person familiar with the plan told CNBC on Tuesday.Chevron is the only U.S. company currently allowed to pump oil in Venezuela under a special license issued by the Treasury Department. Chevron has several joint ventures with state oil company Petróleos de Venezuela, or PDVSA.President Donald Trump is pressuring the oil industry to invest at least $100 billion to repair Venezuela's energy industry after the U.S. captured former President Nicolás Maduro in a raid on Jan. 3. \"The President's team is working around the clock to ensure oil companies are able to make investments in Venezuela's oil infrastructure. Stay tuned,\" White House spokeswoman Taylor Rogers said in a statement. Bloomberg first reported the news. Last week, the Treasury Department issued a general license that allowed U.S. companies to buy, sell, transport and refine Venezuelan crude oil, among other activities. But that license did not include upstream production. Companies were previously barred from these activities under U.S. sanctions. The Venezuelan government last week also passed reforms to ease state control of its oil industry and give more autonomy to private companies. The oil industry's response to investing in Venezuela has been mixed. ExxonMobil CEO Darren Woods told Trump at the White House on Jan. 9 that the country needs big reforms and is \"uninvestable\" under its current system. Exxon has had its assets seized twice by the government in Caracas. Private wildcatters and smaller shale oil companies have shown more enthusiasm about the potential opportunity in the South American nation. Chevron CEO Mike Wirth told CNBC last week that it can ramp up production in Venezuela by 50% in the next 18 to 24 months with approvals from the U.S. It currently produces about 250,000 barrels per day in the South American nation. Venezuela is a founding member of OPEC and is believed to have the largest crude oil reserves in the world. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. could issue general license for oil companies to produce in Venezuela this week, source says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108260416-17700685722026-02-02t213906z_10101598_rc2dica2pzoo_rtrmadp_0_usa-venezuela-oil-maracaibo.jpeg?v=1770154504&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T21:44:21.000Z",
      "dateModified": "2026-02-03T21:44:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. military says it shot down Iranian drone that 'aggressively approached' aircraft carrier",
    "url": "https://www.cnbc.com/2026/02/03/us-military-shoots-down-iranian-drone-that-aggressively-approached-aircraft-carrier.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108260881-1770142946581-gettyimages-2190165104-20241220_usslincoln_102.jpeg?v=1770153123&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T21:15:07.000Z",
    "description": "Sailors and Marines man the rail as the U.S. Navy Nimitz-class aircraft carrier USS Abraham Lincoln (CVN 72) is guided by tugboats in San Diego Bay as",
    "body": "Sailors and Marines man the rail as the U.S. Navy Nimitz-class aircraft carrier USS Abraham Lincoln (CVN 72) is guided by tugboats in San Diego Bay as it returns to its home port of Naval Air Station North Island in San Diego, California, Dec. 20, 2024.Kevin Carter | Getty ImagesThe U.S. military on Tuesday shot down an Iranian drone that flew toward the USS Abraham Lincoln in the Arabian Sea, according to U.S. Central Command.The incident occurred as tensions in the Middle East are high, with President Donald Trump weighing potential military strikes against the Islamic Republic.   The Shahed-139 drone \"aggressively approached\" the aircraft carrier with \"unclear intent,\" U.S. Central Command spokesman Capt. Tim Hawkins told CNBC in a statement.The Abraham Lincoln was about 500 miles from Iran's southern coast when the unmanned aircraft \"unnecessarily maneuvered\" toward the ship, Hawkins said. U.S. forces were operating in international waters and took de-escalatory measures, but the drone continued to fly toward the aircraft carrier, he said. An F-35 warplane from the Abraham Lincoln shot down the drone \"in self defense to protect the aircraft carrier and personnel on board,\" Hawkins said. No U.S. personnel were harmed and no U.S. equipment was damaged, he said. U.S. crude oil prices were up more than 1% at 2:32 p.m. ET. Hours after the drone was shot down, Iranian forces harassed a U.S. flagged and crewed merchant vessel that was lawfully transiting the Strait of Hormuz, Hawkins said. The Islamic Revolutionary Guard Corps forces threatened to board and seize the M/V Stena Imperative, he said.A U.S. guided missile destroyer intervened and de-escalated the situation and the merchant vessel is now proceeding safely, Hawkins said.Trump has deployed the Abraham Lincoln to the Middle East as he threatens Iran with strikes if it does not negotiate a deal over its nuclear program. The president threatened to hit the Islamic Republic during mass demonstrations against the regime last month but ultimately held back from strikes. The incidents Tuesday come as Trump's special envoy Steve Witkoff is scheduled to have discussions with Iranian officials later this week. Those conversations are still scheduled to take place, White House press secretary Karoline Leavitt told Fox News in an interview. \"As for the president, he remains committed to always pursuing diplomacy first,\" Leavitt said. \"But in order for diplomacy to work of course it takes two to tango. You need a willing partner to engage.\" Leavitt said Trump \"always has a range of options on the table and that includes the use of military force.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. military says it shot down Iranian drone that 'aggressively approached' aircraft carrier",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108260881-1770142946581-gettyimages-2190165104-20241220_usslincoln_102.jpeg?v=1770153123&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T21:15:07.000Z",
      "dateModified": "2026-02-03T21:15:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Novo Nordisk shares tumble after company warns of sales hit this year",
    "url": "https://www.cnbc.com/2026/02/03/novo-nordisk-2025-earnings-wegovy-ozempic.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108247614-1767376953845-gettyimages-2253792477-US_STOCKS.jpeg?v=1767377112&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T18:10:26.000Z",
    "description": "Novo Nordisk signage on the floor of the New York Stock Exchange in New York, US, on Friday, Jan. 2, 2026.Michael Nagle | Bloomberg | Getty ImagesNovo",
    "body": "Novo Nordisk signage on the floor of the New York Stock Exchange in New York, US, on Friday, Jan. 2, 2026.Michael Nagle | Bloomberg | Getty ImagesNovo Nordisk's U.S. shares plummeted Tuesday after the company said it sees sales and profit growth declining this year, hit by lower prices in the U.S. and loss of exclusivity for its blockbuster Wegovy and Ozempic in China, Brazil and Canada. Novo's American depositary shares fell as much as 14% in afternoon trading, after a trading halt. The results were published after the closing bell in Copenhagen, where the company has its primary listing, and ahead of the scheduled release early Wednesday.For 2026, the drugmaker sees sales and operating profit both declining between 5% and 13% at constant exchange rates, far worse than analysts had expected.It comes as the Danish drugmaker is fighting to regain its footing in the weight-loss space amid fierce competition.\"In 2026, Novo Nordisk will face pricing headwinds in an increasingly competitive market,\" CEO Mike Doustdar. \"However, we are very encouraged by the promising early uptake from the US launch of Wegovy pill, and we remain confident in our ability to drive volume growth over the coming years.\"The outlook reflects expectations for a sales decline in the U.S., its biggest market, but sales growth ex-U.S. Novo said. \"In 2026, the global GLP-1 market expansion is assumed to continue, enabling Novo Nordisk to increase patient reach and expand volumes,\" the company said in a statement.In 2025, sales increased by 10% and operating profit increased by 6%, in line with the company's latest guidance, which it lowered throughout 2025, citing challenges in the U.S. market.Novo also said that it will roll out Wegovy in more markets in 2026 and expects to introduce the higher 7.2 mg dose in a number of countries.Mounting pressureStock Chart IconStock chart iconNovo Nordisk stock has seen steep declines over the past year.Novo launched the oral version of the blockbuster weight-loss medicine Wegovy in the U.S. early January, and, despite its promising start, the market is closely watching how Novo Nordisk will fare along with U.S. rival Eli Lilly, which is expected to launch its own weight loss pill in the first half of 2026.\"Investors want to see they are making the most of this lead, particularly in the direct to patient (mostly self-pay or cash pay) channel, closing some of the large gap that widened between them and Lilly in this channel in 2025,\" said Morningstar analyst Karen Andersen.Semaglutide, the active ingredient in Wegovy and Ozempic, is losing exclusivity in markets like Canada, Brazil and China in 2026. Together with significant pricing pressure in its largest market, the U.S., analysts had forecast sales growth to moderate this year to single digits after several years of much higher growth.Coming into the print, Barclays analyst James Gordon said the Novo guide was expected to crystalize further downgrades, however could also act as a clearing event given the \"significant investor concern\" about this year's outlook.\"[Guidance] cuts could be at least partly mitigated by investors taking the opportunity to then buy into the Oral Wegovy US launch and Injectable Wegovy potential US volume inflection this year.\"Novo has faced pressure for the past 18 months as rival U.S.-based Eli Lilly's rival weight-loss drug tirzepatide – sold as Mounjaro and Zepbound – resulted in more pronounced weight loss than Novo's medicine, and surpassed Novo in U.S. market share.Ozempic and Wegovy salesNovo and Lilly in November announced a deal with the Trump administration to cut prices for their best-selling drugs, which are expected to increase volumes but ultimately hurt total sales. The agreements involved cutting prices of their GLP-1 drugs for Medicare and Medicaid in 2026 as well as offering them directly to consumers at a discount through the forthcoming TrumpRx.gov website, expected to launch in January.In the fourth quarter, Novo net sales amounted to 79.1 billion Danish kroner ($12.5 billion), slightly ahead of analysts' expectations of 77.8 billion kroner, according to LSEG estimates. Operating profit in the quarter was largely in line with estimates at 31.7 billlion kroner, down 14% year-on-year.Ozempic, its best-selling medicine, brought in 31.8 billion in the quarter, up 1% from the same period last year at constant exchange rates. Wegovy sales were 21.9 billion kroner, up 17%.- CNBC's Annika Kim Constantino contributed to this report",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Novo Nordisk shares tumble after company warns of sales hit this year",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108247614-1767376953845-gettyimages-2253792477-US_STOCKS.jpeg?v=1767377112&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T18:10:26.000Z",
      "dateModified": "2026-02-03T18:10:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump: If states can't run elections 'honestly,' then 'somebody else should take over'",
    "url": "https://www.cnbc.com/2026/02/03/trump-election-government-states.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261016-17701553992026-02-03t214511z_1091522287_rc2leja2ijel_rtrmadp_0_usa-trump.jpeg?v=1770162118&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T23:52:00.000Z",
    "description": "President Donald Trump sits at his desk, behind a hat that reads \"America is back\" at the White House in Washington, Feb. 3, 2026.Evelyn Hockstein | R",
    "body": "President Donald Trump sits at his desk, behind a hat that reads \"America is back\" at the White House in Washington, Feb. 3, 2026.Evelyn Hockstein | ReutersPresident Donald Trump on Tuesday said \"the federal government should get involved\" in elections in states that are unable to \"legally and honestly\" administer them on their own.If they can't, then \"somebody else should take over,\" Trump said in the Oval Office after he signed a bill to fund the federal government.The comments show Trump is not backing off his recent suggestion that Republicans should \"nationalize\" elections, even as Democrats raise concerns that the administration may try to interfere in the upcoming midterms.\"If a state can't run an election, I think the people behind me should do something about it,\" Trump said in the Oval Office, referring to the handful of Republican lawmakers standing around him.He had been asked what he meant when, in a podcast interview released Monday, he called on members of the Republican Party to \"take over the voting.\"\"The Republicans should say, 'We want to take over. We should take over the voting, the voting in at least many — 15 places ... the Republicans ought to nationalize the voting,'\" Trump said in that interview with former deputy FBI director Dan Bongino.Read more CNBC politics coverageTrump: If states can't run elections 'honestly,' then 'somebody else should take over'Trump signs bill ending federal government shutdownSen. Warner calls Gabbard to testify over GA election raid, Trump callTrump: Powell probe over Fed HQ renovation should continueTrump pardon attorney Ed Martin reportedly sidelined from investigationsHow global dark fleet of tankers is navigating high seas hunt for sanctioned oilHouse hardliners complicate ending government shutdown as Speaker Johnson moves aheadTrump says U.S. and India reached trade deal, will lower tariffs immediatelyTrump spoke at the White House hours after the House narrowly approved a measure to end the partial government shutdown. That vote was close because hard-line Republicans wanted to compel the Senate to consider the SAVE Act, which would institute voter ID requirements across the country. Trump has urged congressional Republicans to pass that bill.States are primarily responsible for governing their own election systems under the U.S. Constitution. When asked about that fact on Tuesday, Trump replied, \"They can administer the election, but they have to do it honestly.\"He also said, \"If you think about it, a state is an agent for the federal government in elections. I don't know why the federal government doesn't do them anyway. But when you see some of these states about, how horribly they run their elections, what a disgrace it is.\"Trump echoed his frequent claim that elections in the 2020 cycle — when he lost his reelection bid to former President Joe Biden — were \"rigged\" and \"crooked.\" There is no evidence of widespread fraud in the 2020 elections.\"Take a look at Detroit,\" he said. \"Take a look at Philadelphia. You go take a look at Atlanta.\"\"Look at some of the places that — horrible corruption on elections, and the federal government should not allow that. The federal government should get involved,\" Trump said.\"These are agents of the federal government to count the votes. If they can't count the votes legally and honestly, then somebody else should take over.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump: If states can't run elections 'honestly,' then 'somebody else should take over'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261016-17701553992026-02-03t214511z_1091522287_rc2leja2ijel_rtrmadp_0_usa-trump.jpeg?v=1770162118&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T23:52:00.000Z",
      "dateModified": "2026-02-03T23:52:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia's Jensen Huang denies OpenAI deal rumors: 'There's no drama'",
    "url": "https://www.cnbc.com/2026/02/03/nvidias-jensen-huang-denies-openai-deal-rumors-theres-no-drama.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256213-1769171467655-108256213-17691714072026-01-21t110421z_923549888_rc2m5jaurrtk_rtrmadp_0_davos-meeting.jpg?v=1770154317&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T21:48:46.000Z",
    "description": "Jensen Huang, president and CEO of Nvidia, attends the 56th annual World Economic Forum meeting in Davos, Switzerland, Jan. 21, 2026.Denis Balibouse |",
    "body": "Jensen Huang, president and CEO of Nvidia, attends the 56th annual World Economic Forum meeting in Davos, Switzerland, Jan. 21, 2026.Denis Balibouse | ReutersNvidia CEO Jensen Huang said the chipmaker's plan to invest in OpenAI remains \"on track\" after recent reports suggested brewing tension between the two sides. \"There's no drama involved. Everything's on track,\" Huang told CNBC's Jim Cramer on Tuesday. The full interview will air later in the day on \"Mad Money.\"In September, Huang appeared with OpenAI CEO Sam Altman to announce a letter of intent that would involve his company investing up to $100 billion in the artificial intelligence lab in tranches. OpenAI would build AI infrastructure based around Nvidia's technology requiring up to 10 gigawatts of power. But an SEC filing in November said the deal had not been finalized, and concern has mounted in the months since that the announcement was little more than a press release. Over the past weekend, The Wall Street Journal reported that the deal was \"on ice.\"Nvidia shares fell more than 3.4% today, leading a broad decline in tech stocks, and are 13% off their high reached in October. Huang said Tuesday that Nvidia would invest in OpenAI's next fundraising round, which he called the \"largest private round ever raised in history.\" OpenAI is engaging in fundraising discussions for a round that could raise as much as $100 billion, CNBC reported last month. \"We will invest in the next round,\" Huang said. \"There is no question about that.\"  He said Nvidia would consider investing in any future OpenAI round and wants to participate in an eventual OpenAI IPO. OpenAI has used Nvidia's graphics processing units to build and serve its AI models since the company was founded. But in recent months, Altman has said that OpenAI doesn't have enough chips to meet demand for its products such as ChatGPT, and that it could generate more revenue with increased computing power. OpenAI has been striking chip deals with Nvidia competitors including Advanced Micro Devices, Broadcom, and Cerebras. In a post on X on Monday, Altman responded to the chatter about his company's relationship with Nvidia.\"We love working with NVIDIA and they make the best AI chips in the world,\" he wrote. \"We hope to be a gigantic customer for a very long time. I don't get where all this insanity is coming from.\"WATCH: Nvidia and OpenAI respond to reports about their relationshipwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia's Jensen Huang denies OpenAI deal rumors: 'There's no drama'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256213-1769171467655-108256213-17691714072026-01-21t110421z_923549888_rc2m5jaurrtk_rtrmadp_0_davos-meeting.jpg?v=1770154317&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T21:48:46.000Z",
      "dateModified": "2026-02-03T21:48:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple adds agents from Anthropic and OpenAI to its coding tool ",
    "url": "https://www.cnbc.com/2026/02/03/apple-adds-agentic-coding-from-anthropic-and-openai-to-xcode.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108156731-1749494285081-gettyimages-2218819408-APPLE_WWDC.jpeg?v=1770148506&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T22:52:47.000Z",
    "description": "Tim Cook, CEO of Apple Inc., during the Apple Worldwide Developers Conference at Apple Park campus in Cupertino, California, on June 9, 2025.David Pau",
    "body": "Tim Cook, CEO of Apple Inc., during the Apple Worldwide Developers Conference at Apple Park campus in Cupertino, California, on June 9, 2025.David Paul Morris | Bloomberg | Getty ImagesApple said it's introducing agentic coding into its flagship coding tool called Xcode, throwing its weight behind one of the hottest trends in Silicon Valley. With agent-powered coding, programmers have artificial intelligence software write code independently. Apple said its tool will support Anthropic's Claude Agent and OpenAI's Codex.\"Xcode and coding agents can now work together to handle complex multi-step tasks on your behalf,\" an Apple representative said in a demo video on Tuesday, alongside the announcement. Over the summer, Apple updated Xcode with support for OpenAI's ChatGPT and Claude, but the latest update extends the relationship to agentic coding tools. In an email sent to developers, Apple said the agents will be able to build and test projects, search Apple documentation and fix issues.Individual programmers and companies have embraced agentic coding as a faster way to build software through a practice known as \"vibe coding,\" where humans prompt an AI and review the code it generates. Apple Intelligence, the company's consumer AI suite, has faced delays and management turnover. But in recent months, AI coding has gained traction among iPhone developers. Users will have to connect their OpenAI or Anthropic accounts to Xcode via an API key. Apple said it uses an open standard that gives programmers the ability to use other compatible agents and AI tools with Xcode, in addition to the built-in Anthropic and OpenAI integrations. Apple's Xcode is the company's developer environment for coders, and it is used to build nearly every iPhone app. The new software, Xcode 26.3, is available in a beta version now for registered Apple developers, and will eventually be released on the App Store. OpenAI released a version of its agentic coding application called Codex for Mac computers on Monday.WATCH: Experimenting with AI vibe-codingwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple adds agents from Anthropic and OpenAI to its coding tool ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108156731-1749494285081-gettyimages-2218819408-APPLE_WWDC.jpeg?v=1770148506&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T22:52:47.000Z",
      "dateModified": "2026-02-03T22:52:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft promotes sales leaders as company pursues AI growth",
    "url": "https://www.cnbc.com/2026/02/03/microsoft-promotes-sales-leaders-as-company-pursues-ai-growth.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108260991-1770153509459-gettyimages-633008456-MICROSOFT_ALTHOFF.jpeg?v=1770153596&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-04T00:00:40.000Z",
    "description": "Judson Althoff, CEO of Microsoft's commercial business, appears during an interview in San Francisco on Jan. 27, 2017.David Paul Morris | Bloomberg | ",
    "body": "Judson Althoff, CEO of Microsoft's commercial business, appears during an interview in San Francisco on Jan. 27, 2017.David Paul Morris | Bloomberg | Getty ImagesMicrosoft on Tuesday told employees it was promoting four sales executives, months after the software company made sales leader Judson Althoff CEO of its commercial business. Investors have been wondering how much Microsoft and other longstanding software companies can grow as corporate workers build new applications using generative artificial intelligence models. Microsoft shares have slipped 15% so far this year, trailing all other Magnificent Seven technology stocks. Last week Microsoft issued Azure cloud growth that came in below some projections. Executives said they want to allocate more computing resources to research and development teams and to its AI products such as the Microsoft 365 Copilot productivity software add-on and the GitHub Copilot coding assistant, while still meeting Azure client demand.\"Judson expanded the remits of his leadership team to free up more time to focus on Microsoft's commercial product strategy and to keep the feedback loop between customers and product decisions as small as possible,\" a Microsoft spokesperson told CNBC in an email. \"This feedback loop is critical right now because AI is being adopted at extraordinary speed, and our customers expect these capabilities to come to life in their business faster than ever before.\"Deb Cupp, chief revenue officer leading Microsoft's global enterprise sales business, is the company's latest executive vice president, Althoff said in an memo. In recent years, Cupp went from president of Microsoft's U.S. business to president for North America and then to president of the Americas.Nick Parker, chief business officer of worldwide sales and solutions, is becoming an executive vice president as well. He's been at the company since 2000.Ralph Haupter becomes executive vice president and chief revenue officer for small and medium enterprises and channel. Haupter came to Microsoft from IBM in 2005, and he spent four years as CEO and chairman of the Windows and Office company's greater China business.Mala Anand, a former SAP executive who joined Microsoft in 2019, will be executive vice president and chief customer experience officer. The four will continue to report to Althoff, the spokesperson said.Satya Nadella, who was executive vice president before stepping up as Microsoft's CEO since 2014, has concentrated on innovation with Althoff taking on more responsibility. At a software developer event in India in December, he showed off an app he built to research topics using a slew of generative AI models.\"I started my career in a command line, Nadella said on a podcast recorded at the Davos conference in Switzerland in January. \"Who knows? I may just end it in a command line.\"WATCH: Investors are missing the big picture with Microsoft, says Alliance Bernstein's Jim Tierneywatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft promotes sales leaders as company pursues AI growth",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108260991-1770153509459-gettyimages-633008456-MICROSOFT_ALTHOFF.jpeg?v=1770153596&w=1920&h=1080"
      ],
      "datePublished": "2026-02-04T00:00:40.000Z",
      "dateModified": "2026-02-04T00:00:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AMD shares drop as forecast comes up short of some expectations",
    "url": "https://www.cnbc.com/2026/02/03/amd-earnings-report-q4-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108208259-1759767774187-gettyimages-2239199521-AMD_OPENAI.jpeg?v=1770155656&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T23:35:34.000Z",
    "description": "Lisa Su, chair and chief executive officer of Advanced Micro Devices Inc., during a Bloomberg Television interview in San Francisco, Oct. 6, 2025.Davi",
    "body": "Lisa Su, chair and chief executive officer of Advanced Micro Devices Inc., during a Bloomberg Television interview in San Francisco, Oct. 6, 2025.David Paul Morris | Bloomberg | Getty ImagesAdvanced Micro Devices reported fourth-quarter earnings that topped expectations, but the company's first-quarter forecast fell short of what some analysts were expecting amid an AI spending boom. The stock fell Tuesday as much as 8% in extended trading. Here's how the chipmaker did versus LSEG consensus estimates for the quarter ended in December:EPS: $1.53 vs. $1.32 expectedRevenue: $10.27 billion vs. $9.67 billion expectedFor the first quarter, AMD said it expects $9.8 billion in revenue, plus or minus $300 million, versus expectations of $9.38 billion. Some analysts, however, were expecting AMD to provide stronger guidance as customers continue to ramp up spending for the chips necessary to power AI models. Net income climbed to $1.51 billion, or 92 cents per share, versus $482 million, or 29 cents per share, in the year-ago period. AMD's overall revenue was up 34% on an annual basis. AMD is one of two makers of big graphics processors for artificial intelligence, although it has only a small portion of the market, which is currently dominated by Nvidia. Shares have more than doubled over the past year. The chipmaker has recently announced some big customers, including ChatGPT maker OpenAI and Oracle. AMD plans to ship a new integrated server-scale AI system called Helios later this year. AMD CEO Lisa Su said on an earnings call that the company was in \"active discussions\" for additional Helios or MI450 chip sales. \"The ramp is on schedule to start in the second half of the year, and MI450 is doing great,\" Su said. Those sales are reported in the company's data center segment, which had $5.4 billion in sales in the quarter, up 39% on an annual basis. The company said growth was driven by both the company's central processors and its AI GPUs.Su said on the earnings call that the artificial intelligence boom is boosting sales of the company's central processors, not just its GPUs. \"Server CPU demand remains very strong,\" Su said. \"Hyperscalers are expanding their infrastructure to meet growing demand for cloud services in AI, while enterprises are modernizing their data centers to ensure they have the right compute required to enable new AI workflows.\"AMD's client and gaming segment rose 37% year over year to $3.9 billion. The company said it was driven by demand for its Ryzen processors for laptops and PCs, which have gained market share versus Intel. The company's embedded segment grew slower, rising 3% on a year over year basis to $950 million. AMD has faced issues over whether it would be able to ship its AI chips to China because of U.S. export controls. The company on Tuesday said that it recorded $390 million in China sales of its Instinct MI308 chips during the fourth quarter and expects $100 million in China revenue in the current quarter. WATCH: AMD CEO Lisa Su: Expect over 5 billion active AI users in the next five yearswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AMD shares drop as forecast comes up short of some expectations",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108208259-1759767774187-gettyimages-2239199521-AMD_OPENAI.jpeg?v=1770155656&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T23:35:34.000Z",
      "dateModified": "2026-02-03T23:35:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sen. Warner calls Gabbard to testify after Georgia election office raid, Trump FBI call",
    "url": "https://www.cnbc.com/2026/02/03/gabbard-trump-georgia-election-fbi-warner.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108260858-1770141448559-gettyimages-2249021923-TRUMP_CABINET.jpeg?v=1770151322&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T20:51:24.000Z",
    "description": "Tulsi Gabbard, director of National Intelligence, during a Cabinet meeting at the White House in Washington, DC, US, on Tuesday, Dec. 2, 2025.Yuri Gri",
    "body": "Tulsi Gabbard, director of National Intelligence, during a Cabinet meeting at the White House in Washington, DC, US, on Tuesday, Dec. 2, 2025.Yuri Gripas | Bloomberg | Getty ImagesSen. Mark Warner, D-Va., on Tuesday called on Director of National Intelligence Tulsi Gabbard to testify in person before the Senate Intelligence Committee about her appearance at an FBI raid on a Georgia election office last week.Warner, the vice chairman of the intelligence panel, said he was especially concerned that Gabbard facilitated a phone call between those FBI agents and President Donald Trump after the search warrant was executed.\"Let's be clear: It is inappropriate for a sitting president to personally involve himself in a criminal investigation tied to an election he lost,\" Warner told reporters on Capitol Hill.The senator also sounded alarms about Trump's recent suggestion that Republicans should \"take over\" and \"nationalize\" elections.\"That statement alone makes clear that this threat to our election security, the basic premise of our democracy, is forward looking to 2026 into 2028,\" he said.Warner's comments turn up the volume on Democrats' growing fears that Trump — who vehemently refused to accept his 2020 election loss, and continues to falsely claim that he won that race — may try to meddle in the upcoming midterms.Even as the minority party, Democrats in the Senate have the power to compel people to testify.United States Director of National Intelligence Tulsi Gabbard speaks on the phone while standing at the edge of a truck loading bay after the Federal Bureau of Investigation (FBI) executed a search warrant for the Fulton County Election Hub and Operation Center in relation to the 2020 election, according to a law enforcement official familiar with the matter, in Union City, Georgia, U.S. January 28, 2026.Elijah Nouvelage | ReutersWarner accused Gabbard's office of systematically \"dismantling\" various guardrails designed to protect elections.\"When you put all of this together, it is clear that what happened in Fulton County is not about revisiting the past, it is about shaping the outcome of future elections,\" he said.In a letter to Warner and other lawmakers on Monday, Gabbard said her presence at the Fulton County election office was \"requested\" by Trump and that she only observed the execution of an FBI search warrant there \"for a brief period of time.\"Spokespeople for the county have confirmed that the federal agents were seeking records related to 2020 elections. Fulton County Superior Court Clerk Che Alexander told local outlet WSB-TV last week, \"They took 24 pallets, which encompassed 656 boxes of 2020 election documents.\"Gabbard said in the letter that, as DNI, she has \"broad statutory authority to coordinate, integrate, and analyze intelligence related to election security, including counterintelligence (CI), foreign and other malign influence and cybersecurity.\"Asked for comment on the senator's remarks, ODNI spokeswoman Olivia Coleman told CNBC in an email that Gabbard's letter \"addresses, in detail, much of what Warner said today.\" Coleman did not address Warner's call for Gabbard to testify.Gabbard also appeared to broadly confirm The New York Times' report that, during a meeting with FBI agents after the raid, she called up Trump and put him on speakerphone to praise them for their work.\"While visiting the FBI Field Office in Atlanta, I thanked the FBI agents for their professionalism and great work, and facilitated a brief phone call for the President to thank the agents personally for their work,\" Gabbard wrote in the letter.The Times, citing three people with knowledge of the meeting, reported that Trump asked the agents questions, which were mostly fielded by the squad supervisor who developed evidence for the search of the election office.Read more CNBC politics coverageTrump: If states can't run elections 'honestly,' then 'somebody else should take over'Trump signs bill ending federal government shutdownSen. Warner calls Gabbard to testify over GA election raid, Trump callTrump: Powell probe over Fed HQ renovation should continueTrump pardon attorney Ed Martin reportedly sidelined from investigationsHow global dark fleet of tankers is navigating high seas hunt for sanctioned oilHouse hardliners complicate ending government shutdown as Speaker Johnson moves aheadTrump says U.S. and India reached trade deal, will lower tariffs immediatelyGabbard's letter said Trump \"did not ask any questions, nor did he or I issue any directives\" on the call.She added that her office's general counsel \"has found my actions to be consistent and well within my statutory authorities.\"Warner rejected that defense. \"The broad authority to analyze intelligence is not a license to participate in a sham investigation,\" he said. \"And it certainly does not justify facilitating direct contact between the frontline FBI agents doing this investigation, directly to the president of the United States.\"Meanwhile, Trump, in a podcast interview with former deputy FBI director Dan Bongino that was released Monday, called on members of the Republican Party to \"take over the voting.\" He made that suggestion after echoing the conspiracy theory that noncitizens are being \"brought\" into the U.S. to vote illegally. Trump tied the claim — which has been repeatedly debunked — with his administration's aggressive efforts to carry out mass deportations of undocumented immigrants.\"If we don't get them out, Republicans will never win another election,\" Trump told Bongino.It's \"amazing that the Republicans aren't tougher on it. The Republicans should say, 'We want to take over. We should take over the voting, the voting in at least many — 15 places,'\" Trump said.\"The Republicans ought to nationalize the voting,\" he went on. \"We have states that are so crooked, and they're counting votes. We have states that I won that show I didn't win.\"States are primarily responsible for governing their own election systems.\"You're going to see something in Georgia, where they were able to get, with the court order and the ballots,\" Trump added in the interview. \"You're going to see some interesting things come out.\"White House press secretary Karoline Leavitt, asked Tuesday why Gabbard is involved in the Georgia operation, said Trump has tapped her to \"oversee the sanctity and the security of our American elections.\"\"This is a coordinated, whole-of-government effort to ensure that our elections, again, are fair and transparent moving forward,\" Leavitt said.House Speaker Mike Johnson, R-La., and Senate Majority Leader John Thune, R-S.D., on Tuesday both defended Trump's comments about nationalizing elections.\"What you're hearing from the president is his frustration about the lack of some of the blue states, frankly, of enforcing these things and making sure that they are free and fair elections,\" Johnson said.Thune said, \"I think the president has clarified what he meant by that, and that is that he supports the SAVE Act,\" referring to legislation that would require proof of U.S. citizenship to register to vote.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sen. Warner calls Gabbard to testify after Georgia election office raid, Trump FBI call",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108260858-1770141448559-gettyimages-2249021923-TRUMP_CABINET.jpeg?v=1770151322&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T20:51:24.000Z",
      "dateModified": "2026-02-03T20:51:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump signs bill ending federal government shutdown",
    "url": "https://www.cnbc.com/2026/02/03/house-republicans-reopen-us-government-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261011-1770155142091-gettyimages-2259773051-aw1a6412_yed7bmy4.jpeg?v=1770155222&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T21:47:20.000Z",
    "description": "watch nowPresident Donald Trump on Tuesday signed a bill into law to reopen most of the government, officially ending a partial shutdown that began la",
    "body": "watch nowPresident Donald Trump on Tuesday signed a bill into law to reopen most of the government, officially ending a partial shutdown that began last weekend.The House of Representatives narrowly passed the bill 217-214 earlier in the day after the Senate approved it last week. Much of the government has been shuttered since Saturday morning. The bill provides funding for the departments of Defense, Treasury, State, Health and Human Services, Labor, Housing and Urban Development, Transportation, and Education through the remainder of the fiscal year on Sept. 30. It also provides two weeks of stopgap funding for the Department of Homeland Security after the Senate stripped full-year funding for the agency in response to the killings of two U.S. citizens by federal immigration officers. Now, Congress and the White House will turn to thorny negotiations over new guardrails on immigration enforcement in the DHS funding bill. Democrats insisted on separating out the DHS measure following enforcement actions in Minneapolis.The Tuesday vote in the House was bipartisan. Before the vote, the lead Democratic negotiator on the spending bills, Rep. Rosa DeLauro of Connecticut, urged members of her party to support it.\"Passing these five full-year funding bills today puts us in the best position to win that fight\" over DHS funding, DeLauro said. Many Democrats and some Republicans still opposed the bill, however.The appropriations package was nearly torpedoed earlier in the day during a procedural vote, but narrowly advanced 217-215.House Speaker Mike Johnson, R-La., kept the House open much longer than expected to clear the procedural vote, where he could only afford to lose one Republican. More than a handful of Republicans held out their votes, and Rep. John Rose, R-Tenn., initially voted against the measure. All Democrats voted no on the procedural vote. Many Republicans wanted to compel a Senate vote on a controversial voter ID measure known as the SAVE Act.That caused a mad scramble on the House floor from the Republican leadership team to get the holdouts to vote yes and to flip Rose. Rose eventually changed his vote and the holdouts relented, unlocking the House's ability to move forward on the bill.Democratic Leader Hakeem Jeffries of New York had told Johnson that Democrats would not help Republicans advance the procedure under which the government funding vote would happen, requiring Johnson to work within his own razor-thin majority to fund the government. After a new Democratic lawmaker was sworn in Monday, Johnson could only afford to lose one Republican vote on any party-line measure.\"We're going to pass the rule today, it was never in doubt to me,\" Johnson said in a news conference Tuesday morning. \"We're governing responsibly and we're getting the job done.\"Read more CNBC politics coverageTrump: If states can't run elections 'honestly,' then 'somebody else should take over'Trump signs bill ending federal government shutdownSen. Warner calls Gabbard to testify over GA election raid, Trump callTrump: Powell probe over Fed HQ renovation should continueTrump pardon attorney Ed Martin reportedly sidelined from investigationsHow global dark fleet of tankers is navigating high seas hunt for sanctioned oilHouse hardliners complicate ending government shutdown as Speaker Johnson moves aheadTrump says U.S. and India reached trade deal, will lower tariffs immediatelyJohnson spent most of Monday trying to work through rebellions in his party against ending the shutdown. Among them were conservative lawmakers demanding a vote on the SAVE Act. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump signs bill ending federal government shutdown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261011-1770155142091-gettyimages-2259773051-aw1a6412_yed7bmy4.jpeg?v=1770155222&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T21:47:20.000Z",
      "dateModified": "2026-02-03T21:47:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]