[
  {
    "title": "Stock futures resume trading after a halt caused by 'cooling issue' at data center",
    "url": "https://www.cnbc.com/2025/11/28/cme-halts-fx-commodities-futures-trading-after-data-center-issue.html",
    "image": "https://image.cnbcfm.com/api/v1/image/105910276-1557771677137gettyimages-103142398.jpeg?v=1764338215&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T14:00:37.000Z",
    "description": "The floor of the Chicago Mercantile Exchange (CME)/New York Mercantile Exchange (Nymex) in New York City. CME Group is the world's largest and most di",
    "body": "The floor of the Chicago Mercantile Exchange (CME)/New York Mercantile Exchange (Nymex) in New York City. CME Group is the world's largest and most diverse derivatives exchange.David S. Holloway | Getty ImagesTrading gradually resumed after coming to a standstill on the Chicago Mercantile Exchange on Friday, as a cooling issue at one of its data centers impacted traders across the globe. Stock futures and options trading reopened fully at 8:30 a.m. ET, with other services gradually being restored. Bonds and metals resumed trading after a pause, according to FactSet data, while individual stocks were still trading the premarket.\"All CME Group markets are open and trading,\" a CME Group spokesperson said in an emailed statement. Earlier, representatives for CME Group had told CNBC markets were halted due to a cooling issue at CyrusOne data centers, adding that it may take some time for moves in the impacted contracts to be seen once the outage is resolved. watch nowGlobex futures and options markets, foreign exchange platform EBS markets and BMD markets were all impacted. EBS markets reopened at 7 a.m. ET, around 90 minutes after its subsidiary BrokerTec EU markets resumed trading.The CME — the largest exchange operator in the world by market value — trades futures and options across various asset classes, including agricultural commodities, energy, metals and equities. Cooling issueEarlier, a spokesperson for Dallas, Texas-headquartered CyrusOne told CNBC the company was actively responding to a cooling system issue at its CHI1 data center facility in the Chicago area, which had impacted customers including CME Group. \"On November 27, our CHI1 facility experienced a chiller plant failure affecting multiple cooling units,\" they said in an email. \"Our engineering teams, along with specialized mechanical contractors, are on-site working to restore full cooling capacity. We have successfully restarted several chillers at limited capacity and have deployed temporary cooling equipment to supplement our permanent systems.\"CyrusOne's representative said the firm was in direct contact with all affected customers, and its teams were \"working around the clock to restore normal operations as quickly and safely as possible.\"\"We apologize for any disruption this has caused and appreciate the patience of our customers as we work toward full resolution,\" they added. Art Hogan, chief market strategist at B. Riley Wealth, told CNBC it was fortunate the outage had come on one of the slowest trading days of the year in the U.S., just after Thanksgiving. \"It appears as though they are gradually starting to restore some operations,\" he said. \"All told this could have been much worse.\"Emir Syazwan, a futures trader at Ninefold Trading Co. based in Malaysian capital Kuala Lumpur, told CNBC on Friday that he had been on the phone to his broker \"throughout the afternoon\" local time as the CME outage dragged on. watch nowGiven the timing of the outage — at the end of the week, just after a major U.S. holiday and in the early hours of the morning for American traders — Syazwan said those trading in the Asian or European session would be more directly impacted. Whether it will create \"lasting distortions\" in markets depends on how fast the issue can be resolved, he added. \"It's inconvenient, but it's not unprecedented, although this kind of event may materially alter market structure or price discovery,\" he said. \"Current price action already reflects markets being affected: the markets have been relatively flat and trading in a very tight range since 26 November, Wednesday, around ~10 PM EST. And until the issue is resolved, I would expect that behaviour and price action to continue.\"It's not the first time the CME has had to shut down electronic trade. Back in 2014, technical issues shut down some trading on the CME's Globex electronic system, impacting agricultural contracts. Last year, trading of equities, bonds and exchange-traded funds was also temporarily halted in Switzerland after stock exchange SIX had problems disseminating data. Syazwan's own trades have not been impacted, he told CNBC.\"I had already anticipated the major markets — especially the U.S. indices — to consolidate until the start of next year, so I went on early holiday at the beginning of the month,\" he said. — CNBC's Lisa Kailai Han and Matt Ward-Perkins contributed to this article. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stock futures resume trading after a halt caused by 'cooling issue' at data center",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/105910276-1557771677137gettyimages-103142398.jpeg?v=1764338215&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T14:00:37.000Z",
      "dateModified": "2025-11-28T14:00:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Too many bosses want to be liked, but it's not a sign of good leadership, says Google exec",
    "url": "https://www.cnbc.com/2025/11/28/google-learning-exec-biggest-leadership-skill-people-struggle-with.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218224-1761686575204-gettyimages-2212050379-office_apr_25_00193.jpeg?v=1761686585&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T15:05:01.000Z",
    "description": "Being a great leader takes time and practice, and a growing share of workers are trying to get better at it.Search interest in the term \"leadership\" i",
    "body": "Being a great leader takes time and practice, and a growing share of workers are trying to get better at it.Search interest in the term \"leadership\" is at an all-time high, according to Google data, along with related terms like training, best practices, advice on how to lead a team and sources for professional development.The buzz likely stems from people wanting to lead during a time of rapid business changes due to remote and hybrid policies in offices, global politics, changing economic circumstances and the adoption of technology like AI, says Brian Glaser, Google's chief learning officer.Glaser has been a manager off and on for the last 20 years and leads the onboarding, training and leadership development for some 150,000 employees worldwide. As a leadership expert, Glaser tells CNBC Make It that people of all experience levels struggle with one main aspect of being a boss: delivering \"really effective feedback so that people are clear about where they stand.\"Instead, many managers shy away from critical or constructive feedback in the pursuit of being well liked.\"As a leader, being nice is great,\" Glaser says. That can lead you to be liked among your reports, but \"the name of the game is really to be respected.\"\"If you're not delivering the feedback, you may not get the kind of respect you need as a manager,\" he says. This can be tough for first-time managers or someone who's been promoted and is now overseeing the work of former peers.But teams can grow stagnant or repeat avoidable mistakes \"if you're only looking to tell people what's working and not necessarily delivering the hard stuff,\" Glaser says.Glaser's team is behind Google's latest People Management Essentials, a paid course available to the public that covers lessons from over a dozen Google bosses about what it takes to be an excellent leader.Some of the lessons about delivering solid feedback are inspired by sports psychology, Glaser says.\"We know the best athletes are the folks who receive constant feedback from their coaches about how they're performing, he says. Win or lose, \"every time they finish a game, they debrief, they talk about what worked and what didn't. We believe those same concepts can be applied to organizational life.\"Talking about areas for improvements helps ensure stronger performance outcomes in the future. Athletes including Super Bowl champ Tom Brady and Team USA Olympic gymnast Gabby Douglas have discussed that learning from mistakes and failures fueled their successes.In the workplace, meanwhile, telling a report that \"they need to improve can be challenging,\" Glaser says, \"but we know through good practice, managers can do this, and it really matters.\"Black Friday sale: Want to up your AI skills and be more productive? Get 25% off our most popular course of the year, How to Use AI to Be More Successful at Work, with coupon code GETSMART. Offer valid Nov. 17 through Dec. 5, 2025.DON'T MISS: How to use AI to be more productive and successful at workPlus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Too many bosses want to be liked, but it's not a sign of good leadership, says Google exec",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218224-1761686575204-gettyimages-2212050379-office_apr_25_00193.jpeg?v=1761686585&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T15:05:01.000Z",
      "dateModified": "2025-11-28T15:05:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saba Capital activist Boaz Weinstein calls for removal of Baillie Gifford-run tech investment trust’s entire board",
    "url": "https://www.cnbc.com/2025/11/27/saba-capitals-boaz-weinstein-targets-baillie-gifford-run-tech-trust-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107416509-1715954534877-gettyimages-1258512789-BLOOMBERG_INVEST.jpeg?v=1764240097&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T09:10:08.000Z",
    "description": "Boaz Weinstein is calling for the removal of the entire board of a tech-focused fund managed by Baillie Gifford, in a bid to reverse what the activist",
    "body": "Boaz Weinstein is calling for the removal of the entire board of a tech-focused fund managed by Baillie Gifford, in a bid to reverse what the activist investor sees as \"unprecedented\" value destruction.In a letter to the Edinburgh Worldwide Investment Trust's board on Thursday, Weinstein — whose activist investment firm Saba Capital owns around 30% of shares in the trust — said the board has \"objectively and categorically failed\" to deliver the performance expected by shareholders.EWIT's portfolio comprises a global mix of smaller and emerging public and private companies focused on tech innovation and transformation, that target \"significant disruptive growth potential,\" according to the London-listed Baillie Gifford's website. Its holdings include Elon Musk's Space Exploration Technologies, or SpaceX, which makes up 8.4% of its portfolio.Weinstein said EWIT's net asset value is down 30.8% over the past five years, while its share price return has fallen 35%, having \"massively underperformed\" its self-selected benchmark, the FTSE All-Share Index, which is up 71.4% over the same period.That means the company's NAV return and share price performance ultimately lag the benchmark by more than 100% over the five-year period, Saba noted in the letter.Stock Chart IconStock chart iconEdinburgh Worldwide Investment Trust.\"The magnitude of this value destruction is unprecedented among peer U.K. equity investment trusts over this period,\" Weinstein wrote.Jonathan Simpson-Dent, chair of EWIT, expressed disappointment with Saba's open letter.He said EWIT's benchmark is the S&P Global Small Cap Index — not the FTSE All-Share Index cited in Weinstein's letter.\"It makes little sense to judge a global small-cap trust against a U.K. all-cap benchmark,\" Simpson-Dent said in a statement, adding that EWIT's NAV total return has been 17.5% to date, ahead of the S&P Global Small Cap Index's 4.8%. A Saba Capital spokesperson told CNBC: \"In its latest 2024 Annual Report, EWI compared company performance, specifically share price return, to the FTSE All-Share Index on page 79 citing it as 'a widely used measure of performance for UK listed companies'.\"The spokesperson said that EWI's share price return has underperformed the FTSE All-Share Index on a one-, three- and five-year period, and the S&P Global Small Cap Index on both a three- and five-year period, \"including by more than 60% over the five-year.\"'Constructive dialog'The trust's total assets stood at £847.15 million ($1.1 billion) as of Oct. 31. Weinstein is calling for a general meeting to appoint a new board composed solely of \"qualified, independent directors… committed to delivering long-term value for all shareholders.\"\"We remain profoundly frustrated by the board's prolonged inertia,\" the activist investor wrote in the letter on Thursday. \"We do not have faith in the current Board's ability to implement the necessary strategic changes.\"Simpson-Dent said EWIT's board will continue to seek \"constructive dialog\" with Weinstein toward an \"equitable and holistic\" solution, including return of capital. But he warned: \"While we are open to discuss Board composition with Saba, we would strongly reject any proposal to replace the entire Board and the ambiguity that would follow.\"He added: \"The company's actions over the last year have supported a tightly managed discount, currently 5.6%, significantly narrower than the Global Smaller Companies peer group weighted average discount of 10.9%.\"The move follows an earlier attempt by Saba last year to shake up the EWI trust's board, a bid which ultimately failed to win investor support.Weinstein — whose New York-based $6 billion hedge fund trades credit relative value opportunities — has built a number of positions across the U.K. investment trust space lately. Outlining two new bets at the annual Sohn London investment conference last week, he said there is \"a storm brewing\" in the U.K. investment trust sector where discounts have widened sharply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saba Capital activist Boaz Weinstein calls for removal of Baillie Gifford-run tech investment trust’s entire board",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107416509-1715954534877-gettyimages-1258512789-BLOOMBERG_INVEST.jpeg?v=1764240097&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T09:10:08.000Z",
      "dateModified": "2025-11-28T09:10:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Deepak Chopra's new AI companion puts decades of wisdom 'in your pocket,' he says",
    "url": "https://www.cnbc.com/2025/11/28/deepak-chopra-new-ai-companion-was-modeled-on-his-lifes-work.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231070-1764004518791-gettyimages-2157982348-canneslions_240617_153740_rbord_vwhu7p7p.jpeg?v=1764004572&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T15:00:01.000Z",
    "description": "Bestselling author and wellness leader Deepak Chopra is optimistic about the possibilities of artificial intelligence. \"The thing is, AI is here to st",
    "body": "Bestselling author and wellness leader Deepak Chopra is optimistic about the possibilities of artificial intelligence. \"The thing is, AI is here to stay,\" he says. Chopra believes that while the technology can be harmful, it can also be beneficial when used very specifically for self-discovery. Chopra recommends using AI chatbots to get to know yourself better, suggesting questions like, \"What is my purpose?\" and \"How can I cultivate self-compassion?\"Chopra recently launched an online wellness platform that offers meditations, community discussion boards and live sessions led by Chopra himself. And he's bullish enough on AI to have created his very own Deepak Chopra chatbot. Unlike large language models such as Anthropic's Claude and Google's Gemini, Chopra's bot is what's called a small language model. Instead of training the bot on all of human knowledge, it's trained on Chopra's work, specifically.\"I've written 95 plus books,\" he says. \"I've done innumerable conferences. I have thousands of videos on YouTube and LinkedIn and Facebook and Instagram and TikTok. So I fed all that into my AI.\" Chopra platform subscribers pay $10 monthly, which includes chatbot access. Non-subscribers can pay from 50 cents per 30-minute session to $6 a month to use the bot.The thing is, AI is here to stay.Deepak ChopraAuthor, wellness guruUsers can choose from a series of existing prompts on subjects including success, relationships, sex and spirituality, or they can simply put in their own question. Answers come back in text format and can also be played out loud in Chopra's voice. But Chopra says the bot does have its limits: \"We will not be doing suicide prevention,\" he says. \"That's for professionals.\" Chopra's chatbot will not offer psychotherapy either, he says.Instead, Chopra says you can give the bot prompts like \"I haven't slept in five days, can you give me a meditation?\" or \"I'm having difficulty in my relationship because we're not communicating.\" \"Then, we give you guidelines,\" he says. Ultimately, Chopra says he wants people to cultivate empathy, compassion, joy and peace of mind, and that he wants to be a resource for users around the clock. \"You have me as your companion in your pocket all the time,\" he says.He adds that he wouldn't mind continuing to be a presence in his family's life. \"My grandchildren's grandchildren will be able to have a conversation with me long after I'm gone,\" he says.Black Friday sale: Want to up your AI skills and be more productive? Get 25% off our most popular course of the year, How to Use AI to Be More Successful at Work, with coupon code GETSMART. Offer valid Nov. 17 through Dec. 5, 2025.DON'T MISS: How to use AI to be more productive and successful at workPlus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Deepak Chopra's new AI companion puts decades of wisdom 'in your pocket,' he says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231070-1764004518791-gettyimages-2157982348-canneslions_240617_153740_rbord_vwhu7p7p.jpeg?v=1764004572&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T15:00:01.000Z",
      "dateModified": "2025-11-28T15:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alibaba's AI glasses to rival Meta go on sale for $500 ",
    "url": "https://www.cnbc.com/2025/11/27/alibaba-quark-ai-glasses-go-on-sale-price-specs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108177567-1753687050071-Alibaba_AI_glasses.jpg?v=1753690514&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T09:07:07.000Z",
    "description": "Alibaba announced plans to release a pair of smart glasses powered by its AI models. The Quark AI Glasses are Alibaba's first foray into the smart gla",
    "body": "Alibaba announced plans to release a pair of smart glasses powered by its AI models. The Quark AI Glasses are Alibaba's first foray into the smart glasses product category.AlibabaAlibaba's artificial intelligence-powered smart glasses went on sale on Thursday as the Chinese tech giant looks to ramp up its focus on consumer AI in an increasingly competitive market. The Quark AI Glasses, first announced in July, come in two variants — the S1, which starts at  3,799 Chinese yuan ($536) and G1 at 1,899 yuan.The tech giant has integrated its Qwen AI models — Alibaba's version of ChatGPT — with the device which also links to its newly-launched Qwen app. This means users can use voice control to get the glasses to carry out tasks.The lenses of the glasses are effectively screens and the device has a camera built into the frame. The main difference between the S1 and G1 is the display, Alibaba said.watch nowThe company said that some of the features include on-the-go translation, AI-generated meeting notes and the ability to ask the virtual assistants questions. Users take pictures of a product using the camera in the lens and then the device will show the price of that product on Taobao, Alibaba's main shopping app in China. Alibaba, like other technology companies such as U.S. giant Meta, are betting that smart glasses could be the next big consumer device after the smartphone.In September, Meta unveiled the $799 Meta Ray-Ban Display glasses, the social media company's first consumer-ready smart glasses with a built-in display. Users can control the device via hand gestures with a special wristband. Alibaba's glasses will initially go on sale in China and compete with domestic rivals, including consumer electronics maker Xiaomi and startup Xreal. The smart glasses market is still small but growing rapidly. By 2026, shipments of AI glasses are expected to exceed more than 10 million units, doubling from 2025, according to a forecast from Omdia. For Alibaba, the glasses are its latest play in the consumer AI market as it looks to build on its recent successes. The company's ChatGPT-style Qwen app got 10 million downloads in the first week of the public beta launch. Meanwhile, Alibaba's cloud computing business, where it books much of its AI-relate revenue, saw an acceleration of growth in the last quarter.The Hangzhou, headquartered company is one of the leaders in China's AI space, and has been investing aggressively in AI alongside rival giants like Baidu and Tencent, and aggressively launching new models.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alibaba's AI glasses to rival Meta go on sale for $500 ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108177567-1753687050071-Alibaba_AI_glasses.jpg?v=1753690514&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T09:07:07.000Z",
      "dateModified": "2025-11-27T09:07:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SEC investigates Jefferies over First Brands collapse, report says",
    "url": "https://www.cnbc.com/2025/11/27/sec-investigates-jefferies-over-first-brands-collapse-report-says.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214446-1760996506866-gettyimages-2241909727-JEFFERIES_HQ.jpeg?v=1760996569&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T18:02:34.000Z",
    "description": "The Jefferies Financial Group Inc. headquarters in New York, US, on Monday, Oct. 20, 2025. Michael Nagle | Bloomberg | Getty ImagesThe U.S. Securities",
    "body": "The Jefferies Financial Group Inc. headquarters in New York, US, on Monday, Oct. 20, 2025. Michael Nagle | Bloomberg | Getty ImagesThe U.S. Securities and Exchange Commission is investigating Jefferies' relationship into bankrupt auto parts maker First Brands Group, The Financial Times reported Thursday. The newspaper, citing people with knowledge of the matter, said the regulator is looking into whether Jefferies gave investors enough information on its Point Bonita fund's exposure to the failed auto business. The inquiry into internal controls and potential conflicts within the bank is at an early stage, the report said. It's not clear whether it will result in any allegations of wrongdoing. Jefferies came under pressure last month after its exposure to First Brands — which collapsed under a series of complex debt agreements — raised fears of other bad loans on Wall Street. Stock Chart IconStock chart iconJefferies, ytd performanceShares of Jefferies are down more than 12% this quarter and 27% this year. When asked for comment, an SEC spokesperson said the agency \"does not comment on the existence or nonexistence of a possible investigation.\"Jefferies did not respond to CNBC's request for comment. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SEC investigates Jefferies over First Brands collapse, report says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214446-1760996506866-gettyimages-2241909727-JEFFERIES_HQ.jpeg?v=1760996569&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T18:02:34.000Z",
      "dateModified": "2025-11-27T18:02:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Black Friday became a retail letdown: 'To sustain the ride, they started to dilute it'",
    "url": "https://www.cnbc.com/2025/11/28/black-friday-shopping-retail-letdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232679-1764182825305-gettyimages-156843885-Was7084561.jpeg?v=1764187385&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T17:29:33.000Z",
    "description": "Black Friday early morning shoppers rush in as the doors are opened at a Walmart store in Fairfax, Virginia, Nov. 28, 2008.Gerald Martineau | The Wash",
    "body": "Black Friday early morning shoppers rush in as the doors are opened at a Walmart store in Fairfax, Virginia, Nov. 28, 2008.Gerald Martineau | The Washington Post | Getty ImagesBlack Friday has long been defined by massive crowds, rock-bottom prices and rabid consumers willing to bite, scratch and claw their way to the best deals of the season. But these days, retail's biggest holiday looks a bit different. Stores are opening their doors later, foot traffic is flat, online shopping is up and, in a world where Black Friday begins in September, consumers are wary, unsure if the deals they're getting are even that good. \"The integrity of the event is pretty much gone,\" said Mark Cohen, former CEO of Sears Canada, who spent a decade as the director of retail studies at Columbia Business School. \"Back in the day, a Black Friday price was the best you could ever find on something ... never to be seen again. In today's day and age, promotional pricing just gets better and better from a consumer's point of view the closer you get to the holiday.\"A line forms for the 4 a.m. Black Friday opening at Kohl's department store in Pleasanton, California, Nov. 27, 2009.Michael Macor | San Francisco Chronicle | Hearst Newspapers | Getty ImagesWhile Black Friday remains a critical day for many retailers and is still arguably the most popular shopping day of the year, it's no longer defined by the in-person experience. Millions of shoppers are expected to visit malls, big-box stores and specialty retailers on Friday, but millions more are expected to stay at home and shop online from their phones and computers. That means a shift in strategy for retailers that have long gone all in on Black Friday, including Walmart, Target and Macy's. Some, such as Kohl's, are launching their holiday sales earlier in the season. Others, such as Walmart, are spacing out promotions in separate events — one in mid-November, another over the holiday weekend and a final, one-day event on Cyber Monday. Many others planned to stay closed on Thanksgiving but still had deals online during the holiday. \"I still recall queuing up outside stores waiting for those special deals that every retailer would advertise,\" said Denish Shah, the department chair and professor of marketing at Georgia State University's Robinson College of Business. \"Whereas now it goes over weeks, over multiple days, and most of the time the consumers are doing it from the comfort of their home through online sales.\" For the last six years, more people shopped online on Black Friday than in-store, and foot traffic has been relatively flat following a post-Covid spike, according to data from the National Retail Federation and Placer.ai, an analytics firm that uses anonymized data from mobile devices to estimate overall visits to locations.Since 2021, Black Friday store visits have consistently been more than 50% higher than the daily average for the full year, but the amount of foot traffic stores are getting on the day after Thanksgiving isn't really growing, data from Placer.ai shows. From 2023 to 2025, the number of millennials and Generation X consumers planning to make the majority of their purchases on Black Friday has dropped. It's largely flat for Gen Z and baby boomer shoppers over that time period, according to data from the Bank of America Institute.Meanwhile, the amount of money people are spending during the so-called Turkey 5 – the period of shopping days spanning Thanksgiving to Cyber Monday – has declined for two straight years, according to the NRF. Between 2019 and 2024, spending fell nearly 13%. That decline is expected to continue this year, with consumers planning to spend 4% less on average during the Turkey 5, according to a recent Deloitte survey. \"There is still going to be a day of highlights from retailers, whether it is door busters, ... certain additional promotions, etc.,\" said Tiffany Yeh, a managing director and partner with Boston Consulting Group's consumer practice. \"But it is more muted.\" How Black Friday lost its edge When the modern-day version of Black Friday became popularized in the 1980s, it took an entire year of planning to pull off, Cohen said. \"The art was to convince a vendor to give you an enormous discount on cost so that you could create this tremendously compelling offer to the consumer that would then ... benefit you for the balance of the holiday season,\" he recalled. \"But it required an enormous amount of work.\" Retailers had to pick the perfect product, set the perfect price and make sure their competitors didn't get wind of their promotional plans. Then, they had to make sure they ordered enough inventory to sell out, but not so early that it would cause riots. Black Friday shoppers pour in to a Best Buy store in Los Angeles at 5 a.m. on Nov. 28, 2008.Jewel Samad | AFP | Getty ImagesBut over time, as Black Friday became more popular, retailers began extending the shopping holiday so their biggest sales tailwind of the year could last longer than a single day. First, stores opened earlier Friday morning, then they began opening on Thanksgiving, and then, promotions began the day before. When consumers began expecting discounts on more than a handful of products, promotions were spread to items in every department.\"In other words,\" Cohen said, \"to sustain the ride, they started to dilute it.\" As discounts spread across the store, the operational feat behind inventory and staffing became even more challenging to manage, leading retailers to spread out promotions even earlier, Yeh said. \"It's always been a tough one to really staff up labor so significantly for a short period of time,\" she said. \"If it's only for a day, people are not going to necessarily want to sign up for that, versus, if it's for a longer season, then you're more likely to get the necessary team members and also be able to train them.\"At the same time, consumer habits began to shift in the backdrop. Are Black Friday deals still worth it? Online shopping had been on a slow and steady rise for 20 years, but during the Covid-19 pandemic, adoption skyrocketed. Now, retailers don't need to put on as big of an in-person show on Black Friday, because online sales are increasingly outpacing those in stores. Stretching Black Friday into a seasonlong event also makes it easier for consumers to spread out their own spending, Shah said. \"November and December are two different pay periods for many consumers,\" he said. \"It makes a difference if they can spread their spending across two pay periods rather than just one.\" Of course, there's also debate about how good the discounts actually are on Black Friday, especially in a soft economy where retailers are leaning heavily on promotions to drive sales at the same time they're raising prices to offset tariffs. People crowd the first floor of Macy's department store in New York as they open for Black Friday sales at midnight on Nov. 23, 2012.Stan Honda | AFP | Getty Images\"Rampant discounting\" across the industry — before, during and after the holiday shopping season — has left many consumers feeling \"skeptical\" about promotions overall, said Sonia Lapinsky, the head of consulting firm AlixPartners' global fashion practice. Some promotions this holiday season could also be disguising price increases, notching the cost back down to what it was before the ticket price was raised, said Lapinsky. \"They've had the power to cross-shop and look for these discounts, and now there's just this lack of trust,\" Lapinsky said. \"They're tired of doing that, and there's a lack of trust that they're actually getting the value piece of it.\" For example, brands like Gap, Levi Strauss and Under Armour started their Black Friday sales on Thanksgiving, and the promotions were comparable to those offered earlier in the season.\"The whole idea of creating urgency is kind of goofy and gone,\" Cohen said. \"Like so many headlines that purportedly offer a deal, the deal is something of a scam.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Black Friday became a retail letdown: 'To sustain the ride, they started to dilute it'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232679-1764182825305-gettyimages-156843885-Was7084561.jpeg?v=1764187385&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T17:29:33.000Z",
      "dateModified": "2025-11-28T17:29:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple is challenging India's antitrust body over a potential $38 billion fine",
    "url": "https://www.cnbc.com/2025/11/27/apple-challenges-indias-anti-trust-body-over-potential-38-billion-fine.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108115188-1741833320394-gettyimages-1681507978-INDIA_IPHONE_15.jpeg?v=1748332385&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T12:36:32.000Z",
    "description": "The first day of sale of the iPhone 15 smartphone in Mumbai, India, on Sept. 22, 2023.Dhiraj Singh | Bloomberg | Getty ImagesApple has filed a case in",
    "body": "The first day of sale of the iPhone 15 smartphone in Mumbai, India, on Sept. 22, 2023.Dhiraj Singh | Bloomberg | Getty ImagesApple has filed a case in the Delhi High Court against the country's antitrust body because of how it considers global turnover when calculating penalties.The iPhone maker, which is among the fastest-growing smartphone brands in India, is challenging India's new antitrust law under which the U.S. company could face fines of up to $38 billion, according to a report by Reuters.Apple added that it was \"unconstitutional, grossly disproportionate, unjust\" for the Competition Commission of India (CCI) to use turnover when calculating penalties.Apple did not immediately respond to a request for comment from CNBC.The CCI has been investigating complaints from an alliance of Indian startups and Tinder-owner Match Group that accuse Apple of \"abusive conduct,\" which forces developers to pay high commissions for in-app purchases. Apple denied the charges.The CCI's final verdict is still pending, but it said its \"prima facie view [is] that mandatory use of Apple's IAP for paid apps and in-app purchases restricts the choice available to the app developers to select a payment processing system of their choice,\" in an order in December 2021.Apple recorded its highest-ever quarterly shipments in India of 5 million units in the third quarter of 2025, according to data from IDC. watch nowThe company is expected to sell about 15 million iPhones in India this year and could rank among the top five smartphone companies there, Navkendar Singh, associate vice president with IDC India,  on Nov. 18.Apple is among the global companies diversifying their manufacturing supply chains away from China to India. In 2024, Apple's exports from India hit a record of $12.8 billion, up more than 42% from a year earlier.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple is challenging India's antitrust body over a potential $38 billion fine",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108115188-1741833320394-gettyimages-1681507978-INDIA_IPHONE_15.jpeg?v=1748332385&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T12:36:32.000Z",
      "dateModified": "2025-11-27T12:36:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI shopping comes with its own perils this Black Friday",
    "url": "https://www.cnbc.com/2025/11/28/black-friday-ai-agentic-shopping-comes-with-its-own-perils.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108233435-1764337549194-gettyimages-2248804951-hpet5395_cjmbfqif.jpeg?v=1764337911&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T13:47:21.000Z",
    "description": "Shoppers and pedestrians move through the Pitt Street Mall during a Black Friday sale on Nov. 28, 2025 in Sydney, Australia.Lisa Maree Williams | Gett",
    "body": "Shoppers and pedestrians move through the Pitt Street Mall during a Black Friday sale on Nov. 28, 2025 in Sydney, Australia.Lisa Maree Williams | Getty ImagesThe emergence of AI shopping doesn't just give consumers access to personalized advice and hassle-free shopping, it also brings with it an increased risk of digital fraud.This Black Friday, for the first time, consumers and retailers alike are being warned about the perils of so-called \"agentic shopping,\" as consumers turn to large language models to search for products, compare offerings, receive personalized recommendations, and even make purchases without much human input. These technological advances come with their own risks.  \"It definitely makes my life easier… but at the same time, it also makes fraudsters' life substantially easier as well,\" said Michael Reitblat, CEO of Forter, an identity intelligence company that works on fraud prevention.According to Reitblat, there has been a 200% increase in agentic shopping by consumers over the past six months. That has been accompanied by a nearly tenfold increase in fraudsters using AI. \"Think of it as sending thousands of robots into different stores to masquerade as good consumers,\" Reitblat told CNBC's \"Squawk Box Europe.\"watch nowWhile some retailers' knee-jerk reaction has been to simply ban AI purchases, that could be a faulty strategy as more and more consumers use AI for shopping and that is driving good quality traffic, Reitblat said.A report by McKinsey & Company and The Business of Fashion found that among fashion executives, AI and digital tools were seen as the single biggest opportunity for the industry in 2026. To ensure products are visible and favored by AI models, brands must rethink marketing and e-commerce strategies, the report noted, adding that semantically rich data and API-accessible content will be critical to success.\"You need to use AI to fight AI,\" Reitblat said. \"You need to make sure that you're leveraging better data than fraudsters may have, and you need to properly think of: how do you authenticate the consumers?\"Shaky consumer confidenceValue-conscious consumers is another factor retailers have to deal with this year as heightened trade tensions and worries about a slowing economy impact consumers' spending habits.Consumer confidence has been shaky heading into the shopping season. In Europe, economic sentiment has remained stubbornly below its long-term average since mid-2022, according to data by the European Commission. Meanwhile in the U.S., consumer confidence hit its lowest point since April in November as concerns about job security mount.watch nowSome experts have suggested a split between wealthy consumers doing well and others that are cutting back on spending amid pressure from higher prices, in what has been dubbed the \"K-shaped economy.\"\"Consumer confidence has been bumpy, and therefore the customers feeling like they're getting genuine value is going to be a big thing for this year,\" said Curry's Chief Services Officer Dean Kramer. \"We know research is a big part of how consumers approach Black Friday, making sure they're getting absolute value.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI shopping comes with its own perils this Black Friday",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108233435-1764337549194-gettyimages-2248804951-hpet5395_cjmbfqif.jpeg?v=1764337911&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T13:47:21.000Z",
      "dateModified": "2025-11-28T13:47:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok-fueled K-beauty boom triggers a retail race in the U.S.",
    "url": "https://www.cnbc.com/2025/11/27/k-beauty-tiktok-makeup.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108227539-1763484418622-gettyimages-1409521302-koreanbeauty0426161_cag.jpeg?v=1764272456&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T13:00:02.000Z",
    "description": "Carly Xie looks over facial mask items at the Face Shop, which specializes in Korean cosmetics, in San Francisco, April 15, 2015.Avila Gonzalez | San ",
    "body": "Carly Xie looks over facial mask items at the Face Shop, which specializes in Korean cosmetics, in San Francisco, April 15, 2015.Avila Gonzalez | San Francisco Chronicle | Hearst Newspapers | Getty ImagesOn a recent Saturday at an Ulta Beauty store in midtown Manhattan, Denise McCarthy, a mother in her 40s, stood in front of a wall of tiny pastel bottles, tubes and compacts. Her phone buzzed — another TikTok from her 15-year-old daughter.\"My kids text me the TikToks,\" she told CNBC, scooping Korean lip tints and sunscreens into her basket, destined for Christmas stockings. \"I don't even know what half of this does. I just buy the ones they send me.\"Two aisles over, a group of college students compared swatches of Korean cushion foundations. A dad asked a store associate whether a viral Korean sunscreen was the one \"from the girl who does the 'get ready with me' videos.\" Near the checkout, a display of Korean sheet mask mini-packs was nearly empty.Scenes like this are playing out across the country.Once a niche reserved for beauty obsessives, Korean cosmetics — known as K-beauty — are breaking fully into the American mainstream, fueled by TikTok virality, younger and more diverse shoppers, and aggressive expansion from retailers such as Ulta, Sephora, Walmart and Costco.K-beauty sales in the United States are expected to top $2 billion in 2025, up more than 37% from last year, according to market research firm NielsenIQ, far outpacing the broader beauty market's single-digit growth.And even as trade tensions complicate supply chains, brands and retailers told CNBC the momentum is strong.\"We have no plans of slowing down and see more opportunities to penetrate the market,\" said Janet Kim, vice president at K-beauty brand Neogen.In the first half of 2025, South Korea shipped a record $5.5 billion worth of cosmetics, up nearly 15% year over year, and has become the leading exporter of cosmetics to the U.S., surpassing France, according to data from the South Korean government.\"The growth has been remarkable,\" said Therese-Ann D'Ambrosia, vice president of beauty and personal care at NielsenIQ. \"When you compare that to the broader beauty market, which is growing at single digits, K-beauty is clearly operating in a different gear right now.\"Facial skin care remains the biggest K-beauty revenue driver in the U.S., NielsenIQ reported. Hair care is growing fastest, and hybrid items such as tinted serums and skin care-infused cushion compacts — sponge cushions soaked with an SPF foundation — continue to surge, the firm said.Big businessRetailers are racing to take advantage of the cosmetics boom, and a turf war is underway.Ulta, which has over 1,400 U.S. stores, launched \"K-beauty World\" in July, to spotlight Korean brands and tech devices. It's the only major U.S. retailer carrying products from Medicube, a beauty-tech company touted by celebrities such as Hailey Bieber. Ulta's first quarter 2025 report cited a 38% increase in Korean skin care sales, and executives said in August that new K-beauty partnerships contributed to the company beating Wall Street expectations for earnings in the second quarter. Sephora is leaning in as well. Its Times Square flagship location now features an entire wall of Korean skin care and cosmetics, and the retailer secured exclusive U.S. launches for Korean heritage brand Hanyul and sensitive-skin label Aestura.Big-box players are piling in too. Costco and Walmart have also expanded their assortments, adding essences, serums and sheet masks as demand accelerates.\"It's an arms race to see who can capitalize on the market for Korean products,\" Delphine Horvath, professor of cosmetics and fragrance marketing at the Fashion Institute of Technology, told CNBC. \"These products are now seen as a top driver of growth for cosmetic brands, and it seems it will keep booming.\"The competition is heating up just as Olive Young, often called the \"Sephora of Seoul,\" prepares to open its first U.S. store in Los Angeles next year. Asian beauty retailer Sukoshi is also expanding, planning 20 new stores in the coming year across cities such as Seattle, Miami, and Austin, Texas.\"Meeting customers where they can touch, feel and try what they see on TikTok is key,\" Sukoshi CEO Linda Dang told CNBC. \"Across the industry, companies are looking to expand partly because people really don't want to have to wait for shipping or travel all the way to Korea to get products.\"The boom arrives in the middle of the ongoing trade war.This spring, U.S. shoppers rushed to stock up on K-beauty favorites, bracing for price hikes from tariffs, Dang said. However, prices ultimately stayed relatively stable as Korean brands have temporarily absorbed the duties, Dang said, though many are now exploring alternative manufacturing or shipping methods.South Korea finalized a deal with President Donald Trump last month, settling on a 15% tariff rate instead of the initial 25% levy the president announced in April.\"The system of easy trading isn't what it was before tariffs,\" Dang told CNBC. \"That being said, a lot of companies have worked with advertisers and internally to do their best to offset and prevent passing those costs on to customers in the U.S.\"A visitor tries Korean-made cosmetics during the 2022 Korea Tourism Organization's Discover Your Korea, in Vanderbilt Hall of Grand Central Terminal, New York.Lev Radin | Pacific Press | Lightrocket | Getty ImagesThe 'second wave'Over the past decade, there's also been a rise in Korean entertainment in the U.S. — from pop groups such as BTS and Blackpink to this year's Netflix hit \"KPop Demon Hunters\" —which has helped push South Korea's cultural exports to unprecedented popularity.\"Korean culture has exploded on every front, and that has really shown up when it comes to K-beauty,\" Dang said.K-beauty's \"first wave,\" which hit the U.S. in the mid-2010s, was defined by \"glass skin,\" 10-step routines, snail mucin, cushion compacts and beauty blemish creams. Most products catered to lighter skin tones, and distribution was limited to small boutiques, Amazon sellers and early test placements at Ulta and Sephora, beauty experts said.\"The first wave had some penetration, but nothing like today,\" Horvath said. \"It was mostly people in the know.\"The second wave has been bigger, faster and far more inclusive. It has spanned color cosmetics, hair and scalp care, body care, fragrances and high-tech devices. TikTok is the central engine of discovery, especially for Gen Z and millennial shoppers, who account for roughly three-fourths of K-beauty consumers, according to a Personal Care Insights market analyst report. Posts tagged \"K-beauty\" or \"Korean skin care\" draw 250 million views per week, according to consumer data firm Spate. And viral products with sleek packaging often vanish from shelves faster than retailers can restock — particularly those that combine gentle formulas and low prices, Dang said.\"TikTok has changed the game,\" Horvath said. \"It's easier to educate consumers on innovation and get the word out. Brands are deeply invested in paying influencers, and TikTokers talk about textures, formulas and efficacy.\"Virality has also pushed brands to be more inclusive for younger and more diverse shoppers. After TikTok creators criticized Korean brand Tirtir for offering only three foundation shades, the company expanded to 40 shades within months and many other companies followed suit.The trend is visible across the Americas: 61% of consumers in Mexico and nearly half in Brazil say K-beauty is popular in their country, compared with about 45% in the U.S., according to Statista.\"Traditional retail and e-commerce remain important, but TikTok Shop is the standout disruptor,\" said Nielsen's D'Ambrosia. \"It's not just about the direct sales on that one platform; it's about how it's changing the entire discovery and purchase journey.\"But the second wave brings its own risks. A heavy dependence on virality could expose brands to sudden algorithm changes or regulatory scrutiny, D'Ambrosia said.\"When you have so much growth concentrated on one platform [such as TikTok], algorithm changes could significantly impact discoverability overnight,\" D'Ambrosia said. \"We've seen what happens when platforms tweak their recommendation engines. ... There are definitely some caution flags we're watching.\"Collagen eye patches and face masks at the Face Shop, which specializes in Korean beauty items, in San Francisco, April 15, 2015.Avila Gonzalez | San Francisco Chronicle | Hearst Newspapers | Getty ImagesRapid innovationK-beauty's staying power, Dang said, is rooted in an intensely competitive domestic Korean market. Trends move at breakneck speed and consumers spend more per capita on beauty than in any other country, according to South Korean research firm KOISRA.South Korea had more than 28,000 licensed cosmetics sellers in 2024 — nearly double that of five years ago — creating a pressure-cooker environment that forces constant experimentation, said Neogen's Kim.\"We develop about hundreds of formulas each day,\" Kim told CNBC. \"We build the library and we test results with clinical individual tests. ... Everything that's very unique and works really well for skin care, we develop.\"Korean consumers churn through trends quickly, fueling a pipeline of upstart brands that can go viral and, in some cases, get acquired. For example, when gooey snail mucin, a gel used to protect and repair people's skin, took off globally, skin care brand Amorepacific acquired COSRX, the small Korean brand that helped popularize the ingredient, for roughly $700 million.The next wave of products, analysts predict, are likely to be even more experimental. Brands are betting on buzzy ingredients such as DNA extracted from salmon or trout sperm that early research suggests may help calm or repair skin. They are also expanding into biotechnology.\"K-beauty is very data-driven. [Artificial intelligence] helps us get fast results for content, formula development, and advertising,\" Kim said. \"In Korea, they started talking about delivery systems. They're very good with biotechnology.\"watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok-fueled K-beauty boom triggers a retail race in the U.S.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108227539-1763484418622-gettyimages-1409521302-koreanbeauty0426161_cag.jpeg?v=1764272456&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T13:00:02.000Z",
      "dateModified": "2025-11-27T13:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Coffee hasn't been this expensive in decades—see how much prices have risen since 1985 in one chart",
    "url": "https://www.cnbc.com/2025/11/28/chart-how-much-coffee-prices-have-risen-since-1985.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232596-1764175769462-gettyimages-1469902811-dsc05727.jpeg?v=1764175839&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T14:30:01.000Z",
    "description": "Coffee prices were already rising following poor harvests last year when the U.S. added new tariffs on coffee imports in April. Those tariffs have sin",
    "body": "Coffee prices were already rising following poor harvests last year when the U.S. added new tariffs on coffee imports in April. Those tariffs have since been rolled back, but prices at grocery stores and cafés are still high, leaving many shoppers wondering why a simple cup of coffee costs so much.As of September, roasted coffee sold in stores cost about 41% more than it did 12 months prior, rising from an average of $6.47 to $9.14 per pound, according to the most recent Bureau of Labor Statistics data.While prices can swing by roughly a dollar within a year during volatile periods, the nearly $3 increase in the most recent BLS data is unusually steep — and consumers are taking notice.\"This is ridiculous,\" 52-year-old Chuck Smith said in a TikTok video in August in which he showed receipts for the 38.2-ounce tub of Maxwell House ground coffee he buys at his local Walmart in Indiana, which had nearly doubled in price to $21.44 in under a year.Smith says he filmed the clip spontaneously in the grocery aisle after noticing the price hike. \"It was just me in the moment,\" he told CNBC Make It, adding that the reaction \"captured what a lot of folks are feeling.\" Walmart and Kraft Heinz, the maker of Maxwell House, did not respond to requests for comment. Other brands, including Nespresso and Folgers, have also increased prices in the last year.Restaurant coffee prices have risen, too: The average cost of a regular cup increased from $3.46 to $3.57 in the year ending October 2025, according to restaurant and café price data tracked by menu software company Toast.What's behind the biggest coffee price spike in decadesThe run-up in average retail coffee prices has been the steepest and most sustained since BLS began tracking those prices in 1980, the data shows.Weather issues came first. Drought and heavy rain disrupted harvests in Brazil and Vietnam in 2024, tightening supply well before tariffs took effect.Coffee futures prices then climbed from roughly $2 a pound in May 2024 to a peak of $4 by April 2025, one of the steepest increases the market has seen in decades, according to Intercontinental Exchange data. Because futures serve as the benchmark for what importers and roasters pay for beans, sharp increases often lead to higher costs, which may eventually show up in retail prices.Tariffs are another factor. In April, the U.S. imposed new tariffs on coffee imports — 10% on key coffee-growing Latin American countries and about 20% for Asian growers, with Brazil hit hardest at 50%. Since then, grocery-store coffee prices have risen about 21%, according to consumer price index data.In mid-November, the White House rolled back most of the new coffee tariffs, eliminating duties for nearly all producing countries except Brazil, which retained a 40% tariff. Last week, the administration removed the remaining 40% duty on Brazilian coffee as well, effectively ending tariffs on coffee imports from almost all major exporters.Because retail prices typically lag wholesale costs, it may take time before any easing shows up on store shelves. Still, removing tariffs should eventually help take some pressure off prices, according to the National Coffee Association, an industry trade group.\"Significant coffee price inflation has occurred during the time tariffs have been in place,\" a spokesperson for NCA tells CNBC Make It. \"Removing tariffs on the world's leading coffee producing countries is expected to significantly decrease costs.\"Black Friday sale: Want to up your AI skills and be more productive? Get 25% off our most popular course of the year, How to Use AI to Be More Successful at Work, with coupon code GETSMART. Offer valid Nov. 17 through Dec. 5, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Coffee hasn't been this expensive in decades—see how much prices have risen since 1985 in one chart",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232596-1764175769462-gettyimages-1469902811-dsc05727.jpeg?v=1764175839&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T14:30:01.000Z",
      "dateModified": "2025-11-28T14:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "India economy grows at faster-than-expected 8.2% in September quarter even as tariffs bite",
    "url": "https://www.cnbc.com/2025/11/28/india-economy-gdp-grows-september-quarter-tariffs-bite-trade-us-modi.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107427679-1718187214637-gettyimages-2155629437-INDIA_MUMBAI.jpeg?v=1719377830&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T11:02:54.000Z",
    "description": "Hadynyah | E+ | Getty ImagesIn a quarter partially affected by the 50% U.S. tariffs, the Indian economy grew faster than expected at an annual rate of",
    "body": "Hadynyah | E+ | Getty ImagesIn a quarter partially affected by the 50% U.S. tariffs, the Indian economy grew faster than expected at an annual rate of 8.2% in the quarter ending in September.The growth was an acceleration from 7.8% in the previous quarter, when a lower deflator unexpectedly boosted real growth. A deflator measures how inflation affects the value of total output.A Reuters poll of economists had pegged the July-September gross domestic product at 7.3%.India's nominal GDP — which does not account for inflation or deflation — grew 8.7% in the September quarter compared to 8.8% in the previous quarter.The sharp improvement in GDP growth rate was on account of a pick up in manufacturing and construction activity and domestic consumption. Financial and real estate professional services have \"sustained a substantial growth rate\" of 10.2% in Jul-Sep, the government said in a release. watch nowDuring the September quarter, domestic consumption was \"held back\" ahead of the planned cuts to the goods and services tax, Neelkanth Mishra, chief economist at Axis Bank, told CNBC's \"Inside India\" before the release of the GDP data.The 50% tariffs on Indian goods exported to the U.S. took effect in August. To cushion the impact, New Delhi announced sweeping GST tax reductions effective Sept. 22 to boost domestic consumption.Demand picked up sharply in October, with record sales of autos and gold as the GST cuts and earlier reduction of the individual income tax rate lifted disposable incomes. Even so, India's goods trade deficit hit a new high on weak exports and higher gold imports.The International Monetary Fund, in a report on Wednesday, said India's real GDP is projected to grow 6.6% in fiscal 2026 before moderating to 6.2% in fiscal 2027, assuming a prolonged delay in a U.S.-India trade deal.It also forecasted India's merchandise exports to fall 5.8% in fiscal year 2026 to $416 billion, while goods imports are expected to rise 2.4% to $746 billion.\"Despite external headwinds, growth is expected to remain robust, supported by favorable domestic conditions,\" the IMF said in the release, with its data also suggesting that India will become a $5 trillion economy by fiscal year 2029.— CNBC's Amitoj Singh contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "India economy grows at faster-than-expected 8.2% in September quarter even as tariffs bite",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107427679-1718187214637-gettyimages-2155629437-INDIA_MUMBAI.jpeg?v=1719377830&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T11:02:54.000Z",
      "dateModified": "2025-11-28T11:02:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says U.S. to 'permanently pause migration from all Third World Countries’ after DC shooting",
    "url": "https://www.cnbc.com/2025/11/28/trump-us-to-permanently-pause-migration-from-all-third-world-countries.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108233241-1764307695737-gettyimages-2248193614-AFP_86EZ9GB.jpeg?v=1764307790&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T06:34:10.000Z",
    "description": "U.S. President Donald Trump shows a printed photo during a call with service members from his Mar-a-Lago residence in Palm Beach, Florida, on Nov. 27,",
    "body": "U.S. President Donald Trump shows a printed photo during a call with service members from his Mar-a-Lago residence in Palm Beach, Florida, on Nov. 27, 2025, during the Thanksgiving holiday. US President Donald Trump said Thursday that Sarah Beckstrom, one of the two National Guard troops shot a day earlier near the White House, had died, while the other soldier was \"fighting for his life.\"Jim Watson | Afp | Getty ImagesU.S. President Donald Trump on Thursday announced sweeping plans to tighten immigration rules, including a suspension on migration from \"Third World Countries\" and cancellation of all federal benefits and subsidies to \"noncitizens\" in the country.In a pair of Truth Social posts late Thursday night, Trump said he would \"permanently pause migration from all Third World Countries to allow the U.S. system to fully recover,\" without specifying what would be considered a \"third world\" country. The term loosely referred to countries with higher poverty rates and economic instability.The president said he would also terminate \"millions\" of admissions under his predecessor Joe Biden and remove \"anyone who is not a net asset to the United States, or is incapable of loving our Country.\"Trump added he plans to end all federal benefits and subsidies for noncitizens, \"denaturalize migrants who undermine domestic tranquility,\" and deport any foreign national he described as a \"public charge, security risk, or non-compatible with Western Civilization.\"Read more CNBC politics coverageJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'His comments came after two National Guard members were shot near the White House on Wednesday, one of whom died from her injuries a day later. Investigators said the attack was carried out by an Afghan national.Hours after the shooting, U.S. Citizenship and Immigration Services director Joseph Edlow said in a post on X that the agency would review every immigrant holding a Green Card from a \"country of concern.\"The agency also announced the immediate and indefinite suspension of all immigration requests involving Afghan nationals.Trump has pursued an aggressive immigration agenda since returning to the White House earlier this year. In June, he announced a broad travel ban covering immigrants from 19 countries, including Afghanistan.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says U.S. to 'permanently pause migration from all Third World Countries’ after DC shooting",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108233241-1764307695737-gettyimages-2248193614-AFP_86EZ9GB.jpeg?v=1764307790&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T06:34:10.000Z",
      "dateModified": "2025-11-28T06:34:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Switzerland has long welcomed the ultra wealthy. A referendum on a new tax has riled them up",
    "url": "https://www.cnbc.com/2025/11/28/swiss-voters-to-decide-on-inheritance-tax-rise-for-ultra-wealthy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/49174857-8_Switzerland.jpg?v=1350683010&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T14:18:15.000Z",
    "description": "Billionaire count: 57Total wealth: $125 billionKnown as the playground of the rich and famous, Switzerland is 8th in the global billionaire sweepstake",
    "body": "Billionaire count: 57Total wealth: $125 billionKnown as the playground of the rich and famous, Switzerland is 8th in the global billionaire sweepstakes and ranks 7th as the home of those worth $30 million and more, or the ultra-wealthy.Switzerland's billionaires represent the top one percent of its 5,597 ultra-wealthy population and control more than 19 percent of the total fortune of this group. On average, these billionaires are worth $2.2 billion each.Despite Europe as a whole seeing a declinPhoto: Ingolf Pompe | LOOK-fotoSwitzerland has long been a haven for the ultra rich. Its 300 wealthiest residents are worth a combined 850 billion Swiss Francs, or just over $1 trillion, according to business magazine Bilanz. But on Sunday, voters will go to the polls to vote on an inheritance tax that has riled them up. The proposal to tax every inheritance and gift of more than 50 million Swiss Francs at 50% is likely to be defeated. A recent poll put support at just 30%.watch nowBut close followers of the debate told CNBC the initiative has shaken wealthy individuals and family-owned companies since it was proposed in 2024. Swiss billionaire Peter Spuhler, founder and owner of Stadler Rail, has threatened to leave the country if the tax becomes law. He told told Swiss daily Tagesanzeiger that his family would struggle to pay such a tax as their wealth is tied up in companies.\"A lot of people who would be affected talked to their consultants and their tax lawyers, and they did the paperwork to be sure that this time of the year, a week before the final vote, they are ready to move out if necessary,\" Stefan Legge from the University of St. Gallen in Switzerland told CNBC on Friday.'The ultra wealthy are like queens on a chessboard'Legge, who conducted research into the potential impact of the tax, said: \"If you target the super wealthy, they are like queens on a chessboard.\" \"They are very mobile. They have tons of options to optimize their taxes,\" he added.Kurt Moosmann, president of the Swiss Single Family Office Association, told CNBC the proposal had caused \"a certain uncertainty among family offices and has kept foreign capital holders away from Switzerland.\"watch nowLegge said a 50% tax would likely lead to tax revenue falling. He said that around 2,000 people, or 0.3% of Switzerland's population, would be affected and they currently pay between 5 and 6 billion Swiss Francs a year.Powerful Swiss business lobby Economiesuisse has called talk of an inheritance tax a \"superfluous and damaging discussion\"\"We are dependent on good tax payers to finance our state,\" it warned.Legge said Switzerland faced competition from wealth centers in the Middle East and other countries in Europe, but added Switzerland was \"still very strong\" on \"finding the right balance between taxes and the right public services.\"watch nowWhen asked whether wealthy clients were scared, Giorgio Pradelli, CEO of Swiss private bank EFG International, told CNBC on Tuesday, \"If you look at the overall competitive landscape, Switzerland remains the No. 1 destination for international private banking and wealth management. We have an ecosystem that is super healthy and strong.\"The proposal came from the youth wing of the country's left-wing Social Democrats. If successful, money raised from the tax would fund policies to combat climate change.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Switzerland has long welcomed the ultra wealthy. A referendum on a new tax has riled them up",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/49174857-8_Switzerland.jpg?v=1350683010&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T14:18:15.000Z",
      "dateModified": "2025-11-28T14:18:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Putin breaks his silence on Ukraine peace plan, says Moscow ready for 'serious' talks",
    "url": "https://www.cnbc.com/2025/11/27/putin-moscow-ready-for-serious-talks-on-ukraine-peace-plan.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108233058-1764251945985-gettyimages-2248081649-AFP_86C62Q7.jpeg?v=1764252021&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T18:40:30.000Z",
    "description": "In this pool photograph distributed by the Russian state agency Sputnik, Russia's President Vladimir Putin attends a meeting of the Collective Securit",
    "body": "In this pool photograph distributed by the Russian state agency Sputnik, Russia's President Vladimir Putin attends a meeting of the Collective Security Treaty Organisation (CSTO) Heads of State Council at the Yntymak Ordo (Palace of Unity) presidential residence in Bishkek on November 27, 2025. Alexander Kazakov | Afp | Getty ImagesRussian President Vladimir Putin has broken his silence on a U.S.-backed peace plan to end the war in Ukraine, saying Moscow is ready for \"serious\" discussions about the draft proposals.Putin said Thursday that the outlines of a fledgling peace plan that has been reached by the U.S. and Ukraine could be the basis of a deal that ends the almost four-year long conflict.\"In general, we agree that this can be the basis for future agreements,\" Putin said in comments made during a trip to Kyrgyzstan and translated by Reuters.The president added that the U.S. appeared to be taking Russia's position on a peace settlement \"into account\" and that Moscow was ready for \"serious discussions\" when U.S. special envoy Steve Witkoff travels to Moscow next week for talks.It's the first time Putin has publicly addressed a peace plan since a flurry of diplomacy between the U.S. and Ukraine in the last few days. Those talks came after reports last week of a U.S.-Russia devised 28-point peace plan, which appeared to heavily favor Russia's demands.  Ukraine and its European allies' scrambled to mount a response, amending the plan and inserting counter proposals which were discussed in Geneva last weekend with a U.S. delegation led by U.S. Secretary of State Marco Rubio. All eyes on RussiaThe current draft plan, which has reportedly been slimmed down to 19 key proposals, appears to have received Ukraine's tentative backing, putting the ball back in Russia's court as to whether it could accept the framework and build upon it.On Wednesday, Putin's close aide Yuri Ushakov had claimed that Russia had not even seen an official version of the latest U.S.-backed draft deal for Ukraine, but that it had seen an unofficial version.Regarding the plan it had seen, Ushakov said the Kremlin viewed some aspects of the plan positively while \"several of its points require serious analysis.\"Sergei Ryabkov, Russia's deputy foreign minister, said Moscow welcomed U.S. efforts on peace proposals but said \"there are no concessions on key issues on the Ukraine settlement,\" suggesting there could be some distance to travel before a deal is actually reached. Putin's Press Secretary Dmitry Peskov warned on Wednesday against jumping to conclusions regarding an end to the war, which Russia launched when it invaded Ukraine in Feb. 2022.\"Wait. It's too early to say that,\" Peskov told reporters, state news agency TASS reported, when asked whether this was the closest Russia and Ukraine had ever been to concluding a peace agreement. Putin on Thursday praised Russian advances in Ukraine and told reporters that the fighting in Ukraine would stop only when Ukrainian troops withdraw from their positions in key areas. If they did not do so, then Russian forces would achieve their objectives by force, he added, appearing to suggest that Moscow was not willing to give up one of its key objectives in the war (and contained within the initial peace plan secretly drafted with the U.S.) which was to have full control of Ukraine's eastern Donbas region.CNBC has contacted the Kremlin for further comment and is awaiting a response.Ukraine on board, tentativelyMultiple outlets reported Tuesday that a Ukrainian delegation that had held talks with U.S. officials in Abu Dhabi on Tuesday appeared to tentatively support the basis of a U.S.-backed peace plan — though key details remained unresolved.ABC News and CBS News both reported an unnamed U.S. official had said that the Ukrainians \"have agreed\" to the deal, while adding there were still points that had to be ironed out. It was unclear if both stories quoted the same U.S. official.Ukraine President Volodymyr Zelenskyy said later Tuesday that Kyiv was ready to advance the peace framework, Reuters reported, citing a copy of a speech the president gave to a coalition of allied countries.U.S. President Donald Trump said at the White House on Tuesday, \"I think we're getting very close to a deal. We'll find out ... I think we're making progress.\"In a Truth Social post later Tuesday afternoon, Trump said, \"there are only a few remaining points of disagreement.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Putin breaks his silence on Ukraine peace plan, says Moscow ready for 'serious' talks",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108233058-1764251945985-gettyimages-2248081649-AFP_86C62Q7.jpeg?v=1764252021&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T18:40:30.000Z",
      "dateModified": "2025-11-27T18:40:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]