[
  {
    "title": "Giving kids investments this holiday season? 3 accounts that can help you maximize your money",
    "url": "https://www.cnbc.com/2025/12/17/how-to-gift-investments-to-children.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240757-1765476109344-gettyimages-1450616686-dsc08212.jpeg?v=1765476116&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T17:39:44.000Z",
    "description": "When buying holiday gifts for the children in your life this year, some experts say you may want to consider an additional gift, one that may last far",
    "body": "When buying holiday gifts for the children in your life this year, some experts say you may want to consider an additional gift, one that may last far longer than a new toy: an investment in the stock market.Giving investments can not only be a great way to start building savings for the child in your life, but it's a gift that can also help foster financial literacy, says Flavio Landivar, a certified financial planner and senior financial advisor at Evensky and Katz/Foldes Wealth Management in Coral Gables, Florida.\"Kids, even starting at age 4 to 7 years old, start understanding and can have some sort of conversations about money,\" Landivar says. Gifting a yearly investment \"can build a huge foundation for minors at any age.\"While most brokers require you to be 18 to buy and sell stock, parents, friends and other family members can open certain accounts on behalf of a minor. Before gifting, experts say to consider how much you can comfortably give, the tax rules involved and which account best fits your needs.How much to giftThe amount you choose to give should depend on your comfort level, Landivar says. In 2025 and 2026, the IRS allows you to gift up to $19,000 per recipient annually tax-free without using any of your allotted lifetime gift and estate tax exemption.You don't necessarily need to spend additional money either — you can gift an investment you already own, says Ashton Lawrence, a CFP and director and senior wealth advisor at Mariner Wealth Advisors in Greenville, South Carolina.\"You might want to start looking at what positions in your portfolio have large unrealized gains that you then can give off to someone else who might be at a lower tax bracket,\" Lawrence says. \"If they do happen to sell it, at least less is going to Uncle Sam than if you were to sell it.\"What types of investments to giftLandivar recommends giving broad-based index funds that track the S&P 500 or total stock market because of their low costs and long-term growth potential.\"We don't need to know which will be the best [performing] company in the future, because it's impossible to do that,\" Landivar says. \"Rather, we want to be able to participate in that growth in a general sense.\"Giving individual shares of a company may be valuable as well, Lawrence says — especially if it's a company they recognize like Walmart or Disney. Familiar brands make the concept of ownership more tangible for younger kids, and Lawrence says that can make a gift more exciting and help connect abstract financial ideas to businesses they already understand.However, if you decide to do this, use it as a teaching moment on the basics of stock ownership instead of tying the asset to performance, Lawrence says. 3 accounts you can use to gift an investment to a minor There are various types of investment accounts you can open on behalf of a child. To determine which one makes the most sense for you, experts say you can consult a trusted financial professional who can make personalized recommendations for your individual situation.Here are three available options and an overview of each's advantages.Custodial accountLandivar says the easiest way to get started is with a custodial account under the Uniform Gifts to Minors Act or Uniform Transfers to Minors Act. UGMAs and UTMAs are financial accounts adults can open and manage for a minor. When the child turns 18 or 21, depending on the state, full control of the account transfers to the beneficiary. The custodian manages the investments like a normal brokerage account, and the funds can be invested in stocks, bonds or other assets. UTMA accounts can hold a wider variety of assets including property, while UGMA accounts mainly hold cash and marketable securities.Although you may seed these accounts with gifts, once they start earning interest, capital gains and dividends, that unearned income is subject to kiddie tax rules. The first $1,350 of unearned income is tax-free. From there, it's taxed at the child's tax rate until it exceeds $2,700. At that point, the excess is typically taxed at the parent's tax rate, according to the IRS.529 planIf you want your gift to go specifically toward higher education, investing money in a 529 college savings account may be more advantageous from a tax perspective than a custodial account, Lawrence says.\"College isn't cheap; expenses are constantly going up,\" Lawrence says. \"529s are a great way to make those donations and save.\"A 529 account is a state-sponsored, tax-advantaged savings plan designed to help families pay for education. Anyone can open one and name a beneficiary — typically a child, grandchild or even yourself — with no income limits on contributors.Contributions are made with after-tax income, and the money grows tax deferred. Money can be withdrawn tax-free for qualified education expenses, including tuition, fees, books, supplies, required technology and room and board for eligible programs. These funds can be used for certain K-12 education expenses as well, such as tuition at eligible elementary or secondary schools.Remaining funds can be rolled into a Roth individual retirement account, transferred to another family member, used for student loan repayment or withdrawn outright. Some of these options are subject to specific rules and lifetime or annual limits, and taxes and penalties may apply if the money isn't used for qualified education expenses.Roth IRAIf your child has earned income — such as wages from an after school or summer job — Lawrence says contributing your gift toward a Roth IRA for them may be the most advantageous for the tax-free growth and future flexibility. A Roth IRA is a retirement account where you contribute money that has already been taxed. Once in the account, contributions grow tax-free and withdrawals made after age 59½ are generally tax-free. If opening an account for a minor, the account must be in the child's name, and typically a parent or guardian helps open and manage it until they are of age.Contributions, but not earnings, can be withdrawn at any time without taxes or penalties, making the account somewhat flexible. However, there are limits to how much you can contribute to a Roth IRA. The contribution limit is the lesser of the child's earned income or $7,000 in 2025 and $7,500 in 2026. \"When they do start pulling out from [a Roth IRA] later in life, in their retirement years, that's going to be huge for them,\" Lawrence says. \"You're not getting that same tax-free growth inside those custodial accounts.\"Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future. Use coupon code EARLYBIRD for 30% off. Offer valid from Dec. 8 to Dec. 22, 2025. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giving kids investments this holiday season? 3 accounts that can help you maximize your money",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240757-1765476109344-gettyimages-1450616686-dsc08212.jpeg?v=1765476116&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T17:39:44.000Z",
      "dateModified": "2025-12-17T17:39:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Travelers say these are the best U.S. airlines for on-time flights, customer satisfaction and more ",
    "url": "https://www.cnbc.com/2025/12/17/new-survey-travelers-say-these-are-the-best-us-airlines.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108015738-1722617710833-gettyimages-1534504690-funsobagonplane.jpeg?v=1729022914&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T17:50:49.000Z",
    "description": "In November, AirHelp, a service that helps airline passengers claim compensation for flight disruptions, released its annual ranking of the best U.S. ",
    "body": "In November, AirHelp, a service that helps airline passengers claim compensation for flight disruptions, released its annual ranking of the best U.S. airlines. To determine the ranking, the organization looked at on-time performance, claim processing and customer experience — analyzing data from October 1, 2024 to September 30, 2025. Each airline was given a score out of 10.According to the report, AirHelp considered an on-time flight to be \"any flight that arrived within 15 minutes of its published arrival time.\" For claim processing, the organization assessed each airline based on how they treat their customers when things go wrong. And for the customer experience category, passengers were asked to give their opinion on five factors: cabin crew, aircraft comfort, aircraft cleanliness, food and entertainment.To ensure AirHelp's database ranks among the most accurate available, the company says they cross-reference their statistics with a variety of sources, including airport databanks, flight-tracking vendors, and government agencies. 2025 was a challenging year for U.S. airlines, Eric Napoli, Chief Legal Officer at AirHelp, tells CNBC Make It. The government shutdown that lasted a little over a month, had a significant impact on air traffic and travel, he says.For example, on-time performance really took a hit, he says: \"We saw that operational challenge this year.\"According to Napoli, American, United, and Delta work fairly well with AirHelp to make sure that customers who file claims — flight cancellations, lost baggage — get paid. But it's still an area they can improve in, he adds. \"Different airlines have their own operational modes but with claims processing, they should make it less difficult for customers to actually claim what's due to them under law,\" he says.American Airlines is the best U.S. airline for on-time performance, customer satisfaction and moreWith a score of 7.64, American Airlines is the best U.S. airline, AirHelp says. On the company's global ranking, American Airlines came in at No. 11. The airline had a score of 7.1 for on-time performance, 8 for customer opinion and 7.8 for claim processing. Napoli says that American Airlines beat out both United Airlines and Delta Air Lines because it was better in one key category. \"They weren't as efficient and quick in claims processing as they were before, but they did outdo United Airlines,\" he says. \"They were able to get passengers their compensation quicker.\" American AirlinesGrant Baldwin | Getty ImagesAmerican is one of the world's largest airlines. It serves more than 300 destinations and operates a fleet of over 900 aircraft. The airline was a pioneer in loyalty programs, launching its frequent flyer program in 1979. American Airlines is also a founding member of the Oneworld alliance, which includes other partner airlines worldwide like British Airways, and Qatar Airways.The best U.S. airlines for on-time performance and moreAmerican Airlines – 7.64United Airlines – 7.54Delta Airlines – 7.46Frontier Airlines – 7.07Hawaiian Airlines –  6.73Southwest – 6.68Alaska Airlines – 5.95JetBlue – 5.31United Airlines is the No. 2 U.S. airline, according to AirHelp. It received a score of 7.54 and took 13th place in the global ranking. It got a score of 7.4 for on-time performance, 8.1 for customer opinion and 7.2 for claim processing. Napoli says United performed better than the rest in on-time performance and customer opinion, but ultimately fell short in the claim processing category.  United AirlinesBloomberg | Bloomberg | Getty ImagesUnited Airlines serves more than 350 destinations and is part of the Star Alliance. The global partnership includes other carriers like Lufthansa and Air Canada. In 2025, United added routes from Newark, New Jersey, and Tokyo, Japan, to new destinations like Nuuk, Greenland; Palermo, Italy and Ulaanbaatar, Mongolia, bringing its total international destinations served to 147, according to Britannica. Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future. Use coupon code EARLYBIRD for 30% off. Offer valid from Dec. 8 to Dec. 22, 2025. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Travelers say these are the best U.S. airlines for on-time flights, customer satisfaction and more ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108015738-1722617710833-gettyimages-1534504690-funsobagonplane.jpeg?v=1729022914&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T17:50:49.000Z",
      "dateModified": "2025-12-17T17:50:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These are Americans' 3 biggest financial regrets in 2025: 'People are feeling trapped'",
    "url": "https://www.cnbc.com/2025/12/17/americans-biggest-financial-regrets.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242043-1765828267587-gettyimages-1076802112-_smc9366gi.jpeg?v=1765828277&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T17:38:37.000Z",
    "description": "Many Americans are looking back on 2025 with regrets about money. Nearly 40% of adults say their biggest financial regret from this year is not saving",
    "body": "Many Americans are looking back on 2025 with regrets about money. Nearly 40% of adults say their biggest financial regret from this year is not saving enough money, according to a new survey of over 1,000 U.S. adults by Intuit Credit Karma. These are the three most common financial regrets from 2025:Not saving enough: 38%Emotional or impulse spending: 28% Too much credit card debt: 21%It's been a year of major economic events, including President Donald Trump's tariff agenda, Federal Reserve rate cuts, a record-long government shutdown and rising unemployment. And 2 in 3 survey respondents say macroeconomic conditions like inflation and tariffs impacted their spending habits.\"People are feeling [the stress] very deeply in 2025 and there are not signs of that letting up as we look forward into the new year,\" Courtney Alev, consumer financial advocate at Intuit Credit Karma, tells CNBC Make It.Around 73% of Americans say they are saving less for emergencies due to factors like rising prices and elevated interest rates, a recent Bankrate survey found. Additionally, around 24% of households report living paycheck to paycheck in 2025, up slightly from 2024, according to Bank of America Institute research. \"People are feeling trapped,\" says Joey Khoury, senior wealth advisor and partner at Mission Wealth. At the same time, the No. 1 habit Americans say they want to break in the new year is impulse buying, Credit Karma found, with 38% of respondents saying they want to curb the practice.Here's how experts say Americans can recover from their financial regrets and build better habits in 2026.Don't 'bury your head in the sand'One of the first steps to saving more is knowing your numbers — exactly how much money you bring in each month and how much you need to spend on essentials, Alev says. As a place to start, she suggests listing out your specific monthly bills and expenses, as well as your optional costs.\"Just seeing everything in one place brings clarity and calm, even if your situation isn't where you want it to be, at least then, you know,\" she says.Khoury agrees. \"I can always tell who's on top of their finances by asking them, what's their monthly spend rate and what's their savings rate,\" he says. \"It doesn't matter what the savings rate is. If it's low, if it's high, it doesn't matter. But the folks that know that are the folks that are paying attention.\"And paying attention is key, he adds. \"A lot of people would rather bury their head in the sand,\" because dealing with your finances can be stressful and accomplishing your goals will likely take time. Plus, the broader economic conditions out of your control may make saving more or paying off your debt increasingly difficult. \"But not paying attention to it only exacerbates the problem,\" Khoury says.'Automation is key'Another reason individuals may wind up ignoring their finances is if they figured out their spend rate once, but never updated it to factor in ongoing changes, like inflation, Khoury says.He recommends using a budgeting app or similar tool to automatically track your spending and make it easier to see where your money is going and how much you're spending in various categories. Over time, you'll be able to see if price increases or impulse buys are impacting your overall spending.\"Automation is key,\" Khoury says. \"You must automate as much of your budgeting as possible, because you're never going to sit down and comb through it on a regular frequency.\"From there, you'll be much better positioned to find areas where you can cut back, he says.Turn 'goals into systems'Alev recommends setting specific saving or spending goals and starting with \"one key priority.\" That could be maintaining your current credit card balance for a time period if paying it off entirely is too big of a goal or setting up automatic transfers to your savings account, even if it's a small amount, she says. \"It is so easy to just get paralyzed with overwhelm when you start thinking about all of the different ways that you could go to improve your financial situation, and that can really lead to you not making progress,\" she says. \"Turn those goals into systems and specific habits because that's what's gonna actually make that change stick.\" Want to give your kids the ultimate advantage? Sign up for CNBC's new online course, How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future. Use coupon code EARLYBIRD for 30% off. Offer valid from Dec. 8 to Dec. 22, 2025. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These are Americans' 3 biggest financial regrets in 2025: 'People are feeling trapped'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242043-1765828267587-gettyimages-1076802112-_smc9366gi.jpeg?v=1765828277&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T17:38:37.000Z",
      "dateModified": "2025-12-17T17:38:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three holds and a cut? Europe's central banks are about to make their final calls of 2025",
    "url": "https://www.cnbc.com/2025/12/17/ecb-boe-riksbank-and-norges-bank-make-final-calls-of-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108154316-1749022483174-gettyimages-2213568827-GERMANY_ECB.jpeg?v=1752825360&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T14:10:04.000Z",
    "description": "A projected illumination marking the 75th anniversary of the Schuman Declaration, on the Grossmarkthalle building at the European Central Bank headqua",
    "body": "A projected illumination marking the 75th anniversary of the Schuman Declaration, on the Grossmarkthalle building at the European Central Bank headquarters in Frankfurt, Germany, on May 9, 2025.Alex Kraus/Bloomberg via Getty ImagesInvestors are gearing up for the last interest-rate decisions of 2025, with four of Europe's central banks announcing their monetary policies and macroeconomic outlooks on Thursday.The European Central Bank, Bank of England, Riksbank, and Norges Bank are all meeting, but only one of them is expected to change its rate. This is what to expect:European Central BankThe ECB is expected to keep rates on hold, with recent economic data not pointing to an adjustment.But investors will be more interested in any commentary on the apparent growing tensions inside the governing council, with some members, like Isabel Schnabel, openly endorsing the market's view that the next rate move will be a hike, while others think there is still room to cut. Christian Kopf, who heads the bond portfolio management of German asset manager Union Investment, told CNBC: \"I don't expect and rate change in the Euro area for the time being. If there is a change in 2026, most likely we will get a rate hike towards the end of 2026 or at the beginning of 2027.\"The ECB is expected to hike its growth outlook for the Eurozone when publishing its new round of staff projections, its in-house economic forecasts.CNBC will be covering the ECB's monetary policy decision from 1 p.m. London time, with guests including   Lorenzo Codogno, founder of Lorenzo Codogno Macro Advisors, and Al Cattermole, Fixed Income portfolio manager at Mirabaud Asset Management.Norges BankNorway's central bank is widely expected to keep rates on hold at 4% on Thursday, with economists suggesting the next rate cut might not come until summer 2026. Norges Bank announces its policy decision at 10 a.m. local time, 9 a.m. London time.Morten Lund, Scandinavia chief economist at JPMorgan, commented that the bank's guidance on Thursday \"should be a push-back against markets' rising expectations\" that it will cut rates in March, which he said was currently seen as \"a coin toss.\"Norges BankTomm W. Christiansen | Bloomberg | Getty ImagesInstead, JPMorgan expects a rate cut to next take place in June, although Norges Bank was unlikely to be explicit about the timing of a cut.\"Forward guidance should remain vague, stating that 'if the economy evolves broadly as currently projected, the policy rate will be reduced further in the course of the coming year'. We also think that the Governor will say that inflation remains too high and repeat the sentence that \"we are not in a hurry to reduce the policy rate',\" Lund added. CNBC will be interviewing Ida Wolden Bache, the governor of Norges Bank, at 12.10 p.m. London time, 1.10 p.m. CET. Riksbank Sweden's central bank is expected to keep its key policy rate unchanged at 1.75% when it announces its decision at 9.30 a.m. CET, 8.30 a.m. London time.No change is likely in the coming quarters either, according to Franziska Fischer at UBS Investment Bank, who said that the Riksbank's easing cycle was over.The Swedish flag hangs on the country's central bank.Bloomberg / Contributor / Getty Images\"The Riksbank cut the policy rate by 25 basis points in September but remained on hold in November, while signalling that the policy rate will likely remain unchanged 'for some time to come',\" Fischer said.Developments since November do not warrant a change to the rate outlook, in UBS' view, he added. CNBC will be interviewing Erik Thedeen, Riksbank governor, on Thursday at 1.20 p.m. CET, 12:20 p.m. London time. Bank of England The Bank of England is the only central bank that's expected to cut interest rates on Thursday, with a small majority of the bank's nine-member monetary policy committee (MPC) expected to opt for a 25 basis points cut, bringing the base rate down to 3.75%.Expectations of a cut rose after the latest inflation data showed it fell sharply to 3.2% in November, and recent downbeat economic data in the U.K., ranging from somber growth figures to an uptick in unemployment.  A decorated Christmas tree outside The Royal Exchange near the Bank of England (BOE) in the City of London, UK, on Monday, Dec. 16, 2024. The British central bank is expected to leave rates unchanged at 4.75% at its meeting on Thursday and maintain its guidance that a \"gradual approach to removing policy restraint remains appropriate.\" Photographer: Jason Alden/Bloomberg via Getty ImagesBloomberg | Bloomberg | Getty ImagesWhile inflation remains above the bank's 2% target, the trend downwards gives the bank room for manoeuvre when it comes to lowering interest rates to stimulate the economy, consumption and borrowing. The government's Autumn Budget last month was also seen as disinflationary, given it included measures to lower energy bills and freeze fuel duty and train fares.CNBC's \"Decision Time\" program at 12 p.m. London time for live coverage of the BOE's decision. Karen Tso will be joined in the studio by Jack Meaning, U.K. chief economist at Barclays, on what the decision means for the economy, markets and consumers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three holds and a cut? Europe's central banks are about to make their final calls of 2025",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108154316-1749022483174-gettyimages-2213568827-GERMANY_ECB.jpeg?v=1752825360&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T14:10:04.000Z",
      "dateModified": "2025-12-17T14:10:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump vowed to block tankers carrying Venezuela's oil — nearly a dozen are at sea right now",
    "url": "https://www.cnbc.com/2025/12/17/trump-venezuela-tankers-oil.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240057-1765392638190-gettyimages-2248656870-VENEZUELA_AIRSPACE.jpeg?v=1765991656&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T18:23:15.000Z",
    "description": "A U.S. military helicopter flies near an oil tanker during a raid described by U.S. Attorney General Pam Bondi as its seizure by the United States off",
    "body": "A U.S. military helicopter flies near an oil tanker during a raid described by U.S. Attorney General Pam Bondi as its seizure by the United States off the coast of Venezuela, Dec. 10, 2025, in a still image from video. U.S. Attorney General | Via ReutersAt least 34 U.S.-sanctioned oil tankers with a history of carrying Venezuelan oil are currently at sea in the Caribbean, according to a new analysis obtained by CNBC on Wednesday.And at least 12 of those tankers appear to be filled with crude oil from Venezuela, according to vessel location data from Kpler, a global trade intelligence company. One of the tankers, Skipper, was seized by the U.S. forces in the Caribbean last week and was being taken to the United States.Kpler provided the analysis a day after President Donald Trump vowed to impose a \"complete and total blockade\" on sanctioned oil tankers moving in and out of Venezuela. Trump also deemed the nation's ruling Maduro regime a foreign terrorist organization.The U.S. is expected to block only sanctioned tankers carrying oil from Venezuela, not similar vessels that have other nations' crude, including oil from Iran and Russia, according to Kpler.\"In light of President Trump's recent announcement, these tankers may be exposed to heightened scrutiny and potential enforcement actions by U.S. authorities,\" Dimitris Ampatzidis, senior risk and compliance Analyst at Kpler, told CNBC.In a separate report to clients on Wednesday, Kpler said that a blockade of Venezuelan oil should not lead to higher crude prices.Location of U.S. sanctioned Venezuelan Tankers. Green colored are tankers filled with Venezuelan oil, Orange colored are the empty tankers.Kpler\"The move has so far failed to provide a meaningful boost to oil prices or to overturn underlying fundamentals, largely because the market is two-tiered and even the sanctioned segment remains crowded,\" Kpler's report said.Oil prices rallied by nearly 2% on Wednesday.Chevron is the only company authorized by the United States to carry Venezuelan crude to the U.S.\"Oil bound for the US under Chevron's license could continue to flow,\" Kpler's report said.\"This suggests that Venezuelan supply to sanctioned markets would be disrupted, while volumes destined for the US would remain intact, with China- and Cuba-bound cargoes bearing the brunt of the impact.\"Besides Skipper, the 11 sanctioned tankers that appear to be carrying Venezuelan crude are Star Twinkle 6, Hyperion, Boceanica, Lydya N, Bandra, Soldier, Avril, Phenix VI, Manuela Saenz, Dianchi and Baisha.\"In recent years, some of these vessels engaged in so-called AIS spoofing to obscure their locations,\" said Matt Smith, head U.S. analyst for Kpler. \"With their AIS switched off, the real location of certain vessels was hidden, and while dark, there were multiple ship-to-ship transfers of cargo.\"Track of the 12 U.S.-sanctioned Venezuelan tankers in 2025MarineTrafficVenezuela has produced around 900,000 barrels of crude oil and condensate so far in 2025, accounting for roughly 1% of the total global supply. Kpler data indicates China buys about 76% of Venezuela's output.The U.S. has imported around 17% of Venezuela's output in 2025. That is about half of the percentage of output imported in 2024. Cuba, Spain and Italy are the other significant customers of Venezuela's oil.\"Cargoes bound for the US are expected to remain intact, while China and Cuba are likely to seek substitutes from Russia and Iran,\" Kpler's report noted.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump vowed to block tankers carrying Venezuela's oil — nearly a dozen are at sea right now",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240057-1765392638190-gettyimages-2248656870-VENEZUELA_AIRSPACE.jpeg?v=1765991656&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T18:23:15.000Z",
      "dateModified": "2025-12-17T18:23:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tricolor CEO received a $6.25 million bonus weeks before company’s bankruptcy, prosecutors say",
    "url": "https://www.cnbc.com/2025/12/17/tricolor-ceo-bonus-bankruptcy-indictment.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242891-1765977615868-gettyimages-2234195958-TRICOLOR_LENDER.jpeg?v=1765996700&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T18:49:59.000Z",
    "description": "Mexican and American flags attached to vehicles at a Tricolor dealership in Houston, Texas, Sept. 11, 2025.Mark Felix | Bloomberg | Getty ImagesThe CE",
    "body": "Mexican and American flags attached to vehicles at a Tricolor dealership in Houston, Texas, Sept. 11, 2025.Mark Felix | Bloomberg | Getty ImagesThe CEO of subprime auto firm Tricolor directed a deputy to send him $6.25 million in bonuses in August as fraudulent schemes propping up the company unraveled, U.S. prosecutors alleged.Daniel Chu, the CEO and founder of Tricolor, told Chief Financial Officer Jerome Kollar to send the final two payments of his $15 million annual bonus on Aug. 19 and 20, according to a federal indictment unsealed on Wednesday.Chu, who is accused of engaging in \"systemic fraud\" over roughly seven years through 2025, used some of the money to buy a \"multimillion-dollar property\" in Beverly Hills, California, later that month, according to the filing.Within days of Chu's bonus payments, Tricolor put more than 1,000 employees on unpaid leaves of absence. By Sept. 10, the company filed for bankruptcy protection.Lawyers representing Chu didn't immediately respond to emails requesting comment on the allegations.Prosecutors say Tricolor created about $800 million in \"bogus collateral\" — at Chu's direction — by double-pledging the same assets for multiple loans and by having employees manually alter records to make delinquent loans appear eligible as collateral, according to the indictment. The abrupt collapse of Tricolor was one of a string of defaults that churned the U.S. banking industry this fall, sparking concerns over underappreciated risks in the American financial system.Around the time of the bonus payments, Chu allegedly knew his company was, in his own words, \"basically history,\" according to the filing.Prosecutors cited \"secretly recorded\" calls in August that included Chu, his CFO and chief operating officer where the founder cast about for ways to keep the company's lenders at bay.While the indictment didn't name the banks that Tricolor allegedly defrauded, JPMorgan Chase, Barclays and Fifth Third Bank have disclosed charges tied to the borrower.After Tricolor's lenders confronted Chu over questions about collateral pledged for loans, the CEO proposed a lie that some of the manipulated data was tied to a Trump administration loan deferment program, according to the indictment. He then considered another tactic: blaming the banks for ignoring red flags as a way to extract a settlement and keep his company alive, prosecutors said.In doing so, Chu allegedly compared Tricolor with Enron, the energy company that collapsed in 2001 after the discovery of accounting fraud.\"Enron obviously has a nice ring to it, right?\" Chu said, according to the documents. \"I mean, Enron, Enron raises the blood pressure of the lender when they see that.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tricolor CEO received a $6.25 million bonus weeks before company’s bankruptcy, prosecutors say",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242891-1765977615868-gettyimages-2234195958-TRICOLOR_LENDER.jpeg?v=1765996700&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T18:49:59.000Z",
      "dateModified": "2025-12-17T18:49:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kushner's Affinity Partners exits Paramount bid for Warner Bros. Discovery",
    "url": "https://www.cnbc.com/2025/12/16/kushner-affinity-paramount-wbd-netflix.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242653-1765921187393-gettyimages-2200881510-jr_15153_jhap8j8r.jpeg?v=1765921217&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T22:20:54.000Z",
    "description": "Jared Kushner, Founder & CEO, Affinity Partners, speaks during the second day of the FII PRIORITY Summit held at the Faena Hotel on Feb. 20, 2025 in M",
    "body": "Jared Kushner, Founder & CEO, Affinity Partners, speaks during the second day of the FII PRIORITY Summit held at the Faena Hotel on Feb. 20, 2025 in Miami Beach, Florida.Joe Raedle | Getty ImagesJared Kushner's firm Affinity Partners has dropped out of Paramount Skydance's hostile takeover bid for Warner Bros. Discovery.\"With ​two ​strong competitors ​vying to secure ​the future ​of this ​unique American ​asset, ​Affinity ​has ​decided no longer to pursue ​the opportunity,\" an Affinity spokesperson said in a statement.\"The dynamics ​of the investment have changed significantly ​since we initially became ​involved ​in October,\" the spokesperson said. \"We ​continue to ​believe ​there is a strong strategic rationale for Paramount's offer.\"Kushner is the son-in-law of President Donald Trump.Affinity's role in Paramount's hostile bid came to light on Dec. 8, when Paramount announced an all-cash, $30 per share offer for all of WBC. The offer came days after streaming giant Netflix said it had reached a deal to buy WBD's film studio and streaming service HBO Max. Warner Bros. plans to spin out Discovery Global, which includes a large portfolio of pay TV networks, including CNN and TNT.Trump last week said Netflix's proposed deal, which requires regulatory approval, \"could be a problem\" because of how much market share Netflix would end up with.Trump said he will be involved in the process of approving the deal.The WB water tower is seen at Warner Bros. Studios in Burbank, California on Dec. 5, 2025.Patrick T. Fallon | AFP | Getty ImagesThe monetary value of Affinity's role in Paramount's bid was not disclosed in a filing last week with the Securities and Exchange Commission by Paramount.However, that SEC filing said that in addition to commitments from Affinity and RedBird Capital Partners, there was a $1 billion commitment from Tencent, and an \"aggregate $24 billion commitment from three sovereign wealth funds from\" the Gulf states of Saudi Arabia, Qatar, and Abu Dhabi.CNBC has asked Affinity about the status of the Gulf states' commitment in light of Affinity's withdrawal from the bid.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kushner's Affinity Partners exits Paramount bid for Warner Bros. Discovery",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242653-1765921187393-gettyimages-2200881510-jr_15153_jhap8j8r.jpeg?v=1765921217&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T22:20:54.000Z",
      "dateModified": "2025-12-16T22:20:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump to tout accomplishments in address to nation on Wednesday, White House says",
    "url": "https://www.cnbc.com/2025/12/16/-trump-address.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242072-17658303802025-12-15t202502z_1577622234_rc28hiadvy3x_rtrmadp_0_usa-trump.jpeg?v=1765830406&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T20:04:43.000Z",
    "description": "U.S. President Donald Trump speaks during a Mexican Border Defense Medal presentation in the Oval Office at the White House in Washington, D.C., U.S.,",
    "body": "U.S. President Donald Trump speaks during a Mexican Border Defense Medal presentation in the Oval Office at the White House in Washington, D.C., U.S., Dec. 15, 2025. Evelyn Hockstein | ReutersPresident Donald Trump said he will deliver a live address to the nation from the White House on Wednesday night.\"It has been a great year for our Country, and THE BEST IS YET TO COME!\" the president posted on Truth Social on Tuesday. The address is slated for 9 p.m. ET, the post said. \"I look forward to 'seeing' you then,\" Trump wrote.White House press secretary Karoline Leavitt said that Trump would tout the president's accomplishments from his first 11 months in office as well as plans to \"continue delivering for the American people over the next three years.\"\"It's going to be a really good speech,\" Leavitt told reporters at the White House. \"He's going to talk a lot about the accomplishments over the past 11 months. All that he's done to bring our country back to greatness.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump to tout accomplishments in address to nation on Wednesday, White House says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242072-17658303802025-12-15t202502z_1577622234_rc28hiadvy3x_rtrmadp_0_usa-trump.jpeg?v=1765830406&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T20:04:43.000Z",
      "dateModified": "2025-12-16T20:04:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prediction markets could hit a trillion dollars in trading volume by the end of this decade, new report says",
    "url": "https://www.cnbc.com/2025/12/17/prediction-markets-trillion-dollar-trading-volume-ek-report.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108208885-1759852785711-108208885-1759852672154-dsc_6020.jpg?v=1759852830&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T19:02:20.000Z",
    "description": "Polymarket banner outside the New York Stock Exchange on Oct. 7th, 2025.Kevin Stankiewicz | CNBCPrediction markets could reach a trillion dollars in a",
    "body": "Polymarket banner outside the New York Stock Exchange on Oct. 7th, 2025.Kevin Stankiewicz | CNBCPrediction markets could reach a trillion dollars in annual trading volume by the end of this decade, according to a new report from Eilers & Krejcik, a research firm that specializes in sports and interactive gaming sectors.  \"Numerous factors, most notably legal and regulatory challenges, could delay or derail the growth of prediction markets,\" Eilers & Krejcik partner emeritus and strategic advisor Chris Grove told CNBC. \"But the fundamental elements of consumer demand and an array of diverse brands looking to meet that demand are clearly in place.\"That growth will be fueled by sports, which E&K predicts will represent 44% of the long-run volume for prediction markets. The booming predictions space allows users to wager on events in culture, politics and sports, among other markets. A rise in popularity for platforms like Polymarket and Kalshi has inspired traditional sportsbooks to launch their own predictions platforms. Comparing prediction trading volume to sportsbooks handle, or amount wagered, is complicated, because in prediction markets both sides of the trade are counted as volume.  For instance, if someone buys a 40-cent contract, and someone else takes the 60-cent position — that's a dollar in trading volume. In sports betting, a dollar bet is strictly a dollar in handle.E&K crafted a formula to translate predictions volume into handle and concluded that mature sports prediction markets could support sportsbook-style handle that's roughly 60% to 80% of today's licensed regulated online sports betting market.Of course, online sports betting is legal only in 31 states; prediction markets have launched in all 50.   Robinhood this week introduced additional prediction markets features that allow users to trade NFL parlay and prop bets.\"The sportsbooks definitely see the writing on the wall and how this could completely disrupt their business,\" CEO Vlad Tenev told CNBC Wednesday. watch nowFanatics, in partnership with Crypto.com, launched Fanatics Markets at the beginning of December to offer predictions trades. DraftKings and FanDuel are expected to launch their own prediction platforms by the end of the month.  Right now, platforms like Kalshi, Robinhood, Crypto.com, Polymarket and Fanatics are pulling in roughly $10 billion, according to an analysis this week from Citizens. But analysts note, \"Prediction markets are in the early innings of exponential scaling as the asset class transitions from speculation to a more mature component of capital markets, with institutions likely coming next.\"Tenev said it more plainly: \"We think we're in the early stages of a prediction market supercycle.\"As the markets mature, the cross-selling to prediction customers is likely to diverge. After all, the way FanDuel coaxes a prediction customer onto its online sportsbook or icasino will look very different from Robinhood working to persuade a predictions trader to try trading equities.  Still, a broader trend is emerging: the convergence of investing and gambling. \"There's always been some overlap between the two, but we appear to be living in a world where gambling is become more like investing just as investing is pushing further and further in the direction of gambling,\" Grove said. Disclosure: CNBC and Kalshi have a business relationship. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prediction markets could hit a trillion dollars in trading volume by the end of this decade, new report says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108208885-1759852785711-108208885-1759852672154-dsc_6020.jpg?v=1759852830&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T19:02:20.000Z",
      "dateModified": "2025-12-17T19:02:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oil rebounds from lowest levels since 2021 after Trump orders Venezuela oil tanker blockade",
    "url": "https://www.cnbc.com/2025/12/17/crude-oil-prices-today.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242749-1765935288246-gettyimages-1204043834-20200130-_img9841editchinaface.jpeg?v=1765976980&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T18:53:00.000Z",
    "description": "U.S. crude futures rose more than 1% Wednesday as Trump ordered \"a total and complete\" block of all sanctioned oil tankers entering and leaving Venezu",
    "body": "U.S. crude futures rose more than 1% Wednesday as Trump ordered \"a total and complete\" block of all sanctioned oil tankers entering and leaving Venezuela.Chinaface | E+ | Getty ImagesCrude oil prices bounced back from near four-year lows Wednesday, after President Donald Trump said the U.S. will block sanctioned tankers from entering and leaving Venezuela.U.S. crude oil rose 80 cents, or 1.45%, to $56.07 per barrel by 1:52 p.m. ET. Global benchmark Brent was trading at $59.82, up 90 cents or 1.53%.  The U.S. benchmark had fallen to the lowest levels since early 2021 on Tuesday, as traders see a potential peace agreement in Ukraine bringing Russian crude back to a well supplied market. Stock Chart IconStock chart iconOil, 5 yearsBut Trump's pressure campaign against Venezuelan President Nicolas Maduro has lifted prices from those lows. The president said he ordered a \"total and complete\" blockade of sanctioned oil tankers leaving and entering Venezuela. Trump's blockade comes after the U.S. seized a sanctioned oil tanker off Venezuela's coast last week in a major escalation. Venezuela is a founding member of OPEC and has the largest proven crude oil reserves in the world.  It is exporting about 749,000 barrels per day this year, with at least half that oil going to China, according to data from Kpler.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oil rebounds from lowest levels since 2021 after Trump orders Venezuela oil tanker blockade",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242749-1765935288246-gettyimages-1204043834-20200130-_img9841editchinaface.jpeg?v=1765976980&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T18:53:00.000Z",
      "dateModified": "2025-12-17T18:53:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump designates Venezuela government a 'terrorist' regime, orders blockade of sanctioned oil tankers",
    "url": "https://www.cnbc.com/2025/12/17/trump-orders-blockade-of-sanctioned-venezuelan-oil-tankers.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242118-17658343682025-12-15t213022z_700124511_rc28hiav67kn_rtrmadp_0_usa-trump.jpeg?v=1765834423&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T03:04:57.000Z",
    "description": "U.S. President Donald Trump speaks during a Mexican Border Defense Medal presentation in the Oval Office at the White House in Washington, D.C., U.S.,",
    "body": "U.S. President Donald Trump speaks during a Mexican Border Defense Medal presentation in the Oval Office at the White House in Washington, D.C., U.S., Dec. 15, 2025. Evelyn Hockstein | ReutersU.S. President Donald Trump on Tuesday stateside designated Venezuelan government a \"terrorist\" organization and ordered a \"complete and total\" blockade of sanctioned oil tankers moving in and out of the country. In a post on Truth Social, Trump said \"Venezuela is completely surrounded by the largest Armada ever assembled in the History of South America.\"\"For the theft of our Assets, and many other reasons, including Terrorism, Drug Smuggling, and Human Trafficking, the Venezuelan Regime has been designated a FOREIGN TERRORIST ORGANIZATION. Therefore, today, I am ordering A TOTAL AND COMPLETE BLOCKADE OF ALL SANCTIONED OIL TANKERS going into, and out of, Venezuela,\" Trump said.He added, \"It [the blockade] will only get bigger, and the shock to them will be like nothing they have ever seen before.\"Venezuela labeled Trump's statement \"grotesque,\" saying his action \"violates International Law, free trade and free navigation, which constitutes a serious threat against a sovereign nation,\" calling the blockade \"absolutely irrational,\" according to a Google translation of Venezuelan media reports. According to the U.S. State Department, designating an entity as a \"Foreign Terrorist Organization\" makes it illegal for any U.S. citizen to knowingly provide \"material support or resources\" to such an organization, among other measures. Andy Lipow, president of Lipow Oil Associates, told CNBC that a full embargo of Venezuelan oil would affect 800,000 to 900,000 barrels of oil per day, which could increase prices by about $2 to $3 per barrel. Stock Chart IconStock chart iconThat would still leave the world \"well supplied\" as there's a global oil surplus of about 2 million barrels per day, Lipow said. However, Lipow also pointed out that \"The oil market will be watching the Chinese reaction as they are the largest buyer of Venezuelan oil, benefiting from discounted prices and, they may be reluctant to observe USA sanctions, keeping Venezuelan oil flowing into the market.\"Brent crude rose 0.9% to $59.46 a barrel, while U.S. West Texas Intermediate crude gained 1% to $55.82 a barrel after after the news. Prices had hit a four-year low on Tuesday stateside, with WTI falling nearly 3% to $55.27 per barrel, while Brent lost 2.71%, or $1.64, to settle at $58.92.Lipow's view was also echoed by Bob McNally, president at Rapidan Energy Group, who said that \"nothing substantively has changed,\" as long as only sanctioned tankers are targeted.\"We estimate that sanctioned (only) tankers would threaten about 0.3 million barrels of Venezuela's roughly 0.9 million barrels a day of total crude exports.\"McNally said that this alone is not enough to impart a sustained spike into crude prices, which are beginning to fall as surpluses emerge.The Trump administration has escalated pressure on Venezuelan President Nicholas Maduro in recent months, saying that his \"days are numbered\" in an interview with Politico. Trump has categorically not ruled out a ground invasion of the South American nation.The White House has reportedly undertaken a large military buildup in the Caribbean, including deploying its largest aircraft carrier to the region, as well as launching strikes against boats that it claims were trafficking drugs to the U.S.— CNBC's Lee Ying Shan contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump designates Venezuela government a 'terrorist' regime, orders blockade of sanctioned oil tankers",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242118-17658343682025-12-15t213022z_700124511_rc28hiav67kn_rtrmadp_0_usa-trump.jpeg?v=1765834423&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T03:04:57.000Z",
      "dateModified": "2025-12-17T03:04:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mortgage rates move higher after the Fed rate cut, causing loan demand to drop",
    "url": "https://www.cnbc.com/2025/12/17/mortgage-rates-moved-higher-after-fed-rate-cut.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108191616-1756328987176-gettyimages-2232420759-dji_20250827113255_0373_d_bei4amtl.jpeg?v=1765920469&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T16:56:17.000Z",
    "description": "An aerial view of homes in a neighborhood on Aug.27, 2025 in San Francisco, California.Justin Sullivan | Getty ImagesThe Federal Reserve cut its bench",
    "body": "An aerial view of homes in a neighborhood on Aug.27, 2025 in San Francisco, California.Justin Sullivan | Getty ImagesThe Federal Reserve cut its benchmark interest rate last week, and just as happened the last two times, mortgage rates rose. That caused demand for home loans and refinances to drop.Total mortgage application volume fell 3.8% last week compared with the previous week, according to the Mortgage Bankers Association's seasonally adjusted index. The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, 806,500 or less, increased to 6.38% from 6.33%, with points increasing to 0.62 from 0.60, including the origination fee, for loans with a 20% down payment.\"Mortgage rates inched up last week following the FOMC meeting, as investors interpreted the comments to signal that we are near the end of this rate cutting cycle. As a result, mortgage applications declined slightly,\" said Mike Fratantoni, MBA's SVP and chief economist in a release.Applications to refinance a home loan fell 4% for the week and were 86% higher than the same week one year ago. Last year at this time, the rate on the 30-year fixed was 37 basis points higher. While that is not a huge difference, borrowers who may have taken out a loan two years ago, when rates were well over 7%, could now benefit from a refinance. Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.Applications for a mortgage to purchase a home fell 3% for the week and were 13% higher year-over-year.\"Purchase application volume typically drops off quickly at the end of the year, and this shifts the mix of the business, with the refinance share reaching 59 percent last week, the highest level since September,\" added Fratantoni, noting that refinance activity has remained mostly the same for the past month as rates continue to hold at around the same narrow range.Mortgage rates moved slightly lower to start this week, according to a separate survey from Mortgage News Daily. This followed new government data on the employment picture. Markets are still waiting for government data on inflation expected Thursday. \"This is the heaviest hitting monthly inflation report and inflation is the other half of the Fed's rate-setting equation,\" wrote Matthew Graham, chief operating officer at Mortgage News Daily. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mortgage rates move higher after the Fed rate cut, causing loan demand to drop",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108191616-1756328987176-gettyimages-2232420759-dji_20250827113255_0373_d_bei4amtl.jpeg?v=1765920469&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T16:56:17.000Z",
      "dateModified": "2025-12-17T16:56:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FBI Deputy Director Dan Bongino plans to step down early next year, MS NOW reports",
    "url": "https://www.cnbc.com/2025/12/17/fbi-dan-bongino-steps-down-epstein-jan-6.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243101-1765994244599-gettyimages-2249319886-doj_282_120425.jpeg?v=1765994291&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T20:07:30.000Z",
    "description": "FBI Director Kash Patel, left, and Dan Bongino, deputy director of the FBI, conduct a news conference at the Department of Justice on Thursday, Dec. 4",
    "body": "FBI Director Kash Patel, left, and Dan Bongino, deputy director of the FBI, conduct a news conference at the Department of Justice on Thursday, Dec. 4, 2025.Tom Williams | CQ-Roll Call, Inc. | Getty ImagesFBI Deputy Director Dan Bongino has said he plans to step down from his role early next year, MS NOW reported Wednesday, citing eight people briefed on his account.Bongino, the No. 2 official at the FBI under Director Kash Patel, also told his confidants that he will not be returning to the bureau's headquarters this month, those people said.He has considered announcing his departure on Friday, four people told MS NOW.Bongino, asked by MS NOW about his plans, declined to confirm or deny reports of his coming departure, but added, \"Print whatever you'd like. No one believes you anyway. Thanks.\"The FBI declined CNBC's request for comment on the report.Bongino, a former police officer and Secret Service agent, had been selected by President Donald Trump for the high-profile law enforcement job despite him having no prior FBI experience.A fixture in conservative media, Bongino's public discussion of several conspiracy theories resurfaced after he joined the government.As a private citizen, Bongino had reportedly suggested that the planting of pipe bombs in Washington, D.C., on the eve of the Jan. 6, 2021, Capitol riot, was an \"inside job.\" Earlier this month, Bongino took a victory lap after federal agents, after a nearly five-year search, arrested and charged Brian Cole Jr. with setting those devices.When asked by Fox News' Sean Hannity about how his past comments squared with his past claims about the pipe bombs, Bongino said he had been \"paid in the past\" for his opinions, \"and one day I will be back in that space.\"Read more CNBC politics coverageTrump sues BBC for $10 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualification\"That's not what I'm paid for now. I'm paid to be your deputy director, and we base investigations on facts,\" he said.Bongino had also previously questioned official accounts of the circumstances surrounding Jeffrey Epstein's death. The wealthy financier and notorious sex offender hanged himself while in jail in 2019.As an FBI official, Bongino said there was no question that Epstein died by suicide. \"I have reviewed the case. Jeffrey Epstein killed himself. There's no evidence in the case file indicating otherwise,\" he wrote on X in May.In July, the FBI released a memo concluding that Epstein died by suicide and that his rumored \"client list\" did not exist.That memo sparked a backlash among members of Trump's MAGA movement, where conspiracy theories about Epstein have proliferated for years. Soon after, Bongino and Attorney General Pam Bondi angrily confronted each other at the White House according to a The New York Times report.Friday, the day Bongino is reportedly considering announcing his departure, is also the deadline for the Trump administration to comply with a bipartisan law ordering the release of the government's files on its Epstein investigations.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FBI Deputy Director Dan Bongino plans to step down early next year, MS NOW reports",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243101-1765994244599-gettyimages-2249319886-doj_282_120425.jpeg?v=1765994291&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T20:07:30.000Z",
      "dateModified": "2025-12-17T20:07:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robinhood is rolling out NFL parlay and prop bets on prediction markets platform",
    "url": "https://www.cnbc.com/2025/12/16/robinhood-is-rolling-out-nfl-parlay-and-prop-bets-on-prediction-markets-platform.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242618-1765916871832-gettyimages-2252133278-20251215_nfl_miaatpit_b3_4748.jpeg?v=1765916974&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T15:44:53.000Z",
    "description": "watch nowRobinhood is stepping up the capabilities of its fastest growing product — prediction markets — by giving users the ability to place what are",
    "body": "watch nowRobinhood is stepping up the capabilities of its fastest growing product — prediction markets — by giving users the ability to place what are essential parlay bets on multiple NFL games, putting it into direct competition with traditional sports books.Starting Tuesday, users are able to trade preset combinations of the outcome, totals and spreads of individual NFL games, and starting in early 2026, users will have the ability to create custom combos of up to 10 outcomes across NFL games. Those will have \"a structural look or feel as a parlay,\" JB Mackenzie, vice president and general manager of futures and international at Robinhood, told CNBC.Even more, the company is allowing users to wager on the performances of individual NFL players in real time. For example, they can place prop bets on a certain player scoring a touchdown at any point during a game as well as the passing, receiving and rushing yards for a player.\"This was a great opportunity for us to really be able to become the leader in the space, and that's what we're working to do,\" Mackenzie said. \"The enhancements here are another example of it, where we're trying to build new customer experiences that make it easier and, in some cases, provide them more advanced order types and trading capabilities to meet the needs that they're asking us for.\"The new features were unveiled at the company's \"Robinhood Presents: YES/NO\" keynote event at the Summit Skywalker Ranch in Nicasio, Calif., right outside San Francisco.The parlay capability may even extend beyond the NFL in the future, according to Robinhood. The broker is also looking at opportunities to allow combos across different event categories, including those outside of sports like economic data.Parlaying non-sports events\"Over time, the question is going to be, 'Is there interest to pair assets from different classes together?'\" Mackenzie said, noting \"something that's associated with climate and an election\" as an example. \"All sporting events are definitely on the radar. I also think that domestic and international economic data is going to be on there as well, as well as domestic and international policy.\"Robinhood's involvement with prediction markets began just before the 2024 presidential election, where it gave users the ability to trade a contract of former Vice President Kamala Harris or President Donald Trump.In a little more than a year since it partnered with ForecastEx for election trading, the company has only expanded its presence in the prediction markets ecosystem. It has partnered with prediction market operator Kalshi this year. More recently, it announced a joint venture with Susquehanna International Group in November.Robinhood has been seeing the fruits of its labor. Prediction markets as a business has already brought in $100 million in annualized revenue with 11 billion contracts traded by more than 1 million customers. Based on October figures, it's on pace to become a $300 million business.November was the business's biggest month to date at more than 3 billion contracts traded, signifying an approximately 20% increase from October. That month saw 2.5 billion contracts traded, which is more than the entirety of the year's third-quarter performance at 2.3 billion contracts. \"I actually think we're at the beginning of where this is really going to go,\" Mackenzie said. \"I think that we're going to continue to see the expansion of new not only events but also asset classes, where people can continue to trade in.\"Gen-Z's SchwabEarlier this year, Piper Sandler said that Robinhood's prediction markets business posed a \"significant\" growth opportunity for the company, and they're not the only ones that are optimistic. Mizuho analyst Dan Dolev said the strong desire among Robinhood users to interact with prediction markets presents \"lots of upside.\" In a recent survey, he found that users of Robinhood and Coinbase – another platform – are about nine times more likely than non-users to partake in prediction markets.\"They're going after a user base that's already predisposed to engaging with prediction markets,\" he said in an interview with CNBC. \"Over time, they're going to become sort of a hub for prediction markets.\"Dolev said Robinhood's move into prediction markets is a main reason the stock has soared a monstrous 220% in 2025.Stock Chart IconStock chart iconHOOD, year-to-dateHowever, the analyst underscored that prediction markets isn't the only thing to watch for the company. With its involvement in other areas like retirement, he forecasts that Robinhood will eventually become \"the new Schwab for Gen Z.\"To put that into perspective, Robinhood's assets under custody for the full 2024 year stood at $193 billion. Charles Schwab's total client assets were at $10.10 trillion in the same period.\"Prediction marks is one aspect,\" he continued. \"They're circling around every aspect of someone's financial life.\"KeyBanc Capital Markets analyst Alex Markgraff concurs. He said that a number of the company's other endeavors, including its advisory business and its highly in-demand gold card, are in the \"early stages of scaling.\"\"In the short term, [prediction markets is] certainly an area where you might have sort of an outsized growth contribution just based on the apparent appetite for event contracts across the landscape of consumer retail trading,\" he said to CNBC. \"Nonetheless, [there are] multiple sources of growth, in our opinion.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robinhood is rolling out NFL parlay and prop bets on prediction markets platform",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242618-1765916871832-gettyimages-2252133278-20251215_nfl_miaatpit_b3_4748.jpeg?v=1765916974&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T15:44:53.000Z",
      "dateModified": "2025-12-17T15:44:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "California judge rules that Tesla engaged in deceptive marketing around Autopilot",
    "url": "https://www.cnbc.com/2025/12/16/california-judge-says-tesla-engaged-in-deceptive-autopilot-marketing-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108224197-1762873068644-gettyimages-2245660831-TESLA_DOOR_HANDLES.jpeg?v=1765928710&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T04:20:42.000Z",
    "description": "Tesla electric vehicles (EV) in front of the company's store in Colma, California, US, on Monday, Nov. 10, 2025. David Paul Morris | Bloomberg | Getty",
    "body": "Tesla electric vehicles (EV) in front of the company's store in Colma, California, US, on Monday, Nov. 10, 2025. David Paul Morris | Bloomberg | Getty ImagesA California administrative law judge has ruled that Tesla's marketing around its \"Autopilot\" and \"Full Self-Driving\" systems was deceptive, and that the company should face a 30-day suspension of each of its licenses to sell and manufacture cars in the state, according the California Department of Motor Vehicles.The California DMV made formal accusations of false advertising against Tesla in 2022. Steve Gordon, the agency's director, said in a press conference on Tuesday that his agency has adopted the judge's order with a modified penalty, and will now give Elon Musk's automaker a chance to fix any deceptive or confusing claims about its Autopilot and FSD systems. If the marketing issues aren't resolved within a 60-day window, the DMV will move ahead with a 30-day suspension of Tesla's license to sell cars in the state, the agency said in a statement. However, Gordon said, the DMV will stay the judge's order for a suspension of Tesla's manufacturing license, so there will be no interruption to the company's factory operations in the state.In 2022, the DMV said that Tesla's marketing of its Autopilot and Full Self-Driving systems had suggested its cars could be operated autonomously, though they actually required an attentive driver at the wheel, ready to steer or brake at any time. Since that time, Tesla has changed the name of its premium, driver assistance option to Full Self-Driving (Supervised). \"A reasonable consumer likely would believe that a vehicle with Full Self-Driving Capability can travel safely without a human driver's constant, undivided attention,\" the judge wrote in the proposed order. \"This belief is wrong — both as a technological matter and as a legal matter — which makes the name Full Self-Driving Capability misleading,\" a violation of both civil and vehicle codes in California.Public relations firm FGS Global said in an emailed statement from Tesla that, \"This was a 'consumer protection' order about the use of the term 'Autopilot' in a case where not one single customer came forward to say there's a problem. Sales in California will continue uninterrupted.\"The California DMV did not cite consumer complaints in its accusations. However, Tesla is facing a class action lawsuit in California's Northern District from drivers who say that the company misled them for years regarding the self-driving capabilities of their Tesla electric vehicles.Tesla's stock price closed at a record on Tuesday, largely due to increased enthusiasm on Wall Street surrounding the company's plans for its Robotaxis and driverless technology.WATCH: Why EVs have worse depreciation rateswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "California judge rules that Tesla engaged in deceptive marketing around Autopilot",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108224197-1762873068644-gettyimages-2245660831-TESLA_DOOR_HANDLES.jpeg?v=1765928710&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T04:20:42.000Z",
      "dateModified": "2025-12-17T04:20:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]