[
  {
    "title": "4 'good enough' financial moves to reach your goals with 'less time and hassle,' from a money expert",
    "url": "https://www.cnbc.com/2025/12/06/4-good-enough-financial-moves-to-reach-your-goals-with-less-time-and-hassle-from-a-money-expert.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108237495-1764960761695-gettyimages-2166568753-20240715_campervan_jst04085.jpeg?v=1764960797&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-06T14:40:01.000Z",
    "description": "When it comes to managing your finances, you may feel like you have to do the most: reap the most rewards from your credit cards, pay as little as you",
    "body": "When it comes to managing your finances, you may feel like you have to do the most: reap the most rewards from your credit cards, pay as little as you can in taxes, earn the highest returns on your investments and extract the most interest from your savings. If you feel this sort of pressure, you come by it honestly, says Christine Benz, director of personal finance and retirement at Morningstar and author of \"How to Retire.\" \"The [financial] industry has this optimizing mindset,\" she tells CNBC Make It. \"If you're just learning and getting up to speed, you probably start to think that's the only way to do this stuff and that you're doing it wrong if you cut corners.\"To be clear, if you're the kind of person who enjoys drilling down into every tiny detail of your finances, and has time to do so that's fine, Benz says. But for the rest of us, taking a simplified approach can free up time and energy to do other things while keeping us on track to reach our financial goals, she says. In a recent article for Morningstar, Benz called this the \"good enough\" approach to managing finances. Though they may not be moves to \"maximize\" your finances, consider these four strategies, which she says will achieve similar results \"with much less time and hassle.\"Reverse budgetingMany major financial goals, such as saving for retirement and paying down debt, are predicated on your ability to consistently save a portion of your income, Benz says. \"If you are saving reasonably, it obviates the need to do a lot of other things,\" she says. \"Even if you make subpar decisions about investment selections, for example, if the savings rate is decent, it addresses a lot of things that might not be perfect in the plan.\"Put simply, consistently investing 20% of your income into a below average portfolio will likely get you a better outcome than putting 5% in and earning above-average returns. If you want to keep things really simple, try a strategy Benz uses known as reverse budgeting. Rather than trying to tinker with your spending to optimize your savings rate, pick a flat percentage of your income — Benz says 15% is a good target — and set that money to automatically come out of each paycheck to be put toward financial goals. The rest of the money is yours to spend as you see fit. Index investingTheoretically, someone picking the right investments at the right time can beat the stock market over the long term. In practice, though, it's really tough to do. Consider the managers of large-company U.S. stock funds, whose job it is to beat the S&P 500. Over the decade ended June 2025, just 8% of those mutual funds survived and beat the benchmark, according to Morningstar. That's why Benz recommends building a core portfolio of index funds, which come with low fees and merely track the performance of market indexes rather than trying to beat them. \"A lot of data point to the fact that index funds are really terrific choices, and they're hands off,\" she says. \"They can give you exposure to a lot of different parts of the stock and bond market with a single holding.\"\"To me, index funds are a great intersection of optimization and the 'good enough' portfolio.\"Simplifying financial relationshipsNo one wants to park their cash in an account that offers practically no interest. But you needn't move your money around in search of a few tenths of a percentage point either, Benz says. \"It drives me crazy — the idea of people running around trying to get the best cash instrument,\" she says. \"The best way to tip things in your favor is to go with a low-cost provider that will deliver a persistently competitive yield.\"In the context of a brokerage, that may mean comparing what you'll get on so-called \"sweep accounts\" — the places where your money sits within your brokerage account when it's not invested, she says. For high-yield savings accounts, it pays to remember that rates fluctuate, Benz says. It will probably be less of a headache to stick with a bank that you like and that pays a generous rate rather than ping-ponging between online banks offering the highest rate of the year. And if that bank or brokerage also offers credit cards with rewards you like, all the better, she says. When it comes time for you or someone else to get hands-on with your money, having more of it under one roof tends to make things more manageable.\"Reducing the number of financial relationships is such a good practice, which doesn't mean you want to be completely lazy,\" she says. \"But if you can try to skinny down the number of entities that you need to connect with, it's good all around.\"Using an advisorBenz thinks and writes about finances for a living. She published a book about retirement. Still, when it comes to managing money and planning her own retirement, Benz and her husband have enlisted the help of a financial planner. Doing so allows Benz to have an optimized financial plan — she's just letting someone else help with all the fine-tuning. \"She has it all calibrated, and that gives me a lot of peace of mind, knowing that someone else is doing that optimization and using pretty high-powered tools to do it, too,\" Benz says. It's not that Benz or you or anyone else couldn't figure this out on their own. But delegating some of the heavy lifting can free you up to focus on the things you really want to spend time and energy on. Benz favors fee-only planners, who may charge an hourly fee, bill you for specific services or charge something akin to a monthly or annual subscription rate. The key is, they don't get paid to sell you certain financial products, which can be a conflict of interest, Benz says. For Benz, working with a pro has been worth the cost. \"I felt a little glimmer of like, 'Oh, I should be doing this on my own,'\" she says. \"But ultimately, I realized that turning to someone who, importantly, has tools to come up with some really good answers ... that I don't necessarily have, I decided it was a good value proposition.\"Want to stand out, grow your network, and get more job opportunities? Sign up today for Smarter by CNBC Make It's new online course, How to Build a Standout Personal Brand: Online, In Person, and At Work. Learn how to showcase your skills, build a stellar reputation, and create a digital presence that AI can't replicate.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "4 'good enough' financial moves to reach your goals with 'less time and hassle,' from a money expert",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108237495-1764960761695-gettyimages-2166568753-20240715_campervan_jst04085.jpeg?v=1764960797&w=1920&h=1080"
      ],
      "datePublished": "2025-12-06T14:40:01.000Z",
      "dateModified": "2025-12-06T14:40:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump can fire labor, employment board members without cause: Appeals court",
    "url": "https://www.cnbc.com/2025/12/05/trump-nlrb-mspb-appeals-court-humphreys.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236276-1764799952152-gettyimages-2249171853-AFP_86ZT376.jpeg?v=1764799982&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-05T19:59:32.000Z",
    "description": "US President Donald Trump makes an announcement from the Oval Office of the White House in Washington, DC on December 3, 2025. Andrew Caballero-reynol",
    "body": "US President Donald Trump makes an announcement from the Oval Office of the White House in Washington, DC on December 3, 2025. Andrew Caballero-reynolds | Afp | Getty ImagesPresident Donald Trump may remove members of the National Labor Relations Board and the Merit Systems Protection Board at will, a federal appeals court ruled Friday.The 2-1 decision from a panel of judges in Washington, D.C., reverses lower-court rulings blocking Trump's attempts to fire members of the key labor and employment panels.\"Congress may not restrict the President's ability to remove principal officers who wield substantial executive power,\" the two-judge majority wrote, citing a 2020 case known as Seila Law LLC v. Consumer Financial Protection Bureau.They determined that another key court precedent, which was cited in the prior rulings that favored the fired board members, did not apply to the NLRB and MSPB.Those boards \"wield substantial powers that are both executive in nature and different from the powers\" that are covered by the removal protections laid out in the 1935 case known as Humphrey's Executor, the majority wrote.\"So, Congress cannot restrict the President's ability to remove NLRB or MSPB members,\" ruled Judges Gregory Katsas and Justin Walker, who were both appointed to the D.C. circuit by Trump.The Trump administration is challenging the 90-year-old precedent set by Humphrey's, which limits the president's ability to unilaterally remove the heads of certain independent government agencies. The Supreme Court on Monday is set to hear oral arguments in a case that could determine whether Humphrey's is overturned. The third judge on the appellate panel, Florence Pan, warned in a strongly worded dissent that Friday's ruling significantly increases the president's power.\"Today, my colleagues make us the first court to strike down the independence of a traditional multimember expert agency,\" Pan, an appointee of former President Joe Biden, wrote.\"Under my colleagues' reasoning, it appears that no independent agencies may lawfully exist in this country,\" she wrote. \"Their determination that the MSPB cannot be independent ... suggests that no agencies can be independent.\"Pan added that her colleagues \"redefine the type of executive power that must be placed under the exclusive command of the President, and effectively grant him dominion over approximately thirty-three previously independent agencies.\"Katsas and Walker noted that their opinion does \"not address whether Congress may restrict the President's ability to remove members of the Board of Governors of the Federal Reserve System.\"They pointed to a Supreme Court ruling from May, which, while allowing Trump to temporarily fire two NLRB and MSPB members, identified \"a 'distinct historical tradition' regarding the treatment of congressionally chartered banks, which may bear on Congress's ability to restrict the removal of their officials.\"Trump has tried to remove Fed Governor Lisa Cook, a Biden nominee, while urging the central bank and its chairman, Jerome Powell, to quickly slash U.S. interest rates. Cook sued to block her removal; the Supreme Court is set to hear oral arguments in the case on Jan. 21.Friday's ruling also does not touch on whether Congress can restrict the president's ability to fire members from certain agencies that have \"solely adjudicatory functions,\" Katsas and Walker noted.They cited the \"War Claims Commission,\" a temporary agency established after World War II to adjudicate compensation claims from American prisoners of war, as an example.Katsas and Walker additionally did not weigh in on \"whether wrongfully removed principal officers may obtain declaratory, equitable, or mandatory relief against the President or other government officials,\" they wrote.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump can fire labor, employment board members without cause: Appeals court",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236276-1764799952152-gettyimages-2249171853-AFP_86ZT376.jpeg?v=1764799982&w=1920&h=1080"
      ],
      "datePublished": "2025-12-05T19:59:32.000Z",
      "dateModified": "2025-12-05T19:59:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Supreme Court to hear case on Trump birthright citizenship order",
    "url": "https://www.cnbc.com/2025/12/05/trump-birthright-citizenship-supreme-court.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108146014-1747314907763-gettyimages-2214578465-AFP_46U47VL.jpeg?v=1759526256&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-05T20:28:26.000Z",
    "description": "People hold a sign as they participate in a protest outside the U.S. Supreme Court over President Donald Trump's move to end birthright citizenship as",
    "body": "People hold a sign as they participate in a protest outside the U.S. Supreme Court over President Donald Trump's move to end birthright citizenship as the court hears arguments over the order in Washington, May 15, 2025.Drew Angerer | Afp | Getty ImagesThe Supreme Court on Friday said it will hear arguments in a case that will determine if President Donald Trump can undo automatic citizenship for people born in the United States.Trump, on his first day back in the White House on Jan. 20, issued an executive order that said babies born in the U.S. more than 30 days after that order were not entitled to be issued citizenship documents if their parents were temporary visitors or illegal immigrants.Before Trump's order, there was little dispute that the U.S. Constitution's 14th Amendment, with rare exceptions, meant that children born in the country were automatically U.S. citizens, regardless of their parents' status.The Citizenship Clause in that amendment says, \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States.\" The Supreme Court, which is expected to rule next year, will determine if Trump's executive order complies with that amendment.The order told federal agencies to refuse to recognize the citizenship of children born in the U.S. if their mother \"was unlawfully present in the United States and the person's father was not a United States citizen or lawful permanent resident at the time of said person's birth,\" or when the baby's \"mother's presence in the United States was lawful but temporary, and the person's father was not a United States citizen or lawful permanent resident at the time.\"Several federal district court judges have found that Trump's order violated the Constitution, and two federal circuit courts of appeals upheld injunctions blocking the order from taking effect.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Supreme Court to hear case on Trump birthright citizenship order",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108146014-1747314907763-gettyimages-2214578465-AFP_46U47VL.jpeg?v=1759526256&w=1920&h=1080"
      ],
      "datePublished": "2025-12-05T20:28:26.000Z",
      "dateModified": "2025-12-05T20:28:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "From the California gold rush to Sydney Sweeney: How denim became the most enduring garment in American fashion",
    "url": "https://www.cnbc.com/2025/12/06/the-history-of-denim-and-how-jeans-were-created.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108237244-1764940371507-gettyimages-75453173-A045888006.jpeg?v=1764940412&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-06T13:00:01.000Z",
    "description": "Jodie Foster, Billie Perkins, and Robert De Niro perform a scene in Taxi Driver directed by Martin Scorsese in 1976 in New York, New York.  Michael Oc",
    "body": "Jodie Foster, Billie Perkins, and Robert De Niro perform a scene in Taxi Driver directed by Martin Scorsese in 1976 in New York, New York.  Michael Ochs Archives | Moviepix | Getty ImagesIn the dwindling days of the California gold rush, the wife of a local miner faced a problem. Her husband's denim work pants kept ripping, so her tailor, Jacob Davis, had the idea to add copper rivets to key points of strain, like the pocket corners and the base of the button fly, to keep them from tearing. Davis' \"riveted pants\" soon became a roaring success and, unbeknownst to him at the time, marked the official birth of the blue jean, a garment that would transform fashion and come to represent the United States around the globe. \"It really has democratized American fashion and it also is the greatest export that we have sent to the world, because people identify jeans specifically with American Western culture,\" said Shawn Grain Carter, a fashion professor at the Fashion Institute of Technology in New York. \"It doesn't matter your economic or social class. It doesn't matter what your views are in terms of the political spectrum. Everybody wears denim.\" Jacob DavisCourtesy: Levi Strauss & Co.These days, denim is a major sales driver for retailers big and small, as the global denim market reached $101 billion this year, up 28% from 2020, according to data from market research company Euromonitor International. Major apparel companies from American Eagle to Levi Strauss are in a race to corner that market, leaning on A-list celebrities like Sydney Sweeney and Beyonce to win over shoppers and drive sales in an unsteady economy.But if it weren't for Levi Strauss, founder of the eponymous blue jeans company, Davis' invention may not have gone far beyond the railroad town where it was created in the early 1870s. How Levi's created blue jeansSoon after Davis created his riveted pants, called \"waist overalls\" or \"overalls\" at the time, they began selling like \"hot cakes\" and he needed a business partner to secure a patent, said Tracey Panek, Levi's in-house historian. So he wrote to Strauss, a Bavarian-born immigrant who was running a successful wholesale business in San Francisco and had supplied Davis the denim he used to create his riveted pants. \"The secret of them Pents is the Rivits that I put in those Pockets and I found the demand so large that I cannot make them up fast enough,\" Davis wrote Strauss in a letter, according to PBS. Levi StraussCourtesy: Levi Strauss & Co.Strauss, an \"astute\" businessman, recognized the opportunity and agreed to partner with Davis, said Panek. \"This would have been the first time that Levi was actually\" manufacturing his own products, said Panek. \"He was no longer just importing and selling other people's goods. He was manufacturing himself and selling to retailers.\"On May 20, 1873, the two men secured a patent for the riveted pants and eventually opened a factory on Fremont Street, close to the modern-day Salesforce tower in San Francisco's financial district. They promised to offer workers the most durable jeans on the market and soon, business was booming. Dude ranch duds and the American worker Through Strauss' connections as a wholesaler, the company's riveted overalls soon spread across the U.S., becoming the garment of choice for working men everywhere: miners, cowboys, farmers – any role that required durable clothing. Jeans were exclusively reserved for work settings at the time, but as emerging denim manufacturers vied for a similar customer base, they looked to expand their assortment to drive sales. \"Slowly and steadily into the 20th century, you start to see some of these manufacturers making variations,\" said Sonya Abrego, a New York City-based fashion historian. \"There was this one design called spring bottom pants that was kind of a more form fitted, a more dressed up, a slightly flared, maybe what the factory foreman would be wearing, right? As opposed to just the guy on the shop floor.\"In 1934, Levi created the first ever line of jeans for women. Around that time, denim started to become more popular in settings outside of work, primarily for activities like dude ranch vacations, camping and horseback riding. \"So they were kind of taking on a cowboy's garment or a worker's garment but wearing it in a … resort setting,\" said Abrego. Courtesy: Levi Strauss & Co. Dude ranch vacations had become popular because there were finally highways connecting different parts of the country, and few were willing to venture to Europe during a war. Companies like Levi began releasing advertisements highlighting their denim as \"dude ranch duds\" and \"authentic western riding wear\" to capture shoppers looking for jeans to bring with them on vacation, according to archival advertisements from the time. These cultural moments helped to expand denim beyond workers, but jeans didn't become widespread casual attire until after World War II, when American fashion overall started to shift. The rise of the backyard BBQ By the time World War II ended, the mighty American consumer was beginning to emerge. For years, Americans had been forced to ration common goods like rubber, sugar and meat while simultaneously being encouraged to save their money by buying war bonds and socking away spare cash.When the country shifted from wartime to peacetime, Americans were ready to splurge and soon began spending big on new cars, appliances and clothes. \"With a little bit more money to spend, you start seeing a bigger push for leisure clothes and fun clothes and play clothes, clothes to wear to backyard barbecues,\" said Abrego. \"Clothes that we would consider today as just like casual style.\" Courtesy: Levi Strauss & Co.Slowly and surely, it became more and more acceptable for both men and women to wear jeans outside of work settings. Then, denim manufacturers made a push to allow jeans in schools. \"They wanted to sell to as many people as they possibly could,\" said Abrego. \"The idea that jeans are good for school means that they're good for every day.\"By the time the 1960s hit, denim manufacturers had expanded their products and were selling a wide variety of colors, fits and styles. It became a symbol of the hippie movement and a mainstay on Hollywood sets. Soon, denim was everywhere, and the 1970s brought the iconic bell bottom pants and the first iteration of the \"designer jean\" — denim pants being produced by labels and brands whose designs had nothing to do with work wear or western wear, like Calvin Klein and Gloria Vanderbilt. Since then, denim has remained a constant in global fashion. While silhouettes, washes and fits have changed over time, jeans never really go out of style, which is what makes them so enduring, said Abrego. \"This is a design from 1873 … do we see anything else from 1873 on the street? It's kind of wild if you think about it that way,\" said Abrego. \"We can talk about all the details, all the changes in manufacturing and all the different fits and finishes but it's a recognizable thing, it's still a pair of jeans. For me as a historian, that continuity is so compelling because I can't really name anything else that has stayed the same to this degree.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "From the California gold rush to Sydney Sweeney: How denim became the most enduring garment in American fashion",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108237244-1764940371507-gettyimages-75453173-A045888006.jpeg?v=1764940412&w=1920&h=1080"
      ],
      "datePublished": "2025-12-06T13:00:01.000Z",
      "dateModified": "2025-12-06T13:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Barrick Mining stock has more than doubled in 6 months. Why Elliott's activism could drive more upside",
    "url": "https://www.cnbc.com/2025/12/06/elliotts-activism-could-drive-upside-as-barrick-mining-hunts-for-new-ceo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236845-17648754622025-03-04t002941z_1283958846_rc2r5da73zl5_rtrmadp_0_mining-pdac.jpeg?v=1764875494&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-06T13:52:37.000Z",
    "description": "Attendees speak with representatives at the Barrick booth, at the Prospectors and Developers Association of Canada (PDAC) annual mining conference in ",
    "body": "Attendees speak with representatives at the Barrick booth, at the Prospectors and Developers Association of Canada (PDAC) annual mining conference in Toronto, Ontario, Canada March 3, 2025. Carlos Osorio | ReutersCompany: Barrick Mining (B)Business: Barrick Mining, formerly Barrick Gold Corporation, is a gold and copper producer, which is engaged in the production and sale of gold and copper, as well as related activities, such as exploration and mine development. It has ownership interests in producing gold mines in Argentina, Canada, Cote d'Ivoire, the Democratic Republic of Congo, the Dominican Republic, Papua New Guinea, Tanzania and the United States. Its copper mines are in Zambia, Chile and Saudi Arabia. Its operations include Nevada Gold Mines, Bulyanhulu, Hemlo, Jabal Sayid, Kibali, Loulo-Gounkoto, Lumwana, North Mara, Porgera, Pueblo Viejo, Tongon, Veladero and Zaldivar. Its Bulyanhulu operation is located in northwest Tanzania, over 55 kilometers south of Lake Victoria and 150 km southwest of the city of Mwanza. The Jabal Sayid copper operation is located 350 km northeast of Jeddah in the Kingdom of Saudi Arabia. The Lumwana copper mine is a conventional open pit operation.Stock Market Value: $69.16 billion ($40.38 per share)Stock Chart IconStock chart iconBarrick Mining shares year to dateActivist: Elliott Investment ManagementOwnership: n/aAverage Cost: n/aActivist Commentary: Elliott is a multistrategy investment firm that manages about $76.1 billion in assets (as of June 30, 2025) and is one of the oldest firms of its type under continuous management. Known for its extensive due diligence and resources, Elliott regularly follows companies for years before making an investment. Elliott is the most active of activist investors, engaging with companies across industries and multiple geographies.What's happeningOn Nov. 18, Elliott announced a position in Barrick Mining and expressed its interest in seeing a potential separation of North American assets from its mines in riskier regions across Asia and Africa. Most recently, on Dec. 1, Barrick announced that the board has authorized the company to explore a potential separation of the North American assets.Behind the scenesBarrick Mining is a Toronto-based global mining company focused predominantly on gold, operating 14 gold mines, as well as three additional cooper mines. The core of this business is its North America Gold assets, which consists of some of the highest quality deposits in the world, specifically Nevada Gold Mines, a joint venture with Newmont in which Barrick owns 61.5% and serves as its operator. The company also operates gold mines in Africa, the Middle East, Latin America, and Asia. Its copper portfolio is centered around Africa and the Middle East, including Reko Diq, a new copper development project in Pakistan. With the recent bull market for gold, Barrick's stock has more than doubled over the past six months. Despite this, Barrick continues to trade at 0.9 times its price to net asset value ratio, a significant discount to North American peers, who trade well above 1x, with best-in-class peers like Agnico Eagle trading at approximately 1.5x.Investors buy gold companies primarily for gold price exposure, and from there prefer the companies with the best management teams that operate the companies most efficiently to best isolate the value of the commodity. Barrick has not been a top operator amongst its peers and, as a result, they abruptly parted ways with their CEO in September and replaced him with Mark Hill, the former COO, as interim CEO. An interim CEO creates two very valuable opportunities for an activist in a company like Barrick. First and most importantly, they get to have a voice in who the new CEO will be regardless of whether they settle with the company for a board seat or just remain an outspoken shareholder. While they may not always be in the room when the discussions are had or the decision is made, we know of no CEO who would take a job at a company with an activist like Elliott engaging unless they knew that Elliott approved of the hiring. Second, when a company has an interim CEO, it is an advantageous time to explore strategic alternatives, and a breakup of this company has always been the elephant in the room. Barrick's North American operations have been sullied by the company's exposure to higher-risk regions and separating the two would go a long way to close the valuation gap between Barrick and Agnico Eagle. The value proposition for a breakup is clear and even something management has discussed. In a presentation released in May, management demonstrated that applying a peer-like multiple to Barrick's North American assets could unlock as much as 49% of unrealized value. Since then, the price of gold has appreciated by over 70% but the company's stock has appreciated by more than 100%, so much of that gain has been realized but there is still some value to be realized from a breakup.  Elliott has a history of taking board seats at companies not for activist's sake, but only when they feel that the director they are putting on the board could genuinely add value for shareholders. In this case, the breakup of the company is something that is being seriously considered by the board, and Elliott, just by its existence, is likely to have at least negative approval power over the new CEO. Moreover, Elliott does not act impetuously in its activism. They have likely had a position in Barrick for many months at this point and have already received a great return from the company's 100% appreciation in the past six months. We would not expect them to escalate their activism here unless either the board goes down a path they didn't expect and don't agree with, or it is at the company's invitation to join the board to assist with the tasks ahead.Ken Squire is the founder and president of 13D Monitor, an institutional research service on shareholder activism, and the founder and portfolio manager of the 13D Activist Fund, a mutual fund that invests in a portfolio of activist investments.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Barrick Mining stock has more than doubled in 6 months. Why Elliott's activism could drive more upside",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236845-17648754622025-03-04t002941z_1283958846_rc2r5da73zl5_rtrmadp_0_mining-pdac.jpeg?v=1764875494&w=1920&h=1080"
      ],
      "datePublished": "2025-12-06T13:52:37.000Z",
      "dateModified": "2025-12-06T13:52:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Salesforce shares pop 5%, continuing post-earnings rally and pushing stock to best week since 2023",
    "url": "https://www.cnbc.com/2025/12/05/salesforce-shares-heading-for-best-week-since-2023-after-earnings-beat.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108234401-1764598345783-gettyimages-2246580703-251116_booth.jpeg?v=1764956552&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-05T21:19:25.000Z",
    "description": "Sheldon Cooper | Lightrocket | Getty ImagesSalesforce shares popped 5% on Friday, extending a rally that began after the company's better-than-expecte",
    "body": "Sheldon Cooper | Lightrocket | Getty ImagesSalesforce shares popped 5% on Friday, extending a rally that began after the company's better-than-expected earnings report earlier in the week. The stock climbed 13% over the past five days, its best weekly performance since December 2023.The company reported adjusted earnings per share of $3.25, topping Wall Street's estimates of $2.86 per share. Revenue increased 8.6% year over year to $10.26 billion but just missed analyst projections of $10.27 billion.Although the artificial intelligence boom has pushed several tech companies into record surges, cloud software firms have seen a rocky year as investors wonder whether AI will render the industry obsolete.Salesforce is hoping to persuade Wall Street that AI will be able to bolster its products rather than replace them. Investors \"somehow think software companies are under arrest from AI, when the opposite is true,\" Salesforce CEO Marc Benioff told CNBC's Jim Cramer on Thursday.During the third quarter, the company acquired startups Regrello and Waii, which uses AI to generate code with natural language instructions.Despite Salesforce's shares being down 22% year to date, compared with the Nasdaq's 22% gain, analysts are more optimistic for 2026. \"CRM [Salesforce] continues to be levered to digital transformation, and we expect the company to grow at a solid rate going forward,\" Mizuho analysts wrote. \"At the same time, we believe CRM will remain fiscally disciplined and that it can continue to drive higher operating and FCF margins.\"Analysts highlighted Salesforce's AI platform Agentforce, which builds agents that automate business tasks and streamline workflow. Despite initial investor skepticism over the platform, Cantor analysts were encouraged by its strong adoption in the customer service space.\"We think CRM is starting to formalize and mature the strategy, which should make it easier for customers to understand, and therefore adopt, Agentforce,\" the Cantor analysts wrote.Annual recurring revenue of Agentforce jumped 330% year over year to $540 million.\"Why everyone is so excited about Agentforce is because this is what AI was meant to be,\" Benioff said. \"It brings together humans and data and AI and apps, and delivers an incredible experience for companies.\"WATCH: Salesforce CEO Marc Benioff goes one-on-one with Jim Cramer",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Salesforce shares pop 5%, continuing post-earnings rally and pushing stock to best week since 2023",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108234401-1764598345783-gettyimages-2246580703-251116_booth.jpeg?v=1764956552&w=1920&h=1080"
      ],
      "datePublished": "2025-12-05T21:19:25.000Z",
      "dateModified": "2025-12-05T21:19:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration waives $11 million fine for Southwest Airlines' 2022 holiday meltdown",
    "url": "https://www.cnbc.com/2025/12/06/trump-administration-waives-11-million-southwest-fine.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106994117-1640697119885-gettyimages-1237439383-US_FLIGHT_CANCELLATIONS.jpeg?v=1683464341&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-06T21:10:59.000Z",
    "description": "A Southwest plane and baggage carts at Hartsfield-Jackson Atlanta International Airport (ATL) in Atlanta, Georgia, U.S., on Monday, Dec. 27, 2021.Elij",
    "body": "A Southwest plane and baggage carts at Hartsfield-Jackson Atlanta International Airport (ATL) in Atlanta, Georgia, U.S., on Monday, Dec. 27, 2021.Elijah Nouvelage | Bloomberg | Getty ImagesThe Trump administration said it will forgive the last $11 million of a civil fine against Southwest Airlines that stems from the carrier's 2022 holiday meltdown that stranded some 2 million passengers after nearly 17,000 flights were canceled.The Transportation Department under the Biden administration in late 2023 fined the Dallas-based airline $140 million, though the agency then credited the airline with all but $35 million of that amount because of its compensation to customers.In an order filed Friday, the Transportation Department cited Southwest's more than $1 billion investments in its technology and operation since the holiday meltdown as reason for the additional credit. Southwest was due to make the last payment next month.\"Southwest Airlines is grateful to [Transportation] Secretary [Sean] Duffy and the DOT Team for recognizing Southwest's significant investments in modernizing our operations,\" Southwest said Saturday. \"During the last two years, Southwest successfully completed an operational turnaround that directly benefits our Customers with industry leading on-time performance and percentage of completed flights without cancellations.\"Read more CNBC airline newsDelta says government shutdown cost it $200 million, but forecasts strong travel demand into 2026The government shutdown is over. The air traffic controller shortage is notBoeing stems cash burn for first time since 2023 but takes $4.9 billion charge on 777X delaysAmerican Airlines is late to the luxury travel boom. Can it catch up?",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration waives $11 million fine for Southwest Airlines' 2022 holiday meltdown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106994117-1640697119885-gettyimages-1237439383-US_FLIGHT_CANCELLATIONS.jpeg?v=1683464341&w=1920&h=1080"
      ],
      "datePublished": "2025-12-06T21:10:59.000Z",
      "dateModified": "2025-12-06T21:10:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jan. 6 pipe bomb suspect Brian Cole confessed, said he supports Trump and has anarchist views: MS NOW",
    "url": "https://www.cnbc.com/2025/12/05/brian-cole-trump-jan-6-pipe-bomb-case.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108237445-1764956554653-gettyimages-2249325364-doj_294_120425.jpeg?v=1764956592&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-05T19:15:55.000Z",
    "description": "MPD Chief of Police Pamela Smith and U.S. Capitol Police Chief Michael Sullivan attend a news conference at the Department of Justice on Thursday, Dec",
    "body": "MPD Chief of Police Pamela Smith and U.S. Capitol Police Chief Michael Sullivan attend a news conference at the Department of Justice on Thursday, December 4, 2025, announcing the arrest of Brian Cole Jr., who allegedly placed pipe bombs near the Republican and Democratic National Committee offices on January 6, 2021. Tom Williams | Cq-roll Call, Inc. | Getty ImagesAccused pipe bomb planter Brian Cole Jr. confessed his crimes to the FBI, and told agents he supported President Donald Trump and held anarchist views, MS NOW reported Friday.Cole, 30, was arrested Thursday morning at his family's home in Woodbridge, Virginia, nearly five years after he allegedly placed explosive devices outside Republican and Democratic party offices in Washington, D.C., on the eve of the Jan. 6, 2021, Capitol riot.While in custody, Cole confessed to planting the pipe bombs, which did not detonate, two sources familiar with his interview with the FBI told MS NOW.John Shoreman, Cole's defense attorney, did not immediately respond to CNBC's request for comment on the reporting.A suspect in the planting of explosive devices near the Democratic and Republican committee headquarters in Washington is seen in this still frame taken from video released on March 9, 2021. FBI | Via ReutersDuring his initial court appearance on Friday afternoon, the government told Magistrate Judge Moxila Upadhyaya that Cole spoke to the authorities for \"more than four hours\" the previous day, NBC News reported.Federal authorities have yet to publicly disclose what motive Cole might have had to allegedly plant the bombs. Attorney General Pam Bondi, asked at a press briefing Thursday what motivations Cole may have possessed, said the investigation is ongoing.Read more CNBC politics coverageJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'Cole is currently charged with transporting an explosive device in interstate commerce with intent to kill, injure or intimidate or unlawfully destroy property.He is also charged with \"malicious destruction or attempted malicious destruction by means of fire and explosive materials.\"\"I believe there are more charges to come,\" Bondi said Friday morning on Fox News.Read more CNBC politics coverageJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'This is developing news. Please check back for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jan. 6 pipe bomb suspect Brian Cole confessed, said he supports Trump and has anarchist views: MS NOW",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108237445-1764956554653-gettyimages-2249325364-doj_294_120425.jpeg?v=1764956592&w=1920&h=1080"
      ],
      "datePublished": "2025-12-05T19:15:55.000Z",
      "dateModified": "2025-12-05T19:15:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Ellison's hunt for WBD made David Zaslav richer — and it may not be over",
    "url": "https://www.cnbc.com/2025/12/05/paramount-david-ellison-wbd-bidding-war-hostile-bid.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108198013-1757676516163-gettyimages-2215458421-AFP_47CZ4QC.jpeg?v=1764958598&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-05T19:30:24.000Z",
    "description": "Paramount Skydance CEO David Ellison speaks during the Bloomberg Screentime conference in Los Angeles on October 9, 2025.Patrick T. Fallon | Afp | Get",
    "body": "Paramount Skydance CEO David Ellison speaks during the Bloomberg Screentime conference in Los Angeles on October 9, 2025.Patrick T. Fallon | Afp | Getty ImagesThis isn't exactly what David Ellison had planned in September. Just a few months ago, the Paramount Skydance CEO sent a letter to the Warner Bros. Discovery board of directors arguing a combination of the two media and entertainment companies made sense. That letter was the first of several that offered increasingly higher prices to acquire the company along with arguments of why the assets were better together.Paramount's interest spurred a formal sale process — bringing Comcast and Netflix into the mix — which ultimately doubled the value of Warner Bros. Discovery shares and culminated, at least for the moment, in Paramount losing out in the bidding war it started.  On Friday, Netflix announced a deal to acquire HBO Max and the famed Warner Bros. film studio for $27.75 per share, or an equity value of $72 billion. WBD will move forward with a plan to separate out its pay-TV networks, such as CNN and TNT Sports, before the deal closes. Instead of supercharging Paramount, just months after gaining control of the company through a merger with Skydance, Ellison effectively handed a prized jewel of the media and entertainment industry to its most dominant player, strengthening Netflix's reach and stripping Paramount and Comcast's NBCUniversal of an obvious merger target. \"It wasn't for sale before, and they certainly hadn't cleaned up the assets or separated the assets in the way they have right now,\" said Netflix co-CEO Ted Sarandos in a conference call Friday morning after announcing the deal. \"I think that kind of goes to the 'why now.'\"Ellison jump-started a process that has made a lot of money for Warner Bros. Discovery CEO David Zaslav, WBD's executive team and its shareholders. Zaslav's shareZaslav currently owns more than 4.2 million shares of Warner Bros. Discovery, with another 6.2 million shares that would be delivered to him in the future via previously granted stock awards, according to Equilar. Zaslav also has a grant of almost 20.9 million options with an exercise price of $10.16, Equilar found.Based on the Netflix-WBD transaction price of $27.75 per share, all of that adds up to more than $554 million for the WBD CEO. Factoring in another 4 million shares that Zaslav is set to receive in January, according to a person close to the situation who declined to be named speaking about the executive's holdings, the true total is closer to $660 million.For shareholders, the sale process has brought a similar windfall. Warner Bros. Discovery stock closed at $12.54 on Sept. 10, the day before The Wall Street Journal reported Paramount was preparing a bid for the company. On Friday morning, Warner Bros. Discovery shares were up almost 3% to more than $25 apiece. That's more than double Warner Bros. Discovery's unaffected sale process price and a return to 2022 levels when WarnerMedia and Discovery first merged. That's vindication for Zaslav, who has spent nearly four years coming under fire from Hollywood and investors for failing to deliver for shareholders. With Friday's announcement, he's effectively pulled victory from the jaws of defeat. And still, Paramount is likely not done with its pursuit of buying all of Warner Bros. Discovery.Paramount's hostile playEllison has wasted no time at the helm of Paramount Skydance, transforming the company through deals and acquisitions.Since the merger closed in August, Paramount has brought on C-suite executives and high-profile Hollywood talent such as the Duffer Brothers. It secured the rights to develop a live-action feature film based on Activision's Call of Duty video game franchise and struck a $7.7 billion deal for UFC rights. Ellison's hunt for Warner Bros. Discovery was his biggest endeavor since taking control of the company.Paramount's lawyers sent a letter to Warner Bros. Discovery this week, first reported by CNBC, claiming the sale process had been rigged in Netflix's direction. Paramount has accused Warner Bros. Discovery of failing to properly consider its offer of $30, all-cash, and instead selling to Netflix as a predetermined outcome. Netflix made an initial bid for WBD's studio and streaming assets of $27 a share, according to a person familiar with the matter. That trumped Paramount's offer at the time and turned the trajectory of the sales talks in Netflix's direction, said the person, who asked not to be named because the discussions were private.Paramount was the only bidder interested in acquiring all of WBD's assets — the film studio, streaming service and TV networks. It has maintained that its offer is superior. Paramount's executives and advisors valued the Discovery Global networks portfolio at close to $2 a share, based on its predicted trading multiple and estimated leverage ratio, according to people familiar with the matter, who asked not to be named because the discussions were private. Discovery Global would include the CNN, TNT Sports and Discovery channels.Warner Bros. Discovery believes Discovery Global could have a value of $3 per share or more if it trades well in the public markets, according to other people with direct knowledge of the matter.Paramount has also argued there are tax efficiencies for shareholders in acquiring the whole company rather than buying only a portion of it, and that Netflix's bid comes with steeper regulatory risk. The Trump administration's view of the proposed combination is one of \"heavy skepticism,\" CNBC reported Friday.Paramount offered a break-up fee of $5 billion if the proposed deal didn't get regulatory approval, according to the people familiar.  Netflix's bid included a $5.8 billion break-up fee in case the deal doesn't get regulatory approval, according to a Securities and Exchange Commission filing Friday. Paramount is now weighing its options about whether to go straight to shareholders with one more improved bid — perhaps even higher than the $30-per-share, all-cash offer it submitted to WBD this week. If it does, Netflix would have a chance to match that bid. The end result would mean even more money for WBD shareholders — and more money for Zaslav.— CNBC's Nick Wells contributed to this report. Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast’s planned spinoff of Versant.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Ellison's hunt for WBD made David Zaslav richer — and it may not be over",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108198013-1757676516163-gettyimages-2215458421-AFP_47CZ4QC.jpeg?v=1764958598&w=1920&h=1080"
      ],
      "datePublished": "2025-12-05T19:30:24.000Z",
      "dateModified": "2025-12-05T19:30:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Core inflation rate watched by Fed hit 2.8%, delayed September data shows, lower than expected",
    "url": "https://www.cnbc.com/2025/12/05/pce-inflation-report-september-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108230161-17637550592025-11-21t194702z_1842470875_rc241iawq458_rtrmadp_0_holidayshopping-retail-walmart.jpeg?v=1763755340&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-05T17:55:37.000Z",
    "description": "watch nowA key inflation measure was lower than expected in September, the Commerce Department said Friday in a report delayed by the government shutd",
    "body": "watch nowA key inflation measure was lower than expected in September, the Commerce Department said Friday in a report delayed by the government shutdown that gives a further green light for the Federal Reserve to lower interest rates.The core personal consumption expenditures price index, which excludes volatile food and energy prices, indicated a 0.2% monthly rise while the annual rate was 2.8%. The monthly rate was in line with the Dow Jones consensus, but the annual level was 0.1 percentage point lower. The core annual rate edged down from 2.9% in August.In addition, headline PCE increased 0.3% for the month, putting the annual inflation rate also at 2.8%, according to the department's Bureau of Economic Analysis. Both of those readings were in line with expectations though the annual rate was up 0.1 percentage point from August.Federal Reserve officials use the PCE price index as their primary policy tool for inflation. While officials look at both measures, they generally consider core a better indicator of longer-term inflation trends.\"The slightly stale September inflation report shows that prices remained reasonably stable despite tariffs and healthy consumer spending. This probably provides further air cover for the Fed to cut rates in December,\" said Scott Helfstein, Global X's head of investment strategy.Goods prices surged 0.5% on the month as President Donald Trump's tariffs continue to work their way through the economy. Services prices were up just 0.2%. Food rose 0.4% while energy was up 1.7%.The report also showed the personal savings rate was unchanged from August at 4.7%.The release was put off several weeks by the government shutdown, which had caused a halt to all data collection and economic reports.In addition to the inflation figures, the release provided information on income and spending.Personal income rose 0.4% on the month while spending was up 0.3%. Income was 0.1 percentage point above the forecast, while spending was 0.1 percentage point below the forecast.Stocks added to gains following the release as traders anticipate a quarter percentage point interest rate cut from the Fed when it announces its rate decision Wednesday.Odds of a rate cut when the Fed convenes next week held at 87.2% following the report, according to the CME Group's FedWatch gauge. The interest rate decision will be announced Wednesday.Though the September data is backward-looking, it is the last price reading the Fed will get before its monetary policy meeting next week. However, policymakers have been unusually divided in what the next steps should be for rates. One FOMC faction supports additional cuts as a way to head off further weakness in the labor market, while another sees continued threats from inflation that would require holding rates in a more restrictive position. Recent labor market indicators show a slow pace of hiring, with some private data points exhibiting an increasing level of layoffs. Labor Department data, though, actually showed a decline last week in initial unemployment benefit claims.A separate economic report Friday showed consumer sentiment a bit better than expected to start December.The University of Michigan's consumer survey came in at 53.3, up 4.5% from November and better than the Wall Street estimate for 52. Inflation expectations also dropped, with the one-year view falling to 4.1% and the five-year at 3.2%, both at their lowest levels since January.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Core inflation rate watched by Fed hit 2.8%, delayed September data shows, lower than expected",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108230161-17637550592025-11-21t194702z_1842470875_rc241iawq458_rtrmadp_0_holidayshopping-retail-walmart.jpeg?v=1763755340&w=1920&h=1080"
      ],
      "datePublished": "2025-12-05T17:55:37.000Z",
      "dateModified": "2025-12-05T17:55:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple announces departure of general counsel and policy chief",
    "url": "https://www.cnbc.com/2025/12/04/apple-announces-departure-lisa-jackson-kate-adams.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236957-1764884536150-gettyimages-849713784-TECHCRUNCH_SF.jpeg?v=1764884591&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-04T22:59:15.000Z",
    "description": "Lisa Jackson, senior vice president of environment, policy and social initiatives at Apple Inc., speaks during the TechCrunch Disrupt 2017 in San Fran",
    "body": "Lisa Jackson, senior vice president of environment, policy and social initiatives at Apple Inc., speaks during the TechCrunch Disrupt 2017 in San Francisco, California, U.S., on Tuesday, Sept. 19, 2017. David Paul Morris | Bloomberg | Getty ImagesApple's general counsel, Kate Adams, and its vice president for environment, policy, and social initiatives, Lisa Jackson, are retiring from the company, the iPhone maker announced on Thursday. Jennifer Newstead, Meta's chief legal officer, will become Apple's new general counsel in March, and Jackson's government affairs staff will report to her starting late next year, Apple said. The two executives, who both reported to Apple CEO Tim Cook, are the latest members of senior leadership to exit the company. In recent weeks, Apple's head software designer said he was leaving to join Meta, while Apple said its AI chief was retiring, along with its chief operating officer.Adams joined Apple from Honeywell and became general counsel in 2017, and oversaw legal matters including litigation, global security, and the company's privacy initiatives. Under Adams, Apple grappled with rising antitrust scrutiny and regulation around the world, including major lawsuits in the U.S. over the iPhone App Store's restrictions and fees. Jackson joined Apple in 2013, and led the company's diversity programs as well as much of its policy work in Washington, D.C. Before that, she spent four years as administrator of the U.S. Environmental Protection Agency, a position she was appointed to by President Barack Obama. With her emphasis in areas like social justice and renewable energies, Jackson's job lost relevance during the second Trump administration, which has publicly denounced diversity, equity and inclusion programs and slammed efforts to combat climate change. Apple has faced increased tariffs from the Trump administration, and Cook has met with President Donald Trump several times to tout the company's American manufacturing plans as part of an effort to influence policy. Jackson was instrumental in Apple's launch of its Racial Equity and Justice Initiative following the 2020 murder of George Floyd. She then helped expand the company's equity and justice efforts to other countries, including the U.K., Mexico and New Zealand, according to a report published in 2023.\"At Apple, we pledge that our resolve will not fade,\" Jackson wrote in a section of that report. \"We won't delay action. We will work, each and every day, on the urgent task of advancing equity.\"Jackson also worked on Apple's environmental image. Her job \"focused on reducing greenhouse gases, protecting air and water quality, preventing exposure to toxic contamination, and expanding outreach to communities on environmental issues,\" according to her bio on the company's website. She discussed Apple's plans to become carbon neutral at iPhone launch events.Jackson also accompanied Cook to several official functions in Washington, including state dinners. Apple CEO Tim Cook and Apple Vice President Lisa Jackson arrive at the White House for a state dinner on April 10, 2024 in Washington, DC. Tasos Katopodis | Getty ImagesNewstead, who will become Apple's top lawyer, has overseen Meta's legal and regulatory matters pertaining to its family of apps like Facebook, Instagram, WhatsApp since 2019. A Meta spokesperson said Newstead will be staying through the end of the year and that the company is actively searching for her replacement.Prior to Meta, Newstead served as a Trump-appointed legal advisor at the State Department during the president's first administration in 2019.  Before that, she was a partner at Davis Polk & Wardwell and a general counsel of the White House Office of Management and Budget, among other roles in the U.S. government.CNBC's Jonathan Vanian contributed to this story.WATCH: Apple AI chief steps downwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple announces departure of general counsel and policy chief",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236957-1764884536150-gettyimages-849713784-TECHCRUNCH_SF.jpeg?v=1764884591&w=1920&h=1080"
      ],
      "datePublished": "2025-12-04T22:59:15.000Z",
      "dateModified": "2025-12-04T22:59:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge finalizes remedies in Google antitrust case",
    "url": "https://www.cnbc.com/2025/12/05/judge-finalize-remedies-in-google-antitrust-case.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108230973-17639991772025-11-24t154318z_1737158446_rc2lwq9j2uvq_rtrmadp_0_google-stocks.jpeg?v=1763999195&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-06T00:53:56.000Z",
    "description": "The logo for Google LLC is seen at the Google Store Chelsea in Manhattan, New York City, U.S., November 17, 2021. Andrew Kelly | ReutersA U.S. judge o",
    "body": "The logo for Google LLC is seen at the Google Store Chelsea in Manhattan, New York City, U.S., November 17, 2021. Andrew Kelly | ReutersA U.S. judge on Friday added new details to the remedies resulting from Google's antitrust case, finalizing the consequences the company faces after its defeat last year.In mid-2024, Google was found to hold an illegal monopoly in its core market of internet search, and in September of this year, U.S. District Judge Amit Mehta ruled against the most severe consequences that were proposed by the Department of Justice, including a forced sale of Google's Chrome browser.Google was, however, ordered to loosen its hold on search data.Mehta on Friday issued additional details for his ruling. \"The age-old saying 'the devil is in the details' may not have been devised with the drafting of an antitrust remedies judgment in mind, but it sure does fit,\" Mehta wrote in one of the Friday filings. Mehta wrote that Google can't enter into any deal like the one it's had with Apple \"unless the agreement terminates no more than one year after the date it is entered.\" Google pays billions of dollars per year to Apple to be the default search engine on the Safari browser on iPhones, Macs and iPads.The judge's ruling includes deals involving generative artificial intelligence products, and any \"application, software, service, feature, tool, functionality, or product\" that involve or use genAI or large language models.GenAI \"plays a significant role in these remedies,\" Mehta wrote.Mehta on Friday also included requirements on the makeup of a technical committee that will determine with whom Google must share its data. Committee \"members shall be experts in some combination of software engineering, information retrieval, artificial intelligence, economics, behavioral science, and data privacy and data security,\" the filing says.The judge went on to say that no committee member can have a conflict of interest, such as having worked for Google or any of its competitors in the six months prior to or one year after serving in the role.Mehta said the committee must \"have access to Google's source code and algorithms, subject to a confidentiality agreement,\" and reiterated the web index data it will require Google to share with certain competitors. Google has to share some of the raw search interaction data it uses to train its ranking and AI systems, but not the actual algorithms. In September, Mehta said those data sets represent a \"small fraction\" of Google's overall traffic, but argued the company's models are trained on data that contributed to Google's edge over competitors.In August 2024, Mehta ruled that Google violated Section 2 of the Sherman Act and held a monopoly in search and related advertising. The antitrust trial started in September 2023.Google did not immediately respond to a request for comment. The company has previously said it will appeal the judge's monopoly ruling.WATCH: Judge Issues final remedies in Google antitrust casewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge finalizes remedies in Google antitrust case",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108230973-17639991772025-11-24t154318z_1737158446_rc2lwq9j2uvq_rtrmadp_0_google-stocks.jpeg?v=1763999195&w=1920&h=1080"
      ],
      "datePublished": "2025-12-06T00:53:56.000Z",
      "dateModified": "2025-12-06T00:53:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "RFK Jr.’s vaccine panel weakens recommendation on hepatitis B shot for babies, scrapping universal guidance",
    "url": "https://www.cnbc.com/2025/12/05/hepatitis-b-vaccine-babies-rfk-jr-cdc.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236667-1764948633608-108236667-17648636622025-12-04t155140z_1444283389_rc2p9ia5r95t_rtrmadp_0_health-usa-vaccines.jpg?v=1764948656&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-05T18:04:31.000Z",
    "description": "Dr. Vicky Pebsworth, from left, Massachusetts Institute of Technology professor Retsef Levi, Case Western Reserve University Professor Catherine Stein",
    "body": "Dr. Vicky Pebsworth, from left, Massachusetts Institute of Technology professor Retsef Levi, Case Western Reserve University Professor Catherine Stein and Dr. Raymond Pollak, listen to presentations during an Advisory Committee on Immunization Practices (ACIP) meeting to discuss childhood vaccine schedule changes at the Centers for Disease Control and Prevention in Atlanta, Georgia, U.S., December 4, 2025.Alyssa Pointer | ReutersHealth and Human Services Secretary Robert F. Kennedy Jr.'s handpicked vaccine committee voted on Friday to do away with the long-standing, universal recommendation that all babies receive a hepatitis B shot at birth, issuing weaker guidance for certain infants. The group, called the Advisory Committee on Immunization Practices, or ACIP, recommended that parents use individual decision-making in consultation with a health-care provider to determine when or if to give the hepatitis B birth dose to a baby whose mother tested negative for the virus. For babies who don't receive the birth dose, the committee recommended that they wait to receive a first vaccine until they are at least 2 months old. The acting director of the Centers for Disease Control and Prevention still has to sign off on that new recommendation. The CDC currently recommends that every baby get vaccinated against hepatitis B within 24 hours of birth, regardless of their mother's testing status. The move overturns that guidance, which has been credited with driving down infections in children by 99% since it was first introduced three decades ago and is widely considered to be a public health success story. Some committee members and public health experts warn that the change could have wide-ranging consequences, such as an increase in infections among kids. The vote only affects the timing of the first dose of the hepatitis B vaccine series. The second would still be given one to two months after birth, with a third dose between 6 and 18 months of age. All pregnant people are supposed to be tested for hepatitis B during pregnancy. During previous meetings, some advisors questioned the need for babies to receive a shot if their mothers test negative. But test results can produce false negatives, some people become infected later in pregnancy after being tested and babies can get infected by other members of their household. The panel's closely watched two-day meeting in Atlanta comes after Kennedy gutted the committee and appointed 12 new members, including some well-known vaccine critics. ACIP sets recommendations on who should receive certain shots and which vaccines insurers must cover at no cost. Eight members voted yes, while three voted no. Some advisors strongly pushed back on the new guidance ahead of the vote. \"This has a great potential to cause harm, and I hope that the committee accepts the responsibility when this harm is caused,\" said Dr. Joseph Hibbeln, psychiatrist and voting member. Dr. Cody Meissner, voting member and professor of pediatrics at the Dartmouth Geisel School of Medicine, said he hopes that pediatricians will continue to administer the birth dose within the first 24 hours of delivery and before discharge from the hospital. \"To follow any other course is not in the interest of infants,\" he said. Meissner added that more children will be injured and will catch hepatitis B infections. Hepatitis B, which can be passed from mother to baby during childbirth, can lead to liver disease and early death. Infants are more vulnerable to developing chronic hepatitis B infections, which have no cure. \"We will see hepatitis B come back,\" he said. \"The vaccine is so effective. It does not make sense in my mind to change the immunization schedule.\"In a statement Friday, the American Medical Association said the vote is \"reckless and undermines decades of public confidence in a proven, lifesaving vaccine.\" The group added that the decision was not based on scientific evidence and \"creates confusion for parents about how best to protect their newborns.\"Meanwhile, Retsef Levi, a voting member and Massachusetts Institute of Technology professor, falsely claimed during meetings that experts have \"never tested\" the hepatitis B vaccine \"appropriately.\" Some committee members raised concerns about vaccinating during the so-called neonatal period, which is a critical window of development for the brain and immune system. But decades of evidence show that the hepatitis B shot has been safely administered to newborns. Other advisors said there is no evidence supporting the two-month delay to the birth dose.\"We have to make decisions with the data that we have, and we must use only the credible data to make the decisions, and not speculations and not hypotheses,\" said Hibbeln. A 2024 CDC study showed that the current vaccination schedule has helped prevent more than 6 million hepatitis B infections and nearly 1 million hepatitis B-related hospitalizations.Merck and GSK manufacture the hepatitis B vaccines used starting at birth. Neither of the shots are significant revenue drivers for the companies, so the new recommendations should not have a material impact on their businesses. Still, Merck said in a statement Friday that it is \"deeply concerned\" by the vote, which it said risks \"reversing this progress and puts infants at unnecessary risk of chronic infection, liver cancer and even death.\" The company added that \"there is no evidence delaying it provides any benefit to children.\" In a statement, GSK said, \"we await additional information and an official adoption of today's recommendations by CDC to fully understand the potential impact.\"The panel's vote will not affect insurance coverage for the shots, including under Medicaid and the Children's Health Insurance Program, Andrew Johnson, principal policy analyst for the Centers for Medicare and Medicaid, told the members during the meeting. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "RFK Jr.’s vaccine panel weakens recommendation on hepatitis B shot for babies, scrapping universal guidance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236667-1764948633608-108236667-17648636622025-12-04t155140z_1444283389_rc2p9ia5r95t_rtrmadp_0_health-usa-vaccines.jpg?v=1764948656&w=1920&h=1080"
      ],
      "datePublished": "2025-12-05T18:04:31.000Z",
      "dateModified": "2025-12-05T18:04:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta acquiring AI wearable company Limitless",
    "url": "https://www.cnbc.com/2025/12/05/meta-limitless-ai-wearable.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219443-17618392362025-09-18t012656z_736652099_rc20uga8mamw_rtrmadp_0_meta-platforms-virtual-reality.jpeg?v=1761839305&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-05T20:33:21.000Z",
    "description": "Meta CEO Mark Zuckerberg wears the Meta Ray-Ban Display glasses, as he delivers a speech presenting the new line of smart glasses, during the Meta Con",
    "body": "Meta CEO Mark Zuckerberg wears the Meta Ray-Ban Display glasses, as he delivers a speech presenting the new line of smart glasses, during the Meta Connect event at the company's headquarters in Menlo Park, California, U.S., Sept. 17, 2025. Carlos Barria | ReutersMeta is acquiring artificial intelligence wearable startup Limitless, the companies said Friday.\"We're excited that Limitless will be joining Meta to help accelerate our work to build AI-enabled wearables,\" a Meta spokesperson said in a statement.Limitless makes a small, AI-powered pendant that can record conversations and generate summaries.Limitless CEO Dan Siroker revealed the deal on Friday via a corporate blog post but did not disclose the financial terms.\"Meta recently announced a new vision to bring personal superintelligence to everyone and a key part of that vision is building incredible AI-enabled wearables,\" Siroker said in the post and an accompanying video. \"We share this vision and we'll be joining Meta to help bring our shared vision to life.\"Read more CNBC tech newsElon Musk's X fined $140 million by European Commission over 'deceptive' blue checkmark and lack of transparency'China's Nvidia' Moore Threads surges over 400% on trading debut after $1.1 billion listingApple announces departure of general counsel and policy chiefMicrosoft will raise prices of commercial Office subscriptions in JulyThe world of AI wearables has been slowly growing this year, but no company has landed a standout product.Meta's Ray-Ban smartglasses, which have been a surprise hit, have a sprinkling of AI flavor with the inclusion of the company's AI digital assistant.There are several wearable devices available that are similar to Limitless. Friend offers a pendant-style device, Plaud comes in a small card shape or pill that can be clipped on or worn around your neck or on your wrist, and Bee, which is worn on a wristband and was scooped up by Amazon in July.Amazon also runs AI through its Alexa+ line of Echo Speakers, while Google's Pixel 10 phones have the Gemini assistant built in.WATCH: Meta is visibly seeing a return on investment from AI.watch nowCNBC's Chris Eudaily contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta acquiring AI wearable company Limitless",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219443-17618392362025-09-18t012656z_736652099_rc20uga8mamw_rtrmadp_0_meta-platforms-virtual-reality.jpeg?v=1761839305&w=1920&h=1080"
      ],
      "datePublished": "2025-12-05T20:33:21.000Z",
      "dateModified": "2025-12-05T20:33:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rubrik stock rips 22% higher after blowing out earnings and boosting guidance",
    "url": "https://www.cnbc.com/2025/12/05/rubrik-rbrk-stock-earnings-q3.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107406463-17140664872024-04-25t170232z_1340097878_rc2rd7az9l0b_rtrmadp_0_rubrik-ipo.jpeg?v=1714066599&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-05T21:13:03.000Z",
    "description": "watch nowRubrik shares soared 22% on Friday after the data management company posted blowout fiscal third-quarter numbers and boosted guidance.The sto",
    "body": "watch nowRubrik shares soared 22% on Friday after the data management company posted blowout fiscal third-quarter numbers and boosted guidance.The stock, which debuted on the market in April 2024, had its second-best day on record. Revenue jumped 48% from a year earlier to $350 million, topping the $320 million average analyst estimate, according to LSEG. In its announcement late Thursday, Rubrik reported adjusted earnings of 10 cents per share, while analysts had expected a loss of 17 cents per share. The company boosted revenue guidance for the fiscal year to a range of $1.28 billion to $1.282 billion, up from a previous high of $1.237 billion. CEO Bipul Sinha told CNBC's \"Closing Bell: Overtime\" on Thursday that the company's strength in cyber resilience and its recent move into safeguarding artificial intelligence agents is fueling its rapid growth.\"As businesses are taking on agents, their biggest worry is, they don't know what the hell is going on,\" Sinha said. \"What are these agents doing? Are they hallucinating? Do they have guardrails? And if they do make mistakes, can we undo those mistakes?\"Read more CNBC tech newsElon Musk's X fined $140 million by European Commission over 'deceptive' blue checkmark and lack of transparency'China's Nvidia' Moore Threads surges over 400% on trading debut after $1.1 billion listingApple announces departure of general counsel and policy chiefMicrosoft will raise prices of commercial Office subscriptions in JulyIn the three-month period ended Oct. 31, Rubrik had a net loss of $63.83 million, or a loss of 32 cents per share, narrowing significantly from the net loss a year ago of $130.91 million, or a loss of 71 cents per share.On an earnings call with analysts Thursday, Sinha said Rubrik is winning business by replacing legacy vendors.He said one of the largest banks in Asia opted for Rubrik over a long-term vendor, as did a Fortune 250 professional services firm, and the push is due to the growth in AI and the evolving threat of cyberattacks.\"With AI, the cyberattacks have become more prevalent because the attackers are using AI,\" Sinha told CNBC. \"So we believe we are in the early days of a very, very large market and will continue to grow at rapid pace for the foreseeable future.\"watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rubrik stock rips 22% higher after blowing out earnings and boosting guidance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107406463-17140664872024-04-25t170232z_1340097878_rc2rd7az9l0b_rtrmadp_0_rubrik-ipo.jpeg?v=1714066599&w=1920&h=1080"
      ],
      "datePublished": "2025-12-05T21:13:03.000Z",
      "dateModified": "2025-12-05T21:13:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]