[
  {
    "title": "Paramount Skydance to acquire Bari Weiss-founded Free Press",
    "url": "https://www.cnbc.com/2025/10/06/paramount-skydance-to-acquire-bari-weiss-founded-free-press.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108055956-1730408770964-gettyimages-2160341077-zawrzel-business240706_npYvL.jpeg?v=1759523540&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T13:26:03.000Z",
    "description": "<div><div><p>CBS News studio at Times Square in Manhattan, New York, United States of America, on July 6th, 2024.</p><p> Beata Zawrzel | Nurphoto | Ge",
    "body": "<div><div><p>CBS News studio at Times Square in Manhattan, New York, United States of America, on July 6th, 2024.</p><p> Beata Zawrzel | Nurphoto | Getty Images</p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/PSKY/\">Paramount Skydance</a><span><span></span></span></span> said Monday it has agreed to acquire online publication The Free Press, naming its co-founder and CEO, Bari Weiss, as CBS News' editor-in-chief.</p><p>Paramount Skydance <a href=\"https://www.axios.com/2025/10/06/paramount-skydance-acquires-the-free-press\" target=\"_blank\">reportedly</a> paid $150 million for The Free Press. </p><p>The digital upstart publication, which was launched by Weiss in 2021, will be joined with CBS News. Paramount said Monday The Free Press has 1.5 million subscribers, more than 170,000 of which are paid subscriptions.</p><p>Weiss founded The Free Press after resigning from The New York Times' opinion desk in 2020.</p><p>\"Weiss will shape editorial priorities, champion core values across platforms, and lead innovation in how the organization reports and delivers the news,\" Paramount said in <a href=\"https://www.paramount.com/press/paramount-announces-deal-to-acquire-the-free-press\" target=\"_blank\">a news release.</a></p><p>Weiss will report to Paramount Skydance CEO David Ellison.</p><p>The acquisition marks the latest in a string of strategic moves by Ellison since the merger of Paramount and Skydance was <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/24/fcc-approves-8-billion-paramount-skydance-merger.html\">completed</a> in August.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paramount Skydance to acquire Bari Weiss-founded Free Press",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108055956-1730408770964-gettyimages-2160341077-zawrzel-business240706_npYvL.jpeg?v=1759523540&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T13:26:03.000Z",
      "dateModified": "2025-10-06T13:26:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nike's turnaround will 'take a while,' CEO Elliott Hill says",
    "url": "https://www.cnbc.com/2025/10/06/nike-ceo-interview-elliott-hill-turnaround.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108167427-1751520502479-gettyimages-2222589973-AFP_64LN3ZQ.jpeg?v=1759756873&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T14:14:13.000Z",
    "description": "<div><div><p>A Nike store in Hanoi, Vietnam, on July 3, 2025.</p><p>Nhac Nguyen | Afp | Getty Images</p></div><div><p><span><a target=\"_blank\" href=\"h",
    "body": "<div><div><p>A Nike store in Hanoi, Vietnam, on July 3, 2025.</p><p>Nhac Nguyen | Afp | Getty Images</p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NKE/\">Nike</a><span><span></span></span></span>'s turnaround plan is <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/30/nike-nke-q1-2026-earnings.html\">showing early signs of progress</a>, but it will \"take a while\" for the company to return to profitable growth, CEO Elliott Hill said in an interview with <a target=\"_blank\" href=\"https://www.cnbc.com/sara-eisen/\">CNBC's Sara Eisen</a> aired Monday.</p><p>\"When we come to work we think about three brands, and then multiple sports under each brand and then 190 countries that roll up to our four geographies,\" Hill said in a sit-down interview from the company's headquarters in Beaverton, Oregon. \"Each brand times sport, and each [geography] times country, they're at different stages of the evolution.\" </p><p>When asked when investors can expect Nike to get back to mid-to-high single digit revenue growth with strong margins, Hill acknowledged that \"it'll take time.\" But he said the company has \"the path\" to get there. </p><p>\"It's gonna take a while,\" said Hill. \"It's not linear. But it is a portfolio, and ultimately the goal is to have the entire portfolio all working together to drive the revenue and the profit that we hope to deliver for all of our investors.\" </p><p>The comments come nearly a year into <a target=\"_blank\" href=\"https://www.cnbc.com/2024/09/19/nike-ceo-john-donahoe-is-out-replaced-by-elliott-hill.html\">Hill's tenure as CEO</a>. Investors are looking for more clarity into how well his strategy to turn around the company is working as quarterly sales and profits have declined for much of the last year.</p><p>The struggles have shown in Nike's stock, which has fallen about 12% in the last year. While Wall Street knows how Hill plans to fix the company, it is still unclear how long it will take.</p></div><div><p>Elliott Hill, CEO of Nike, speaking with CNBC. </p><p>CNBC</p></div><div><p>Since Hill took over last October, he's worked to reverse many of the strategies implemented by his predecessor, former <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/EBAY/\">eBay</a><span><span></span></span></span> CEO John Donahoe, who tried to sell more shoes and apparel directly to shoppers. Instead of focusing on sales only through Nike's website and stores, Hill is moving back to wholesalers and working to win back shelf space that competitors have taken over. </p><p>During his interview with Eisen, Hill said Donahoe's focus on digital sales made sense during the Covid pandemic, but that changed when the world started to open up again. </p><p>\"When Covid hit, supply got constrained, demand goes up and I think the team did what I think anybody would do. Shift product over to digital commerce and all of a sudden that takes off. Double revenue, double margins and it's a winning strategy,\" said Hill.</p><p>\"Then of course everything normalized,\" he said. \"Physical retail started to open back up and we continued on with that strategy … and I think over time it ended up hurting the brand because there's a certain set of consumers that want to shop choice, and they want to shop across each of the different channels of distribution.\" </p><p>Hill said the company has made strides toward taking back the shelf space it lost. Nike is also trying fresh partners, such as Aritiza, to win over new, female shoppers. </p><p>Hill is also <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/28/nike-to-lay-off-about-1percent-of-corporate-staff.html\">changing the way the business is segmented</a> and returning it to its historical roots. Instead of dividing the company into women's, men's and kid's, Donahoe's strategy to drive lifestyle sales, Hill is reworking the corporate structure so the company's departments are focused on individual sports. </p><p>\"They have small cross-functional teams in each of those segments, if you will, of business and the idea is that the consumers in each of those segments and the competition in each of those segments is different and so by having these small cross-functional teams… that's really helped us get sharp in a couple of areas,\" said Hill.</p><p>Under Donahoe, Nike faced criticism for <a target=\"_blank\" href=\"https://www.cnbc.com/2024/04/12/nike-ceo-blames-remote-work-for-innovation-slowdown.html\">falling behind on innovation</a> and losing market share because it was so focused on driving sales of classic styles, like the Air Force 1 and Nike Dunks. Changing the company structure is one of the ways Hill plans to reignite innovation because the teams will be squarely focused on the individual needs of different athletes, allowing them to create and deliver better products for those consumers. </p><p>Many industry insiders expect Nike to make a complete recovery, but larger macroeconomic challenges will make a tough turnaround that much harder. </p><p>When reporting fiscal first-quarter earnings last week, Nike warned that it now expects tariffs to cost it $1.5 billion in its current fiscal year, up from the $1 billion it projected in June. Those costs are expected to impact its gross margin by 1.2 percentage points in its current fiscal year, up from the 0.75 percentage points it originally forecast. </p><p>Hill told Eisen the company is working to offset the cost of tariffs by leaning on its suppliers, factories and retail partners. Nike also recently <a target=\"_blank\" href=\"https://www.cnbc.com/2025/05/21/nike-price-increases-tariffs.html\">implemented certain price increases</a>, which could help blunt the impact of the new duties. </p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nike's turnaround will 'take a while,' CEO Elliott Hill says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108167427-1751520502479-gettyimages-2222589973-AFP_64LN3ZQ.jpeg?v=1759756873&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T14:14:13.000Z",
      "dateModified": "2025-10-06T14:14:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Online holiday spending growth set to slow to 5.3% as shoppers seek discounts",
    "url": "https://www.cnbc.com/2025/10/06/online-holiday-spending-growth-adobe-report.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108081969-1735925319773-gettyimages-1744124538-252-0350.jpeg?v=1759429577&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T14:22:47.000Z",
    "description": "<div><div><p>Alistair Berg | Digitalvision | Getty Images</p></div><div><p>Online holiday spending in the U.S. is expected to jump 5.3% year over year",
    "body": "<div><div><p>Alistair Berg | Digitalvision | Getty Images</p></div><div><p>Online holiday spending in the U.S. is expected to jump 5.3% year over year to $253.4 billion as consumers seek discounts and even enlist the help of artificial intelligence-powered chatbots, according to an Adobe Analytics report released Monday.</p><p>Yet that growth would still be slower than the year-ago holiday season, when online sales rose 8.7% from Nov. 1 to Dec. 31, the company said. Adobe's data tracks more than 1 trillion visits to U.S. retail websites, 100 million unique items and 18 different product categories.</p><p>That growth is also below the 10-year average of roughly 13% annually. That mark was partially skewed by the 32% year-over-year growth in 2020 when consumers leaned on retailers' online options during the Covid pandemic.</p></div><div><p>Customers' desire to celebrate the season with decor and gifts — and to take advantage of lower prices during a promotional time — will prop up spending even at an uncertain time for the U.S. economy, said Vivek Pandya, Adobe's director of digital insights.</p><p>\"The holiday season is one of the areas where they do feel much more of an onus and a drive to get the goods they need,\" he said. \"We're seeing them willing to spend and capitalize on these sales moments.\"</p><p>Plus, he said consumers have embraced the habit of stockpiling goods if they feel prices may be volatile, which could help to stabilize spending.</p><p>He said while holiday spending is expected to slow from last year, \"given everything that the consumer is dealing with, it's still pronounced growth.\"</p><p>Higher online spending may not necessarily translate to a boost in overall holiday sales. Adobe's data tracks only e-commerce, and the company estimates about 1 in 4 dollars of holiday sales will be spent online, Pandya said.</p><p>Retail sales in the U.S. have chugged along this year, but concerns about <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/11/consumer-prices-rose-at-annual-rate-of-2point9percent-in-august-as-weekly-jobless-claims-jump.html\">higher prices from tariffs</a> and <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/30/consumer-confidence-is-lower-than-expected-as-wall-street-braces-for-shutdown-data-blackout.html\">dipping consumer confidence</a> have complicated the outlook for the critical shopping season. Some holiday forecasts, which capture both in-store and online spending, have predicted more modest growth than in recent years or even a decline.</p><p>Holiday spending across stores and online is expected to grow 4% year over year – a decline from the 10-year average of 5.2% growth, according to consulting firm Bain & Co.'s projections.</p><p>Consumers said they <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/03/holiday-shopping-gen-z-retailers.html\">plan to spend about 5% less</a> – or an average of $1,552 – on holiday gifts, travel and entertainment, compared with the year-ago season, according to a survey by consulting firm PwC, which included a representative sample of 4,000 U.S. consumers and was conducted in late June and early July. That projected spending, in particular, was <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/03/holiday-shopping-gen-z-retailers.html\">dragged down by members of Gen Z</a> saying that they planned to spend 23% less than the year-ago holiday season, according to PwC's survey.</p><p>Adobe expects the peak of holiday<strong> </strong>spending during Cyber Week, which stretches from Thanksgiving through the Monday after Christmas that's dubbed Cyber Monday. That five-day period is expected to drive 17.2%, or $43.7 billion, of overall online holiday spending, Adobe said, roughly in line with the 17% that period accounted for in the year-ago holiday season.</p><p>Discounting levels will be roughly similar to the year-ago holiday season, Adobe predicted, with slightly weaker discounts in some categories. For example, discounts on electronics are expected to peak at 28% off the listed price compared with 30.1% in the year-ago period. Adobe expects toys to hit 27% off compared with 28% in the year-ago period.</p><p>Mobile devices will be the primary driver for online shopping, Adobe said, with the company expecting holiday shopping done there to account for 56.1% of online spending compared with desktops. It's a meaningful jump from the 40% of online spending that mobile devices represented during the 2020 holiday season.</p><p>As shoppers search for gifts, more are expected to turn to generative AI-powered chat services and browsers to research what toys, jewelry, clothing or other items to buy. Adobe expects AI traffic to rise by 520% year over year, with the busiest traffic days leading up to Thanksgiving.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Online holiday spending growth set to slow to 5.3% as shoppers seek discounts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108081969-1735925319773-gettyimages-1744124538-252-0350.jpeg?v=1759429577&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T14:22:47.000Z",
      "dateModified": "2025-10-06T14:22:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Supreme Court rejects appeal of Ghislaine Maxwell for Epstein abetting conviction",
    "url": "https://www.cnbc.com/2025/10/06/supreme-court-ghislaine-maxwell-epstein-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106615494-15947376452020-07-02t000000z_2006614165_rc29lh9epjoz_rtrmadp_0_people-ghislaine-maxwell.jpeg?v=1598639650&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T14:16:13.000Z",
    "description": "<div><div><p>Ghislaine Maxwell, longtime associate of accused sex trafficker Jeffrey Epstein, speaks at a news conference on oceans and sustainable de",
    "body": "<div><div><p>Ghislaine Maxwell, longtime associate of accused sex trafficker Jeffrey Epstein, speaks at a news conference on oceans and sustainable development at the United Nations in New York, June 25, 2013 in this screengrab taken from United Nations TV file footage.</p><p>UNTV | Reuters</p></div><div><p><br />The <a href=\"https://www.supremecourt.gov/orders/courtorders/100625zor_5368.pdf\" target=\"_blank\">Supreme Court</a> on Monday said it would not hear the <a href=\"https://www.supremecourt.gov/DocketPDF/24/24-1073/355252/20250424150144637_24-__PetitionForWritOfCertiorari.pdf\" target=\"_blank\">appeal</a> of <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/24/jeffrey-epstein-ghislaine-maxwell-doj-meeting.html\">Ghislaine Maxwell</a>, the former British socialite who was convicted of sex trafficking related to the sexual abuse of underage girls by <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/28/trump-jeffrey-epstein-maxwell-workers.html\">Jeffrey Epstein</a>.</p><p>The decision comes as the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/23/trump-jeffrey-epstein-files-wsj.html\">Trump</a> administration remains the focus of criticism for its refusal to release investigative files about Epstein and Maxwell despite prior promises to make those documents public.</p><p>The Supreme Court did not indicate how many of its nine justices, if any, would have granted Maxwell's request to hear her appeal.</p><p>Maxwell's attorneys argued to the court that she should not have been prosecuted at all by federal authorities in New York. </p><p>They cited a non-prosecution agreement Epstein obtained from the U.S Attorney's Office for the Southern District of Florida that included a provision that the United States not lodge any criminal charges against \"any potential co-conspirators of Epstein.\"</p><p>Epstein, under the terms of that agreement, pleaded guilty in 2008 to Florida state charges related to procuring a minor for prostitution.</p><p>Maxwell, 63, is serving a 20-year prison sentence for her crimes.</p><p>She was convicted in Manhattan federal court in 2022, three years after Epstein killed himself in a federal jail shortly after being arrested on child sex trafficking charges.</p><p>With the Supreme Court's order Monday, Maxwell's final hope of winning an early release may be in obtaining a pardon or sentence commutation from President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a>, who is a former friend of both her and Epstein.</p><p> \"We're, of course, deeply disappointed that the Supreme Court declined to hear Ghislaine Maxwell's case,\" Maxwell's lawyer, David Oscar Markus, said in a statement to NBC News.</p><p>\"But this fight isn't over,\" Markus said. \"Serious legal and factual issues remain, and we will continue to pursue every avenue available to ensure that justice is done.\"</p><p>Maxwell is currently locked up in a minimum-security camp in Texas.</p><p>Maxwell was sent there from a more-restrictive prison in Florida shortly after a two-day interview with Deputy U.S. Attorney General Todd Blanche.</p><p> Maxwell's transfer to a minimum-security prison would have required a waiver under Bureau of Prisons policy because she is a convicted sex offender.</p><p>Blanche is Trump's former criminal defense lawyer. </p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Supreme Court rejects appeal of Ghislaine Maxwell for Epstein abetting conviction",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106615494-15947376452020-07-02t000000z_2006614165_rc29lh9epjoz_rtrmadp_0_people-ghislaine-maxwell.jpeg?v=1598639650&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T14:16:13.000Z",
      "dateModified": "2025-10-06T14:16:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aston Martin shares fall 10% as luxury carmaker issues fresh profit warning on tariff turmoil",
    "url": "https://www.cnbc.com/2025/10/06/aston-martin-carmaker-issues-fresh-profit-warning-on-tariff-turmoil.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108054647-1730273148382-gettyimages-2181059199-dmb-007_burlington_arcade_aston_martin005.jpeg?v=1759736908&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T10:53:04.000Z",
    "description": "<div><div><p>The Aston Martin DB12 Goldfinger Edition during the 007 takeover of Burlington Arcade on Oct. 29, 2024, in London, England.</p><p>Dave Be",
    "body": "<div><div><p>The Aston Martin DB12 Goldfinger Edition during the 007 takeover of Burlington Arcade on Oct. 29, 2024, in London, England.</p><p>Dave Benett | Getty Images Entertainment | Getty Images</p></div><div><p>Shares of <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/undefined/\">Aston Martin</a><span><span></span></span></span> fell as much as 10% on Monday morning after the British luxury carmaker issued a fresh profit warning, citing a challenging industry outlook and uncertainties over tariffs.</p><p>The company, which is famed for both its role in the James Bond movies and its history of financial ups and downs, <a href=\"https://otp.tools.investis.com/clients/uk/astonmartin/rns/regulatory-story.aspx?cid=2424&newsid=1993888\" target=\"_blank\">said</a> it expects its 2025 total wholesale volumes to fall by a \"mid-high single digit percentage\" compared to last year's 6,030 units.</p><p>Aston Martin also said it no longer expects positive free cash flow generation in the second half of the year and initiated an immediate review of future cost and capital expenditure.</p><p>Analysts had expected the company to log an earnings before interest and taxes (EBIT) loss of £110 million ($147.8 million), according to estimates compiled by the company.</p></div><div><div><svg width=\"256\" height=\"256\">Stock Chart IconStock chart icon</svg><p><img src=\"https://static-redesign.cnbcfm.com/dist/a54b41835a8b60db28c2.svg\" alt=\"hide content\" /></p></div><p>Aston Martin</p></div><div><p>\"The global macroeconomic environment facing the industry remains challenging,\" the automaker said in a release Monday. \"This includes uncertainties over the economic impact from U.S. tariffs and the implementation of the quota mechanism, changes to China's ultra-luxury car taxes and the increased potential for supply chain pressures.\"</p><p>Shares of Aston Martin were trading around 7% lower at 11:44 a.m. London time (6:44 a.m. ET). The stock is down around 29% year-to-date.</p></div><h2><a></a>'More proactive support'</h2><div><p>U.S. President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> has shaken up the global economy this year by imposing tariffs on goods reaching the U.S. from countries across the globe.</p><p>The automotive sector, for its part, is regarded as <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/22/trumps-tariffs-take-their-toll-on-europes-auto-giants-in-charts.html\">acutely vulnerable to tariffs</a>, given the high globalization of supply chains and the heavy reliance on manufacturing operations across North America.</p><p>Under a U.S.-U.K. trade deal <a href=\"https://www.gov.uk/government/news/landmark-economic-deal-with-united-states-saves-thousands-of-jobs-for-british-car-makers-and-steel-industry\" target=\"_blank\">agreed</a> in May, the two countries reached a deal to limit tariffs on 100,000 British-made cars a year to 10%.</p><p>Aston Martin said Monday that the quota mechanism \"adds a further degree of complexity and limits the Group's ability to accurately forecast for this financial year end and, potentially, quarterly from 2026 onwards.\"</p><p>The company said it continues to engage with both the White House and U.K. government on tariffs \"to secure greater clarity and certainty,\" noting that \"positive dialogue\" on this matter had been achieved directly with the Trump administration.</p><p>It called for \"more proactive support\" from U.K. lawmakers, however, urging them \"to protect the interests of small volume manufacturers, like Aston Martin, who provide thousands of jobs, making an important contribution to local economies and to the wider UK automotive supply chain.\"</p><p>In response, a U.K. government spokesperson said the country's automotive sector had been \"a real priority in our landmark trade deal\" with the U.S.</p><p>\"We remain the only country to have a tariff rate as low as 10% for cars, protecting thousands of jobs in the sector,\" they added.</p><p>\"We are working with industry so that they can take advantage of the quota effectively and fairly while ensuring the UK remains a top destination for investment in automotive manufacturing through our Plan for Change.\"</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aston Martin shares fall 10% as luxury carmaker issues fresh profit warning on tariff turmoil",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108054647-1730273148382-gettyimages-2181059199-dmb-007_burlington_arcade_aston_martin005.jpeg?v=1759736908&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T10:53:04.000Z",
      "dateModified": "2025-10-06T10:53:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Verizon names former PayPal boss Dan Schulman as new CEO, replacing Hans Vestberg",
    "url": "https://www.cnbc.com/2025/10/06/verizon-ceo-dan-schulman-replaces-hans-vestberg.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106351594-1579791977326dsc03513r.jpg?v=1579792034&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T13:34:23.000Z",
    "description": "<div><div><p>Dan Schulman, CEO, Paypal speaking at the World Economic Forum in Davos, Switzerland, Jan. 23, 2020.</p><p>Adam Galacia | CNBC</p></div><",
    "body": "<div><div><p>Dan Schulman, CEO, Paypal speaking at the World Economic Forum in Davos, Switzerland, Jan. 23, 2020.</p><p>Adam Galacia | CNBC</p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/VZ/\">Verizon</a><span><span></span></span></span> announced on Monday that the board of directors has appointed former <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/PYPL/\">PayPal</a><span><span></span></span></span> CEO Dan Schulman as the company's new CEO.</p><p>Schulman replaces Hans Vestberg, who had led the company since 2018.</p><p>Shares of the company sank roughly 2% in morning trading.</p><p>Verizon said Vestberg will remain on the board of directors until the 2026 annual meeting and will serve as a special advisor through Oct. 4, 2026, to ensure a smooth transition and close the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/05/16/us-approves-verizon-deal-to-acquire-frontier-after-dei-changes.html\">deal</a> to acquire <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/FYBR/\">Frontier Communications</a><span><span></span></span></span>.</p><p>Verizon on Monday also announced that Mark Bertolini would be chairman of the company's board of directors.</p><p>\"The board is thrilled to have Dan as Verizon's next CEO, and embark on a new chapter of growth and sector leadership,\" Bertolini said in a statement. \"Dan is a seasoned and decisive leader with a unique set of experiences, and a proven record of transformative leadership and operational excellence. He is the right leader to chart Verizon's next phase of increased customer focus and financial growth.\"</p><p>At PayPal, Schulman grew the company's revenue from $8 billion to $30 billion, according to the announcement, and added \"hundreds of millions\" of new customers for the global payments platform. He has served on Verizon's board of directors since 2018.</p><p>\"Verizon is at a critical juncture,\" Schulman said in a statement. \"We have a clear opportunity to redefine our trajectory, by growing our market share across all segments of the market, while delivering meaningful growth in our key financial metrics. We are going to maximize our value propositions, reduce our cost to serve, and optimize our capital allocation to delight our customers and deliver sustainable long-term growth for our shareholders.\"</p><p>Vestberg, who became CEO in 2018 and chairman of the board in 2019, is known for creating the company's 5G network strategy. In a statement, he said now was \"a good time to pass the baton\" to Schulman.</p><p>Verizon also reiterated its previously issued full-year 2025 financial guidance.</p><p>In May, the Federal Communications Commission announced it was approving Verizon's $20 billion deal to <a target=\"_blank\" href=\"https://www.cnbc.com/2024/09/05/verizon-vz-to-acquire-frontier-communications.html\">acquire Frontier</a>, a fiber-optic internet provider. FCC chair Brendan Carr had probed Verizon for its diversity, equity and inclusion programs and said they could be a factor in the Frontier deal, but the agency gave its blessing to the merger when the company agreed to end those programs.</p><p>Verizon said the deal will allow it to upgrade and expand Frontier's network capabilities across the country by bringing more fiber to roughly 1 million American households. Verizon called the acquisition \"a cornerstone\" of its broadband expansion strategy.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Verizon names former PayPal boss Dan Schulman as new CEO, replacing Hans Vestberg",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106351594-1579791977326dsc03513r.jpg?v=1579792034&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T13:34:23.000Z",
      "dateModified": "2025-10-06T13:34:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tesla teaser video sparks speculation of long-awaited Roadster or mass market model",
    "url": "https://www.cnbc.com/2025/10/06/tesla-teaser-video-sparks-speculaton-of-roadster-or-mass-market-model.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108168278-17518962972025-06-13t010710z_885255829_rc2gk1a9xltd_rtrmadp_0_space-warfare.jpeg?v=1753301789&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T09:09:21.000Z",
    "description": "<div><div><p>Elon Musk, CEO of SpaceX and Tesla, attends the Viva Technology conference at the Porte de Versailles exhibition center in Paris on June ",
    "body": "<div><div><p>Elon Musk, CEO of SpaceX and Tesla, attends the Viva Technology conference at the Porte de Versailles exhibition center in Paris on June 16, 2023.</p><p>Gonzalo Fuentes | Reuters</p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/TSLA/\">Tesla</a><span><span></span></span></span> posted a teaser video on X sparking speculation that the electric carmaker could be gearing up to release a new car.</p><p>The <a href=\"https://x.com/Tesla/status/1974732638863974735\" target=\"_blank\">first video</a> posted on Sunday shows a spinning component which many online said could be an internal component of a vehicle. The video ends with the numbers \"10/7,\" indicating Tuesday's date.</p><p>A second <a href=\"https://x.com/Tesla/status/1975005586283434056\" target=\"_blank\">video</a> also posted on Sunday shows just the headlights of a car.</p><p>The teasers have sparked conversation online and among analysts about what Tesla is up to — and two theories have emerged.</p><p>The first is that it could be the next-generation Roadster vehicle that Tesla CEO Elon Musk has been promising for years. </p><p>The second is that Tesla could be about to unveil a long-awaited mass market model.</p><p>Musk teased the next-generation Roadster concept back at an <a target=\"_blank\" href=\"https://www.cnbc.com/2017/11/17/tesla-semi-and-roadster-impressed-but-questions-linger.html\">event in November 2017</a>, and in June 2018 in a series of tweets.</p><p>The billionaire has since hyped the vehicle repeatedly and, in September, <a href=\"https://twitter.com/elonmusk/status/1968314477658677361\" target=\"_blank\">said on X</a> that \"the new Roadster is something special beyond a car.\"</p><p>Musk has a history of promising things that are either not delivered or take substantially longer than he initially says.</p><p>Meanwhile, Tesla has been saying a cheaper mass-market car will hit the market this year. However, Musk has confirmed this lower cost offering will effectively be a <a target=\"_blank\" href=\"https://www.cnbc.com/video/2025/03/14/teslas-next-model-described-as-a-stripped-down-model-y-with-a-price-tag-under-30k.html\">stripped down Model Y</a>.</p><p>For investors, a mass-market model is seen as key to revitalizing Tesla's sales. While Tesla reported a <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/tesla-tsla-q3-2025-vehicle-delivery-production.html\">jump in auto deliveries </a>in the third quarter of the year, this was attributed to a pull forward in demand due to the expiration of a federal tax credit. In the quarter before, Tesla reported a delivery decline.</p><p>The company has seen a <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/teslas-continuing-sales-slump-in-europe-weighs-on-stock-price.html\">continuous slump in sales in Europe</a>, and it continues to face heavy competition in China, another key market, from local players like BYD which are also expanding overseas.</p><p>Chinese players have been launching low-cost offerings in Europe and elsewhere putting more pressure on Tesla to released a model at around the $25,000 to $30,000 mark.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tesla teaser video sparks speculation of long-awaited Roadster or mass market model",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108168278-17518962972025-06-13t010710z_885255829_rc2gk1a9xltd_rtrmadp_0_space-warfare.jpeg?v=1753301789&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T09:09:21.000Z",
      "dateModified": "2025-10-06T09:09:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fifth Third Bancorp to buy Comerica for $10.9 billion in all-stock deal",
    "url": "https://www.cnbc.com/2025/10/06/fifth-third-bancorp-to-buy-comerica-for-10point9-billion-in-all-stock-deal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108145237-1747213585807-16_9_fifth_third_branch_exterior_night2x.png?v=1747213668&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T13:40:54.000Z",
    "description": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108208112-17597560571759756054-41972155725-1080pnbcnews.jpg?v=1759756056&w=750&h=422&vtcr",
    "body": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108208112-17597560571759756054-41972155725-1080pnbcnews.jpg?v=1759756056&w=750&h=422&vtcrop=y\" alt=\"Fifth Third CEO Tim Spence: We will be able to scale Comerica's middle market platform with deal\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/FITB/\">Fifth Third Bancorp</a><span><span></span></span></span> said Monday it will acquire fellow regional bank <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/CMA/\">Comerica</a><span><span></span></span></span> for $10.9 billion in an all-stock deal that will create one of the largest U.S. banks by assets.</p><p>When the deal closes, it will create the ninth-largest U.S. bank — with roughly $288 billion in assets. The transaction is expected to finalize in the first quarter of 2026.</p><p>\"The things that have defined Fifth Third over the course of the past 10 years have been this focus on stability, profitability and our ability to drive organic growth,\" Fifth Third CEO Tim Spence told CNBC's <br />\"Squawk Box\" in an interview Monday. \"What's defined Comerica is an incredible middle-market commercial banking platform, and the access that Comerica has to high growth markets like Texas and large economies like California.\"</p><p>Spence said the bank intends to build 150 branches in Texas and \"move into a top five position in Dallas, Houston and Austin.\" </p><p>\"In an environment where merger approvals are coming faster, it builds our confidence,\" he said. \"Regulators believed we had the capacity to run a much larger bank.\" </p><p>Comerica shares rallied about 15% in early trading following the announcement. Fifth Third traded slightly lower. </p></div><div><div><svg width=\"256\" height=\"256\">Stock Chart IconStock chart icon</svg><p><img src=\"https://static-redesign.cnbcfm.com/dist/a54b41835a8b60db28c2.svg\" alt=\"hide content\" /></p></div><p>CMA and FITB 5-day chart</p></div><div><p>\"Joining with Fifth Third – with its strengths in retail, payments and digital – allows us to build on our leading commercial franchise and further serve our customers with enhanced capabilities across more markets,\" Comerica Chief Executive Curt Farmer wrote in a statement.</p><p>The <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/KRE/\">SPDR S&P Regional Banking ETF (KRE)</a><span><span></span></span></span> jumped 1% in premarket trading on expectations this deal will be the start of many more in the reginal banking space as the Trump administration and Republicans ease regulations and takeover scrutiny.</p><p><em>— CNBC's Luke Fountain contributed to this report.</em> </p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fifth Third Bancorp to buy Comerica for $10.9 billion in all-stock deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108145237-1747213585807-16_9_fifth_third_branch_exterior_night2x.png?v=1747213668&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T13:40:54.000Z",
      "dateModified": "2025-10-06T13:40:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Democratic leader Jeffries challenges GOP House Speaker Johnson to debate shutdown",
    "url": "https://www.cnbc.com/2025/10/06/government-shutdown-jeffries-johnson-debate.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108050590-1729538619230-Johnson_Jeffries.jpg?v=1759758381&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T14:19:58.000Z",
    "description": "<div><div><p>U.S. Speaker of the House Mike Johnson (R-LA) and U.S. House of Representatives Democratic Leader Hakeem Jeffries (D-NY).</p><p>Tom Willi",
    "body": "<div><div><p>U.S. Speaker of the House Mike Johnson (R-LA) and U.S. House of Representatives Democratic Leader Hakeem Jeffries (D-NY).</p><p>Tom Williams | Michael A. McCoy | Reuters</p></div><div><p>Top House Democratic Rep. Hakeem Jeffries on Monday challenged Republican House Speaker Mike Johnson to a live public debate about the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/06/government-shutdown-trump-hassett-vought.html\">government shutdown</a>.</p><p>\"Given the urgency of the moment and the Republican refusal to negotiate a bipartisan agreement, a debate on the House Floor will provide the American people with the transparency they deserve,\" Jeffries said in a letter to Johnson.</p><p>\"It will also give you an opportunity to explain your my way or the highway approach to shutting the government down, when Democratic votes are needed to resolve the impasse that exists,\" the New York Democrat told the leader from Louisiana.</p></div><div><h2>Read more CNBC politics coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/05/trump-layoffs-government-shutdown-kevin-hassett-.html\">'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/trump-face-coin-treasury-dollar.html\">Treasury weighs minting $1 coin with Trump's face for U.S. 250th anniversary</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/government-shutdown-updates-thune-trump.html\">Government shutdown: Senate funding measures fail again as deadlock continues</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-israel-gaza-hamas-peace-plan.html\">Watch: Trump details plan to end Israel war with Hamas in Gaza</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-health-government-shutdown-jeffries-schumer.html\">Democrats refuse to cave on health care before Trump government shutdown meeting</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-zohran-mamdani-eric-adams-new-york-mayor.html\">Trump bashes Zohran Mamdani after Eric Adams drops out of New York mayor's race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-movie-furniture-tariffs.html\">Trump 'Truths' about tariffs on films and furniture raise questions on details</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/trump-mass-firings-government-shutdown.html\">Trump threatens mass firings if shutdown isn't averted: NBC News</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/government-shutdown-trump-democrats-republicans-health-care.html\">Republicans say Obamacare tax credit fight can wait until after shutdown averted</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/jd-vance-trump-tiktok-china-bytedance.html\">JD Vance on Tiktok: U.S. 'successfully separated' TikTok from China's ByteDance</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/eric-adams-new-york-city-mayor-race-trump-.html\">Eric Adams drops out of New York City mayoral race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/27/trump-cartoon-firing-powell-fed.html\">President Trump posts cartoon image depicting him firing Fed Chief Powell</a></li></ul></div></div><div><p>Jeffries threw down the gauntlet on the sixth day of the federal government shutdown, which is dragging on with no end in sight as Republican and Democratic leaders dig in their heels on opposing funding priorities.</p><p>In the letter, Jeffries told Johnson he is game to debate on the House floor \"any day this week in primetime, broadcast live to the American people.\"</p><p>The House is out of session this week.</p><p>A spokeswoman for Johnson did not immediately respond to CNBC's request for comment on the letter.</p><p><strong>This is developing news. Please check back for updates.</strong></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Democratic leader Jeffries challenges GOP House Speaker Johnson to debate shutdown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108050590-1729538619230-Johnson_Jeffries.jpg?v=1759758381&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T14:19:58.000Z",
      "dateModified": "2025-10-06T14:19:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration resumes student loan forgiveness for some borrowers ",
    "url": "https://www.cnbc.com/2025/10/06/student-loan-forgiveness-for-ibr-resumes.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108141550-1746538738410-gettyimages-2211023881-AFP_43AF9CV.jpeg?v=1759748766&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T12:45:18.000Z",
    "description": "<div><div><p>US President Donald Trump signs executive orders relating to higher education institutions, alongside US Secretary of Education Linda McM",
    "body": "<div><div><p>US President Donald Trump signs executive orders relating to higher education institutions, alongside US Secretary of Education Linda McMahon (R), in the Oval Office of the White House in Washington, DC, on April 23, 2025. </p><p>Saul Loeb | Afp | Getty Images</p></div><div><p>The Trump administration has resumed forgiving <a target=\"_blank\" href=\"https://www.cnbc.com/student-loans/\">student debt</a> for some borrowers enrolled in a program that's been <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/student-loan-forgiveness-income-based-repayment-plan.html\">partially paused since July</a>.</p><p>Now, borrowers who've been in repayment for decades and are eligible for <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/student-loan-repayment-plan-backlog-under-trump.html\">debt cancellation</a> under the <a href=\"https://studentaid.gov/help-center/answers/article/ibr-plan\" target=\"_blank\">Income-Based Repayment</a> plan, or IBR, are getting notices that they will soon receive the relief.</p><p>The U.S. Department of Education did not respond to a request for comment on the loan forgiveness actions. A CNBC reporter's email to a spokesperson at the agency was met with an automated message, saying, \"I will respond to emails once government functions resume.\"</p><p>But Scott Buchanan, executive director of the Student Loan Servicing Alliance, a trade group for the federal student loan servicers, confirmed to CNBC that IBR discharges have resumed.</p><p>Consumer advocates also tell CNBC they have heard from borrowers on IBR who received notices of forgiveness. Persis Yu, deputy executive director and managing counsel at Protect Borrowers, and Betsy Mayotte, president of The Institute of Student Loan Advisors, both said they know of borrowers who've been approved for the relief.</p></div><h2><a></a>Loan forgiveness paused since July</h2><div><p>Over the summer, the U.S. Department of Education announced that it would temporarily stop forgiving the debt of borrowers enrolled in IBR. According to the plan's terms, IBR concludes in debt erasure after 20 years or 25 years of payments, depending on the age of a borrower's loans.</p><p>IBR will be one of only a few repayment options left to many federal student loan holders after recent court actions and the passage by Congress of President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a>'s \"<a target=\"_blank\" href=\"https://www.cnbc.com/guide/what-trumps-one-big-beautiful-bill-means-for-your-money/\">big, beautiful bill</a>.\" That legislation phases out several existing student loan repayment plans.</p><p>The pause put many student loan borrowers who've been in repayment for decades and were eligible for forgiveness in an especially frustrating bind, said higher education expert Mark Kantrowitz. That's because IBR is the only income-driven repayment plan still available that leads to loan erasure, Kantrowitz said.</p><p><strong>More from Personal Finance:</strong><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/17/tuition-free-colleges-in-2025.html\">As some colleges near $100,000, these schools are free</a><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/12/college-majors-employment-prospects.html\">These college majors have the best job prospects</a><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/25/student-loan-forgiveness-tax-trump-big-beautiful-bill.html\">Student loan forgiveness may soon be taxed again</a></p><p>The Education Department told CNBC in July that it had paused loan forgiveness under IBR while it responds to recent court actions involving the Biden administration-era SAVE, or Saving on a Valuable Education, plan.</p><p>The department said that the 8th U.S. Circuit Court of Appeals <a target=\"_blank\" href=\"https://www.cnbc.com/2025/02/18/us-appeals-court-blocks-biden-save-plan-for-student-loans.html\">decision</a> in February, which blocked the SAVE plan, had other impacts on student loan repayment. Under the rule involving SAVE, certain periods during which borrowers postponed their payments would count toward their forgiveness timeline. With SAVE blocked now, borrowers no longer get credit during those forbearances.</p><p>The department said it had paused the relief while it assessed the correct payment counts for borrowers, and that anyone who made payments after becoming eligible for forgiveness would get a refund when the discharges continued.</p></div><h2><a></a>IBR relief central in recent lawsuit</h2><p>The paused IBR loan forgiveness became a central issue in the American Federation of Teacher's legal battle with the Education Department, Yu said. The teacher's union, which represents some 2 million members, filed its lawsuit against the Trump administration in March, accusing it of depriving student loan borrowers of their rights. Protect Borrowers is serving as AFT's legal counsel.</p><div><p>Still, the department's recent actions do not resolve the AFT litigation, Yu said. She said many other borrowers are still waiting for debt cancellation, including tens of thousands of people who believe they're eligible for <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/30/public-service-loan-forgiveness-pslf-becomes-harder-for-borrowers.html?msockid=2eef7e9809066c2415d868c3081f6df4\">Public Service Loan Forgiveness</a>. PSLF offers debt cancellation to those who've spent a decade working for certain not-for-profits or the government.</p><p>As of Aug. 31, there's a <a href=\"https://www.courtlistener.com/docket/69753739/42/american-federation-of-teachers-v-us-department-of-education/\" target=\"_blank\">74,510-person backlog</a> of borrowers waiting for their PSLF determination. Some of the borrowers <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/15/student-loan-forgiveness-trump-pslf-backlog.html\">CNBC has spoken with</a> had submitted their requests for loan forgiveness over half a year ago or more.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration resumes student loan forgiveness for some borrowers ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108141550-1746538738410-gettyimages-2211023881-AFP_43AF9CV.jpeg?v=1759748766&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T12:45:18.000Z",
      "dateModified": "2025-10-06T12:45:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Treasury Secretary Bessent to remain as IRS commissioner after filling role on temporary basis, sources say",
    "url": "https://www.cnbc.com/2025/10/06/bessent-to-remain-irs-commissioner-for-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108198735-17579397502025-09-15t071608z_559056879_rc27sgav0bpi_rtrmadp_0_usa-trump-tariffs-china.jpeg?v=1757939833&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T13:16:35.000Z",
    "description": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108208095-17597542951759754293-41971878892-1080pnbcnews.jpg?v=1759754294&w=750&h=422&vtcr",
    "body": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108208095-17597542951759754293-41971878892-1080pnbcnews.jpg?v=1759754294&w=750&h=422&vtcrop=y\" alt=\"Treasury Secretary Bessent to remain as IRS commissioner after filling role on temporary basis\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>Treasury Secretary Scott Bessent will remain in his role as commissioner of the Internal Revenue Service, with a new official to be announced as his top deputy, CNBC's Eamon Javers has learned.</p><p>Bessent took over the IRS in August after President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> removed Billy Long from the post just two months after his confirmation. No prior Treasury secretary also had led the IRS, raising questions over politicization of the tax collection service. Long has since been nominated to be the U.S. ambassador to Iceland.</p><p>Though the situation was supposed to be temporary, Trump has decided he wants Bessent to keep control of the agency, sources familiar with the matter tell CNBC.</p><p>While Bessent will maintain the role as commissioner, he is expected to announce that Frank Bisignano will serve in the newly created position of CEO at the IRS. Bisignano currently is commissioner of the Social Security Administration.</p><p>His new role will have Bisignano overseeing all day-to-day operations at the IRS, while also serving as SSA commissioner.</p><p>Bisignano previously was president and CEO of Fiserv, the world's largest financial services and payment technology company. He led the 2019 merger of Fiserv and First Data while serving as CEO of First Data.</p><p>In addition, he also served as co-chief operating officer and CEO of the mortgage banking unit of JPMorgan Chase in the 2000s. Before that, he held various roles at Citigroup.</p><p>Both Bessent and Bisignano are expected to wear two hats indefinitely within the administration.</p><p>In addition to his roles at the Treasury and IRS, Bessent has been leading the search to replace Federal Reserve Chair <a target=\"_blank\" href=\"https://www.cnbc.com/jay-powell/\">Jerome Powell</a> when his term expires as central bank chief in May 2026. Some 11 candidates have been interviewed so far, with that group expected to be pared down as soon as this week and then a group of three to five finalists sent to Trump, Bessent said recently on CNBC.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Treasury Secretary Bessent to remain as IRS commissioner after filling role on temporary basis, sources say",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108198735-17579397502025-09-15t071608z_559056879_rc27sgav0bpi_rtrmadp_0_usa-trump-tariffs-china.jpeg?v=1757939833&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T13:16:35.000Z",
      "dateModified": "2025-10-06T13:16:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump could 'start taking sharp measures' if next government funding bills fail: Hassett",
    "url": "https://www.cnbc.com/2025/10/06/government-shutdown-trump-hassett-vought.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108194877-1759753036660-108194877-1757081576126-gettyimages-2233144859-ah701992.jpg?v=1759753048&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T13:27:33.000Z",
    "description": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108208092-17597541151759754111-41971846415-1080pnbcnews.jpg?v=1759754114&w=750&h=422&vtcr",
    "body": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108208092-17597541151759754111-41971846415-1080pnbcnews.jpg?v=1759754114&w=750&h=422&vtcrop=y\" alt=\"NEC Director Kevin Hassett: Pres. Trump may 'start taking sharp measures' if next funding bill fails\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> could \"start taking sharp measures\" on Monday if the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/government-shutdown-updates-thune-trump.html\">government shutdown</a> continues after the Senate's next votes on stopgap funding bills, National Economic Council Director <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/05/trump-layoffs-government-shutdown-kevin-hassett-.html\">Kevin Hassett</a> said.</p><p>Hassett's warning on CNBC's \"<a target=\"_blank\" href=\"https://www.cnbc.com/squawk-box-us/\">Squawk Box</a>\" came after he said Democrats will be to blame for \"any government worker that loses their job\" due to reduction-in-force orders issued in response to the shutdown.</p><p>The Trump administration has repeatedly asserted that the shutdown will result in thousands of federal employees being laid off, rather than merely furloughed, as has been the case in past funding lapses.</p><p>Hassett said Monday morning that he expects Trump and other officials will be in the Oval Office watching the Senate's upcoming vote on a Republican funding proposal that, if passed, would end the shutdown.</p></div><div><h2>Read more CNBC politics coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/05/trump-layoffs-government-shutdown-kevin-hassett-.html\">'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/trump-face-coin-treasury-dollar.html\">Treasury weighs minting $1 coin with Trump's face for U.S. 250th anniversary</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/government-shutdown-updates-thune-trump.html\">Government shutdown: Senate funding measures fail again as deadlock continues</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-israel-gaza-hamas-peace-plan.html\">Watch: Trump details plan to end Israel war with Hamas in Gaza</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-health-government-shutdown-jeffries-schumer.html\">Democrats refuse to cave on health care before Trump government shutdown meeting</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-zohran-mamdani-eric-adams-new-york-mayor.html\">Trump bashes Zohran Mamdani after Eric Adams drops out of New York mayor's race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-movie-furniture-tariffs.html\">Trump 'Truths' about tariffs on films and furniture raise questions on details</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/trump-mass-firings-government-shutdown.html\">Trump threatens mass firings if shutdown isn't averted: NBC News</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/government-shutdown-trump-democrats-republicans-health-care.html\">Republicans say Obamacare tax credit fight can wait until after shutdown averted</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/jd-vance-trump-tiktok-china-bytedance.html\">JD Vance on Tiktok: U.S. 'successfully separated' TikTok from China's ByteDance</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/eric-adams-new-york-city-mayor-race-trump-.html\">Eric Adams drops out of New York City mayoral race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/27/trump-cartoon-firing-powell-fed.html\">President Trump posts cartoon image depicting him firing Fed Chief Powell</a></li></ul></div></div><div><p>Dueling Republican and Democratic bills have already failed to pass numerous times since the shutdown began six days earlier, after party leaders could not negotiate a compromise to keep the government open.</p><p>Both Republicans' \"clean\" resolution, which would resume funding at current levels through late November, and Democrats' version, which includes additional health-care funding and other measures, are set to come to a vote again after 5:30 p.m. ET.</p><p>Trump will be \"hoping that we're going to get the government to stop being shut down\" during those votes, Hassett told CNBC.</p><p>\"But if not, then I would guess that team in the Oval is going to start taking sharp measures,\" he said.</p><p><strong>This is developing news. Please check back for updates.</strong></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108208086-17597536641759753659-41971768788-1080pnbcnews.jpg?v=1759753663&w=750&h=422&vtcrop=y\" alt=\"Watch CNBC's full interview with White House National Economic Council Director Kevin Hassett\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump could 'start taking sharp measures' if next government funding bills fail: Hassett",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108194877-1759753036660-108194877-1757081576126-gettyimages-2233144859-ah701992.jpg?v=1759753048&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T13:27:33.000Z",
      "dateModified": "2025-10-06T13:27:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says",
    "url": "https://www.cnbc.com/2025/10/05/trump-layoffs-government-shutdown-kevin-hassett-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108191413-17563120822025-08-27t133731z_1467133196_rc2pfgaixlc2_rtrmadp_0_usa-trump.jpeg?v=1756312180&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-05T16:08:21.000Z",
    "description": "<div><div><p>White House National Economic Adviser Kevin Hassett talks to reporters on the West Wing driveway at the White House in Washington, D.C., ",
    "body": "<div><div><p>White House National Economic Adviser Kevin Hassett talks to reporters on the West Wing driveway at the White House in Washington, D.C., U.S., August 27, 2025. </p><p>Jonathan Ernst | Reuters</p></div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/white-house/\">White House</a> National Economic Council Director <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/20/hassett-likely-to-be-trumps-pick-for-fed-chief-though-warsh-is-more-qualified-cnbc-survey-finds.html\">Kevin Hassett</a> said Sunday that layoffs for federal employees will begin if President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> decides that congressional negotiations to end the government shutdown \"are absolutely going nowhere.\"</p><p>\"I think that everybody's still hopeful that when we get a fresh start at the beginning of the week, that we can get the Democrats to see that it's just common sense to avoid layoffs like that,\" Hassett said on CNN's \"State of the Union.\"</p><p>His comments come as the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/government-shutdown-updates-thune-trump.html\">government shutdown</a> enters its fifth day, with no clear offramp in sight.</p><p>Democrats are holding their ground on their health-care demands, pushing to include a permanent extension of enhanced premium tax credits in any government funding legislation.</p></div><div><h2>Read more CNBC politics coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/05/trump-layoffs-government-shutdown-kevin-hassett-.html\">'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/trump-face-coin-treasury-dollar.html\">Treasury weighs minting $1 coin with Trump's face for U.S. 250th anniversary</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/government-shutdown-updates-thune-trump.html\">Government shutdown: Senate funding measures fail again as deadlock continues</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-israel-gaza-hamas-peace-plan.html\">Watch: Trump details plan to end Israel war with Hamas in Gaza</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-health-government-shutdown-jeffries-schumer.html\">Democrats refuse to cave on health care before Trump government shutdown meeting</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-zohran-mamdani-eric-adams-new-york-mayor.html\">Trump bashes Zohran Mamdani after Eric Adams drops out of New York mayor's race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-movie-furniture-tariffs.html\">Trump 'Truths' about tariffs on films and furniture raise questions on details</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/trump-mass-firings-government-shutdown.html\">Trump threatens mass firings if shutdown isn't averted: NBC News</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/government-shutdown-trump-democrats-republicans-health-care.html\">Republicans say Obamacare tax credit fight can wait until after shutdown averted</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/jd-vance-trump-tiktok-china-bytedance.html\">JD Vance on Tiktok: U.S. 'successfully separated' TikTok from China's ByteDance</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/eric-adams-new-york-city-mayor-race-trump-.html\">Eric Adams drops out of New York City mayoral race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/27/trump-cartoon-firing-powell-fed.html\">President Trump posts cartoon image depicting him firing Fed Chief Powell</a></li></ul></div></div><div><p>Republicans, however, argue that those conversations should happen in December — not as part of government shutdown negotiations — escalating the standoff.</p><p>Democrats continue to dig in on their demands as the shutdown enters a new week.</p><p><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/government-shutdown-updates-thune-trump.html\">The Senate again</a> on Friday failed to pass two <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/trump-chicago-infrastructure-shutdown-vought.html\">funding</a> bills that would have ended the shutdown. The Republican measure would have funded the government through late November, while Democrats' version included additional health-care funding.</p><p>The resolutions previously failed multiple times in the upper chamber last week.</p><p>The Trump administration has repeatedly <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/what-the-government-shutdown-means-for-federal-workers.html\">warned of mass layoffs</a> during a government shutdown, saying last week that they would be \"imminent.\"</p><p>Trump also <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/trump-government-shutdown-updates-vought.html\">said</a> that the shutdown offered him an \"unprecedented opportunity\" to slash the size of federal agencies and lay off government workers, although the administration has not yet followed through on its threat.</p><p>Hassett said Sunday that Trump and Office of Management and Budget Director Russ Vought are \"lining things up and getting ready to act if they have to, but hoping that they don't.\"</p><p>Still, Hassett expressed optimism that negotiations this week could resolve the impasse.</p><p>\"We think the Democrats, there's a chance that they'll be reasonable once they get back into town on Monday,\" Hassett said on CNN.</p><p>\"And if they are, then I think there's no reason for those layoffs.\"</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108191413-17563120822025-08-27t133731z_1467133196_rc2pfgaixlc2_rtrmadp_0_usa-trump.jpeg?v=1756312180&w=1920&h=1080"
      ],
      "datePublished": "2025-10-05T16:08:21.000Z",
      "dateModified": "2025-10-05T16:08:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paul Tudor Jones says ingredients are in place for massive rally before a 'blow off' top to bull market",
    "url": "https://www.cnbc.com/2025/10/06/paul-tudor-jones-says-ingredients-are-in-place-for-massive-rally-before-a-blow-off-top-to-bull-market.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106346162-1579614213739dsc00520rr.jpg?v=1707151045&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T14:10:43.000Z",
    "description": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108208100-17597549481759754945-41971988208-1080pnbcnews.jpg?v=1759754947&w=750&h=422&vtcr",
    "body": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108208100-17597549481759754945-41971988208-1080pnbcnews.jpg?v=1759754947&w=750&h=422&vtcrop=y\" alt=\"Paul Tudor Jones: Ingredients are in place for massive rally before a ‘blow off’ top to bull market\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>Billionaire hedge fund manager <a target=\"_blank\" href=\"https://www.cnbc.com/paul-tudor-jones/\">Paul Tudor Jones</a> believes the conditions are set for a powerful surge in stock prices before the bull market tops out.</p><p>\"My guess is that I think all the ingredients are in place for some kind of a blow off,\" Jones said on CNBC's \"<a target=\"_blank\" href=\"https://www.cnbc.com/squawk-box-us/\">Squawk Box</a>\" Monday. \"History rhymes a lot, so I would think some version of it is going to happen again. If anything, now is so much more potentially explosive than 1999.\"</p><p>The founder and chief investment officer of Tudor Investment said today's market is reminiscent of the setup leading up to the burst of the dotcom bubble in late 1999, with dramatic rallies in technology shares and heightened speculative behavior. Jones said the circular deals or vendor financing happening in the artificial intelligence space today also made him \"nervous.\"</p><p>The tech-heavy Nasdaq Composite has bounced 55% from its April bottom to consecutive record highs. The rally has been driven by mega-cap tech giants, which have invested billions in AI and are being valued richly on the potential of this emerging era.</p></div><div><div><svg width=\"256\" height=\"256\">Stock Chart IconStock chart icon</svg><p><img src=\"https://static-redesign.cnbcfm.com/dist/a54b41835a8b60db28c2.svg\" alt=\"hide content\" /></p></div><p>Nasdaq Composite year to date</p></div><div><p>The difference between now and 1999 is the U.S. fiscal and monetary policy, Jones noted. The Federal Reserve had just begun a new easing cycle, whereas rate hikes were on the way before the market top in 2000. The U.S. is now running a 6% budget deficit, while in 1999, there was a budget surplus in $99,000, Jones said.</p><p>\"That fiscal monetary combination is a brew that we haven't seen since, I guess, the postwar period, early 50s,\" he said.</p><p>The longtime investor highlighted the tension at the heart of every late-stage bull market — the eager to capture outsized gains and the inevitability of a painful correction.</p><p>\"You have to get on and off the train pretty quick. If you just think about bull markets, the greatest price appreciations always [occurs] the 12 months preceding the top,\" Jones said. \"It kind of doubles whatever the annual averages, and before then, if you don't play it, you're missing out on the juice; if you do play it, you have to have really happy feet, because there will be a really, really bad end to it.\"</p><p>To be sure, Jones isn't predicting an immediate downturn. He believes the bull market still has room to run before it reaches its final phase.</p><p>\"It will take a speculative frenzy for us to elevate those prices. It will take more retail buying. It'll take more recruitment from a variety of others from long short hedge funds, from real money, etc.,\" he said.</p><p>He said he would own a combination of gold, cryptocurrencies and Nasdaq tech stocks between now and the end of the year to take advantage of the rally fueled by the fear of missing out.</p><p>Jones shot to fame after he predicted and profited from the 1987 stock market crash. He is also the co-founder of nonprofit Just Capital, which ranks public U.S. companies based on social and environmental metrics.</p><p><em>Correction: The tech-heavy Nasdaq Composite has bounced 55% from its April bottom to consecutive record highs. A previous version misstated the percentage.</em></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paul Tudor Jones says ingredients are in place for massive rally before a 'blow off' top to bull market",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106346162-1579614213739dsc00520rr.jpg?v=1707151045&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T14:10:43.000Z",
      "dateModified": "2025-10-06T14:10:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Firefly Aerospace surges 12% after buying defense tech firm for $855 million",
    "url": "https://www.cnbc.com/2025/10/06/firefly-aerospace-fly-stock-scitec.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108183151-1754585171015-gettyimages-2228207558-FIREFLY_IPO.jpeg?v=1754585231&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-06T13:32:56.000Z",
    "description": "<div><div><p>Jason Kim, chief executive officer of Firefly Aerospace, center, during the company's initial public offering at the Nasdaq MarketSite in",
    "body": "<div><div><p>Jason Kim, chief executive officer of Firefly Aerospace, center, during the company's initial public offering at the Nasdaq MarketSite in New York, US, on Thursday, Aug. 7, 2025. </p><p>Michael Nagle | Bloomberg | Getty Images</p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/FLY/\">Firefly Aerospace</a><span><span></span></span></span> stock climbed 12% Monday, after the <a target=\"_blank\" href=\"https://www.cnbc.com/2023/04/13/manifest-space-with-morgan-brennan.html\">space</a> company said it's buying defense technology contractor<a href=\"https://fireflyspace.com/news/firefly-aerospace-announces-strategic-acquisition-of-scitec-to-advance-national-security-capabilities/\" target=\"_blank\"> SciTec</a> for $855 million as it looks to strengthen its national security offering.</p><p>The deal, announced Sunday, is slated to close at the end of the year and includes $300 million cash and $555 million in Firefly shares.</p><p>\"These capabilities significantly enhance our ability to deliver integrated, software-defined solutions for critical national security imperatives, particularly Golden Dome,\" said CEO Jason Kim in a release.</p><p>The company plans to integrate SciTec's software into its tools. Capabilities such as missile warning, tracking and defense and autonomous command control will also support Firefly's launch and space services, the company said.</p></div><div><h2>Read more CNBC tech news</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/06/tesla-teaser-video-sparks-speculaton-of-roadster-or-mass-market-model.html\">Tesla teaser video sparks speculation of long-awaited Roadster or mass market model</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/amazon-shuts-4-fresh-stores-in-southern-california-after-uk-closures.html\">Amazon shutters 4 Fresh stores in Southern California as grocery strategy keeps shifting</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/04/sora-openai-video-app.html\">AI Sam Altman and the Sora copyright gamble: 'I hope Nintendo doesn't sue us'</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/cerebras-withdraws-ipo-ai.html\">AI chipmaker Cerebras withdraws IPO</a></li></ul></div></div><div><p>Last week, Firefly shares <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/30/firefly-aerospace-stock-rocket-explosion.html\">sank over 20%</a> in one trading session after the company said a rocket exploded during a ground test at its Texas facility. That came shortly after the Federal Aviation Administration <a href=\"https://fireflyspace.com/missions/alpha-flta006/\" target=\"_blank\">cleared</a> Firefly in an investigation over another rocket failure.</p><p>Firefly shares <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/07/rocket-maker-firefly-aerospace-fly-stock-ipo.html\">debuted on the Nasdaq</a> this summer to strong investor demand. The public listing marked the third significant space tech debut of 2025, and shares surged more than 30% on its first day of trading. The stock has since pulled back.</p><p>Firefly carries a growing list of key government and defense partners as it builds its position in the national security space. That includes a recent <a href=\"https://fireflyspace.com/news/firefly-awarded-177-million-nasa-contract-for-mission-to-the-moons-south-pole/\" target=\"_blank\">$177 million contract</a> with NASA and a <a href=\"https://fireflyspace.com/news/northrop-grumman-invests-50-million-in-firefly-aerospace-to-advance-medium-launch-vehicle-named-eclipse/\" target=\"_blank\">$50 million</a> investment from <a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NOC/\">Northrop Grumman</a>.</p><p>Once the acquisition closes, Princeton, New Jersey-based SciTec will operate as a subsidiary run by current CEO Jim Lisowski.</p><p><strong>WATCH:</strong> <a target=\"_blank\" href=\"https://www.cnbc.com/video/2025/08/07/firefly-aerospace-ceo-jason-kim-on-ipo-debut-pathway-to-profitability.html\">Firefly Aerospace CEO Jason Kim on IPO debut, pathway to profitability</a></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108182935-17545684261754568422-41074442418-1080pnbcnews.jpg?v=1754568424&w=750&h=422&vtcrop=y\" alt=\"Firefly Aerospace CEO Jason Kim on IPO debut, pathway to profitability\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Firefly Aerospace surges 12% after buying defense tech firm for $855 million",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108183151-1754585171015-gettyimages-2228207558-FIREFLY_IPO.jpeg?v=1754585231&w=1920&h=1080"
      ],
      "datePublished": "2025-10-06T13:32:56.000Z",
      "dateModified": "2025-10-06T13:32:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]