[
  {
    "title": "China says U.S. will only 'harm itself' after Washington approves $11 billion arms sale to Taiwan  ",
    "url": "https://www.cnbc.com/2025/12/18/us-taiwan-china-arms-sale-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107278851-1690599726028-gettyimages-1421478518-AFP_33M76QF.jpeg?v=1690599999&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T08:35:13.000Z",
    "description": "Military vehicles queue to launch U.S.-made TOW A2 missiles during a live firing exercise in Pingtung county on July 2023.Sam Yeh | Afp | Getty Images",
    "body": "Military vehicles queue to launch U.S.-made TOW A2 missiles during a live firing exercise in Pingtung county on July 2023.Sam Yeh | Afp | Getty ImagesThe U.S. on Thursday approved $11.15 billion in arms sale to Taiwan, reportedly its largest deal to the island as it faces growing threats from China and has been a subject of diplomatic tensions between Beijing and Tokyo.The move drew a sharp response from Beijing, with its foreign affairs spokesperson, Guo Jiakun, accusing the U.S. of violating the \"one-China principle.\" \"By aiding Taiwan's independence through arms sales, the U.S. will only end up harming itself. Any attempt to use Taiwan to contain China is doomed to fail,\" Guo said, according to a CNBC translation of his speech in Mandarin.The Taiwanese defense ministry said the sale — comprising artillery systems, antitank missiles, as well as spare parts for helicopters and antiship missiles — falls under the $40 billion supplementary defense budget announced by President Lai Ching-te in November.Lai last month vowed to build up Taiwan's self-defense capabilities in the face of growing threats from Beijing, seeking to achieve a high level of combat readiness by 2027. He also warned that China was aiming to seize the island by 2027. Lai cautioned of an \"unprecedented military buildup\" by Beijing and \"intensifying provocations in the Taiwan Strait, in the East and South China Seas, and across the Indo-Pacific.\"On Wednesday, Taiwan's defense ministry said in a post on X that China's Fujian aircraft carrier sailed through the Taiwan Strait, adding its armed forces had \"monitored the situation and responded.\" In response to Taiwan's supplementary budget, a spokesperson for Chinese foreign ministry said at a press briefing that \"the Democratic Progressive Party's plan of resisting reunification and seeking independence using armed forces is doomed to fail,\" referring to Taiwan's ruling party.China has been piling pressure on Taipei and has conducted several military drills off the coast of the island over the past few years, issuing stern warnings over Taiwan's \"provocations for independence.\"Beijing considers democratically governed Taiwan as its own territory and Chinese President Xi Jinping regards its reunification with the mainland \"a historical inevitability.\" Taiwan rejects those claims.Speaking to CNBC on Thursday, Matt Gertken, chief geopolitical strategist at BCA Research, said that the U.S. move was President Donald Trump's way of \"restoring some deterrence to Taiwan,\" while continuing to negotiate on trade with China.  \"So he's saying to China, we're willing to trade. We're not going to cut off your semiconductors completely, but we're not going to let you attack Taiwan,\" Gertken added. The U.S. package, the biggest on record as per Reuters, comprises 82 HIMARS rocket artillery systems and related equipment worth $4.05 billion, including 420 ATACMS missiles with a range of up to 300 kilometers, as well as unmanned surveillance systems and military software.It also includes 60 M109A7 self-propelled howitzer systems and related equipment worth more than $4 billion, as well as Javelin and TOW antitank missiles worth more than $700 million.\"It [arms package] seriously infringes upon China's sovereignty and territorial integrity. It gravely undermines peace and stability across the Taiwan Strait, and sends a seriously wrong signal to the separatist forces for Taiwan independence,\" Guo said. The U.S. does not have a mutual defense treaty with Taiwan and is not obligated to defend the island. However, the 1979 Taiwan Relations Act states the U.S. \"will make available to Taiwan such defense articles and defense services\" as may be necessary to \"enable Taiwan to maintain sufficient self-defense capabilities.\"In November, China unleashed fiery rhetoric against Japanese Prime Minister Sanae Takaichi, after she said that an attempt to seize Taiwan by force could trigger the intervention of Japan's Self-Defense Forces. Beijing, which has called on Takaichi to withdraw her statement and apologize, has advised its citizens not to visit Japan as it continues to be locked in a diplomatic spat with Tokyo.— CNBC's Anniek Bao and Yulia Jiang contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China says U.S. will only 'harm itself' after Washington approves $11 billion arms sale to Taiwan  ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107278851-1690599726028-gettyimages-1421478518-AFP_33M76QF.jpeg?v=1690599999&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T08:35:13.000Z",
      "dateModified": "2025-12-18T08:35:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bank of England cuts interest rates, in welcome Christmas boost for consumers",
    "url": "https://www.cnbc.com/2025/12/18/bank-of-england-cuts-interest-rates-to-3point75percent.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243410-1766041447905-gettyimages-2251483714-UK_BOE.jpeg?v=1766041486&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T12:22:58.000Z",
    "description": "The Bank of England (BOE) in the City of London, UK, on Monday, Dec. 15, 2025. Bloomberg | Bloomberg | Getty ImagesThe Bank of England voted narrowly ",
    "body": "The Bank of England (BOE) in the City of London, UK, on Monday, Dec. 15, 2025. Bloomberg | Bloomberg | Getty ImagesThe Bank of England voted narrowly to cut interest rates on Thursday, in its last monetary policy move of 2025.The central bank's nine-member monetary policy committee (MPC) on Thursday voted 5-4 to trim the benchmark interest rate by 25 basis points to 3.75%, marking the fourth cut of the year. Economists had widely expected the rate trim, which comes at a time of lackluster economic data, softening labor market and a recent decline in inflation that outpaced expectations.Nonetheless, the vote was a narrow one, with BOE Governor Andrew Bailey siding with more dovish members of the committee rather than the four policymakers who maintain that the inflation rate, at 3.2% in November, is still far from the central bank's 2% target. In a statement, the MPC said that while inflation remained above target, \"it is now expected to fall back towards target more quickly in the near term.\"However, it cautioned that \"the extent of further easing in monetary policy will depend on the evolution of the outlook for inflation.\" On the basis of current evidence, the MPC said the \"Bank Rate [the BOE's benchmark interest rate] is likely to continue on a gradual downward path. But judgements around further policy easing will become a closer call.\"For now, the cut in rates will be welcomed by hard-pressed consumers as it makes borrowing cheaper, but many lose out with lower returns on their savings.Chancellor Rachel Reeves cheered the central bank's trim, saying it would help with cost of living pressures.\"Today's interest rate cut is the sixth since the election [in July 2024], the fastest pace of cuts in 17 years and good news for families with mortgages and businesses with loans,\" she said in comments on X, while adding that \"there's more to do on the cost of living.\"Sterling was flat against the dollar after the announcement, as was the FTSE 100. The yield on the benchmark 10-year U.K. gilt was up 3 basis points to 4.510%.Outlook for 2026Economists expect the central bank could next cut in early 2026 if macroeconomic data continue to allow for more room or manouver. There are caveats to those forecasts, however.\"Further easing clearly looks likely beyond the December meeting,\" Allan Monks, chief U.K. economist at JPMorgan, said in analysis Wednesday. JP Morgan's current base case is for two more cuts in March and June, bringing the base rate down to 3.25%.\"One fly in the ointment, however, is the high-side wage expectations for 2026. That is keeping the BOE cautious, but if the picture there were to soften then it could tilt the BOE away from its gradual easing path and open the window up for another cut in February.\" he said.Bank of England Governor Andrew Bailey attends the central bank's Monetary Policy Report press conference at the Bank of England, in London, on May 9, 2024.Yui Mok | Afp | Getty ImagesMorgan Stanley's Chief U.K. Economist Bruna Skarica and strategist Fabio Bassanin said in a note that they expect another trim in February on the back of a decline in inflationary pressures and a pick-up in the jobless rate. But they anticipated \"conservative messaging\" around future cuts when that next rate cut comes. \"Thereafter, purely on the evolution of the inflation and pay data, as well as what looks to be a stubborn jobless rate in our forecasts, we still think that the BOE can deliver two more rate cuts in the first half of 2026, in April and June.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bank of England cuts interest rates, in welcome Christmas boost for consumers",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243410-1766041447905-gettyimages-2251483714-UK_BOE.jpeg?v=1766041486&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T12:22:58.000Z",
      "dateModified": "2025-12-18T12:22:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FBI Deputy Director Dan Bongino is stepping down in January",
    "url": "https://www.cnbc.com/2025/12/17/fbi-dan-bongino-steps-down-epstein-jan-6.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243101-1765994244599-gettyimages-2249319886-doj_282_120425.jpeg?v=1766004002&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T00:11:31.000Z",
    "description": "FBI Director Kash Patel, left, and Dan Bongino, deputy director of the FBI, conduct a news conference at the Department of Justice, Dec. 4, 2025.Tom W",
    "body": "FBI Director Kash Patel, left, and Dan Bongino, deputy director of the FBI, conduct a news conference at the Department of Justice, Dec. 4, 2025.Tom Williams | CQ-Roll Call, Inc. | Getty ImagesFBI Deputy Director Dan Bongino on Wednesday said he will leave that post in January.Bongino, a former police officer, Secret Service agent, and conservative radio and podcast host who trafficked in conspiracy theories, was a controversial pick by President Donald Trump for the No. 2 slot at the FBI.Bongino, who will leave after less than a year on the job, is one of the first major figures of Trump's second term to step down.\"I want to thank President Trump, AG Bondi, and Director [Kash] Patel for the opportunity to serve with purpose,\" Bongino wrote in a social media post.\"Most importantly, I want to thank you, my fellow Americans, for the privilege to serve you. God bless America, and all those who defend Her,\" Bongino said.Earlier Wednesday, Trump confirmed Bongino could be leaving.\"Dan did a great job,\" Trump told reporters. \"I think he wants to go back to his show.\"MS Now reported earlier in the day about Bongino's plans to leave. The outlet said he had told confidants that he would not be returning to FBI headquarters in Washington, D.C., to work this month.\"Print whatever you'd like,\" Bongino told MS Now when contacted for comment. \"No one believes you anyway. Thanks.\"The FBI declined to comment when contacted by CNBC.Patel, in a post on X, said \"Dan is the best partner I could've asked for in helping restore this FBI.\"\"He not only completed his mission —  he far exceeded it,\" Patel wrote. \"We will miss him but I'm thankful he accepted the call to serve. Our country is better and safer for it.\"Bongino had no prior FBI when Trump tapped him for the high-profile law enforcement post.His  prior discussion of conspiracy theories on right-wing media resurfaced after he joined the government.While a private citizen, Bongino reportedly suggested that the planting of pipe bombs in Washington on the eve of the Jan. 6, 2021, Capitol riot was an \"inside job.\" U.S. President Donald Trump speaks to reporters, after disembarking Air Force One on his return from Dover, Delaware, at Joint Base Andrews, Maryland, U.S., Dec. 17, 2025. Jonathan Ernst | ReutersBut earlier this month, Bongino took a victory lap when federal agents, after a nearly five-year search, arrested and charged Brian Cole Jr. with setting those devices. Cole is not associated with the FBI or other federal authorities.When asked by Fox News' Sean Hannity how his recent comments squared with his past claims about the pipe bombs, Bongino said he was \"paid in the past\" for his opinions, \"and one day I will be back in that space.\"\"That's not what I'm paid for now. I'm paid to be your deputy director, and we base investigations on facts,\" he said.Read more CNBC politics coverageTrump sues BBC for $10 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationBongino also previously questioned official accounts of the circumstances around Jeffrey Epstein's death. The wealthy financier and notorious sex offender hanged himself while in jail in August 2019, after his arrest on child sex trafficking charges.As an FBI official, Bongino said there was no question that Epstein died by suicide. \"I have reviewed the case. Jeffrey Epstein killed himself. There's no evidence in the case file indicating otherwise,\" he wrote on X in May.In July, the FBI released a memo concluding that Epstein died by suicide and that his rumored \"client list\" did not exist.That memo sparked a backlash among members of Trump's MAGA movement, where conspiracy theories about Epstein have proliferated for years. Soon after, Bongino and Attorney General Pam Bondi angrily confronted each other at the White House, according to a New York Times report.Friday is the deadline for the Trump administration to comply with a bipartisan law ordering the release of the government's files on its Epstein investigations.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FBI Deputy Director Dan Bongino is stepping down in January",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243101-1765994244599-gettyimages-2249319886-doj_282_120425.jpeg?v=1766004002&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T00:11:31.000Z",
      "dateModified": "2025-12-18T00:11:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. admits liability in Army helicopter collision with American Airlines jet that killed 67 people",
    "url": "https://www.cnbc.com/2025/12/17/us-army-helicopter-collision-american-airlines-jet.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108095304-1738276675978-gettyimages-2196182568-250130-G-LB502-1015.jpeg?v=1738276943&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T02:56:04.000Z",
    "description": "(EDITORS NOTE: Image contains graphic content)  In this U.S. Coast Guard handout, the Coast Guard investigates aircraft wreckage on the Potomac River ",
    "body": "(EDITORS NOTE: Image contains graphic content)  In this U.S. Coast Guard handout, the Coast Guard investigates aircraft wreckage on the Potomac River on Jan. 30, 2025 in Washington, DC. Handout | Getty Images News | Getty ImagesThe United States government admitted liability in the deadly midair collision in January between an Army Black Hawk helicopter and an arriving American Airlines regional jet over the Potomac River that killed all 67 people aboard the two aircraft.\"The United States admits that it owed a duty of care to Plaintiffs, which it breached, thereby proximately causing the tragic accident on January 29, 2025,\" the Justice Department said in a court filing on Wednesday.American Eagle Flight 5342 from Wichita, Kansas was approaching Ronald Reagan Washington National Airport at an altitude of about 300 feet when a U.S. Army Black Hawk helicopter carrying three people collided with the commercial jetliner.The Jan. 29 crash was the worst air disaster in the U.S. since 2001 and prompted restrictions on helicopter flights around Ronald Reagan Washington National Airport, where the airspace is one of the most congested in the country,The National Transportation Safety Board, which is leading the crash investigation, criticized the FAA during a hearing over the summer about the crash for failing to address safety risks in the area as well as chronic staffing shortages.The crew of the U.S. army helicopter failed to avoid the American plane, which was operated by the carrier's subsidiary PSA Airlines, the Justice Department said in the filingThe crew also didn't abide by altitude restrictions in the area, the Justice Department said in its filing. It admitted that the Federal Aviation Administration's air traffic controllers failed to keep aircraft apart and issue alerts when planes were in proximity to one another.The FAA and the Army didn't immediately comment.American Airlines didn't immediately respond to a request for comment. The airline is also named a defendant in the lawsuit brought by the family of one of the crash victims, which was filed in U.S. District Court in Washington.Read more CNBC airline newsFrontier Airlines replaces longtime CEO Barry Biffle with carrier's presidentSouthwest CEO says airline 'actively pursuing' network of airport loungesDelta says government shutdown cost it $200 million, but forecasts strong travel demand into 2026",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. admits liability in Army helicopter collision with American Airlines jet that killed 67 people",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108095304-1738276675978-gettyimages-2196182568-250130-G-LB502-1015.jpeg?v=1738276943&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T02:56:04.000Z",
      "dateModified": "2025-12-18T02:56:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump Media to merge with fusion power company TAE Technologies in $6 billion deal",
    "url": "https://www.cnbc.com/2025/12/18/trump-media-djt-tae-fusion-merger.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241933-1765821208042-gettyimages-2252063606-kd1_3462_hvpakcm8_20251215122239_ygtybgwa.jpeg?v=1765821394&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T12:24:32.000Z",
    "description": "watch nowTrump Media and Technology Group on Thursday announced a merger agreement with TAE Technologies, a fusion power company, valued at more than ",
    "body": "watch nowTrump Media and Technology Group on Thursday announced a merger agreement with TAE Technologies, a fusion power company, valued at more than $6 billion.The all-stock deal, expected to close in mid-2026, will result in shareholders of each firm owning approximately half of the combined company.The merger would create \"one of the world's first publicly traded fusion companies,\" according to a press release.Trump Media stock rocketed more than 19% higher in premarket trading. Stock Chart IconStock chart iconTrump Media ($DJT) Stock PriceThe announcement shows Trump Media, which operates President Donald Trump's Truth Social platform, branching out even further following its expansion into the financial services sector early this year.\"Upon closing, Trump Media & Technology Group will be the holding company for Truth Social, Truth+, Truth.Fi, TAE, TAE Power Solutions and TAE Life Sciences, among others,\" the companies said.Trump indirectly owns more than 114 million shares of Trump Media, which trades on the Nasdaq under the ticker DJT, the president's initials. Before taking office in January, he transferred that majority stake to a revocable trust whose sole trustee is his eldest son, Donald Trump Jr.After Trump Media merges with TAE, the combined company aims to build \"the world's first utility-scale fusion power plant ... subject to required approvals.\"\"Fusion power plants are expected to provide economic, abundant, and dependable electricity that would help America win the A.I. revolution and maintain its global economic dominance,\" the companies said.This is breaking news. Please refresh for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump Media to merge with fusion power company TAE Technologies in $6 billion deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241933-1765821208042-gettyimages-2252063606-kd1_3462_hvpakcm8_20251215122239_ygtybgwa.jpeg?v=1765821394&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T12:24:32.000Z",
      "dateModified": "2025-12-18T12:24:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Obamacare subsidies extension to get vote after 4 Republicans buck leadership",
    "url": "https://www.cnbc.com/2025/12/17/johnson-aca-republicans-health.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242895-1765977987305-gettyimages-2251653963-AA_16122025_2565175.jpeg?v=1765978023&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T22:18:23.000Z",
    "description": "Four moderate House Republicans rebelled against House Speaker Mike Johnson on Wednesday, joining Democrats to force a vote on extending key Obamacare",
    "body": "Four moderate House Republicans rebelled against House Speaker Mike Johnson on Wednesday, joining Democrats to force a vote on extending key Obamacare subsidies that are set to expire at the end of the year.If approved by the House and Senate, the measure will extend enhanced tax credits for customers of Affordable Care Act health insurance plans for three years.If those subsidies expire as scheduled, the prices of Obamacare premiums that millions of Americans personally pay will skyrocket.The stunning defections by the quartet of Republicans came a day after Johnson, R-La., said that GOP leaders would not allow a vote under normal procedures on keeping the enhanced ACA tax credits alive into 2026. Johnson, earlier Wednesday morning, urged GOP caucus members not to join Democrats in the procedural end-run around him.Lacking sufficient Republican support to extend the credits, House Minority Leader Hakeem Jeffries, D-N.Y., in November created a so-called discharge petition, which would force a vote on an extension once it obtained signatures from 218 House members.Democrats only have 214 members, so they needed four Republicans for that measure to work.Johnson was asked about the discharge petition on CNBC's \"Squawk Box,\" about two hours after it obtained the required signatures.He said that \"doing an end-run around the majority party, the speaker or the regular process is not the best way to make law.\" Four moderate Republicans signed the petition: Brian Fitzpatrick, Rob Bresnahan and Ryan Mackenzie, all of Pennsylvania, and Mike Lawler of New York signed the petition.\"When leadership blocks action entirely, Congress has a responsibility to act,\" Lawler said in a statement.\"My priority is ensuring Hudson Valley families aren't caught in the gridlock.\"A vote to extend the ACA subsidies could help House Republicans who face tough reelection bids in 2026. The GOP holds a razor-thin majority in the chamber.Lawler on Tuesday said that not holding a vote on the subsidies would be \"political malpractice.\"Read more CNBC politics coverageTrump sues BBC for $10 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationIf the measure clears the House, it would still need to be approved by the Senate, which, like the lower chamber, is controlled by Republicans.Last week, the Senate rejected a similar measure that would have extended the subsidies for three years.\"Under this proposal, people making $500k+ per year would continue to be eligible for what were supposed to be temporary COVID-era subsidies,\" Senate Majority Leader John Thune's spokesperson Ryan Wrasse wrote in a social media post on Wednesday. Sen. Josh Hawley, R-Mo., is one of only a handful of GOP senators who joined Democrats in voting to preserve the credits. Hawley warned that Congress needs to act on the subsidies. \"I mean, the prices are way too high. I'm a father of three. I know small children. I know so many parents in Missouri who are scared to death they're not going to be able to take their kids to the doctor. I mean, that's a very valid concern,\" Hawley said. A bipartisan group in the Senate has formed and is working to craft compromise legislation to both extend the subsidies and reform Obamacare. Senators in the group on Wednesday said their talks are picking up steam, with some noting that the action in the House has given that effort support.\"We have some momentum to enact a bipartisan bill that includes reforms,\" said Sen. Susan Collins, R-Maine, one of the leaders of the group, and the chair of the Senate Appropriations Committee. \"We're now working on drafting a specific bill to incorporate those conversations that will include reforms as well as the two-year extension,\" she said. Sen. Bernie Moreno, R-Ohio, who is leading the group with Collins, said the talks are in \"field goal range.\"But Moreno ruled out approving the so-called clean three-year extension of the subsidies that the House will vote on. Precise details on the plan, however, are not clear. Moreno said the group is eyeing an extension to open enrollment to \"take that pressure point off.\"Sen. Bill Cassidy, the Louisiana Republican who chairs the Health, Education, Labor and Pensions Committee, is pushing for his own plan, which would give people money directly to offset their health insurance costs.\"Well, the President has said that he won't sign something unless we give money to the enrollee, the patient, as opposed to the insurance company,\" Cassidy said. \"I am presuming that something like I'm proposing will be in the final mix.\" Sen. Jeanne Shaheen, D-N.H., said that while the \"bipartisan, bicameral talks have been constructive,\" the group still needs critical assurances that what it produces will get a vote and the president's signature. \"We need to make sure the speaker will bring up a bill if the Senate passes something out, and we need to make sure that leadership in the Senate will bring up legislation if we reach an agreement,\" Shaheen said. \"What the president is going to do is a question.\" Johnson and GOP House leadership are pushing a separate health-care bill that would not extend the enhanced subsidies. The House will vote on that bill, which would provide cost-sharing aid for consumers, on Wednesday. Johnson told \"Squawk Box\" that GOP caucus members could tackle health insurance costs in early 2026.\"We're looking at another reconciliation package, for example, in the first quarter of next year, which will have a number of other revisions and reforms to the system, and all of it is geared, again, for reducing premiums, increasing access to care and quality of care,\" the speaker said. — CNBC's Emily Wilkins contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Obamacare subsidies extension to get vote after 4 Republicans buck leadership",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242895-1765977987305-gettyimages-2251653963-AA_16122025_2565175.jpeg?v=1765978023&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T22:18:23.000Z",
      "dateModified": "2025-12-17T22:18:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Coinbase adds prediction markets and stock trading in push to be one-stop trading app",
    "url": "https://www.cnbc.com/2025/12/17/coinbase-prediction-markets-stock-trading-stablecoins.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107304866-1695335426536-gettyimages-1680877345-MESSARI_MAINNET.jpeg?v=1766010511&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T01:01:49.000Z",
    "description": "watch nowCoinbase is making its biggest push yet to reposition itself as a mainstream trading and financial platform, moving beyond crypto and into th",
    "body": "watch nowCoinbase is making its biggest push yet to reposition itself as a mainstream trading and financial platform, moving beyond crypto and into the broader retail investing stack as competitors show there's real money in always-on engagement products.The digital asset exchange announced Wednesday that it's rolling out a major slate of new products designed to turn Coinbase into a one-stop financial app, expanding into stocks, more advanced trading, and prediction markets, while doubling down on its on-chain ecosystem and new tools for businesses, developers, and automated financial guidance. While many of these offerings have been telegraphed for months, Coinbase says the products are now built, and ready to go.CEO Brian Armstrong is looking to make his platform the place to trade everything. That includes stocks, a streamlined futures and perpetuals experience, and prediction markets through Kalshi, alongside a tokenization roadmap aimed at eventually bringing more traditional assets on-chain, including equities.The area of prediction markets, in particular, is quickly getting crowded. DraftKings has moved to buy its own exchange, FanDuel is teaming up with CME, and Polymarket is entering the U.S. through a newly approved venue. Robinhood, meanwhile, is putting LedgerX at the center of its regulated push. The defining rivalry in the space remains Kalshi versus Polymarket, regulated rails versus crypto-native liquidity.Armstrong said the category's appeal isn't just trading, but its insight into sentiment, and what people think will happen next on any given topic.\"If you look at things like economic indicators … or elections, people are using prediction markets to try to figure out what is going to happen next month,\" Armstrong told CNBC. \"Maybe1% of people use it as an asset class to trade, and 99% of people are using it as a way to figure out what's going to happen — almost like a competitor to traditional media or maybe even entertainment.\"watch nowIn the company's third-quarter earnings call with analysts in October, Armstrong showed just how easily prediction market wagers can be manipulated, rattling off several words that were being bet on.\"I was a little distracted because I was tracking the prediction market about what Coinbase will say on their next earnings call,\" Armstrong said. \"And I just want to add here the words bitcoin, ethereum, blockchain, staking and Web3 to make sure we get those in before the end of the call.\"Read more CNBC tech newsApple punted on AI this year. Next year will be criticalOpenAI in talks with Amazon about investment that could exceed $10 billionShares of Chinese chipmaker MetaX soar nearly 700% in blockbuster Shanghai debutAlphabet-owned Waymo in talks to raise $15 billion in fundingRobinhood underscored that shift this week by expanding prediction markets into sports-style contracts that resemble parlays and prop bets, and by touting the category as its fastest-growing business by revenue. Coinbase is now bringing the same kind of outcome trading into its own ecosystem, but as a part of a much wider bet that the next-generation brokerage is a single app that blends traditional assets, derivatives, and on-chain rails.Coinbase is pairing the trading expansion with a tokenization roadmap that signals where it wants the platform to go next, bringing more traditional assets on-chain, including equities. The company is launching Coinbase Tokenize, an institutional stack intended to support real-world asset tokenization. Armstrong framed the expansion as a bridge to something bigger. Trading stocks, he said, is \"a good first step,\" but the real goal is tokenized equities. If Coinbase can get tokenized equity live, he said, it could \"democratize access for people over the world,\" and unlock new market structure in the U.S., including more robust, professional futures markets tied to equities. \"So this is the starting point,\" he said.The announcement also extends Coinbase's push to become a provider of on-chain liquidity — not just a venue for listed tokens.For businesses and developers, Coinbase is widening its platform story beyond retail trading. The company said Coinbase Business is becoming available to eligible customers in the U.S. and Singapore, and it's rolling out an expanded API suite spanning custody, payments, trading, and stablecoins.Armstrong's broader thesis is that crypto isn't a niche category, it's an upgrade cycle for the financial system itself. \"Crypto is updating all financial services,\" he said, suggesting that every major asset class will move on-chain over time, from prediction markets and equities to commodities, and eventually real-world assets like real estate. Even the largest asset managers, he said, are signaling they want to migrate funds on-chain, positioning Coinbase as a central platform for that transition.Coinbase is also introducing \"custom stablecoins\" for companies that want branded stablecoin rails, and spotlighting x402, a payments standard the company says is meant to make stablecoin payments easier to attach to web requests — including for automated commerce and agent-driven transactions.The strategic throughline is retention and diversification. Coinbase already owns a large crypto-native audience, and it wants that customer to stay on its platform for every asset class, even when crypto volumes cool and transaction revenue compresses. WATCH: What to know about Robinhood's new prediction market featureswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Coinbase adds prediction markets and stock trading in push to be one-stop trading app",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107304866-1695335426536-gettyimages-1680877345-MESSARI_MAINNET.jpeg?v=1766010511&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T01:01:49.000Z",
      "dateModified": "2025-12-18T01:01:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eli Lilly says obesity pill helps maintain weight loss after patients switch from Wegovy, Zepbound ",
    "url": "https://www.cnbc.com/2025/12/18/eli-lilly-obesity-pill-maintains-weight-loss-after-wegovy-zepbound-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108086195-1736866540584-gettyimages-2184000208-SINGAPORE_ELI_LILLY.jpeg?v=1761820864&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T11:51:29.000Z",
    "description": "The Eli Lilly & Co. logo at the company's Digital Health Innovation Hub facility in Singapore, on Thursday, Nov. 14, 2024.Ore Huiying | Bloomberg | Ge",
    "body": "The Eli Lilly & Co. logo at the company's Digital Health Innovation Hub facility in Singapore, on Thursday, Nov. 14, 2024.Ore Huiying | Bloomberg | Getty ImagesEli Lilly on Thursday said its closely watched obesity pill helped patients maintain the majority of their weight loss after they switched directly from taking the company's injection Zepbound and Novo Nordisk's rival shot Wegovy in a late-stage trial. The company also said it has filed for Food and Drug Administration approval of the daily GLP-1 pill, called orforglipron, for obesity. The FDA in November said it awarded a priority review voucher to that pill, which could expedite its review timeline to a few months. The positive trial data suggest that the pill could be an effective treatment for patients to transition to if they want to preserve their weight loss but don't want to take weekly injections long-term. Many people who stop those shots regain much of the weight they initially shed. While Eli Lilly's pill appears to cause less weight loss overall than existing injections, Thursday's results highlight its potential role as a needle-free maintenance treatment in the blockbuster GLP-1 market. But an oral pill for obesity from Novo Nordisk will likely enter the market first, giving the Danish drugmaker a head start in staking its claim in the space.The phase three trial followed more than 300 patients with obesity who previously took Wegovy or  Zepbound for 72 weeks in a separate late-stage study. Those people were then randomized to take either Eli Lilly's pill or a placebo for another 52 weeks. The oral drug met the trial's main goal of demonstrating superior weight loss maintenance compared to placebo, among people who previously experienced a plateau in their progress while taking the injections. On average, patients who switched to the pill from Novo Nordisk's Wegovy only regained roughly 2 pounds of the weight they initially lost by the end of the trial. Meanwhile, on average, people who switched to the pill from Zepbound only regained around 11 pounds of the weight they initially lost by the end of the study. \"Obesity is a chronic, progressive disease, and sustaining weight loss remains a significant challenge for many,\" said Kenneth Custer, president of Lilly Cardiometabolic Health, in a release. He said the trial showed that the pill \"helped people maintain the weight they worked hard to lose\" and that, if approved, it could \"provide a convenient alternative for the millions of individuals living with obesity around the globe to continue their long-term health journey.\"While people in the Zepbound group appeared to regain more weight, the bigger focus is likely on those who transitioned from the drug's top competitor, Wegovy. In an October note, BMO Capital Markets analyst Evan Seigerman said positive results from the trial could give Eli Lilly \"the unique opportunity to capture revenue share\" from chronic treatment with semaglutide, the active ingredient in Novo Nordisk's Wegovy and diabetes injection Ozempic. \"Chipping away at the potential for Novo's flagship product,\" Seigerman wrote. The overall safety and tolerability – or how well patients handle treatment – of the pill were consistent with previous late-stage studies. The most common side effects were gastrointestinal-related and generally mild-to-moderate in severity. Around 4.8% of people who switched to the pill from Wegovy discontinued treatment due to side effects, while 7.2% of those who switched to the oral drug from Zepbound did the same. Meanwhile, those rates were 7.6% and 6.3% among patients who switched to a placebo from Wegovy and Zepbound, respectively. No liver safety issues were observed, according to Eli Lilly. Full results on the trial, called ATTAIN-MAINTAIN, will be presented at an upcoming medical meeting and published in a peer-reviewed journal next year. Eli Lilly's pill works in a similar way to Wegovy, Ozempic and Novo Nordisk's diabetes pill Rybelsus, targeting a gut hormone called GLP-1 to suppress a person's appetite and regulate blood sugar. Novo Nordisk is also seeking approval of an oral version of Wegovy for obesity, which could come by year-end.But unlike those three treatments, Eli Lilly's pill is not a peptide medication. That means it is absorbed more easily by the body and does not require dietary restrictions like Rybelsus or oral Wegovy does.In a note in August, Goldman Sachs analysts forecasted that pills will capture a 24% share — or around $22 billion — of the 2030 global weight loss drug market, which they expect to be worth $95 billion in total.They said they expect Eli Lilly's pill to have a 60% share — or roughly $13.6 billion — of the daily oral segment of the market in 2030. They expect Novo Nordisk's oral semaglutide to have a 21% share — or around $4 billion — of that segment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eli Lilly says obesity pill helps maintain weight loss after patients switch from Wegovy, Zepbound ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108086195-1736866540584-gettyimages-2184000208-SINGAPORE_ELI_LILLY.jpeg?v=1761820864&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T11:51:29.000Z",
      "dateModified": "2025-12-18T11:51:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Edinburgh Worldwide Investment Trust urges shareholders to throw out Boaz Weinstein's bid to overhaul board",
    "url": "https://www.cnbc.com/2025/12/18/ewit-urges-shareholders-to-reject-boaz-weinsteins-board-shake-up-plan.html",
    "image": "https://image.cnbcfm.com/api/v1/image/100686514-boardroom-man-in-shadow-gettyp.jpg?v=1765987730&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T06:00:01.000Z",
    "description": "Edinburgh Worldwide Investment Trust, a Baillie Gifford-run technology-focused fund, is calling on shareholders to throw out a plan by Boaz Weinstein'",
    "body": "Edinburgh Worldwide Investment Trust, a Baillie Gifford-run technology-focused fund, is calling on shareholders to throw out a plan by Boaz Weinstein's activist investment fund Saba Capital to overhaul its board of directors.The EWIT board said on Wednesday it would \"strongly urge\" shareholders to reject a plan by the U.S. hedge fund  — which holds a 30% stake in the trust — to remove the incumbent board and appoint three directors in their place.In an update on Wednesday, the trust's chair, Jonathan Simpson-Dent, said Saba was \"an aggressive U.S. hedge fund\" which wants to \"seize control for its own commercial advantage, at the expense of other shareholders.\"Simpson-Dent said the trust has made \"strong progress\" over the past 12 months.Saba Capital said the sweeping board-level changes were needed to reverse what it sees as \"unprecedented value destruction\" at the trust over the past five years. In a recent letter to shareholders, the firm said its three proposed directors — Gabi Gliksberg, Michael Joseph and Jassen Trenkow — could \"deliver the performance our shareholders rightfully expect.\"As the largest shareholder, Saba has secured a General Meeting — expected to take place early next year — where it will ask shareholders to vote on its resolutions for board replacements.Stock Chart IconStock chart iconEdinburgh Worldwide Investment Trust.\"We urge Saba to explain to EWIT shareholders its intentions beyond replacing the Board, to allow shareholders to make an informed choice in January rather than face considerable uncertainty should it succeed,\" Simpson-Dent said.He highlighted the trust's NAV total return of 16.2%, outperforming the 6% achieved by its benchmark, the S&P Global Small Cap Index. He also said a share buyback programme had contributed to an average discount of 5.3% over the past 12 months, \"significantly narrower\" than its peer group average of 17.9%.Saba's plan follows a previous attempt to replace the EWIT board in February, which investors rejected. Since then, Weinstein's firm has increased its stake to 30%, allowing it to block a proposed merger between EWIT and another Baillie Gifford fund, the US Growth Trust, earlier this month.'A storm brewing'Relations between the two camps have become increasingly acrimonious amid a protracted wrangle over EWIT's discount. Weinstein declared he had \"no confidence\" that the incumbents could improve the outlook and protect shareholder capital.\"Many shareholders gave the Board the benefit of the doubt, enabling the directors to remain,\" Saba Capital said. \"Simply put, the Board requested more time to make improvements but failed to generate adequate performance.\"The Saba founder has sharpened his focus on closed-end funds and investment trusts on both sides of the Atlantic in recent years, identifying investment opportunities arising from persistent valuation discounts. At the Sohn London investment conference last month, the New York-based fund manager said there was \"a storm brewing\" in the U.K. investment trust space.EWIT's portfolio — which is sized at around $847 million — comprises a global mix of smaller and emerging public and private companies focused on disruptive tech innovation.Its largest position is Elon Musk's SpaceX, accounting for almost 16% of its total assets. That position has become a major flashpoint in the dispute.In a post on X on Tuesday night, Weinstein accused Ballie Gifford of selling one-third of SpaceX shares in both the EWIT and U.S. Growth trusts at \"a level massively lower\" than the reported $1.5 trillion valuation that the rocket maker could reach in a future IPO. He earlier posted that Saba had received calls from shareholders \"livid\" at the sale.EWIT said on Wednesday that it offers investors a \"unique and distinctive portfolio of disruptive and transformative companies positioned for long-term growth,\" which includes exposure to SpaceX.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Edinburgh Worldwide Investment Trust urges shareholders to throw out Boaz Weinstein's bid to overhaul board",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/100686514-boardroom-man-in-shadow-gettyp.jpg?v=1765987730&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T06:00:01.000Z",
      "dateModified": "2025-12-18T06:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Olive Garden owner Darden Restaurants hikes revenue outlook for second straight quarter",
    "url": "https://www.cnbc.com/2025/12/18/darden-restaurants-dri-q2-2026-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242672-1765922856870-gettyimages-2251668314-DARDEN_EARNS.jpeg?v=1765923049&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T12:28:38.000Z",
    "description": "An Olive Garden restaurant in Milpitas, California, US, on Tuesday, Dec. 16, 2025. David Paul Morris | Bloomberg | Getty ImagesDarden Restaurants on T",
    "body": "An Olive Garden restaurant in Milpitas, California, US, on Tuesday, Dec. 16, 2025. David Paul Morris | Bloomberg | Getty ImagesDarden Restaurants on Thursday reported strong sales growth, fueled by demand at Olive Garden and LongHorn Steakhouse.For the second straight quarter, the company hiked its full-year outlook for revenue growth, although it only reiterated its projections for its earnings. \"The second quarter exceeded our top-line expectations as every segment delivered positive same-restaurant sales,\" Darden CEO Rick Cardenas said in a statement.Shares of the company rose more than 4% in premarket trading.Darden reported fiscal second-quarter net income of $237.2 million, or $2.03 per share, up from $215.1 million, or $1.82 per share, a year earlier.Excluding restaurant closure costs and expenses related to its acquisition of Chuy's, the restaurant company earned $2.08 per share.Net sales rose 7.3% to $3.1 billion.Darden's same-store sales increased 4.3% in the quarter, topping Wall Street estimates of 3%, according to StreetAccount.Olive Garden, which accounted for roughly 44% of Darden's quarterly sales, reported same-store sales growth of 4.7%. The Italian chain's popular Never Ending Pasta Bowl promotion ran during the quarter.LongHorn Steakhouse saw same-store sales growth of 5.9%. While Olive Garden still outnumbers LongHorn based on its restaurant footprint, the steakhouse chain's sales are growing faster.The company's other business segment reported same-store sales growth of 3.1%. The business unit includes Cheddar's Scratch Kitchen and Yard House. Darden's fine-dining business, which includes Ruth's Chris and The Capital Grille, saw same-store sales growth of 0.8%, bucking the malaise of the sector. The overall fine-dining segment has struggled as consumers spend less when dining out and many companies have cut back on business lunches and other expenses.For fiscal 2026, Darden now expects total sales growth of 8.5% to 9.3%, up from its prior forecast of 7.5% to 8.5%. The fiscal year includes a 53rd week, which is expected to contribute about 2%. The company reiterated its forecast for adjusted earnings in a range of $10.50 to $10.70 per share.This story is developing. Please check back for updates. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Olive Garden owner Darden Restaurants hikes revenue outlook for second straight quarter",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242672-1765922856870-gettyimages-2251668314-DARDEN_EARNS.jpeg?v=1765923049&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T12:28:38.000Z",
      "dateModified": "2025-12-18T12:28:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Micron forecasts surging revenue as computer memory demand for AI remains high",
    "url": "https://www.cnbc.com/2025/12/17/micron-q1-earnings-forecast-memory-demand-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242674-1765922857470-gettyimages-2251668534-MICRON_EARNS.jpeg?v=1765923049&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-17T22:24:56.000Z",
    "description": "The Micron Technology offices in San Jose, California, US, on Tuesday, Dec. 16, 2025. David Paul Morris | Bloomberg | Getty ImagesMicron Technology re",
    "body": "The Micron Technology offices in San Jose, California, US, on Tuesday, Dec. 16, 2025. David Paul Morris | Bloomberg | Getty ImagesMicron Technology reported fiscal first-quarter results on Wednesday that beat Wall Street expectations for sales and earnings per share, and provided a strong forecast for the current quarter.Micron shares rose over 7% in extended trading.Here's how the memory maker did versus LSEG consensus estimates:Earnings per share: $4.78, adjusted, versus $3.95 estimatedRevenue: $13.64 billion vs. $12.84 billion estimatedIn the second quarter, Micron said it expected about $18.70 billion of revenue in the current quarter, versus $14.20 billion expected by LSEG. It said adjusted earnings per share would be about $8.42, blowing away expectations of $4.78 per share.\"This growth in AI data center capacity is driving a significant increase in demand for high-performance and high-capacity memory and storage. Server unit demand has strengthened significantly,\" Micron CEO Sanjay Mehrotra said on an earnings call with analysts, adding that the company sees that server units grew in the \"high teens\" in 2025.Micron had $5.24 billion of net income during the first quarter, or $4.60 per share, versus $1.87 billion in the year-ago period, or $1.67 per share. Overall revenue surged 57% on a year-over-year basis. Micron makes memory and solid-state storage for computers. Those semiconductors have been in short supply in recent months as the artificial intelligence infrastructure boom requires massive amounts of both kinds of chips. Stock Chart IconStock chart iconMicron year-to-date stock chart.The high demand for memory has driven Micron shares higher, up 168% in 2025.Micron is one of three companies that make the high-bandwidth memory needed for AI applications. For example, Micron's memory is used in large quantities in AMD's latest AI chips. Micron said it did $5.28 billion in cloud memory sales, which doubled on an annual basis. The chipmaker reported $2.38 billion in core data center sales, up only 4% year-over-year. The company said both business units were driven by higher pricing. Earlier this month, Micron said it would stop selling memory and other parts directly to consumers, to preserve supply for AI chips and data centers. Read more CNBC tech newsApple punted on AI this year. Next year will be criticalOpenAI in talks with Amazon about investment that could exceed $10 billionShares of Chinese chipmaker MetaX soar nearly 700% in blockbuster Shanghai debutAlphabet-owned Waymo in talks to raise $15 billion in funding",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Micron forecasts surging revenue as computer memory demand for AI remains high",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242674-1765922857470-gettyimages-2251668534-MICRON_EARNS.jpeg?v=1765923049&w=1920&h=1080"
      ],
      "datePublished": "2025-12-17T22:24:56.000Z",
      "dateModified": "2025-12-17T22:24:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MetaX and Moore Threads' IPOs underscore Chinese chipmakers' growing challenge to Nvidia",
    "url": "https://www.cnbc.com/2025/12/17/metax-moore-threads-chinese-rivals-nvidia-ai-chips.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242991-1765986331211-gettyimages-2226429092-tang-notitle250726_npyzD.jpeg?v=1765986576&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T01:00:02.000Z",
    "description": "MetaX booth at the Shanghai New Expo Center in Shanghai, China, on July 26, 2025. (Photo by Ying Tang/NurPhoto via Getty Images)Nurphoto | Nurphoto | ",
    "body": "MetaX booth at the Shanghai New Expo Center in Shanghai, China, on July 26, 2025. (Photo by Ying Tang/NurPhoto via Getty Images)Nurphoto | Nurphoto | Getty ImagesIt felt like déjà vu when shares of chipmaker MetaX Integrated Circuits soared 700% in its Shanghai market debut on Wednesday. Moore Threads surged over 400% on its first day of trading just two weeks earlier.They're the latest Chinese AI chip companies the country's investors are ploughing money into, as it races to develop its own semiconductors and challenge Nvidia's dominance in the face of U.S. export curbs.Both are developing graphics processing units (GPUs), the type of chip manufactured by Nvidia and used for advanced AI.Investor enthusiasm around Chinese AI-chip IPOs is partly shaped by longer-term expectations that China will build a self-sufficient semiconductor ecosystem as tensions with the U.S. continue, Macquarie's equity analyst Eugene Hsiao told CNBC.watch nowWashington has barred sales of Nvidia's most advanced semiconductors to the country. While U.S. President Donald Trump relaxed export curbs for some Nvidia chips, regulators in the country were planning to limit access to the company's processors, the Financial Times reported earlier this month, as it looks to wean itself off overseas tech in the AI race. None of China's AI chipmakers — which include a cohort of tech giants like Huawei, Alibaba and Baidu — have been able to develop processors comparable to Nvidia's most advanced so far.But while significant barriers remain in overcoming export control restrictions in some areas of its chip supply chain, like equipment, it's made significant strides in others, such as memory.  Here's how the market of China's AI chip Nvidia rivals is shaping up.HuaweiPrivately-owned tech giant Huawei develops the Ascend series of chips, with its next-generation model, the 950, to be launched in 2026. Nvidia told CNBC that \"competition has undeniably arrived\" when the new systems were announced.While its previous Ascend models have not been considered competitive with Nvidia's on a chip-by-chip basis, Huawei has been able to build high-performance \"clusters\" to rival the US chipmaker's most advanced systems by linking more of its processors.\"This strategy relies on high-speed, potentially optical interconnects to move data quickly across large clusters – a setup that doesn't require top-end chips and therefore suits China's current strengths,\" Brady Wang, associate director at Counterpoint Research, told CNBC in November.watch nowBaiduChina's biggest search platform, Baidu, has increasingly funneled more resources into AI and is a majority shareholder in chip designer Kunlunxin. In November, the company unveiled a five-year roadmap for its Kunlun AI chips, unveiling new processors in 2026 and 2027.Baidu, which is traded on the Nasdaq, uses a combination of self-developed chips and Nvidia products in its data centers to run its in-house AI models. The company has looked to position itself as a \"full-stack\" provider, producing chips, servers, data centers, and AI models and applications.\"Kunlunxin has emerged as a leading domestic AI chip developer, focusing on high-performance AI chips for large language model (LLM) training and inference, cloud computing, and telecom and enterprise workloads,\" analysts at Deutsche Bank said in a note in November.JPMorgan said in a November note that it viewed the Kunlun AI chip as one of the \"best-positioned\" as Chinese hyperscalers increasingly source from local solution providers.AlibabaE-commerce giant Alibaba — which is sometimes compared with Amazon as it is one of the biggest cloud providers locally — began developing AI chips in the late 2010s. It was developing a new AI chip in August, CNBC reported, specifically designed for inference rather than training.Alibaba's share rose in September after reports that the company had secured a major customer for its AI chips.  \"Improved performance of its self-developed chip\" was one of the factors that supported revenue growth in the cloud division at Alibaba, Morningstar analyst Chelsey Tam said in September.CambriconCambricon, which is developing chips for AI training and inference, posted record profits in the first half of 2025 as revenue surged. The chipmaker, founded in 2016, said revenue rose more than 4,000% year-on-year to 2.88 billion Chinese yuan ($402.7 million) and net profit hit a record 1.04 billion yuan.\"We view Cambricon as the most plausible winner in China's AI accelerator market, which is still at its early stage when compared to the US market on chip accessibility issue,\" Jamie Mills O'Brien, investment director at investment group Aberdeen, told CNBC by email.\"We see multiple roadblocks being digested in next 1-2 years, including fab maturity, client acceptance, and ecosystem formation, which is likely to set Cambricon a 'good enough' alternative to Nvidia's downgraded chips in China.\" An illustration photo shows Moore Threads logo in a smartphone in Suqian, Jiangsu Province, China on October 30, 2025. Cfoto | Future Publishing | Getty ImagesOther AI chip companiesMetaX raised nearly $600 million in its initial public offering on Wednesday, five years on from its founding by former AMD executive Chen Weiliang.Founded in 2020 by a former general manager of Nvidia's Chinese arm, Moore Threads is sometimes referred to as \"China's Nvidia.\"It's set to launch its latest GPU architecture at a Beijing developer conference later this week, according to a report in the South China Morning Post.The company said in its listing that IPO proceeds were needed to accelerate core research and development initiatives, including producing new self-developed AI training and inference GPU chips. Enflame was founded by former AMD employees in 2018 and designs chips for data centers focused on AI training and processes.Biren Technology, founded in 2019, is designing high-performance GPUs and was approved for an IPO by the Chinese regulator on Tuesday, according to reports from Reuters and the South China Morning Post.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MetaX and Moore Threads' IPOs underscore Chinese chipmakers' growing challenge to Nvidia",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242991-1765986331211-gettyimages-2226429092-tang-notitle250726_npyzD.jpeg?v=1765986576&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T01:00:02.000Z",
      "dateModified": "2025-12-18T01:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Instacart shares drop on report that FTC is probing company over AI pricing tool",
    "url": "https://www.cnbc.com/2025/12/17/instacart-sec-probe-pricing-tool.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243337-1766014864766-gettyimages-2212100090-img_8801.jpeg?v=1766014932&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T01:23:59.000Z",
    "description": "Cheng Xin | Getty ImagesShares of grocery delivery service Instacart dropped about 7% in extended trading on Wednesday, following a report that said t",
    "body": "Cheng Xin | Getty ImagesShares of grocery delivery service Instacart dropped about 7% in extended trading on Wednesday, following a report that said the U.S. Federal Trade Commission has begun an investigation into the company's pricing practices.The FTC sent a civil investigative demand to Instacart, Reuters reported, citing unnamed people.\"The Federal Trade Commission has a longstanding policy of not commenting on any potential or ongoing investigations,\" the FTC told CNBC in a statement. \"But, like so many Americans, we are disturbed by what we have read in the press about Instacart's alleged pricing practice.\"A study released last week showed that prices for the same products in the same supermarkets that work with Instacart can vary by around 7%, which can result in over $1,000 in extra annual costs for customers. Instacart responded by saying that retailers determine prices listed in the app.In 2022, Instacart spent $59 million to acquire Eversight, a company specializing in artificial intelligence-driven pricing and promotions for retailers and consumer packaged goods. Instacart sought to \"create compelling savings opportunities for customers in real-time\" with Eversight, according to a regulatory filing.Instacart declined to comment on the investigation but said reporting has mischaracterized its pricing system.\"Much of what's been reported has mischaracterized how pricing works on Instacart,\" a company spokesperson said in an email. \"First, our retail partners control their pricing strategies, and we work with them to align their online and in-store pricing wherever possible. Second, these tests are not dynamic pricing nor surveillance pricing – prices on Instacart do not change in real time nor are they based on supply or demand, and we never use personal, demographic, or user-level behavioral data to set item prices. \"These tests are a form of randomized A/B testing, similar to the way retailers have long run pricing tests between different stores.\"Earlier on Wednesday, Robert Garcia, a U.S. House Democrat from California, sent a letter to Instacart CEO Chris Rogers asking for a report on how the company sets prices.\"It is unconscionable that corporations are adding to Americans' financial strain with algorithmic — and potentially surveillance — pricing,\" wrote Garcia, who is ranking member of the House Committee on Oversight and Government Reform.— CNBC's Annie Palmer contributed to this reportRead Reuters' full report here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instacart shares drop on report that FTC is probing company over AI pricing tool",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243337-1766014864766-gettyimages-2212100090-img_8801.jpeg?v=1766014932&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T01:23:59.000Z",
      "dateModified": "2025-12-18T01:23:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "November's inflation report is the first to be released after the shutdown. Here's what to expect",
    "url": "https://www.cnbc.com/2025/12/17/novembers-inflation-report-is-the-first-to-be-released-after-the-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241518-1766025278703-108241518-1765581890023-gettyimages-2251633512-anotherday162739108_ptc6y0zv.jpg?v=1766025302&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T11:27:57.000Z",
    "description": "People shop at a grocery store in Brooklyn on Dec. 12, 2025 in New York City.Spencer Platt | Getty ImagesWall Street is awaiting Thursday's release of",
    "body": "People shop at a grocery store in Brooklyn on Dec. 12, 2025 in New York City.Spencer Platt | Getty ImagesWall Street is awaiting Thursday's release of the November consumer price index report, as it will mark the first reading for the period since the record-setting U.S. government shutdown ended last month.According to economists surveyed by Dow Jones, the report – which tracks the average change in prices people pay for a range of goods and services – is expected to show a 12-month inflation rate of 3.1%. When excluding food and energy, core CPI is forecast to post an annual rate of 3.0%.The Bureau of Labor Statistics has said the release \"will not include 1-month percent changes for November 2025 where the October 2025 data are missing,\" as the agency canceled the October inflation report in late November, weeks before the Federal Reserve's final meeting of the year. September's CPI data – the most recent CPI report to be published and only piece of economic data released during the shutdown – showed an annual reading of 3.0% for the headline and core measures.\"The psychological distinction between a two handle and a three handle is going to be paramount,\" José Torres, senior economist at Interactive Brokers, said in an interview with CNBC.While the consensus estimate shows the annual rate hitting the 3% threshold for the month, the senior economist is anticipating the headline and core readings to be lower than expected at 2.9% each, though he thinks that the range of possible outcomes for headline could be between that figure and 3.1%.If the report were to show a 2.9% reading, it could offer some positive momentum in stocks heading into 2026. In fact, Torres believes that such a number would clear the path for a so-called Santa Claus rally. He also thinks it would have an impact on the interest rate outlook for next year – a period during which the Fed projects one rate cut.\"It really would strengthen monetary policy easing expectations in the last inflation report – CPI report – of 2025 if we could keep inflation in the twos rather than it increasing up to the threes, because that'll allow more interest rate cuts next year,\" Torres added.Not a 'clean' reportWhile the release could help pave the way for a year-end rally, there would need to be other catalysts in store for that to happen, because others like Victoria Fernandez of Crossmark Global Investments don't see a 0.1 percentage point move in either direction as leading to some \"huge\" market reaction. She also thinks that Fed policymakers would still be in wait-and-see mode even with a 2.9% reading.\"I think it's going to be varied. This is not going to be a clean CPI number,\" the firm's chief market strategist said, citing the absence of month-over-month data as one factor and when exactly the BLS was able to begin collecting the November data as another.U.S. President Donald Trump signs the funding bill to end the U.S. government shutdown, at the White House in Washington, D.C., U.S., Nov. 12, 2025. Kevin Lamarque | ReutersPresident Donald Trump officially signed a funding bill into law on Nov. 12, reopening the government after 43 days of stoppage – the longest duration in U.S. history. That prompted the BLS to push back November's CPI report from its previously scheduled release date of Dec. 10.\"By the time the government actually opened and they started collecting data, we were almost halfway through the month of November, so you're only getting the last half of the month,\" Fernandez said. \"You have to start wondering, 'Is there some kind of a bias in terms of what prices do and how things work in the latter half of the month versus the beginning of a month?'\"Ultimately, the strategist thinks the overall theme will be that inflation is \"remaining high\" and that it's not making its way back towards 2% like some anticipate.\"We have a tremendous amount of uncertainty as to where we're going from here, because we have conflicting stories,\" Fernandez said. \"We can have weak trends in unemployment, weak household income, consumer spending weak, and then we can have the expectation of 14% earnings growth next year and strong revenues. All the puzzle pieces don't quite fit together.\"\"We just need more information before we can make a true statement as to what the long term is going to look like,\" she continued.In the wake of the shutdown ending, key data from another inflation measure has come to light, namely the delayed September reading of the personal consumption expenditures price index. However, investors are still awaiting the PCE reports for October and November, which have yet to be rescheduled.Delayed October producer price index figures are going to be revealed with the November PPI report, whose release has been postponed to Jan. 14.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "November's inflation report is the first to be released after the shutdown. Here's what to expect",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241518-1766025278703-108241518-1765581890023-gettyimages-2251633512-anotherday162739108_ptc6y0zv.jpg?v=1766025302&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T11:27:57.000Z",
      "dateModified": "2025-12-18T11:27:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Visa says new AI shopping tool has helped customers with hundreds of transactions ",
    "url": "https://www.cnbc.com/2025/12/18/visa-ai-payments.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223637-1762789650040-gettyimages-2224936641-AA_18072025_2335257.jpeg?v=1762789670&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-18T11:30:01.000Z",
    "description": "Mustafa Hatipoglu | Anadolu | Getty ImagesVisa said on Thursday that it successfully completed hundreds of AI transactions as part of a pilot program ",
    "body": "Mustafa Hatipoglu | Anadolu | Getty ImagesVisa said on Thursday that it successfully completed hundreds of AI transactions as part of a pilot program that kicked off after the company's product event in April.The credit card issuer and rivals across the fintech industry are racing to build tools that allow consumers to task artificial intelligence agents with completing certain transactions.\"This is going to be the year we see an enormous amount of material adoption, and consumers really starting to get comfortable in a bunch of different agentic environments,\" said Rubail Birwadker, Visa's head of growth products and partnerships, in an interview.AI is transforming the e-commerce experience for shoppers, changing how customers purchase and browse for goods. Mastercard said in April it was testing a feature called Agent Pay that allows AI agents to shop online for customers. Amazon began testing a \"Buy For Me\" offering that same month, while PayPal and Perplexity have joined forces on agentic shopping tools. Earlier in December, a survey from Visa found that nearly half of U.S. shoppers are using AI with purchases. While the data is limited, Birwadker said the tools could be useful for consistent purchases made by consumers or events like concert tickets.Visa said it plans to launch pilot programs in Asia and Europe next year, and is working with over 20 partners on AI agent tools.WATCH: Why Visa is moving deeper into stablecoinswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Visa says new AI shopping tool has helped customers with hundreds of transactions ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223637-1762789650040-gettyimages-2224936641-AA_18072025_2335257.jpeg?v=1762789670&w=1920&h=1080"
      ],
      "datePublished": "2025-12-18T11:30:01.000Z",
      "dateModified": "2025-12-18T11:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]