[
  {
    "title": "The top 3 warning signs your company is preparing for a layoff, according to experts: 'Don't get too comfortable'",
    "url": "https://www.cnbc.com/2025/10/31/top-warning-signs-your-company-is-preparing-for-a-layoff-according-to-experts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217862-1761664714427-gettyimages-1367657152-_mg_8124copy.jpeg?v=1761664744&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T17:36:35.000Z",
    "description": "Amid high-profile job cuts at major companies like Meta, Amazon and Target, many workers are undoubtedly anxious about future downsizing.According to ",
    "body": "Amid high-profile job cuts at major companies like Meta, Amazon and Target, many workers are undoubtedly anxious about future downsizing.According to Jason Walker and Rey Ramirez, co-founders of Thrive HR Consulting, a significant portion of these recent job cuts can be credited to AI.\"Companies are seeing their ability to be more efficient and use less staff with AI, and so they're taking the opportunity right now to reduce staff,\" Walker says.Another reason could be that toward the end of the year, companies \"start to look at head count, they start to look at cost, and there's just general trimming of employees based upon that,\" he says.From an employee's perspective, these job cuts may feel sudden, but there are a few signs workers should pay attention to that could indicate a coming layoff, according to Walker, Ramirez and other experts.Hiring and spending slow downAccording to Jalonni Weaver, a high-volume recruiter based in Dallas, the number one portent of an upcoming layoff is a \"slowdown in hiring.\" It's a red flag when a company stops posting new roles, or when roles remain open for months, Weaver says.That may signal that the company could be in financial trouble — and for Weaver, a decrease in recruiting work meant that her own job was in jeopardy.A hiring freeze doesn't necessarily mean that layoffs are imminent, but \"it's never a good sign that you're doing well financially,\" Walker says.Similarly, she advises workers to keep an eye out for sharp decreases in company spending. When a company is having money troubles, perks like free snacks and ping-pong tables \"go away\" she says, and year-end bonuses could shrink or vanish entirely.With these changes, \"the culture usually shifts,\" Weaver says, and \"nobody's really happy.\"Corporate messaging changesPay attention to what leaders are saying about the future of the business, Ramirez says.Phrases like \"We need to be more efficient\" are potential red flags that the company is looking to cut headcount, according to Ramirez.When a company begins to emphasize operations over innovation, \"that's usually a sign that change is coming, and that people will be impacted,\" according to Rosie Nestingen, an organizational transformation consultant.\"If one quarter you're focused on innovation and impact, and then the next quarter on 'buckling down,'\" that could be a sign of impending layoffs, she says.\"There's a lot of language that starts to [plant] the seeds and set the foundation for what is coming,\" she continues.People trickle outThe last major sign of impending layoffs is \"quiet firing,\" Weaver says, which she defines as companies \"finding ways to push people out, regardless of their performance,\" without conducting formal layoffs.For example, hourly employees may find that their typical weekly hours have been cut in half, Ramirez says.\"Employees can't afford to live on 30 or 40 or 50% less pay, so that almost by design starts to push people out of the organization,\" he says.RTO mandates can be used as another method to reduce headcount, according to Walker: after working remotely for years, studies show that many employees would rather look for another job than return to the office.If co-workers and higher-ups start leaving the company of their own accord, it might be a good idea to follow their example, Weaver says.They may be aware that the company isn't doing well, or they could be stifled by a lack of growth opportunities.How employees can prepareIf you notice red flags that could indicate impending layoffs, \"don't just ignore it or think 'it'll never happen to me,'\" Weaver says.Her biggest piece of advice for employees is to \"always keep your resume up to date,\" she says.Staying abreast of market trends is key, according to Weaver. She advises workers to peruse job descriptions for similar roles and pay attention to which skills are on the rise.Weaver recommends asking yourself, \"What has changed, what are they looking for in newer people, and how can I get that experience in my current role?\"She also suggests that employees periodically apply to other roles, \"even if you are happy at your job,\" to make sure that their resumes remain competitive.Walker has similar advice. \"Your resume should be ready to go,\" he says. \"It should look the best it's ever looked, and if you're getting an inkling of the fact that you think you're going to go, start sending it out in advance, start sending it out right away.\"In today's job market, \"you're not going to be successful with the traditional methods,\" Walker says.Instead of just sending over an application, Walker recommends connecting directly with the hiring manager for the roles you want.\"The ability to get in front of people more personally is really important right now,\" he says.Above all, don't get complacent at your job, Weaver says: \"It's okay to love where you work, but don't get too comfortable to where you miss signs that things are going on.\"\"At the end of the day, businesses are going to do what they need to do for themselves,\" she continues.Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience. Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The top 3 warning signs your company is preparing for a layoff, according to experts: 'Don't get too comfortable'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217862-1761664714427-gettyimages-1367657152-_mg_8124copy.jpeg?v=1761664744&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T17:36:35.000Z",
      "dateModified": "2025-10-31T17:36:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Powell forced to stave off uprisings in markets and on his own Fed board as his term ends",
    "url": "https://www.cnbc.com/2025/10/30/powell-forced-to-stave-off-uprisings-in-markets-and-on-his-own-fed-board-as-his-term-ends.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218888-1761764666906-gettyimages-2243490459-POWELL_FOMC.jpeg?v=1761764764&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-30T20:44:50.000Z",
    "description": "Jerome Powell, chairman of the US Federal Reserve, during a news conference following a Federal Open Market Committee (FOMC) meeting in Washington, DC",
    "body": "Jerome Powell, chairman of the US Federal Reserve, during a news conference following a Federal Open Market Committee (FOMC) meeting in Washington, DC, US, on Wednesday, Oct. 29, 2025. Al Drago | Bloomberg | Getty ImagesFederal Reserve Chair Jerome Powell faces if not the most difficult challenge of his time in office at least the trickiest in his final months as head of the all-powerful U.S. central bank.Fresh off his surprisingly tough talk Wednesday on the potential for another interest rate cut in December, Powell will have to steer his way through a suddenly contentious atmosphere among policymakers that will make whichever direction the Fed chooses divisive.While it's not the existential economic threat posed by the Covid pandemic in 2020, it nevertheless indicates a level of peril uncommon for the institution.\"December could get messy,\" Bank of America economist Aditya Bhave said in a client note. \"We still think the Fed won't cut rates again under Chair Powell. But barring a clear signal in either direction from the data, the December decision will likely be even more contentious than October.\"The Fed on Wednesday approved a widely anticipated quarter percentage point rate reduction that took its benchmark rate down to 3.75%-4%. However, Powell warned that another cut in December \"is not a foregone conclusion,\" something the market was not expecting.While Wall Street economists and strategists were split over whether the committee will in fact approve another reduction at the Dec. 9-10 meeting, they were in agreement that this is a pivotal moment for Powell and the legacy he ultimately will leave when his term runs out in May.\"Even in a situation without much additional data due to the shutdown, it can actually make sense to push against market pricing to keep optionality going forward,\" wrote Michael Gapen, chief U.S. economist at Morgan Stanley. \"A 95% probability assigned to a December cut does not seem consistent with a data-dependent Fed.\"Markets reactFor their part, traders weren't buying the hawkish rhetoric. Fed fund futures pricing Thursday still indicated a 75% probability of a cut in December, though that was down from around 90% the day before, according to the CME Group's FedWatch.But Powell went to great lengths in his post-meeting news conference Wednesday to dispel the notion that the reduction, which would be the third since September, is a slam dunk.The thrust of his argument was multi-pronged: What data there is available during the government shutdown blackout has largely showed a stable economy though the labor market is a risk; inflation is still above target; and, in an unusual development, there are \"strongly differing\" views on the FOMC for where policy should move.Markets were clearly caught off guard by the move, with stocks slipping and Treasury yields surging. The 10-year Treasury yield was solidly above 4% Thursday while the policy-sensitive 2-year note climbed over 3.6% to its highest level in about a month.\"The reaction of the bond market should certainly give Fed officials pause,\" wrote Ed Yardeni, head of Yardeni Research and coiner of the term \"bond vigilantes\" to describe buyers' strikes in the fixed income markets. \"The bond market isn't buying the Fed's cover story that interest rates were too restrictive.\"For Powell, the statement regarding December was an unusual step considering markets had been expecting a more neutral tone. Asked whether he was bothered by the strong anticipation of another cut, Powell said markets should take his statement that a reduction \"is not a foregone conclusion\" should be \"taken on board.\"\"You've got get right in front of that, because you don't want to surprise the market a couple weeks down the road. Now is the time to do it,\" said Dan North, senior economist for North America at Allianz Trade. \"He doesn't usually use words quite so forcefully. So that was interesting, and he's clearly trying to squash speculation about December. We feel the same way, December is going to be a pause.\"Political overhangThe developments come at a ticklish time for the Fed.Powell, a favorite target for President Donald Trump's criticism, has only seven months or so left in his term. Treasury Secretary Scott Bessent has been busy interviewing potential successors — among them current Governors Christopher Waller and Michelle Bowman, both of whom voted in favor of the cut.In addition, Governor Stephen Miran, a hand-picked Trump appointee who will only serve through January, again dissented from the vote in favor of a half-point.At the other end of the spectrum, Kansas City Fed President Jeffrey Schmid voted \"no\" as well, but because he wanted to not cut. Between them run a range of views on the normally consensus-driven FOMC.Whether Powell's tip of the hat to the doves reflects merely a courtesy or deeper misgivings about cuts will be central to Fed analysis in the coming weeks.\"While the press conference played out somewhat differently than we expected, we have not changed our Fed forecast and continue to see a December cut as quite likely,\" Goldman Sachs economist David Mericle wrote. \"We suspect that there is substantial opposition on the FOMC to the risk management cuts and that Powell thought it was important to voice other participants' concerns today in his press conference. But we still think that the arguments for a December cut remain intact.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Powell forced to stave off uprisings in markets and on his own Fed board as his term ends",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218888-1761764666906-gettyimages-2243490459-POWELL_FOMC.jpeg?v=1761764764&w=1920&h=1080"
      ],
      "datePublished": "2025-10-30T20:44:50.000Z",
      "dateModified": "2025-10-30T20:44:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FBI arrests in Michigan stopped potential Halloween terrorist attack, Kash Patel says",
    "url": "https://www.cnbc.com/2025/10/31/fbi-kash-patel-michigan-terrorist-halloween-arrests.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108216027-17612328802025-10-23t151458z_1916994312_rc2rhha4eitx_rtrmadp_0_usa-basketball-arrests.jpeg?v=1761232902&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T17:22:22.000Z",
    "description": "Members of the FBI Joint Terrorism Task Force search a home in Dearborn, Michigan, on October 31, 2025. Jeff Kowalsky | Afp | Getty ImagesFBI Director",
    "body": "Members of the FBI Joint Terrorism Task Force search a home in Dearborn, Michigan, on October 31, 2025. Jeff Kowalsky | Afp | Getty ImagesFBI Director Kash Patel said on Friday morning that the FBI had arrested multiple people in Michigan, thwarting \"a potential terrorist attack ... over Halloween weekend.\"Patel, in a social media post, said that other details about the arrests were forthcoming.\"This morning the FBI thwarted a potential terrorist attack and arrested multiple subjects in Michigan who were allegedly plotting a violent attack over Halloween weekend,\" Patel wrote on X.\"More details to come. Thanks to the men and women of FBI and law enforcement everywhere standing guard 24/7 and crushing our mission to defend the homeland,\" Patel wrote.NBC News reported that the FBI into custody five young people from the cities of Dearborn and Inkster in an investigation into a plot to conduct an attack in the United States \"that has a connection to ISIS extremism.\"NBC, citing three senior law enforcement officials briefed on the probe, reported that the group discussed conducting an attack around Halloween, which they called \"pumpkin day.\" FBI Director Kash Patel, speaks during a press conference related to arrests of NBA players and coaches for illegal gambling schemes, at the U.S. Attorney's Office in Brooklyn, New York, October 23, 2025.   Eduardo Munoz | ReutersThe Police Department in Dearborn, Michigan, in a post on Facebook, it had been \"made aware that the FBI conducted operations in the City of Dearborn earlier this morning.\"\"We want to assure our residents that there is no threat to the community at this time,\" the department said.This is developing news. Check back for updates.Read more CNBC politics coverageShutdown cost government contractors $12B so far: U.S. Chamber of CommerceThe big takeaways from the Trump-Xi meeting — what the truce coversShipping sector skeptical Trump's latest trade truce with China will reverse import declineTrump-Xi meeting nears with high stakes and hopes, but few detailsGovernment shutdown could cost U.S. economy up to $14 billion, CBO says",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FBI arrests in Michigan stopped potential Halloween terrorist attack, Kash Patel says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108216027-17612328802025-10-23t151458z_1916994312_rc2rhha4eitx_rtrmadp_0_usa-basketball-arrests.jpeg?v=1761232902&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T17:22:22.000Z",
      "dateModified": "2025-10-31T17:22:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samsung building facility with 50,000 Nvidia GPUs to automate chip manufacturing",
    "url": "https://www.cnbc.com/2025/10/31/samsung-nvidia-ai-chips-megafactory.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218542-1761747041057-gettyimages-2243417409-NVIDIA_AI_KEYNOTE.jpeg?v=1761747105&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T16:42:48.000Z",
    "description": "Jensen Huang, chief executive officer of Nvidia Corp., during the keynote address at the Nvidia GTC (GPU Technology Conference) in Washington, DC, US,",
    "body": "Jensen Huang, chief executive officer of Nvidia Corp., during the keynote address at the Nvidia GTC (GPU Technology Conference) in Washington, DC, US, on Tuesday, Oct. 28, 2025. Kent Nishimura | Bloomberg | Getty ImagesKorean semiconductor giant Samsung said Thursday that it plans to buy and deploy a cluster of 50,000 Nvidia graphics processing units to improve its chip manufacturing for mobile devices and robots.The 50,000 Nvidia GPUs will be used to create a facility Samsung is calling an \"AI Megafactory.\" Samsung didn't provide details about when the facility would be built.It's the latest splashy partnership for Nvidia, whose chips remain essential for building and deploying advanced artificial intelligence.The agreement with Samsung comes after Nvidia CEO Jensen Huang on Tuesday announced in Washington, D.C., that Nvidia was collaborating with companies including Palantir, Eli Lilly, CrowdStrike and Uber.Shortly after the speech, Huang was spotted in South Korea drinking beer with Samsung Chairman Lee Jae-yong and other business leaders, according to local media. Other Korean companies, including SK Group and Hyundai, are also deploying similar amounts of GPUs, Nvidia said.\"We're working closely with the Korean government to support its ambitious leadership plans in AI,\" Raymond Teh, Nvidia's senior vice president of Asia-Pacific, said on a call Wednesday with reporters.The partnerships support Huang's claim on Tuesday that Nvidia has a book of business that totals $500 billion from its current generation GPU, called Blackwell, in addition to its next-generation GPU, called Rubin.The forecast helped boost Nvidia's stock, making the company the first to reach a market cap of $5 trillion.On Thursday, Nvidia representatives said they will work with Samsung to adapt the Korean company's chipmaking lithography platform to work with Nvidia's GPUs. That process will results in 20 times better performance for Samsung, the Nvidia representatives said. Samsung will also use Nvidia's simulation software called Omniverse. Known for its mobile phones, Samsung also said it would use the Nvidia chips to run its own AI models for its devices.In addition to being a partner and customer, Samsung is also a key supplier for Nvidia.Samsung makes the kind of high-performance memory Nvidia uses in large quantities, alongside its AI chips, called high bandwidth memory. Samsung said it will work with Nvidia to tweak its HBM4 memory for use in AI chips.WATCH: Night out in Seoul: Nvidia, Samsung, and Hyundai bosses bond over fried chicken and sojuwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung building facility with 50,000 Nvidia GPUs to automate chip manufacturing",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218542-1761747041057-gettyimages-2243417409-NVIDIA_AI_KEYNOTE.jpeg?v=1761747105&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T16:42:48.000Z",
      "dateModified": "2025-10-31T16:42:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon's stock soars 10% on third-quarter beat, increased spending guidance",
    "url": "https://www.cnbc.com/2025/10/31/amazon-amzn-stock-earnings-revenue-ai-cloud.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108107825-17405902912025-02-26t171428z_315459334_rc2f2daohftm_rtrmadp_0_amazon-com-alexa.jpeg?v=1740590368&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T20:03:00.000Z",
    "description": "Amazon CEO Andy Jassy speaks during an Amazon Devices launch event in New York City, U.S., February 26, 2025. Brendan Mcdermid | ReutersAmazon shares ",
    "body": "Amazon CEO Andy Jassy speaks during an Amazon Devices launch event in New York City, U.S., February 26, 2025. Brendan Mcdermid | ReutersAmazon shares soared 10.81% on Friday after the company reported an across-the-board beat for the third quarter and boosted its forecast for spending due to demand for artificial intelligence services.Cloud was a major driver of revenue and profit growth, with sales at Amazon Web Services climbing 20% from a year earlier to $33 billion, topping expectations.The unit generated operating income of $11.4 billion, accounting for roughly two-thirds of Amazon's total operating profit.Revenue in the digital advertising business, another growth engine, jumped 24% to $17.7 billion. Total sales at Amazon climbed 13% to $180.17 billion, topping the average analyst estimate of $177.8 billion, according to LSEG. Earnings per share came in at $1.95, exceeding the $1.57 average estimate.\"Amazon has a deep moat around their core businesses driven by their unmatched scale,\" analysts at Pivotal Research wrote in a note after the report.The analysts, who recommend buying the stock, said Amazon \"appears to have numerous healthy organic growth opportunities driven by their high margin AWS cloud segment\" and areas like advertising.Coming into earnings, cloud was an area of key concern due to increased competition from Google and Microsoft, which also reported quarterly results this week. Google's cloud revenue increased 34% during the third quarter, while Microsoft Azure recorded growth of 40%.Read more CNBC tech newsNvidia CEO Jensen Huang says AI is in a 'virtuous cycle.' Here's what he meansApple isn't playing the same AI capex game as the rest of the megacapsAmazon raises spending forecast to $125 billion as third-quarter results top estimatesSpaceX and Blue Origin both submitted plans to get astronauts back to the moon faster, NASA saysAmazon's stock was up just 1.6% for the year ahead of the report, well behind its megacap peers.While the company remains the leading provider of cloud infrastructure technology, it's been battling the perception that it's missing out on a flurry of highly lucrative AI deals for cloud services.But when it comes to spending, Amazon is ahead of its rivals.Amazon raised its forecast for capital expenditures this year, saying it now expects to spend $125 billion in 2025, up from an earlier estimate of $118 billion. CFO Brian Olsavsky said that number will likely increase in 2026. Google, Meta and Microsoft also lifted their capex guidance, but were all below Amazon.For the current quarter, Amazon said it expects sales to be $206 billion to $213 billion. The midpoint of the revenue outlook, $209.5 billion, topped estimates of $208 billion, according to LSEG.While investors are cheering Amazon's results, it's been a tough week for a wide swath of the company's workforce.On Tuesday, Amazon said it will lay off 14,000 corporate employees, as part of a push to make the company leaner and less bureaucratic, so it can move faster. More cuts are expected soon, and Jassy said it's not \"financially driven\" or due to AI, \"right now, at least.\"\"It really, it's culture,\" Jassy said. \"If you grow as fast as we did for several years, you know, the size of the businesses, the number of people, the number of locations, the types of businesses you're in, you end up with a lot more people than what you had before, and you end up with a lot more layers.\"The company finished the quarter with about 1.58 million employees, which was a 2% increase from the year-ago period.Sales in Amazon's core online stores unit posted growth of 10% during the quarter, which includes the results of its Prime Day discount event in July.WATCH: Apple will outperform Amazonwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon's stock soars 10% on third-quarter beat, increased spending guidance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108107825-17405902912025-02-26t171428z_315459334_rc2f2daohftm_rtrmadp_0_amazon-com-alexa.jpeg?v=1740590368&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T20:03:00.000Z",
      "dateModified": "2025-10-31T20:03:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump touts marble Lincoln Bathroom remodel amid government shutdown",
    "url": "https://www.cnbc.com/2025/10/31/trump-bathroom-white-house-remodel-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220170-1761935886190-ceeef81da83c713f.jpg?v=1761937288&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T20:50:08.000Z",
    "description": "White House Lincoln Bathroom Renovation.Source: @realdonaldtrump | Truth SocialFirst it was the Oval Office,  then the East Wing — now it's the Lincol",
    "body": "White House Lincoln Bathroom Renovation.Source: @realdonaldtrump | Truth SocialFirst it was the Oval Office,  then the East Wing — now it's the Lincoln Bedroom's bathroom.President Donald Trump on Friday proudly showed off the latest project in his inside-and-out remodel of the White House — as critics slammed him as \"tone deaf\" for touting glitzy renovations during the costly government shutdown.Trump shared two dozen photos of the newly refurbished bathroom, which is now covered from floor to ceiling with what he described as \"black and white polished Statuary marble.\"Renovated Lincoln Bathroom in the White House.Source: @realdonaldtrump | Truth Social\"This was very appropriate for the time of Abraham Lincoln and, in fact, could be the marble that was originally there!\" Trump wrote in one of seven Truth Social posts containing photos of the renovation.The bathroom also sports gold-colored fixtures and accents — including the bath and sink faucets, wall sconces and trash bin — as well as a crystal hanging chandelier, the photos show.Trump told NBC News in July that he planned to update the bathroom of the historic Lincoln Bedroom in a style that is truer to the era of the 16th president, who held office from 1861 until his assassination in 1865.The previous decor, an art deco green tile style, was \"totally inappropriate for the Lincoln Era,\" Trump wrote in Friday's post.The Lincoln Bathroom in the White House before renovation.Source: @realdonaldtrump | Truth SocialTrump's Democratic critics pounced on the construction updates, slamming him for focusing on the bathroom remodel while a government shutdown, now in its 31st day, threatens access to crucial federal services.\"Donald Trump actually cares more about his toilet than he does about fixing your healthcare,\" Senate Minority Leader Chuck Schumer, D-N.Y., wrote in an X post.\"Millions of people are being kicked off of food assistance and millions can't afford health care anymore. But don't worry everyone! Trump got a new bathroom,\" Democratic commentator Harry Sisson wrote on X.\"So tone deaf, out of touch, and disgusting,\" Sisson added.\"We are in a serious govt shutdown, but instead of negotiating, Trump posted several pics of his WH bathroom remodel today and now this,\" wrote Ron Filipowski, editor in chief of the anti-Trump media outlet MeidasTouch.Asked for a response to those critiques, White House spokesman Davis Ingle told CNBC, \"Democrats are more concerned with President Trump's historic beautification of the White House than they are for American citizens they are hurting because of their reckless government shutdown.\"In another Truth Social post Friday, Trump announced that he had inspected construction taking place at the Kennedy Center, where, months earlier, he had fired several board members and installed himself as chair.\"It is really looking good!\" he wrote. \"The exterior columns, which were in serious danger of corrosion if something weren't done, are completed, and look magnificent in White Enamel — Like a different place!\"\"Marble is being done, stages are being renovated, new seats, new chairs, and new fabrics will soon be installed, and magnificent high end carpeting throughout the building,\" Trump wrote.The update came hours after The Washington Post reported that ticket sales at the Kennedy Center have plummeted in recent months.Read more CNBC politics coverageShutdown cost government contractors $12B so far: U.S. Chamber of CommerceThe big takeaways from the Trump-Xi meeting — what the truce coversShipping sector skeptical Trump's latest trade truce with China will reverse import declineTrump-Xi meeting nears with high stakes and hopes, but few detailsGovernment shutdown could cost U.S. economy up to $14 billion, CBO says",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump touts marble Lincoln Bathroom remodel amid government shutdown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220170-1761935886190-ceeef81da83c713f.jpg?v=1761937288&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T20:50:08.000Z",
      "dateModified": "2025-10-31T20:50:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Getty Images stock falls following deal with Perplexity AI",
    "url": "https://www.cnbc.com/2025/10/31/getty-images-stock-perplexity-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207464-1759494073766-gettyimages-2238362029-kokovlis-notitle251002_np4bt.jpeg?v=1759494130&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T20:33:41.000Z",
    "description": "The Perplexity application appears on a smartphone screen in this photo illustration in Athens, Greece, on October 2, 2025. Nikolas Kokovlis | Nurphot",
    "body": "The Perplexity application appears on a smartphone screen in this photo illustration in Athens, Greece, on October 2, 2025. Nikolas Kokovlis | Nurphoto | Getty ImagesShares of Getty Images closed down more than 6% on Friday after the company announced that it struck a multi‑year licensing agreement with Perplexity AI.Perplexity will be able to display creative and editorial content from Getty Images through its AI-powered search tools as part of the deal, according to a release. The startup will also improve how it displays imagery on its platform by adding image credits and links to the source.\"Partnerships such as this support AI platforms to increase the quality and accuracy of information delivered to consumers, ultimately building a more engaging and reliable experience,\" Nick Unsworth, vice president of strategic development at Getty Images, said in a statement.The financial terms of the agreement were not disclosed.Read more CNBC tech newsNvidia CEO Jensen Huang says AI is in a 'virtuous cycle.' Here's what he meansApple isn't playing the same AI capex game as the rest of the megacapsAmazon raises spending forecast to $125 billion as third-quarter results top estimatesSpaceX and Blue Origin both submitted plans to get astronauts back to the moon faster, NASA sayswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Getty Images stock falls following deal with Perplexity AI",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207464-1759494073766-gettyimages-2238362029-kokovlis-notitle251002_np4bt.jpeg?v=1759494130&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T20:33:41.000Z",
      "dateModified": "2025-10-31T20:33:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Musk teases Tesla Roadster demo by year-end. He's been hyping a new one since 2017",
    "url": "https://www.cnbc.com/2025/10/31/musk-teases-tesla-roadster-demo-this-year-been-hyping-it-since-2017.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108165343-1751051524166-2010-11-12T120000Z_766215986_GM1E6BC11ZK01_RTRMADP_3_TOYOTA-TESLA.JPG?v=1751051610&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T23:53:25.000Z",
    "description": "Toyota Motor Corp President Akio Toyoda gets out of a Tesla Motor's Roadster electric car with Tesla Motors Chief Exective Officer Elon Musk (behind c",
    "body": "Toyota Motor Corp President Akio Toyoda gets out of a Tesla Motor's Roadster electric car with Tesla Motors Chief Exective Officer Elon Musk (behind car) upon their arrival at a news conference in Tokyo November 12, 2010.Issei Kato | ReutersEight years ago, Tesla CEO Elon Musk promoted a next-generation Roadster, basing the name of the sports car on the company's debut electric vehicle from 2008.The updated version has yet to hit production. But Musk is again promising that a new one is on the way.In a discussion with podcaster Joe Rogan that was published on Friday, Musk was asked about the long-delayed vehicle. He provided a sense of timing but declined to share updated technical or design details.\"I can't do the unveil before the unveil,\" Musk said. As he's said before, Musk claimed the new Roadster \"has a shot at being the most memorable product unveil ever.\"Tesla is aiming to show off the updated Roadster to fans and investors \"hopefully before the end of the year,\" Musk said.Musk's comments come a day after former close friend Sam Altman, OpenAI's CEO, posted on X that he tried to cancel his Roadster reservation from 2018 and get his deposit refunded. He shared a screenshot showing that his email to the company had bounced back.\"I really was excited for the car!\" Altman wrote. \"And I understand delays. But 7.5 years has felt like a long time to wait.\"Musk, who helped start OpenAI in 2015, is in a heated legal dispute with Altman and now runs competing artificial intelligence startup xAI.Patrick George, editor-in-chief at InsideEVs and a long-time industry observer, told CNBC on Friday that the Roadster \"has been MIA for years.\"\"The only thing I can think of that would make Musk start talking about this again is that Sam Altman at OpenAI, who is sort of his arch-rival, just said recently that he was trying to cancel his Roadster reservation which he has held since 2018,\" George said.Earlier this year, the popular gadget and autos reviewer Marques Brownlee discussed the arduous process of cancelling his own Roadster reservation in an interview with Waveform Podcast.The Roadster is a high end, low-volume model, something meant to challenge vehicles like BYD's YangWang U9 Xtreme, which was recently crowned the world's fastest production car.Musk faces a major Tesla shareholder vote next week, as he and the board are asking investors to approve a massive pay package.The pay plan would net Musk nearly $1 trillion in Tesla stock and would grow his stake to around 25%, depending on the company hitting various market valuations and other growth milestones.WATCH: CNBC's interview with Tesla Chair Robyn Denholmwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Musk teases Tesla Roadster demo by year-end. He's been hyping a new one since 2017",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108165343-1751051524166-2010-11-12T120000Z_766215986_GM1E6BC11ZK01_RTRMADP_3_TOYOTA-TESLA.JPG?v=1751051610&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T23:53:25.000Z",
      "dateModified": "2025-10-31T23:53:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Republican who oversaw student debt launches class action effort against Trump administration ",
    "url": "https://www.cnbc.com/2025/10/31/student-loan-class-action-lawsuit.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106210042-1572357415116img_2331.png?v=1572530654&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T20:47:53.000Z",
    "description": "Wayne Johnson at the Gables of Wolf Creek, the retirement community he owns in Macon, GeorgiaAnnie Nova | CNBCA Republican who oversaw the country's $",
    "body": "Wayne Johnson at the Gables of Wolf Creek, the retirement community he owns in Macon, GeorgiaAnnie Nova | CNBCA Republican who oversaw the country's $1.6 trillion federal student loan portfolio during President Donald Trump's first term has funded a class action effort against the administration over its current borrower policies.The proposed class action lawsuit, filed this week in federal court in Atlanta, said Education Secretary Linda McMahon and the largest credit rating companies are violating the Fair Credit Reporting Act — a federal law that, among other provisions, requires information in consumer credit reports to be accurate.According to the lawsuit, the Trump administration reported federal student loan borrowers as late on their bills to credit rating agencies while being unable to enroll them in repayment plans or to provide them with sufficient consumer support. It said Equifax, Experian and TransUnion did not make sure the reported data was correct, leaving borrowers with damaged credit.Wayne Johnson, the 2024 Republican nominee for Congress in Georgia's 2nd District and a former chief operating officer at the Office of Federal Student Aid, is financially backing the class action effort.Johnson told CNBC that it shouldn't come as a surprise that a Republican is behind a lawsuit to make sure borrowers aren't unfairly reported to the credit rating agencies.\"I want to stop damaging people and the economy,\" Johnson said, and \"I don't want to piss off voters.\"Read more CNBC personal finance coverageStudent loan class action effort: Trump official, credit agencies hurt borrowers' scoresTreasury Department: Series I bond rate of 4.03% through April 2026Taxpayers may see 'record tax refund season' in 2026, analysts sayMillions face 'huge sticker shock' when ACA open enrollment starts Nov. 1Here's the maximum 2026 Social Security full retirement benefit, after 2.8% COLAStudent loan forgiveness for public servants to be limited under TrumpDemocrats propose increasing VA, Social Security benefits by $200 a monthAdjustable-rate mortgages are 'underappreciated,' top advisor saysHow the 2026 Social Security payroll tax cap could impact your paycheckWhat this Fed rate cut means for your credit card, mortgage and savings accountHow the Fed's decision to lower rates could widen the generational wealth gapThis investing move is the 'holy grail of retirement planning,' advisor saysWhat another Fed cut could mean for borrowers — some rates may barely budgeWhat student loan borrowers need to know, as forgiveness resumes under two plansAmericans face a retirement 'confidence paradox': How to gauge readinessCNBC's Financial Advisor 100: Best financial advisors, top firms for 2025 rankedMore than 40 million Americans hold student loans. The Trump administration said in April that more than 5 million borrowers were in default, and more were at risk.\"This is a story about millions of responsible student loan borrowers who want to make payments but are unable to do so because of the lack of operational capabilities of the department,\" Johnson said.In an email, an Education Department spokesperson called the class action effort \"an embittered attempt by ideologues\" to change the administration's efforts to get defaulted borrowers back into repayment.An Equifax spokesperson said the company does not comment on pending litigation.Experian and TransUnion did not respond to requests for comment.Collection efforts have affected borrowers' creditThe Trump administration restarted collection efforts on defaulted student loans in May, a move experts said has put millions of borrowers at risk of wage garnishment and lower credit scores.A May analysis by TransUnion found that consumers who faced default in recent months saw their credit scores fall by 63 points, on average. For super prime borrowers — or those with credit scores above 780 — who were seriously delinquent, scores sank as much as 175 points. Credit scores typically range between 300 and 850.Collection activity had been paused for roughly five years, a remainder of Covid-era policies meant to offer relief to borrowers.Trump officials' focus on recouping payments from defaulted student loan borrowers was a reversal of the Education Department's strategy under former President Joe Biden, which centered more on providing borrowers with additional options to get current on their bills.The collection activity also began shortly after the Trump administration terminated nearly half of the Education Department's staff, including many of the people who assisted borrowers.More than 1 million federal student loan borrowers are stuck in a backlog to enroll in repayment plans, according to court records from mid-September.\"The U.S. Department of Education has painted delinquent borrowers with a broad brush of hyperbole and threatened them with enforced collections, even though these borrowers have been unable to make payments,\" said higher education expert Mark Kantrowitz.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Republican who oversaw student debt launches class action effort against Trump administration ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106210042-1572357415116img_2331.png?v=1572530654&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T20:47:53.000Z",
      "dateModified": "2025-10-31T20:47:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix announces a 10-for-1 stock split",
    "url": "https://www.cnbc.com/2025/10/30/netflix-stock-split.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219648-1761855345510-gettyimages-2243334427-20251024SOPAMASL070.jpeg?v=1761855385&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T12:28:28.000Z",
    "description": "Mateusz Slodkowski | SOPA Images | Lightrocket | Getty ImagesNetflix announced a 10-for-1 stock split Thursday, a move that changes nothing fundamenta",
    "body": "Mateusz Slodkowski | SOPA Images | Lightrocket | Getty ImagesNetflix announced a 10-for-1 stock split Thursday, a move that changes nothing fundamentally about the company, but could make the pricey individual shares more accessible to the retail investor.Existing shareholders as of Nov. 10 will receive nine additional shares for each one they hold. They'll get that allotment on Nov. 14, and the stock will begin trading at the new post-split price on Monday, Nov. 17.Netflix, the streaming leader whose shares have boomed over the last three years to above $1,000 apiece, said it was making the change to \"reset the market price of the Company's common stock to a range that will be more accessible to employees who participate in the Company's stock option program.\"Netflix shares added more than 2% after hours on the split announcement. The stock closed Thursday at $1,089 a share, up 42% for the past one year.Stock Chart IconStock chart iconNetflix, 5 yearsThe stock is currently one of 10 stocks in the S&P 500 with a price above $1,000.It's common practice for companies that reach those levels to split the shares, although the effectiveness of such a move is debatable with the widespread use of fractional trading available on brokerage platforms.A split simply gives each a holder more shares at a lower price, while the value of their holding does not change at all. All fundamental measures for the company remain the same.Warren Buffett has famously refused to split the shares of Berkshire Hathaway for this reason, with the stock priced at more than $717,000 a share. Buffett did create a \"B\" class of shares that are more modestly priced at $478 each.Netflix has split its shares twice before, in 2015 and 2004.Clarification: This story has been updated to clarify that Netflix stock is up 42% for the past one year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix announces a 10-for-1 stock split",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219648-1761855345510-gettyimages-2243334427-20251024SOPAMASL070.jpeg?v=1761855385&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T12:28:28.000Z",
      "dateModified": "2025-10-31T12:28:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Exxon in advanced talks to power AI data centers with natural gas and carbon capture",
    "url": "https://www.cnbc.com/2025/10/31/exxon-ai-data-center-natural-gas-carbon-capture.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220053-1761924196425-gettyimages-2224637282-ENERGY_INNOVATION_SUMMIT.jpeg?v=1761924233&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T18:50:13.000Z",
    "description": "Darren Woods, chairman and chief executive officer Exxon Mobil Corp., speaks during a panel discussion at the inaugural Pennsylvania Energy and Innova",
    "body": "Darren Woods, chairman and chief executive officer Exxon Mobil Corp., speaks during a panel discussion at the inaugural Pennsylvania Energy and Innovation Summit at Carnegie Mellon University in Pittsburgh, Pennsylvania, US, on July 15, 2025. Brian Kaiser | Bloomberg | Getty ImagesExxon Mobil is holding advanced talks with power providers and technology companies to cut the emissions of AI data centers that rely on natural gas by deploying carbon capture technology, CEO Darren Woods said Friday.\"I'm hopeful that many of these hyperscalers are sincere when they talk about the desire to have low emission facilities, because certainly in the near to medium term we're probably the only realistic game in town to accomplish that,\" Woods said on Exxon's earnings call.Hyperscalers refers to companies such as Alphabet, Amazon, Meta and Microsoft that are building large data centers to train and run artificial intelligence applications.Exxon aims to capture 90% of the carbon dioxide emissions emitted by natural gas plants that power data centers, Woods said. The oil major is talking with power companies to decarbonize their plants, he said. \"We're pretty advanced in the conversations,\" the CEO said.The tech sector has mostly secured renewable energy to offset the emissions from their data centers, though they are now making major investments in nuclear power as well.Some companies are turning to natural gas as well as they search for reliable power. Meta, for example, signed an agreement with the utility Entergy in Louisiana to power a data center campus with natural gas.\"We secured locations. We've got the existing infrastructure, certainly have the know-how in terms of the technology of capturing, transporting and storing [carbon dioxide],\" Woods said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Exxon in advanced talks to power AI data centers with natural gas and carbon capture",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220053-1761924196425-gettyimages-2224637282-ENERGY_INNOVATION_SUMMIT.jpeg?v=1761924233&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T18:50:13.000Z",
      "dateModified": "2025-10-31T18:50:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon raises spending forecast to $125 billion as third-quarter results top estimates",
    "url": "https://www.cnbc.com/2025/10/30/amazon-amzn-q3-earnings-report-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218967-17617695792025-07-09t002653z_224496516_rc2oifaeqtmc_rtrmadp_0_media-sunvalley.jpeg?v=1761769606&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-30T22:13:55.000Z",
    "description": "watch nowAmazon shares jumped more than 13% in extended trading Thursday after the company posted third-quarter earnings that exceeded expectations, a",
    "body": "watch nowAmazon shares jumped more than 13% in extended trading Thursday after the company posted third-quarter earnings that exceeded expectations, along with strong growth in its cloud-computing unit.Here's how the company did, compared with estimates from analysts polled by LSEG:Earnings per share: $1.95 vs. $1.57 estimatedRevenue: $180.17 billion vs. $177.8 billion estimatedWall Street was also looking at other key revenue numbers:Amazon Web Services: $33 billion vs. $32.42 billion expected, according to StreetAccountAdvertising: $17.7 billion vs. $17.34 billion expected, according to StreetAccountRevenue in Amazon's cloud unit accelerated 20.2% during the quarter, surpassing analysts' expectations of 18.1%. Cloud growth has been a key area of concern for the company, as it faces intensifying pressure from rivals Google and Microsoft, which also reported quarterly results this week.Google's cloud revenue increased 34% during the third quarter, while Microsoft Azure recorded growth of 40%.Amazon CEO Andy Jassy said in a statement that AWS is \"growing at a pace we haven't seen since 2022\" and touted robust artificial intelligence demand.\"We continue to see strong demand in AI and core infrastructure, and we've been focused on accelerating capacity — adding more than 3.8 gigawatts in the past 12 months,\" Jassy said.While Amazon remains the leading provider of cloud infrastructure technology, it's been battling the perception that it's missing out on a flurry of highly lucrative AI deals for cloud services. That concern has weighed on Amazon's stock, which is up roughly 1.6% year to date, trailing its Magnificent Seven peers.The company on Wednesday opened its $11 billion AI data center called Project Rainier, built exclusively to run models from Claude chatbot creator Anthropic.Amazon raised its forecast for capital expenditures this year, saying it now expects to spend $125 billion in 2025, up from its earlier estimate of $118 billion. CFO Brian Olsavsky said that number will likely increase in 2026.Read more CNBC tech newsNvidia CEO Jensen Huang says AI is in a 'virtuous cycle.' Here's what he meansApple isn't playing the same AI capex game as the rest of the megacapsAmazon raises spending forecast to $125 billion as third-quarter results top estimatesSpaceX and Blue Origin both submitted plans to get astronauts back to the moon faster, NASA saysFor the current quarter, Amazon said it expects sales to be $206 billion to $213 billion. The midpoint of the revenue outlook, $209.5 billion, topped estimates of $208 billion, according to LSEG.Operating income is expected to be between $21 billion and $26 billion, compared with analysts' projected $23.8 billion.AI has become a major area of investment across Amazon, including in its retail, cloud, devices and ads businesses. The company is responding to an explosion of interest around generative AI, particularly after the launch of OpenAI's ChatGPT chatbot in 2022.While it continues to invest in AI, Amazon has looked to cut costs in other areas. On Tuesday, Amazon said it will lay off 14,000 corporate employees, as part of a push to make the company leaner and less bureaucratic, so it can move faster.Jassy addressed the layoffs during a conference call with investors, saying the announcement wasn't \"financially driven\" or due to AI, \"right now, at least.\"\"It really it's culture,\" Jassy said. \"If you grow, as fast as we did for several years, you know, the size of the businesses, the number of people, the number of locations, the types of businesses you're in, you end up with a lot more people than what you had before, and you end up with a lot more layers.\"Amazon has in recent years shaved its headcount after going on a hiring spree during the pandemic, which caused its corporate and frontline workforces to balloon. The company finished the quarter with about 1.58 million employees, which was a 2% increase from the year ago period.Operating income was flat year over year in the quarter at $17.4 billion. The company said the number reflects its $2.5 billion settlement with the Federal Trade Commission, reached in September, over the agency's \"deceptive\" Prime signups lawsuit.It also includes about $1.8 billion in severance costs \"primarily related to planned role eliminations,\" the company said.Stock Chart IconStock chart iconAmazon year-to-date stock chart.Amazon has introduced Q, a chatbot for businesses, and Bedrock, a generative AI service for cloud customers. Last February, it rolled out a shopping chatbot called Rufus that can answer questions and suggest products.The company said 250 million shoppers have used Rufus this year, with 60% of users \"more likely to complete a purchase\" after interacting with the chatbot.Sales in Amazon's core online stores unit posted solid growth of 10% during the quarter, which includes the results of its Prime Day discount event in July.The company has been navigating uncertainty around President Donald Trump's shifting trade policies, though Jassy told investors last quarter that the tariff increases haven't dented consumer demand or led to significant price increases.Amazon also cited tariffs and trade policy as factors that could make its guidance subject to change.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon raises spending forecast to $125 billion as third-quarter results top estimates",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218967-17617695792025-07-09t002653z_224496516_rc2oifaeqtmc_rtrmadp_0_media-sunvalley.jpeg?v=1761769606&w=1920&h=1080"
      ],
      "datePublished": "2025-10-30T22:13:55.000Z",
      "dateModified": "2025-10-30T22:13:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chocolate's reign over Halloween is under threat from inflation, tariffs and high cocoa prices",
    "url": "https://www.cnbc.com/2025/10/31/chocolate-prices-halloween-tariffs-inflation-candy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108048713-1729110725978-gettyimages-2178767864-dsc_1416_18rzkx1t.jpeg?v=1729110830&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T11:30:01.000Z",
    "description": "A customer shops for Halloween candy at a Walmart Supercenter on October 16, 2024 in Austin, Texas. Brandon Bell | Getty ImagesThe scariest thing haun",
    "body": "A customer shops for Halloween candy at a Walmart Supercenter on October 16, 2024 in Austin, Texas. Brandon Bell | Getty ImagesThe scariest thing haunting Halloween this year isn't a ghost, goblin or ghoul — it's the price of chocolate.From Snickers to Reese's to Twix, one of America's favorite indulgences is getting more expensive, as tariffs, inflation and high cocoa prices squeeze profit margins and customers' pocketbooks, possibly leading to fewer chocolate bars landing in trick-or-treat buckets this year.Chocolate prices have surged nearly 30% since last Halloween and almost 78% in the past five years, according to data from research firm Circana and the U.S. Bureau of Labor Statistics. A 100-piece variety bag of candy now costs $16.39, up from $7.20 in 2020, FinanceBuzz found.That spike is showing up on store shelves. Variety packs from Hershey — maker of Reese's, KitKats and Heath bars — are up about 22%, while Mars, the company behind M&M's and Milky Way, raised prices about 12%, according to the Century Foundation, a progressive, independent think tank, and the Groundwork Collaborative.\"The season did get off to a slow start,\" Hershey CEO Kirk Tanner told investors on an earnings call Thursday, warning that holiday sales could be softer this year.About 4 in 5 Americans buy candy for the Halloween holiday, according to YouGov. This time of year makes up about 18% of annual U.S. confectionery sales — second only to Christmas, according to the National Confectioners Association.But chocolate's dominance is slipping. Circana found it made up 52% of Halloween candy sales last year, compared with 44% this year, as shoppers shift toward cheaper, trendier sweets.\"Macroeconomic headwinds\" are among the culprits, said Sally Wyatt, who works for Circana analyzing global consumer packaged goods and as a food-service industry advisor. \"It's the compounded impact on top of the fact that we've outpaced wage growth. So consumers have started to ... [make] very specific choices on discretionary items.\"Sector-wide, candy prices are outpacing the national inflation rate, marking a roughly 10% increase compared with last year, according to the Century Foundation. Still, the National Retail Federation said 2025 is expected to be a record year for candy sales in the U.S., with about $3.9 billion spent on Halloween candy alone.\"Even as consumers face higher prices for food, they continue to leave room in their budgets for chocolate and candy, meaning that the category is strong, vibrant and growing,\" Carly Schildhaus, a spokesperson for the National Confectioners Association, told CNBC.Much of the chocolate filling U.S. shelves this fall was made from cocoa beans purchased at record prices last December, when futures peaked above $12,000 per ton, experts said. Prices have since cooled to around $6,000, but that's still more than double the pre-pandemic average.A cocktail of rising temperatures, erratic rainfall, drought and crop disease for the past three years has devastated harvests in West Africa, which produces roughly 70% of the world's cocoa. The result: the largest global cocoa deficit in 60 years, with supply falling half a million tons short of demand.Prices could stabilize, but not decrease, by next year as crop yields have increased, said David Branch, a sector manager at Wells Fargo Agri-Food Institute.\"It's not just the cost of manufacturing cocoa and other ingredients,\" Branch told CNBC. \"It's also a combination of labor, transportation, fuel, overhead [and] all of those factors, and, given the inflationary rate we've been in, those came up and haven't really come down.\"Hershey said Thursday that tariff expenses will cost the company $160 million to $170 million this year. In July, it also announced a \"low double-digit\" price hike, though executives said those increases weren't tied to tariffs or Halloween pricing.Chocolate makers have lobbied the Trump administration for tariff exemptions on cocoa and other agricultural imports, arguing they have little ability to source those ingredients domestically.Sweet varietyAs chocolate becomes more expensive, fruity, sour and chewy candies have gotten more popular. More than half of shoppers said they planned to prioritize gummy candies for Halloween this year, NielsenIQ found.On average, the price per pound of chocolate rose nearly 14% in the 12 weeks ending Oct. 5, while sales volumes fell 6%, Circana data show. Non-chocolate Halloween candy such as Jolly Ranchers and Skittles saw sales climb 8.3% in that same period.Younger adults, especially Gen Z, are also fueling growth in non-chocolate categories — gravitating toward gummies, freeze-dried sweets and TikTok-friendly flavor mashups.\"It's that experiential [aspect] because you can have it [non-chocolate items] with chewy, with sweet flavors, with hot and sweet, spicy flavors,\" Wyatt told CNBC. \"Some candies you get this big explosion in your mouth of flavors. We've seen it popular with different cohorts.\"Chocolate makers are responding in kind. Hershey has expanded its gummy lineup, including a partnership with Shaquille O'Neal, and rolled out ghost-shaped Twizzlers and mismatched \"Trickies\" Jolly Rancher gummies.Mondelez International, maker of Cadbury and Toblerone, said it's also prioritizing gummies in the U.S. market. CEO Dirk Van de Put said on an earnings call Tuesday, however, that the U.S. market in particular \"is slower than we've seen in quite a while\" and the company's promotional strategy earlier this year \"was not giving us the volume effect that we were hoping for.\"Manufacturers are also experimenting with smaller bars, new fillings and cocoa-free options such as crème or nut-based confections to offset rising ingredient costs, Branch said.\"Companies have got to be very aware of if they can keep their prices in line. They can't just keep increasing their prices and expect sales to continue to go up,\" Branch said. \"But customers have not lost their appetite for chocolate. It's going to remain an indulgence that people will always have and can't really do without.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chocolate's reign over Halloween is under threat from inflation, tariffs and high cocoa prices",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108048713-1729110725978-gettyimages-2178767864-dsc_1416_18rzkx1t.jpeg?v=1729110830&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T11:30:01.000Z",
      "dateModified": "2025-10-31T11:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tariffs are expected to start showing up more in consumer prices as holiday shopping season starts",
    "url": "https://www.cnbc.com/2025/10/31/tariffs-are-expected-to-start-showing-up-more-in-consumer-prices-as-holiday-shopping-season-starts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108077022-1734452746868-gettyimages-2189857282-US_HOLIDAY_SHOPPING.jpeg?v=1739544255&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T18:29:52.000Z",
    "description": "Shoppers carry Macy's and Nordstrom bags at Broadway Plaza in Walnut Creek, California, US, on Monday, Dec. 16, 2024. The Bureau of Economic Analysis ",
    "body": "Shoppers carry Macy's and Nordstrom bags at Broadway Plaza in Walnut Creek, California, US, on Monday, Dec. 16, 2024. The Bureau of Economic Analysis is scheduled to release personal spending figures on December 20.David Paul Morris | Bloomberg | Getty ImagesWhile the impact so far this year has been muted, tariffs are expected to catch up with prices consumers pay just in time for the holiday shopping season.President Donald Trump's tariffs on a plethora of items and individual countries, which started in April, have coincided with common inflation measures trudging along between 2.5% and 3% this year.While economists don't see a major spike coming in common measures such as the consumer price and the personal consumption price indexes, they expect the tariffs will keep those gauges elevated at a time when they otherwise would be moving lower.\"There have been some questions in recent months as to whether tariffs have led to higher inflation for consumers,\" Bank of America economist Aditya Bhave said in a note. \"We think there's no debate — tariffs have pushed consumer prices higher.\"Tariff impacts have been muted so far as companies built up inventories ahead of the duties and absorbed some of the impact through compressed profit margins.Bank of America, though, expects that tariffs will be adding about half a percentage point to the core PCE measure the Federal Reserve uses when assessing inflation. With tariffs, BofA estimates that the inflation rate would be 2.9% in September, so without them that would mean a measure closer to 2.4%. The numbers are similar to ones Fed Chair Jerome Powell cited Wednesday. The core PCE on an annual basis was 2.9% in August.These percentage point differences matter to the Fed, which tries to keep core inflation, excluding food and energy, at 2%, a level it has been above since March 2021. Two Fed officials — regional presidents Jeffrey Schmid of Kansas City and Lorie Logan of Dallas — said Friday they did not agree with their colleagues' decision Wednesday to lower the central bank's key interest rate.For consumers, they also matter. Bhave estimates that shoppers are bearing about 50%-70% of total tariff costs, with businesses bearing the rest.Impact at the cash registerIn real-world terms, that's meant higher prices for things such as coffee, furniture and, recently, clothing prices, which jumped 0.7% in September, according to the Bureau of Labor Statistics. Even though they are minor components of the price indexes, they are items consumers buy frequently and can create perceptions about inflation, which can produce a self-reinforcing cycle that drives prices higher.\"Inflation in certain goods can have an outsized impact on consumer confidence, even if those items carry a negligible weight in the CPI basket,\" TD Cowen analysts said in a note. Price increases in items such as eggs create \"a constant, tangible feedback loop every week at the grocery store. Such items shape perception more than their statistical significance would suggest.\"The firm noted that this holiday season could see more of that sort of thing as artificial Christmas trees are almost all imported from China, which faces heavy costs under the Trump tariffs.\"While Artificial Christmas trees are not unique, they serve as a clear example of how high-tariff, seasonal goods can shape consumer perceptions of inflation,\" Cowen said.Had the duties been in place during the 2024 holiday season, shoppers would have spent an additional $40.6 billion, according to LendingTree estimates using data from multiple government and private sources.LendingTree's Budget Lab further estimates that some 70.5% of new tariffs were passed onto consumers in June 2025.\"That means that even more Americans would have had to fall back on credit cards and personal loans to help cover gift-buying expenses,\" said Matt Schultz, the firm's chief consumer finance analyst. \"That's the unfortunate reality that many people would have faced.\"Using the same estimates, LendingTree said the tariff cost comes to $132 per shopper.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tariffs are expected to start showing up more in consumer prices as holiday shopping season starts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108077022-1734452746868-gettyimages-2189857282-US_HOLIDAY_SHOPPING.jpeg?v=1739544255&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T18:29:52.000Z",
      "dateModified": "2025-10-31T18:29:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney channels go dark on YouTube TV as carriage deal expires",
    "url": "https://www.cnbc.com/2025/10/31/disney-content-to-go-dark-on-youtubetv-amid-contract-dispute-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108189132-17557884312021-07-13t224449z_206007811_rc2rjo984itm_rtrmadp_0_disney-subscription.jpeg?v=1755788505&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-31T18:39:38.000Z",
    "description": "Photo illustration of the YouTube TV logo displayed on a smartphone, with the YouTube logo in the background.Nurphoto | Nurphoto | Getty ImagesDisney ",
    "body": "Photo illustration of the YouTube TV logo displayed on a smartphone, with the YouTube logo in the background.Nurphoto | Nurphoto | Getty ImagesDisney content, including channels like ABC and ESPN, was removed from Google's YouTube TV overnight after the two companies failed to renew a streaming contract. \"Despite our best efforts, we have not been able to reach a fair deal, and starting today, Disney programming will not be available on YouTube TV,\" the platform said in a statement.More than 20 channels would be removed from YouTube TV, the company said, adding if the content is unavailable for an extended period of time, the company would offer users a $20 credit. Affected networks include ESPN and its sister sports networks, ABC, FX, NatGeo, Disney Channel and Freeform. Disney said in a statement, \"Google's YouTube TV has chosen to deny their subscribers the content they value most by refusing to pay fair rates for our channels, including ESPN and ABC.\"Disney Entertainment Co-Chairs Dana Walden and Alan Bergman and ESPN Chairman Jimmy Pitaro sent a memo to all Disney employees Friday, noting that YouTube TV also \"deleted all [Disney] previously recorded shows and events from their subscribers' libraries\" in addition to failing to strike a deal.\"Their actions make clear how little regard they have for their customers and are consistent with an attitude which has been prevalent throughout our negotiations — YouTube TV and its owner, Google, are not interested in achieving a fair deal with us,\" wrote Walden, Bergman and Pitaro. \"Instead, they want to use their power and extraordinary resources to eliminate competition and devalue the very content that helped them build their service.\"The two sides had been engaged in negotiations but were unable to reach a new distribution agreement before their existing contract expired Oct. 30 at 11:59 p.m. ET. YouTube TV subscribers risk losing access to college football if a deal isn't struck by Saturday morning and \"Monday Night Football\" if programming isn't returned by the start of next week.Disney warned last week it could result in a content blackout.In a Thursday statement on its official blog, YouTube argued Disney had \"used the threat of a blackout on YouTube TV as a negotiating tactic to force deal terms that would raise prices on our customers,\" and that Disney was now following through on that threat.\"We will not agree to terms that disadvantage our members while benefiting Disney's own live TV products,\" YouTube TV said in a post on its help center webpage. Disney's live TV offerings include Hulu + Live TV and Fubo.\"We know how disruptive it is to lose channels you enjoy, and we're committed to continuing to work with Disney to reach an agreement,\" YouTube said in its statement.YouTube TV pays broadcasters to stream their channels and has been engaged in several tense negotiations over contract renewals in recent months.Last month, NBCUniversal content was nearly removed from YouTube TV before the companies reached an agreement after a temporary extension, preventing shows like \"Sunday Night Football\" and \"America's Got Talent\" from being pulled.CNBC reported last week that Disney was willing to offer YouTube TV a distribution agreement that would give some subscribers access to Disney+, Hulu and ESPN+ for no extra charge. Disney has previously offered similar terms to Charter, the largest U.S. pay TV provider by subscribers.However, YouTube asked for Disney's streaming content to be ingested into YouTube TV, giving customers the ability to view programming on Disney+, Hulu and ESPN+ without leaving the platform, according to a source familiar with the negotiations.Disney had rejected that proposal and had no plans to budge on the request, people familiar with the company's thinking told CNBC. Disney has no interest in adding its streaming services to YouTube Primetime Channels, the people said.The recent clash between Disney and YouTube has an added twist, after YouTube hired former Disney distribution executive Justin Connolly earlier this year, prompting Disney to file a breach-of-contract lawsuit.Connolly has recused himself from the discussions, CNBC previously reported, according to the people familiar with the process. Disney and YouTube reportedly settled the lawsuit.YouTube is the top U.S. media distributor by audience engagement, capturing over 13% of TV watch-time in July, according to Nielsen. It is also on track to be the biggest media company by revenue in 2025, beating Disney, analysts at MoffettNathanson told CNBC.— CNBC's Alex Sherman contributed to this report.Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast's planned spinoff of Versant.Clarification: This article has been updated to clarify that NBCUniversal content was nearly removed from YouTube TV last month before those companies reached an agreement.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney channels go dark on YouTube TV as carriage deal expires",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108189132-17557884312021-07-13t224449z_206007811_rc2rjo984itm_rtrmadp_0_disney-subscription.jpeg?v=1755788505&w=1920&h=1080"
      ],
      "datePublished": "2025-10-31T18:39:38.000Z",
      "dateModified": "2025-10-31T18:39:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]