[
  {
    "title": "Bitcoin rallies to within 1% of all-time high, gaining safe haven status during shutdown ",
    "url": "https://www.cnbc.com/2025/10/03/bitcoin-rallies-to-within-1percent-of-all-time-high-gaining-safe-haven-status-during-shutdown-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108182561-1754505738635-gettyimages-2225439721-img_8850.jpeg?v=1759509615&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T16:50:34.000Z",
    "description": "<div><div><p>CHONGQING, CHINA - JULY 17: In this photo illustration, a person holds a physical representation of a Bitcoin (BTC) coin in front of a sc",
    "body": "<div><div><p>CHONGQING, CHINA - JULY 17: In this photo illustration, a person holds a physical representation of a Bitcoin (BTC) coin in front of a screen displaying a candlestick chart of Bitcoin's latest price movements on July 17, 2025 in Chongqing, China. (Photo illustration by Cheng Xin/Getty Images)</p><p>Cheng Xin | Getty Images News | Getty Images</p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/BTC.CM=/\">Bitcoin</a><span><span></span></span></span> rallied on Friday to within striking distance of its record high as the U.S. government's shutdown entered its third day.</p><p>The world's oldest cryptocurrency is trading up roughly 2% on the day at $123,874. That's about 1% below its all-time high price of just north of $124,000 that it reached in mid-August.</p><p>Investors are flocking to the decentralized asset after U.S. lawmakers failed to strike a deal on federal funding, forcing the U.S. government to shutdown on Wednesday. Bitcoin is up 12% this week alone.</p><p>\"The shutdown matters this time around,\" wrote Standard Chartered's Geoff Kendrick. \"During the previous Trump shutdown (22 Dec 2018 to 25 Jan 2019) Bitcoin was in a different place than now, so it did little.\" </p><p>\"However, this year bitcoin has traded with 'US government risks' as best shown by its relationship to US treasury term premium,\" added Kendrick.</p><p>Standard Chartered expects a new high soon and ultimately the crypto hitting $135,000 after that.</p></div><div><div><svg width=\"256\" height=\"256\">Stock Chart IconStock chart icon</svg><p><img src=\"https://static-redesign.cnbcfm.com/dist/a54b41835a8b60db28c2.svg\" alt=\"hide content\" /></p></div><p>Bitcoin, YTD</p></div><div><p>Traders are turning to crypto and other assets to hedge against mounting political and economic tensions. Spot gold rose 0.5% to $3,876.55 per ounce on early Friday, with prices gaining more than 2% this week.</p><p>Traders also poured some money into stocks on Friday, despite the increasing geopolitical uncertainties. The S&P 500 and Nasdaq Composite also rose .5% and .27% on the day, respectively.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bitcoin rallies to within 1% of all-time high, gaining safe haven status during shutdown ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108182561-1754505738635-gettyimages-2225439721-img_8850.jpeg?v=1759509615&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T16:50:34.000Z",
      "dateModified": "2025-10-03T16:50:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Treasury weighs minting $1 coin with Trump's face for U.S. 250th anniversary",
    "url": "https://www.cnbc.com/2025/10/03/trump-face-coin-treasury-dollar.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207770-1759519663351-Trump_Coin.jpg?v=1759519889&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T21:33:09.000Z",
    "description": "<div><div><p>A \"draft\" from The Treasury Department of a $1 commemorative coin that it plans to mint next year.</p><p>Courtesy: U.S. Treasury Departme",
    "body": "<div><div><p>A \"draft\" from The Treasury Department of a $1 commemorative coin that it plans to mint next year.</p><p>Courtesy: U.S. Treasury Department</p></div><div><p>The <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/bessent-shutdown-gdp.html\">Treasury Department</a> is considering minting a $1 <a target=\"_blank\" href=\"https://www.cnbc.com/2025/05/22/get-ready-to-round-up-treasury-set-to-halt-penny-production.html\">coin</a> bearing President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a>'s likeness on both sides to honor him and commemorate the United States' 250th birthday next year.</p><p>A first draft of that coin, which will mark the semiquincentennial anniversary of the nation's founding, depicts Trump's head in profile on one side, above the words \"IN GOD WE TRUST\" and the dates 1776 and 2026.</p><p>The other side of the coin shows a defiant-looking Trump raising his fist, closely matching the pose he struck moments after surviving an <a target=\"_blank\" href=\"https://www.cnbc.com/2024/07/13/donald-trump-shot-live-updates.html\">assassination attempt</a> at a 2024 presidential campaign rally in Pennsylvania.</p><p>The words \"FIGHT FIGHT FIGHT,\" which Trump mouthed to his supporters right after that attack, appear around the edge of that side of the coin.</p><p>\"No fake news here. These first drafts honoring America's 250th Birthday and @POTUS are real,\" U.S. Treasurer Brandon Beach <a href=\"https://x.com/TreasurerBeach/status/1974156375891804229\" target=\"_blank\">wrote on X </a>in response to a post touting sketches of the coin.</p><p>\"Looking forward to sharing more soon, once the obstructionist shutdown of the United States government is over,\" Beach wrote.</p><p>Treasury Secretary Scott Bessent reposted Beach's message from his own X account.</p><p>A Treasury spokesperson told CNBC that a final design for a $1 coin to commemorate the anniversary has not yet been selected.</p></div><div><h2>Read more CNBC politics coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-israel-gaza-hamas-peace-plan.html\">Watch: Trump details plan to end Israel war with Hamas in Gaza</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-health-government-shutdown-jeffries-schumer.html\">Democrats refuse to cave on health care before Trump government shutdown meeting</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-zohran-mamdani-eric-adams-new-york-mayor.html\">Trump bashes Zohran Mamdani after Eric Adams drops out of New York mayor's race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/trump-movie-furniture-tariffs.html\">Trump 'Truths' about tariffs on films and furniture raise questions on details</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/trump-mass-firings-government-shutdown.html\">Trump threatens mass firings if shutdown isn't averted: NBC News</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/government-shutdown-trump-democrats-republicans-health-care.html\">Republicans say Obamacare tax credit fight can wait until after shutdown averted</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/jd-vance-trump-tiktok-china-bytedance.html\">JD Vance on Tiktok: U.S. 'successfully separated' TikTok from China's ByteDance</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/eric-adams-new-york-city-mayor-race-trump-.html\">Eric Adams drops out of New York City mayoral race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/27/trump-cartoon-firing-powell-fed.html\">President Trump posts cartoon image depicting him firing Fed Chief Powell</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/trump-fed-cook-scotus-markets.html\">Markets won't care if Trump fires Fed Governor Cook, DOJ tells Supreme Court</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/howard-rubin-sex-trafficking-new-york-investment.html\">Money manager Howard Rubin detained on sex trafficking charges</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/james-comey-indicted-fbi-trump.html\">Former FBI Director James Comey indicted after Trump called for charges</a></li></ul></div></div><div><p>But \"this first draft reflects well the enduring spirit of our country and democracy, even in the face of immense obstacles,\" the spokesperson said, adding, \"We look forward to sharing more soon.\"</p><p>Commemorative coins are legal tender, but they are not minted for general circulation, according to the United States Mint.</p><p>It was not immediately clear if the government has created any previous commemorative coins or other coins depicting a living president.</p><p>A <a href=\"https://www.congress.gov/116/statute/STATUTE-134/STATUTE-134-Pg5101.pdf\" target=\"_blank\">federal law</a> signed by Trump in January 2021 — just a week before his first term in office ended — allows the Treasury secretary to mint $1 coins \"with designs emblematic of the United States semiquincentennial\" during the year of the anniversary.</p><p>But that same law, under a heading on standards for circulating collectible coins, states, \"No head and shoulders portrait or bust of any person, living or dead, and no portrait of a living person may be included in the design on the reverse of any coin under subsections (x), (y), and (z).\"</p><p>Subsection Y refers to the rules about coins for the 250th anniversary.</p><p>That language appears in similar forms in other <a href=\"https://www.usmint.gov/learn/coins-and-medals/legislation?srsltid=AfmBOooNjehl0ltlXuJYpV7e_nxaukMtnm3EhUdEYJjjglj1ihsu3mPa#dollar\" target=\"_blank\">coin-related laws</a> listed on the U.S. Mint's website.</p><p>The Federal Reserve Bank of San Francisco <a href=\"https://www.frbsf.org/research-and-insights/blog/community-development/2016/02/08/7-things-you-may-not-know-about-us-currency/\" target=\"_blank\">notes</a>, \"To avoid the appearance of a monarchy, it was long-standing tradition to only feature portraits of deceased individuals on currency and coin.\"</p><p>\"That tradition became law with an 1866 Act of Congress,\" the Fed bank added.</p><p>The Treasury Department did not provide a comment in response to CNBC's questions about the legality of the draft coin.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Treasury weighs minting $1 coin with Trump's face for U.S. 250th anniversary",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207770-1759519663351-Trump_Coin.jpg?v=1759519889&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T21:33:09.000Z",
      "dateModified": "2025-10-03T21:33:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "From data to culture: How international brands are trying to crack the code on the fickle Chinese consumer",
    "url": "https://www.cnbc.com/2025/10/04/from-data-to-culture-us-europe-brands-take-on-the-chinese-consumer.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108201806-1758504489976-gettyimages-2221916111-CHINA_LUXURY.jpeg?v=1758504554&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-04T01:10:59.000Z",
    "description": "<div><div><p>Pictured here is Louis Vuitton's new cruise ship-shaped store in Shanghai, China, on June 28, 2025.</p><p>Bloomberg | Bloomberg | Getty I",
    "body": "<div><div><p>Pictured here is Louis Vuitton's new cruise ship-shaped store in Shanghai, China, on June 28, 2025.</p><p>Bloomberg | Bloomberg | Getty Images</p></div><div><p>BEIJING — China's <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/15/china-retail-sales-industrial-output-slow-in-august-missing-estimates-as-real-estate-slump-worsens.html\">economic slowdown</a> isn't discouraging U.S. and European brands from revamping their strategies to reach Chinese shoppers.</p><p>Instead, the allure of the world's second-largest consumer market is forcing companies to adapt in the face of growing competition from local brands.</p><p>In the case of <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/KHC/\">Kraft Heinz</a><span><span></span></span></span>, getting more people in China to buy ketchup this year also meant hiring a local agency to help create catchy campaigns — decorating subway station columns to mimic ketchup bottles and promoting the condiment as a fresh twist on a popular dish: stir-fried eggs and tomatoes.</p><p>It's a hard market to tackle, even for Shanghai-based marketing firm Good Idea Growth Network (GGN). The agency has witnessed at least five different waves of consumer trends in its 14-year history, founder Stephy Liu, said in Mandarin, translated by CNBC. \"The gameplay keeps on changing.\"</p><p>But GGN has succeeded even after rejecting an acquisition offer from British advertising giant WPP, Liu said, noting that about half of her clients are foreign brands.</p><p>While Kraft Heinz isn't done with its China ketchup campaign yet, the company reported second-quarter net sales in emerging markets <a href=\"https://ir.kraftheinzcompany.com/media/document/fadcecf5-1f8f-4fe6-8e1e-fe8668847c6d/assets/EX_99.1_-_ER_Q2_2025_vFinal2.pdf?disposition=inline\" target=\"_blank\">climbed by 4.2%</a> from a year ago, helping offset declines in North America.</p><p>WPP explored a potential acquisition of GGN but did not end up going far in the process, according to a person familiar with the discussions.</p><p>Kraft Heinz did not immediately respond to requests for comment.</p></div><h2><a></a>Localized social media</h2><div><p>From <a target=\"_blank\" href=\"https://www.cnbc.com/2025/02/26/starbucks-is-struggling-to-grow-sales-in-china-heres-why.html\">Starbucks' struggles</a> to Lululemon's successes in China, it's become clear that the right mix of localization is essential.</p><p>\"Among international brands in China, the winners are often dedicating more than 40% of revenue to marketing, especially content and platform-first marketing, while also iterating products locally based on market data,\" said Jacob Cooke, co-founder and CEO of WPIC Marketing + Technologies, which helps foreign brands sell in China.</p><p>This year, Cooke said that <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/UA/\">Under Armour</a><span><span></span></span></span> has created products under 100 yuan ($14) in order to attract a mass of buyers online, while using livestreams with dedicated users to then build fitness communities and sell more premium products offline.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108201852-17585224771758522473-41761096411-1080pnbcnews.jpg?v=1758522476&w=750&h=422&vtcrop=y\" alt=\"International investors can't ignore China for the growth story it provides: Fund manager\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>ByteDance-owned Douyin has become an e-commerce force in the last few years since celebrities and companies started using the app for <a target=\"_blank\" href=\"https://www.cnbc.com/2023/12/11/chinas-livestream-shopping-booms-fueling-new-tech-like-avatars-and-ai.html\">livestreaming sales</a> during the pandemic. And by the numbers, there's little question that jumping into the Xiaohongshu and Douyin world is worthwhile for businesses.</p><p>Adapting to that new social commerce ecosystem has become the biggest challenge for brands in the last two years, GGN's Liu said. \"Foreign brands will think, 'Isn't this just TikTok?'\"</p><p>She warned that success requires a complex strategy that can involve changing everything from how a team is structured to the kinds of products sold. But the payoff is significant.</p><p>\"In half a year, it can help you sell more than you sold on [<span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/BABA/\">Alibaba</a><span><span></span></span></span>'s] Tmall in two years,\" Liu said.</p></div><h2><a></a>Data is power</h2><div><p>In addition to social media, a critical factor in many companies' strategies is access to hordes of data on what consumers in China are buying.</p><p>Chinese e-commerce platforms, including Alibaba's Tmall, share far more data on what's popular than <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AMZN/\">Amazon.com</a><span><span></span></span></span> does, WPIC's Cooke said. In China, \"people generally know what their competitors are selling and what they're selling for.\"</p><p>With that granular data, Chinese makeup brand Perfect Diary was able to succeed by identifying a market pain point and creating a lipstick targeted at that lower price segment, Cooke said. He noted that's pressured foreign brands to create China-specific products as well, a big shift over the last five years.</p><p>E-commerce platforms in China also often show rough figures on how many orders were placed per product, while third-party companies such as Syntun offer significant amounts of product rankings and other online sales data for free.</p></div><div>\n\t\t<p><img src=\"https://fm.cnbc.com/applications/cnbc.com/resources/styles/skin/special-reports/the-china-connection/tcc_widget_logo.png\" />\n\t\t</p>\n\t\t<div>\n\t\t\t<p>Weekly analysis and insights from Asia's largest economy in your inbox<br />\n\t\t\t<a href=\"https://www.cnbc.com/lander?id=chinaconnection-newsletter\" target=\"_blank\">Subscribe now</a></p>\n\t\t</div>\n\t</div><div><p>In the case of <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AAPL/\">Apple</a><span><span></span></span></span>'s iPhone 17 launch on Sept. 19, it was Chinese e-commerce company JD.com that released sales data for mainland China. The electronics-focused platform announced that the first minute of iPhone 17 series preorders surpassed the first-day preorder volume of last year's iPhone 16 series.</p><p>Apple's story also underscores how it's possible to <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/19/apple-iphone-17-launch-sale-globally-china-market-and-ai-strategy.html\">reignite local interest</a> despite losing market share to domestic competition. Some customers in Beijing told CNBC that they liked the iPhone's new cosmic orange color, and that more locals intended to buy their first iPhone this year since they'd heard about new attractive features such as larger internal storage.</p><p>China's factories were quick to jump on the trend, releasing iPhone cases with a similar orange hue even before the 17 model was out.</p><p>\"Winning brands are those that have established local R&D centers and on-the-ground product teams,\" said Ashley Dudarenok, founder of ChoZan, a China marketing consultancy. \"This allows them to spot trends early, develop products tailored to local needs, and launch them in months, not years. This is a significant departure from the past, where global products were often simply rolled out in the Chinese market.\"</p></div><h2><a></a>Cultural connection</h2><div><p>Even with the right data and social media platforms, cultural integration is becoming increasingly important, especially as <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/07/laopu-gold-cartier-lvmh-richemont-chow-tai-fook-marina-bay-sands-china-singapore.html\">Chinese brands find success</a> in tapping the country's own history of artisanal craftsmanship.</p><p>\"Brands are moving beyond superficial nods to Chinese culture,\" Dudarenok said. She pointed out that Loewe partnered with jade carving masters, while Burberry teamed up with bamboo-weaving artists.</p><p>And despite <a target=\"_blank\" href=\"https://www.cnbc.com/video/2025/03/27/why-china-is-behind-the-global-luxury-slowdown.html\">declining sales in China's luxury market</a>, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/MC-FR/\">LVMH</a><span><span></span></span></span> this summer opened an eye-catching ship-shaped store in Shanghai — immediately generating much local buzz.</p><p>In contrast to LVMH's luggage-shaped store in Manhattan, the Shanghai location taps into the Chinese city's history as a port of entry for international travelers to Asia roughly a century ago.</p><p>The new store also captures the European brand's roots in hand-crafted travel trunks — which contrasts with Chinese brands' inability to offer the same emotional appeal, Joe Ngai, chairman of greater China at McKinsey, pointed out in a <a href=\"https://www.linkedin.com/posts/joe-ngai-28b278_if-you-have-not-seen-the-louis-vuitton-lv-ugcPost-7374381295272984576-R0I4/?utm_source=share&utm_medium=member_desktop&rcm=ACoAAAFXfqMBEkoFUZxZWHN8zuF4_sJxeQOjaPA\" target=\"_blank\">LinkedIn post</a>.</p><p>\"As Chinese customers grow in their confidence and desire for local elements,\" he said, \"creating more crossovers between West and East is one of the unique opportunities for multinationals in China.\"</p><p><em>— CNBC's Eunice Yoon contributed to this report.</em></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "From data to culture: How international brands are trying to crack the code on the fickle Chinese consumer",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108201806-1758504489976-gettyimages-2221916111-CHINA_LUXURY.jpeg?v=1758504554&w=1920&h=1080"
      ],
      "datePublished": "2025-10-04T01:10:59.000Z",
      "dateModified": "2025-10-04T01:10:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon shutters 4 Fresh stores in Southern California as grocery strategy keeps shifting",
    "url": "https://www.cnbc.com/2025/10/03/amazon-shuts-4-fresh-stores-in-southern-california-after-uk-closures.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108075680-1734095017193-gettyimages-2188958302-ryder-amazon-2.jpeg?v=1759515061&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T23:00:11.000Z",
    "description": "<div><div><p>An employee arranges a salad dressing display at an Amazon Fresh grocery store on December 12, 2024 in Federal Way, Washington.</p><p>Dav",
    "body": "<div><div><p>An employee arranges a salad dressing display at an Amazon Fresh grocery store on December 12, 2024 in Federal Way, Washington.</p><p>David Ryder | Getty Images</p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AMZN/\">Amazon</a><span><span></span></span></span> is closing four more Fresh supermarkets in Southern California as the e-commerce giant continues to focus its grocery strategy around Whole Foods and delivery.</p><p>The closures will take place in the coming weeks, Amazon confirmed to CNBC. They follow the shuttering of four other U.S. locations in recent months, in Washington, Virginia, New York and a Los Angeles suburb.</p><p>\"Certain locations work better than others, and after an assessment, we've made the decision to close these Amazon Fresh locations,\" Amazon spokesperson Griffin Buch said in a statement. \"We're working closely with affected employees to help them find new roles within Amazon wherever possible.\"</p><p>At one Fresh supermarket in La Verne, California, employees were told to gather for an all-hands meeting on Wednesday, according to an internal message viewed by CNBC. They learned at the meeting that the store would close in mid-November, and that employees would receive a severance package, according to a person familiar with the matter who asked not to be named because the details were confidential.</p><p>The other three stores that are closing are in cities of Mission Viejo, La Habra and Whittier.</p><p>Last week, Amazon said it <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/amazon-closing-fresh-grocery-stores-uk.html\">intends to close</a> 14 Fresh grocery stores in the U.K. and convert its five other locations there into Whole Foods markets.</p><p>Amazon said it regularly evaluates its store portfolio, which can lead to opening, reopening, relocating or closing certain locations. In the U.S., the company has more than 60 remaining Fresh stores. Last year, the company removed its <a target=\"_blank\" href=\"https://www.cnbc.com/2024/04/03/amazon-ditches-cashierless-checkout-system-at-its-grocery-stores.html\">\"Just Walk Out\"</a> cashierless technology from the stores. It's also been culling its footprint of Go cashierless convenience stores.</p><p>Amazon has been determined to become <a target=\"_blank\" href=\"https://www.cnbc.com/2022/02/19/amazons-sprawling-grocery-business-has-become-an-expensive-hobby.html\">a major grocery player</a> for nearly two decades. The company launched <a target=\"_blank\" href=\"https://www.cnbc.com/2007/08/27/amazon-gets-fresh-challenges-with-new-grocery-business.html\">Amazon Fresh</a> in 2007, then a pilot project for fresh food delivery, before acquiring upscale chain <a target=\"_blank\" href=\"https://www.cnbc.com/2017/08/24/amazons-acquisition-of-whole-foods-is-a-threat-to-everyone-even-restaurants.html\">Whole Foods</a> for $13.7 billion in 2017, its biggest purchase on record.</p><p>Amazon debuted its <a target=\"_blank\" href=\"https://www.cnbc.com/2020/08/27/amazon-expands-beyond-whole-foods-with-fresh-grocery-store-chain.html\">Fresh grocery chain</a> in 2020, with an eye toward mass-market shoppers. The rollout has been turbulent since its early days.</p><p>The company opened a flurry of Fresh locations by 2022, but the expansion plans ran into CEO Andy Jassy's <a target=\"_blank\" href=\"https://www.cnbc.com/2022/10/12/amazon-cost-cuts-under-andy-jassy-reflect-new-reality-after-25-years.html\">widespread cost-cutting efforts</a> as the company reckoned with the impact of rising interest rates and soaring inflation. In 2023, Amazon announced it would <a target=\"_blank\" href=\"https://www.cnbc.com/2023/02/02/amazon-is-shutting-some-fresh-and-go-stores-as-the-company-cuts-costs.html\">shut some Fresh stores</a> and halt further openings temporarily as it evaluated how to make the chain stand out for shoppers.</p><p>While it's closing Fresh stores, Amazon continues to \"innovate and invest in making grocery shopping easier, faster, and more affordable,\" Buch said. The company still maintains 500 Whole Foods locations and has opened <a href=\"https://media.wholefoodsmarket.com/first-whole-foods-market-daily-shop-now-open-in-new-york-citys-upper-east-side/\" target=\"_blank\">mini \"daily shop\"</a> Whole Foods stores in New York City.</p><p>Buch said that Amazon serves 150 million U.S. customers with millions of \"grocery and everyday essentials available for online delivery, pick-up, or in store shopping.\"</p><p>On Wednesday, Amazon also launched a new \"price-conscious\" grocery brand that will be offered online and in its physical stores. And last month, Amazon expanded <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/13/amazon-same-day-delivery-meat-eggs-produce.html\">same-day delivery</a> of fresh foods to more pockets of the U.S.</p><p>Jassy and other company executives have touted the success of sales of \"everyday essentials\" within its online grocery business, which refers to items such as canned goods, paper towels, dish soap and snacks. Jassy told investors at the company's annual shareholder meeting in May that he remains \"bullish\" on grocery, calling it a \"significant business\" for Amazon.</p><p><strong>WATCH:</strong> <a target=\"_blank\" href=\"https://www.cnbc.com/video/2025/08/14/amazons-grocery-could-be-a-trojan-horse-to-move-revenue-higher-says-evercore-isis-mark-mahaney.html\">Amazon grocery could be a trojan horse to more revenue</a></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108186162-17551941941755194191-41183191868-1080pnbcnews.jpg?v=1755194193&w=750&h=422&vtcrop=y\" alt=\"Amazon's grocery could be a trojan horse to move revenue higher, says Evercore ISI's Mark Mahaney\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon shutters 4 Fresh stores in Southern California as grocery strategy keeps shifting",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108075680-1734095017193-gettyimages-2188958302-ryder-amazon-2.jpeg?v=1759515061&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T23:00:11.000Z",
      "dateModified": "2025-10-03T23:00:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Student loan borrowers can't access repayment plans under Trump. What to know ",
    "url": "https://www.cnbc.com/2025/10/03/student-loan-repayment-plan-backlog-under-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207493-1759497212956-108207493-1759497149991-gettyimages-2238507187-AA_03102025_2451870.jpg?v=1759497224&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T18:27:29.000Z",
    "description": "<div><div><p>The U.S. Capitol is seen on the second day of the federal government shutdown on October 2, 2025, in Washington D.C.</p><p>Mehmet Eser | ",
    "body": "<div><div><p>The U.S. Capitol is seen on the second day of the federal government shutdown on October 2, 2025, in Washington D.C.</p><p>Mehmet Eser | Anadolu | Getty Images</p></div><div><p>The shutdown of the federal government is likely to <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/government-shutdown-student-loan-borrowers.html\">worsen the delays</a> student loan borrowers are already facing in <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/15/student-loan-forgiveness-trump-pslf-backlog.html\">accessing programs </a>required by Congress and mandated in their loan terms.</p><p>More than 1 million borrowers are in a backlog to enroll in <a href=\"https://studentaid.gov/idr/\" target=\"_blank\">an income-driven repayment plan</a>, according to <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.278527/gov.uscourts.dcd.278527.42.0.pdf\" target=\"_blank\">court records</a> from mid-September.</p><p>During the shutdown, Federal Student Aid staff \"will not be able to perform regular operations, including working on the IDR backlog,\" a spokesperson for the Education Department told CNBC on Wednesday. That day, the U.S. <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/30/government-shutdown-live-updates.html\">government</a> <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/government-shutdown-jobs-economy-trump.html\">shut down</a> after lawmakers failed to reach a funding deal, meaning that most of the federal workers at the Education Department would be <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/30/government-shutdown-congress-what-it-means-your-money.html\">temporarily put on unpaid leave</a>.</p><p>\"Even before the shutdown, borrowers were at a breaking point,\" said Michele Zampini, associate vice president of federal policy and advocacy at The Institute for College Access & Success.</p><p>\"Now, with application processing reportedly at a standstill, borrowers will continue to face unaffordable payments.\"</p><p><strong>More from Personal Finance:</strong><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/17/tuition-free-colleges-in-2025.html\">As some colleges near $100,000, these schools are free</a><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/12/college-majors-employment-prospects.html\">These college majors have the best job prospects</a><br /><a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/25/student-loan-forgiveness-tax-trump-big-beautiful-bill.html\">Student loan forgiveness may soon be taxed again</a></p><p>Congress created the first IDR plans in the <a href=\"https://www.cbo.gov/publication/56277\" target=\"_blank\">1990s</a> to make student loan borrowers' bills more affordable. Historically, the plans cap people's monthly payments at a share of their discretionary income and cancel any remaining debt after a certain period, typically 20 years or 25 years.</p><p>Here's what student loan borrowers need to know about getting into a new repayment plan right now.</p></div><h2><a></a>Delays are 'disruptive to the lives of borrowers'</h2><div><p>As of Aug. 31, there were already <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.278527/gov.uscourts.dcd.278527.42.0.pdf\" target=\"_blank\">1,076,266</a> income-driven repayment plan applications pending with the agency, court records show.</p><p>\"It is not surprising that there will be no progress on the IDR backlog during the shutdown, as the staff who work on it aren't considered 'essential,'\" said higher education expert Mark Kantrowitz.</p><p>But, Kantrowitz said, \"the failure to clear the backlog is disruptive to the lives of borrowers.\"</p></div><div><p>Many of the borrowers in the backlog are likely trying to switch out of the Biden administration-era SAVE, or Saving on a Valuable Education, plan. A court struck that program down in February and now borrowers who remain in the SAVE forbearance, which borrowers were placed into during the legal challenges, are seeing interest grow on their debt. (The Trump administration started charging interest as of <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/01/student-loan-interest-free-save-forbearance-ends.html\">Aug. 1</a>.)</p><p>\"Interest has been accruing on their loans, but they have been unable to switch to another plan,\" Kantrowitz said.</p><p>In the meantime, borrowers stuck in the backlog may not be making progress toward loan forgiveness, either under the terms of an IDR plan or through the Public Service Loan Forgiveness program. PSLF offers debt cancellation to certain public servants or non-profit workers after a decade.</p></div><h2><a></a>What borrowers in the backlog can do</h2><p>For now, the best move student loan borrowers stuck in the backlog can do is to salt away the money they would have directed to their payments, Kantrowitz said. That way, you'll have plenty of cash to draw on when the Education Department switches you into another IDR plan and your first bill comes due.</p><blockquote><div><p>This remains a waiting game.</p><div><p>Carolina Rodriguez</p><p>director of the Education Debt Consumer Assistance Program</p></div></div></blockquote><div><p>While this waiting period likely doesn't count toward IDR or PSLF forgiveness, when you first applied for an IDR plan, you were supposed to be put into a 60-day administrative forbearance at first, and those two months still do count on your forgiveness timeline, Kantrowitz said.</p><p>\"Our advice to borrowers is to maintain thorough records and monitor any applications submitted during this period,\" said Carolina Rodriguez, director of the Education Debt Consumer Assistance Program, speaking about the backlog.</p><p>\"Once processing resumes, it's important to follow up promptly to ensure their application remains on track,\" Rodriguez said. \"Beyond that, unfortunately, this remains a waiting game.\"</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Student loan borrowers can't access repayment plans under Trump. What to know ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207493-1759497212956-108207493-1759497149991-gettyimages-2238507187-AA_03102025_2451870.jpg?v=1759497224&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T18:27:29.000Z",
      "dateModified": "2025-10-03T18:27:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Creator of ICE agent tracking app asks Apple to rescind ban from online store",
    "url": "https://www.cnbc.com/2025/10/03/apple-ice-app-trump-bondi.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207574-1759505774200-108207574-1759505434988-gettyimages-2238880033-_73a5503_ornypcok-1.jpg?v=1759505790&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T21:57:46.000Z",
    "description": "<div><div><p>In this photo illustration, the ICEBlock app is displayed on an Apple iPhone on October 02, 2025 in Los Angeles, California.</p><p>Justin",
    "body": "<div><div><p>In this photo illustration, the ICEBlock app is displayed on an Apple iPhone on October 02, 2025 in Los Angeles, California.</p><p>Justin Sullivan | Getty Images News | Getty Images</p></div><div><p>The creator of ICEBlock, the app used to track local sightings of ICE agents and other law-enforcement authorities, has asked <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AAPL/\">Apple</a><span><span></span></span></span> to rescind its decision to drop the app from its online store.</p><p>Joshua Aaron, the free app's creator, also blasted the Trump administration for pressuring Apple to ban the app over fears it could be used to harm <a href=\"https://www.ice.gov/\" target=\"_blank\">U.S. Immigration and Customs Enforcement</a> agents.</p><p>\"This is not about me, or ICEBlock,\" Aaron said in an interview on Friday with CNBC.</p><p>\"This is about our fundamental constitutional rights in this country being stripped away by this administration, and the powers that be who are capitulating to their requests,\" he said.</p><p>\"I'm incredibly disappointed with the decision that Apple made,\" Aaron said.</p><p>\"In almost every interview that I did, I was asked if I was afraid that Apple might take the app down, and my answer was always to defend Apple and say, you know, look, when this app was first submitted, it went through a heavy review process with both Apple's legal and senior officials in App Review.\"</p><p>Aaron, who said that he is consulting an attorney about the situation, directly asked Apple to allow him to appeal its decision Thursday to drop the app, which became available last spring.</p><p>He shared a screengrab of the message he sent Apple after the company notified him of the move.</p><p>\"There is no objectionable content in the app,\" Aaron wrote in that message, which noted Apple's review process.</p><p>\"There have been no changes to the content provided or the features in the app,\" he wrote. \"Please immediately rescind this removal and put it back on the App Store.\"</p><p>Aaron, in his interview with CNBC, compared ICEBlock to apps like Waze and others that allow drivers to report sightings of law enforcement officers on public roads so they can warn each other about and avoid getting speeding tickets.</p><p>CNBC has requested comment from Apple on Aaron's remarks.</p><p>\"We created the App Store to be a safe and trusted place to discover apps,\" Apple said in a statement to NBC News on Thursday.</p><p>\"Based on information we've received from law enforcement about the safety risks associated with <a href=\"https://www.nbcnews.com/tech/tech-news/iceblock-app-ice-agent-sightings-tops-app-store-white-house-backlash-rcna216327\" target=\"_blank\">ICEBlock</a>, we have removed it and similar apps from the App Store,\" the company said.</p><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/GOOGL/\">Google</a><span><span></span></span></span> on Friday joined <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AAPL/\">Apple</a><span><span></span></span></span> in removing from its online store other apps that can be used to anonymously report sightings of ICE agents and other authorities.</p><p>Google's store had not carried ICEBlock, which exploded in popularity over the summer after Trump administration officials criticized it.</p><p>\"ICEBlock was never available on Google Play, but we removed similar apps for violations of our policies,\" a Google spokesperson told NBC News. The spokesperson said Google was not contacted by the Justice Department about its offering of such apps.</p><p>Apple's dropping of ICEBlock came after direct pressure from <a target=\"_blank\" href=\"https://www.cnbc.com/2025/02/04/senate-confirms-trumps-nominee-pam-bondi-as-attorney-general.html\">Attorney General Pam Bondi</a>, and amid controversy over the Trump administration's aggressive enforcement of immigration law with ICE agents and other authorities.</p><p>The FBI said last week that a gunman whose <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/ice-shooting-dallas-noem.html\">attack on a Dallas ICE facility</a> led to the deaths of two detained immigrants and the wounding of a third detainee had recently searched apps tracking the presence of ICE agents.</p><p>The gunman, Joshua Jahn, <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/dallas-ice-shooter-charlie-kirk-fbi.html\">intended to kill ICE agents</a> in the attack, which ended with him fatally shooting himself, authorities said.</p></div><div><p>Apple CEO Tim Cook holds a next generation iPhone 17 during an Apple special event at Apple headquarters on September 09, 2025 in Cupertino, California.</p><p>Justin Sullivan | Getty Images</p></div><div><p>Bondi, in a statement that the Justice Department sent CNBC on Friday, said, \"We reached out to Apple [Thursday] demanding they remove the ICEBlock app from their App Store — and Apple did so.\"</p><p>\"ICEBlock is designed to put ICE agents at risk just for doing their jobs, and violence against law enforcement is an intolerable red line that cannot be crossed,\" Bondi said.</p><p>\"This Department of Justice will continue making every effort to protect our brave federal law enforcement officers, who risk their lives every day to keep Americans safe.\" </p></div><div><p>Federal agents confront protesters outside of the U.S. Immigration and Customs Enforcement building on September 28, 2025 in Portland, Oregon. </p><p>Mathieu Lewis-rolland | Getty Images</p></div><div><p>Trump administration border czar Tom Homan, in an interview Thursday night with Fox News' Sean Hannity, said, \"They're gonna investigate these people who put these apps up — because it puts law enforcement at great risk.\"</p><p>ICEBlock became the top social networking app in Apple's App Store shortly after White House Press Secretary Karoline Leavitt condemned the app during a June 30 briefing.</p><p><a href=\"https://www.cnn.com/2025/06/30/tech/iceblock-app-trump-immigration-crackdown\" target=\"_blank\">CNN that same day</a> had published an article on the app that quoted Aaron as saying that he developed ICEBlock after seeing the Trump administration's deportation efforts escalate.</p><p>\"When I saw what was happening in this country, I wanted to do something to fight back,\" Aaron said at the time, suggesting that the immigration enforcement efforts were reminiscent of Nazi Germany.</p><p>\"We're literally watching history repeat itself.\"</p><p>ICEBlock has been downloaded more than 1 million times since it was introduced this year, according to data provided to NBC News by the app tracking firm Appfigures.</p><p>The app hit a high of nearly 114,000 downloads in a single day on July 1, a day after the CNN article about the app sparked criticism from the Trump administration. </p><p><a href=\"https://www.ice.gov/news/releases/statement-ice-acting-director-todd-m-lyons-news-coverage-ice-spotting-app\" target=\"_blank\">ICE's acting director, Todd Lyons</a>, on June 30 said, \"Advertising an app that basically paints a target on federal law enforcement officers' backs is sickening.\"</p><p>\"My officers and agents are already facing a 500% increase in assaults, and going on live television to announce an app that lets anyone zero in on their locations is like inviting violence against them with a national megaphone,\" Lyons said.</p><p>But Aaron, in <a href=\"https://www.nbcnews.com/tech/tech-news/iceblock-app-ice-agent-sightings-tops-app-store-white-house-backlash-rcna216327\" target=\"_blank\">an NBC interview days later</a>, called the Trump administration's criticism of ICEBlock \"another right-wing fearmongering scare tactic.\"</p><p>He said he designed the app to help immigrants who are afraid of being deported.</p><p>\"I grew up in a Jewish household, and being part of the Jewish community,\" Aaron said.</p><p>\"I had the chance to meet Holocaust survivors and learn the history of what happened in Nazi Germany, and the parallels that we can draw between what's happening right now in our country and Hitler's rise to power are undeniable.\"</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Creator of ICE agent tracking app asks Apple to rescind ban from online store",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207574-1759505774200-108207574-1759505434988-gettyimages-2238880033-_73a5503_ornypcok-1.jpg?v=1759505790&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T21:57:46.000Z",
      "dateModified": "2025-10-03T21:57:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI chipmaker Cerebras withdraws IPO",
    "url": "https://www.cnbc.com/2025/10/03/cerebras-withdraws-ipo-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207840-1759525583790-gettyimages-2223516693-FRANCE_RAISE_SUMMIT.jpeg?v=1759525621&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T22:02:42.000Z",
    "description": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108207851-1759526307172-1759526070-41934629888-hd.jpg?v=1759526355&w=750&h=422&vtcrop=y\" ",
    "body": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108207851-1759526307172-1759526070-41934629888-hd.jpg?v=1759526355&w=750&h=422&vtcrop=y\" alt=\"AI chipmaker Cerebras pulls IPO after raising $1 billion\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>Artificial intelligence chipmaker Cerebras Systems <a href=\"https://www.sec.gov/Archives/edgar/data/2021728/000119312525230382/d886849drw.htm\" target=\"_blank\">said</a> on Friday that it's withdrawing plans for an IPO, days after announcing that it raised over $1 billion in a fundraising round.</p><p>In a filing with the SEC, Cerebras said it does not intend to conduct a proposed offering \"at this time,\" but didn't provide a reason. A spokesperson told CNBC on Friday that the company still hopes to go public as soon as possible.</p><p>Cerebras <a target=\"_blank\" href=\"https://www.cnbc.com/2024/09/30/cerebras-files-for-ipo.html\">filed for</a> an IPO just over a year ago, as it was ramping up to take on <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NVDA/\">Nvidia</a><span><span></span></span></span> in an effort to create processors for running generative AI models. The filing revealed a <a target=\"_blank\" href=\"https://www.cnbc.com/2024/10/11/cerebras-ipo-has-too-much-hair-as-chipmaker-tries-to-take-on-nvidia.html\">heavy reliance</a> on a single customer in the United Arab Emirates, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/MSFT/\">Microsoft</a><span><span></span></span></span>-backed G42, which is also a Cerebras investor.</p><p>In its prospectus, Cerebras said it had given voluntary notice to the Committee on Foreign Investment in the United States about selling shares to G42. In March, the company announced that the committee had <a target=\"_blank\" href=\"https://www.cnbc.com/2025/03/31/ai-chipmaker-cerebras-announces-cfius-clearance-a-key-step-toward-ipo.html\">provided clearance</a>.</p><p>Since its initial filing to go public on the Nasdaq, Cerebras has shifted its focus away from selling systems and more toward providing a cloud service for accepting incoming queries to models that use its chips underneath.</p><p>The announced withdrawal comes three days into a <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/government-shutdown-updates-thune-trump.html\">U.S. government shutdown</a> that's left agencies like the SEC operating with a small staff. In <a href=\"https://www.sec.gov/files/sec-plan-operations-during-lapse-appropriations.pdf\" target=\"_blank\">a plan</a> for a shutdown published in August, the SEC said its electronic system EDGAR \"is operated pursuant to a contract and thus will remain fully functional as long as funding for the contractor remains available through permitted means.\"</p><p>On Tuesday, Cerebras <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/30/ai-chip-company-cerebras-raises-1-billion-in-pre-ipo-funding-round.html\">said</a> it had raised $1.1 billion at a valuation of $8.1 billion in a private funding round. At the time, CEO Andrew Feldman said that the company still wanted to go public, rather than continue to raise venture capital.</p><p>\"I don't think this is an indication of a preference for one or the other,\" he told CNBC in an interview. \"I think we have tremendous opportunities in front of us, and I think it's good practice, when you have enormous opportunities, not to let them fall by the wayside for lack of capital.\"</p><p>Feldman thought the original prospectus from last year was out of date, especially considering developments in AI, the spokesperson said on Friday.</p><p>Well heeled technology companies have been quickly signing up for additional infrastructure to handle demand. On Tuesday <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/CRWV/\">CoreWeave</a><span><span></span></span></span>, which rents out Nvidia chips through a cloud service, said it had signed a $14.2 billion agreement with <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/META/\">Meta</a><span><span></span></span></span>. ChatGPT operator OpenAI said last week that it had committed to spending $300 billion on cloud services from <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/ORCL/\">Oracle</a><span><span></span></span></span>.</p><p>The government shutdown did not factor into Cerebras' decision, the spokesperson said.</p><p><strong>WATCH:</strong> <a target=\"_blank\" href=\"https://www.cnbc.com/video/2025/09/30/cerebras-ceo-heres-why-our-chips-are-a-more-efficient-alternative-to-nvidia.html\">Interview with Cerebras CEO Andrew Feldman</a></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108205768-17592453661759245362-41887227749-1080pnbcnews.jpg?v=1759245365&w=750&h=422&vtcrop=y\" alt=\"Cerebras CEO: Here's why our chips are a more efficient alternative to Nvidia\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI chipmaker Cerebras withdraws IPO",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207840-1759525583790-gettyimages-2223516693-FRANCE_RAISE_SUMMIT.jpeg?v=1759525621&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T22:02:42.000Z",
      "dateModified": "2025-10-03T22:02:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elon Musk is telling his followers to cancel Netflix subscriptions. Here's what's happening",
    "url": "https://www.cnbc.com/2025/10/02/elon-musk-calls-for-canceling-netflix-whats-happening.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108152705-17486289872025-05-30t181538z_798494356_rc2iseae2w85_rtrmadp_0_usa-trump.jpeg?v=1748633566&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T20:13:51.000Z",
    "description": "<div><div><p>Elon Musk stands in the Oval Office to attend a press event with U.S. President Donald Trump, at the White House in Washington, D.C., U.S",
    "body": "<div><div><p>Elon Musk stands in the Oval Office to attend a press event with U.S. President Donald Trump, at the White House in Washington, D.C., U.S., May 30, 2025. </p><p>Nathan Howard | Reuters</p></div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/elon-musk/\">Elon Musk</a> this week urged his followers to cancel their <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NFLX/\">Netflix</a><span><span></span></span></span> subscriptions over a controversy surrounding an animated show and its creator.</p><p>Musk on Wednesday <a href=\"https://x.com/elonmusk/status/1973292474375479556\" target=\"_blank\">posted</a> on his X platform saying, \"Cancel Netflix for the health of your kids.\" The post was in response to an image accusing Netflix of carrying out a \"transgender woke agenda.\"</p><p>The controversy seems to stem from conservative backlash over an animated Netflix show, \"Dead End: Paranormal Park,\" which features a transgender character. The show was canceled in 2023 after two seasons.</p><p>In addition to several anti-trans posts, Musk also <a href=\"https://x.com/elonmusk/status/1973101319222165785?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1973101319222165785%7Ctwgr%5E6bb1e8bac213d47b901b22d6ba65042b371c9caf%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.firstpost.com%2Fexplainers%2Felon-musk-netflix-boycott-charlie-kirk-controversy-13938760.html\" target=\"_blank\">responded</a> to a post criticizing alleged statements made by the show's creator, Hamish Steele, that a prominent conservative X account said \"mocked\" the murder of conservative activist Charlie Kirk.</p><p>Steele responded to Musk's callout on rival social media platform Bluesky saying, \"It's probably going to be a very odd day.\" Steele also shared a post by TV writer Jack Bernhardt that called \"Dead End\" a \"brilliant show about kind, wonderful characters.\"</p><p>Also this week, vocal conservative activist Robby Starbuck began posting about Netflix, echoing anti-trans sentiments and arguing the company has promoted an ideology that is \"hateful to White Americans.\" Starbuck, who has repeatedly targeted major corporations in recent months over diversity, equity and inclusion efforts, said in one of his X posts on Netflix, \"No one should give this woke company another dime.\"</p><p>Netflix did not respond to requests for comment from CNBC.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108206766-17593554481759355445-41906018363-1080pnbcnews.jpg?v=1759355447&w=750&h=422&vtcrop=y\" alt=\"‘Fast Money’ traders talk Netflix shares dropping after Elon Musk tells people to cancel\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>Analysts say the backlash might not pose as big of a threat to Netflix as Musk may be hoping for.</p><p>Netflix reported 301.63 million subscribers as of the fourth quarter of 2024, the last time it reported the metric before shifting priority to revenue over user growth. The company has a roughly $490 billion market cap, and its stock is up more than 60% in the past year.</p><p>Shares lost nearly 5% over the week. </p><p>\"Is that going to move the needle necessarily? ... You're going to see people sign up on the back of that to counter it,\" CNBC contributor Guy Adami said Wednesday on \"Fast Money.\"</p><p>\"I don't think this is a reason to sell the stock,\" he added.</p><p>Wedbush Securities' Alicia Reese told CNBC that the comments came too late in the third quarter to make any meaningful impact on subscriber counts.</p><p>Still, she said she believes the backlash won't make a major dent and that any impact will be offset by an increase in ad revenue.</p><p>\"Their numbers should come out just fine,\" Reese said. \"I think that shares haven't been hit too hard.\"</p><p>Seymour Asset Management's Tim Seymour said though a day of headlines may move the stock around, Netflix shares are ultimately too expensive to be significantly affected by internet backlash.</p><p>\"We've had these moments in time where, whether it was an ad campaign that went wrong or whether it was some sense that a company was aligned in a particular political channel... I don't think that that's going to be the reason to sell Netflix here,\" Seymour said Wednesday.</p><p>The calls for a boycott mirror those against <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/BUD/\">Anheuser-Busch InBev</a><span><span></span></span></span> in 2023 after it <a target=\"_blank\" href=\"https://www.cnbc.com/2023/06/14/bud-light-beer-sales-trail-modelo-in-may-following-anti-lgbtq-backlash.html\">released</a> an ad campaign with transgender influencer Dylan Mulvaney. But the boycott of Bud Light, CNBC contributor Karen Finerman noted on Wednesday, yielded \"far greater\" destruction than any other recent examples.</p><p>\"I feel like this will be very fleeting,\" Finerman said.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elon Musk is telling his followers to cancel Netflix subscriptions. Here's what's happening",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108152705-17486289872025-05-30t181538z_798494356_rc2iseae2w85_rtrmadp_0_usa-trump.jpeg?v=1748633566&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T20:13:51.000Z",
      "dateModified": "2025-10-03T20:13:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Goldman boss David Solomon warns of a stock market drawdown: ‘People won’t feel good’",
    "url": "https://www.cnbc.com/2025/10/03/goldman-sachs-ceo-david-solomon-warns-stock-market-drawdown-is-coming.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207433-1759491949006-gettyimages-2202646094-AUSTRALIA_AFR_SUMMIT.jpeg?v=1759492612&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T15:17:31.000Z",
    "description": "<div><div><p>David Solomon, chief executive officer of Goldman Sachs.</p><p>Bloomberg | Bloomberg | Getty Images</p></div><div><p>Stock markets are du",
    "body": "<div><div><p>David Solomon, chief executive officer of Goldman Sachs.</p><p>Bloomberg | Bloomberg | Getty Images</p></div><div><p>Stock markets are due a \"drawdown\" in the next year or two after years of being propelled to record highs by an AI frenzy, according to Goldman Sachs CEO David Solomon.</p><p>\"Markets run in cycles, and whenever we've historically had a significant acceleration in a new technology that creates a lot of capital formation, and therefore lots of interesting new companies around it, you generally see the market run ahead of the potential ... there are going to be winners and losers,\" he said at Italian Tech Week in Turin, Italy, on Friday.</p><p>Solomon pointed to the mass adoption of the internet in the late 1990s and early 2000s, which led to the emergence of some of the world's largest companies — but also saw investors lose money to what became known as the \"dotcom bubble.\"</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/107059234-16522558591652255856-23089484776-1080pnbcnews.jpg?v=1652255858&w=750&h=422&vtcrop=y\" alt=\"Tech sector sentiment is at its worst since the dotcom bubble, says Saxo Bank\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>\"You're going to see a similar phenomenon here,\" he said. \"I wouldn't be surprised if in the next 12 to 24 months, we see a drawdown with respect to equity markets ... I think that there will be a lot of capital that's deployed that will turn out to not deliver returns, and when that happens, people won't feel good.\"</p><p>An AI boom has gripped global markets in recent years, with a slew of <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/anthropic-claude-ai-sonnet-4-5.html\">new technologies</a>, <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/nvidia-openai-data-center.html\">multibillion-dollar deals</a> and the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/openai-share-sale-500-billion-valuation.html\">continued rise of ChatGPT-developer OpenAI</a>. It's seen investors bet big on the tech and pour capital into stocks such as <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/MSFT/\">Microsoft</a><span><span></span></span></span>, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/GOOGL/\">Alphabet</a><span><span></span></span></span>, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/PLTR/\">Palantir</a><span><span></span></span></span> and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NVDA/\">Nvidia</a><span><span></span></span></span>.</p></div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/the-ai-trade-could-rapidly-unravel-and-one-hedge-fund-is-preparing-for-the-fallout.html\"><img src=\"https://image.cnbcfm.com/api/v1/image/107412129-1715178447821-gettyimages-1289197426-aichipset-render08.jpeg?v=1759418563&w=160&h=90\" /></a></p></div><div><p>The buzz around AI has helped to push indexes <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/cnbc-daily-open-no-signs-of-us-stocks-bull-run-slowing-for-now.html\">on Wall Street and beyond</a> to record highs, even as the major U.S. averages were <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/the-european-markets-edge-over-the-us-is-waning.html\">dented earlier this year</a> by President Donald Trump's trade policies. However, as investors have continued to seek out opportunities in AI, concerns have been raised about the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/mega-ai-deals-enable-exits-for-private-equity-but-fuel-frothy-bubble-fears.html\">possibility of a bubble bursting</a> somewhere down the line.</p><p>\"I'm not going to use the word bubble, because I don't know, I don't know what the path will be, but I do know people are out on the risk curve because they're excited,\" Solomon said Friday.</p><p>\"And when [investors are] excited, they tend to think about the good things that can go right, and they diminish the things you should be skeptical about that can go wrong ... There will be a reset, there will be a check at some point, there will be a drawdown. The extent of that will depend on how long this [bull run] goes,\" he added.</p><p>Solomon is not alone in having concerns about current market levels. Speaking at the same event, <a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AMZN/\">Amazon</a> founder Jeff Bezos said Friday that <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/jeff-bezos-ai-in-an-industrial-bubble-but-society-to-benefit.html\">artificial intelligence is currently in an \"industrial bubble.\"</a></p><p>And earlier this week, veteran investor Leon Cooperman told CNBC that we are in the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/leon-cooperman-says-weve-reached-the-stage-of-the-bull-market-that-warren-buffett-warned-about.html\">late innings of a bull market where bubbles can form</a> — something Warren Buffett had warned about.</p><p>Karim Moussalem, chief investment officer of equities at Selwood Asset Management, meanwhile, warned of \"enormous risks\" on the horizon for the AI trade which could rapidly unravel. \"The AI trade is beginning to resemble one of the great speculative manias of market history,\" Moussalem, who runs a market-neutral equity strategy at the London-based hedge fund, said in a <a href=\"https://www.linkedin.com/posts/karim-moussalem-994177_bubble-alert-the-ai-trade-is-beginning-activity-7377294677865299969-1A2D/\" target=\"_blank\">post on LinkedIn</a>.</p></div><div><p>But while Solomon predicted some money would be lost, he also appeared optimistic about artificial intelligence.</p><p>\"I sleep very well. I'm not going to bed every night worried about what will happen next,\" Solomon said Friday. \"Generally speaking, I think what's super exciting is the technology is expanding, new companies are being formed, and the potential of this technology deployed into the enterprise can be very, very powerful. So, it's an exciting time.\"</p><p><em>— CNBC's Hugh Leask and Yun Li contributed to this report</em></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Goldman boss David Solomon warns of a stock market drawdown: ‘People won’t feel good’",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207433-1759491949006-gettyimages-2202646094-AUSTRALIA_AFR_SUMMIT.jpeg?v=1759492612&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T15:17:31.000Z",
      "dateModified": "2025-10-03T15:17:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Quantum stocks Rigetti Computing and D-Wave surged double digits this week. Here's what's driving the big move",
    "url": "https://www.cnbc.com/2025/10/03/quantum-stocks-rigetti-computing-d-wave.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108133732-1744950858083-Chandelier-thumb.jpg?v=1759505467&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T20:59:02.000Z",
    "description": "<div><div><p>Inside Google's quantum computing lab in Santa Barbara, California.</p><p>CNBC</p></div><div><p>Quantum computing stocks are wrapping up ",
    "body": "<div><div><p>Inside Google's quantum computing lab in Santa Barbara, California.</p><p>CNBC</p></div><div><p>Quantum computing stocks are wrapping up a big week of double-digit gains.</p><p>Shares of <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/RGTI/\">Rigetti Computing</a><span><span></span></span></span>, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/QBTS/\">D-Wave Quantum</a><span><span></span></span></span> and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/QUBT/\">Quantum Computing</a><span><span></span></span></span> have surged more than 20%. Rigetti and D-Wave Quantum have more than doubled and tripled, respectively, since the start of the year. <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/ARQQ/\">Arqit Quantum</a><span><span></span></span></span> skyrocketed more than 32% this week.</p><p>The jump in shares followed a wave of positive news in the quantum space.</p><p>Rigetti said it had purchase orders totaling $5.7 million for two of its 9-qubit <a href=\"https://investors.rigetti.com/news-releases/news-release-details/rigetti-announces-purchase-orders-two-quantum-computing-systems\" target=\"_blank\">Novera quantum</a> computing systems. The owner of drugmaker <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NVO/\">Novo Nordisk</a><span><span></span></span></span> and the Danish government also <a href=\"https://novoholdings.dk/news/novo-holdings-acts-as-cornerstone-investor-in-55-north-the-world-s-largest-dedicated-quantum-fund\" target=\"_blank\">invested 300 million euros</a> in a quantum venture fund.</p><p>In a blog post earlier this week, Nvidia also highlighted accelerated computing, which it argues can make \"quantum computing breakthroughs of today and tomorrow possible.\"</p><p>Investors have piled into quantum computing technology this year, as tech giants <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/MSFT/\">Microsoft</a><span><span></span></span></span>, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NVDA/\">Nvidia</a><span><span></span></span></span> and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/AMZN/\">Amazon</a><span><span></span></span></span> have embraced the technology with a wave of <a target=\"_blank\" href=\"https://www.cnbc.com/2025/02/27/amazon-touts-its-first-quantum-computing-chip-a-week-after-microsofts-unveiling.html?utm_source=chatgpt.com\">new chip</a> announcements, multimillion-dollar<a href=\"https://nvidianews.nvidia.com/news/nvidia-to-build-accelerated-quantum-computing-research-center\" target=\"_blank\"> investments and research plans</a>.</p></div><div><h2>Read more CNBC tech news</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/openai-invite-code-sora-2-censorship.html\">OpenAI's Sora 2 is putting safety and censorship to the test with stunningly real videos</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/amazon-drone-crash-faa-ntsb.html\">Amazon faces FAA, NTSB probe after two delivery drones crashed into crane in Arizona</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/jeff-bezos-ai-in-an-industrial-bubble-but-society-to-benefit.html\">Jeff Bezos says AI is in an industrial bubble but society will get 'gigantic' benefits from the tech</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/perplexity-ai-comet-browser-free-.html\">Perplexity AI rolls out Comet browser for free worldwide</a></li></ul></div></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108174383-17530941801753094178-40822336265-1080pnbcnews.jpg?v=1753094179&w=750&h=422&vtcrop=y\" alt=\"Quantum computing is the most radical technology in history: Bank of America's Haim Israel\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Quantum stocks Rigetti Computing and D-Wave surged double digits this week. Here's what's driving the big move",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108133732-1744950858083-Chandelier-thumb.jpg?v=1759505467&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T20:59:02.000Z",
      "dateModified": "2025-10-03T20:59:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Massive fire breaks out at Chevron oil refinery in California",
    "url": "https://www.cnbc.com/2025/10/03/massive-fire-breaks-out-at-chevron-oil-refinery-in-california.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207379-1759483546402-gettyimages-2238530585-chevron-6626.jpeg?v=1759483577&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T13:51:32.000Z",
    "description": "<div><div><p>An aerial view of Chevron crews attempting to extinguish a large fire and explosion that occurred at Chevron Refinery in El Segundo Thurs",
    "body": "<div><div><p>An aerial view of Chevron crews attempting to extinguish a large fire and explosion that occurred at Chevron Refinery in El Segundo Thursday, Oct. 2, 2025.</p><p>Allen J. Schaben | Los Angeles Times | Getty Images</p></div><div><p>A huge fire broke out on Thursday night at a <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/CVX/\">Chevron</a><span><span></span></span></span> oil refinery in California, one of the largest on the U.S. west coast, following reports of an explosion.</p><p>No injuries were reported from the incident at the El Segundo plant, Chevron said on Friday, with the U.S. energy major's fire department personnel and emergency services \"actively responding\" to the situation.</p><p>It was not immediately clear what caused the blaze.</p><p>\"All refinery personnel and contractors have been accounted for and there are no injuries,\" Chevron said in a statement, according to NBC.</p><p>\"No evacuation orders for area residents have been put in place by emergency response agencies monitoring the incident, and no exceedances have been detected by the facilities fence line monitoring system,\" the company added.</p><p>The El Segundo oil refinery is capable of refining 290,000 barrels of crude oil per day, Chevron <a href=\"https://elsegundo.chevron.com/what-we-do\" target=\"_blank\">says</a> on its website, and its primary products are gasoline, jet and diesel.</p></div><div><p>People watch a fire burn at a Chevron refinery on October 2, 2025 in El Segundo, California. A big explosion around 10pm (PST) produced a large orange blaze that could be seen from miles away from the refinery close by the Los Angeles airport.</p><p>Apu Gomes | Getty Images News | Getty Images</p></div><div><p>California Governor Gavin Newsom's press office said on Friday that the governor had been briefed on the incident at Chevron's El Segundo oil refinery in Los Angeles County.</p><p>\"Our office is coordinating in real time with local and state agencies to protect the surrounding community and ensure public safety,\" Newsom's press office <a href=\"https://x.com/GovPressOffice/status/1973982115340644715\" target=\"_blank\">said</a> in a social media post.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Massive fire breaks out at Chevron oil refinery in California",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207379-1759483546402-gettyimages-2238530585-chevron-6626.jpeg?v=1759483577&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T13:51:32.000Z",
      "dateModified": "2025-10-03T13:51:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berkshire Hathaway votes to separate chairman and CEO roles, paving way for Abel to succeed Buffett at year-end",
    "url": "https://www.cnbc.com/2025/10/03/berkshire-hathaway-votes-abel-buffett.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108140406-1746278498567-untitled-169-33.jpg?v=1746280381&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T15:20:15.000Z",
    "description": "<div><div><p>Warren Buffett and Greg Abel walkthrough the Berkshire Hathaway Annual Shareholders Meeting in Omaha, Nebraska on May 3, 2025. </p><p>Dav",
    "body": "<div><div><p>Warren Buffett and Greg Abel walkthrough the Berkshire Hathaway Annual Shareholders Meeting in Omaha, Nebraska on May 3, 2025. </p><p>David A. Grogen | CNBC </p></div><div><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/BRK.A/\">Berkshire Hathaway</a><span><span></span></span></span> formally separated the roles of chairman and chief executive officer, a long-anticipated move that paves the way for Greg Abel to succeed Warren Buffett as CEO at the beginning of 2026.</p><p>In a new regulatory filing, the Omaha-based conglomerate said its board voted on Sept. 30 to amend its bylaws to distinguish the two top roles, effective immediately. Buffett, who has run Berkshire since 1965, will remain chairman of the board, while Abel, currently vice chairman for non-insurance operations, will take over as CEO on Jan. 1, 2026.</p><p>The move was first announced by the 95-year-old Buffett at the end of Berkshire's annual shareholder meeting in May, which took many by surprise. Shortly after the initial announcement, Berkshire's board unanimously approved Abel's appointment.</p><p>Buffett, even at his advanced age, has likely stayed active at the conglomerate. Just earlier this week, Berkshire announced <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/02/warren-buffett-berkshire-occidental-oxychem.html\">it is acquiring OxyChem</a>, the chemical arm of Occidental Petroleum, in a roughly $9.7 billion all-cash transaction. It marks Berkshire's biggest deal in three years.</p><p>Abel, 63, has been seen as Buffett's heir apparent since Charlie Munger, Berkshire's late vice chairman, publicly identified him as the chosen successor in 2021. He joined the Berkshire orbit when Berkshire acquired a controlling interest in MidAmerican Energy in 1999, and he later became CEO of the energy firm.</p><p>Since 2018, Abel has served as Berkshire's vice chairman for non-insurance operations, overseeing railroad, utilities, energy, manufacturing and retail businesses.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berkshire Hathaway votes to separate chairman and CEO roles, paving way for Abel to succeed Buffett at year-end",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108140406-1746278498567-untitled-169-33.jpg?v=1746280381&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T15:20:15.000Z",
      "dateModified": "2025-10-03T15:20:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cramer's week ahead: Dell's analyst meeting and earnings from McCormick, Delta",
    "url": "https://www.cnbc.com/2025/10/03/cramers-week-ahead-dells-analyst-meeting-earnings-mccormick-delta.html",
    "image": "https://image.cnbcfm.com/api/v1/image/101642748-20130429-0903-125.jpg?v=1512406065&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T22:45:38.000Z",
    "description": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108207876-6ED3-REQ-100325-MMABLOCKSHORT.jpg?v=1759533126&w=750&h=422&vtcrop=y\" alt=\"Retai",
    "body": "<div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108207876-6ED3-REQ-100325-MMABLOCKSHORT.jpg?v=1759533126&w=750&h=422&vtcrop=y\" alt=\"Retail investors keep powering this market rally, says Jim Cramer\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>CNBC's <a target=\"_blank\" href=\"https://www.cnbc.com/jim-cramer-bio/\">Jim Cramer</a> on Friday guided investors through next week on Wall Street, highlighting earnings reports from <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/MKC/\">McCormick</a><span><span></span></span></span> and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/DAL/\">Delta</a><span><span></span></span></span> Air Lines as well as <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/DELL/\">Dell</a><span><span></span></span></span>'s analyst meeting. He also suggested the economy outside of data center-related business is getting weaker and advocated for another rate cut from the Federal Reserve.</p><p>\"We have a lot of anecdotal evidence of weakness, but not anything hardcore. We need to watch this, as we're about to head into earnings season, and the bulls could run into serious trouble if the Fed doesn't take action,\" he said. \"For my money, the economy away from the data center buildout is getting weaker. This is no time for indecision — the Fed needs to cut.\"</p><p>Monday brings earnings from beer maker <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/STZ/\">Constellation Brands</a><span><span></span></span></span>, and Cramer noted the stock has fallen out of favor on Wall Street along with other alcohol companies. He also mentioned that some of Constellation Brands' products, including Modelo and Corona, are popular among Hispanic consumers — who the company said have <a target=\"_blank\" href=\"https://www.cnbc.com/2025/04/10/modelo-owner-constellation-says-trump-immigration-policy-hitting-beer-sales.html\">pulled back</a> due to concerns about President Donald Trump's immigration policies and potential job losses.</p><p>On Tuesday, Cramer said he will be paying attention to McCormick's quarterly report. He said the spice maker is usually reliable, but that reliability hasn't been enough \"to move the needle for this stock\" as the whole packaged food sector sees weakness. However, he added that McCormick may be able to do well in a slower economy \"because spices are excellent trade down material.\" Cramer said he thinks Dell's Tuesday analyst meeting will be a highlight of the week, noting that the tech company has been working with <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/NVDA/\">Nvidia</a><span><span></span></span></span> to integrate artificial intelligence.</p><p>Wednesday brings an investor day from Solstice, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/HON/\">Honeywell</a><span><span></span></span></span>'s materials <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/honeywell-sets-date-for-solstice-spinoff-what-it-means-for-shareholders.html\">spinoff</a> company. Cramer called Honeywell's breakup a \"pretty bold move,\" and also discussed the other two spinoffs, an aerospace business and a building automation company.</p><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/PEP/\">PepsiCo</a><span><span></span></span></span>, Delta and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/LEVI/\">Levi Strauss</a><span><span></span></span></span> are set to report on Thursday. Cramer wondered how the soda maker will react to an activist investor who has taken a big stake in the company and wants to make changes, noting that PepsiCo already faces issues as the popularity of GLP-1 weight loss drugs grows and consumers become more health conscious. Cramer called Delta a \"tough stock\" to own,<strong> </strong>as it's down around 5% year-to-date even though it's among the best performers in its sector. Cramer said he's feeling good about Levi's quarter, saying the company has become fairly reliable despite tariffs.</p><p>Chicago Federal Reserve President Austan Goolsbee<strong> </strong>will speak on Friday, and Cramer said his commentary matters because he's a voting member of the Federal Open Market Committee. Cramer pointed out that Goolsbee <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/fed-goolsbee-rates.html\">told CNBC</a> on Friday that he's wary of cutting interest rates too quickly because of inflation. Many on Wall Street, along with Goolsbee, are \"flying blind,\" Cramer said, as the government shutdown delays the labor report — a key economic metric for the Fed.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108207875-6ED3-REQ-100325-MMABLOCK.jpg?v=1759533078&w=750&h=422&vtcrop=y\" alt=\"Fear of missing out is driving markets higher, says Jim Cramer\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/jointheclub/\"><em>Sign up now</em></a><em> for the CNBC Investing Club to follow Jim Cramer's every move in the market.</em></p><p><a target=\"_blank\" href=\"https://www.cnbc.com/mad-money-disclaimer/\">Disclaimer</a> The CNBC Investing Club holds shares of Nvidia.</p><div><p>Questions for Cramer?<br /> Call Cramer: 1-800-743-CNBC</p><p>Want to take a deep dive into Cramer's world? Hit him up!<br /> <a href=\"https://twitter.com/MadMoneyOnCNBC\" target=\"_blank\">Mad Money Twitter</a> - <a href=\"https://twitter.com/jimcramer\" target=\"_blank\">Jim Cramer Twitter</a> - <a href=\"https://www.facebook.com/madmoney?ref=aymt_homepage_panel\" target=\"_blank\">Facebook</a> - <a href=\"http://instagram.com/jimcramer\" target=\"_blank\">Instagram</a></p><p>Questions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com</p></div></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cramer's week ahead: Dell's analyst meeting and earnings from McCormick, Delta",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/101642748-20130429-0903-125.jpg?v=1512406065&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T22:45:38.000Z",
      "dateModified": "2025-10-03T22:45:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Detroit auto stocks jump on report of tariff relief for U.S. vehicles",
    "url": "https://www.cnbc.com/2025/10/03/ford-gm-stla-stock-tariffs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106976847-1637165426358-FZHUMMEREV076.jpg?v=1759525903&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T21:17:16.000Z",
    "description": "<div><div><p>GM Hummer EV production in Detroit.</p><p>Photo by Jeffrey Sauger for General Motors</p></div><div><p>DETROIT — Shares of the Detroit aut",
    "body": "<div><div><p>GM Hummer EV production in Detroit.</p><p>Photo by Jeffrey Sauger for General Motors</p></div><div><p>DETROIT — Shares of the Detroit automakers closed higher Friday following an afternoon report that President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> is considering \"significant tariff relief\" for the production of vehicles in the U.S.</p><p>Stocks for <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/GM/\">General Motors</a><span><span></span></span></span>, <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/F/\">Ford Motor</a><span><span></span></span></span> and Chrysler parent <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/STLA/\">Stellantis</a><span><span></span></span></span> shifted from trading level or down to closing up between 1% to 4% on the report from Reuters.</p><p>The news organization, citing Republican Senator Bernie Moreno of Ohio as well as auto officials, said the potential change could \"effectively eliminate much of the costs major car companies are paying.\"</p><p>\"The signal to the car companies around the world is, look, you have final assembly in the U.S.: we're going to reward you,\" Moreno told <a href=\"https://www.reuters.com/business/autos-transportation/trump-considering-significant-tariff-relief-us-vehicle-production-senator-says-2025-10-03/\" target=\"_blank\">Reuters</a> during an interview. \"For Ford, for Toyota, for Honda, for Tesla, for GM, those are the, almost in order, the top five domestic content vehicle producers — they'll be immune to tariffs.\"</p></div><div><div><svg width=\"256\" height=\"256\">Stock Chart IconStock chart icon</svg><p><img src=\"https://static-redesign.cnbcfm.com/dist/a54b41835a8b60db28c2.svg\" alt=\"hide content\" /></p></div><p>GM, Ford, Stellantis and Tesla stocks</p></div><div><p>Reuters reported that the changes could include extending a tariff offset of 3.75% for five years, as well as adding U.S. engine production to the relief.</p><p>Shares of Ford, which assembles the most vehicles in the U.S., closed Friday at a new 52-week high of $12.67, up 3.7%. U.S.-listed shares of Stellantis closed up 3.2% to $10.73 per share, while GM closed at $60.13, up 1.3%</p><p><span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/TSLA/\">Tesla</a><span><span></span></span></span> stock was little changed on the news, closing down 1.4% to $429.83 per share, while U.S.-listed shares for other automakers with notable operations in the U.S., such as <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/HMC/\">Honda Motor</a><span><span></span></span></span> and <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/TM/\">Toyota Motor</a><span><span></span></span></span>, saw bumps.</p><p>Trump's tariffs of 25% on imported vehicles and parts have been a major concern for the automotive industry, costing companies billions of dollars in higher costs.</p><p>Ford previously said it expected <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/30/ford-motor-f-earnings-q2-2025.html\">$3 billion in U.S. tariff-related costs</a> this year, $1 billion of which it believed it could mitigate. GM has said it expected up to $5 billion in gross tariff-related costs this year, adding that it could potentially avoid at least <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/22/general-motors-gm-earnings-q2-2025.html\">30% of that cost this year.</a></p><p>Automakers have been lobbying the Trump administration for relief, especially for U.S.-produced vehicles, as well as those imported from Canada and Mexico.</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Detroit auto stocks jump on report of tariff relief for U.S. vehicles",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106976847-1637165426358-FZHUMMEREV076.jpg?v=1759525903&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T21:17:16.000Z",
      "dateModified": "2025-10-03T21:17:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The shutdown meant no jobs report. Here's what it would have said about the economy",
    "url": "https://www.cnbc.com/2025/10/03/shutdown-jobs-report-economy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108206734-1759352726135-gettyimages-2238210877-US_JOBS.jpeg?v=1759352801&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-03T19:06:19.000Z",
    "description": "<div><div><p>Recruiters speak to job seekers at the Appalachian State University internship and job fair in Boone, North Carolina, US, on Wednesday, O",
    "body": "<div><div><p>Recruiters speak to job seekers at the Appalachian State University internship and job fair in Boone, North Carolina, US, on Wednesday, Oct. 1, 2025. </p><p>Allison Joyce | Bloomberg | Getty Images</p></div><div><p>If it just seems like the first Friday of the month wasn't the same without being able to pore through the Bureau of Labor Statistics' hotly watched monthly jobs report, don't worry. You probably didn't miss much.</p><p>While the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/29/bls-wont-be-releasing-data-including-fridays-key-jobs-report-in-case-of-a-shutdown.html\">BLS has gone dark</a> with the shutdown in Washington, other reports outside the government data suggest the labor market just plodded along in September.</p><p>The Dow Jones consensus forecast was for growth of 51,000 in nonfarm payrolls with the unemployment rate holding steady at 4.3%.</p><p>High-frequency data that includes job postings, private payrolls and state-by-state figures for initial jobless claims indicate that while employment growth continues to be anemic, the labor market overall isn't capsizing, at least not anytime soon.</p><p>\"We fight with the army we have at moments like this, where it's critically important that we're figuring out whether the economy is in a moment of transition,\" Chicago Federal Reserve President Austan Goolsbee <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/03/fed-goolsbee-rates.html\">said in a CNBC interview</a> Friday. \"This is what we have, and thus far it still continues to point to a pretty stable labor market.\"</p><p>The Chicago Fed is one of those organizations looking to provide alternates to BLS data that had come under harsh White House criticism prior to this week's shutdown.</p><p>Though the timing was coincidental, the central bank district in September unveiled <a href=\"https://www.chicagofed.org/research/data/chicago-fed-labor-market-indicators/latest-release\" target=\"_blank\">its own dashboard</a> of data measuring key labor market metrics including unemployment, the hiring rate and the layoff rate.</p><p>Bottom line: The unemployment rate held flat at 4.3%, though another hundredth of a point or two would have pushed it to 4.4% — the highest since October 2021 but still low by historical standards.</p><p>Other nongovernmental data showed similar trends: Conditions overall are softening, with job availability gradually shrinking.</p><p>But employers are still reluctant to part with workers given the lessons from the Covid pandemic, when a rash of layoffs in the early stages was followed by the monumental task of refilling those jobs. At one point, open positions outnumbered available workers by more than 2 to 1.</p><p>\"A lot of the new entrants in the market, young workers, recent graduates, people who are already unemployed [are] having a hard time getting into the market,\" said Cory Stahle, senior economist at job postings site Indeed, which itself provides an encompassing menu of labor market data. \"Regardless of what the unemployment rate is, people taking longer to find jobs is a sign of some economic distress for some households.\"</p></div><h2><a></a>Signs of imbalances</h2><div><p>Indeed's <a href=\"https://data.indeed.com/#/\" target=\"_blank\">measure of job postings</a> shows a decline of about 8.9% from a year ago as of Sept. 26, a sharper drop than the 5.5% reflected in BLS data, which only runs through August.</p><p>Broader trends suggest an uneven labor market, with professions like health care continuing to thrive while other fields lag, Stahle said.</p><p>\"Overall, things are looking pretty good, but a lot of those job gains, a lot of those postings and hiring, are coming from health care, and so it's hard to say that the labor market is fully in balance when it's not providing equal opportunities across different occupations,\" he said.</p><p>BLS data also has shown a fairly sizeable tilt in openings toward health care-related professions, with business and professional services next followed by leisure and hospitality. Government had been a leader but has pulled back since President Donald Trump began his term in January with a vow to pare down the federal payroll.</p><p>\"Right now is a good time to be a nurse, not so good of a time to be working as a software developer,\" Stahle added. \"That bifurcation of the labor market is also an important thing to look at here, not just the overall balance and an overall number.\"</p><p>Other indicators paint a similar picture, though <a target=\"_blank\" href=\"https://www.cnbc.com/2025/10/01/private-payrolls-declined-in-september-by-32000-in-key-adp-report-coming-amid-shutdown-data-blackout.html\">ADP's private payroll count</a> for September showed a decline of 32,000 jobs and an August loss of 3,000 as well. ADP on occasion also has been maligned for being incongruent with BLS data. However, the firm's reports are getting a closer look after it signaled a slowdown in the labor market well before the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/09/jobs-report-revisions-september-2025-.html\">BLS marked down its own counts</a> also to show a weak hiring picture.</p><p>It wasn't just the monthly nonfarm payroll account that went missing because of the shutdown: The Labor Department also didn't release its weekly tally of initial jobless claims.</p><p>Goldman Sachs came to the rescue for that metric, figuring that state-level claims data that was filed pointed to a national total of 224,000 — slightly higher than the previous week but largely in line with trends through most of the year.</p></div><h2><a></a>Other measures</h2><div><p>Beyond simple job or payroll count, spending data also can be a useful indirect gauge.</p><p>Bank of America's credit and debit card tracking showed spending on a steady uptick in September. Total card outlays compared to a year ago increased 2.2% for the week ending Sept. 27.</p><p>\"Spending growth remains solid despite soft labor data. We will continue to monitor this dichotomy,\" BofA economist Shruti Mishra said in a client note.</p><p>Similarly, Fiserv's small business index showed annual sales and transactions increased 2.3% in September, reflecting the same pace for the past three months.</p><p>However, other small business indicators show weakness.</p><p>\"Right now we see that there are a lot of firms that have job openings. There are, unfortunately, very few that get filled,\" Bill Dunkelberg, chief economist at the National Federation of Independent Business, told CNBC on Friday. \"So plans to fill them are always very optimistic, but when the dust clears, very few jobs actually get created.\"</p></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The shutdown meant no jobs report. Here's what it would have said about the economy",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108206734-1759352726135-gettyimages-2238210877-US_JOBS.jpeg?v=1759352801&w=1920&h=1080"
      ],
      "datePublished": "2025-10-03T19:06:19.000Z",
      "dateModified": "2025-10-03T19:06:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]