[
  {
    "title": "Korea Zinc sinks 14% as largest shareholder group challenges U.S.-backed plans for Tennessee smelter",
    "url": "https://www.cnbc.com/2025/12/16/korea-zinc-mbk-yoongpoong-us-jv-texas-pentagon.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241939-1765821572884-gettyimages-2193418506-PSWAT_DSC04356.jpeg?v=1765821601&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T07:50:53.000Z",
    "description": "Piotr Swat | Lightrocket | Getty ImagesKorea Zinc shares nosedived on Tuesday, as its largest shareholder is reportedly opposing plans to create a U.S",
    "body": "Piotr Swat | Lightrocket | Getty ImagesKorea Zinc shares nosedived on Tuesday, as its largest shareholder is reportedly opposing plans to create a U.S.-backed joint venture that will see a dilution of its equity stake in the South Korean company.  Shares of the world's largest zinc smelting company had climbed over 26% on Monday, before paring gains to 5%, as it announced a $7.4 billion mineral smelter project in Tennessee. The stock ended Tuesday down 13.94%. The company's largest shareholder alliance is opposing the move and would seek a court injunction to stop the company from issuing new shares.  The Korea Times reported that the alliance, made up of private equity firm MBK Partners and conglomerate YoongPoong, said the plan was designed for company Chairman Choi Yun-beom to hold on to management control.Under the deal, a joint venture company will be set up to build the smelter in Tennessee, with the Pentagon having a 40% stake in the JV. As part of the project, Korea Zinc will sell new shares worth $1.9 billion to this joint venture controlled by the U.S. government and certain U.S.-based strategic investors that have not been named, effectively giving the group 10% stake in the South Korean company. South Korean media outlet Business Korea said that issuing 10% of new shares will reduce the combined Yoong-Poong-MBK stake ratio from about 44% to the \"high 30% range\" while allowing friendly stakes from Choi and the U.S. government to rise to the 40% range. Early Tuesday, U.S. Commerce Secretary Howard Lutnick said in a post on X that \"Starting in 2026, the United States will have priority access to Korea Zinc's expanded global production, putting American security and manufacturing FIRST.\"The Tennessee project seeks to build an integrated smelter producing base metals as well as critical and strategic minerals, with phased commercial operations targeted for 2029, Korea Zinc said in a statement.The planned critical minerals smelting and processing facility could produce 540,000 tons of materials in the U.S. per year, according to the U.S. Commerce Department, and comes as the U.S. seeks to form critical mineral partnerships that are not dependent on China.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Korea Zinc sinks 14% as largest shareholder group challenges U.S.-backed plans for Tennessee smelter",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241939-1765821572884-gettyimages-2193418506-PSWAT_DSC04356.jpeg?v=1765821601&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T07:50:53.000Z",
      "dateModified": "2025-12-16T07:50:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kraft Heinz taps former Kellanova CEO Steve Cahillane to lead company ahead of breakup",
    "url": "https://www.cnbc.com/2025/12/16/kraft-heinz-steve-cahillane-ceo-breakup.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108193662-1756904775296-gettyimages-2233389757-dsc05773_zsrmek0e.jpeg?v=1756904855&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T12:26:12.000Z",
    "description": "Kraft Heinz announced plans to split into two separately traded companies, reversing its 2015 megamerger, which was orchestrated by billionaire invest",
    "body": "Kraft Heinz announced plans to split into two separately traded companies, reversing its 2015 megamerger, which was orchestrated by billionaire investor Warren Buffett. Justin Sullivan | Getty Images News | Getty ImagesKraft Heinz on Tuesday announced that former Kellanova CEO Steve Cahillane will lead the company ahead of its planned split next year.Cahillane will join the Oscar Mayer owner as chief executive on Jan. 1. After Kraft Heinz divides into two publicly traded companies, he will serve as CEO of the business it is calling Global Taste Elevation, which will include high-growth brands like Heinz, Philadelphia and Kraft Mac & Cheese.Cahillane previously led Kellogg through its own breakup in 2023. The company split its sluggish North American cereal business from its high-growth snacking unit, which was then renamed Kellanova. Cahillane stayed on as chief executive of Kellanova until Mars acquired the company for $35.9 billion.Outgoing Kraft Heinz CEO Carlos Abrams-Rivera was originally tapped to lead the other company known as North American Grocery. However, he will now serve as an advisor through March 6. Abrams-Rivera has been chief executive of the food giant since 2024.The Kraft Heinz board will initiate a search for a chief executive to lead the portfolio of grocery staples, which includes brands like Oscar Mayer and Kraft Singles.As part of the transition, John Cahill, who served as CEO of Kraft during its merger with Heinz a decade ago, will succeed Miguel Patricio as chair of the board.Kraft Heinz is projecting that the separation will happen in the second half of 2026. The company announced the breakup plans in September, following years of sluggish sales despite turnaround efforts. The split reverses much of the blockbuster $46 billion merger from a decade ago that created one of the biggest food companies in the world.Kraft Heinz shares were slightly higher in premarket trading. The stock has fallen about 20% this year.Programming note: Steve Cahillane will speak to CNBC's \"Squawk on the Street\" at 10:10 a.m. on Tuesday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kraft Heinz taps former Kellanova CEO Steve Cahillane to lead company ahead of breakup",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108193662-1756904775296-gettyimages-2233389757-dsc05773_zsrmek0e.jpeg?v=1756904855&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T12:26:12.000Z",
      "dateModified": "2025-12-16T12:26:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China lowers anti-dumping tariffs on European pork exporters ",
    "url": "https://www.cnbc.com/2025/12/16/china-lowers-anti-dumping-tariffs-on-european-pork-exporters-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108175010-1753186311908-gettyimages-2224449851-AFP_66PF3WF.jpeg?v=1765870939&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T09:17:24.000Z",
    "description": "A staff member prepares for the arrival of Chinese Vice Premier Ding Xuexiang and EU Executive Vice-President for a Clean, Just and Competitive Transi",
    "body": "A staff member prepares for the arrival of Chinese Vice Premier Ding Xuexiang and EU Executive Vice-President for a Clean, Just and Competitive Transition, Teresa Ribera during China-EU Sixth High Level Environment and Climate Dialogue (HECD) at the Diaoyutai State Guest House in Beijing on July 14, 2025.Wang Zhao | Afp | Getty ImagesChina on Tuesday announced lower duties on pork imports and pig by-products from the European Union as it concluded a year-long anti-dumping investigation into European pork imports. The new tariff rates — ranging from 4.9% to 19.8% on dozens of European pork exporters — will start taking effect on Wednesday and last five years, according to the Chinese commerce ministry. Earlier in September, China had imposed temporary anti-dumping tariffs of up to 62.4% in the form of cash deposits on pork imports from the EU. The trade tensions had flared after Brussels slapped tariffs of up to 45% in October last year on electric vehicles imported from China, drawing Beijing to denounce it as protectionist. China launched the anti-dumping probe in June last year as part of a countermeasure to the EU's punitive measures against its EV sector. The EU is the world's largest pork exporter, selling around 13% of its annual production overseas, with China being the single largest buyer, according to estimates by S&P Global. European leaders have called out Beijing's growing trade imbalance with major trading partners, including the EU, as tariff tensions with Washington propelled Chinese exporters to redirect shipments to non-U.S. markets. China's trade surplus reached a record of more than $1 trillion for the year as of November. Beijing's curbs on rare earth exports had also threatened a shortage of the critical minerals at several European manufacturers that sought to diversify supply chains from China. The agreement that China struck with the U.S. in late October has allayed some concerns, as Beijing reportedly has started granting licenses for such exports. The EU and China have also clashed over the export of semiconductors after the Netherlands took control of Nexperia, a Chinese-owned firm based in the country. Last week, Beijing called on the Dutch government to send a delegation to China for further negotiations. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China lowers anti-dumping tariffs on European pork exporters ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108175010-1753186311908-gettyimages-2224449851-AFP_66PF3WF.jpeg?v=1765870939&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T09:17:24.000Z",
      "dateModified": "2025-12-16T09:17:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The AI-fueled chip shortage could raise smartphone prices — new research spells out by how much",
    "url": "https://www.cnbc.com/2025/12/16/smartphone-prices-to-rise-in-2026-due-to-ai-fueled-chip-shortage.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108233306-1764322289679-gettyimages-2241962168-ECP_fc1300561.jpeg?v=1765870269&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T09:13:14.000Z",
    "description": "The logo of an Apple Store is seen reflected on the glass exterior of a Samsung flagship store in Shanghai, China Monday, Oct. 20, 2025.Wang Gang | Fe",
    "body": "The logo of an Apple Store is seen reflected on the glass exterior of a Samsung flagship store in Shanghai, China Monday, Oct. 20, 2025.Wang Gang | Feature China | Future Publishing | Getty ImagesA shortage of memory chips fueled by artificial intelligence players is likely to cause a price rise in smartphones in 2026 and a drop in shipments, Counterpoint Research said in a note on Tuesday.Smartphone shipments could fall 2.1% in 2026, according to Counterpoint, versus a previous outlook of flat-to-positive growth.Shipments do not equate to sales but are a measure of demand as they track the number of devices being sent to sales channels like stores. Meanwhile, the average selling price of smartphones could jump 6.9% year-on-year in 2026, Counterpoint said, in comparison to a previous forecast of a 3.6% rise.This is being driven by specific chip shortages and bottlenecks in the semiconductor supply chain, which are pushing up component prices.The continued build-out of data centres globally has hiked demand for systems developed by Nvidia, which in turn uses components designed by SK Hynix and Samsung — the two biggest suppliers of so-called memory chips. watch nowHowever, a specific component called dynamic random-access memory or DRAM, which is used in AI data centers, is also critical for smartphones. DRAM prices have surged this year as demand outstrips supply. For low-end smartphones priced below $200, the bill of materials cost has increased 20% to 30% since the beginning of the year, Counterpoint said. The bill of materials is the cost of producing a single smartphone. The mid and high-end smartphone segment has seen material costs rise 10% to 15%. \"Memory prices could rise another 40% through Q2 2026, resulting in BoM costs increasing anywhere between 8% and over 15% above current elevated levels,\" Counterpoint said. The rising price of components could be passed on to consumers and that will in turn, drive the rise in the average selling price.\"Apple and Samsung are best positioned to weather the next few quarters,\" MS Hwang, research director at Counterpoint, said in the note. \"But it will be tough for others that don't have as much wiggle room to manage market share versus profit margins.\"Hwang said this will \"play out especially\" with Chinese smartphone makers who are in the mid-to-lower end of the market. Counterpoint said some companies may downgrade components like camera modules, displays and even audio, as well as reusing old components. Smartphone players are likely to try to incentivize consumers to buy their higher-priced devices too. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The AI-fueled chip shortage could raise smartphone prices — new research spells out by how much",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108233306-1764322289679-gettyimages-2241962168-ECP_fc1300561.jpeg?v=1765870269&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T09:13:14.000Z",
      "dateModified": "2025-12-16T09:13:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "As catastrophe losses top $100 billion again, insurers are helping policyholders mitigate risk",
    "url": "https://www.cnbc.com/2025/12/16/insurers-policyholders-mitigate-risk-catastrophe-losses.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241995-1765824740181-gettyimages-2247228379-1531335-me-palisades-first-rebuilt-home-003-eat.jpeg?v=1765824767&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T12:20:01.000Z",
    "description": "Climate catastrophes like wildfires and severe storms have become more frequent and damaging in the U.S., accounting for 83% of the estimated global i",
    "body": "Climate catastrophes like wildfires and severe storms have become more frequent and damaging in the U.S., accounting for 83% of the estimated global insured losses of $107 billion in 2025, according to a new report from Swiss Re Institute.This is the sixth consecutive year that global insured losses have surpassed $100 billion.  The Los Angeles wildfires in January accounted for insured losses of $40 billion alone, making them the costliest-ever wildfires globally, according to Swiss Re. The insurance research firm said the soaring costs are due in part to rising real estate values as well as homeowners building in areas where wildland and urban areas blend, which is especially hazardous. \"Amid annual volatility, insured losses keep rising. That's why strengthening prevention, protection and preparedness is essential to protect lives and property,\" said Swiss Re Group Chief Economist Jerome Jean Haegeli in a news release.Insurers are increasingly requiring mitigation from their policy holders. In wildfire prone areas, that can mean felling trees and clearing vegetation to create a defense zone around homes and buildings. In areas that are vulnerable to hurricanes, resilience requires a real focus on building materials and methods.  FM, a mutual insurer for commercial, industrial properties, has a special research campus in Rhode Island where teams of engineers test and certify materials and systems designed to withstand all kinds of perils.\"We're an engineering company that does insurance,\" Malcolm Roberts, the CEO of FM, told CNBC in an interview. \"We will not sell our insurance capacity without the engineering, and we will not sell our engineering without the insurance.\" FM's engineers have developed large-scale tests to simulate things like a Category 2 hurricane, severe hailstorms, wildfires, earthquakes and even dust explosions.FM employs nearly 2,000 engineers who work with each client to identify specific risks and then implement resilience solutions, such as improving the roof and wall materials or installing flood barriers.\"They can't stop the hurricane coming, but they can prevent the damage when it does,\" Roberts said.A growing focus for the 190-year-old company is hail, which has become an increasingly expensive natural catastrophe. It's also the leading cause of damage to solar panels.FM uses a high-powered \"hail cannon\" to test the resilience of roofing materials and solar panels to see what products can withstand the impact. FM issues certifications verifying which products meet the highest standards for property loss prevention.\"We understand the hail size that's prevalent in that area, test those photovoltaic panels for those hail sizes at the right impact, and then design a test standard,\" said FM Chief Science Officer Lou Gritzo.\"The bottom line for businesses is [if you] ask for an FM-approved roof, you get a roof that you know is going to withstand the storm for your wind zone,\" he said.Investing in mitigation solutions can be pricey, but FM offers a resilience credit to help.\"[We] give 10% of the clients' premium back to them, to help them implement those solutions ... whether it's climate or fire or equipment risk,\" Roberts said.\"I'd rather our clients put that capital into risk mitigation than paying it to me in premium, because in the long run, the trade is going to work out very well for both,\" he added.Insurer Hippo similarly offers its insurance customers advice on mitigation efforts like automatic or remote shutoffs for gas, water and appliances. USAA actively reached out to 3 million members in 2025 to coach them in protecting their properties, the insurer said.   \"Our members are participating in loss mitigation programs with us, whether it's on water flow leakage valves or electronic device that we can put in your house to detect surges, those kinds of things...all of that helps at the end of the day,\" USAA CEO Juan Andrade told CNBC. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "As catastrophe losses top $100 billion again, insurers are helping policyholders mitigate risk",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241995-1765824740181-gettyimages-2247228379-1531335-me-palisades-first-rebuilt-home-003-eat.jpeg?v=1765824767&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T12:20:01.000Z",
      "dateModified": "2025-12-16T12:20:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. halts UK tech trade deal negotiations, FT reports",
    "url": "https://www.cnbc.com/2025/12/16/us-halts-uk-tech-trade-deal-negotiations-ft-reports.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108200641-1758199061749-gettyimages-2235495876-AFP_74Y28WL.jpeg?v=1758199123&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T10:02:46.000Z",
    "description": "The U.S. has halted a technology trade deal with the U.K., after officials in Washington became frustrated with the pace of progress, the Financial Ti",
    "body": "The U.S. has halted a technology trade deal with the U.K., after officials in Washington became frustrated with the pace of progress, the Financial Times reported on Tuesday.Announced in September during President Donald Trump's state visit to the U.K., the \"technology prosperity deal\" is a sweeping agreement aimed at encouraging collaboration between the countries on tech like artificial intelligence, nuclear fusion, and quantum computing.At the time, Trump said that the deal would \"ensure our countries lead the next great technological revolution side by side.\" U.K. Prime Minister Keir Starmer said that the agreement was a \"generational step change in our relationship with the U.S.\"  that would deliver \"growth, security and opportunity up and down the country.\"Talks were suspended by the U.S. last week, the FT reported, quoting unnamed British officials.When asked to comment on the report, a U.K. government spokesperson told CNBC: \"Our special relationship with the US remains strong and the UK is firmly committed to ensuring the Tech Prosperity Deal delivers opportunity for hardworking people in both countries.\"watch nowThe agreement would establish AI-enabled research programs in areas including the development of models and datasets in mutual priorities such as AI for biotechnology, precision medicine for cancer and rare and chronic diseases, and fusion energy, the two countries said in September.It came as the U.K. signed deals totalling £31 billion ($41 billion) with U.S. tech firms like Microsoft, Nvidia, Google, OpenAI, and CoreWeave to build out the country's AI infrastructure. The U.S. is the U.K.'s largest trading partner.The U.S. Department of Commerce has been approached for comment. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. halts UK tech trade deal negotiations, FT reports",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108200641-1758199061749-gettyimages-2235495876-AFP_74Y28WL.jpeg?v=1758199123&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T10:02:46.000Z",
      "dateModified": "2025-12-16T10:02:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former iRobot CEO calls Roomba maker's bankruptcy 'a tragedy for consumers'",
    "url": "https://www.cnbc.com/2025/12/15/former-irobot-ceo-calls-roomba-makers-bankruptcy-a-tragedy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241926-1765820952516-gettyimages-1148263609-338631559_1-4.jpeg?v=1765832831&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T21:23:17.000Z",
    "description": "Colin Angle, co-founder and CEO of iRobot Corp., speaks during a Prime Air delivery drone reveal event in Las Vegas, June 5, 2019.Joe Buglewicz | Bloo",
    "body": "Colin Angle, co-founder and CEO of iRobot Corp., speaks during a Prime Air delivery drone reveal event in Las Vegas, June 5, 2019.Joe Buglewicz | Bloomberg | Getty ImagesColin Angle, co-founder and former CEO of iRobot, on Monday said the company's move to declare bankruptcy was \"profoundly disappointing\" and \"nothing short of a tragedy for consumers.\"The robotic vacuum pioneer announced Sunday that it filed for bankruptcy and will be taken private by Shenzhen Picea Robotics, a lender and key supplier, following years of financial struggles.\"Today's outcome is profoundly disappointing — and it was avoidable,\" Angle told CNBC in a statement. \"This is nothing short of a tragedy for consumers, the robotics industry and America's innovation economy.\"In a Sunday court filing, iRobot said it had between $100 million and $500 million of assets and liabilities. The company said it owes almost $100 million to its new owner Picea, more than $5.8 million to GXO Logistics and roughly $3.4 million to U.S. Customs and Border Protection for unpaid tariffs, among other liabilities.Shares of iRobot plunged more than 72% on Monday.watch nowFounded in 1990 by Angle and two other researchers at the Massachusetts Institute of Technology, iRobot got its start making military and defense tech for the government before launching its flagship Roomba product in 2002 that cemented it as an early leader in the robotic vacuum cleaner market. The company's future has remained uncertain after Amazon abandoned its planned $1.7 billion acquisition of the company in January 2024, citing regulatory scrutiny from the European Union and the U.S. Federal Trade Commission. Afterward, iRobot laid off 31% of staff and Angle announced he would step down as CEO and board chair. Amazon CEO Andy Jassy called regulators' efforts to block the deal a \"sad story\" and said it would've given iRobot a competitive boost against rivals. The Amazon acquisition was \"the most viable path\" for iRobot to compete globally, Angle said Monday. He added that iRobot's bankruptcy serves as a \"warning\" for competition watchdogs. Helen Greiner, one of iRobot's co-founders, said in a Monday LinkedIn post that the company's restructuring plan under a Chinese owner isn't good for \"consumers, employees, stockholders, Massachusetts or the USA.\" The company had been facing growing competition from cheaper, rapidly growing rivals, such as China-based Anker, Ecovacs and Roborock. Supply chain constraints in recent years added further strain to iRobot's business, as it struggled to navigate shipping and inventory delays, which dented its revenue.Its financial outlook darkened significantly after the Amazon deal fell apart, and in October, iRobot said it would be forced to seek bankruptcy protection if it failed to secure more capital or find a buyer.Gary Cohen, iRobot CEO, said in a statement Monday that the restructuring plan would help secure the company's \"long-term future.\" The bankruptcy proceedings aren't expected to disrupt its products' functionality or customer support, iRobot said. The company's third-quarter sales came in at $145.8 million, down almost 25% from $193.4 million one year earlier, and iRobot has about $190 million in debt. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former iRobot CEO calls Roomba maker's bankruptcy 'a tragedy for consumers'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241926-1765820952516-gettyimages-1148263609-338631559_1-4.jpeg?v=1765832831&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T21:23:17.000Z",
      "dateModified": "2025-12-15T21:23:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zillow shares are getting crushed. Here's why",
    "url": "https://www.cnbc.com/2025/12/15/zillow-shares-are-getting-crushed-heres-why.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106943512-1631888926139-gettyimages-1232667332-ZILLOW_EARNS.jpeg?v=1765828785&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T22:49:41.000Z",
    "description": "The stock market graphic of Zillow Group is displayed on a smartphone with the logo of Zillow in the background on Feb. 21, 2021.Sopa Images | Lightro",
    "body": "The stock market graphic of Zillow Group is displayed on a smartphone with the logo of Zillow in the background on Feb. 21, 2021.Sopa Images | Lightrocket | Getty ImagesZillow shares plunged more than 9% on Monday on worries that the online real estate platform could have a big new competitor: Google Search. Google appears to be running tests on putting real estate sale listings into its search results. Over the weekend, real estate tech strategist Mike DelPrete published mobile phone screenshots of Google Search results showing real estate listings, which appeared to be powered by real estate data company HouseCanary. The listings enabled users to view the full details of a property's page, request a tour and contact an agent — similar to the functions offered on Zillow.com's online marketplace portal. Google's home searches appear to work only in select markets and on mobile devices as testing is underway.The decline in Zillow signals investors are bracing for the eventual impact of Google's foray into the real estate market. The company, which saw shares drop more than 11% at one point during Monday's session, lost about $1.6 billion in market cap. Zillow's market cap now sits at about $16.26 billion.However, Wall Street analysts were quick to point out that Zillow's exposure to organic search is fairly small, limiting potential downside at least in the near term as more details around Google's product come to light. Wells Fargo analyst Alec Brondolo, who has an equal weight rating on Zillow, said he would not \"expect a meaningful financial impact from listings on Google shifting from organic to paid\" — given that Zillow is not overly dependent on organic search results for traffic.\"The listings product appears similar to Google Hotel Metasearch results; introduction could increase traffic cost to Zillow, but disintermediation unlikely,\" Brondolo said in a Monday note to clients. \"In the hotel category, Google merchandises hotel rooms in search results as a metasearch ad product for OTAs. We would expect a similar approach in real estate, with Zillow, Homes.com, Realtor.com, etc. bidding for home listing ad units rather than Google attempting to monetize directly with an ad product sold to agents.\"Stock Chart IconStock chart iconZillow stock over the past year.But some analysts see Google's testing as a longer-term headwind to Zillow and other online real estate portals.Goldman Sachs' Michael Ng wrote in a note to clients that he believes the search engine's real estate listings, which he said are an advertising format for buy-side agents, directly compete with Zillow's Premier Agent program by \"facilitating lead generation\" for agents from prospective buyers.\"While we don't expect a direct near-term impact on Zillow's business, given that most of Zillow's traffic is direct (e.g., Zillow.com, StreetEasy.com, mobile apps) and Google's new product is currently limited to select markets and mobile browsers, we view this development as a long-term risk for real estate portals like Zillow,\" Ng, who remains neutral on Zillow, wrote in a note to clients. Jason Helfstein of Oppenheimer said that Google's expansion into real estate could impact the number of consumers going to Zillow.com — which was 228 million in the third quarter — and therefore could take a hit on the company's ability to monetize its platform. \"The impact would likely take years to play out and would need to be rolled out across the US to meaningfully impact real estate portal traffic,\" Helfstein said in a recent note.Zillow shares are down more than 8% year to date. Neither Google nor Zillow responded immediately to CNBC's request for comment. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zillow shares are getting crushed. Here's why",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106943512-1631888926139-gettyimages-1232667332-ZILLOW_EARNS.jpeg?v=1765828785&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T22:49:41.000Z",
      "dateModified": "2025-12-15T22:49:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frontier Airlines replaces CEO Barry Biffle with carrier's president",
    "url": "https://www.cnbc.com/2025/12/15/frontier-airlines-replaces-ceo-biffle-with-carriers-president.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242120-1765834589888-gettyimages-2237950418-US_AIRLINE_COMPETITION.jpeg?v=1765839144&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T22:56:52.000Z",
    "description": "Barry Biffle, president and CEO of Frontier Airlines, prior to a Senate Judiciary Subcommittee on Antitrust, Competition Policy and Consumer Rights he",
    "body": "Barry Biffle, president and CEO of Frontier Airlines, prior to a Senate Judiciary Subcommittee on Antitrust, Competition Policy and Consumer Rights hearing in Washington, Sept. 30, 2025.Kent Nishimura | Bloomberg | Getty ImagesFrontier Group Holdings, the parent company of budget airline Frontier, replaced its nearly decade-long CEO, Barry Biffle, with the carrier's president, the company said Monday.James Dempsey is taking over as interim CEO effective immediately.\"Jimmy has been an invaluable member of Frontier's senior leadership team for more than 10 years and has played an instrumental role in the company's evolution and growth during that time,\" Board Chair Bill Franke said in a news release. \"We believe Jimmy is uniquely qualified to guide our airline into the future.\" Biffle and Frontier declined to comment. Frontier said Biffle would stay on in an \"advisory capacity\" until the end of the year.Biffle had been Frontier's chief executive since March 2016 and has a more than three-decade career in airlines, including at the country's longtime top budget carrier, Spirit, which is currently in its second bankruptcy in less than a year.Frontier lost $190 million in the first nine months of the year, compared with net income of $31 million a year earlier.Frontier had been in talks to merge with Spirit several times since early 2022, but none have solidified thus far.watch nowSmaller budget airlines like Frontier have struggled to produce steady profits in the wake of the pandemic, as higher labor and other costs, consumer tastes shifting to international travel and higher-end seats, and an oversupply of domestic capacity have hurt financial results.Biffle led some of Frontier's initiatives in recent months to cater to customers seeking more space on board. Frontier's shares are down nearly 19% so far this year, while the NYSE Arca Airline Index, which tracks mostly U.S. airlines, is up more than 6%.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frontier Airlines replaces CEO Barry Biffle with carrier's president",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242120-1765834589888-gettyimages-2237950418-US_AIRLINE_COMPETITION.jpeg?v=1765839144&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T22:56:52.000Z",
      "dateModified": "2025-12-15T22:56:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Startup backed by Altman, JPMorgan announces capital lending partnership with Amazon",
    "url": "https://www.cnbc.com/2025/12/16/slope-sam-altman-jpmorgan-amazon.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236192-1764791521714-gettyimages-2249804401-l1040078_copy_eodigrqe.jpeg?v=1764791602&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T11:00:02.000Z",
    "description": "Amazon gift cards are offered for sale at a Walgreens store on December 03, 2025 in Chicago, Illinois. Scott Olson | Getty ImagesSlope, a lending star",
    "body": "Amazon gift cards are offered for sale at a Walgreens store on December 03, 2025 in Chicago, Illinois. Scott Olson | Getty ImagesSlope, a lending startup that uses artificial intelligence to vet businesses, is partnering with Amazon starting Tuesday to provide a reusable line of credit to Amazon sellers, backed by a JPMorgan Chase credit facility, the company told CNBC exclusively. The new relationship means eligible U.S. Amazon vendors can apply for and access capital directly through their Amazon Seller accounts with real-time approvals. Slope was co-founded by CEO Lawrence Lin Murata, who said said he saw the ups and downs of running a small business while he was growing up in São Paulo.Lin Murata helped his parents at their family's toy shop, which they've been running for more than three decades. As he gained more insight into the finances of the business, he said he realized that cash flow was a large pain point for his parents and other small businesses. That led him to start Slope, an AI-powered lending platform backed by OpenAI CEO Sam Altman and JPMorgan Chase, with co-founder Alice Deng.\"Leveraging AI, we're able to underwrite these businesses, and we're able to handle all the complexity of assessing the risk for a business,\" Lin Murata said. \"At the same time, [we're] providing a very easy, real-time experience to them.\"The lines of credit will start at an 8.99% APR, according to Slope, and require  vendors to be in business for at least one year with more than $100,000 in annual revenue. Once approved, Amazon sellers can draw from the line as needed and choose a term ranging from three months to a year to align repayment with their inventory cycle. Scope did not disclose the financial aspects of its deal with Amazon.\"Most people don't realize that sellers, independent sellers, are kind of the backbone of Amazon and e-commerce in general,\" Deng told CNBC. \"More than 60% of Amazon's sales are driven by independent sellers.\"Deng said Slope is filling a gap with the new partnership. Currently, Amazon sellers can use some third parties to access capital, though Deng said those initiatives are more focused on smaller sellers, while Slope is focused on mature sellers, some of whom reach hundreds of millions of dollars in revenue and require bank-grade financing. Deng said when Amazon did its own lending around four years ago, the total addressable market was between $1 billion and $2 billion. With Slope taking over the program, the company expects that number to grow. \"We're excited about our work with Slope, which expands the financing tools available to Amazon selling partners,\" an Amazon spokesperson told CNBC. \"Whether they are just starting out or looking to grow, access to sufficient capital is a critical need for small business owners, and we're always evaluating new ways to empower sellers to thrive in the Amazon store.\"With Slope's new deal, sellers can take a few minutes directly on Amazon Seller Central to apply for capital and get approved almost instantly, using proprietary Amazon performance data and Slope's in-house large language model, Lin Murata said.\"That is one of the reasons why we're able to give a more compelling offer than if you were outside of the Amazon dashboard,\" Lin Murata said. \"And then we give real-time decisions, so we analyze Amazon performance, data, and cash flow in real time.\"It's a process that the Slope co-founders said is easier, faster and more integrated than having to apply for loans at banks as a small business. With the granular data that Amazon provides, like a breakdown of sales by product, they said the AI model is able to make a more informed decision on financing than a bank would based on overall financial documents.With the new deal, Amazon joins a growing slate of Slope's customers, which already include Samsung, Alibaba, Ikea and more. Deng and Lin Murata said the company has trialed the new Amazon integration, and though the trial has been live for just a few weeks, the pair said it's seen significant demand and applications growing 300% week over week.\"Going back to the initial inspiration of my parents, I think we want to be the credit intelligence layer for these businesses,\" Lin Murata said. \"Ultimately, what we're really doing is helping these businesses grow by giving them fair, affordable, fast and very easy access to different forms of financing.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Startup backed by Altman, JPMorgan announces capital lending partnership with Amazon",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236192-1764791521714-gettyimages-2249804401-l1040078_copy_eodigrqe.jpeg?v=1764791602&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T11:00:02.000Z",
      "dateModified": "2025-12-16T11:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "PayPal applies to form bank that can offer small business loans and savings accounts",
    "url": "https://www.cnbc.com/2025/12/15/paypal-seeks-us-approval-to-form-bank-offer-small-business-loans.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242128-1765835737899-gettyimages-2239332788-aditya-notitle251007_npT89.jpeg?v=1765835816&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T22:11:08.000Z",
    "description": "PayPal CEO Alex Chriss speaks at the Global Fintech Fest in Mumbai, India, on Oct. 7, 2025.Indranil Aditya | Nurphoto | Getty ImagesPayPal said Monday",
    "body": "PayPal CEO Alex Chriss speaks at the Global Fintech Fest in Mumbai, India, on Oct. 7, 2025.Indranil Aditya | Nurphoto | Getty ImagesPayPal said Monday that it has applied for approval to form PayPal Bank, which would be able to offer loans to small businesses.\"Establishing PayPal Bank will strengthen our business and improve our efficiency, enabling us to better support small business growth and economic opportunities across the U.S.,\" PayPal CEO Alex Chriss said in a statement.The U.S. Federal Deposit Insurance Corporation will review an application proposing the establishment of PayPal Bank, along with Utah's Department of Financial Institutions, PayPal said. The company, which owns popular payment app Venmo, hopes to also offer interest-bearing savings accounts to its customers, the statement said. PayPal already makes credit lines available to consumers and has been trying to expand its roster of banking-like services as it competes with a growing number of fintech companies that are aiming to take business from traditional brick-and-mortar banks.Shares of PayPal rose 1.5% in extended trading following the announcement. In October, PayPal said quarterly revenue increased 7% year over year to $8.42 billion, more than analysts had expected. But in 2025 the stock has slumped about 29%, while the S&P 500 index has gained almost 16% in the same period.WATCH: E-commerce consumption could bump 20% because of agentic AI, says Mizuho's Dan Dolevwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "PayPal applies to form bank that can offer small business loans and savings accounts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242128-1765835737899-gettyimages-2239332788-aditya-notitle251007_npT89.jpeg?v=1765835816&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T22:11:08.000Z",
      "dateModified": "2025-12-15T22:11:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Merriam-Webster declares 'slop' its word of the year in nod to growth of AI",
    "url": "https://www.cnbc.com/2025/12/15/merriam-webster-declares-slop-word-of-the-year-nod-to-growth-of-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108066595-1732225390680-gettyimages-2185274854-avils-notitle241121_npPeq.jpeg?v=1765837211&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T22:44:01.000Z",
    "description": "The logos of Google Gemini, ChatGPT, Microsoft Copilot, Claude by Anthropic, Perplexity, and Bing apps are displayed on the screen of a smartphone in ",
    "body": "The logos of Google Gemini, ChatGPT, Microsoft Copilot, Claude by Anthropic, Perplexity, and Bing apps are displayed on the screen of a smartphone in Reno, United States, on November 21, 2024.Jaque Silva | Nurphoto | Getty ImagesMerriam-Webster declared \"slop\" its 2025 word of the year on Monday, a sign of growing wariness around artificial intelligence.Slop is now defined as \"digital content of low quality that is produced usually in quantity by means of artificial intelligence,\" according to Merriam-Webster's dictionary. The word has previously been used primarily to connote a \"product of little value\" or \"food waste fed to animals\" Mainstream social networks saw a flood of AI-generated content, including what 404 Media described as a \"video of a bizarre creature turning into a spider, turning into a nightmare giraffe inside of a busy mall,\" that the publication reported had been viewed more than 362 million times on Meta apps. In September, Meta launched Vibes, a separate feed for AI-generated videos. Days later, OpenAI released its Sora app. Those services, along with TikTok, YouTube and others, are increasingly rife with AI slop, which can often generate revenue with enough engagement. Spotify said in September that it had to remove over 75 million AI-generated, \"spammy tracks\" from its service, and roll out formal policies to protect artists from AI impersonation and deception. The streaming company faced widespread criticism after The Velvet Sundown racked up 1 million monthly listeners on without initially making it clear they produced their songs with generative AI. The artist later clarified on its bio page that it's a \"synthetic music project.\"According to CNBC's latest All-America Economic Survey, published Dec. 15, fewer respondents have been using AI platforms, such as ChatGPT, Microsoft Copilot and Google Gemini, in the last two to three months compared to the summer months. Just 48% of those surveyed said they had used AI platforms recently, down from 53% in August. WATCH: OpenAI's Sora 2 sparks AI 'slop' backlashwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Merriam-Webster declares 'slop' its word of the year in nod to growth of AI",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108066595-1732225390680-gettyimages-2185274854-avils-notitle241121_npPeq.jpeg?v=1765837211&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T22:44:01.000Z",
      "dateModified": "2025-12-15T22:44:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Trump tariffs collection hits $200 billion, Customs says",
    "url": "https://www.cnbc.com/2025/12/15/trump-tariffs-trade-customs-imports.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241889-1765817394994-gettyimages-2251771532-ps1_2948_kudhsh8l.jpeg?v=1765834031&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-15T21:31:59.000Z",
    "description": "President Donald Trump smiles from the field before the 126th America's Game between the Army Black Knights and the Navy Midshipmen at M&T Bank Stadiu",
    "body": "President Donald Trump smiles from the field before the 126th America's Game between the Army Black Knights and the Navy Midshipmen at M&T Bank Stadium in Baltimore, Dec. 13, 2025.Patrick Smith | Getty ImagesThe United States has collected more than $200 billion in tariffs this year as a result of new duties imposed by President Donald Trump since the beginning of 2025, the Customs and Border Protection agency said Monday.The tally comes as the Supreme Court considers arguments that the new tariffs are illegal. The $200 billion tally is only for the new tariffs, not for tariffs imposed during Trump's first term in the White House. Those earlier tariffs do not face legal challenges, as the new tariffs do.Trump earlier this year unilaterally imposed, without congressional authorization, what he calls reciprocal tariffs on imports from most of the world's nations. He also imposed \"fentanyl tariffs\" on products from Canada, China and Mexico, in retaliation for what he said was those countries' failure to stem the flow of that deadly narcotic into the United States.A container ship at the Port of Long Beach in California, Sept. 9, 2025.Apu Gomes | Getty Images News | Getty Images\"Between Jan. 20 and Dec. 15, 2025, U.S. Customs and Border Protection collected more than $200 billion in tariffs thanks to more than 40 executive orders put in place by President Donald Trump's Administration,\" CBP said, in a statement. \"This figure underscores CBP's effectiveness in promoting secure, fair, and compliant trade, strengthening America's national and economic security.\"In November, tariff collections declined for the first time since Trump announced his broad new tariffs in April. The government collected $30.75 billion in tariffs last month, a slight drop from the $31.15 billion collected in October.Read more CNBC politics coverageTrump sues BBC for $5 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationThe drop comes as freight shipments to the United States have slowed in the face of the tariffs and as Trump has lowered some of the duties.\"CBP's enforcement delivers results,\" said CBP Commissioner Rodney Scott, in a statement.\"By combining intelligence-led targeting, rigorous oversight and swift action, we are safeguarding the U.S. economy, protecting American industries and holding accountable those who seek to break our trade laws,\" Scott said.If the Supreme Court rules that Trump's new tariffs are illegal, it is possible the court could say that companies that have paid the duties so far are entitled to refunds.The U.S. Court of Appeals for the Federal Circuit, in a 7-4 ruling in August, upheld a decision by the Court of International Trade that found Trump did not have the power to impose the tariffs without the consent of Congress.\"The core congressional power to impose taxes such as tariffs is vested  exclusively in the legislative branch by the Constitution,\" the Federal  Circuit said in its ruling. \"Tariffs are a core congressional power.\"In late November, the warehouse club retail giant Costco joined a group of other companies suing the Trump administration to obtain a full refund of the tariffs they have paid so far this year, and asked a court to block the duties from continuing to be collected as the Supreme Court case plays out.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Trump tariffs collection hits $200 billion, Customs says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241889-1765817394994-gettyimages-2251771532-ps1_2948_kudhsh8l.jpeg?v=1765834031&w=1920&h=1080"
      ],
      "datePublished": "2025-12-15T21:31:59.000Z",
      "dateModified": "2025-12-15T21:31:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump doubles down on Rob Reiner criticism after killing; director's son in custody",
    "url": "https://www.cnbc.com/2025/12/15/rob-reiner-death-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241815-1765811816631-gettyimages-2235654496-_jjj8998_e43ehbcm.jpeg?v=1765811864&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T00:10:14.000Z",
    "description": "Rob Reiner discusses the story of \"Spinal Tap\" at 92NY on September 15, 2025 in New York City. John Lamparski | Getty Images Entertainment | Getty Ima",
    "body": "Rob Reiner discusses the story of \"Spinal Tap\" at 92NY on September 15, 2025 in New York City. John Lamparski | Getty Images Entertainment | Getty ImagesPresident Donald Trump slammed Rob Reiner on Monday morning, a day after the famed Hollywood director and his wife, Michele Singer Reiner, were found brutally slain in their Los Angeles home.Trump's social-media screed against Reiner, who was a staunch critic of the president, came as the Reiners' 32-year-old son Nick was arrested and held on $4 million bond, according to LA County Sheriff's Department jail records. Nick Reiner was booked on suspicion of murder.Trump suggested that the couple was killed because of \"the anger\" Rob Reiner caused in other people due to his opposition to the Republican president. However, there is no evidence to suggest that this is the case, and the police have not provided any motive.Trump, during comments to reporters later, doubled down and expanded on criticism of Reiner, even after a number of Republicans said that he was wrong to do so.\"He was a deranged person as far as Trump is concerned,\" Trump said.The president accused Reiner of promoting \"the Russian hoax,\" saying \"that I was a friend of Russia, controlled by Russia.\"\"He was one of the people behind it,\" Trump said. \"So I was not a fan of Rob Reiner at all in any way, shape, or form. I thought he was very bad for our country.\"Read more CNBC politics coverageTrump sues BBC for $5 billion, claims defamation from Panorama documentaryPentagon takes big stake in new Korea Zinc refinery in Tenn., gets 10% of companyNew Trump tariffs collection hits $200 billion, Customs saysFormer Instacart employee says she was fired over her Democratic congressional campaignUkraine peace talks progressing, Russia open to EU membership, U.S. officials sayNew York AG sues UPS for allegedly shorting Christmas season workers' wagesTrump admin to hire 1,000 specialists for 'Tech Force'Trump doubles down on Rob Reiner criticism after killing; director's son in custodyTSA is giving airline passenger data to ICE for deportation push: NYTTrump's AI order may be 'illegal,' Democrats and consumer advocacy groups claimTrump sued by preservation group seeking to halt White House ballroom projectTrump says 'no big deal' after new Epstein photos showing him releasedPutin can fund war for years, ex-official says as Trump's resolve is testedIndiana redistricting bill that Trump demanded defeated in state SenateHouse passes INVEST Act to ease investment standards, boost capital in marketsDOJ fails again to indict New York AG James, a Trump target: ReportsTrump 'sells out' U.S. national security with Nvidia chip sales to China: WarrenTrump pushes for top prosecutor nominee Halligan after Comey, James cases tossedTrump willing to seize more oil tankers off Venezuela coast: White HouseSeized tanker will go to U.S. port, Trump admin intends 'to seize the oil'GOP lawmakers seek Trump aid for agricultural equipment after tariff pressureTrump says Fed could have 'at least doubled' latest interest rate cut'Spoof' ship: Seized oil tanker hid location, visited Iran and VenezuelaTrump admin touts pulling 9,500 truckers off road for failing English testsSwiss government says new 15% U.S. tariff ceiling retroactive to mid-NovemberHomeland Security Dept. buying Boeing 737s for ICE deportationsTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationEarlier Monday, Trump wrote on Truth Social, \"A very sad thing happened last night in Hollywood.\"\"Rob Reiner, a tortured and struggling, but once very talented movie director and comedy star, has passed away, together with his wife, Michele, reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME, sometimes referred to as TDS,\" Trump wrote.\"He was known to have driven people CRAZY by his raging obsession of President Donald J. Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness, and with the Golden Age of America upon us, perhaps like never before,\" the president wrote. \"May Rob and Michele rest in peace!\"(L-R) Director Rob Reiner and his son Nick Reiner attend AOL Build Presents: \"Being Charlie\"  at AOL Studios In New York on May 4, 2016 in New York City.  Rommel Demano | Getty ImagesSenate Minority Leader Chuck Schumer, in a social media post, said of Trump's comments: \"He knows no shame. A total jackass.\"Trump's former lawyer, Jenna Ellis, in a social media post wrote of Trump: \"A man and his wife were murdered last night. This is NOT the appropriate response.\"\"The Right uniformly condemned political and celebratory responses to Charlie Kirk's death,\" Ellis wrote. \"This is a horrible example from Trump (and surprising considering the two attempts on his own life) and should be condemned by everyone with any decency.\"Rep. Don Bacon, a Nebraska Republican, told CNN, \"I'd expect to hear something like this from a drunk guy at a bar, not the president of the United States. Can the president be presidential?\"Rep. Thomas Massie, a Kentucky Republican, also called out Trump for his post.\"Regardless of how you felt about Rob Reiner, this is inappropriate and disrespectful discourse about a man who was just brutally murdered,\" Massie wrote on X.\"I guess my elected GOP colleagues, the VP, and White House staff will just ignore it because they're afraid? I challenge anyone to defend it,\" he added.Massie has been targeted by Trump for months after co-sponsoring a petition in the House that led to passage of a law directing the Justice Department to release its investigative files about notorious sex predator Jeffrey Epstein and his accomplice Ghislaine Maxwell. Trump, who was previously friends with Epstein, had opposed that law until the last minute.U.S. President Donald Trump looks on before departing for the Army/Navy football game in Baltimore, at the White House in Washington, D.C., U.S., December 13, 2025. Aaron Schwartz | ReutersAnother House Republican who has fallen out with Trump, Rep. Marjorie Taylor Greene of Georgia, in a post replying to the president on X, said, \"This is a family tragedy, not about politics or political enemies.\"\"Many families deal with a family member with drug addiction and mental health issues,\" Greene wrote. \"It's incredibly difficult and should be met with empathy especially when it ends in murder.\" Greene last month said she will resign her seat effective Jan. 5 because of her falling out with Trump.Reiner blasted Trump in an MS Now interview in October.\"Make no mistake; we have a year before this country becomes a full-on autocracy, and democracy completely leaves us,\" Reiner said in that interview.\"And we're  looking at the election in 2026, and Donald Trump knows that in a free  and fair election, he will lose,\" Reiner said. \"He will lose the House, the House will  flip and will become in Democratic hands. There will be committee chairs  who will be able to hold meetings, and this is the last thing he  wants.\"Reiner's movies included \"This is Spinal Tap,\" \"The Princess Bride,\" \"When Harry Met Sally,\" and \"A Few Good Men.\"He first gained fame as playing the son-in-law of Archie Bunker on the classic television show \"All in the Family.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump doubles down on Rob Reiner criticism after killing; director's son in custody",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241815-1765811816631-gettyimages-2235654496-_jjj8998_e43ehbcm.jpeg?v=1765811864&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T00:10:14.000Z",
      "dateModified": "2025-12-16T00:10:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ford to record $19.5 billion in special charges related to EV pullback",
    "url": "https://www.cnbc.com/2025/12/15/ford-ev-pullback.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214455-17609973122025-10-20t215148z_1001305606_rc2wfhayx4gr_rtrmadp_0_ford-results.jpeg?v=1760997355&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-16T00:28:37.000Z",
    "description": "watch nowDETROIT — Ford Motor expects to record about $19.5 billion in special items related to a restructuring of its business priorities and a pullb",
    "body": "watch nowDETROIT — Ford Motor expects to record about $19.5 billion in special items related to a restructuring of its business priorities and a pullback in its all-electric vehicle investments, the company announced Monday.The Detroit automaker said most of those charges will occur during the fourth quarter. That will be followed by $5.5 billion in cash to be charged through 2027, and the majority of that chunk will be paid next year, Ford said.The charges will impact the automaker's net results but not its adjusted earnings. The automaker said Monday it was increasing its guidance of adjusted earnings before interest and taxes to about $7 billion in 2025. That's in line with a target from earlier this year, before the company lowered expectations to between $6 billion and $6.5 billion in adjusted EBIT in October.The charges announced Monday, including $8.5 billion in write-downs of EV assets, are connected to major changes to Ford's business plans. The new plans include refocusing investments on hybrid vehicles, including plug-in models rather than pure EVs; canceling a next generation of large all-electric trucks in exchange for smaller, more affordable EVs; and a rebalancing of its investments in core products such as trucks and SUVs.The changes are the latest under Ford CEO Jim Farley and his \"Ford+\" restructuring plan that has taken on many different forms since he initially announced it as an EV growth plan in 2021. \"We evaluated the market, and we made the call,\" Farley told CNBC's \"Closing Bell Overtime\" on Monday. \"We're following customers to where the market is, not where people thought it was going to be, but where it is today.\"Stock Chart IconStock chart iconFord, GM and Stellantis stocks.The EV segment has experienced a sales slump domestically after the Trump administration put an early end in September to a $7,500 federal tax credit previously available for EV buyers in the U.S. Farley said on CNBC that policy \"wasn't the only reason why we made this choice,\" but he acknowledged it did play a role. Ford also said Monday that its all-electric F-150 Lightning pickup will transition to an extended-range EV, or EREV, that includes an electric powertrain as well as a gas-powered generator, and it announced plans to use battery plants in Kentucky and Michigan for a new stationary energy storage business.\"The last couple of months have been really clear to us,\" Farley told CNBC's Phil LeBeau. \"The very high-end EVs — the $50,000, $70,000, $80,000 vehicles — they just weren't selling.\"Ford said the changes are expected to provide \"a path to profitability\" for its Model e electric vehicle business by 2029, targeting annual improvements beginning in 2026. The automaker also said it expects the changes to improve profits in its traditional Ford Blue unit and Ford Pro commercial and fleet business \"over time with early signs of benefits in 2026.\"The automaker said it expects approximately 50% of its global volume by 2030 will be hybrids, EREVs and fully electric vehicles, up from 17% in 2025.\"These are big decisions that we believe will pay off for years to come for our customers, our employees, American jobs and manufacturing,\" Andrew Frick, president of the Model e and Blue businesses, said Monday during a media call. \"Ford is following the customer. We are looking at the market as it is today, not just as everyone predicted it to be five years ago.\"Ford said it will concentrate its North American electric vehicle development on its new, low-cost, flexible Universal EV Platform that's expected to underpin a \"high-volume family of smaller, highly efficient and affordable electric vehicles.\"The first vehicle from the new platform will be a \"fully connected midsize pickup truck\" assembled at the company's Louisville Assembly Plant starting in 2027.The company also expects its new storage business to be producing and shipping units by 2027 for things such as \"data centers, the electric gird and much more,\" Frick said.\"This is a compelling opportunity. It's a market with huge potential and strong demand,\" he said. \"We will have 20 gigawatt hours of annual capacity for this market.\"Ford stock rose about 2% in after-hours trading Monday.Shares of Ford closed Monday at $13.65, down less than 1%. Ford stock as of Monday's close was up nearly 40% this year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ford to record $19.5 billion in special charges related to EV pullback",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214455-17609973122025-10-20t215148z_1001305606_rc2wfhayx4gr_rtrmadp_0_ford-results.jpeg?v=1760997355&w=1920&h=1080"
      ],
      "datePublished": "2025-12-16T00:28:37.000Z",
      "dateModified": "2025-12-16T00:28:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]