[
  {
    "title": "They met on Tinder when they were 19. Now, they're married and run a cake business that brings in over $650,000 a year",
    "url": "https://www.cnbc.com/2025/11/09/this-gen-z-couple-runs-a-650000-a-year-celebrity-cake-business.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222167-1762406078548-Cake_Inspiration.jpg?v=1762406228&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-09T04:03:58.000Z",
    "description": "Kai Yang Chan (left) and JiaYi Zhou (right) run Singapore-based bakery Cake Inspiration.Courtesy of Cake InspirationWhen Kai Yang Chan and Jiayi Zhuo ",
    "body": "Kai Yang Chan (left) and JiaYi Zhou (right) run Singapore-based bakery Cake Inspiration.Courtesy of Cake InspirationWhen Kai Yang Chan and Jiayi Zhuo matched on Tinder at age 19, neither of them expected that it would lead to marriage. Six years later, not only have they tied the knot — they're also business partners.\"I downloaded Tinder because I was very bored in school, so I was just [swiping] through during class,\" said Zhuo. \"Both of us — we didn't expect that we'd get together,\" she said.\"Personality wise, we are quite different,\" she said, adding that while she is more introverted, her husband is the life of the party.Today, Chan and Zhuo run Singapore-based bakery CakeInspiration. Their business brought in over 850,000 Singapore dollars (about $650,000) in 2024, and is on track to surpass $775,000 in revenue this year, according to documentation reviewed by CNBC Make It.The company is known for its custom cake designs, and its clientele includes family offices, hospitals and even global celebrities.A family affairCakeInspiration originally began as a home-based bakery in 2010, run by Zhuo's parents.\"My parents actually started [the business] when I was nine,\" said Zhuo. \"I was never very studious, but I really like being hands on. So I like to bake, I like to dance. I like to create all these little pretty things,\" she said. From the early days of the business, she often helped with designing cakes.Then, when the pandemic hit, sales stalled and the business began to burn through cash to stay afloat. With her parents contemplating retirement, Zhuo knew it was time for her to step in.Courtesy of CakeInspiration\"I [felt] that it's a waste to just let it go. I [saw] my parents work like 16 hours a day growing up, so ... I [didn't] want the business to get shut down,\" she said.In 2020, Zhuo officially joined her parent's business and expanded the company's product range. She eventually introduced two new brands — Eggyi.Co, which sells bento cakes, or mini, single-serving sized cakes targeted at Gen-Z, and Petissier which sells customised cakes for pets.The introduction of these two brands ultimately helped to save the family's business through Covid, said Zhuo. Today, their prices range from about $100 to $10,000 per order, and they have a staff of about 14 people across two kitchens — one for human cakes, and one for pet cakes.Shooting for the starsSimilar to Zhuo, Chan's passions lied outside of academics growing up.\"I wasn't really the most studious person, [but] I always loved the idea of entrepreneurship and doing our own thing,\" said Chan. \"Since I was 16, I did my own little startups, selling whatever. [I sold] sneakers, I'd buy them, clean them up and sell them. You know, whatever that can make money, I'll do it,\" he said.In 2022, he decided to join his wife in the family business full-time. He introduced a new strategy: rather than only selling directly to individual consumers (B2C), he suggested trying to sell to other businesses (B2B) to create a more consistent source of revenue.In addition, he was focused on building the company's brands online. Along with working to build a presence across social media platforms, Chan started targeting celebrities and influencers who came into town.A custom made cake for social media influencers, the Ha Sisters, by CakeInspiration.Courtesy of CakeInspirationIn June, three Korean-American content creators — sisters Evelyn, Erica and Emily Ha — were in Singapore for a beauty store pop-up event. When Chan discovered they were in town, he saw an opportunity to surprise them with a cake.\"It's actually quite crazy, because they were in Singapore for this beauty store pop-up... They posted a story of them in a hotel, and I thought: 'Hey, this looks really familiar. I know [which] hotel this is,'\" he said. \"So I just prepared a cake and then we just zoomed down to the hotel.\"Chan and his team quickly made a custom cake for the sisters and timed the delivery to coincide with the end of the Ha sisters' event. \"Of course, after the pop-up, you have to go back to [the hotel to] change, right? Yeah. So [that's when I] went there,\" he said.By chance, his timing was perfect. Just as he arrived at the hotel entrance with the cake in hand, he ran into the sisters — and managed to hand-deliver the surprise. One of the Ha sisters later shared a video of the cake to social media, which ultimately reached over 500,000 views.This interaction kicked off the company's celebrity marketing strategy. To date, CakeInspiration has also delivered custom cakes to K-Pop band BlackPink's Lisa, Russell Simmons, G-Dragon and more.Despite popular advice to avoid working with your partner, for Chan and Zhuo, working together as a couple has actually been a big advantage. While Chan is best at partnerships, marketing and anything external-facing, Zhuo is best at managing day-to-day operations and all things internal.\"We don't have conflicts about work because our roles are very defined ... So usually I don't tell her how to run things inside, and she doesn't really tell me how to run things outside. I guess we trust each other to fulfill our roles to the best of our abilities,\" said Chan.Want to be your own boss? Sign up for CNBC's new online course, How To Start A Business: For First-Time Founders. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "They met on Tinder when they were 19. Now, they're married and run a cake business that brings in over $650,000 a year",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222167-1762406078548-Cake_Inspiration.jpg?v=1762406228&w=1920&h=1080"
      ],
      "datePublished": "2025-11-09T04:03:58.000Z",
      "dateModified": "2025-11-09T04:03:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China suspends some critical mineral export curbs to the U.S. as trade truce takes hold",
    "url": "https://www.cnbc.com/2025/11/10/china-suspends-some-critical-mineral-export-curbs-to-the-us-as-trade-truce-takes-hold.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108070936-1733286828300-gettyimages-1756858630-20090101231101-99-779255.jpeg?v=1733287027&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T04:03:14.000Z",
    "description": "Crystals of gallium are seen in a laboratory at Freiberg University of Mining and Technology in Saxony, Germany on 13 September 2023.Picture Alliance ",
    "body": "Crystals of gallium are seen in a laboratory at Freiberg University of Mining and Technology in Saxony, Germany on 13 September 2023.Picture Alliance | Picture Alliance | Getty ImagesChina has rolled back a number of restrictions on its export of critical minerals and rare earth materials to the United States, in a sign that a trade truce between the world's two largest economies is holding.China's Ministry of Commerce said Friday that it would suspend some export controls on critical minerals used in military hardware, semiconductors and other high-tech industries for a year.The suspended restrictions, first imposed on Oct. 9, include limits on the export of certain rare earth elements, lithium battery materials, and processing technologies.The export relaxations follow talks between U.S. President Donald Trump and Chinese President Xi Jinping in Busan, South Korea, on Oct. 30. Beijing also reversed retaliatory curbs on exports of gallium, germanium, antimony and other so-called super-hard materials such as synthetic diamonds and boron nitrides. Those measures, introduced in December 2024, were widely seen as retaliation for Washington's expanded semiconductor export restrictions on China. China classifies such materials as \"dual-use items,\" meaning they can be used for both civilian and military purposes.Beyond military applications, these critical minerals are used across the semiconductor industry and other high-tech sectors — sectors at the heart of U.S.-China trade tensions.Beijing has also suspended the stricter end-user and end-use verification checks for exports of dual-use graphite to the U.S., which were imposed in December 2024 alongside the broader export ban.China dominates global production of most critical minerals and rare earth elements and has increasingly used its export policies as leverage in trade disputes. As part of the latest China-U.S. trade deal, the U.S. has agreed to several concessions, including lowering tariffs on Chinese imports by 10 percentage points, and suspending Trump's heightened \"reciprocal tariffs\" on Chinese imports until Nov. 10, 2026.The U.S. will also postpone a rule announced Sept. 29 that would have blacklisted majority-owned subsidiaries of Chinese companies on its entity list.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China suspends some critical mineral export curbs to the U.S. as trade truce takes hold",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108070936-1733286828300-gettyimages-1756858630-20090101231101-99-779255.jpeg?v=1733287027&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T04:03:14.000Z",
      "dateModified": "2025-11-10T04:03:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump tells Senate Republicans to send federal health insurance money 'directly to the people'",
    "url": "https://www.cnbc.com/2025/11/08/trump-republicans-health-insurance.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222585-17624560132025-11-06t190319z_2013354139_rc25rha5iso8_rtrmadp_0_usa-trump.jpeg?v=1762456039&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T20:08:22.000Z",
    "description": "U.S. President Donald Trump gestures as he speaks during an event to announce a deal with Eli Lilly and Novo Nordisk to reduce the prices of GLP-1 wei",
    "body": "U.S. President Donald Trump gestures as he speaks during an event to announce a deal with Eli Lilly and Novo Nordisk to reduce the prices of GLP-1 weight‑loss drugs, in the Oval Office at the White House in Washington, D.C., U.S., November 6, 2025. Jonathan Ernst | ReutersPresident Donald Trump proposed a compromise on health insurance payments, calling on Republicans to send federal payments that would go to insurers under the Affordable Care Act directly to Americans to bring an end to the government shutdown.\"I am recommending to Senate Republicans that the Hundreds of Billions of Dollars currently being sent to money sucking Insurance Companies in order to save the bad Healthcare provided by ObamaCare, BE SENT DIRECTLY TO THE PEOPLE SO THAT THEY CAN PURCHASE THEIR OWN, MUCH BETTER, HEALTHCARE, and have money left over,\" he wrote in a Truth Social post on Saturday, without providing any details.The post comes one day after Senate Republicans rejected Democratic Minority Leader Chuck Schumer's deal that would have allowed the U.S. government to reopen after a shutdown that began Oct. 1. The shutdown is now the longest in U.S. history.The plan Democrats put forward on Friday proposed protecting federal ACA subsidies for at least one year, in exchange for dropping their demand that a longer-term extension of Obamacare tax credits be included in a stopgap government funding bill.Those subsidies, which more than 20 million Americans use, will expire at the end of December if Congress does not extend them.Read more CNBC government shutdown coverageDuffy warns air travel will be ‘reduced to a trickle’ as the shutdown drags onTrump tells Republicans to send health insurance money 'directly to the people'Food banks in ‘disaster response mode’ due to shutdown, SNAP cuts, leaders saySenate Republicans reject Democrat deal to reopen governmentDemocratic leader offers deal to reopen government but Republicans sneerTrump admin asks Supreme Court to block order it pay full SNAP benefitsSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key racesSenate Majority Leader John Thune, R-S.D., on Friday called the Democrats' proposal a \"non-starter.\"The White House did not immediately respond to a CNBC request for comment or specifics on how Trump's proposed direct payment plan would work.Representatives for Sens. Schumer and Thune did not immediately respond to a request for comment. The D.C. offices for House Speaker Mike Johnson, R-La., and House Minority Leader Rep. Hakeem Jeffries, D-N.Y., did not immediately respond to a request for comment.Congressional lawmakers have been in a stalemate, unable to find a compromise to end the shutdown. Democrats want a funding bill to include health-care subsidies that are due to expire for 24 million Americans at year's end. Republicans, meanwhile, say Congress must first pass a funding bill without strings attached and allow the government to reopen before tackling other issues.In multiple posts on Saturday, Trump also reiterated his calls for terminating the filibuster, the Senate rule requiring 60 of its 100 members to pass most legislation. The GOP holds 53 seats in the Senate. There are 45 Democratic senators, and two independents who caucus with them.Senate Republicans have pushed back on changing the rule, saying earlier this week they would not support a change. Trump had called for his party to exercise what he called \"the Nuclear Option\" on the rule.On Saturday, Trump alleged that he is \"making progress\" with Republicans on changing the rule.\"The Democrats are cracking like dogs on the Shutdown because they are deathly afraid that I am making progress with the Republicans on TERMINATING THE FILIBUSTER! Whether we make a Deal or not, THE REPUBLICANS MUST 'BLOW UP' THE FILIBUSTER,\" he wrote.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump tells Senate Republicans to send federal health insurance money 'directly to the people'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222585-17624560132025-11-06t190319z_2013354139_rc25rha5iso8_rtrmadp_0_usa-trump.jpeg?v=1762456039&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T20:08:22.000Z",
      "dateModified": "2025-11-08T20:08:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nexperia parent shares jump 6% as Beijing signals thaw in tensions with Netherlands",
    "url": "https://www.cnbc.com/2025/11/10/nexperia-parent-wingtech-shares-beijing-china-signals-thaw-in-tensions-with-netherlands-dutch-hague.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223391-1762732099400-gettyimages-2244812334-AFP_839X72A.jpeg?v=1762732114&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T02:59:38.000Z",
    "description": "This photograph shows a general view of Nexperia headquarters in Nijmegen on November 6, 2025.John Thys | Afp | Getty Images Shares of Wingtech Techno",
    "body": "This photograph shows a general view of Nexperia headquarters in Nijmegen on November 6, 2025.John Thys | Afp | Getty Images Shares of Wingtech Technology, parent company of chipmaker Nexperia, extended gains on Monday after Beijing agreed to further talks with a Dutch delegation, easing concerns about a global auto supply crunch.Shanghai-listed Wingtech Technology saw its shares jump as much as 6.4% on Monday, according to LSEG data, after surging 9.7% in the final minutes of trading last Friday on signs of de-escalation in a battle over control of the Dutch-based Nexperia.The Chinese Commerce Ministry said in a statement Sunday that it had taken steps to allow exports of certain chips from Nexperia's China facility, while urging the European Union to press the Dutch government to lift restrictions on the firm.In a separate statement on Saturday, Beijing said that it has agreed to the Dutch government's request to send representatives to Beijing for talks, and that it hoped the Netherlands would propose \"constructive solutions\" and take \"concrete actions\" to resolve the dispute over Nexperia soon.The move followed a statement from Dutch Economic Affairs Minister Vincent Karremans last Thursday, which suggested Nexperia chips would reach customers in Europe and beyond in the coming days, citing \"the constructive nature of our talks with the Chinese authorities.\"China and the U.S. had informed the Netherlands that the trade deal they struck last month would result in the resumption of supplies from Nexperia's facilities in China, Karremans said. \"This is also consistent with information provided by the European Commission by the Chinese Ministry of Commerce,\" he added.The Dutch government seized control of Nexperia on Sept. 30, citing security concerns that the company would shift its operations to China, where its parent company Wingtech is based, prompting Beijing to retaliate by blocking exports of components from Nexperia's Chinese facility.Automakers 'war room'The dispute over the ownership and control of the Dutch-based Nexperia led to worries of a global shortage of the chips widely used in industrial, computing, mobile and consumer products.Carmakers like Volkswagen warned of possible production risks, while Honda slashed its annual profit forecast after halting production at several plants.Other major automakers, including Stellantis, said they were monitoring the situation around the clock, setting up \"war rooms\" to explore alternative purchasing methods to mitigate disruptions.The recent escalation of the dispute over Nexperia was the \"direct result\" of Beijing's simmering tensions with the U.S., said Neo Wang, China strategist at Evercore ISI.watch nowWashington in late September expanded its entity list — a U.S. trade blacklist for companies seen as security or foreign policy risks — to include subsidiaries that are 50% or more owned by firms already on the list.Nexperia is one such subsidiary of Zhejiang-based communications equipment manufacturer Wingtech Technology Co., which was added to the list in December last year, Wang said.Following a trade truce struck between Beijing and Washington on Oct. 30, which led both sides to scale back some restrictions, China said earlier this month that it would allow Nexperia's China unit to resume shipments to global customers.\"Beijing appeared unwilling to gamble with bilateral relations [with the Netherlands],\" Evercore’s Neo said, as the stakes are high given that the Dutch government controls ASML Holding, the world's top supplier of advanced chipmaking equipment.Because of its unique technology, ASML has been a key focus of U.S.-China tensions, with Washington pressuring The Hague to restrict exports to China.Suppliers have begun receiving chip shipments from China, according to a note on Saturday from a team of auto and mobility analysts led by Dan Levy at Barclays. However, the analysts warned that low chip inventories could still cause disruptions in the near term.They added that the relief appeared \"temporary,\" as the core dispute between Nexperia's Dutch headquarters and its China-based operation remains unresolved.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nexperia parent shares jump 6% as Beijing signals thaw in tensions with Netherlands",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223391-1762732099400-gettyimages-2244812334-AFP_839X72A.jpeg?v=1762732114&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T02:59:38.000Z",
      "dateModified": "2025-11-10T02:59:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration demands that states 'undo' full SNAP benefit payments",
    "url": "https://www.cnbc.com/2025/11/09/snap-trump-states-food-patrick-penn.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220777-1762199988633-gettyimages-2244377423-US_GOV_FUNDING.jpeg?v=1762704539&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T04:08:57.000Z",
    "description": "A volunteer displays information on the Supplemental Nutritional Assistance Program (SNAP) at a grocery store in Dorchester, Massachusetts, US, on Mon",
    "body": "A volunteer displays information on the Supplemental Nutritional Assistance Program (SNAP) at a grocery store in Dorchester, Massachusetts, US, on Monday, Nov. 3, 2025. Mel Musto | Bloomberg | Getty ImagesThe U.S. Department of Agriculture, in a memo late Saturday evening, threatened to enact financial penalties on states that issued full monthly SNAP benefits for November if they don't \"undo\" those food stamp payments.The late-night directive from the Trump administration adds to the chaos surrounding the anti-hunger program that serves more than 42 million Americans.The memo, signed by Patrick Penn, Deputy Under Secretary of the USDA's Food, Nutrition, and Consumer Services, warned states that the administration had not cleared full SNAP benefit payments for November.\"To the extent States sent full SNAP payment files for November 2025, this was unauthorized,\" the memo said.State program administrators were directed to distribute 65% partial payments of SNAP benefits for the month instead, the memo said.States must also \"immediately undo any steps taken to issue full SNAP benefits for November 2025,\" the memo said. Failure to comply could result in the USDA cancelling the federal share of administration costs or holding states financially liable for \"any overissuances that result from the noncompliance.\"It was unclear how the USDA expects states to claw back any unauthorized SNAP payments.Sen. Amy Klobuchar, D-Minn., blasted the Trump administration's move.\"The cruelty is the point. It is their choice to do this,\" Klobuchar wrote in a post on the social media site X.The USDA and the White House did not immediately respond to CNBC's request for comment.Read more CNBC government shutdown coverageDuffy warns air travel will be ‘reduced to a trickle’ as the shutdown drags onTrump tells Republicans to send health insurance money 'directly to the people'Food banks in ‘disaster response mode’ due to shutdown, SNAP cuts, leaders saySenate Republicans reject Democrat deal to reopen governmentDemocratic leader offers deal to reopen government but Republicans sneerTrump admin asks Supreme Court to block order it pay full SNAP benefitsSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key racesThe memo was first reported by The New York Times.It comes as some states scrambled to comply with a court ruling on Thursday, when a federal judge in Rhode Island ordered the Trump administration to pay full SNAP benefits for November on Friday. The judge rejected the administration's plan to partially fund the food stamp program amid the U.S. government shutdown.The USDA subsequently told states that it would begin disbursing full SNAP benefits to comply with that order, even as the ruling faced an appeal from the Trump administration.Read more CNBC government shutdown coverageDuffy warns air travel will be ‘reduced to a trickle’ as the shutdown drags onTrump tells Republicans to send health insurance money 'directly to the people'Food banks in ‘disaster response mode’ due to shutdown, SNAP cuts, leaders saySenate Republicans reject Democrat deal to reopen governmentDemocratic leader offers deal to reopen government but Republicans sneerTrump admin asks Supreme Court to block order it pay full SNAP benefitsSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key racesThe Associated Press reported late Friday that more than half a dozen states had \"confirmed that some SNAP recipients already were issued full November payments on Friday.\"The administration asked the 1st Circuit U.S. Court of Appeals for an emergency injunction to block the order that it pay full food stamp benefits pending the outcome of its appeal of that order. A three-judge panel on the appeals court denied that request on Friday.But within hours, Supreme Court Justice Ketanji Brown Jackson temporarily paused the order. Jackson directed the 1st Circuit to quickly rule on the administration's motion to impose an indefinite stay on the lower court's order mandating full benefits.The Trump administration previously said that it would not use a contingency fund containing $4.65 billion to fund the Supplemental Nutrition Assistance Program in November.U.S. District Court of Rhode Island Judge Jack McConnell on Oct. 31 told the administration to use that fund to pay partial benefits, at least, and to explore other options to provide full benefits.The administration, days later, said it would pay 65% of the benefits, but ruled out using so-called Section 32 funds to make up the difference.The total cost of full SNAP benefits for the month is around $8 billion.The program, like other federal programs, has no currently appropriated money, as a result of Congress failing to pass a spending bill. That failure led to the U.S. government shutdown on Oct. 1. Hopes that the shutdown may be nearing an end were buoyed Sunday evening after Senate lawmakers took a critical step towards a potential deal to reopen the government, but there are no guarantees lawmakers will come to an agreement anytime soon.Past administrations have continued paying SNAP benefits during prior shutdowns.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration demands that states 'undo' full SNAP benefit payments",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220777-1762199988633-gettyimages-2244377423-US_GOV_FUNDING.jpeg?v=1762704539&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T04:08:57.000Z",
      "dateModified": "2025-11-10T04:08:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government shutdown could be headed for end as Senate passes first stage of new deal",
    "url": "https://www.cnbc.com/2025/11/09/government-shutdown-senate-democrats.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222784-1762471639497-gettyimages-2244887960-el_20251106_hill106.jpeg?v=1762471692&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T04:16:52.000Z",
    "description": "The U.S. Capitol is shown up North Capitol Street on Nov. 6, 2025 in Washington, DC.Eric Lee | Getty ImagesThe Senate late Sunday night passed the fir",
    "body": "The U.S. Capitol is shown up North Capitol Street on Nov. 6, 2025 in Washington, DC.Eric Lee | Getty ImagesThe Senate late Sunday night passed the first stage of a deal that would end the U.S. government shutdown, which began on Oct. 1.The procedural measure that allows other votes essential to the agreement to be held starting on Monday was approved with the bare minimum of 60 yes votes, after eight senators in the Democratic caucus broke with party leadership to support the deal. Forty senators voted no.Voting was held open on the Senate floor for more than two hours to allow for the arrival of the final \"aye\" vote, cast by Sen. John Cornyn, R-Texas, who flew to Washington, D.C., on Sunday evening for the proceeding.Senators broke into applause when Cornyn walked in to vote for the measure, just before 10:50 p.m. ET.The agreement, which was reached after round-the-clock negotiations over the weekend, would fund the U.S. government through the end of January.The deal does not include what had been the key demand for Democrats: an extension of enhanced Affordable Care Act tax credits, which are due to expire at the end of December.But the agreement, for the first time since the shutdown began, includes a guarantee by Republicans of a vote in December on a bill chosen by Democrats to extend those subsidies, which more than 20 million Americans use to reduce the cost of health insurance plans purchased on ACA marketplaces.The deal would need to be approved by the House of Representatives and signed into law by President Donald Trump before the shutdown ends.The deal calls for a reversal of all permanent layoffs of government employees during the shutdown and protection of such so-called reductions-in-force happening until the end of fiscal year 2026.It also guarantees that all federal workers will be paid their normal salaries during the shutdown, when many of them were not allowed to work.The package includes provisions for having a bipartisan budget process and preventing the White House from using continuing resolutions to fund the government.It would also fund, through September, the SNAP program, which helps feed 42 million Americans through food stamps.The Trump administration last week said that it would not pay SNAP benefits in November because of the shutdown, and on Friday won a temporary order from the Supreme Court blocking a federal judge's ruling mandating that full SNAP benefits be paid to recipients this month. The administration has said it will pay only partial food stamp benefits.With Cornyn not on the floor, the vote for more than 25 minutes was stuck at 56 ayes and 40 nays, with three other GOP senators, Rick Scott of Florida, Wisconsin's Ron Johnson and Mike Lee of Utah, not voting, for unclear reasons.All three eventually voted aye, in quick succession, after they spoke with Senate Majority Leader John Thune.One Republican, Rand Paul of Kentucky, voted against the measure.Read more CNBC government shutdown coverageDuffy warns air travel will be ‘reduced to a trickle’ as the shutdown drags onTrump tells Republicans to send health insurance money 'directly to the people'Food banks in ‘disaster response mode’ due to shutdown, SNAP cuts, leaders saySenate Republicans reject Democrat deal to reopen governmentDemocratic leader offers deal to reopen government but Republicans sneerTrump admin asks Supreme Court to block order it pay full SNAP benefitsSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key races\"After 40 long days, I'm hopeful that we can bring the shutdown to an end,\" said Thune, before the vote.Thune's efforts to pass a continuing resolution to reopen the government had failed in 14 prior votes before Sunday night.Thune negotiated the deal with the White House and three members of the Democratic caucus, Sens. Jeanne Shaheen and Maggie Hassan, both Democrats from New Hampshire, and independent Sen. Angus King of Maine.The other Democrats who voted for the deal were the party's whip, Dick Durbin of Illinois, Nevada's Catherine Cortez Masto and Jacky Rosen, John Fetterman of Pennsylvania, and Virginia's Tim Kaine.Sen. Bernie Sanders, a Vermont independent who caucuses with the Democrats, called the deal \"horrific\" and said that the Republicans' agreement to schedule a vote next month on the ACA credits was a \"totally meaningless gesture.King, during a press conference while the vote was still ongoing, said that he would tell his constituents that he agreed to drop the main demand of extending the ACA credit \"because it wasn't working.\" \"It's been six weeks,\" King said. \"The Republicans made it clear they weren't going to discuss the health care issue, the Affordable Care Act tax credits, until the shutdown was over.\"Would it change in a week or another week or after Thanksgiving or Christmas? And there's no evidence that it would,\" he said. \"What there is evidence of is the harm that the shutdown is doing to the country.\" Shaheen, at the same press conference, said, \"This was the only deal on the table.\"\"It was our best chance to reopen the government and immediately begin negotiations to extend the ACA tax credits that tens of millions of Americans rely on to keep costs down,\" Shaheen said.Senate Minority Leader Chuck Schumer, D-N.Y., in angry remarks on the Senate floor, said he would not vote for the deal.Schumer blasted Republicans and Trump for refusing to agree to extend the ACA credits, which he said would lead to much higher health insurance costs for millions of people in 2026.\"This health care crisis is so severe, so urgent, so devastating for families back home that I cannot, in good faith, support this [continuing resolution] that fails to address the health care crisis,\" Schumer said.Kaine, before voting to support the deal, said, \"I have long said that to earn my vote, we need to be on a path toward fixing Republicans' health care mess and to protect the federal workforce.\"\"This deal guarantees a vote to extend Affordable Care Act premium tax credits, which Republicans weren't willing to do,\" Kaine said.\"Lawmakers know their constituents expect them to vote for it, and if they don't, they could very well be replaced at the ballot box by someone who will.\"A strong majority of Americans favor extending the enhanced subsidies, which were adopted during the Covid-19 pandemic.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government shutdown could be headed for end as Senate passes first stage of new deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222784-1762471639497-gettyimages-2244887960-el_20251106_hill106.jpeg?v=1762471692&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T04:16:52.000Z",
      "dateModified": "2025-11-10T04:16:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top 10 trending destinations for U.S. travelers in 2026: 'Americans are discovering their own backyard,' expert says",
    "url": "https://www.cnbc.com/2025/11/08/best-places-to-visit-in-2026-skyscanner.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219413-1761837388617-gettyimages-1410639987-dsc03669.jpeg?v=1761837525&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T15:00:01.000Z",
    "description": "Last month, Skyscanner published its annual report of destinations around the world that are trending for 2026.To determine the ranking, Skyscanner lo",
    "body": "Last month, Skyscanner published its annual report of destinations around the world that are trending for 2026.To determine the ranking, Skyscanner looked at destinations with the biggest year-over-year increases in searches to which shows where exactly travelers are most interested in heading to in the upcoming year.Skyscanner, in partnership with OnePoll, an international market research company, surveyed 22,000 travelers from June to July 2025.Skyscanner's report found that U.S. travelers are looking to visit under-the-radar destinations.\"2025 was about collective experience and 2026 is less about the escape and more about self-expression,\" Loudres Losada, Director of Americas, Skyscanner, tells CNBC Make It.\"Travelers are searching for a place that matters and getting away from the hype and going to lesser-known places that still have a lot of value. It's about choosing the experiences more than just the destination.\"Two U.S. destinations were ranked in the top 10: Vail, Colorado, and New Haven, Connecticut. Vail saw a 78% increase, while New Haven saw a 39% increase.\"Americans are discovering their own backyard. We see these not only as winter destinations but also as summer and fall ones too,\" Losada adds.No. 1 trending destinations for U.S. travelers in 2026: Limón, Costa RicaLimón, Costa Rica, is ranked as the top-trending for U.S. travelers in 2026 It saw a 286% increase year-over-year.According to the report, Limón is an emerging ecotourism destination that is renowned for its national parks, volcanic landscapes, and lush rainforest.\"Limón is the Costa Rica for the travelers who have already done Costa Rica. Americans have been going to Costa Rica for decades now, but it's been more about the Pacific coast,\" Losada says. \"This time we're talking about the Caribbean Coast. Limón is a port city so it's very well connected, but it's also not in your traveler's guide.\"Limón, Costa RicaKryssia Campos | Moment | Getty ImagesLimón, also known as Puerto Limón, is one of Costa Rica's seven \"middle cities,\" which are major cities outside of San Jose's metropolitan area. Limón is known as one of Costa Rica's most culturally and racially diverse cities.Limón is home to the Tortuguero National Park, a vast protected area in Costa Rica and a well-known place to see sea turtles. Close by is the Cahuita National Park, a key attraction where visitors can explore pristine beaches and coral reefs. The park is also home to a variety of wildlife, including sloths, birds, and monkeys.Top trending destinations for U.S. travelers in 2026Limón, Costa RicaJaipur, IndiaBodrum, TurkeyMadeira, PortugalVail, Colo., U.S.Zadar, CroatiaOlbia, ItalyNew Haven, Conn., U.S.Bilbao, SpainMykonos, GreeceJaipur, India, ranked second among the top trending destinations, according to Skyscanner. It saw a 107% increase in search.Known as \"The Pink City\" for its terra-cotta architecture, Jaipur is home to historic landmarks like Amber Fort and modern spots like World Trade Park.\"Jaipur is capturing the attention of travelers looking for that mix of royal heritage, culture, and colorful streets that are kind of straight from a storybook,\" Losada says. \"It has a picture-perfect opportunity in every single corner.\"Jaipur, IndiaPaul Biris | Moment | Getty ImagesJaipur is a popular tourist destination in India and the capital of Rajasthan state in northwestern India. It's over 100 miles from the capital of New Delhi and a busy city with a population of over 3 million people. It is a UNESCO World Heritage site and includes several key sites, such as Jantar Mantar, an astronomical observatory built in the early 18th century.According to Google Arts & Culture, the city's economy is based on tourism, gemstone cutting, jewelry manufacturing, and information technology.Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top 10 trending destinations for U.S. travelers in 2026: 'Americans are discovering their own backyard,' expert says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219413-1761837388617-gettyimages-1410639987-dsc03669.jpeg?v=1761837525&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T15:00:01.000Z",
      "dateModified": "2025-11-08T15:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Korea's Kospi leads Asia recovery rally after AI-fueled rout last week",
    "url": "https://www.cnbc.com/2025/11/10/asia-markets-live-china-inflation-data.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223408-1762746947074-gettyimages-949983300-sunrise-busan-panorama.jpeg?v=1762746955&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-10T03:56:14.000Z",
    "description": "Panoramic view of Busan city, South Korea taken on sunrise.Alex Veprik | Moment | Getty ImagesAsia-Pacific markets traded higher Monday, after artific",
    "body": "Panoramic view of Busan city, South Korea taken on sunrise.Alex Veprik | Moment | Getty ImagesAsia-Pacific markets traded higher Monday, after artificial intelligence valuation concerns fueled declines in markets across the region last week.Investors in Asia are also parsing October inflation data from China over the weekend, which came in above expectations.Headline consumer inflation was at 0.2% year on year, compared to expectations of zero growth from economists polled by Reuters. Wholesale inflation saw a softer-than-expected drop of 2.1% year on year, against the expected 2.2% decline.South Korea's Kospi climbed nearly 3%, led by banks and insurance stocks, while the small-cap Kosdaq was 0.86% up.Japan's Nikkei 225 advanced 0.98%, while the broad-based Topix was up 0.33%. Yields of 10-year Japanese government bonds inched up to as high as 1.695%, their highest since October.On Monday, minutes from the Bank of Japan's October meeting revealed that the BOJ seemed more inclined toward a near-term rate hike, saying that \"it is likely that conditions for taking a further step toward the normalization of the policy interest rate have almost been met.\"However, the BOJ also said there were other factors to consider, such as the need to examine to what extent the \"underlying inflation rate has become entrenched.\"Hong Kong's Hang Seng index also joined the recovery rally, up 0.54%, but the CSI 300 on mainland China bucked the trend and lost 0.26%.Australia's S&P/ASX 200 gained 0.68%On Friday stateside in the U.S., the Nasdaq Composite continued to fall, but the Dow Jones Industrial Average and S&P 500 inched into positive territory after Senate Minority Leader Chuck Schumer offered up a new plan to Republicans that would enable the record-breaking U.S. government shutdown to end.A survey from the University of Michigan revealed Friday that consumer sentiment in the country has neared its lowest level ever. The data comes just a day after firm Challenger, Gray & Christmas reported that layoff announcements in October reached their highest level for the month in 22 years.—CNBC's Sean Conlon and Pia Singh contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Korea's Kospi leads Asia recovery rally after AI-fueled rout last week",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223408-1762746947074-gettyimages-949983300-sunrise-busan-panorama.jpeg?v=1762746955&w=1920&h=1080"
      ],
      "datePublished": "2025-11-10T03:56:14.000Z",
      "dateModified": "2025-11-10T03:56:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stop asking 'How was school today?' To raise successful, mentally strong kids, ask these 7 questions instead",
    "url": "https://www.cnbc.com/2025/11/09/stop-asking-how-was-school-today-to-raise-successful-kids-ask-these-questions-instead.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222410-1762443789460-GettyImages-1352579841.jpg?v=1762443860&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-09T14:30:01.000Z",
    "description": "\"My child won't tell me anything about their day!\" It's a common concern I hear from parents in my psychotherapy office. They're hoping to gain a glim",
    "body": "\"My child won't tell me anything about their day!\" It's a common concern I hear from parents in my psychotherapy office. They're hoping to gain a glimpse into their child's world. But asking \"How was school today?\" usually leads to a one-word answer.As a therapist and the author of \"13 Things Mentally Strong Parents Don't Do,\" I encourage parents to ask questions that are thoughtful and spark meaningful conversations. When kids reflect on their experiences, they practice skills like emotional awareness, problem-solving, and empathy, and develop a growth mindset.Here are seven questions that lead to productive conversations while also helping kids grow mentally stronger:1. 'What was the best part of your day?'This question encourages kids to scan their brains for positives. For children who dislike school or tend to focus on what went wrong, answering this question helps them build optimism and gratitude — which are both protective factors for mental health.Frame the question with your own experience, saying, \"The best part of my day was going for a walk during my lunch break. What about you?\" Your child might share a highlight, like, \"I played kickball at recess.\"2. 'What's a mistake you learned from today?'This one normalizes errors and celebrates healthy risk-taking. Talking openly about mistakes reduces shame and helps kids see them as opportunities for growth.Ask with a tone of curiosity, not judgment: \"Did anything happen today that you'd do differently next time?\" This might prompt them to say, \"I forgot my library book so I'm going to pack it tonight so I don't forget.\"3. 'Who were you proud of today?'It works because it turns their attention to others and cultivates empathy. You will also gain insight into your child's relationships and what they value.Make the question more specific by asking, for example, \"Did you see anyone try really hard at something today?\" Your child may talk about a friend who was brave or might give themselves a pat on the back and say, \"My friend forgot her snack so I shared mine.\"4. 'What's one thing that would have made today better?'This question helps kids identify feelings like frustration and disappointment without dwelling on those experiences. It naturally opens the door to problem-solving and planning.You can ask in a fun way, such as, \"If you had a magic wand to change one thing about today, what would it be?\" This can lead to creative ideas, like, \"I wish there was more time for my art project so maybe I'll bring it home to finish it.\" 5. 'Who did you help today?'You can empower kids to engage in prosocial behavior with questions like this. When you ask regularly, kids begin to look for opportunities to be helpful and acts of kindness become second nature.  Ask about small acts of contribution: \"How were you a helper today?\" They might remember something simple, like, \"I helped the teacher pass out papers.\"6. 'What was the most interesting thing you learned today?'It emphasizes curiosity over academic performance. Showing interest in the learning process itself fuels lifelong learning.Encourage kids to talk about what they learned aside from just their subjects. They may share a fun fact, like, \"I learned that my teacher knows how to play the violin.\" Show interest and ask follow-up questions to keep the conversation going.7. 'What's something new you'd like to try?'This nudges kids to look outside their comfort zone and encourages them to be courageous. They don't have to be good at something in order to try something new — it's a learning experience. If your child hesitates to try new things, encourage an experiment by asking, \"Is there a club or activity you're curious about just trying once?\" They may be more likely to explore if they know they don't have to stick with it forever.Amy Morin is a psychotherapist, clinical social worker and instructor at Northeastern University. She is the author of several books including \"13 Things Strong Kids Do: Think Big, Feel Good, Act Brave\" and \"13 Things Mentally Strong Parents Don't Do.\" Her TEDx talk \"The Secret of Becoming Mentally Strong\" is one of the most viewed talks of all time. Follow her on Instagram and Facebook.Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience. Sign up today with coupon code EARLYBIRD for an introductory discount of 20% off. Offer valid Oct. 21 through Oct. 28, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stop asking 'How was school today?' To raise successful, mentally strong kids, ask these 7 questions instead",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222410-1762443789460-GettyImages-1352579841.jpg?v=1762443860&w=1920&h=1080"
      ],
      "datePublished": "2025-11-09T14:30:01.000Z",
      "dateModified": "2025-11-09T14:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "34-year-old was saving to buy a house, then decided to focus on early retirement instead: 'I value my time more than home ownership'",
    "url": "https://www.cnbc.com/2025/11/08/millennial-saving-buy-a-house-decide-start-saving-early-retirement.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222596-1762456794823-IMG_8209.jpeg?v=1762457946&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T15:00:01.000Z",
    "description": "In 2020, Anita Kinoshita, 28 years old at the time, started looking into buying a house.Kinoshita was living in California and making around $70,000 a",
    "body": "In 2020, Anita Kinoshita, 28 years old at the time, started looking into buying a house.Kinoshita was living in California and making around $70,000 a year as a software engineer for the Department of Defense.As a first-generation American from a farming family in Mexico, Kinoshita believed the best way to finally achieve the American dream her family had for her was to own property.\"I had my first big girl job and thought the next responsible thing to do would be to buy a house,\" Kinoshita tells CNBC Make It. \"I didn't necessarily want to buy a house. In fact, I was trying to figure out how to finesse the purchase.\"Initially, Kinoshita was seeking a property with the intent to sublet some of the bedrooms and lower her share of the expenses. She had about $20,000 saved for a down payment.\"My vision for the future was to be able to have a family and spend as much time with them and not necessarily have an office job. [But] I still went forward with what made sense for this American Dream path,\" she says.\"I was 28 at the time, so I still kind of cared what my community defined as successful, and homeownership was part of that. At the time, I thought it was the responsible thing to do.\"Kinoshita always believed achieving the American Dream meant owning property.Anita KinoshitaKinoshita wanted to learn as much as she could about the home-buying journey she was embarking on. She enrolled in a nine-week course that teaches people how to manage their money, offered by Financial Peace University.During the retirement module of the online class, Kinoshita used a retirement calculator that helped her realize that if she started contributing a bit more to her 401(k), she could retire around age 55 and buy a house at the same time.\"All of a sudden, the vision I had for the future and the freedom and lifestyle I wanted became possible in my mind for the first time,\" she says.For two years, Kinoshita looked at least a dozen places and put in a total of four offers. She got accepted for one, but then the sellers backed out. She was also approved for a single-family home, but there was a mismatch in the appraisal, so she walked away from the deal.\"I ended up backing out because the only way to be competitive during that time was to invest less and save more for the down payment, and I wasn't willing to do that,\" she says.\"Ultimately, I felt like it wasn't the time for me at the moment, and I was not willing to invest less either. I wasn't satisfied with my career and felt like I was living my dad's dream and not really mine.\"Kinoshita viewed a dozen properties and put in a total of four offers.Anita KinoshitaRedefining successKinoshita switched her focus. Instead of saving for a down payment, she set a goal of having $500,000 invested in her retirement accounts. By April 2022, she had invested $200,000 and reached COAST FIRE — a strategy where you save and invest enough to eventually stop contributing to your retirement accounts and let the compound growth continue rising so you're on track to have a traditional retirement. She decided to quit her job.Kinoshita isn't alone in choosing to wait to buy a house. The median age of a first-time home buyer has gone up in recent years, from 35 in 2023 to 38 in 2024 alone, according to a report from the National Association of Realtors.After quitting her full-time job, Kinoshita started working part-time, creating curriculum for California State University, Monterey Bay and making financial literacy content online. Both of these positions made her more money than when she was working as a software engineer.Kinoshita, now 34, is going to wait until she reaches early COAST FIRE, which, when you have enough invested, lets you stop contributing by the age you decide, versus the traditional retirement age of 67. Kinoshita quit her job and is now making financial literacy content online.Anita KinoshitaHer projected retirement age is now 45, and she expects to have $1.5 million invested by then.\"I value my time and freedom a little bit more than I value home ownership. In retrospect, I think if I had bought the house, I would have felt trapped in my career,\" she says.Kinoshita and her husband recently moved to the California neighborhood where they would one day like to own a home. They pay $4,000 a month in rent and live in a single-family home in a gated community, according to documents reviewed by CNBC Make It.When the couple is ready to buy, she estimates they will have about $300,000 saved to put toward the home. But they still don't know when they will start getting serious about buying.\"I'm not in a rush. I don't want to use it as a financial tool in any way. I'm looking at it more as a luxury and less as an asset these days,\" she says. \"I would rather have my money working for me in the stock market than in real estate.\"Kinoshita and her husband are now renting in the neighborhood they hope to buy one day.Anita KinoshitaKinoshita says her definition of a dream home has also changed.\"I don't want too many bedrooms. I think what I care more about these days is the charming architecture. I don't want it to be overwhelming in terms of square footage. I want it to be in a really beautiful neighborhood where I feel safe. I want to look outside and see nature,\" she says.\"I don't see a reason to settle for something else, so for us it's a as long as it takes kind of thing.\"Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "34-year-old was saving to buy a house, then decided to focus on early retirement instead: 'I value my time more than home ownership'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222596-1762456794823-IMG_8209.jpeg?v=1762457946&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T15:00:01.000Z",
      "dateModified": "2025-11-08T15:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How 24-year-old 'Moana' star Auli'i Cravalho deals with career setbacks: 'When there's a drought, pivot'",
    "url": "https://www.cnbc.com/2025/11/09/moana-star-aulii-cravalho-career-advice-when-theres-a-drought-pivot.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222161-1762402576829-gettyimages-2220873098-MPTFs_NextGen_Annual_Summer_Party.jpeg?v=1762402615&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-09T14:20:01.000Z",
    "description": "Auli'i Cravalho is just 24, but she's already a decade into her career, and she's shifted in her profession many times over.Cravalho made her Hollywoo",
    "body": "Auli'i Cravalho is just 24, but she's already a decade into her career, and she's shifted in her profession many times over.Cravalho made her Hollywood debut voicing the titular \"Moana,\" released in 2016, and has since made her mark in other movies like 2024's \"Mean Girls,\" in TV roles and on Broadway in the role of Sally Bowles in \"Cabaret.\"But she hasn't always gotten the roles she's wanted most.\"The best way for me to get through that is one: time, and two: recognizing that the young woman who gets that role is just like me, very different from me, but just like me,\" Cravalho told CNBC Make It at ZCON, a Gen Z focused conference put on by United Talent Agency.\"How can I be upset at a girl who has worked her behind off to get exactly where she's meant to be?\" she added. \"And if it isn't meant to be for me, so be it, and I have to let it go.\"Behind the scenes, Cravalho has started getting into producing, including becoming an executive producer on an upcoming live-action remake of \"Moana.\"The expansion of the work she does is by design.\"For many of us [in Hollywood], the work is seasonal,\" she said. \"When it rains, it pours, and then there's a drought. And when you're in a drought, pivot.\"Redirecting the focus of your career takes time, being willing to make mistakes and committing to learning from them, she added.Pivoting \"took me walking into a room [and] saying 'I don't know what I don't know.' Let me close my mouth and just watch and listen and learn,\" she said.It's allowed her to build a career based on her interests and passions, and to find a way to combat the feeling that she's \"inherited a world that is on fire,\" especially in her advocacy around climate change and oceanic preservation.In 2025, Cravalho associate produced the documentary \"Reef\" about one of the world's largest coral reef restoration programs.Cravalho stressed the importance of finding mentors to help you through career changes, and called on leaders to offer support to young risk-takers. \"[I] am more than willing to fall on my face if someone's willing to help me back up,\" she saidWant to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How 24-year-old 'Moana' star Auli'i Cravalho deals with career setbacks: 'When there's a drought, pivot'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222161-1762402576829-gettyimages-2220873098-MPTFs_NextGen_Annual_Summer_Party.jpeg?v=1762402615&w=1920&h=1080"
      ],
      "datePublished": "2025-11-09T14:20:01.000Z",
      "dateModified": "2025-11-09T14:20:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Underwater cables are a vital piece of the AI buildout and internet — investment is booming",
    "url": "https://www.cnbc.com/2025/11/08/big-tech-ai-underwater-cables.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108221842-1762362592580-251028-cg-32-subsea-cables-gfx1_0-00-07-08.png?v=1762451999&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T13:00:01.000Z",
    "description": "Over 95% of international data and voice call traffic travels through nearly a million miles of underwater communication cables.These cables carry gov",
    "body": "Over 95% of international data and voice call traffic travels through nearly a million miles of underwater communication cables.These cables carry government communications, financial transactions, email, video calls and streaming around the world.The first commercial telecommunication subsea cable was used for telegraphs and was laid across the English Channel between Dover, England and Calais, France in 1850.The technology then evolved to coaxial cables that carried telephone conversations, and most recently, fiber optics that ferry data and the internet as we know it.\"About ten years ago, we saw the advent of another big category, which is the webscale players and the likes of Meta, Google, Amazon, etc., who represent now probably 50% of the overall market,\" said Paul Gabla, chief sales officer at Alcatel Submarine Networks.Alcatel is the world's largest subsea cable manufacturer and installer, according to industry trade magazine Submarine Telecoms Forum.Demand for subsea cables is increasing as tech giants race to develop computation-intensive artificial intelligence models and connect their growing networks of data centers.Investment into new subsea cable projects is expected to reach around $13 billion between 2025-2027, almost twice the amount that was invested between 2022 and 2024, according to telecommunications data provider firm TeleGeography.A map of the world's undersea communication cables.CNBC | Jason ReginatoBig Tech, big cables\"AI is increasing the need that we have for subsea infrastructure,\" said Alex Aime, vice president of network investments at Meta. \"Oftentimes when people think about AI, they think about data centers, they think about compute, they think about data. But the reality is, without the connectivity that connects those data centers, what you have are really expensive warehouses.\"In February, the company announced Project Waterworth, a 50,000km (31,000-mile) cable that will connect five continents, making it the world's longest subsea cable project.Meta will be the sole owner of Waterworth, which the company says will be a multi-year, multi-billion-dollar project.Amazon also recently announced its first wholly-owned subsea cable project called Fastnet.Fastnet will connect Maryland's eastern shore to County Cork, Ireland, and capacity will exceed 320 terabits per second, which is equivalent to streaming 12.5 million HD movies simultaneously, according to Amazon.\"Subsea is really essential for AWS and for any connectivity internationally across oceans,\" Matt Rehder, Amazon Web Services vice president of core networking, told CNBC in an interview about Amazon's subsea cable investments. \"Without subsea you'd have to rely on satellite connectivity, which can work. But satellite has higher latency, higher costs, and you just can't get enough capacity or throughput to what our customers and the internet in general needs.\"A ship belonging to Alcatel Submarine Networks deploys a plow to install subsea telecommunications cables.Alcatel Submarine NetworksGoogle is another large player, having invested in over 30 subsea cables.One of the company's latest projects is Sol, which will connect the U.S., Bermuda, the Azores and Spain.Microsoft has also invested in the infrastructure.\"You've seen this huge growth in submarine cables over the past 20 years. And this is driven by just a voracious demand for data,\" says Matthew Mooney, director of global issues at cybersecurity firm Recorded Future.Cut cablesDisruptions due to cable damage can be quite significant, particularly in areas served by few internet connections.\"If you cut a cable, you can cut off multiple countries from internet access, and that includes financial transactions, banking, e-commerce and basic communications,\" said Erin Murphy, a senior fellow at the Center for Strategic and International Studies, a nonprofit national security research organization.That very thing happened to Tonga, an island nation east of Australia.In 2022, debris from an underwater volcanic eruption severed the island's only subsea communication cable, cutting the island off from the rest of the world.In September, cuts to subsea cables in the Red Sea caused disruptions to Microsoft's Azure cloud service. The company was able to re-route traffic, but users in Asia and the Middle East still faced increased latency problems and degraded performance.Experts have said that the majority of subsea cable damage is accidental, usually due to fishing activity or a ship accidentally dropping its anchor on a cable. But lately, these cables are becoming the suspected targets of sabotage.A subsea cable being manufactured at Alcatel Submarine Networks factory in Calais, France.CNBC\"When you have so many vessels in international waters that are highly trafficked by lots of commercial vessels or fishing vessels, the likelihood of accidents is fairly high,\" Murphy said. \"But if you're a hostile actor, you know that as well. So if you're sending out the so-called Russian ghost fleet, or if you have a Chinese fishing vessel and a cable is accidentally cut, you could just say, 'Oh, well, it was an accident.' But it could be intentional. So it's really hard to discern sometimes when an act of damage is actually intentional or accidental.\"Mooney and Recorded Future have been tracking some of these cases of suspected sabotage.\"I would say that we have seen a significant uptick in what we would consider intentional damages,\" Mooney said. \"In 2024 and 2025, [we] saw a notable increase in incidents that occurred in the Baltic Sea and around Taiwan. And so it is difficult to be able to determine with 100% validity that these are intentional. However, the fact patterns that emerge from these events does give you cause to be suspicious that they could all be considered accidental.\"Mooney said the increase in suspected sabotage has corresponded to increased tensions between Russia and Ukraine and China and Taiwan.Despite there being a lack of concrete evidence of subsea cable sabotage, governments are taking the threat seriously.In January, NATO launched the \"Baltic Sentry\" following several incidents of cable cuts in the Baltic Sea. The operation involves deploying drones, aircraft and subsea and surface vessels to safeguard the subsea infrastructure in the region.\"As a result, I don't believe we've seen any instances of cable severing since late January 2025, in the Baltic Sea,\" Mooney said.A picture taken on February 4, 2025 shows a Helicopter 15 (HKP15) (L) on the flight deck of patrol ship HMS Carlskrona (P04) on open water near Karlskrona, Sweden, as part of the NATO Baltic Sea patrol mission, the Baltic Sentry, aimed to secure critical underwater infrastructure. The patrol ship HMS Carlskrona (P04) set off from the naval port in Karlskrona on February 4, 2025 to become part of NATO's Baltic Sentry operation as one of several Swedish ships that are part of Standing NATO Maritime Group One (SNMG1). This is the first time the ship has hoisted the NATO flag on board. The purpose of NATO's Baltic Sentry operation is to demonstrate presence and secure critical underwater infrastructure. (Photo by Johan NILSSON / TT NEWS AGENCY / AFP) / Sweden OUT (Photo by JOHAN NILSSON/TT NEWS AGENCY/AFP via Getty Images)          Johan Nilsson | Afp | Getty ImagesU.S.-China tensionIn the United States, the Federal Communications Commission, which is responsible for granting licenses to anyone wishing to install or operate subsea cables connecting to the U.S., has introduced tighter rules on foreign firms building this infrastructure, citing security concerns.\"One area we've been particularly focused on are threats that come from the Chinese Communist Party as well as from Russia,\" FCC Chair Brendan Carr told CNBC. \"So we're taking actions right now to make it difficult or effectively prohibiting the ability to connect undersea cables directly from the U.S. to a foreign adversary nation.\"Carr said the FCC is also taking steps to make sure the hardware itself isn't compromised, not allowing Huawei, ZTE or other questionable \"spy gear\" to be used in undersea cables.In July, three House Republicans sent a letter to the CEOs of Meta, Amazon, Google and Microsoft asking if the companies have used PRC-affiliated cable maintenance providers.In response to CNBC's question about the letter, Meta's Aime said, \"We do not work with any Chinese providers of cable systems on systems that we've announced, and we are in full compliance with U.S. policy regulations around partners in the ecosystem and the supply chain.\"Amazon also told CNBC it does not work with Chinese companies.Microsoft and Google did not return CNBC's request for comment on the letter.To understand how subsea cables work, CNBC visited Alcatel Submarine Networks subsea cable manufacturing facilities in Calais, France and Greenwich, England. We also spoke to government officials and tech giants to find out why subsea cables are crucial to keeping us connected and what we can do to protect this critical infrastructure.Watch the video to get the full story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Underwater cables are a vital piece of the AI buildout and internet — investment is booming",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108221842-1762362592580-251028-cg-32-subsea-cables-gfx1_0-00-07-08.png?v=1762451999&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T13:00:01.000Z",
      "dateModified": "2025-11-08T13:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Carl Icahn returns to a familiar sector — auto repair — as he builds a 15% stake in Monro",
    "url": "https://www.cnbc.com/2025/11/08/carl-icahn-returns-to-a-familiar-sector-auto-repair-as-he-builds-a-15percent-stake-in-monro.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222568-1762454629105-Screenshot_2025-11-06_at_14324_PM.png?v=1762454717&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-08T12:46:52.000Z",
    "description": "Monro Auto Service in Derby, CT.Source: Google EarthCompany: Monro (MNRO)Business: Monro, formerly Monro Muffler Brake, is engaged in the provision of",
    "body": "Monro Auto Service in Derby, CT.Source: Google EarthCompany: Monro (MNRO)Business: Monro, formerly Monro Muffler Brake, is engaged in the provision of automotive undercar repair and tire services in the United States. The company provides a range of services on passenger cars, light trucks and vans for brakes; mufflers and exhaust systems, and steering, drive train, suspension and wheel alignment. It also offers tires and routine maintenance services, which include state inspections. It offers repair and replacement of parts. Its stores provide a range of undercar repair services for brakes, steering, mufflers and exhaust systems, suspension and wheel alignment, as well as tire replacement and service. It also offers scheduled maintenance services in its stores where services are packaged and offered to consumers based upon the year, make, model and mileage of each specific vehicle. Its maintenance services include oil change services, heating and cooling system flush and fill service, fuel system service and a transmission flush and fill service.Stock Market Value: $458.40 million ($15.27 per share)Stock Chart IconStock chart iconMonro shares year to dateActivist: Carl IcahnOwnership: 14.79%Average Cost: $19.08Activist Commentary: Carl Icahn is the grandfather of shareholder activism and a true pioneer of the strategy. He is very passionate about shareholder rights and good corporate governance and will go to extreme lengths to fight incompetent boards and over compensated managers. Icahn has invested across all sectors over his more than six-decade long career and has a long history in the automotive parts and services industry. He has been involved in several mergers and acquisitions in this space, acquiring some of his portfolio companies through Icahn Automotive, the automotive-segment business of his conglomerate, Icahn Enterprises. This includes his acquisition of Pep Boys-Manny Moe and Jack in 2016 and Federal Mogul in 2017.What's happeningOn Nov. 5, Carl Icahn filed a 13D with the U.S. Securities and Exchange Commission, disclosing a 14.79% position in Monro.Behind the scenesMonro is engaged in the provision of automotive undercar repair and tire services in the United States, operating more than 1,100 repair shops and tire dealers in 32 states under multiple regional brands. The company has faced several challenges in recent years. Macro factors like lower consumer demand, higher material and labor costs, and a trend in consumer trade-down to lower margin tire products have applied significant margin and growth pressure. As a result, following a 4.9% decrease in sales for fiscal year 2025 — the second year in a row with a meaningful decline in revenue — the company announced that they are closing approximately 145 underperforming locations. Most recently, the company's third-quarter earnings report left a lot of investors disappointed about its strategic transition, with weaker-than-expected revenue and no specific financial guidance for the upcoming fiscal year. Shares fell 16.7% the next day. Lastly, many investors have questioned the company's dividend payout ratio, which has remained relatively large despite these ongoing struggles. Putting all this together, it comes as little surprise that shares have underperformed, down 44.73%, 66.73% and 63.25% over the past 1-, 3- and 5-year periods, respectively, prior to Icahn's announcement.Perhaps this depressed valuation is what caught the eye of Carl Icahn. He disclosed a 14.79% position in the company (67% of which was acquired since the stock's Oct. 29 downturn), immediately sending the stock up over 15%. While there are plenty of cheap stocks, this isn't Icahn taking a flyer on the automotive industry. Icahn has a rich history in the automotive parts and services industry, most notably Icahn Automotive, the automotive segment of his conglomerate, Icahn Enterprises. Icahn knows this industry well and likely sees Monro as a great business that is significantly undervalued. The timing of this public engagement is also very notable. It is not just the stock's recent fall that makes this a good entry point for an investor like Icahn. Monro recently agreed to collapse its dual class share structure, which had previously granted its sole Class C shareholder, Peter Solomon, veto power over any matter brought to a shareholder vote, effectively making this a controlled company. Pursuant to its approval in 2023, this collapse will occur prior to the 2026 annual meeting, which is expected to take place next August. So, what does this mean for the company's shareholders? It effectively sets the stage for the company being converted from a privately run company to a publicly run company for the benefit of its shareholders. With one person having veto power over all material board decisions, the rest of the board becomes somewhat irrelevant. With this conversion, the company has an opportunity to have a real, collaborative, and productive board. This would require its reconstitution, and we know of nobody better or more experienced than Icahn for that endeavor.Solomon is an 87-year-old renowned investment banker and Icahn is, well, Icahn and a contemporary of Solomon. However, there is no evidence that the two have ever crossed paths. Despite this, we would imagine that they have many relationships in common and mutual respect for each other. While there are many different ways this campaign can go down, what we would like to see is the two elder statesmen meeting in a room with an air of civility and cordiality uncommon in the average activist engagement and together coming up with a board that will oversee management, hold them accountable on behalf of shareholders and usher the company through its first real phase as a truly public company. With Solomon already agreeing to give up control, and neither Solomon nor Icahn likely to be on the continuing board, there is no reason why this should get contentious.However, we also must address the elephant in the room. Icahn has built his automotive industry on acquisitions, and Monro appears to fit in very nicely in IEP's automotive business. Icahn has launched activist campaigns at some of the auto companies that he later went on to acquire, including Pep Boys-Manny Moe and Jack in 2016 and Federal Mogul in 2017. When Icahn acquired Pep Boys he also stated: \"We believe that with our abundant resources and knowledge of the industry we will be able to grow this business and take advantage of consolidation opportunities, thereby benefiting customers, manufacturing partners and employees, as well as our shareholders.\" While we sincerely believe that Icahn's main motivation for this investment is to invest in a good company that he believes is at an inflection point and is significantly undervalued, there is always the chance that he might want to own the entire company one day. This is a very small position for him and a good return would not move the needle as much as a synergistic integration into his automative business, but we see no reason why both things cannot be true.Ken Squire is the founder and president of 13D Monitor, an institutional research service on shareholder activism, and the founder and portfolio manager of the 13D Activist Fund, a mutual fund that invests in a portfolio of activist investments.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Carl Icahn returns to a familiar sector — auto repair — as he builds a 15% stake in Monro",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222568-1762454629105-Screenshot_2025-11-06_at_14324_PM.png?v=1762454717&w=1920&h=1080"
      ],
      "datePublished": "2025-11-08T12:46:52.000Z",
      "dateModified": "2025-11-08T12:46:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top Wall Street analysts favor these 3 tech stocks for their growth outlook",
    "url": "https://www.cnbc.com/2025/11/09/top-wall-street-analysts-favor-3-tech-stocks-for-their-growth-outlook.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108129263-1744217063868-gettyimages-1233010055-ryder-getty-6.jpeg?v=1762536742&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-09T12:28:05.000Z",
    "description": "David Ryder | Getty Images News | Getty ImagesHigh valuations for artificial intelligence (AI) stocks were the focus of the market this week, with fea",
    "body": "David Ryder | Getty Images News | Getty ImagesHigh valuations for artificial intelligence (AI) stocks were the focus of the market this week, with fears of a potential AI bubble capping investor sentiment. But the view on Wall Street is still that several tech stocks offer strong fundamentals and are delivering rapid, AI-induced growth, justifying their sky-high valuations.The recommendations of top Wall Street analysts can help investors find attractive AI stocks displaying  robust long-term growth outlooks.Here are three stocks favored by the Street's top pros, according to TipRanks, a platform that ranks analysts based on their past performance.AmazonE-commerce and cloud computing giant Amazon (AMZN) recently impressed investors with its upbeat Q3 results. Accelerating growth in the Amazon Web Services (AWS) cloud unit confirmed the Street's faith in Amazon's expansion into artificial intelligence.In reaction to the solid Q3 print and the recently-announced deal with OpenAI, Mizuho analyst Lloyd Walmsley increased his price forecast for Amazon to $315 from $300 and reiterated a buy rating. TipRanks' AI Analyst is also bullish on AMZN stock, with an \"outperform\" rating and a price target of $276.Walmsley said that the Q3 performance, OpenAI deal and positive outlook for Amazon's Trainium chips made him more optimistic toward AWS's long-term growth. In fact, the 5-star analyst expects acceleration in AWS revenue growth from 20% in Q3 to 21% in Q4 2025 and 22% in the first quarter of 2026. He expects AWS revenue to rise by 23% to $157 billion in the full year 2026, followed by a 22% increase to $192 billion in 2027 — above the Street's expectations of $154 billion and $185 billion for 2026 and 2027, respectively.\"We believe investors continue to rotate into AMZN shares given a valuation well below its historic ranges and positive news likely to continue into the AWS ReInvent Conference in early December,\" said Walmsley.The analyst's bullish investment thesis is also based on the cost-to-serve improvements in Amazon's retail business, driven by automation in fulfillment centers and an enhanced logistics network.Walmsley ranks No. 103 among more than 10,100 analysts tracked by TipRanks. His ratings have been successful 64% of the time, delivering an average return of 27.5%. See Amazon Insider Trading Activity on TipRanks.AlphabetThis second stock pick is Google- and YouTube owner Alphabet (GOOGL). The company reported better-than-expected third-quarter results, with AI driving solid momentum in its cloud business.Impressed by the Q3 performance, JPMorgan analyst Doug Anmuth raised his price target for Alphabet to $340 from $300 and reaffirmed a buy rating. In comparison, TipRanks' AI Analyst has a price target of $316 with an \"outperform\" rating on GOOGL.Anmuth highlighted that Q3 marked the first time that Alphabet's quarterly revenue crossed the $100 billion mark. The top-rated analyst noted Alphabet's robust performance in the third quarter, with double-digit growth across every major business.Interestingly, Anmuth believes that Q3 results and favorable insights on AI search formats could change investors' views toward Google's AI search transition. Alphabet noted AI-induced acceleration in query growth and paid clicks, while Anmuth noted that industry conversations indicate that paid clicks using Google's AI Overviews (AIO) and AI Mode (AIM) features are driving higher conversion rates.\"Overall, the AI search transition has been viewed as the greatest risk to Google, but additional signs that AI search is more opportunity than threat will continue to flip the narrative,\" said Anmuth.The analyst is also encouraged by the surge in Google Cloud's backlog to $155 billion. He contends that the figure doesn't include all the gains from the recently announced expansion of GOOGL's partnership with Anthropic, implying a further increase in the backlog at the end of the fourth quarter. Overall, Anmuth is confident about Alphabet's prospects and said it remains JPMorgan's Top 2 idea, behind only Amazon.Anmuth ranks No. 113 among more than 10,100 analysts tracked by TipRanks. His ratings have been profitable 63% of the time, delivering an average return of 22%. See Alphabet Ownership Structure on TipRanks.Advanced Micro DevicesThe third tech giant this week is chipmaker Advanced Micro Devices (AMD), which delivered strong results in the third quarter of Fiscal 2025. AMD attributed stronger earnings and revenue to its expanding compute business and fast-growing AI data center segment.In reaction, Stifel analyst Ruben Roy increased his price target for AMD to $280 from $240 and reiterated a buy rating. With a price target of $285, TipRanks' AI Analyst has an \"outperform\" rating on AMD stock.Roy noted that AMD's Q3 top line was driven by strength across the company's data center, AI, server and PC businesses. The 5-star analyst highlighted management's optimism toward continued momentum in Q4 FY25, with revenue expected to grow 25% year-over-year to $9.6 billion. AMD expects Q4 revenue growth will be supported by strong performances in its data center, client and embedded businesses, partially offset by a double-digit decline in the gaming segment.Interestingly, Roy believes that AMD's performance in the near-term is being fueled more by increasing demand for server central processing units and continued share gains in client CPUs rather than data center AI graphics processing units. The analyst expects AMD's data center AI GPU business to increase to a range of $6 billion to $6.5 billion in FY25, versus a prior estimate of $5 billion.\"Looking ahead, we continue to believe that AMD is executing well as the company nears production shipments of the MI400/450 series GPUs and the Helios rack next year,\" Roy said.The analyst is also optimistic on AMD's recently-announced deals with OpenAI and Oracle Cloud Infrastructure, saying they provide clarity on the longer-term growth outlook in its data center AI business. Roy awaits further insights from AMD about its technology roadmap and total addressable market (TAM)  at an upcoming Analyst Day event on November 11.Roy ranks No. 20 among more than 10,100 analysts tracked by TipRanks. His ratings have been profitable 71% of the time, delivering an average return of 34.4%. See AMD Statistics on TipRanks.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top Wall Street analysts favor these 3 tech stocks for their growth outlook",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108129263-1744217063868-gettyimages-1233010055-ryder-getty-6.jpeg?v=1762536742&w=1920&h=1080"
      ],
      "datePublished": "2025-11-09T12:28:05.000Z",
      "dateModified": "2025-11-09T12:28:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China consumer prices return to growth in October, producer price slump extends to three years",
    "url": "https://www.cnbc.com/2025/11/09/china-october-cpi-ppi-deflation-consumer-prices-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223360-1762665207407-gettyimages-2236500727-vcg111592136092.jpeg?v=1762665226&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-09T12:01:42.000Z",
    "description": "YIWU, CHINA - SEPTEMBER 20: Vendors stock up on fruit at a wholesale market on September 20, 2025, in Yiwu, Jinhua City, Zhejiang Province, China. Vcg",
    "body": "YIWU, CHINA - SEPTEMBER 20: Vendors stock up on fruit at a wholesale market on September 20, 2025, in Yiwu, Jinhua City, Zhejiang Province, China. Vcg | Visual China Group | Getty ImagesDeflation pressures in China eased in October as consumer prices returned to growth after remaining in negative territory for the most part this year, supported by holiday season demand, while declines in wholesale prices also moderated.Data from China's National Bureau of Statistics released Sunday showed consumer price index reading for October at 0.2%, compared with analysts' expectations of zero, or flat growth year on year. October's reading was the strongest since January this year, and the first positive growth in consumer prices since June.On a month-on-month basis CPI also rose by 0.2%, compared with Reuters-polled analysts' expectations of zero growth.Food prices, which have been a drag on the country's CPI, dropped 2.9% year on year. However, prices rose 0.2% over the previous month.Factory-gate deflation eased with prices falling 2.1%, year on year, compared with Reuters' poll estimates for a 2.2% decline, completing three years in negative territory. Month-on-month producer prices rose by 0.1% in October.\"In October, policies aimed at expanding domestic demand continued to take effect, coupled with the boost from the National Day and Mid-Autumn Festival holidays,\" Dong Lijuan, chief statistician at the urban division of the National Bureau of Statistics, said in a statement.Read moreWhile China's steps aimed at reining in price wars and fueling demand seem to have started bearing fruit, with the country's industrial profits in September rising more than 21%, experts warn that Chinese local governments' dependence on tax revenue encourages sustained production, intensifying competition and overcapacity until there are meaningful tax changes.China's manufacturing activity in October declined more than expected, contracting to its lowest level in six months, according to an official survey released Oct. 30. The sub-indexes for production, new orders, raw material inventory and employment all deepened their contraction, pointing to a sharp manufacturing slowdown.Chinese producers have been in the throes of demand uncertainty owed to trade tensions with the U.S. this year and weak consumer confidence at home as Beijing struggles with a prolonged housing downturn and headwinds to exports.The country's exports in October unexpectedly contracted, with shipments to the U.S. clocking double-digit declines for a seventh consecutive month, down 25%, customs data released Thursday showed.Going forward, export headwinds could weaken as U.S. President Donald Trump and his Chinese counterpart, Xi Jinping, agreed to a trade truce during their meeting in South Korea on Oct. 30, defusing a potentially incendiary situation that had stoked worries of a full-blown trade war.China's leadership last month vowed to boost domestic consumption as it laid out the economic roadmap for the next five years. China must \"vigorously boost consumption,\" the meeting readout said, according to a CNBC translation.The leaders elaborated on the need for lifting consumption with calls to balance it with \"effective investment\" and \"adhere to the strategic point of expanding domestic demand.\"—  CNBC's Anniek Bao and Evelyn Cheng contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China consumer prices return to growth in October, producer price slump extends to three years",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223360-1762665207407-gettyimages-2236500727-vcg111592136092.jpeg?v=1762665226&w=1920&h=1080"
      ],
      "datePublished": "2025-11-09T12:01:42.000Z",
      "dateModified": "2025-11-09T12:01:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]