[
  {
    "title": "SoftBank shares plunge over 8%, extending selloff into third day",
    "url": "https://www.cnbc.com/2025/11/14/softbank-shares-plunge-extending-selloff-nvidia-ai-semiconductor-ai-artificial-intelligence.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108093382-17380717982025-01-28t074429z_827921932_rc2ticae7356_rtrmadp_0_deepseek-markets.jpeg?v=1738071841&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-14T02:06:13.000Z",
    "description": "The logo of SoftBank is displayed at a company shop in Tokyo, Japan January 28, 2025. Issei Kato | ReutersShares of SoftBank Group plunged nearly 9% o",
    "body": "The logo of SoftBank is displayed at a company shop in Tokyo, Japan January 28, 2025. Issei Kato | ReutersShares of SoftBank Group plunged nearly 9% on Friday, marking its third straight day of selloff after the Japanese giant said it had sold its entire stake in U.S. chip giant Nvidia for $5.83 billion. The stock pared losses to trade 5% lower as of 9 p.m. ET. If the losses hold, this would mark the second straight week of selloff after the conglomerate saw almost $50 billion in market cap wiped out last week, marking its worst weekly loss since March 2020.SoftBank disclosed in its latest earnings that it offloaded 32.1 million Nvidia shares in October and scaled back its T-Mobile stake, bringing in $9.17 billion.Although the Nvidia sale surprised some investors, it isn't the first time SoftBank has exited the U.S. chip giant. Its Vision Fund had accumulated roughly $4 billion worth of Nvidia shares in 2017 before selling out entirely in early 2019.Even so, SoftBank continues to have business ties to Nvidia. The Tokyo-based company is involved in a number of AI ventures that use Nvidia's technology, including the $500 billion Stargate project for data centers in the U.S.Several other tech stocks in the region also declined. Semiconductor testing equipment maker Advantest and Tokyo Electron, a chip production equipment maker, fell by over 3% and 4% respectively.Taiwan's TSMC, the world's largest contract chipmaker, fell 2.04%. South Korean memory chip giant SK Hynix was more than 5% lower, while Samsung Electronics lost 3.8%.Shares of Tencent declined 5.61%, while JD.com was down 4.31%.Overnight in the U.S., technology giants came away battered. Nvidia and Broadcom notably declined 3.6% and 4.3%, respectively, while Google parent Alphabet fell 2.8%.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SoftBank shares plunge over 8%, extending selloff into third day",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108093382-17380717982025-01-28t074429z_827921932_rc2ticae7356_rtrmadp_0_deepseek-markets.jpeg?v=1738071841&w=1920&h=1080"
      ],
      "datePublished": "2025-11-14T02:06:13.000Z",
      "dateModified": "2025-11-14T02:06:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "28-year-old's $25,000 crypto investment grew to $400,000 in 6 years—but he wouldn't do it again ",
    "url": "https://www.cnbc.com/2025/11/13/28-year-old-says-crypto-investment-was-a-gamble.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219490-1761842496102-251030-mi-10-mm-sebastian-ontario-clean00_04_24_17Still005.jpg?v=1762810410&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T18:55:52.000Z",
    "description": "Sebastian Marquez, 28, and his wife, Julia Marquez, 26, have never held jobs that pay over six figures, yet their combined net worth is just over $1 m",
    "body": "Sebastian Marquez, 28, and his wife, Julia Marquez, 26, have never held jobs that pay over six figures, yet their combined net worth is just over $1 million.That's largely due to cryptocurrency investments in bitcoin and ethereum worth about $400,000 in U.S. dollars as of Sept. 30, according to documents reviewed by CNBC Make It. The couple is based in Strathroy, Ontario.However, \"looking back at it, I most likely wouldn't have made that investment,\" Sebastian says, citing the volatile nature of cryptocurrencies. \"I was very worried about that investment to begin with.\"In 2019, Sebastian, who made money in his early 20s from flipping houses and working retail at Walmart, says he invested around 10% of his net worth — around $25,000 — in crypto.Since then, bitcoin's value in Canadian dollars has grown by around 2,000% and ethereum's has grown by around 2,500%. But it could have just as easily gone the other way, he says.\"It was a gamble that we had taken at the time, and it's definitely paid off, fortunately,\" he says. Today, the couple, who combined their finances in 2020, prefer to put about 15% of their monthly income into investments with more predictable returns like index funds, Sebastian says.Keep crypto to 5% of your portfolio, expert saysSebastian's more cautious outlook mirrors expert advice. Investors should think twice before taking out significant stakes in cryptocurrencies, says Patrick Huey, certified financial planner and owner of Victory Independent Planning in Portland, Oregon.That's for a number of reasons, Huey says: Cryptocurrencies are less reliable than stocks because there's no underlying asset involved, they don't generate dividends, their value \"fluctuates wildly\" and they're rarely used for their original purpose as a digital currency.In the U.S., 42% of Gen Z investors aged 18 to 27 said they owned some amount of crypto, according to a 2025 report by market research firm YouGov that surveyed 13,000 investors who said they were likely to invest in the next year. Only 11% of Gen Z investors reported owning an exchange-traded fund and just 26% said they own stock.It's fine to \"dabble\" in investments like crypto and meme stocks, but you should keep it to less than 5% of your investment portfolio due to their uncertain nature, says Jaime Bosse, a certified financial planner and senior advisor at CGN Advisors in Manhattan, Kansas.As for Sebastian and Julia, the couple has no plans to buy more crypto but will hold onto what they already own for the \"foreseeable future,\" Sebastian says.\"One thing that I wish I could have done a little sooner was definitely invest in index funds,\" Sebastian says. \"However, with that being said, I'm very happy with where things have ended up.\"All amounts are in U.S. dollars, converted from Canadian Dollars at the OANDA exchange rate of 1 CAD to 0.71824 USD on Sept. 30, 2025.Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "28-year-old's $25,000 crypto investment grew to $400,000 in 6 years—but he wouldn't do it again ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219490-1761842496102-251030-mi-10-mm-sebastian-ontario-clean00_04_24_17Still005.jpg?v=1762810410&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T18:55:52.000Z",
      "dateModified": "2025-11-13T18:55:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CEO of Southeast Asia's largest bank says AI adoption is already paying off: ‘It’s not hope, it’s now’",
    "url": "https://www.cnbc.com/2025/11/14/ceo-southeast-asias-top-bank-dbs-says-ai-adoption-already-paying-off.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225931-1763091063646-gettyimages-2245745709-SINGAPORE_FINTECH_FESTIVAL.jpeg?v=1763091544&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-14T03:41:56.000Z",
    "description": "Tan Su Shan, chief executive officer of DBS Group Holdings Ltd., speaking at the Singapore Fintech Festival in Singapore, on Nov. 12, 2025. Bloomberg ",
    "body": "Tan Su Shan, chief executive officer of DBS Group Holdings Ltd., speaking at the Singapore Fintech Festival in Singapore, on Nov. 12, 2025. Bloomberg | Bloomberg | Getty ImagesSINGAPORE - Amid fears of an artificial intelligence bubble, much has been made of recent reports suggesting that AI has yet to generate returns for companies investing billions into adopting the tech. But that's not what the chief executive of Southeast Asia's largest bank is seeing — she says her firm is already reaping the rewards of its AI initiatives, and it's only just the beginning. \"It's not hope. It's now. It's already happening. And it will get even better,\" DBS CEO Tan Su Shan told CNBC  on the sidelines of Singapore Fintech Week, when asked about the promise of AI adoption.  DBS has been working to implement artificial intelligence across its bank for over a decade, which helped prepare its internal data analytics for recent waves of generative and agentic AI. Agentic AI is a type of artificial intelligence that relies on data to proactively make independent decisions, plan and execute tasks autonomously, with minimal human oversight.Tan expects AI adoption to bring DBS an overall revenue bump of more than 1 billion Singapore dollars (about $768 million) this year, compared to SG$750 million in 2024. That assessment is based on about 370 AI use cases powered by over 1,500 models throughout its business. \"The proliferation of generative AI has been transformative for us,\" Tan said, adding that the company was experiencing a \"snowballing effect\" of benefits thanks to machine learning. A major area in which DBS has applied AI is in its financial services to institutional clients, with AI used to collect and leverage data for clients in order to better contextualize and personalize offerings. According to Tan, this has resulted in \"faster and more resilient\" teams. The CEO believes that these uses of AI have contributed to a recent uptick in the bank's deposit growth as compared to competitors'.The company also recently launched a newly enhanced AI-powered assistant for corporate clients known as \"DBS Joy,\" which assists clients with unique corporate banking queries around the clock. ROI concerns Despite Tan's strong convictions about AI, recent evidence suggests that many companies are struggling to turn their AI investments into tangible profits. MIT released a report in July that found 95% of 300 publicly disclosed AI initiatives, encompassing generative AI investments of $30–$40 billion, had failed to achieve real returns. However, at least in the banking sector, there are signs that the tides are turning. While DBS doesn't differentiate spending in generative AI from other in-house investments, other major banks have recently offered this comparison. JPMorgan Chase CEO Jamie Dimon stated in an interview with Bloomberg TV last month that the bank is already breaking even on its approximately $2 billion of annual investments in AI adoption. That represents \"just the tip of the iceberg,\" he added.Those expectations are shared by DBS, which plans to continue to accelerate its AI development to become an AI-powered bank.The ultimate goal, according to Tan, is for its generative AI to develop into a trusted financial advisor for clients, including retail users who are expected to interact with personalized AI agents through the DBS banking app. The bank already has over 100 AI algorithms that analyze users' data to provide them with personalized \"nudges,\" such as alerts on incoming shortfalls, product recommendations, and other insights. Continued AI investments While DBS may already be reaping rewards from its AI adoption, Tan acknowledged that it will require continued investments, not only in capital, but in the time needed to reskill employees. The company has launched several AI reskilling initiatives across departments this year and has even deployed a generative AI-powered coaching tool to support these efforts. This will help the company automate mundane work and refocus its staff on building and maintaining human-to-human relationships with customers, rather than reducing headcount, Tan said. \"We're not freezing hiring, but it does mean reskilling. And that's a journey. It's a never-ending journey ... a constant evolution.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CEO of Southeast Asia's largest bank says AI adoption is already paying off: ‘It’s not hope, it’s now’",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225931-1763091063646-gettyimages-2245745709-SINGAPORE_FINTECH_FESTIVAL.jpeg?v=1763091544&w=1920&h=1080"
      ],
      "datePublished": "2025-11-14T03:41:56.000Z",
      "dateModified": "2025-11-14T03:41:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New foreclosures jump 20% in October, a sign of more distress in the housing market",
    "url": "https://www.cnbc.com/2025/11/13/foreclosures-rise-october-housing-market-distress.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106888890-1622063053944-gettyimages-157374474-000006885419_Unapproved.jpeg?v=1763046650&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T18:40:13.000Z",
    "description": "fstop123 | E+ | Getty ImagesForeclosure filings climbed again in October, after sitting at historic lows in recent years, according to new data releas",
    "body": "fstop123 | E+ | Getty ImagesForeclosure filings climbed again in October, after sitting at historic lows in recent years, according to new data released Thursday.While the numbers are still small, the persistent rise in foreclosures may be a sign of cracks in the housing market.There were 36,766 U.S. properties with some type of foreclosure filing in October — such as default notices, scheduled auctions or bank repossessions, according to Attom, a property data and analytics firm. That was 3% higher than September and a 19% jump from October 2024, and marked the eighth straight month of annual increases, Attom said.Foreclosure starts, which are the initial phase of the process, rose 6% for the month and were 20% higher than the year before. Competed foreclosures, the final phase, jumped 32% year over year.\"Even with these increases, activity remains well below historic highs. The current trend appears to reflect a gradual normalization in foreclosure volumes as market conditions adjust and some homeowners continue to navigate higher housing and borrowing costs,\" said Attom CEO Rob Barber in a release.Florida, South Carolina and Illinois led the nation in state foreclosure filings. On a metropolitan area level, Florida's Tampa, Jacksonville and Orlando had the most filings, with Riverside, California, and Cleveland rounding out the top five.Looking specifically at completed foreclosures, Texas, California and Florida had the most, suggesting those states will see more inventory coming on the market at distressed prices. There is still very strong demand for homes, especially in lower price ranges, so it is likely those foreclosed properties will find buyers quickly.Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.At the peak of the Great Recession, more than 4% of mortgages were in foreclosure, according to Rick Sharga, CEO of CJ Patrick Co., a real estate market intelligence firm. Today, less than 0.5% are in foreclosure, well below the historic average of between 1% and 1.5%. In addition, 4% of mortgages are delinquent; at the peak of the financial crisis, almost 12% were.\"So, no foreclosure tsunami to worry about,\" said Sharga. \"That said, there are a few areas of concern. [Federal Housing Administration] delinquencies are over 11%, and account for 52% of all seriously delinquent loans; we're likely to see more FHA loans in foreclosure in 2026.\"He also noted that states where home prices have been falling while insurance premiums have been soaring — Florida and Texas, in particular — are seeing an uptick in defaults. While home prices nationally are easing, they remain stubbornly high. Meanwhile, mortgage rates, which were expected to fall more sharply after the Federal Reserve started to cut rates, are still within a percentage point of their recent highs. Some recent buyers who thought they might have been able to refinance to lower rates by now may be feeling pressure, especially with still stubborn inflation.Consumer debt is at an all-time high, delinquencies are rising in other types of consumer credit and the job market appears to be weakening — all of which could contribute to cracks in the housing market.\"None of these issues have impacted mortgage performance - yet, but it would be unrealistic to assume that these trends, along with slow home sales and declining home price appreciation, won't lead to at least a slight increase in delinquencies and defaults in the months ahead,\" added Sharga.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New foreclosures jump 20% in October, a sign of more distress in the housing market",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106888890-1622063053944-gettyimages-157374474-000006885419_Unapproved.jpeg?v=1763046650&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T18:40:13.000Z",
      "dateModified": "2025-11-13T18:40:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tesla recalls 10,500 Powerwall 2 battery systems due to overheating, fire risk",
    "url": "https://www.cnbc.com/2025/11/13/tesla-recall-powerwall-2-overheating-fire-battery.html",
    "image": "https://image.cnbcfm.com/api/v1/image/102654592-RTX1B270.jpg?v=1556817395&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T19:58:22.000Z",
    "description": "Tesla's Powerwall 2Source: TeslaTesla is recalling around 10,500 units of its Powerwall 2, a backup battery for residential use, according to a U.S. C",
    "body": "Tesla's Powerwall 2Source: TeslaTesla is recalling around 10,500 units of its Powerwall 2, a backup battery for residential use, according to a U.S. Consumer Product Safety Commission disclosure out Thursday.\"The lithium-ion battery cells in certain Powerwall 2 systems can cause the unit to stop functioning during normal use, which can result in overheating and, in some cases, smoke or flame and can cause death or serious injury due to fire and burn hazards,\" the CPSC recall notice said.While Elon Musk's electric vehicle and clean energy company blamed the issue on a \"third-party battery cell defect,\" it did not name the supplier.The recall notice said Tesla previously received 22 customer reports of the Powerwall 2 overheating, including five fires resulting in \"minor property damage,\" but no known injuries.Read more CNBC tech newsAnthropic to spend $50 billion on U.S. AI infrastructure, starting with Texas, New York data centersAMD CEO Lisa Su calls AI spending 'the right gamble' as stock soars on strong growth projectionsAI startup Code Metal is going beyond vibe coding with the help of $36 million in fresh capitalCisco's stock jumps on earnings beat, strong guidance and $1.3 billion in AI ordersTesla's Powerwall products are sold via its Energy division, along with giant, backup batteries that are built for utility-scale projects and use at large business facilities.The Powerwalls work with Tesla's solar photovoltaics, or solar rooftops, and can store electricity in a home for use at a later time, including during blackouts or during days or hours when electricity prices are higher.In a separate notice on Tesla's website, the company emphasized that the issue does not affect owners of newer model Powerwall systems, specifically Powerwall 3. The company website also said, \"all affected units are being replaced at no cost to customers.\"Tesla's biggest growth engine in the third quarter of 2025 came from its energy division, which sells Powerwalls. Tesla Energy saw revenue jump 44% to $3.42 billion in the third quarter, and as of the end of September, its energy segment represented about one-quarter of Tesla's overall revenue.Tesla shares fell by more than 7% on Thursday. Representatives for Tesla did not respond to a request for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tesla recalls 10,500 Powerwall 2 battery systems due to overheating, fire risk",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/102654592-RTX1B270.jpg?v=1556817395&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T19:58:22.000Z",
      "dateModified": "2025-11-13T19:58:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China economic gloom mounts as housing slump intensifies and investment slides",
    "url": "https://www.cnbc.com/2025/11/14/china-economic-slowdown-october-housing-property-investment-retail-trade-industrial-output.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225901-1763079687650-gettyimages-2241791781-img_0968.jpeg?v=1763079733&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-14T04:01:07.000Z",
    "description": "CHENGDU, CHINA - OCTOBER 18: People walk past the Louis Vuitton store at Taikoo Li, a high-end shopping area that combines traditional Sichuan-style a",
    "body": "CHENGDU, CHINA - OCTOBER 18: People walk past the Louis Vuitton store at Taikoo Li, a high-end shopping area that combines traditional Sichuan-style architecture with modern luxury retail, on October 18, 2025, in Chengdu, China. Cheng Xin | Getty Images News | Getty Images China's slowdown worsened in October, dragged by soft consumer demand and a deepening property downturn, with the long holiday period further denting factory activity.Fixed-asset investment, which includes real estate, contracted 1.7% for the first ten months of the year, steepening from a 0.5% decline in the January-to-September period, data from the National Bureau of Statistics showed Friday. Analysts polled by Reuters had forecast a 0.8% drop.The last time China recorded a contraction in fixed-asset investment was in 2020 during the pandemic, according to data going back to 1992 from Wind Information, a private database focused on the country.On a single-month basis, fixed-asset investment fell 11.4% from a year earlier, the weakest reading since early 2020 when the first Covid lockdowns hit, according to Goldman Sachs' estimates. The bank attributed the drop to Beijing's efforts in reining in industrial overcapacity and the housing downturn.Within that segment, property investment continued to decline, shrinking 14.7% in the year through October, compared with a 13.9% contraction in the first nine months.Manufacturing investment rose 2.7% and utilities spending, which includes electricity, fuel and water supplies, climbed 12.5%.Industrial output expanded 4.9% in October, slowing from a 6.5% the prior month and missing expectations for a 5.5% jump.China's manufacturing activity contracted more than expected in October, falling to the lowest level in six months, as a weeklong holiday that ran from Oct. 1 to Oct. 8 shuttered most factories across the country.Retail sales climbed 2.9% in October from a year earlier. While beating the 2.8% growth forecast in a Reuters poll, the consumption gauge fell for a fifth straight month to its lowest level this year, according to LSEG data.The survey-based urban unemployment rate ticked down to 5.1% last month from 5.2% in September. The sharp drop in fixed-asset investment was largely dragged down by lackluster investment in the property sector and infrastructure, according to Zhiwei Zhang, president and chief economist at Pinpoint Asset Management.Manufacturing investment has seen \"modest and uneven growth,\" with state-owned enterprises increasing spending on infrastructure, such as electricity, heat and gas supply, while foreign investment contracted sharply, Yuhan Zhang, principal economist of the Conference Board's China Center, said in a note.\"We will continue to see policy-directed investment in infrastructure, advanced manufacturing, and industrial upgrading,\" he added.In a sign of persistently weak demand in the beleaguered housing sector, separate official data released on Friday showed China's new home prices dipped 0.5% in October from the previous month, the steepest month-on-month decline since October last year. Home prices fell 2.2% in October on an annual basis.Consumer prices rose 0.2% from a year earlier in October, the strongest inflation reading since January this year and the first positive growth since June, according to LSEG data.The core CPI, which strips out food and energy, rose 1.2% from a year earlier, the highest since February 2024, according to data provider Wind Information.China's exports in October unexpectedly contracted for the first time in nearly two years as tensions with Washington over trade escalated before a deal was reached at the month's end.U.S. President Donald Trump and Chinese leader Xi Jinping agreed last month to trim their tit-for-tat tariffs and suspend a raft of restrictive measures for one year.Economists widely expect the  as businesses' front-loading activity tapers off, and global demand may not fully offset a deepening decline in U.S.-bound shipments, putting Beijing under greater pressure to stimulate domestic demand.\"I don't expect stimulus to happen in the rest of this year,\" said Zhang, noting the economy appears to remain on track to achieve its 5% growth target, although fiscal policy may turn more supportive at the start of next year.China's economic growth slowed to 4.8% in the third quarter, following expansions of 5.2% in the second quarter and 5.4% in the first quarter.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China economic gloom mounts as housing slump intensifies and investment slides",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225901-1763079687650-gettyimages-2241791781-img_0968.jpeg?v=1763079733&w=1920&h=1080"
      ],
      "datePublished": "2025-11-14T04:01:07.000Z",
      "dateModified": "2025-11-14T04:01:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google says group behind E-ZPass, USPS text scam has been 'shut down' after suit",
    "url": "https://www.cnbc.com/2025/11/13/google-text-scam-phishing-e-zpass-usps.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107368097-1706854529113-gettyimages-1337403692-sg019920_2021083194215547.jpeg?v=1763061905&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T21:31:22.000Z",
    "description": "The Google corporate logo hangs outside the Google Germany offices on August 31, 2021 in Berlin, Germany.Sean Gallup | Getty Images News | Getty Image",
    "body": "The Google corporate logo hangs outside the Google Germany offices on August 31, 2021 in Berlin, Germany.Sean Gallup | Getty Images News | Getty ImagesGoogle said on Thursday said it has disrupted the foreign cybercriminal group behind a massive SMS text phishing operation within 24 hours of filing its lawsuit.\"This shut down of Lighthouse's operations is a win for everyone,\" said Google general counsel Halimah DeLaine Prado. \"We will continue to hold malicious scammers accountable and protect consumers.\"Google filed the suit early Wednesday, seeking to dismantle the organization that some cyber experts have dubbed the \"Smishing Triad,\" which used a phishing kit named \"Lighthouse\" to generate and deploy attacks using fake texts.The company provided translated Telegram messages allegedly posted by the group's ringleader.\"Our cloud server has been blocked due to malicious complaints. Please be patient and we will restore it as soon as possible!\" one message read.Another message stated that \"The reopening date will be announced separately.\"Google did not provide specifics on how the operation was shut down.Read more CNBC tech newsAnthropic to spend $50 billion on U.S. AI infrastructure, starting with Texas, New York data centersAMD CEO Lisa Su calls AI spending 'the right gamble' as stock soars on strong growth projectionsAI startup Code Metal is going beyond vibe coding with the help of $36 million in fresh capitalCisco's stock jumps on earnings beat, strong guidance and $1.3 billion in AI ordersThe crime group had harmed at least 1 million victims across over 120 countries, Google said in a release.Victims would receive texts containing malicious links to fraudulent websites designed to steal sensitive financial information, including Social Security numbers and banking credentials.The messages often appeared as fake delivery updates, unpaid fees notifications, fraud alerts, and other texts designed to appear urgent.\"They were preying on users' trust in reputable brands such as E-ZPass, the U.S. Postal Service, and even us as Google,\" DeLaine Prado previously told CNBC.The company said that it found over 100 templates generated by Lighthouse using the company's branding to trick victims into thinking the sites were legitimate.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google says group behind E-ZPass, USPS text scam has been 'shut down' after suit",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107368097-1706854529113-gettyimages-1337403692-sg019920_2021083194215547.jpeg?v=1763061905&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T21:31:22.000Z",
      "dateModified": "2025-11-13T21:31:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CEO and his dad each took out second mortgages to start his company—now he could get a $4.6 billion pay package",
    "url": "https://www.cnbc.com/2025/11/13/rivian-ceo-took-out-second-mortgage-to-start-multi-billion-dollar-company.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107384249-1709839969137-gettyimages-2059234840-AFP_34L22TF.jpeg?v=1709840010&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T20:30:48.000Z",
    "description": "Rivian CEO RJ Scaringe could personally earn up to $4.6 billion over the next decade if the electric automaker hits specific profit and share price ta",
    "body": "Rivian CEO RJ Scaringe could personally earn up to $4.6 billion over the next decade if the electric automaker hits specific profit and share price targets laid out in a new compensation package recently approved by his company's board of directors.The potential payout, which is earning comparisons to Elon Musk's Tesla pay plan, likely never would have been possible had the 42-year-old Rivian founder — and his father — not made a \"financially highly irrational\" decision. In 2009, they each refinanced their houses to secure the money needed to get the company off the ground, he said in an October 2024 interview at his undergraduate alma mater, Rensselaer Polytechnic Institute.Scaringe has said that he formed Rivian, initially named Mainstream Motors, the day after he earned his PhD in mechanical engineering from the Massachusetts Institute of Technology in June 2009. He dreamed of starting an automotive business since childhood, when he helped a neighbor restore classic cars, and researched lower-emission combustion ignition engines as part of his PhD program at MIT's Sloan Automative Lab. DON'T MISS: The ultimate guide to starting a business—everything you need to know to be your own bossHis first business project: building a hybrid sports car. But he lacked enough funding to launch a capital-intensive business: A car company can require \"billions of dollars ... thousands of engineers [and] a manufacturing plant that would take years to build,\" Scaringe said at RPI.Scaringe had no employees at the time, and hadn't yet designed or built any of his proposed vehicle's underlying infrastructure or technology — so investors weren't eager to supply funding, he said.\"It's this incredibly high-risk proposition. So, because of that, my dad and I actually financed the beginning [of Rivian]. I had a house that I refinanced [and] my dad had a house that he refinanced,\" said Scaringe, adding: \"His love for me and belief in me led him to do something that was financially highly irrational…If it were not for that, it would have been impossible to get going.\" Both refinancings were second mortgages, The New York Times reported in July 2019.Scaringe initially bought his own home in high school with money he'd saved from two summer jobs — working in a restaurant and also as an apprentice machinist — and then earned extra income renting the home, he told the \"How I Built This\" podcast in a September 2022 episode.From sports cars to electric trucks and SUVsThe Rivian founder hasn't publicly disclosed how much money he secured from the two refinancings, but the funds were enough — along with some investments from \"friends and family\" — to begin hiring Rivian's first engineers and start building a prototype vehicle, he said on \"How I Built This.\"The company also rented a warehouse from Scaringe's dad, an engineer and founder of Rockledge, Florida-based Mainstream Engineering Corporation, which makes a range of HVAC and refrigeration products.Scaringe hired roughly 15 engineers and designed a four-seat, sports coupe that he hoped to eventually sell to prospective customers for around $25,000, he told the Orlando Sentinel in May 2010. After two years of development, he shelved the prototype, aiming instead to build something that could have a bigger impact on the auto industry, he told \"How I Built This.\"\"The thought of going out and building what Tesla had already done [with the electric Tesla Roadster] ... just felt like that wasn't a problem that the world needed [to be] worked on,\" Scaringe said.Scaringe went back to the drawing board, which he called one of the \"most perplexing and challenging times\" of his life. He was drawn to the challenge of building all-electric pickups and SUVs, he said — popular vehicle categories that produce more emissions than smaller cars when powered by gas engines.In 2012, Rivian raised more than $1 million in funding, led by Saudi Arabian auto distributor Abdul Latif Jameel. Scaringe met the chairman of Abdul Latif Jameel, a fellow MIT alum, through the school's alumni network and successfully pitched him on his vision for Rivian, he told \"How I Built This.\" Rivian ultimately raised $10.5 billion in funding from the likes of Amazon and Ford before going public in 2021, the same year the company's electric trucks and SUVs finally hit the market.Today, Rivian has a market value of more than $20 billion, with Scaringe owning a stake of about 1.4% in the company, according to Forbes. If Rivian hits all of the profit and share price targets in Scaringe's pay package over the next decade, its market value could increase by roughly $153 billion and Scaringe would accrue a larger stake in his business, the company said in a Nov. 7 filing with the U.S. Securities and Exchange Commission.Want to be your own boss? Sign up for CNBC's new online course, How To Start A Business: For First-Time Founders. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CEO and his dad each took out second mortgages to start his company—now he could get a $4.6 billion pay package",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107384249-1709839969137-gettyimages-2059234840-AFP_34L22TF.jpeg?v=1709840010&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T20:30:48.000Z",
      "dateModified": "2025-11-13T20:30:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Treasury yields rise as investors cheer end of government shutdown",
    "url": "https://www.cnbc.com/2025/11/13/us-treasury-yields-investors-cheer-end-of-government-shutdown-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218592-17617503312025-10-29t150015z_1906624578_rc2plharxaam_rtrmadp_0_usa-stocks.jpeg?v=1761750363&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T21:02:34.000Z",
    "description": "U.S. Treasury yields rose on Thursday as investors welcomed the end of the longest government shutdown in U.S. history.The 10-year Treasury yield gain",
    "body": "U.S. Treasury yields rose on Thursday as investors welcomed the end of the longest government shutdown in U.S. history.The 10-year Treasury yield gained 4 basis points to 4.119%. The 2-year note yield was also up more than 2 basis points at 3.595%, while the 30-year bond yield climbed 5 basis points to 4.712%.One basis point is equal to 0.01% and yields and prices move in opposite directions.Late on Wednesday, President Donald Trump signed into law a funding bill to end the U.S. government shutdown, which lasted a total of 43 days. The measure was passed by the House of Representatives on Wednesday night in a 222-209 vote.\"Republicans never wanted a shutdown,\" Trump said. \"People were hurt so badly.\" He noted that more than 1 million federal workers were furloughed.During the shutdown, key economic reports were delayed including the consumer price index, producer price index, and the non farm payrolls report.These reports may never be released, said White House press secretary Karoline Leavitt on Wednesday.\"The Democrats may have permanently damaged the Federal Statistical system with October CPI and jobs reports likely never being released,\" Leavitt said. \"All of that economic data released will be permanently impaired, leaving our policymakers at the Fed, flying blind at a critical period.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Treasury yields rise as investors cheer end of government shutdown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218592-17617503312025-10-29t150015z_1906624578_rc2plharxaam_rtrmadp_0_usa-stocks.jpeg?v=1761750363&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T21:02:34.000Z",
      "dateModified": "2025-11-13T21:02:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "IRS announces 2026 401(k) contribution limits, raises savings cap",
    "url": "https://www.cnbc.com/2025/11/13/401-k-contribution-limits-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225438-1763044184398-gettyimages-2222113009-mage24733.jpeg?v=1763044193&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T16:18:22.000Z",
    "description": "Maskot | Digitalvision | Getty ImagesThe IRS has announced new 401(k) contribution limits for 2026.In its release Thursday, the agency increased the e",
    "body": "Maskot | Digitalvision | Getty ImagesThe IRS has announced new 401(k) contribution limits for 2026.In its release Thursday, the agency increased the employee deferral limit to $24,500 next year, up from $23,500 in 2025. The change applies to 401(k)s, 403(b)s and most 457 plans, along with the federal Thrift Savings Plan. The IRS also unveiled 2026 catch-up contribution limits for savers age 50 and older, new individual retirement account savings limits and higher income thresholds for Roth IRA contributions.  Starting in 2026, the 401(k) catch-up contribution limit will rise to $8,000 for savers 50 and older, from $7,500 in 2025. But investors aged 60 to 63 can instead save an extra $11,250, based on changes enacted via Secure 2.0. That figure is unchanged from 2025.Both amounts are in addition to the $24,500 deferral limit for 2026.  Read more CNBC personal finance coverageIRS announces 2026 401(k) contribution limits, raises savings capIRS unveils 2026 IRA contribution limits, raises savings capIRS announces 401(k) catch-up contributions for 2026, raises capIRS unveils Roth IRA income limits for 2026What the Visa, MasterCard settlement means for your rewards credit cardWhere SNAP benefits stand amid negotiations to end the government shutdownWhy the AI stock boom mainly benefits the wealthyBoomers are less bullish on ETFs than younger generations — with good reasonTrump floats $2,000 tariff rebate checks: Here's what you need to knowThis is the 'biggest mistake' you can make with your IRA, attorney saysConsumers on edge as ACA 'subsidy cliff' looms: 'Quite frankly, it's terrifying'How to have tricky money talks as a couple: 'Money Together' authorsAmid FAA order flight cancellations, how credit card travel insurance worksThese annuities act like 'bumpers in a bowling lane' to limit losses: advisorAs student loan forgiveness notices go out, here are next steps for borrowersFederal workers at risk of missing more pay as government shutdown continuesCNBC's Financial Advisor 100: Best financial advisors, top firms for 2025 rankedIn 2024, only 14% of participants maxed out their 401(k)s, according to Vanguard's 2025 How America Saves report, which was based on more than 1,400 qualified plans and nearly 5 million participants. The average combined savings rate, including employer deposits, was an estimated 12%, according to the same report. A separate report found the average 401(k) savings rate, including employee and employer contributions, was a combined 14.2% during the second quarter of 2025, according to a Fidelity Investments analysis of more than 25,000 corporate plans and 24.6 million participants.    The IRS announcement comes hours after President Donald Trump signed into law a funding bill to end the longest federal government shutdown in U.S. history. It also comes roughly a month after the agency released dozens of inflation adjustments for 2026, including federal income tax brackets, higher capital gains brackets and provisions impacting families, among others.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "IRS announces 2026 401(k) contribution limits, raises savings cap",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225438-1763044184398-gettyimages-2222113009-mage24733.jpeg?v=1763044193&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T16:18:22.000Z",
      "dateModified": "2025-11-13T16:18:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "StubHub stock tanks 20% as CEO says it is not giving guidance for current quarter",
    "url": "https://www.cnbc.com/2025/11/13/stubhub-stub-q3-earnings-report-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108200067-1758126385911-STUB-OB-Photo-20250917-CC-PRESS-19.jpg?v=1758127167&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T23:04:10.000Z",
    "description": "Ticket reseller StubHub signage on display at the New York Stock Exchange for the company's IPO on Sept. 17, 2025. NYSEStubHub shares plunged 20% in e",
    "body": "Ticket reseller StubHub signage on display at the New York Stock Exchange for the company's IPO on Sept. 17, 2025. NYSEStubHub shares plunged 20% in extended trading on Thursday after the company reported quarterly results for the first time since its initial public offering in September.Here's how the ticket vendor did in comparison with LSEG consensus:Loss per share: $4.27Revenue: $468.1 million vs. $452 million expectedDuring a conference call with investors, StubHub CEO and founder Eric Baker said the company wouldn't provide guidance for the current quarter. Baker said that the company takes \"a long term approach,\" adding that the timing of when tickets go on sale can vary, making it hard to predict consumer demand. StubHub plans to offer outlook for 2026 when it reports fourth-quarter results, he said. \"The demand for live events is phenomenal,\" Baker said. \"We don't see anything with consumer demand that's any different.\"Revenue increased 8% in its second quarter from $433.8 million a year earlier, the company said.StubHub reported a net loss of $1.33 billion, or a loss of $4.27 per share, compared to a net loss of $45.9 million, or a loss of 15 cents per share, during the same period last year. StubHub said this reflects a one-time stock-based compensation charge of $1.4 billion stemming from its IPO.Gross merchandise sales, which represent the total dollar value paid by ticket buyers, rose 11% year over year to $2.43 billion.The company faced tough comparisons from a year earlier, when results were boosted by Taylor Swift's massively popular Eras Tour. Excluding that impact, StubHub said GMS grew 24% year over year.Founded in 2000, StubHub primarily generates revenue from connecting buyers with ticket resellers. It competes with Vivid Seats, which was taken public via a special purpose acquisition company in 2021; SeatGeek; and Ticketmaster parent Live Nation Entertainment.\"We are building a truly differentiated consumer product that improves the experience for fans while unlocking better economics for venues, teams, and artists through open distribution,\" Baker said in a statement. \"We're early in that journey, but our progress so far gives us great confidence in our strategy and the long-term value we're creating.\"StubHub raised $800 million in its long-awaited IPO on the New York Stock Exchange, which came after it delayed its debut twice. The most recent stall came in April after President Donald Trump's announcement of sweeping tariffs roiled markets. The company restarted the process to go public in August when it filed an updated prospectus.On Thursday, the company's stock closed at $18.82. Shares are now down roughly 20% from the IPO price of $23.50.Read more CNBC tech newsAnthropic to spend $50 billion on U.S. AI infrastructure, starting with Texas, New York data centersAMD CEO Lisa Su calls AI spending 'the right gamble' as stock soars on strong growth projectionsAI startup Code Metal is going beyond vibe coding with the help of $36 million in fresh capitalCisco's stock jumps on earnings beat, strong guidance and $1.3 billion in AI orders",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "StubHub stock tanks 20% as CEO says it is not giving guidance for current quarter",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108200067-1758126385911-STUB-OB-Photo-20250917-CC-PRESS-19.jpg?v=1758127167&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T23:04:10.000Z",
      "dateModified": "2025-11-13T23:04:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government shutdown back pay headed to federal workers in coming days",
    "url": "https://www.cnbc.com/2025/11/13/government-shutdown-federal-workers-back-pay-hassett.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225475-17630468882025-11-13t144347z_1109009803_rc2qvhavawqm_rtrmadp_0_usa-trump.jpeg?v=1763046903&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T19:37:44.000Z",
    "description": "U.S. White House economic adviser Kevin Hassett speaks in front of a TV camera at the White House in Washington, D.C., U.S., November 13, 2025. Kevin ",
    "body": "U.S. White House economic adviser Kevin Hassett speaks in front of a TV camera at the White House in Washington, D.C., U.S., November 13, 2025. Kevin Lamarque | ReutersBack pay owed to federal workers for the time they were furloughed during the government shutdown is expected to land in their bank accounts early next week, White House economic advisor Kevin Hassett said Thursday.\"There really has been an aggressive effort to get people to get their checks as soon as possible,\" Hassett told reporters, a day after President Donald Trump signed a short-term funding bill that allowed the government to reopen after 43 days.\"I think that the payments will come, probably early next week,\" Hassett said, as hundreds of thousands of federal workers returned to their offices.The timing of the payments might be affected depending on the agencies where employees work.Under federal law, government employees who are furloughed during a shutdown must be paid for the time they were out of work at their standard rate of pay \"at the earliest date possible, regardless of scheduled pay dates.\"NBC News, citing a senior administration official, reported that the White House has \"urged\" government agencies to get workers their back pay \"expeditiously and accurately.\"\"Superchecks\" for pay spanning Oct. 1 through Nov. 1 are expected to be sent out beginning Saturday for employees of the General Services Administration and the Office of Personnel Management, the official said, according to NBC.Superchecks are projected to land on Sunday in bank accounts for workers of the departments of Energy, Health and Human Services, Defense, and Veterans Affairs, the official said.On Monday, employees of the departments of Education, Interior, Transportation, as well as the Environmental Protection Agency, NSA and the Social Security Administration, and several other agencies are expected to get superchecks.Workers at the departments of Agriculture, Commerce, Homeland Security, Justice, Labor and the Treasury, as well as the Small Business Administration, are expected to receive superchecks on Wednesday.Senate staff employees will get the first paycheck that they missed during the shutdown on Friday, and the second missed paycheck on Monday, a person familiar with the situation told CNBC.House staffers received a notice that they should receive their back pay on Tuesday, or, if their accounts are at smaller banks, on Wednesday.Transportation Secretary Sean Duffy earlier this week said that air traffic controllers should get 70% of their back pay this week, with the remaining portion being paid next week.Hassett said Thursday, \"I was really pleased to see some of my furloughed employees show up today and there's a lot of hugging and smiling.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government shutdown back pay headed to federal workers in coming days",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225475-17630468882025-11-13t144347z_1109009803_rc2qvhavawqm_rtrmadp_0_usa-trump.jpeg?v=1763046903&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T19:37:44.000Z",
      "dateModified": "2025-11-13T19:37:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Goldman Sachs stands by top lawyer Kathy Ruemmler after her emails with Jeffrey Epstein exposed",
    "url": "https://www.cnbc.com/2025/11/13/goldman-sachs-jeffrey-epstein-emails-ruemmler.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225693-1763064288742-108225693-1763064188381-gettyimages-451440566-NUP_164558_0030.jpeg?v=1763071373&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T23:21:13.000Z",
    "description": "Kathy Ruemmler, former White House Counsel, appears on \"Meet the Press\" in Washington, D.C., Sunday, June 29, 2014.William B. Plowman | NBC Newswire |",
    "body": "Kathy Ruemmler, former White House Counsel, appears on \"Meet the Press\" in Washington, D.C., Sunday, June 29, 2014.William B. Plowman | NBC Newswire | NBCUniversal | Getty ImagesGoldman Sachs on Thursday strongly backed its top lawyer, Kathy Ruemmler, a day after a congressional committee released her chummy emails with notorious sex offender Jeffrey Epstein before she joined the investment bank.Those emails feature Ruemmler, who served as White House counsel to former President Barack Obama, and Epstein exchanging thoughts about President Donald Trump, former President Bill Clinton, Facebook founder Mark Zuckerberg, and overweight highway rest stop patrons.\"See you at 2, I ordered sushi for you,\" Epstein wrote Ruemmler in March 2018 as part of an email thread that began with him sending her a Daily Beast article headlined, \"How close is Donald Trump to a psychiatric breakdown?\"Those emails came about 17 months before Epstein's arrest on federal child sex trafficking charges. He killed himself weeks after that arrest in a Manhattan jail.Ruemmler is Goldman's chief legal officer and general counsel.Goldman Sachs spokesman Tony Fratto, in a statement to CNBC, said, \"These emails were private correspondence well before Kathy Ruemmler joined Goldman Sachs.\"\"Kathy is an exceptional general counsel and we benefit from her judgment every day,\" Fratto said.Ruemmler did not respond to requests for comment about her emails with Epstein on Thursday.In 2023, Ruemmler told The Wall Street Journal, \"I regret ever knowing Jeffrey Epstein.\"Ruemmler, who served as Obama's White House general counsel and as a federal prosecutor, exchanged emails with Epstein while she was a partner with the law firm Latham & Watkins, where she was global chair of the white-collar defense and investigations practice.The Journal in 2023 reported that Ruemmler \"had dozens of meetings with Epstein in the years after her White House service and before she became a top lawyer at Goldman Sachs ... in 2020.\"\"He also planned for her to join a 2015 trip to Paris and a 2017 visit to Epstein's private island in the Caribbean,\" the Journal reported then. The newspaper, citing a Goldman Sachs spokesman, reported that Epstein introduced her to potential legal clients, including Bill Gates, the founder of Microsoft.Goldman has previously said that Ruemmler had a professional relationship with Epstein connected to her role at Latham, but Latham also has said he was not a client of that firm.Her missives with Epstein, which the House Oversight Committee released on Wednesday, were exchanged years after Epstein pleaded guilty in 2008 in a Florida state court to prostitution charges involving an underage girl.Epstein served 13 months in jail in that case and had to register as a sex offender.\"Trump is living proof of the adage that it is better to be lucky than smart,\" Ruemmler wrote Epstein on Aug. 26, 2015, according to the email thread received by House Oversight from Epstein's estate pursuant to a subpoena.Epstein, who previously had been a long-time friend of Trump's, replied, \"ill give you details when I see you. when are you in ny?\"Ruemmler replied by saying she was going to New York two days later, and was considering driving there.\"I will stop to pee and get gas at a rest stop on the New Jersey turnpike, will observe all of the people there who are at least 100 pounds overweight, will have a mild panic attack as a result of the observation, and will then decide that I am not eating another bite of food for the rest of my life out of fear that I will end up like one of these people,\" Ruemmler wrote.Months later, in January 2016, Epstein emailed Ruemmler, saying, \"I stopped talking to [Bill] Clinton when he swore, with whole hearted conviction to me, that he had done something. , he had forgotten that he also swore the exact opposite to me only weeks before.\"On July 14, 2016, Epstein writes Ruemmler: \"pretty black dress. you and ruth ginsburg.\"Ruemmler replied less than 20 minutes later: \"I like that dress ... narciso Rodriguez. Where did you see that picture? RBG [the late Supreme Court Justice Ruth Bader Ginsburg] was my date to state dinner.\"Read more CNBC politics coverageDemocrats win big on Election Night in key racesZohran Mamdani wins New York City mayor's race, NBC News projectsDemocratic candidate Mikie Sherrill wins New Jersey governor's race, NBC News projectsDemocrats win Virginia governor, attorney general races, NBC News projectsSNAP update: Trump admin will pay 50% of food stamp benefits in November amid shutdownTrump says he has 'no idea who' Binance's CZ is after pardoning himTrump backtracks on attending Supreme Court tariffs case argumentsEpstein replied that the photo was on \"every news channel today,\" because Ginsburg had apologized for comments she made to The Times about Trump, in which she said, \"I can't imagine what the country would be — with Donald Trump as our president\" and that her late husband would have said it was \"time for us to move to New Zealand.\"\"Yikes,\" Ruemmler wrote.The following day, Epstein wrote a single word, \"today,\" to Ruemmler.She replied, \"that's a broad question,\" and he shot back, \"I no longer use terms like 'broad,' \" with a \"frown\" emoji following that.A year later, when Ginsburg's fears had been realized and Trump had been elected president, Ruemmler, on July 20, 2017, wrote, \"Trump is truly stupid.\"\"Duh,\" Epstein replied the following day.Ruemmler earlier that same year said in an email to Epstein that Trump was \"so gross.\"Epstein replied, \"Worse in real life and upclose.\"In August 2018, Ruemmler emailed Epstein a link to a New York Times op-ed that said there was a case to be made for impeaching Trump, in connection with hush money payments others made to two women to keep them quiet about their alleged sexual trysts with him before the 2016 election. Trump denies having sex with the women: porn star Stormy Daniels and Playboy model Karen McDougal.Those payments were made and facilitated by Trump's then-personal lawyer and fixer, Michael Cohen, who agreed to cooperate with federal prosecutors in their investigation of Trump.\"You see, i know how dirty donald is,\" Epstein wrote in that thread. \"my guess is that non-lawyers ny biz people have no idea. what it means to have your fixer flip.\"In a thread earlier that year, Epstein appeared to have forwarded a message from former Trump White House advisor Steve Bannon, who wrote, \"do you think Bill Clinton would like to join you me chud and steve? could be very funny, all off the record.\"Ruemmler replied, \"While he might like to, his lawyer would advise him against it. :-).\"In the same thread, Ruemmler wrote, \"Barf,\" after Epstein said that an unnamed woman was saying that a man named Ben was \"giving her a very hard time\" by asking her \"to do wife like things.\"In June 2018, Epstein, in an email to Ruemmler, mentioned Facebook and its founder, Zuckerberg.\"I thought you might like to look at the recent internet and privacy opinions and pose some open questions to be discussed,\" Epstein wrote. \"mark wants to bring the internet to the rest of the world ... and healthcare ... his wife is nice but boring .. what do you see as the challenges .. what does she or he see. social.\"— CNBC's Ashlee Trujillo, Caleigh Keating and MC Wellons contributed to this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Goldman Sachs stands by top lawyer Kathy Ruemmler after her emails with Jeffrey Epstein exposed",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225693-1763064288742-108225693-1763064188381-gettyimages-451440566-NUP_164558_0030.jpeg?v=1763071373&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T23:21:13.000Z",
      "dateModified": "2025-11-13T23:21:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple cuts App Store fee in half for 'mini apps' that integrate more of its software",
    "url": "https://www.cnbc.com/2025/11/13/apple-announces-new-program-that-cut-mini-app-fees-in-half.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108135265-1745406452820-gettyimages-2158694665-APPLE_APP_STORE.jpeg?v=1763056355&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T18:20:04.000Z",
    "description": "Under the EU's Digital Markets Act, Apple is required to allow developers to freely inform customers of alternative offers outside its App Store.Gabby",
    "body": "Under the EU's Digital Markets Act, Apple is required to allow developers to freely inform customers of alternative offers outside its App Store.Gabby Jones | Bloomberg via Getty ImagesApple on Thursday said it would cut the company's App Store fees from 30% to 15% for some app makers, if they enter into a new program administered by the iPhone maker.The Mini Apps Partner Program offers app developers the better fee in exchange for using some of Apple's technology to build their apps. This includes using Apple software to register a user's purchase history, verify user ages and to process in-app purchases.A \"mini app\" is a lightweight piece of software inside a third-party app store, like that of Discord's. These apps uses are built using web technology like HTML or Javascript.Most notably, China's WeChat offers offers millions of mini-apps built by other developers to let users track packages, look up transit directions and shop online. Artificial intelligence companies like OpenAI are increasingly integrating mini apps inside their chatbots.The move is Apple's latest effort to evolve its App Store. The company has been under pressure from regulators in Europe and court decisions in the U.S. to give up control over its App Store and reduce its fees. In most countries, the Apple App Store is the only way to install software on an iPhone.In recent years, the company has offered several similar programs for video apps, news apps and small app developers that cut the iPhone maker's fees in exchange for developers choosing deeper integration and participation in Apple's ecosystem.Apple has argued that both developers and users are better off when using its technology and rules, instead of eschewing them to try to avoid fees.\"This program is designed to help developers who host mini apps grow their business and further the availability of mini apps on the App Store — all while providing a great customer experience,\" the company said in its announcement.Although Apple has banned others from offering their own app stores on its platform, it has been embracing mini apps in recent years. Last year, it allowed mini-apps to start charging for in-app purchases using Apple's software for digital goods like in-game currency or lives in a video game.All iPhone developers submit their apps to Apple, which reviews the submission using humans before making the software available for download on the App Store.Participants in the new program will still have to provide Apple with information for each specific mini-app experience they offer.WATCH: Investors view Apple's capital discipline as a strategic advantage, says Plexo Capital's Lo Toneywatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple cuts App Store fee in half for 'mini apps' that integrate more of its software",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108135265-1745406452820-gettyimages-2158694665-APPLE_APP_STORE.jpeg?v=1763056355&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T18:20:04.000Z",
      "dateModified": "2025-11-13T18:20:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boeing defense workers approve new contract, ending more than 3-month strike",
    "url": "https://www.cnbc.com/2025/11/13/boeing-defense-workers-strike.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108208830-17598487452025-10-07t145034z_605503592_rc2j1fasd7go_rtrmadp_0_spirit-aerosystm-m-a-boeing-eu.jpeg?v=1760469694&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-13T20:16:37.000Z",
    "description": "FILE PHOTO: A Boeing logo is seen before the opening of the 55th International Paris Airshow at Le Bourget Airport near Paris, France, June 13, 2025.B",
    "body": "FILE PHOTO: A Boeing logo is seen before the opening of the 55th International Paris Airshow at Le Bourget Airport near Paris, France, June 13, 2025.Benoit Tessier | ReutersBoeing defense workers approved on Thursday on a new contract that will end a more than three-month strike that has delayed the manufacturer's production of F-15 fighter jets and other programs.The workers rejected previous offers, with their union saying the proposals failed to address concerns.The contract proposal the roughly 3,200 workers voted on Thursday includes 24% wage increases over five years as well as a $6,000 up-front bonus, up from $3,000, though it gets rid of a previous Boeing proposal for $4,000 in payments later on. That will bring average base pay from $75,000 to $109,000 over the contract, Boeing had said.The mostly St. Louis-based workers, represented by the International Association of Machinists and Aerospace Workers District 837, went on strike on Aug. 4, their first stoppage since 1996.\"We're proud of what our members have fought for together and are ready to get back to building the world's most advanced military aircraft,\" IAM District 837 said in a statement Thursday.Read more CNBC airline newsAirlines warn flight cancellations will continue even after shutdown endsPrivate-jet demand is on the rise amid government shutdown, says Flexjet CEOBoeing stems cash burn for first time since 2023 but takes $4.9 billion charge on 777X delaysAmerican Airlines is late to the luxury travel boom. Can it catch up?Boeing's defense unit accounted for about 30% of the $65.5 billion in sales the company brought in during the first nine months of 2025.\"We're pleased with the results and look forward to bringing our full team back together on Nov. 17 to support our customers,\" Boeing said.\"The strike impacted our fighter production, so F-15, F-18 mods as well as some of our munitions work,\" CEO Kelly Ortberg said at a Morgan Stanley investor conference on Sept. 11.Boeing brought in non-IAM-represented workers during the strike for some of its products, Ortberg said last month.The union workers will return to Boeing factories again as early as Sunday.The defense unit workers went on strike about a year after more than 32,000 unionized machinists who build commercial aircraft walked off the job for seven weeks after failed contract talks last year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boeing defense workers approve new contract, ending more than 3-month strike",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108208830-17598487452025-10-07t145034z_605503592_rc2j1fasd7go_rtrmadp_0_spirit-aerosystm-m-a-boeing-eu.jpeg?v=1760469694&w=1920&h=1080"
      ],
      "datePublished": "2025-11-13T20:16:37.000Z",
      "dateModified": "2025-11-13T20:16:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]