[
  {
    "title": "Trump instructs U.S. to resume nuclear weapons testing, citing rival nations’ programs",
    "url": "https://www.cnbc.com/2025/10/30/trump-instructs-us-to-resume-nuclear-weapons-testing-citing-rival-nations-programs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219128-1761791976811-gettyimages-473160480-Was8926788.jpeg?v=1761792000&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-30T03:30:03.000Z",
    "description": "File photo of a U.S. LGM-30G Minuteman III intercontinental ballistic missile inside a silo about 60 miles from Grand Forks Air Force Base, North Dako",
    "body": "File photo of a U.S. LGM-30G Minuteman III intercontinental ballistic missile inside a silo about 60 miles from Grand Forks Air Force Base, North Dakota.Universal History Archive | Universal Images Group | Getty ImagesU.S. President Donald Trump on Thursday instructed the Pentagon to restart nuclear weapons testing \"on an equal basis,\" citing testing programs by other countries.In a Truth Social post, Trump wrote: \"Because of other countries testing programs, I have instructed the Department of War to start testing our Nuclear Weapons on an equal basis. That process will begin immediately.\"It was not immediately clear what Trump meant by \"equal basis.\" The U.S. Department of Defense was rebranded the Department of War on Sept. 5 under an executive order, though Congress has not approved the change.The announcement followed reports that Russia had successfully tested a Poseidon nuclear-powered super torpedo on Wednesday.\"For the first time, we managed not only to launch it with a launch engine from a carrier submarine, but also to launch the nuclear power unit on which this device passed a certain amount of time,\" Russian President Vladimir Putin was quoted as saying.Moscow also tested its new Burevestnik nuclear cruise missile on Oct. 21 and conducted nuclear launch drills a day later.The U.S. has not conducted a live nuclear weapons test since 1992, when then-President George H.W. Bush imposed a unilateral testing moratorium.In 1996, the Comprehensive Nuclear Test Ban Treaty was signed by then-President Bill Clinton.Trump also claimed in his Truth Social post that the U.S. has the world's largest nuclear arsenal, adding that Russia and China would match its nuclear weapon stockpile within five years — a statement contradicted by independent data.According to estimates by the Arms Control Association, the International Campaign to Abolish Nuclear Weapons and the Federation of American Scientists, Russia possesses the most nuclear weapons in the world.Russia is estimated to have 5,459 nuclear weapons in 2025, compared to 5,177 for the U.S. and 600 for China, according to the Federation of American Scientists. The nonprofit was founded in 1945 by atomic scientists after World War II to advocate for international oversight of nuclear energy.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump instructs U.S. to resume nuclear weapons testing, citing rival nations’ programs",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219128-1761791976811-gettyimages-473160480-Was8926788.jpeg?v=1761792000&w=1920&h=1080"
      ],
      "datePublished": "2025-10-30T03:30:03.000Z",
      "dateModified": "2025-10-30T03:30:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Partners and friends’: Xi strikes conciliatory tone as he meets Trump in South Korea",
    "url": "https://www.cnbc.com/2025/10/30/trump-and-xi-land-busan-meeting-trade-and-tariffs-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219123-1761790493806-gettyimages-2244071819-ah807633_83d0liok.jpeg?v=1761790515&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-30T04:07:11.000Z",
    "description": "BUSAN, SOUTH KOREA - OCTOBER 30: U.S. President Donald Trump greets Chinese President Xi Jinping ahead of a bilateral meeting at Gimhae Air Base on Oc",
    "body": "BUSAN, SOUTH KOREA - OCTOBER 30: U.S. President Donald Trump greets Chinese President Xi Jinping ahead of a bilateral meeting at Gimhae Air Base on October 30, 2025 in Busan, South Korea. Andrew Harnik | Getty Images News | Getty ImagesChinese President Xi Jinping said Thursday that Beijing and Washington should be \"partners and friends,\" as his meeting with U.S. President Donald Trump on addressing trade and tariff concerns got underway.This is the first time the two leaders are meeting in person since Trump began his second term in January. \"We are gonna have a very successful meeting,\" Trump said at the photo-op with Xi before walking into the meeting. While calling Xi \"a very tough negotiator,\" Trump played up his ties with the Chinese leader, saying that \"we've always had a very good relationship.\"When asked whether the two leaders would finalize a trade deal at the meeting, Trump said \"could be. We'll have a great understanding.\"In his opening remarks, Xi said it was \"normal for the two leading economies of the world to have frictions now and then,\" while urging both sides to work together and \"ensure the steady sailing forward of the giant ship\" of bilateral relations, according to a statement released by the Chinese foreign ministry.Xi also lauded Trump's efforts aimed at solving regional conflicts while stressing China's role in promoting peace talks on various issues. The Trump administration earlier this month had hinted that China played a limited role in Thailand and Cambodia ceasefire talks.  \"Although the meeting itself is not about peace, [Xi] is mostly trying to create an atmosphere conducive to a deal,\" said Tianchen Xu, senior economist at the Economist Intelligence Unit.Read moreThe high-stakes meeting comes as tensions between the world's two largest economies have been on the boil this year. The latest escalation came this month, with Beijing  export controls and Washington threatening to ban software-powered exports to China. The U.S. in recent days has shared details about deals they hope to achieve with China – from restricting the flow of fentanyl to the U.S. to TikTok's divestiture from its Beijing-based parent ByteDance. Tariffs, tech curbs and rare earths are also on the table for discussion.Beijing had been more circumspect about the prospects of an agreement, but in a possible sign of thawing relationship, China bought its first cargoes of U.S. soybeans in several months, Reuters reported Wednesday. The Trump-Xi meeting may be more of a \"tactical pause than a strategic breakthrough\" with both sides contesting with disagreements core to the U.S.-China rivalry, including technology controls, supply chain and security frictions, said Han Shen Lin, China director at advisory firm The Asia Group.\"A temporary truce is better than an uncontrolled trade war,\" Lin added.Xi is in South Korea – his first state visit in 11 years – from Thursday to Saturday to attend the APEC Economic Leaders' Meeting in Gyeongju.Shortly before the meeting started, Trump said in a post on Truth Social that he had instructed the Pentagon to restart nuclear weapons testing, claiming that the U.S. has the world's largest nuclear arsenal, followed by Russia and China.The remarks were \"bold and disruptive,\" Lin said, adding that Trump was \"forcing the room to focus on U.S. leverage\" ahead of the meeting. \"If it lands a trade win, it's genius; if it poisons the well, we're in for frostier summits ahead.\"Investors are cautiously watching for headlines from Busan as the trade war between the U.S. and China has kept investors on edge. Global markets soared at the start of the week on growing optimism that the U.S. and China could near an agreement on trade.\"A return to dialogue and engagement — no matter the near-term results — is critical to moving the U.S.-China relationship forward in the long term,\" said Curtis Chin, chair at the Milken Institute, also a former U.S. ambassador to the Asian Development Bank.That said, \"headline-making deals and meetings will need to be followed by well-executed implementation and fulfillment of commitments by both sides,\" said Chin.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Partners and friends’: Xi strikes conciliatory tone as he meets Trump in South Korea",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219123-1761790493806-gettyimages-2244071819-ah807633_83d0liok.jpeg?v=1761790515&w=1920&h=1080"
      ],
      "datePublished": "2025-10-30T04:07:11.000Z",
      "dateModified": "2025-10-30T04:07:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta’s Reality Labs posts $4.4 billion loss in third quarter",
    "url": "https://www.cnbc.com/2025/10/29/metas-reality-labs-posts-4point4-billion-loss-in-third-quarter.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108200610-1758197176239-gettyimages-2235448205-META_CONNECT.jpeg?v=1761594857&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-29T21:22:50.000Z",
    "description": "Mark Zuckerberg, chief executive officer of Meta Platforms Inc., wears a pair of Meta Ray-Ban Display AI glasses during the Meta Connect event in Menl",
    "body": "Mark Zuckerberg, chief executive officer of Meta Platforms Inc., wears a pair of Meta Ray-Ban Display AI glasses during the Meta Connect event in Menlo Park, California, US, on Wednesday, Sept. 17, 2025.David Paul Morris | Bloomberg | Getty ImagesMeta continues to sink money into the metaverse, anchored by virtual reality and augmented reality technologies.The company reported third-quarter earnings on Wednesday and said that the Reality Labs division recorded an operating loss of $4.4 billion while generating $470 million in sales during the period.Wall Street was expecting Reality Labs to post an operating loss of $5.1 billion on $316 million in revenue.The Reality Labs unit is responsible for developing the company's Quest-branded family of VR headsets and Ray-Ban and Oakley AI smart glasses that Meta develops in partnership with eyewear giant EssilorLuxottica.  The company's Reality Labs division has now recorded over $70 billion in cumulative losses since late 2020, underscoring the high costs of building VR, AR and other consumer hardware.Finance chief Susan Li told analysts on Wednesday that Meta expects Reality Labs' revenue for the fourth quarter to come in below what the company reported for the same period last year. Li said this is in part because the company did not introduce a new VR headset in 2025.\"We're still expecting significant year-over-year growth in AI glasses revenue in Q4 as we benefit from strong demand for the recent products that we've introduced, but that is more than offset by the headwinds to the Quest headsets,\" Li said.Meta CEO Mark Zuckerberg in September revealed the $799 Meta Ray-Ban Display glasses, which are the company's first consumer-ready AI glasses that include a built-in display and an accompanying wristband with neural technology.EssilorLuxottica said in its most recent earnings report earlier this month that those AI glasses helped lift its sales in the third quarter.\"Clearly there is a lift coming from Ray-Ban Meta wearables as a product category,\" EssilorLuxottica CFO Stefano Grassi said during a third-quarter earnings call.With Meta's AI glasses becoming a surprise hit, investors have been monitoring for any signs that the company may be shifting its metaverse strategy.Meta on Monday said that Vishal Shah, who was leading its metaverse initiatives, is now a vice president of AI products in the company's Superintelligence Labs division that works on AI.WATCH: Market volatility reflects AI trade anxiety ahead of Mag 7 earnings.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta’s Reality Labs posts $4.4 billion loss in third quarter",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108200610-1758197176239-gettyimages-2235448205-META_CONNECT.jpeg?v=1761594857&w=1920&h=1080"
      ],
      "datePublished": "2025-10-29T21:22:50.000Z",
      "dateModified": "2025-10-29T21:22:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta CEO Mark Zuckerberg defends AI spending: 'We're seeing the returns' ",
    "url": "https://www.cnbc.com/2025/10/29/meta-ceo-mark-zuckerberg-defends-ai-spend-were-seeing-the-returns-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108200609-1758197175452-gettyimages-2235448166-META_CONNECT.jpeg?v=1761656568&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-29T23:29:42.000Z",
    "description": "Mark Zuckerberg, chief executive officer of Meta Platforms Inc., during the Meta Connect event in Menlo Park, California, US, on Wednesday, Sept. 17, ",
    "body": "Mark Zuckerberg, chief executive officer of Meta Platforms Inc., during the Meta Connect event in Menlo Park, California, US, on Wednesday, Sept. 17, 2025. David Paul Morris | Bloomberg | Getty ImagesMeta CEO Mark Zuckerberg is sounding a familiar tune when it comes to artificial intelligence: better to invest too much than too little.On his company's third-quarter earnings call on Wednesday, Zuckerberg addressed Meta's hefty spending this year, most notably its $14.3 billion investment in Scale AI as part of a plan to overhaul the AI unit, now known as Superintelligence Labs.Some skeptics worry that the spending from Meta and its competitors in AI, namely OpenAI, is fueling a bubble.For Meta's newly formed group to have enough computing power to pursue cutting-edge AI models, the company has been building out massive data centers and signing cloud-computing deals with companies like Oracle, Google and CoreWeave.Zuckerberg said the company is seeing a \"pattern\" and that it looks like Meta will need even more power than what was originally estimated. Over time, he said, those growing AI investments will eventually pay off in a big way.\"Being able to make a significantly larger investment here is very likely to be a profitable thing over, over some period,\" Zuckerberg said on the call.If Meta overspends on AI-related computing resources, Zuckerberg said, the company can repurpose the capacity and improve its core recommendation systems \"in our family of apps and ads in a profitable way.\"Along with its rivals, Meta boosted its expectations for capital expenditures.Capex this year will now be between $70 billion and $72 billion, compared to prior guidance of $66 billion to $72 billion, the company said.Meanwhile, Alphabet on Wednesday increased its range for capital expenditures to $91 billion to $93 billion, up from a previous target of $75 billion to $85 billion. And on Microsoft's earnings call after the bell, the software company said it now expects capex growth to accelerate in 2026 after previously projecting slowing expansion.Alphabet was the only one of the three to see its stock pop, as the shares jumped 6% in extended trading. Meta shares fell about 8%, and Microsoft dipped more than 3%.Zuckerberg floated the idea that if Meta ends up with excess computing power, it could offer some to third parties. But he said that isn't yet an issue.\"Obviously, if you got to a point where you overbuilt, you could have that as an option,\" Zuckerberg said.In the \"very worst case,\" Zuckerberg said, Meta ends up with several years worth of excess data center capacity. That would result in a \"loss and depreciation\" of certain assets, but the company would \"grow into that and use it over time,\" he said.As it stands today, Meta's advertising business continues to grow at a healthy pace thanks in part to its AI investments.\"We're seeing the returns in the core business that's giving us a lot of confidence that we should be investing a lot more, and we want to make sure that we're not under investing,\" Zuckerberg said.Revenue in the third quarter rose 26% from a year earlier to $51.24 billion, topping analyst estimates of $49.41 billion and representing the company's fastest growth rate since the first quarter of 2024.WATCH: Meta reports Q3 earnings beat, company takes one-time tax charge.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta CEO Mark Zuckerberg defends AI spending: 'We're seeing the returns' ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108200609-1758197175452-gettyimages-2235448166-META_CONNECT.jpeg?v=1761656568&w=1920&h=1080"
      ],
      "datePublished": "2025-10-29T23:29:42.000Z",
      "dateModified": "2025-10-29T23:29:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here are the five key takeaways from the Fed meeting and Powell news conference",
    "url": "https://www.cnbc.com/2025/10/29/fed-five-takeaways.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218883-17617643702025-10-29t185724z_1408154033_rc2ulhablmdi_rtrmadp_0_usa-fed.jpeg?v=1761764407&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-29T21:48:20.000Z",
    "description": "U.S. Federal Reserve Chair Jerome Powell holds a press conference after the Fed cut interest rates by quarter of a percentage point, in Washington, D.",
    "body": "U.S. Federal Reserve Chair Jerome Powell holds a press conference after the Fed cut interest rates by quarter of a percentage point, in Washington, D.C., U.S., Oct. 29, 2025.Kevin Lamarque | ReutersThe Federal Reserve meeting that wrapped up Wednesday both delivered on expectations and offered a few surprises. Here are five key takeaways:The Federal Open Market Committee, as expected, delivered its quarter percentage point rate cut, but not without some backstage intrigue that included two dissenting votes — one in each direction. While Governor Stephen Miran delivered a widely anticipated \"no\" vote because he preferred a half-point reduction, Kansas City Fed President Jeffrey Schmid wanted no cut, speaking for what is an apparently growing group of inflation hawks who are worried about the Fed's easing bias.Using uncharacteristically strong language, Chair Jerome Powell pushed back hard on another cut in December for which markets had been assigning about a 90% probability of happening. \"In the committee's discussions at this meeting, there were strongly differing views about how to proceed in December,\" Powell said during his news conference. \"A further reduction in the policy rate at the December meeting is not a foregone conclusion. Far from it.\" He went on to note there were \"strongly different views\" expressed by the 19 meeting participants and noted that the tone would be reflected in the meeting minutes, released in three weeks.Markets knew the end of QT was coming, but just weren't set on when. The committee laid that to rest and said quantitative tightening, or allowing assets to roll off the Fed's $6.6 trillion balance sheet, would end after the November operations. While Powell doused talk of a December cut, ending QT then could have a similar impact. At the same time, the committee indicated it would be reinvesting maturing mortgage notes in short-term bills, which Powell said will tilt the balance sheet to shorter duration with an even stronger lean toward Treasurys.On the question of inflation, Powell gave indications that it is drifting back towards the Fed's 2% goal but remains elevated — around 2.8% by the Fed's preferred measure. Tariffs are providing a boost to that number in the half percentage point range, but Powell said the view continues to be that the impact from the levies will be temporary. The inflation forecast for October is significant in that the Commerce Department will not be releasing an official number on the personal consumption expenditures price index due to the government shutdown.Powell gave a nod towards the uncertainty from the shutdown, but said the lack of public data likely doesn't change the economic picture, one of moderating growth, rising unemployment and \"somewhat elevated\" inflation. \"Although some important federal government data have been delayed due to the shutdown, the public and private sector data that have remained available suggests that the outlook for employment and inflation has not changed much since our meeting in September,\" he said.What they're saying:\"He kind of did a WWE slam on those expectations of a December rate cut. [The door is] not completely closed, I guess, but it was expected to be a foregone conclusion. And he came out pretty vociferously and said, 'Nope, better not think about it that way.'\" — Dan North, senior economist at Allianz\"So, regardless of the use of alternative data sources the Fed can draw on, we believe there is an increased chance that December's meeting may skip a cut, which would push off further accommodative rate moves into the new year, and potentially to a new Chair.\" — Rick Rieder, head of fixed income at BlackRock and finalist for Powell's job when his term as chair expires in May\"He tried to say it is not a foregone conclusion, but a December rate cut still seems likely. No Fed leader wants to be responsible for a slowdown or a recession.\" — Heather Long, chief economist at Navy Federal Credit Union",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here are the five key takeaways from the Fed meeting and Powell news conference",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218883-17617643702025-10-29t185724z_1408154033_rc2ulhablmdi_rtrmadp_0_usa-fed.jpeg?v=1761764407&w=1920&h=1080"
      ],
      "datePublished": "2025-10-29T21:48:20.000Z",
      "dateModified": "2025-10-29T21:48:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samsung’s third-quarter profit more than doubles, beating estimates on strong demand from AI chips",
    "url": "https://www.cnbc.com/2025/10/30/samsungs-third-quarter-profit-surges-160percent-as-chip-business-bounces-back-from-brutal-slump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108179470-1753922208638-gettyimages-1065011358-191112final.jpeg?v=1761781388&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-30T03:35:35.000Z",
    "description": "Headquarters of Samsung in Mountain View, California, on October 28, 2018. Smith Collection/gado | Archive Photos | Getty ImagesSamsung Electronics re",
    "body": "Headquarters of Samsung in Mountain View, California, on October 28, 2018. Smith Collection/gado | Archive Photos | Getty ImagesSamsung Electronics reported a rebound in earnings on Thursday, with operating profit more than doubling from the previous quarter, bolstered by strong memory chip demand from artificial intelligence servers. Here are Samsung's third-quarter results compared with LSEG SmartEstimate, which is weighted toward forecasts from analysts who are more consistently accurate:Revenue: 86.1 trillion Korean won ($60.5 billion) vs. 85.93 trillion won Operating profit: 12.2 trillion won vs. 11.25 trillion wonThe South Korean technology giant's quarterly revenue rose 8.85% from a year earlier, while its first-quarter operating profit climbed 32.9% in the same period. Samsung shares popped nearly 4% in early trading in Asia.The earnings represent a bounce back from the June quarter, which had been weighed down by a massive slump in Samsung's chip business. Operating profit increased by 160% compared to June, while revenue increased by 15.5% over the same period. Samsung Electronics, South Korea's largest company by market capitalization, is a leading provider of memory chips, semiconductor foundry services and smartphones.The company's earnings were lifted by its chip business, which saw operating profit increase over tenfold from the June quarter on strong demand for AI servers.Samsung predicted that AI chip demand would continue to grow, echoing sentiments from memory rival SK Hynix, which reported earnings on Wednesday.\"We expect data center companies to continuously expand their hardware investment because of the ongoing competition to secure AI infrastructure,\" a Samsung executive said during an earnings call.\"Therefore, our AI-related server demand keeps growing, and this demand significantly exceeds industry supply,\" he added.Chip Business Samsung's chip business reported a 19% increase in sales from the June quarter, with its memory business setting an all-time high for quarterly sales, driven by strong demand for artificial intelligence.Chip revenue increased to 33.1 trillion Korean won, up 13% from last year, while operating profit rose 81% to 7.0 trillion Korean won over the same period.Also known as its Device Solutions division, Samsung's chip business encompasses memory chips, semiconductor design and its foundry units.Samsung said the unit benefited from a favorable price environment, while quarterly revenues reached a record high on expanded sales of its high-bandwidth memory (HBM) chips — a type of memory used in artificial intelligence computing.The company has found itself lagging behind memory rival SK Hynix in the HBM market, after it was slow to secure major contracts with leading AI chip Nvidia. However, in a positive sign for the company, it reportedly passed Nvidia's qualification tests for an advanced HBM chip last month.A report from Counterpoint Research earlier this month found that Samsung had reclaimed the top spot in the memory market ahead of SK Hynix in the third quarter after falling behind its competitor for the first time the quarter prior. MS Hwang, research director at Counterpoint Research, told CNBC that Samsung's third-quarter performance was a clear result of a broader \"memory market boom\" and rising prices for general-purpose memory.Heading into 2026, Samsung said its memory business will focus on the mass production of its next-generation HBM technology, HBM4.Smartphones Samsung's mobile experience and network businesses, tasked with developing and selling smartphones, tablets, wearables and other devices, reported a rise in both sales and profit.The unit posted an operating profit of 3.6 trillion won in the third quarter, up about 28% from the same period last year. The company said earnings were driven by robust flagship smartphone sales, including the launch of its Galaxy Z Fold7 device.Samsung forecasted that the rapid growth of the AI industry would open up new market opportunities for both its devices and chip businesses in the current quarter.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung’s third-quarter profit more than doubles, beating estimates on strong demand from AI chips",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108179470-1753922208638-gettyimages-1065011358-191112final.jpeg?v=1761781388&w=1920&h=1080"
      ],
      "datePublished": "2025-10-30T03:35:35.000Z",
      "dateModified": "2025-10-30T03:35:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Azure outage: Microsoft still working on fix, says recovery expected in several hours",
    "url": "https://www.cnbc.com/2025/10/29/microsoft-hit-with-azure-365-outage-ahead-of-quarterly-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108194599-1757020886905-gettyimages-2233036958-AI_EDUCATION_WH.jpeg?v=1761754811&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-29T23:39:47.000Z",
    "description": "Microsoft CEO Satya Nadella departs following a meeting of the White House Task Force on AI Education in the East Room of the White House in Washingto",
    "body": "Microsoft CEO Satya Nadella departs following a meeting of the White House Task Force on AI Education in the East Room of the White House in Washington on Sept. 4, 2025.Eric Lee | Bloomberg | Getty ImagesMicrosoft was hit with outages in its Azure cloud and 365 services on Wednesday, hours before the company's quarterly earnings release.Users on social media reported problems accessing their sites and services running on Microsoft's products, and the company's websites, including its Xbox and investor relations pages, were down. The problems began around 11:40 a.m. ET, according to Downdetector, which relies on user reports.\"We are working to address an issue affecting Azure Front Door that is impacting the availability of some services,\" a Microsoft spokesperson said in an emailed statement. \"Customers should continue to check their Service Health Alerts and the latest update on this issue can be found on the Azure status page.\"The Azure support account on X said, \"We're investigating an issue impacting several Azure services,\" and that \"customers may experience issues when accessing services.\"The latest update on Azure's status page says that issues began with AFD at about noon ET, and that customers and Microsoft services using AFD \"may have experienced latencies, timeouts and errors.\" The company said it suspects an \"inadvertent configuration change\" was the trigger, and that it's \"rolling back to our last known good state\" for AFD services.Microsoft said it's \"seeing strong sighs of improvement across affected regions and are tracking toward full mitigation\" by 7:40 p.m. ET.The company listed more than a dozen Azure services that were hit, including Azure Databricks, Azure Maps and Azure Virtual Desktop. Microsoft's 365 status account wrote that its services are \"experiencing downstream impact related to the ongoing Azure outage.\"The service disruptions come a little over a week after larger rival Amazon Web Services reported a major outage that took down numerous websites. Throughout the day on Oct. 20, AWS said it observed \"increased error rates\" for customers when trying to launch new instances in EC2, its popular cloud service that provides virtual server capacity.AWS leads in cloud infrastructure with 32% of the market as of the first quarter, according to Canalys. Azure is second at 23%, followed by Google's cloud unit at 10%. Azure and Google Cloud have been growing faster of late, driven by a boom in artificial intelligence workloads.All three companies report quarterly results this week, starting with Microsoft and Google parent Alphabet on Wednesday after the bell. Amazon reports on Thursday.Alaska Airlines said on Wednesday afternoon that it's currently \"experiencing a disruption to key systems,\" including websites, due to the outage on Azure, \"where several Alaska and Hawaiian Airlines services are hosted.\" Alaska closed its $1.9 billion acquisition of Hawaiian last year.In March, Microsoft suffered an outage over a weekend that left tens of thousands of users unable to access their Outlook email accounts and other programs.WATCH: Microsoft hit with Azure, 365 outageswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Azure outage: Microsoft still working on fix, says recovery expected in several hours",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108194599-1757020886905-gettyimages-2233036958-AI_EDUCATION_WH.jpeg?v=1761754811&w=1920&h=1080"
      ],
      "datePublished": "2025-10-29T23:39:47.000Z",
      "dateModified": "2025-10-29T23:39:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Korean auto, shipbuilding shares climb after trade deal finalized ",
    "url": "https://www.cnbc.com/2025/10/30/south-korean-auto-shipbuilding-shares-climb-after-trade-deal-finalized-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219114-1761788998628-gettyimages-1950963383-SKOREA_ULSAN.jpeg?v=1761789007&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-30T01:51:19.000Z",
    "description": "watch nowSouth Korean auto and shipbuilding stocks rallied Thursday after Seoul and Washington finalized a trade deal announced back in July.Hanwha Oc",
    "body": "watch nowSouth Korean auto and shipbuilding stocks rallied Thursday after Seoul and Washington finalized a trade deal announced back in July.Hanwha Ocean spiked as much as 14.9% while Samsung Heavy Industries climbed 8.33% at its peak. Defense product maker Firstec also rose as much as 9.7%.Automakers Hyundai and Kia saw gains of around 12% and 9% respectively.The agreement, detailed following a meeting between President Lee Jae Myung and U.S. President Donald Trump, includes lower U.S. tariffs on South Korean goods in exchange for a $350 billion investment pledge from Seoul — a move that could reshape trade and defense ties between the two allies.Under the new terms, U.S. tariffs on South Korean exports will drop to 15% from the earlier \"tariff letter\" rate of 25%. South Korea's $350 billion investment pledge reportedly includes $200 billion in direct investment and $150 billion allocated to shipbuilding cooperation.The $200 billion in investment would be capped at $20 billion per year, South Korea's chief policy advisor, Kim Yong-beom, was reported as saying.Trump also said in a Truth Social post that he had approved South Korea to build a nuclear submarine in \"the Philadelphia Shipyards.\" This would be Seoul's first nuclear submarine.South Korean shipbuilder Hanwha had made a $5 billion investment into the Philly Shipyards back in August as part of Seoul’s earlier commitment to invest $150 billion.\"As President Trump and President Lee make shipbuilding a central plank in the U.S.-Korea alliance, Hanwha stands ready to support with our advanced shipbuilding scale,\" Alex Wong, Hanwha Chief Strategy Officer, said in a statement.South Korea's Yonhap also reported that a fact sheet covering both the trade and security components of the agreement between Seoul and Washington will be released in the coming days.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Korean auto, shipbuilding shares climb after trade deal finalized ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219114-1761788998628-gettyimages-1950963383-SKOREA_ULSAN.jpeg?v=1761789007&w=1920&h=1080"
      ],
      "datePublished": "2025-10-30T01:51:19.000Z",
      "dateModified": "2025-10-30T01:51:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ServiceNow tops estimates, approves 5-for-1 stock split",
    "url": "https://www.cnbc.com/2025/10/29/servicenow-now-earnings-q3-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217775-1761657308000-gettyimages-2223987540-ALLEN__CO_2025.jpeg?v=1761657355&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-29T20:53:32.000Z",
    "description": "Bill McDermott, chief executive officer of ServiceNow Inc., during the Allen & Co. Media and Technology Conference in Sun Valley, Idaho, US, on Thursd",
    "body": "Bill McDermott, chief executive officer of ServiceNow Inc., during the Allen & Co. Media and Technology Conference in Sun Valley, Idaho, US, on Thursday, July 10, 2025. David Paul Morris | Bloomberg | Getty ImagesServiceNow reported third-quarter results on Wednesday that blew past Wall Street's estimates, with the company also approving a five-for-one stock split.Shares rose 4% after the bell.Here's how the company did versus LSEG estimates.Earnings per share: $4.82 adjusted vs. $4.27 expectedRevenue: $3.41 billion vs. $3.35 billion expectedThird-quarter subscription revenues, which account for the bulk of the enterprise software company's sales, totalled $3.3 billion and surpassed a $3.26 billion estimate from StreetAccount. Overall revenues grew 22% from the year-ago period.ServiceNow bumped up full-year guidance, saying it now expects subscription revenue to range between $12.84 billion and $12.85 billion for the year. Last quarter, the company raised FY guidance to a range of $12.78 billion to $12.80 billion.Like many software companies, ServiceNow is benefitting from the artificial intelligence transformation that's forcing more businesses to adopt the tools.\"Every enterprise in every industry is focused on AI as the innovation opportunity of our generation,\" wrote CEO Bill McDermott in a release. He called the results the \"clearest demonstration\" that businesses are relying on ServiceNow for these capabilities.Read more CNBC tech newsApple's iPhone Air doesn't look like a best-seller. It might not matterAmazon opens $11 billion AI data center in rural Indiana as rivals race to break groundNvidia CEO Jensen Huang starts a key trip to South Korea — here's what he might be up toSK Hynix, a critical Nvidia supplier, has already sold out chips for 2026 as AI demand boomsFinance chief Gina Mastantuono told CNBC that the annual contract value for ServiceNow's AI business is projected to surpass $500 million this year and on track toward the goal set at its investor day to reach $1 billion by 2026.\"The value AI is going to create in enterprise is like nothing that we've seen in a very, very long time,\" she said. \"We have real customers, it's not just hype, and we have real values and we're driving real outcomes for those customers.\"Net income hit $502 million, or $2.40 per share, up from $432 million, or $2.07 per share, during the same quarter in 2024. Current remaining performance obligations reached $11.35 billion.ServiceNow said its fourth-quarter guidance accounts for ongoing U.S. government uncertainty and the recent shutdown. The company expects $3.42 billion to $3.43 billion in subscription revenues.\"Whenever the government reopens, the administration's continued focus on cost efficiency and modernization aligns directly with our strengths,\" she said, adding that ServiceNow's U.S. federal business grew more than 30% in the third quarter.ServiceNow's board also approved a five-for-one stock split slated for the beginning of December. Mastantuono said the split will make shares accessible to more retail investors.The stock is down about 13% year to date.Stock Chart IconStock chart iconServiceNow year-to-date stock chart.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ServiceNow tops estimates, approves 5-for-1 stock split",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217775-1761657308000-gettyimages-2223987540-ALLEN__CO_2025.jpeg?v=1761657355&w=1920&h=1080"
      ],
      "datePublished": "2025-10-29T20:53:32.000Z",
      "dateModified": "2025-10-29T20:53:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alphabet tops $100 billion quarterly revenue for first time, cloud grows 34%",
    "url": "https://www.cnbc.com/2025/10/29/alphabet-google-q3-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108175922-1761769839779-108175922-1753295096051-gettyimages-2215577882-AFP_47H33MP.jpeg?v=1761769853&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-29T22:25:53.000Z",
    "description": "watch nowAlphabet reported third-quarter earnings that beat analyst expectations. Shares rose 5% in after-hours trading.Here's how the company did, co",
    "body": "watch nowAlphabet reported third-quarter earnings that beat analyst expectations. Shares rose 5% in after-hours trading.Here's how the company did, compared with estimates from analysts polled by LSEG:Revenue: $102.35 billion vs. $99.89 billion estimatedEarnings per share: $3.10 adj. vs $2.33 estimatedWall Street was also watching several other numbers in the report:YouTube advertising revenue: $10.26 billion vs. $10.01 billion, according to StreetAccountGoogle Cloud revenue:  $15.15 billion vs. $14.74 billion, according to StreetAccountTraffic acquisition costs (TAC): $14.87 billion vs. $14.82 billion, according to StreetAccountAlphabet reported solid momentum in its cloud business, thanks to strong demand for artificial intelligence. The company also announced an increase in expected capital expenditures for the fiscal year 2025.\"With the growth across our business and demand from Cloud customers, we now expect 2025 capital expenditures to be in a range of $91 billion to $93 billion,\" the company said in its earnings report Wednesday. \"Looking out to 2026, we expect a significant increase in CapEx and will provide more detail on our fourth quarter earnings call,\" said finance chief Anat Ashkenazi on the earnings call with investors Wednesday.Earlier this year, the company increased its capital expenditure expectation from $75 billion to $85 billion. Most of that goes toward technical infrastructure such as data centers.The latest earnings show the company is seeing rising demand for its AI services, which largely sit in its cloud unit. It also shows the company is continuing to spend more to try and build out more infrastructure to accomodate the backlog of customer requests.\"We continue to drive strong growth in new businesses. Google Cloud accelerated, ending the quarter with $155 billion in backlog,\" CEO Sundar Pichai said in the earnings release.The backlog comes from demand for enterprise AI infrastructure, including chips and demand for Gemini 2.5, said Ashkenazi.Read more CNBC tech newsApple's iPhone Air doesn't look like a best-seller. It might not matterAmazon opens $11 billion AI data center in rural Indiana as rivals race to break groundNvidia CEO Jensen Huang starts a key trip to South Korea — here's what he might be up toSK Hynix, a critical Nvidia supplier, has already sold out chips for 2026 as AI demand boomsThe company reported cloud revenue of $15.15 billion, a 35% increase from the same period last year.\"We have signed more deals over one billion dollars through Q3 this year than we did in the previous two years combined,\" said Pichai, referring to the first nine months of the year. In August, Google won a $10 billion cloud contract from Meta spanning six years. Alphabet, which reported 32% cloud revenue growth last quarter, is keeping pace with its megacap competitors. Microsoft posted 40% revenue growth in its Azure cloud business as it reported earnings on Wednesday.Over 70% of existing Google Cloud customers use its AI products, Pichai said. That's a result of the company's strategy to upsell existing customers.Google's flagship AI app Gemini now has more than 650 million monthly active users, the company said in its Wednesday report. That's up from the 450 million active users Pichai said it had last quarter. OpenAI CEO Sam Altman said earlier this month that ChatGPT now has 800 million users per week.Google's search business generated $56.56 billion in revenue — up 15% from the prior year.Alphabet's net income increased to $34.97 billion, or $2.87 per share, compared to $26.3 billion, or $2.12 per share, in the year-ago quarter. In September, Google was slapped with a $3.45 billion antitrust fine from European Union regulators for anti-competitive practices in its lucrative advertising technology business. That fine impacted the reported net income.YouTube advertising revenue came in at $10.26 billion, higher than Wall Street expected. Alphabet reported overall advertising revenue of $74.18 billion — up from $65.85 billion last year.Other Bets, which includes the company's life sciences unit Verily and self-driving car unit Waymo, reported revenue of $344 million during the quarter. That's lower than the $388 million from the same quarter last year. Alphabet reported a loss of $1.42 billion on other bets, compared to a loss of $1.12 billion the year before.The Google parent's stock is up 45% so far this year.Stock Chart IconStock chart iconAlphabet one-day stock chart.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alphabet tops $100 billion quarterly revenue for first time, cloud grows 34%",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108175922-1761769839779-108175922-1753295096051-gettyimages-2215577882-AFP_47H33MP.jpeg?v=1761769853&w=1920&h=1080"
      ],
      "datePublished": "2025-10-29T22:25:53.000Z",
      "dateModified": "2025-10-29T22:25:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft stock drops on forecast for increased spending growth this year",
    "url": "https://www.cnbc.com/2025/10/29/microsoft-msft-q1-2026-earnings-report.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108188843-1755732260764-gettyimages-1730506424-axelspringeraward_9946.jpeg?v=1761669022&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-29T23:24:42.000Z",
    "description": "Microsoft CEO Satya Nadella speaks at Axel Springer Neubau in Berlin on Oct. 17, 2023.Ben Kriemann | Getty ImagesMicrosoft reported better-than-expect",
    "body": "Microsoft CEO Satya Nadella speaks at Axel Springer Neubau in Berlin on Oct. 17, 2023.Ben Kriemann | Getty ImagesMicrosoft reported better-than-expected results for its fiscal first quarter as revenue in the company's Azure cloud business jumped 40%.The stock slipped almost 4% in extended trading after finance chief Amy Hood said growth in capital expenditures will accelerate this fiscal year.Earnings per share: $3.72 vs. $3.67 per share expectedRevenue: $77.67 billion vs. $75.33 billion expectedRevenue increased 18% in the fiscal first quarter from $65.6 billion a year ago, according to a release. Net income rose to $27.7 billion from $24.67 billion, or $3.30 per share, during the same period last year.Microsoft said its investment in OpenAI resulted in a $3.1 billion hit to net income in the quarter, equivalent to 41 cents per share.Microsoft's Intelligent Cloud unit, which includes Azure, reported $30.9 billion in revenue, up 28% from a year ago and above the StreetAccount consensus of $30.25 billion. Growth in Azure, which competes with Amazon Web Services and Google Cloud, also beat estimates, as analysts polled by StreetAccount had anticipated 38.2% expansion.Cloud continues to be the big driver of growth at Microsoft, as the business has proven to be a major beneficiary of the AI boom. Last quarter, Microsoft disclosed the scale of its Azure cloud infrastructure business in dollars for the first time. The company said revenue in fiscal 2025 from Azure and other cloud services jumped 34% from the prior year to more than $75 billion.For the fiscal second quarter, Microsoft said on the earnings call that expects revenue in the range of $79.5 billion to $80.6 billion. The middle of the range is $80.05 billion, while analysts were expecting $79.95 billion, according to LSEG.The company said it expects Azure growth at constant currency will be 37% in the fiscal second quarter, inline with estimates.Investors were listening closely for Microsoft's commentary on capital expenditures as the company races to build out the infrastructure necessary to support AI demand. Hood said capex for the first quarter came in at $34.9 billion. She told investors in July that the company expected to spend $30 billion in capex and assets acquired through leases during the quarter.Hood said that the capex growth rate for fiscal 2026 will be above the rate in 2025. She'd previously said there would be a slowdown in growth.Microsoft's Productivity and Business Processes segment, which is home to Office productivity software and LinkedIn, delivered $33 billion in revenue for the first quarter, above the $32.33 billion consensus among analysts polled by StreetAccount.The More Personal Computing unit, which includes Windows, search advertising, devices and video games, reported 4% growth to $13.8 billion in revenue. That was above StreetAccount's $12.83 billion consensus.Microsoft's earnings landed hours after the company experienced an outage in Azure and its 365 services. Various websites and games were down for hours, and Microsoft said it expects recovery by this evening.Microsoft shares are up 28% this year, as of Wednesday's close, and hit a record a day earlier. Much of its AI momentum has been attributed to its tight relationship with OpenAI.On Tuesday, OpenAI announced it has completed its restructuring and formally outlined Microsoft's stake in the company. Under the new structure, OpenAI's nonprofit will hold a 26% stake in its for-profit arm, worth about $130 billion. Microsoft will hold a 27% stake worth about $135 billion, and current and former employees and investors will own the remaining 47%.Correction: This story has been updated with the EPS figure that's comparable to analyst estimates. WATCH: Microsoft market cap jumps to $4 trillionwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft stock drops on forecast for increased spending growth this year",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108188843-1755732260764-gettyimages-1730506424-axelspringeraward_9946.jpeg?v=1761669022&w=1920&h=1080"
      ],
      "datePublished": "2025-10-29T23:24:42.000Z",
      "dateModified": "2025-10-29T23:24:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube offers voluntary buyouts as company reorganizes around AI",
    "url": "https://www.cnbc.com/2025/10/29/youtube-offers-voluntary-buyouts-as-company-reorganizes-around-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108146149-1747324974303-gettyimages-2203987828-mhay4538_tluavci4.jpeg?v=1761776682&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-29T22:49:22.000Z",
    "description": "A Youtube podcast microphone is seen at the Variety Podcasting Brunch Presented By YouTube at Austin Proper Hotel in Austin, Texas, on March 8, 2025.M",
    "body": "A Youtube podcast microphone is seen at the Variety Podcasting Brunch Presented By YouTube at Austin Proper Hotel in Austin, Texas, on March 8, 2025.Mat Hayward | Variety | Getty ImagesYouTube is offering voluntary buyouts with severance for U.S.-based employees as it restructures its product organization to focus more on artificial intelligence.The move comes as Google CEO Sundar Pichai pushes employees to boost productivity by using AI across the company.In an internal memo to staff, YouTube CEO Neal Mohan said the platform is reorganizing its product teams for the first time in a decade.\"Looking to the future, the next frontier for YouTube is AI,\" a YouTube spokesperson said in a statement to CNBC. The buyouts were first reported by Alex Heath at Sources.YouTube said no roles are being eliminated as part of the change.Under the new structure, three product groups will now report directly to Mohan.Christian Oestlien, previously vice president of product management, will lead the subscription products division, which oversees YouTube Music and Premium, YouTube TV, Primetime Channels, Podcasts and Commerce.Chief Product Officer Johanna Voolich will lead the viewer products team, which covers YouTube's main app, Living Room, Search and Discovery, YouTube Kids, Learning and Trust and Safety.Companies across the tech industry are reshaping their workforces as they adapt to rapid advances in AI while also reckoning with other challenges, like higher costs from tariffs. On Tuesday, Amazon announced plans to lay off about 14,000 corporate employees as it invests in AI initiatives.WATCH: Amazon announces layoffswatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube offers voluntary buyouts as company reorganizes around AI",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108146149-1747324974303-gettyimages-2203987828-mhay4538_tluavci4.jpeg?v=1761776682&w=1920&h=1080"
      ],
      "datePublished": "2025-10-29T22:49:22.000Z",
      "dateModified": "2025-10-29T22:49:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google expects 'significant increase' in capital expenditure in 2026, execs say",
    "url": "https://www.cnbc.com/2025/10/29/google-expects-significant-increase-in-capex-in-2026-execs-say.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108198794-1757946595048-gettyimages-2217999139-BLOOMBERG_TECH.jpeg?v=1761777160&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-29T23:27:24.000Z",
    "description": "Sundar Pichai, chief executive officer of Alphabet Inc., during the Bloomberg Tech conference in San Francisco, California, US, on Wednesday, June 4, ",
    "body": "Sundar Pichai, chief executive officer of Alphabet Inc., during the Bloomberg Tech conference in San Francisco, California, US, on Wednesday, June 4, 2025. David Paul Morris | Bloomberg | Getty ImagesGoogle parent Alphabet is planning a \"significant increase\" in spend next year as it continues to invest in AI infrastructure to meet the demand of its customer backlog, executives said Wednesday.The company reported its first $100 billion revenue quarter on Wednesday, beating Wall Street's expectations for Alphabet's third quarter. Executives then said that the company plans to grow its capital spend for this year.\"With the growth across our business and demand from Cloud customers, we now expect 2025 capital expenditures to be in a range of $91 billion to $93 billion,\" the company said in its earnings report. It marks the second time the company increased its capital expenditure this year. In July, the company increased its expectation from $75 billion to $85 billion, most of which goes toward investments in projects like new data centers.There'll be even more spend in 2026, executives said Wednesday.\"Looking out to 2026, we expect a significant increase in CapEx and will provide more detail on our fourth quarter earnings call,\" said Anat Ashkenazi, Alphabet's finance chief.The latest increases come as companies across the industry race to build more infrastructure to keep up with billions in customer demand for the compute necessary to power AI services. Also on Wednesday, Meta raised the low end of its guidance for 2025 capital expenditures by $4 billion, saying it expects that figure to come in between $70 billion and $72 billion. That figure was previously $66 billion to $72 billion.Google executives explained that they're racing to meet demand for cloud services, which saw a 46% quarter-over-quarter growth to the backlog in the third quarter.\"We continue to drive strong growth in new businesses,\" CEO Sundar Pichai said. \"Google Cloud accelerated, ending the quarter with $155 billion in backlog.\"The company reported 32% cloud revenue growth from the year prior and is keeping pace with its megacap competitors. Pichai and Ashkenazi said the company has received more $1 billion deals in the last nine months than it had in the past two years combined. In August, Google won a $10 billion cloud contract from Meta spanning six years. Anthropic last week announced a deal that gives the artificial intelligence company access to up to 1 million of Google's custom-designed Tensor Processing Units, or TPUs. The deal is worth tens of billions of dollars.The spend on infrastructure is also helping the company improve its own AI products, executives said on the call.Google's flagship AI app Gemini now has more than 650 million monthly active users. That's up from the 450 million active users Pichai reported the previous quarter. Search also improved thanks to AI advancements, executives said. Google's search business generated $56.56 billion in revenue — up 15% from the prior year, tempering fears that the competitive AI landscape may be cannibalizing the company's core search and ads business.AI Mode, Google's AI product that lays within its search engine, has 75 million daily active users in the U.S., and those search queries doubled over the third quarter, executives said. They also reiterated that the company is testing ads in that AI Mode product.WATCH: Google catching up with Meta pulled on shares following earnings, says D.A. Davidson's Gil Luriawatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google expects 'significant increase' in capital expenditure in 2026, execs say",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108198794-1757946595048-gettyimages-2217999139-BLOOMBERG_TECH.jpeg?v=1761777160&w=1920&h=1080"
      ],
      "datePublished": "2025-10-29T23:27:24.000Z",
      "dateModified": "2025-10-29T23:27:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft takes $3.1 billion hit from OpenAI investment",
    "url": "https://www.cnbc.com/2025/10/29/microsoft-open-ai-investment-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108147622-1747681700109-gettyimages-2215434051-AFP_47CH4DB.jpeg?v=1761770857&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-29T21:37:39.000Z",
    "description": "Microsoft Chairman and Chief Executive Officer Satya Nadella (L), speaks with OpenAI Chief Executive Officer Sam Altman, who joined by video during th",
    "body": "Microsoft Chairman and Chief Executive Officer Satya Nadella (L), speaks with OpenAI Chief Executive Officer Sam Altman, who joined by video during the Microsoft Build 2025, conference in Seattle, Washington on May 19, 2025. Jason Redmond | AFP | Getty ImagesMicrosoft took a $3.1 billion hit to its net income in the first quarter due to the software company's hefty investment in OpenAI.In its earnings report on Wednesday, Microsoft said the drop in profit reflected an \"equity method investment,\" resulting in a 41-cent decline in earnings per share. Net income still rose to $27.7 billion, or $3.72 per share, from $24.67 billion, or $3.30 per share, a year ago.Since first backing OpenAI in 2019, Microsoft has committed to invest $13 billion in the company, with $11.6 billion already funded as of the end of September, according to a filing.The announcement comes a day after OpenAI announced that it completed a recapitalization, cementing its structure as a nonprofit with a controlling stake in its for-profit business. The nonprofit, now called the OpenAI Foundation, holds an equity stake worth about $130 billion in its for-profit arm.Read more CNBC tech newsApple's iPhone Air doesn't look like a best-seller. It might not matterAmazon opens $11 billion AI data center in rural Indiana as rivals race to break groundNvidia CEO Jensen Huang starts a key trip to South Korea — here's what he might be up toSK Hynix, a critical Nvidia supplier, has already sold out chips for 2026 as AI demand boomsUnder the new structure, the OpenAI Foundation will hold a 26% stake in the for-profit, with 47% held by current and former employees and investors.Microsoft now holds an investment in the public benefit corporation that's valued at $135 billion, or roughly 27% of the company on an as-converted diluted basis.Microsoft said that under the agreement, \"OpenAI has contracted to purchase an incremental $250 billion of Azure services,\" and that Microsoft will no longer have the right of first refusal as a compute provider.On Wednesday's earnings call, Microsoft CEO Satya Nadella called the relationship \"one of the most successful partnerships and investments our industry has even seen,\" adding that \"we continue to benefit mutually from each other's growth across multiple dimensions.\" While Microsoft and OpenAI have been partners for over half a decade, long preceding the launch of ChatGPT in late 2022, the companies are increasingly competing in various parts of the AI market.Over a year ago, Microsoft added OpenAI to the list of competitors in the company's latest annual report, a roster that has included megacap peers Amazon, Apple, Google and Meta.In that filing, Microsoft identified OpenAI, the creator of the ChatGPT chatbot, as a competitor in AI offerings and in search and news advertising. Just ahead of that disclosure, OpenAI announced a prototype of a search engine called SearchGPT.Microsoft has largely relied on OpenAI's models to power AI features in its key products. But in August, Microsoft said that it had begun publicly testing a homegrown AI model that could lead to enhancements to its Copilot assistant for consumers.Microsoft reported better-than-expected earnings and profit on Wednesday. Its big growth driver remains the Azure cloud, which saw 40% revenue expansion, topping estimates.WATCH: OpenAI clears restructuring hurdlewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft takes $3.1 billion hit from OpenAI investment",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108147622-1747681700109-gettyimages-2215434051-AFP_47CH4DB.jpeg?v=1761770857&w=1920&h=1080"
      ],
      "datePublished": "2025-10-29T21:37:39.000Z",
      "dateModified": "2025-10-29T21:37:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fed cuts rates again, but Powell raises doubts about easing at next meeting",
    "url": "https://www.cnbc.com/2025/10/29/fed-rate-decision-october-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218869-1761764020808-gettyimages-2243488623-AFP_82FA4GE.jpeg?v=1761764093&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-29T19:57:56.000Z",
    "description": "US Federal Reserve Chair Jerome Powell speaks during a press conference at the end of a Monetary Policy Committee meeting in Washington, DC, on Oct. 2",
    "body": "US Federal Reserve Chair Jerome Powell speaks during a press conference at the end of a Monetary Policy Committee meeting in Washington, DC, on Oct. 29, 2025. Jim Watson | AFP | Getty ImagesThe Federal Reserve on Wednesday approved its second straight interest rate cut, though Chair Jerome Powell rattled markets when he threw doubt on whether another reduction is coming in December.By a 10-2 vote, the central bank's Federal Open Market Committee lowered its benchmark overnight borrowing rate to a range of 3.75%-4%. In addition to the rate move, the Fed announced that it would be ending the reduction of its asset purchases – a process known as quantitative tightening – on Dec 1.Governor Stephen Miran again cast a dissenting vote, preferring the Fed move more quickly with a half-point cut. Kansas City Fed President Jeffrey Schmid joined Miran in dissenting but for the opposite reason – he preferred the Fed not cut at all. Miran is an appointee of President Donald Trump, who has pushed hard on the committee to lower rates quickly.The rate also sets a benchmark for a variety of consumer products such as auto loans, mortgages and credit cards.The post-meeting statement did not provide any direction on what the committee's plans are for December. At the September meeting, officials indicated the likelihood of three total cuts this year. The Fed meets once more in December.Powell, however, cautioned against assuming that a rate cut is a sure thing at the next meeting.\"In the committee's discussions at this meeting, there were strongly differing views about how to proceed in December,\" Powell said during his post-meeting news conference. \"A further reduction in the policy rate at the December meeting is not a foregone conclusion. Far from it.\"He later added that there is \"a growing chorus\" among the 19 Fed officials to \"at least wait a cycle\" before cutting again. Traders lowered odds for a December cut to 67% from 90% a day ago, according to the CME Group's FedWatch.Stocks, which had been higher after the initial decision was released, turned lower on the chair's comments. Major averages slowly came back during the session with reporters.The reduction came even though the Fed essentially has been flying blind lately on economic data.Other than the consumer price index release last week, the government has suspended all data collection and reports, meaning such key measures as nonfarm payrolls, retail sales and a plethora of other macro data is unavailable.In the post-meeting statement, the committee acknowledged the uncertainty accompanying the lack of data, qualifying the way it categorized broad economic conditions.\"Available indicators suggest that economic activity has been expanding at a moderate pace. Job gains have slowed this year, and the unemployment rate has edged up but remained low through August; more recent indicators are consistent with these developments,\" the statement said. \"Inflation has moved up since earlier in the year and remains somewhat elevated.\"Each of those characterizations represented tweaks from the September statement. The most significant change was the view on broad economic activity. In September, the FOMC said activity had moderated.The statement reiterated concerns that policymakers have over the labor market, saying that \"downside risks to employment rose in recent months.\"Even before the shutdown, evidence had begun to build that while layoffs have been contained, the pace of hiring had flattened. At the same time, inflation has held considerably above the Fed's 2% annual goal. The CPI report last week, released because of its importance to Social Security cost-of-living adjustments, showed the annual rate at 3%, pushed by higher energy costs as well as several items with direct or indirect links to Trump's tariffs.The Fed tries to strike a balance between full employment and stable prices. Officials lately, though, have said they see a slightly higher risk posed by the jobs picture. Along with the interest rate decision, the Fed said its process of reducing the amount of bonds it holds on the central bank's $6.6 trillion balance sheet will end.The program, also known as QT, had shaved some $2.3 trillion off the Fed's portfolio of Treasurys and mortgage-backed securities. Instead of reinvesting maturing proceeds from the securities, the Fed has been allowing them to roll off the balance sheet at a limited level each month. However, recent signs of some tightening in short-term lending markets have raised concern that the roll-off has gone far enough.An implementation note accompanying the decision indicated the Fed will be rolling proceeds from maturing mortgage securities into shorter-term bills.Markets recently had begun anticipating that the Fed would end QT either in October or by the end of the year. The Fed expanded its holdings during the Covid crisis, pushing the balance sheet from just over $4 trillion to close to $9 trillion. Powell has said that while the Fed found it necessary to shrink its holdings, he did not foresee a return to pre-pandemic levels.In fact, Evercore ISI analyst Krishna Guha said he could foresee a scenario where the Fed actually restarts the purchases early in 2026 for \"organic growth purposes\" as market conditions shift. The Fed rarely eases monetary policy during economic expansions and bull markets in stocks. Major averages, though volatile, have been posting a series of record highs, boosted by further gains in Big Tech stocks and a robust earnings season.History has shown that the market continues to rise when the Fed does cut under such circumstances. However, easier policy also poses the risk of higher inflation, a condition that forced the Fed into a series of aggressive rate hikes.Correction: This story has been updated to correct that Jeffrey Schmid is president of the Kansas City Fed, and that the Fed raised interest rates following an inflation spike.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fed cuts rates again, but Powell raises doubts about easing at next meeting",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218869-1761764020808-gettyimages-2243488623-AFP_82FA4GE.jpeg?v=1761764093&w=1920&h=1080"
      ],
      "datePublished": "2025-10-29T19:57:56.000Z",
      "dateModified": "2025-10-29T19:57:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]