[
  {
    "title": "47-year-old designer makes $8,000 dresses for Olympic figure skaters: I also 'want to be the best'",
    "url": "https://www.cnbc.com/2026/02/13/how-costume-designer-for-olympic-figure-skaters-built-her-business.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108265172-1770922650602-f5a37586-8788-4a27-9f45-041f0ff4fe8d.jpg?v=1770997603&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T15:47:27.000Z",
    "description": "When U.S. figure skaters Amber Glenn, Alysa Liu and Isabeau Levito take to the ice to compete at the Milano Cortina Winter Olympics, they all wear dre",
    "body": "When U.S. figure skaters Amber Glenn, Alysa Liu and Isabeau Levito take to the ice to compete at the Milano Cortina Winter Olympics, they all wear dresses designed by the same woman.The designer's name is Lisa McKinnon, and she's outfitted all three women competing for Team USA in singles figure skating events, plus two American ice dancers and two South Korean skaters at these Olympics. Collectively, the seven athletes are set to compete in at least 13 costumes from Lisa McKinnon Designs, a Los Angeles-based studio that McKinnon launched in 2014.McKinnon works between 40 and 60 hours per week, regardless of the season, she tells CNBC Make It. She and her five employees handmade nearly 700 costumes, for skaters across every discipline and level, in 2025, she estimates. The business charges $90 per hour, and its custom costumes for high-level skaters typically cost between $4,000 and $8,000 apiece, she says. (McKinnon declined to share the business's total annual revenue.)DON'T MISS: How to read people and master your body language to be more influential at workMost clients, regardless of their desired final product, have to request costumes at least six months in advance, and McKinnon's team often works on a costume up until the deadline, she says. The timeline is largely due to demand, and to budget time for costume emergencies or special requests.One such special request: In December, Liu — the reigning world champion — asked McKinnon to design her a new dress for her Lady Gaga-themed program at the 2026 U.S. Figure Skating Championships in early January. McKinnon finished the dress in a hotel room in St. Louis on the day Liu competed in the costume, the designer says.\"I really care so much about every single project that I do. A little blood, sweat and tears are a totally common thing for me, [though] I don't cry as much [these days]\" says McKinnon, 47.Skating is 'in my blood'McKinnon, born and raised in Sweden, grew up a figure skater and made her first competition costume for herself at age 15. She didn't have any crystals, which are commonly glued onto skating dresses, so she hand-sewed paillettes — sequins secured onto the fabric with tiny beads, she says.She began making costumes for other skaters later that year, after a request from a member of the Swedish national team, she says. But mostly, she pursued her own skating career — eventually performing in professional shows like Disney On Ice for eight years, then working on them as a performance director for another eight years, she says.McKinnon started spending her summers between shows in the U.S. starting in 2006, and after leaving the skating world, pursued jobs supervising costume departments in Las Vegas and then Los Angeles. In 2013, she was the costume supervisor at The Wallis Annenberg Center for the Performing Arts in Beverly Hills, California, when an old friend — who was a skating coach at a local rink — asked if she'd design a costume for a student, she says.The dress was eye-catching enough for other local parents and athletes to start coming to McKinnon, she says. She quit her job in late 2014 to launch her business, she says, and has since built a reputation for making costumes that add storytelling to each individual skating routine's theme.Within a year, some of the country's top stars living in or near Los Angeles, home to multiple high-level skating coaches, were competing in her costumes. One early Los Angeles-based client, Ashley Wagner, was already a multi-time U.S. national champion when she started working with McKinnon. Another, Karen Chen, later competed in multiple Olympic Games, winning a gold medal in the team event at the 2022 Winter Olympics.McKinnon vividly remembers the first time she saw her designs on national television, she says: Wagner and Chen wore them on the podium after winning silver and gold at the 2017 U.S. National Figure Skating Championships.\"I drank a lot of champagne and I definitely shed some tears,\" says McKinnon.Her business is small, relative to its demand. To keep up, McKinnon arrives early in the morning to do paperwork and often stays late to tidy up, tossing scraps of fabric and reorganizing crystals, she says. Competitive skating and costume designing both require determination, resilience and ambition, she adds.\"I'm really competitive. I want to do the things I'm good at, and I want to be the best,\" says McKinnon, adding: \"Once you've skated, it's always going to be a part of your life somehow. It sticks with you. It's always been part of my life and I feel like it's in my blood.\"Want to improve your communication, confidence and success at work? Take CNBC's new online course, Master Your Body Language To Boost Your Influence. Register now and use coupon code EARLYBIRD for an introductory discount of 20% off. Offer valid from Feb. 9 to Feb. 23, 2026. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "47-year-old designer makes $8,000 dresses for Olympic figure skaters: I also 'want to be the best'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108265172-1770922650602-f5a37586-8788-4a27-9f45-041f0ff4fe8d.jpg?v=1770997603&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T15:47:27.000Z",
      "dateModified": "2026-02-13T15:47:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Interest on new car loans is now tax deductible up to $10,000—here's how much buyers may actually save",
    "url": "https://www.cnbc.com/2026/02/13/interest-on-new-car-loans-tax-deductible.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108263951-1770742078803-gettyimages-2227838312-jccm0465.jpeg?v=1770742314&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T18:35:22.000Z",
    "description": "For the 2025 tax year, eligible U.S. taxpayers can deduct up to $10,000 in auto loan interest under a temporary provision enacted as part of President",
    "body": "For the 2025 tax year, eligible U.S. taxpayers can deduct up to $10,000 in auto loan interest under a temporary provision enacted as part of President Donald Trump's One Big Beautiful Bill Act.However, most eligible borrowers will deduct far less, largely because even sizable auto loans don't generate anywhere near $10,000 in interest in a single year. That figure is closer to what borrowers typically pay in total interest over the life of a 72-month new-car loan, per Edmunds, a car-shopping and automotive data company.Instead, for most borrowers, the deduction is more likely to provide tax savings measured in hundreds of dollars a year, not thousands, according to automotive research firm Cox Automotive. Eligibility rules further narrow who can claim the deduction, since it applies only to newly purchased vehicles financed after Dec. 31, 2024, excludes foreign-assembled cars and phases out for higher earners.\"This tax credit is limited, won't be a market mover and is not a tool to substantially address the affordability challenges and high interest rates our market faces,\" Jeremy Robb, chief economist at Cox Automotive, tells CNBC Make It.Who qualifies for the auto loan interest deductionThe auto loan interest deduction was a 2024 campaign pledge by Trump, enacted starting July 4, 2025 as part of the One Big Beautiful Bill Act. The deduction itself is temporary and applies only to tax years 2025 through 2028.The deduction applies only to loans that meet the following requirements, per the Internal Revenue Service:The loan must have originated after Dec. 31, 2024 and be secured by the vehicle.The vehicle must be new — loans for used vehicles do not qualify.The vehicle must be for personal use, not business or commercial use.Eligible vehicles include cars, minivans, vans, SUVs, pickup trucks and motorcycles with a gross vehicle weight rating under 14,000 pounds.The vehicle must have undergone final assembly in the United States. That's roughly 50% of vehicles sold in the U.S., according to Cox.  The $10,000 maximum deduction phases out at higher income levels. For single filers, the phaseout begins at $100,000 of modified adjusted gross income and ends at $150,000. For married couples filing jointly, the phaseout begins at $200,000 and ends at $250,000, per the IRS.While eligibility is limited by income and vehicle rules, qualifying taxpayers can claim the break whether they itemize deductions or take the standard deduction.Why most buyers won't get close to $10,000Even among those who qualify, few buyers are likely to see their tax bill reduced by anything close to $10,000.A 72-month new-car loan with an interest rate of 9.5% on a $48,000 vehicle and a 12.5% down payment would generate roughly $3,800 in interest in the first year, according to analysis from Cox Automotive. Interest costs fall to about $3,200 in the second year and roughly $2,600 in the third year.While the full amount of interest is deductible, it only reduces the portion of income subject to tax, not taxes owed dollar for dollar. As a result, the actual tax savings are smaller than the interest paid.Assuming a federal tax rate of about 15% to 20% for new-vehicle buyers, the first-year deduction would translate into less than $750 in tax savings, according to Cox Automotive calculations. In the second year, the savings would fall to about $640 as interest costs decline.It would take a loan of roughly $112,000 to generate $10,000 in deductible interest in the first year alone, says Robb.How to claim the deduction on your tax returnThe deduction is claimed on Schedule 1-A, an updated attachment to Form 1040, which tax software will complete automatically for most filers.Taxpayers must include the vehicle identification number, or VIN, on their tax return for any year the deduction is claimed. The VIN is a 17-character number typically visible on the driver's side of the dashboard near the windshield or inside the driver's door frame, and it also appears on vehicle documents such as the title or insurance card. Buyers can use the National Highway Traffic Safety Administration's VIN Decoder, which identifies a vehicle's assembly plant, to confirm whether it was finally assembled in the United States.Lenders must provide borrowers with a statement showing the total amount of interest paid on a qualifying vehicle loan.Want to improve your communication, confidence and success at work? Take CNBC's new online course, Master Your Body Language To Boost Your Influence. Register now and use coupon code EARLYBIRD for an introductory discount of 20% off. Offer valid from Feb. 9 to Feb. 23, 2026. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Interest on new car loans is now tax deductible up to $10,000—here's how much buyers may actually save",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108263951-1770742078803-gettyimages-2227838312-jccm0465.jpeg?v=1770742314&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T18:35:22.000Z",
      "dateModified": "2026-02-13T18:35:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dubai's DP World replaces CEO after Epstein links emerge",
    "url": "https://www.cnbc.com/2026/02/13/dubais-dp-world-replaces-ceo-after-epstein-links-emerge.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108265494-17709857482020-01-21t130715z_202603709_rc2dke9266v5_rtrmadp_0_davos-meeting.jpeg?v=1770985768&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T15:43:49.000Z",
    "description": "Sultan Ahmed Bin Sulayem of Dubai speaks at a news conference on Nov. 10, 2005 in New York City. Mario Tama | Getty Images News | Getty ImagesThe CEO ",
    "body": "Sultan Ahmed Bin Sulayem of Dubai speaks at a news conference on Nov. 10, 2005 in New York City. Mario Tama | Getty Images News | Getty ImagesThe CEO of Dubai's largest port has been replaced by the company after details of his past relationship with the late sex offender Jeffrey Epstein were made public.On Friday, DP World announced in a statement that it had appointed Essa Kazim as chairman of its board of directors and Yuvraj Narayan as group chief executive officer, replacing Sultan Ahmed bin Sulayem.The U.S. Department of Justice's latest release of files related to Epstein revealed that the financier once referred to Sulayem as a \"close personal friend\" and called him one of his most trusted friends in other files. Sulayem has not been accused of any criminal wrongdoing. A disclosure to Nasdaq Dubai, where DP World maintains listed bonds, said Sulayem had resigned \"effective immediately.\"Sulayem was at the helm of Dubai's largest port operator as chairman since 2007 and CEO since 2016.The statement made no mention of Sulayem but said the company \"affirmed that the new appointments support its strategy for sustainable growth and reinforce its role in strengthening global supply chains and supporting Dubai's position as a leading hub for trade and logistics.\"CNBC sought comment from Sulayem through DP World, where he served as chairman and CEO, but did not receive a response.Kazim was most recently the governor of the DIFC, Dubai's financial center. Narayan was deputy CEO and CFO at DP World since 2005. Sulayem is one of Dubai's most prominent business figures, coming from one of the Emirate's main families. His father was an advisor to the ruling Al Maktoum family and Sulayem played a key role in the ascendance of Dubai as an economic hub.Sulayem oversaw the growth of Dubai's Jebel Ali port into a major deep-water shipping hub and the expansion of DP World into an international logistics empire that now oversees ports handling a tenth of the world's container trade.He also led Nakheel Properties, a Dubai government-owned developer, though he was replaced amid a major board restructuring following Dubai World's debt issues during the 2008 financial crisis. A 'close personal friend' of Epstein The extent of Sulayem's relationship with Epstein emerged in recent weeks following the release of the latest files.The records show the Emirati businessman was in contact with Epstein after the financier was convicted of soliciting prostitution from a minor in 2008. Authorities have stressed that a mention in the Epstein files does not indicate evidence of wrongdoing nor prove that the name was part of a purported client list or blackmail scheme.Jeffrey Epstein and Sultan Ahmed bin Sulayem, Group CEO of DP World.House Oversight Committee Democrats Pressure from DP World's partnersThis week, pressure mounted on Sulayem to resign after international partners paused new deals with DP World, calling for the company to take the \"required action.\" Canada's second-largest pension fund, La Caisse, which has invested more than $5 billion alongside DP World over the past decade, said it would pause \"additional capital deployment alongside the company.\"In a statement sent to CNBC, La Caisse said it was \"important to distinguish the company, DP World, from the individual, Sultan Ahmed bin Sulayem, who is the focus of the current situation.\"\"On that point, we have made it clear to the company that we expect it to shed light on the situation and take the necessary actions,\" the pension fund added. A spokesperson for British International Investment, which invests with DP World in four African ports, said it would also pause new investments.\"In light of the allegations, we will not be making any new investments with DP World until the required actions have been taken by the company.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dubai's DP World replaces CEO after Epstein links emerge",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108265494-17709857482020-01-21t130715z_202603709_rc2dke9266v5_rtrmadp_0_davos-meeting.jpeg?v=1770985768&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T15:43:49.000Z",
      "dateModified": "2026-02-13T15:43:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Investor Matt Shumer says viral essay wasn't meant to scare people",
    "url": "https://www.cnbc.com/2026/02/13/investor-matt-shumer-says-viral-essay-wasnt-meant-to-scare-people.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108194072-1756957448859-gettyimages-2221455401-ai01.jpeg?v=1762285434&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T21:40:45.000Z",
    "description": "watch nowInvestor Matt Shumer ignited a firestorm on social media this week with an essay that warned about the disruptive potential of AI. More than ",
    "body": "watch nowInvestor Matt Shumer ignited a firestorm on social media this week with an essay that warned about the disruptive potential of AI. More than 80 million views later, he said it \"wasn't meant to scare people.\"\"I want to be very clear about this, the article wasn't meant to scare people in this way,\" Shumer told CNBC's \"Power Lunch\" on Friday. \"If I had known how viral this was going to go, I would have thought about certain parts and rewritten some of the parts for sure.\"The essay, \"Something Big Is Happening,\" details Shumer's recent experiences using artificial intelligence. In it, he argues that AI's capabilities are under appreciated by the wider public. He compared the state of AI to the rumblings during early days of the Covid-19 pandemic in February 2020, right before the number of cases soared in the U.S.OpenAI rocketed into mainstream with the launch of its AI chatbot ChatGPT in 2022, and the company kicked off a high-stakes race for dominance among rivals like Google and Anthropic. Investors have been pouring billions of dollars into the technology, and Alphabet, Microsoft, Meta and Amazon are expected to spend nearly $700 billion on capital expenditures this year alone.He wrote that he's been \"shocked\" to discover that AI can perform all of the actual technical work of his job, and Shumer said professionals across fields like law, finance, medicine and accounting, among others, will begin to share similar experiences. Shumer published the essay on Tuesday. Since then, it has racked up more than 100,000 likes and nearly 6,000 comments, according to X. The essay prompted a range of praise and criticism from readers. In retrospect, Shumer said he would have liked to have framed some parts differently. Even so, Shumer reiterated his belief that AI could be disruptive to many knowledge workers. He said its \"clear\" that AI will be able to do anything that can be done on a computer, though he said it doesn't necessarily mean that it will immediately be adopted or proliferate through society. Shumer said the \"core message\" he is trying to convey is that people in the workforce should start to use and experiment with AI tools so they can understand what's coming. \"Everybody likes to think their thing is special,\" Shumer said. \"I thought my thing was special for a while.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Investor Matt Shumer says viral essay wasn't meant to scare people",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108194072-1756957448859-gettyimages-2221455401-ai01.jpeg?v=1762285434&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T21:40:45.000Z",
      "dateModified": "2026-02-13T21:40:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "One year after DOGE cuts, former federal workers find new roles",
    "url": "https://www.cnbc.com/2026/02/12/after-doge-cuts-federal-workers-new-roles.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108264611-1770835730896-WFACandids-1_1_1.jpg?v=1770844402&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-12T20:36:49.000Z",
    "description": "watch nowLast spring, Chantel Williams' position in the federal government was in limbo. Williams, once a General Services Administration employee on ",
    "body": "watch nowLast spring, Chantel Williams' position in the federal government was in limbo. Williams, once a General Services Administration employee on its hiring and recruitment team, found herself in a state of confusion and anxiety. The agency she worked for was in a holding pattern as Elon Musk's so-called Department of Government Efficiency began its work to aggressively shrink the size and scope of government agencies at President Donald Trump's direction.The DOGE cuts, a pillar of Trump's second term, were swift and wide-reaching across the federal workforce. Some of the most affected agencies included the U.S. Agency for International Development, the Consumer Financial Protection Bureau, the Department of Health and Human Services, and the Department of Education. \"As a federal employee, the oath is to the work and to the role, and not the administration,\" Williams said. \"It started off as feeling very startling that the transition wasn't occurring as seamlessly as it had in prior years, because I had been working at GSA through a transition before.\" Williams said she felt, for the first time, real turmoil about working for the federal government. \"It was hard to wake up every day wanting to continue to serve but feel as though your leadership may have a different priority or maybe an opposition of you continuing to move forward in that mission,\" said Williams.In the end, she opted to take deferred resignation, receiving pay to leave her government post. She joined thousands of others in what was the largest reduction of the federal workforce in history, according to the U.S. Office of Personnel Management. At the end of 2025, OPM reported that approximately 352,000 employees exited roles last year, with more than 123,000 taking the deferred resignation offer. In a release late last year, OPM said it was \"in line with President Trump's goal of a smaller, more efficient government.\"Caitlin Lewis, founder and director of Work for America, started her career in local government in New York City. Lewis launched the nonprofit in November of 2024 and has helped placed former federal workers in new roles around the country in the wake of federal workforce reductions over the last year.Megan Leigh Barnard | Work for AmericaAs mass layoffs and resignations hit federal workers like Williams, Caitlin Lewis stepped in to help.Her nonprofit, Work for America, launched in November 2024 to help local governments recruit talent to fill gaps in staffing. Through its Civic Match platform, it helps former federal workers find new roles at the state and local level. The Work for America team has grown from two people to 15 in the last year, and the vast majority have come from prior careers in state, local and federal government. Four employees came directly from federal government roles.\"We never imagined the volume of need that was going to occur,\" Lewis said. \"What is so unique about this job seeker population is how unexpected the layoffs were for so many of them. Government has long been a place of stability and meaning making, and so much of what we understand the government job to be was really upended in that moment.\"Lewis, the daughter of a forest firefighter and a youth prison counselor who grew up in California, said she became civically engaged at a young age. That engagement led her to local government in New York City in the Bill de Blasio administration, first in the mayor's office and then in housing and economic development. Work for America was informed by that experience. \"In a place like New York, it really showed me how when you have the right people in the right roles in government, that the public sector really can move mountains, and when you don't, the basics start to fall apart,\" she said. \"And unfortunately we've seen that occurring in communities across the country where there hasn't been the ability to get the right talent to lean into critical roles.\"Williams quickly landed a job at Work for America after taking deferred resignation. She is now a product and data manager with the nonprofit.In the last year, Work for America has placed nearly 200 job seekers, 150 of which are former federal workers, in roles across the country. More than 12,800 job seekers have signed up for Civic Match since Trump's election, representing more than 30 federal agencies. \"For many, it's been a year of chaos and confusion. But we saw for our customers — cities and state governments across the country — that there was a true opportunity to capture the incredible talent that was going to be exiting Washington,\" Lewis said.Nate Haight turned to Civic Match as sweeping cuts took place at USAID, where he spent a decade of his career. Haight started out as an intern, then became a contractor, and by last year had been working as an education advisor and contract and grants specialist in its Latin America and Caribbean Bureau. Last February, he was told his job was under review and would most likely be cut.\"I particularly loved my work in the education sector. It was really meaningful being able to go out and see the impact that the programs were having around the world,\" Haight said. \"I was invested in the work and I saw the difference that it was making.\"He opted to take the deferred resignation offer from the government and found a new role through Work for America's platform, knowing competition would be steep locally given how many other former federal workers were looking for jobs. Today, he's in Indiana with his wife and four children, working as a grants administrator for the city of Indianapolis and Marion County.\"I think the satisfaction and fulfillment that I've been able to find already working in local government, I just want to encourage others to give it a shot as well ... and to encourage everyone to keep their head up and know that all of the skills and experiences that they've gained, they're going to be able to make a tremendous impact wherever they end up landing,\" Haight said of his fellow former federal workers.In the months to come, Civic Match is rolling out new features including candidate match scores powered by artificial intelligence, improved location targeting for jobs, city-specific pages and more. Hope Rahill, a former political appointee in the Biden administration who left her role as the Trump administration moved in, is now director of people and culture at Work for America. Rahill said while the group has had success in placing candidates, many former workers are still looking for work and coming up on a year of \"unemployment or underemployment.\"\"There are still so many people looking for work,\" Rahill said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "One year after DOGE cuts, former federal workers find new roles",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108264611-1770835730896-WFACandids-1_1_1.jpg?v=1770844402&w=1920&h=1080"
      ],
      "datePublished": "2026-02-12T20:36:49.000Z",
      "dateModified": "2026-02-12T20:36:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo is paying DoorDash gig workers to close its robotaxi doors",
    "url": "https://www.cnbc.com/2026/02/12/waymo-is-paying-doordash-gig-workers-to-close-its-robotaxi-doors.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261079-1770161390873-gettyimages-2259269133-ALPHABET_EARNS.jpeg?v=1770161420&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T02:10:42.000Z",
    "description": "A Waymo autonomous taxi outside the Google headquarters in Mountain View, California, US, on Tuesday, Feb. 3, 2026. David Paul Morris | Bloomberg | Ge",
    "body": "A Waymo autonomous taxi outside the Google headquarters in Mountain View, California, US, on Tuesday, Feb. 3, 2026. David Paul Morris | Bloomberg | Getty ImagesWaymo's cars are driven without humans. But when a departing passenger leaves a door open, the car won't move until a person closes it. For that task, Waymo is turning to gig workers from companies like DoorDash. The Alphabet-owned self-driving car company confirmed on Thursday that it's running a pilot in Atlanta to compensate delivery drivers for closing Waymo doors that are left ajar. DoorDash drivers are notified when a Waymo in the area has an open door so the vehicles can quickly get back on the road, the company said.That acknowledgement came after a Reddit post showed a DoorDash driver in Atlanta was offered $11.25 to close the door of a nearby Waymo.Waymo and DoorDash said in a joint statement to CNBC that they are always looking for new and flexible ways for DoorDash deliverers to earn money, adding that future Waymo vehicles will have automated door closures. Waymo didn't say when that capability will arrive. Waymo's reliance on people for simple tasks underscores how even the most advanced autonomous technologies still require costly human intervention for some basic operations. Valued at $126 billion in a recent financing round, Waymo is central to Alphabet's Other Bets, which are targeted at \"using technology to try to solve big problems that affect a wide variety of industries, including transportation and health technology,\" according to the company's financial filings. In Alphabet's annual filing last week, the company said the Other Bets segment recorded an operating loss last year of $7.5 billion, which included a $2.1 billion stock-based compensation charge at Waymo.In addition to DoorDash, Waymo is also paying users of Honk, an independent roadside assistance company, to close robotaxi doors. A recent Washington Post report said Honk users, who get paid to provide maintenance on Waymo vehicles, were offered up to $24 in Los Angeles for closing a door.On Thursday, Waymo began deploying its next-generation robotaxi as the company pushes to extend its lead in the U.S. Waymo currently offers its fully autonomous robotaxi service in six U.S. markets, with plans to expand to several more this year.WATCH: Waymo raises $16 billion at $126 billion valuation watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo is paying DoorDash gig workers to close its robotaxi doors",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261079-1770161390873-gettyimages-2259269133-ALPHABET_EARNS.jpeg?v=1770161420&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T02:10:42.000Z",
      "dateModified": "2026-02-13T02:10:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elon Musk's xAI faces threat of NAACP lawsuit over air pollution from Mississippi data center",
    "url": "https://www.cnbc.com/2026/02/13/musks-xai-faces-threat-of-naacp-lawsuit-over-pollution-in-mississippi.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108174051-1752860818701-gettyimages-2224956825-kokovlis-notitle250718_npmM4.jpeg?v=1771018521&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-14T00:56:13.000Z",
    "description": "Nikolas Kokovlis | Nurphoto | Getty ImagesElon Musk's xAI, which merged with SpaceX last week, is facing increased pressure from environmental and civ",
    "body": "Nikolas Kokovlis | Nurphoto | Getty ImagesElon Musk's xAI, which merged with SpaceX last week, is facing increased pressure from environmental and civil rights groups over pollution concerns, this time at the company's facility in Southaven, Mississippi. On Friday, the Southern Environmental Law Center and Earthjustice, on behalf of the NAACP, sent a notice of intent to sue xAI and subsidiary MZ Tech LLC, saying the company's use of dozens of natural gas-burning turbines requires a federal permit, violates the Clean Air Act and harms nearby communities. Pollution from the turbines, which xAI has also used in Memphis, Tennessee, for its Colossus 1 and Colossus 2 data centers, has been a major source of local contention for more than a year. Plans for a third data center in Southaven, located about 20 miles from Memphis, were announced early this year, when Mississippi Republican Governor Tate Reeves said he expected the project to create \"hundreds of permanent jobs throughout DeSoto County.\"Launched by Musk in 2023, xAI is trying to compete with OpenAI, Anthropic and Google in the booming generative AI market. On Feb. 2, Musk said SpaceX, his rocket maker and defense contractor, acquired xAI in a deal that valued the combined entity at $1.25 trillion. Musk is banking on the area in and around Memphis as the foundation of his AI ambitions, and he's been flouting environmental rules in order to develop as quickly as possible. Musk's social network X, formerly Twitter, is also owned by xAI, which created the Grok AI chatbot and image generator.XAI is currently under a myriad of government investigations in Europe, Asia and the U.S. after Grok enabled users to easily create and share deepfake porn, including explicit imagery depicting child sexual abuse.  Last year, residents in the majority-Black community of Boxtown in South Memphis testified at public hearings about a stench in the air, and the impact of worsening smog on their health caused by xAI's use of natural gas turbines. Research by scientists at the University of Tennessee also found that xAI's turbine use added to air pollution woes in the area.Environmental advocates, including the NAACP, had previously said they would sue to stop xAI's un-permitted use of the turbines in Memphis. But they stopped short of filing a legal complaint after Shelby County's health department allowed xAI to treat the turbines as temporary, non-road engines, and issued permits for their use. At the federal level, the EPA recently clarified gray areas of the law and said these turbines can't be categorized as temporary non-road engines. Nonetheless, xAI has been using the turbines across state lines without obtaining federal permits. XAI didn't immediately respond to a request for comment.Noise pollution from the turbines has also been a source of local consternation. Jason Haley, a Southaven resident, told CNBC the turbines make headache-inducing noises around the clock that he can hear inside his home.Haley is part of a group called Safe and Sound which documents the decibel levels, and is pressing local officials to stop xAI from making so much noise, especially overnight, with its turbines.Mississippi officials will hold a public hearing, scheduled for Tuesday, for community members who wish to express their concerns about xAI's expansion plans in the area. The hearing will focus on whether the state should give xAI permission to install and run 41 permanent turbines at its Southaven facility, Mississippi Today previously reported. Similar community dynamics are playing out across the U.S. as tech giants rush to construct massive data centers, which can strain local energy and water supply and cause prices to increase.In November, Microsoft ended efforts to build a data center in Wisconsin due to the community's vocal opposition. Amazon also pulled out of plans for a data center in Arizona after community protests.In terms of Musk's Southaven project, Patrick Anderson, a senior attorney with SELC, said xAI \"has to follow the law, just like any other company.\"\"And when it flouts the Clean Air Act's bedrock protections against unpermitted emissions, it puts the health and welfare of ordinary citizens at risk,\" Anderson said in an email. \"That's why we intend to hold xAI accountable here.\"The Mississippi Department of Environmental Quality did not immediately respond to requests for comment. Read the environmental groups' notice of intent to sue xAI here: ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elon Musk's xAI faces threat of NAACP lawsuit over air pollution from Mississippi data center",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108174051-1752860818701-gettyimages-2224956825-kokovlis-notitle250718_npmM4.jpeg?v=1771018521&w=1920&h=1080"
      ],
      "datePublished": "2026-02-14T00:56:13.000Z",
      "dateModified": "2026-02-14T00:56:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pinterest stock sinks nearly 17% as tariffs hit earnings. Here's what's happening",
    "url": "https://www.cnbc.com/2026/02/13/-pinterest-stock-price-tariff-earnings-layoffs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108265439-1770979691054-gettyimages-2259684718-img_8053.jpeg?v=1770979732&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T21:03:24.000Z",
    "description": "watch nowPinterest shares closed nearly 17% lower on Friday, after the company cited tariff-related shocks in disappointing fourth-quarter earnings.Th",
    "body": "watch nowPinterest shares closed nearly 17% lower on Friday, after the company cited tariff-related shocks in disappointing fourth-quarter earnings.The social media company's Q4 earnings came in below analysts' expectations, with revenue of $1.32 billion compared with LSEG consensus estimates of $1.33 billion. Net income for the quarter plunged 85% to $277 million from $1.85 billion the prior year.It also recorded  $541.5 million in adjusted earnings before interest, taxes, depreciation, and amortization, or EBIDTA, below the $550 million that analysts were projecting.Pinterest expects first-quarter sales to be between $951 million and $971 million, which is also below analysts' forecasts of $980 million.CEO Bill Ready said the company \"absorbed an exogenous shock this year related to tariffs\" and was more exposed to reduced advertising spend from large retailers.Pinterest also announced plans in January to lay off less than 15% of its workforce and cut back on office space, in a bid to go all in on AI. It said it's \"reallocating resources\" to AI-focused teams and prioritizing \"AI-powered products and capabilities.\" Stock Chart IconStock chart iconPinterest one-day stock chart.What analysts are sayingIn a Friday note, Citi said it was downgrading shares of Pinterest from Buy to Neutral, \"given more limited visibility from larger UCAN & EU advertisers due in part to tariffs and challenges across specific verticals,\" such as home furnishing, the rebuilding of its go-to-market sales function as Pinterest broadens its advertiser base, and greater investments impacting margins. Pinterest's revenue performance is expected to continue to be \"pressured near-term by macro-related headwinds,\" such as tariffs and consumer spending, Goldman Sachs analysts said in a note on Friday.But they added: \"Despite these near-term headwinds, management remains optimistic around its long-term growth strategy centered around diversifying its advertiser base, automation, and performance-oriented objectives.The analysts noted that user growth remains particularly strong amongst Gen Z users. The company reported that its fourth-quarter global monthly active users jumped 12% year-over-year to 619 million, representing an all-time high. — CNBC's Jonathan Vanian contributed to this report ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pinterest stock sinks nearly 17% as tariffs hit earnings. Here's what's happening",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108265439-1770979691054-gettyimages-2259684718-img_8053.jpeg?v=1770979732&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T21:03:24.000Z",
      "dateModified": "2026-02-13T21:03:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI disruption could spark a ‘shock to the system’ in credit markets, UBS analyst says",
    "url": "https://www.cnbc.com/2026/02/13/ai-credit-markets.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108259467-1769776489417-gettyimages-1550670587-argeai2307_01.jpeg?v=1771002011&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T18:19:01.000Z",
    "description": "Mesh Cube | Istock | Getty ImagesThe stock market has been quick to punish software firms and other perceived losers from the artificial intelligence ",
    "body": "Mesh Cube | Istock | Getty ImagesThe stock market has been quick to punish software firms and other perceived losers from the artificial intelligence boom in recent weeks, but credit markets are likely to be the next place where AI disruption risk shows up, according to UBS analyst Matthew Mish.Tens of billions of dollars in corporate loans are likely to default over the next year as companies, especially software and data services firms owned by private equity, get squeezed by the AI threat, Mish said in a Wednesday research note.\"We're pricing in part of what we call a rapid, aggressive disruption scenario,\" Mish, UBS head of credit strategy, told CNBC in an interview.The UBS analyst said he and his colleagues have rushed to update their forecasts for this year and beyond because the latest models from Anthropic and OpenAI have sped up expectations of the arrival of AI disruption. \"The market has been slow to react because they didn't really think it was going to happen this fast,\" Mish said. \"People are having to recalibrate the whole way that they look at evaluating credit for this disruption risk, because it's not a '27 or '28 issue.\"Investor concerns around AI boiled over this month as the market shifted from viewing the technology as a rising tide story for technology companies to more of a winner-take-all dynamic where Anthropic, OpenAI and others threaten incumbents. Software firms were hit first and hardest, but a rolling series of sell-offs hit sectors as disparate as finance, real estate and trucking.In his note, Mish and other UBS analysts lay out a baseline scenario in which borrowers of leveraged loans and private credit see a combined $75 billion to $120 billion in fresh defaults by the end of this year. CNBC calculated those figures by using Mish's estimates for increases of up to 2.5% and up to 4% in defaults for leveraged loans and private credit, respectively, by late 2026. Those are markets which he estimates to be $1.5 trillion and $2 trillion in size.'Credit crunch'?But Mish also highlighted the possibility of a more sudden, painful AI transition in which defaults jump by twice the estimates for his base assumption, cutting off funding for many companies, he said. The scenario is what's known in Wall Street jargon as a \"tail risk.\"\"The knock-on effect will be that you will have a credit crunch in loan markets,\" he said. \"You will have a broad repricing of leveraged credit, and you will have a shock to the system coming from credit.\"While the risks are rising, they will be governed by the timing of AI adoption by large corporations, the pace of AI model improvements and other uncertain factors, according to the UBS analyst.\"We're not yet calling for that tail-risk scenario, but we are moving in that direction,\" he said.Leveraged loans and private credit are generally considered among the riskier corners of corporate credit, since they often finance below-investment-grade companies, many of them backed by private equity and carrying higher levels of debt.When it comes to the AI trade, companies can be placed into three broad categories, according to Mish: The first are creators of the foundational large language models such as Anthropic and OpenAI, which are startups but could soon be large, publicly traded companies.The second are investment-grade software firms like Salesforce and Adobe that have robust balance sheets and can implement AI to fend off challengers. The last category is the cohort of private equity-owned software and data services companies with relatively high levels of debt.\"The winners of this entire transformation — if it really becomes, as we're increasingly believing, a rapid and very disruptive or severe [change] — the winners are least likely to come from that third bucket,\" Mish said.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI disruption could spark a ‘shock to the system’ in credit markets, UBS analyst says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108259467-1769776489417-gettyimages-1550670587-argeai2307_01.jpeg?v=1771002011&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T18:19:01.000Z",
      "dateModified": "2026-02-13T18:19:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Early estimates point to lower Social Security cost-of-living adjustment for 2027",
    "url": "https://www.cnbc.com/2026/02/13/social-security-cola-2027-early-estimates.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108265853-1771015274887-gettyimages-129305305-1055012.jpeg?v=1771015328&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T21:50:50.000Z",
    "description": "Carl Smith | Fstop | Getty ImagesSocial Security benefits are typically adjusted every year to keep up with rising prices. Social Security beneficiari",
    "body": "Carl Smith | Fstop | Getty ImagesSocial Security benefits are typically adjusted every year to keep up with rising prices. Social Security beneficiaries saw record-high COLAs in 2022 and 2023, when the annual increases climbed to 5.9% and 8.7%, respectively. Yet as the pace of inflation subsided, the size of the annual COLA increase has also come down. The 2026 cost-of-living adjustment was 2.8%. That added about $56 per month on average for retirees, and for some beneficiaries, higher Medicare premiums offset that increase.Now, new government inflation data for January suggests the cost-of-living adjustment for 2027 may be even lower, if the pace of inflation stays the same in the coming months.Read more CNBC personal finance coverageAverage IRS tax refund is up 10.9% so far this season, early filing data showsEarly estimates point to lower Social Security COLA for 2027Senators call for longer Social Security Fairness Act lump-sum payment timelineHere's the inflation breakdown for January 2026 — in one chartAverage tax refund is up 22%, Bessent says — what filers can expect this seasonK-shaped economy looks like 'jaws of a crocodile,' economist says: Here's whyHow EPA 'endangerment finding' repeal could impact your walletMedical emergencies can lead to debt and bankruptcy — even for insured AmericansBigger tax refunds may be coming — but missing key forms could risk an auditHow Social Security Fairness Act payments may affect beneficiaries' taxesCredit card debt tops $1.28 trillion, consistent with 'K-shaped' economy: NY FedHow affordability led to a chasm between stock prices, consumer optimismStudent loan complaints at record high, CFPB finds, but agency omits detailsFollowing Super Bowl ad, Trump accounts launch a new sign-up optionSome student loan borrowers wait over a year for public servant debt forgivenessTrump's 'big beautiful bill' may spur the rise of 'un-college,' experts sayCNBC's Financial Advisor 100: Best financial advisors, top firms rankedThe 2026 COLA affects around 75 million beneficiaries, according to the Social Security Administration.Estimates range from 1.2% to 3.1%The Social Security cost-of-living adjustment may be just 1.2% in 2027, estimates Mary Johnson, an independent Social Security and Medicare analyst. If that increase were to go into effect, it would be the lowest COLA since a 0.3% increase to benefits in 2017.Separately, the Senior Citizens League, a nonpartisan senior group, now projects a 2.8% Social Security COLA for 2027, consistent with the benefit boost beneficiaries saw for this year. Meanwhile, the Congressional Budget Office has forecast a 3.1% Social Security COLA for next year, followed by 2.5% the following year, as part of its estimates on the program's future costs.Low COLA would 'exacerbate' financial stressIf the COLA landed at 2.8%, \"this paltry figure would only exacerbate seniors' financial stress,\" the Senior Citizens League states. The group's polling has found more than half of seniors — almost 58% — have skipped at least one health care product or service in the past 12 months to cut costs.A separate September AARP survey found that a 3% COLA is \"insufficient.\"The organization asked about 1,000 adults ages 50 and older what they thought of a then-estimated 3% increase and found 77% of respondents said that was not enough to keep up with rising prices. Most respondents — 72% — said the ideal benefit boost would be 5% or higher.watch nowTo be sure, the current COLA projections are preliminary and subject to change.The Social Security cost-of-living adjustment is calculated each year using third-quarter data for the Consumer Price Index for Urban Wage Earners and Clerical Workers, or CPI-W. Third-quarter CPI-W data for the current year is compared to the third quarter of the previous year. The percentage increase from one year to the next, if there is one, determines the COLA. New CPI data for January shows the CPI-W increased 2.2% over the previous 12 months. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Early estimates point to lower Social Security cost-of-living adjustment for 2027",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108265853-1771015274887-gettyimages-129305305-1055012.jpeg?v=1771015328&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T21:50:50.000Z",
      "dateModified": "2026-02-13T21:50:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Instacart jumps 9% on strong results as CEO calls grocery competition fears 'overblown' ",
    "url": "https://www.cnbc.com/2026/02/13/instacart-cart-stock-ceo-grocery.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108244922-1766437551027-gettyimages-1858775478-porzycki-ecommerc231218_npl8e.jpeg?v=1766437613&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T22:16:07.000Z",
    "description": "Jakub Porzycki | Nurphoto | Getty ImagesInstacart's stock surged 9% after the company's robust results alleviated worries over mounting competitive pr",
    "body": "Jakub Porzycki | Nurphoto | Getty ImagesInstacart's stock surged 9% after the company's robust results alleviated worries over mounting competitive pressures in the grocery delivery market.During an earnings call with analysts, CEO Chris Rogers, who took the helm last year, called the concerns \"overblown\" and said the company monitors threats \"extremely closely.\"\"There is definitely a market for us here and we feel good about our points of differentiation,\" he said. Instacart is facing an increasingly competitive market as retailers like Amazon and food platforms such as Uber Eats and Doordash aggressively scale in grocery delivery. At the same time, the company is investing in new technology and artificial intelligence tools to drive more customers and businesses to its platform. Wall Street analysts viewed Instacart's results as a wave of confidence for those worried about the company's moat. Analysts at Bernstein called the report a \"solid rebuttal\" to competitive pressures and AI threats.\"The clean beat-and-raise has been rare this internet earnings cycle and CART stands out from that perspective,\" wrote analysts at Barclays. Read more CNBC tech newsTech IPO hype gets drowned out on Wall Street by prospect of $1 trillion in debt salesFTC tells Tim Cook to look into reports Apple News is censoring conservativesAnthropic closes $30 billion funding round as cash keeps flowing into top AI startupsWaymo begins deploying next-gen Ojai robotaxis to extend its U.S. leadThe San Francisco-based company reported better-than-expected fourth-quarter revenue and said gross transaction value (GTV) grew 14%, representing its strongest quarterly growth in three years. Orders totaled 89.5 million, topping a StreetAccount estimate of 87.8 million.Instacart also issued an optimistic forecast, calling for GTV in the range of $10.13 billion and $10.28 billion, versus a $9.97 billion estimate from StreetAccount. The company expects between $280 million and $290 million in adjusted earnings before interest, taxes, depreciation and amortization, versus $277 million expected. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instacart jumps 9% on strong results as CEO calls grocery competition fears 'overblown' ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108244922-1766437551027-gettyimages-1858775478-porzycki-ecommerc231218_npl8e.jpeg?v=1766437613&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T22:16:07.000Z",
      "dateModified": "2026-02-13T22:16:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump tariffs leave importers with record-breaking $3.5 billion U.S. Customs bond funding shortfall",
    "url": "https://www.cnbc.com/2026/02/12/trump-tariffs-us-customs-record-bond-funding-issues-flagged.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108252920-1768485269514-gettyimages-2255752587-1537857-fi-long-beach-port-tour-ajs-47.jpeg?v=1768485307&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T18:17:01.000Z",
    "description": "Cranes unload shipping containers from a ship at the Port of Long Beach Wednesday, Jan. 14, 2026. Allen J. Schaben | Los Angeles Times | Getty ImagesA",
    "body": "Cranes unload shipping containers from a ship at the Port of Long Beach Wednesday, Jan. 14, 2026. Allen J. Schaben | Los Angeles Times | Getty ImagesA record-breaking number of companies shipping products into the United States are coming up short on a federal government requirement to financially guarantee they can cover the import trade duties triggered by President Donald Trump's tariff policies. And this is leading to a record amount of money paid to the U.S. to cover the shortfalls.U.S. Customs and Border Protection data shared with CNBC shows that what are called customs bond \"insufficiencies\" reached a total of 27,479 in fiscal 2025, with the combined value soaring to almost $3.6 billion. It is the highest number of bond insufficiencies and the highest total value across insufficiencies ever recorded. In fact, it doubles the 2019 level when tariffs enacted by Trump under Section 301 of the Trade Act of 1974 also fueled bond shortfalls. \"Bonds are the primary tool used by U.S. Customs and Border Protection to safeguard the revenue of the United States and ensure compliance with applicable laws and regulations,\" said a U.S. Customs and Border Protection spokesperson.Under CBP guidelines, the agency continuously reviews bond adequacy, and a bond is flagged as being insufficient when an importer's duty/tax liability exceeds 100% of their current bond capacity. The shortfall comes at a time of record tariff revenue for the U.S. government, with tariff collections surging in January to $30 billion and reaching a year-to-date total of $124 billion. That is up 304% from the same period in 2025.\"In totality, it makes sense that insufficiencies are more than double,\" said Jennifer Diaz, attorney at Diaz Trade Law. \"Many companies take it for granted that a $50,000 bond should be able to cover you for a one-year period,\" she said. \"But it might not. They are not utilizing set calculations, and don't have anyone in their corner telling them that their bond obligation is higher.\"International trade experts told CNBC that with some tariffs increasing from 10%-25% or more for certain products, importers are facing customs bond amounts that now range from the minimum bond amount by regulation of $50,000 to as high as $450 million.Importers buy customs bonds, also known as surety bonds, through specialized insurance companies known as surety companies. The bonds are issued approximately 30 days before imports arrive in the U.S. to ensure that Customs collects the requisite tariffs in the event an importer does not pay its obligation. The bonds are held for 314 days by CBP in accounts that bear no interest. During this time, duties that were paid can be reviewed and receive final government sign-off.U.S. importers pay a premium to insure their bonds. The premium is typically 1% of the bond limit, with the price of the bonds covering 10% of the duties and taxes paid over a rolling 12-month period. If tariffs and taxes go up, the customs bond requirement goes up as well.Surety companies have told CNBC they have seen bond increases upward of 200%. \"In one unusual case, a large auto manufacturing client saw its custom bond amount increase by 550%,\" Vincent Moy, international surety leader for Marsh Risk, recently told CNBC.If the bond is insufficient, the importer can't get the freight, and it is held by CBP until the bond meets requirements. To address the shortfall, importers need to have another bond issued and that can take at least 10 days.In addition to the bonds, companies rely on related collateral to guarantee trade duty coverage. \"If companies do not increase their collateral, the goods will be stopped at the port,\" Moy said. The collateral is held by the insurance company that issues the bond for the 314-day period dictated by CBP. Companies have told CNBC that the tariff-triggered bond insufficiencies have created additional strain on their relationships with customs brokers.The Supreme Court could soon rule on Trump's International Emergency Economic Powers Act tariffs, deciding if they are legal. Feb. 20 is the next date for a potential decision and U.S. importers may be in line for not only trade tax refunds but also the money laid out for customs bonds and related collateral. If tariffs are refunded, the bond amounts associated with those imports can be used to reduce to levels sufficient to cover the duties, taxes and fees. Companies will need to petition the insurer that issued the bond for a reduction of the bond and collateral. Trade experts tell CNBC importers should be ready if this happens.Surety companies tell CNBC importers should expect some lag time in receiving these funds due to insurance paperwork requirements. The insurance company will need to verify and audit the paper trail before it releases any collateral.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump tariffs leave importers with record-breaking $3.5 billion U.S. Customs bond funding shortfall",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108252920-1768485269514-gettyimages-2255752587-1537857-fi-long-beach-port-tour-ajs-47.jpeg?v=1768485307&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T18:17:01.000Z",
      "dateModified": "2026-02-13T18:17:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump takes a beating from his own party amid Epstein files release and tariffs rebuke",
    "url": "https://www.cnbc.com/2026/02/13/trump-republicans-epstein-tariffs-elections.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108265689-1771001988777-gettyimages-2260948284-AFP_97FA6TT.jpeg?v=1771021317&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T22:45:02.000Z",
    "description": "President Donald Trump speaks to the media as he walks to board Marine One prior to departure from the South Lawn of the White House in Washington, Fe",
    "body": "President Donald Trump speaks to the media as he walks to board Marine One prior to departure from the South Lawn of the White House in Washington, Feb. 13, 2026.Andrew Caballero-Reynolds | AFP | Getty ImagesPresident Donald Trump's iron grip on the Republican Party might be starting to loosen, just a bit. The few elected Republicans who regularly cross him — including Kentucky Rep. Thomas Massie and Sen. Thom Tillis of North Carolina — are more vocal than ever. And in recent days, daylight has emerged between the president and a handful of his top supporters in Congress.The apparent shift is underway as Trump, the Republican Party's undisputed leader, grapples with stubbornly low approval ratings — especially on the economy, a perennial issue on which he was elected that has only grown more important to Americans chafing under high prices.Six U.S. House Republicans voted this week to overturn Trump's tariffs on Canada. Tillis remained resolute in holding up the president's Fed chair nomination in protest over a Justice Department investigation of the current one. The administration pulled back the sustained anti-immigration law enforcement push in Minnesota. And fallout from the Epstein files — in which Trump and allies are mentioned — is roiling the world and its most powerful players.Democrats are jumping on the opening, with some pushing a narrative that \"the tide is turning\" on Trump. Their perceived momentum follows big wins in last fall's off-year elections after hammering an affordability message, and as prediction markets favor them to win control of the House in the midterms.\"Trump's grip on power is slipping,\" Rep. Jim McGovern, D-Mass., said Thursday in a gloating social media post. \"Nobody is taking his bulls--- that somehow he's lowering prices for families.\"The administration's efforts this week to wrest the affordability narrative — by drawing attention to Trump's drug-pricing initiatives, or to gains in the stock market, or to projections that Americans' tax refunds will rise this season — have been muddied by the deluge of political setbacks and controversies. Trump on Friday gave a passing glance to curbing price increases when he spoke to troops in North Carolina hours after the release of January consumer price index figures that showed slowing inflation.He's had fewer public appearances since a racist social media post last Friday, a shift from his recent cadence of Oval Office appearances in front of reporters with supporters from the political ranks and business community. Israeli Prime Minister Benjamin Netanyahu is a frequent press conference partner of Trump, but his visit to the White House this week yielded no public remarks.White House press secretary Karoline Leavitt, when asked about challenges to Trump from the Republican Party, said the party will stay together with the president as its leader. \"Under President Trump's leadership, Republicans will remain united together against the radical Democrats, who will destroy our country once again, if given the chance, with wide open borders, noncitizens voting in elections, and horrible economic policy,\" Leavitt said via email.Read more CNBC politics coverageEpstein files: DOJ says it logs Congress members' searches to 'protect' victim informationEpstein files: AG Pam Bondi seemed to have Rep. Jayapal's DOJ database search history at hearingJudge blocks Pete Hegseth's censure of Sen. Mark Kelly over troops video, for nowWatch Pam Bondi hearing: AG touts record Dow as Democrats grill her over Trump, EpsteinThe majority-GOP House of Representatives' vote to override Trump's tariffs on Canadian goods only came about because three Republican members previously sided with Democrats to defeat a rule that would have blocked House votes on Trump's tariffs through July. Trump's threats of retaliation didn't thwart the end result.While the tariff votes are almost purely symbolic, they show GOP leadership failing to stop enough of their members from publicly defying Trump on his signature economic policy. Republicans can only afford to lose one vote in the House to prevail on party-line votes.A day after the House tariff vote, U.S. border czar Tom Homan announced the government would wrap up its immigration enforcement \"surge\" in Minnesota, following public outcry against federal agents' aggressive tactics exacerbated by the killing of two U.S. citizens in Minneapolis.A new AP-NORC poll found most Americans think the administration's deployment of deportation forces has gone too far, and that the GOP's advantage on immigration has shrunk since last year.The Minnesota actions drew fiery pushback not only from protesters and Democrats but also from business owners. In an open letter shared Thursday, more than 266 businesses from across the U.S. that said they represent 100,000 others warned the government's actions threaten free markets. A series of other Trump-related stumbles have drawn national focus away from the administration's attempt to tout its accomplishments.Last week, the president's social media account posted a racist image depicting the Obamas as apes. Numerous Republicans spoke out forcefully and quickly against the post, including close Trump ally Sen. Tim Scott of South Carolina, the only Black Senate Republican, who called it \"the most racist thing I've seen out of this White House.\"The White House initially defended the post, but after the flood of bipartisan outrage, pivoted to blaming it on an unnamed staffer. Trump subsequently condemned the image but refused to apologize.This week, a federal grand jury rejected U.S. prosecutors' attempt to indict six Democratic lawmakers, weeks after Trump accused them of sedition for telling military members not to follow unlawful orders. It is highly unusual for grand juries to decline to indict.The Department of Justice is also in the midst of a criminal investigation into Federal Reserve Chairman Jerome Powell, whose refusal to quickly slash interest rates has made him a top target of Trump's ire.The probe, which Powell says is retaliatory, has prompted vocal pushback from Republicans worried about the erosion of the central bank's long-established independence.Tillis, who is retiring at the end of his current term, is blocking all Trump administration nominees to the Fed — including Kevin Warsh, the president's pick to replace Powell — from advancing through the Senate until the DOJ drops the investigation.The president has said U.S. attorney for the District of Columbia Jeanine Pirro, a Trump loyalist, should continue the probe to completion. Scott, the Senate Banking Committee chairman, said he does not believe Powell committed a crime —while Trump has repeatedly claimed Powell is either corrupt or grossly incompetent, complaining about cost overruns on building renovations. Numerous Republicans on the Banking panel agree that Powell did not commit a crime, according to Tillis.Trump is also grappling with the fallout from the DOJ's release of millions of its files on notorious sexual predator Jeffrey Epstein, which is only intensifying days after the latest disclosures. Trump had opposed a bill forcing the DOJ to publicly share its files, but he reversed course as a growing number of Republicans geared up to vote for it anyway. The newly released records have revealed ties between Epstein and administration officials, including Commerce Secretary Howard Lutnick, who has since admitted visiting Epstein's island for lunch with his family in 2012.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump takes a beating from his own party amid Epstein files release and tariffs rebuke",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108265689-1771001988777-gettyimages-2260948284-AFP_97FA6TT.jpeg?v=1771021317&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T22:45:02.000Z",
      "dateModified": "2026-02-13T22:45:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venezuela oil sales top $1 billion, funds won’t go to Qatar account anymore, Energy secretary says",
    "url": "https://www.cnbc.com/2026/02/13/venezuela-oil-sales-qatar-chris-wright-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108264731-17708460822026-02-11t213826z_590913474_rc2xjjaw5b25_rtrmadp_0_venezuela-usa-oil.jpeg?v=1770995234&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T17:50:43.000Z",
    "description": "Venezuela's interim President Delcy Rodríguez and U.S. Energy Secretary Chris Wright speak with the media after attending a meeting, marking the highe",
    "body": "Venezuela's interim President Delcy Rodríguez and U.S. Energy Secretary Chris Wright speak with the media after attending a meeting, marking the highest-level U.S. visit focused on energy policy to the OPEC nation in nearly three decades, as Washington conducts its first on-the-ground assessment of the oil industry it aims to help rebuild, in Caracas, Venezuela, Feb. 11, 2026.Leonardo Fernandez Viloria | ReutersVenezuela oil revenue will no longer be deposited in an account in Qatar, Energy Secretary Chris Wright told NBC News in an interview this week. \"An account was set up in Qatar, controlled by the U.S. government the whole time, to land that money in and then send the money from there down to Venezuela,\" Wright told NBC News on Thursday. \"Now we have an account at the U.S. Treasury. The money won't go to Qatar anymore,\" the energy secretary said.The Trump administration has taken control of Venezuela's oil sales after capturing former President Nicolás Maduro in a military raid last month. Wright met Venezuela's interim president, Delcy Rodríguez, in Venezuela this week, the highest-ranking U.S. official to visit the country in decades. Wright told NBC News that revenue from Venezuelan oil sales now tops $1 billion. The U.S. has short-term agreements to sell another $5 billion of the country's crude over the next few months, he said. The oil has gone to U.S. refineries and Europe so far, he said. The U.S. deposited the initial $500 million of oil sales in the Qatar account before transferring the funds back to Venezuela, Wright said. Democrats in Congress have questioned the transparency and legality of the arrangement. Sen. Chuck Schumer, D-N.Y., and Sen. Adam Schiff, D-Calif., introduced legislation Thursday that directs the Government Accountability Office to conduct an independent audit of the Qatar account.  watch nowWright said the U.S. deposited the initial sales in Qatar because the funds face the risk of Venezuela's creditors attempting to claim them. Caracas faces tens of billions of dollars in outstanding claims from defaulting on its sovereign debt and nationalizing the assets of oil companies like Exxon Mobil and ConocoPhillips. \"Since Venezuela has so many creditors and they owe a lot of money, we had some risk if we put it into a U.S. bank account set up quickly that creditors could freeze that money,\" Wright said. \"We want those creditors ultimately to get their money back, but that money urgently needs to get to Venezuela.\"The U.S. faces the added complication that it does not officially recognize the government led by Rodríguez. President Donald Trump recognized the 2015 opposition-led National Assembly during his first term in 2019. Secretary of State Marco Rubio told the Senate Foreign Relations Committee on Jan. 28 that Washington must find a way to resolve the issue of government recognition for the funds to be deposited in the U.S.\"You have to recognize a government, but we don't recognize this government,\" Rubio said. \"We recognize the 2015 National Assembly, so we have to find some creative way legally to meet that standard.\"Venezuelan oil revenue deposited in the U.S. should in theory be under the control of the opposition National Assembly due to Trump's recognition, said Scott Anderson, an international law expert who previously served with the State Department and the U.S. Embassy in Baghdad under President Barack Obama.This raises the question of which government the U.S. will ultimately recognize and when. Wright told NBC that elections and a transition of power will likely happen in Venezuela during Trump's term. He said U.S. government oversight of Venezuela's domestic affairs would conclude at that point. \"It is a question of a process to get there,\" Wright said. \"Ultimately, what the long-term political leadership in Venezuela is going to be, it's going to be up to Venezuela.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venezuela oil sales top $1 billion, funds won’t go to Qatar account anymore, Energy secretary says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108264731-17708460822026-02-11t213826z_590913474_rc2xjjaw5b25_rtrmadp_0_venezuela-usa-oil.jpeg?v=1770995234&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T17:50:43.000Z",
      "dateModified": "2026-02-13T17:50:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he will issue executive order to get voter-ID requirements before midterms",
    "url": "https://www.cnbc.com/2026/02/13/trump-congress-voter-id-midterms.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108265725-1771005943998-gettyimages-2260956019-TRUMP_DEPART_WH.jpeg?v=1771025736&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-13T23:58:44.000Z",
    "description": "watch nowPresident Donald Trump on Friday said he will  issue an executive order \"shortly\" laying out the \"legal reasons\" for national voter-identific",
    "body": "watch nowPresident Donald Trump on Friday said he will  issue an executive order \"shortly\" laying out the \"legal reasons\" for national voter-identification requirements.Trump, in posts late Friday to Truth Social, said he wants voter-ID laws implemented for the 2026 midterm elections, even though legislation mandating them appears poised to stall in Congress.\"The Democrats refuse to vote for Voter I.D., or Citizenship. The reason is very simple — They want to continue to cheat in Elections,\" Trump posted to Truth Social.  \"This was not what our Founders desired. I have searched the depths of Legal Arguments not yet articulated or vetted on this subject, and will be presenting an irrefutable one in the very near future. There will be Voter I.D. for the Midterm Elections, whether approved by Congress or not!\" he continued.In a second post, published minutes after the first, Trump said, \"If we can't get it through Congress, there are Legal reasons why this SCAM is not permitted. I will be presenting them shortly, in the form of an Executive Order.\"Under pressure from Trump, his allies in the House and Senate and conservative online influencers, the issue of voter ID has dominated social media and reverberated through the halls of Congress in recent days. Trump's comments have also raised fears among Democrats and voting-rights groups that the president could try to intervene in this year's pivotal midterm elections, as Republicans try to hold on to slim majorities in both chambers.President Donald Trump speaks to members of the media on the South Lawn of the White House before boarding Marine One in Washington, Feb. 13, 2026.Samuel Corum | Sipa | Bloomberg | Getty ImagesThe House on Wednesday advanced, 218-213, a Trump-backed elections bill, dubbed the SAVE America Act, that would require proof of citizenship to register to vote and photo ID to cast a ballot. All but one Democrat voted against the proposal, which critics argue could disenfranchise millions and make it harder for people including women whose birth certificates would not show a married name to register. It now moves to the Senate, where it needs 60 votes to overcome a filibuster. Republicans hold just 53 seats in the chamber — and one, Sen. Lisa Murkowski, R-Alaska, has come out against the proposal. More than a handful of Democrats would have to support the legislation for it to succeed. Only one Senate Democrat, John Fetterman of Pennsylvania, has supported national voter-ID requirements, though he told the Pittsburgh Post-Gazette this week that he doesn't support other voting restrictions such as limiting mail-in ballots.Senate Minority Leader Chuck Schumer, D-N.Y., has vowed that Democrats will block the bill, calling it \"dead on arrival.\"\"The SAVE Act is not a mainstream bill whatsoever. It's a fringe piece of legislation that has now taken over the Republican Party, masquerading as election security when it's really about laying the groundwork to meddle in the midterm elections and make it much harder for people to vote,\" Schumer said from the Senate floor this week.Trump has recently said he wants to nationalize federal elections and revived election conspiracies, launching an FBI investigation into the election results in Fulton County, Georgia, a state the president has repeatedly and without evidence said he won in 2020. States are granted control of most aspects of U.S. elections under the Constitution.In his second post on Friday, Trump cast the midterms in existential terms. \"(T)hese Corrupt and Deranged Democrats, if they ever gain power, will not only be adding two States to our roster of 50, with all of the baggage thereto, but will also PACK THE COURT with a total of 21 Supreme Court Justices, THEIR DREAM, which they will submit easily and rapidly when they immediately move to terminate the Filibuster, probably in their first week, or sooner,\" Trump wrote. \"Our Country will never be the same if they allow these demented and evil people to knowingly, and happily, destroy it. Thank you for your attention to this matter — SAVE AMERICA!,\" he continued.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he will issue executive order to get voter-ID requirements before midterms",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108265725-1771005943998-gettyimages-2260956019-TRUMP_DEPART_WH.jpeg?v=1771025736&w=1920&h=1080"
      ],
      "datePublished": "2026-02-13T23:58:44.000Z",
      "dateModified": "2026-02-13T23:58:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]