[
  {
    "title": "Gold is at an all-time high—here's the best way to own it, according to financial experts",
    "url": "https://www.cnbc.com/2026/01/23/best-way-to-owngold-according-to-financial-experts.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255975-1769113430998-gettyimages-2237798142-img_2043.jpeg?v=1769113459&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T17:33:43.000Z",
    "description": "Call it a golden era for gold. After a historic 60% runup in 2025, the shiny stuff is hitting new highs this year, with prices currently exceeding $4,",
    "body": "Call it a golden era for gold. After a historic 60% runup in 2025, the shiny stuff is hitting new highs this year, with prices currently exceeding $4,900 an ounce. What's good for gold isn't necessarily great for other parts of the market. The precious metal has long been considered a \"safe haven\" asset, meaning that investors tend to flee other assets and flock to gold in the midst of economic or geopolitical turmoil. Investors can take their pick of dustups fueling market uncertainty and driving up gold prices, from the federal investigation into Federal Reserve chairman Jerome Powell, to the U.S. military operation in Venezuela to the recent economic saber-rattling over a U.S. push to control Greenland, Nicky Shiels, head of metals strategy at commodities firm MKS PAMP, recently told CNBC. \"You're entering a world where ... there is a strong demand to secure critical metals, critical commodities in this decade,\" she said. Generally, investors can hold gold in one of two ways: physically in the form of coins or bars or through an exchange-traded fund or mutual fund which tracks the fluctuations in the metal's price. Which approach is right for you depends on your reason for holding, says Mike Casey, a certified financial planner with AE Advisors in Alexandria, Virginia. \"I would reserve physical gold for no more than 5-10% of a diversified portfolio if you're risk-tolerant, value sovereignty or anticipate prolonged instability,\" he says. \"Otherwise, stick to paper gold.\"It's also smart to consult a trusted financial professional before making any changes to your portfolio.Owning physical gold as a disaster hedgeMany investors favor gold during times of instability, as it has been considered currency for millennia. Should something go seriously wrong with the financial system, such as a large-scale devaluation of the U.S. dollar, owning some precious metals could come in handy, says John Bell, a CFP with Free State Financial Planning in Highland, Maryland, adding that he typically advises clients interested in gold to own a mix of physical and \"paper\" gold. \"While I am not a doom and gloom person who thinks the apocalypse is upon us, I like the fact that gold and silver are outside the broad banking and financial services system,\" Bell says. \"For instance, you can access it any time if it is physical and take it to a local dealer to get money.\"Gold comes with a couple of other advantages during trying times, Casey adds. \"It eliminates counterparty risk,\" he says, meaning you won't have to rely on a mutual fund company or brokerage to give you your money. \"[It] provides tangible ownership, and can serve as a privacy shield in uncertain times — think estate planning or cross-border mobility.\"There are some drawbacks to holding gold this way, however. You'll generally have to pay a premium over gold's \"spot\" price (the price ETFs track) to own the physical stuff — often a 5% to 10% markup, Casey says — plus pay extra to store it somewhere, unless you're comfortable stashing it under your mattress. Plus, under normal circumstances, it's much harder to sell your physical gold for cash than it is to click \"sell\" on your your gold ETF position in your brokerage account. Owning gold as a portfolio diversifierEven if you don't have major concerns about geopolitics or the economy, there's still a case to made for owning some exposure to gold, says Casey. \"Gold's allure lies in its role as a portfolio diversifier,\" he says. \"It's historically non-correlated with stocks and bonds, offering stability during market volatility or currency devaluation.\"In other words, the factors that drive gold prices are different than the ones that drive the returns on stocks and bonds, such as corporate earnings and interest rates. And as Casey points out, gold has maintained or grown in value during some periods of market turbulence. In 2002, for instance, when the S&P 500 dropped more than 22%, gold rose by nearly 25%. Gold also posted a nearly 6% uptick in price in 2008, a year in which the broad stock market fell by 37%. Of course, gold doesn't move in the opposite direction as the stock market all of the time — 2025 was a great year for gold and a good one for stocks. But owning a mix of assets that perform differently under different conditions reduces overall volatility in your portfolio and generally provides a smoother ride, experts say. To add \"paper\" gold to your portfolio, consider buying a mutual fund or ETF that tracks the change in the metal's price. These funds are generally backed by a physical cache of precious metals and do an accurate job tracking the spot price. The reason investing experts recommend keeping gold as a small portion of a diversified portfolio is that unlike other assets, such as stocks and bonds, gold doesn't generate profits or throw off cash. \"It simply sits there, unchanged and unproductive, its value dependent on what the next buyer is willing to pay,\" says Alex Canellopoulos, a CFP with Vista Capital Partners in Portland, Oregon. \"That doesn't mean investors never benefit from rising gold prices,\" he says. But he and other experts caution against making it a major building block of your portfolio. Want to get ahead at work with AI? Sign up for CNBC's new online course, Beyond the Basics: How to Use AI to Supercharge Your Work. Learn advanced AI skills like building custom GPTs and using AI agents to boost your productivity today. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gold is at an all-time high—here's the best way to own it, according to financial experts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255975-1769113430998-gettyimages-2237798142-img_2043.jpeg?v=1769113459&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T17:33:43.000Z",
      "dateModified": "2026-01-23T17:33:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Capital One is buying startup Brex for $5.15 billion in credit card firm's latest deal",
    "url": "https://www.cnbc.com/2026/01/22/capital-one-is-buying-startup-brex-for-5point15-billion-in-credit-card-firms-latest-deal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106289306-1576027900694henriquepedro.jpg?v=1667836801&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T12:50:56.000Z",
    "description": "Brex co-founders Pedro Franceschi and Henrique Dubugras.BrexCapital One said Thursday that it was acquiring payments startup Brex for $5.15 billion, t",
    "body": "Brex co-founders Pedro Franceschi and Henrique Dubugras.BrexCapital One said Thursday that it was acquiring payments startup Brex for $5.15 billion, the latest splashy deal undertaken by the bank's CEO, Richard Fairbank.The firm, which disclosed the acquisition in its fourth-quarter earnings statement, said the purchase is made up of 50% cash and 50% stock. Brex was previously valued at $12.3 billion. Shares of the bank fell about 3%.Under Fairbank, a rare founder-CEO of a major U.S. bank, Capital One acquired rival card firm Discover Financial last year for about $35 billion. That deal was Fairbank's crowning achievement, giving the credit card lender access to one of the only payment networks of any scale. \"Since our founding, we set out to build a payments company at the frontier of the technology revolution,\" Fairbank said in a release. \"Acquiring Brex accelerates this journey, especially in the business payments marketplace.\"Fairbank said that Brex pioneered the melding of corporate cards, banking and spend management software: \"They have taken the rarest of journeys for a fintech, building a vertically integrated platform from the bottom of the tech stack to the top.\"Still, the more than 50% decline in valuation for Brex from its 2023 level shows the headwinds that even successful fintech companies have encountered. Brex is among a class of fintech firms that rose to prominence during a period of low interest rates; it was known initially as a startup that made loans to other startups via its cards.But the company expanded beyond technology into other sectors and now services larger established firms and startups alike, including Robinhood, Zoom and Anthropic. Capital One, which has offered business credit cards for decades, became increasingly convinced that it was Brex's model that would be the winning offering, according to a person with knowledge of the lender's strategy. \"We didn't have to pursue this acquisition, our growth was incredibly strong,\" Brex CEO Pedro Franceschi told CNBC in an interview.Combining Brex's technology with Capital One's reach and resources would grow the startup's scale faster than as a standalone firm, he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Capital One is buying startup Brex for $5.15 billion in credit card firm's latest deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106289306-1576027900694henriquepedro.jpg?v=1667836801&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T12:50:56.000Z",
      "dateModified": "2026-01-23T12:50:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Databricks obtains $1.8 billion in additional debt ahead of IPO",
    "url": "https://www.cnbc.com/2026/01/23/databricks-obtains-1point8-billion-in-additional-debt-ahead-of-ipo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108090174-1737511299846-Handout_Ali_Ghodsi_seated.jpg?v=1737511358&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T21:15:36.000Z",
    "description": "Databricks co-founder and CEO Ali Ghodsi.DatabricksData analytics software company Databricks has landed $1.8 billion in fresh debt, a person familiar",
    "body": "Databricks co-founder and CEO Ali Ghodsi.DatabricksData analytics software company Databricks has landed $1.8 billion in fresh debt, a person familiar with the matter told CNBC. Databricks now has access to over $7 billion in debt, the person added. The company declined to comment.Databricks is among the highly valued technology companies that are primed to go public in 2026, alongside Anthropic, Canva, OpenAI and Stripe. Ali Ghodsi, Databricks' co-founder and CEO, told CNBC in December that he wouldn't rule out an initial public offering this year.In December, Databricks said it was raising over $4 billion at a $134 billion valuation. The company said it was generating $4.8 billion in annualized revenue, growing at more than 55% year over year. Databricks also said that it had positive free cash flow over the past year.Its subscription gross margin in the 2025 fiscal year was over 80%, the company said at a June investor briefing. Founded in 2013, Databricks received the third highest ranking on CNBC's 2025 Disruptor 50 list of private companies.Bloomberg reported on the financing details earlier.WATCH: Databricks CEO Ali Ghodsi: Wouldn't rule out going public in 2026watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Databricks obtains $1.8 billion in additional debt ahead of IPO",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108090174-1737511299846-Handout_Ali_Ghodsi_seated.jpg?v=1737511358&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T21:15:36.000Z",
      "dateModified": "2026-01-23T21:15:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Musk’s $1 trillion pay package renews focus on soaring CEO compensation",
    "url": "https://www.cnbc.com/2026/01/24/musks-1-trillion-pay-package-renews-focus-on-rising-ceo-compensation.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108168277-17518962972025-05-13t150806z_1042401118_rc23heap82k4_rtrmadp_0_usa-trump-gulf-investment.jpeg?v=1751896328&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-24T12:00:02.000Z",
    "description": "watch nowElon Musk's pay package of up to $1 trillion highlights the continued escalation in CEO compensation, even as worker pay slows and rewards to",
    "body": "watch nowElon Musk's pay package of up to $1 trillion highlights the continued escalation in CEO compensation, even as worker pay slows and rewards to shareholders remain mixed, according to several studies.  Already, Musk is the richest person on the planet with a net worth that tops $660 billion, according to Bloomberg. Musk saw his 2018 Tesla pay package -- now valued at over $130 billion -- reinstated in December, and his company SpaceX looks set to for a potential public offering in 2026. Those two events could well put Musk on his way to becoming the world's first trillionaire this year. In addition, his new pay package, valued at up to $1 trillion, could also start paying out over the next decade.While Musk may be an outlier, his stock-fueled gains highlight the booming compensation and wealth gains of CEOs in recent decades that has been driven by rising stock markets and a broader adoption of stock-centric pay packages Over the past 50 years, top CEO compensation has climbed 1,094%, according to the Economic Policy Institute. That compares to a 26% increase in typical worker compensation. Median total compensation for S&P 500 CEO's was $17.1 million in 2024, up nearly 10% from 2023, according to Equilar, a corporate analytics firm. CEOs now make 192 times more than the average employee, up from a 186 to 1 ratio in 2023. Tesla CEO Elon Musk attends the Saudi-U.S. Investment Forum, in Riyadh, Saudi Arabia, May 13, 2025. Hamad I Mohammed | ReutersDriving the acceleration in CEO pay is a shift in the types of stock awards used to incentivize and reward corporate chiefs. CEO compensation typically includes four categories: salaries, long-term incentives, short-term incentives and perks. Long-term and short-term incentives are largely stock awards, and make up far and away the largest portion of CEO compensation. Stock awards accounted for 72% of CEO pay packages in 2024, with the median value increasing 15% that year, according to Equilar. Musk's trillion-dollar pay package, for instance, doesn't include any salary. The potential value of the $1 trillion would come entirely from stock awards pegged to various targets. For Musk to get the full payout, Tesla must hit key milestones, including certain market capitalization and operational achievements. He could still earn billions in stock even if Tesla doesn't meet all the targets.\"Milestone achievements built into CEO pay packages could be the norm in the future,\" said Amit Batish, senior director marketing at Equilar.Company boards and CEOs themselves say that because their pay is tied closely to stock performance, their compensation reflects the larger wealth created for shareholders. The CEO only does well if shareholders do well, they argue. If stocks plummet, CEO's can also see big pay drops. Others others argue that CEO's have only a partial impact on their companies' share price. A 2021 MSCI study of top executive pay between 2006 and 2020 found a weak correlation between higher CEO pay and company performance. \"This notion that the guy in the corner office is somehow almost single handedly responsible for company value, and everyone else is just little minions who don't contribute much of anything ... everyone can see that is not true,\" said Sarah Anderson, at the Institute for Policy Studies. Tesla's Optimus robots walk on the day of an unveiling event in Los Angeles, California, U.S. October 10, 2024, in this still image taken from a video.Tesla | Via ReutersAccording to the 2021 MSCI study, average performing CEO's took home only 4% less in realized pay than top-performing CEOs. More importantly, CEO's with the lowest awarded pay saw the strongest returns for shareholders.\"When we measured pay and performance against CEO tenure, we found little evidence that high CEO pay achieved this lofty goal of CEO incentivization,\" according to MSCI, an investment research firm.Since the 1990s, company boards have shifted away from stock options, which incentivize short-term performance, with stock awards, which boards argue are driven by longer-term incentives. Shareholders of publicly traded companies can now vote in an advisory capacity on CEO pay, known as \"say on pay\" votes, but company boards have final say when it comes to compensation packages.While restraining CEO pay has proven ineffective, given the natural \"ratcheting up\" of median CEO pay by board compensation committees, some economists advocate more stock awards for employees to help close the gap between employees and CEOs. Employee Stock Ownership Plans, or ESOPs, for instance, are qualified retirement plans that give employees shares in the company through a trust. Employees who can partake in ESOPs tend to end up with better financial security, said Loren Rodgers, executive director of the National Center for Employee Ownership. That in turn benefits their companies, he said. \"Employee-owned businesses are more productive,\" Rodgers said. \"They're more able to recruit people. People quit at lower rates. They're more competitive.\"Watch the video above to hear more about the uptick in CEO pay and what is driving these massive pay outs.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Musk’s $1 trillion pay package renews focus on soaring CEO compensation",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108168277-17518962972025-05-13t150806z_1042401118_rc23heap82k4_rtrmadp_0_usa-trump-gulf-investment.jpeg?v=1751896328&w=1920&h=1080"
      ],
      "datePublished": "2026-01-24T12:00:02.000Z",
      "dateModified": "2026-01-24T12:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia director Persis Drell resigns with $26 million worth of stock after decade on board",
    "url": "https://www.cnbc.com/2026/01/23/nvidia-director-persis-drell-resigns-decade-on-board-26-million-stock.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108248407-1767646313623-gettyimages-2254214508-CES_2026.jpeg?v=1769211489&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-24T00:04:34.000Z",
    "description": "Signage ahead of the Nvidia Live event at CES 2026 in Las Vegas, Jan. 5, 2026.Bridget Bennett | Bloomberg | Getty ImagesNvidia director Persis Drell, ",
    "body": "Signage ahead of the Nvidia Live event at CES 2026 in Las Vegas, Jan. 5, 2026.Bridget Bennett | Bloomberg | Getty ImagesNvidia director Persis Drell, an engineering professor at Stanford, resigned on Wednesday after just over a decade on the chipmaker's board of directors, the company said in a filing with the SEC on Friday. Drell, 70, stepped down to pursue a \"new professional opportunity,\" Nvidia said, and not because of a disagreement with company or any matter related to its operations or policies. Drell, who served on the compensation committee, is the first Nvidia board member to depart since astronaut Ellen Ochoa resigned in June. The board now has 10 directors, including CEO Jensen Huang. Drell owns close to 143,000 Nvidia shares, worth about $26 million, according to the latest holdings report. She was paid about $344,000 for her work with Nvidia last year, including almost $259,000 in stock awards, the company's annual report said. Nvidia's stock price is up over 22,000% since the end of 2015, emerging as the most valuable company in the world thanks to the artificial intelligence boom. Drell sold about 40,000 shares last year. Drell has been a professor at Stanford since 2002, serving as the dean of the engineering school from 2014 to 2017 and as Stanford's provost from 2017 to 2023. She was also director of Stanford's particle accelerator, called SLAC, from 2007 to 2012. Correction: This story has been revised to reflect that Persis Drell is 70 years old. A previous version misstated her age. WATCH: Chinese AI models adapt without Nvidiawatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia director Persis Drell resigns with $26 million worth of stock after decade on board",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108248407-1767646313623-gettyimages-2254214508-CES_2026.jpeg?v=1769211489&w=1920&h=1080"
      ],
      "datePublished": "2026-01-24T00:04:34.000Z",
      "dateModified": "2026-01-24T00:04:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sen. Warren blasts CFPB director for undermining Trump's credit card affordability push",
    "url": "https://www.cnbc.com/2026/01/23/warren-cfpb-director-letter-undermining-trump-credit-card-affordability.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256454-1769189949669-Warren_Vought.jpg?v=1769189966&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T20:32:31.000Z",
    "description": "U.S. Senator Elizabeth Warren (D-MA) and Director of the United States Office of Management and Budget, Russell Vought.Kevin Mohatt | Kevin Lamarque |",
    "body": "U.S. Senator Elizabeth Warren (D-MA) and Director of the United States Office of Management and Budget, Russell Vought.Kevin Mohatt | Kevin Lamarque | | ReutersSen. Elizabeth Warren on Friday accused the acting head of the Consumer Financial Protection Bureau of undermining President Donald Trump's stated push to make credit cards more affordable, according to a letter obtained exclusively by CNBC.In a letter to acting CFPB Director Russell Vought, Warren, D-Mass., noted that in the last year the agency has dropped a rule limiting credit card late fees, sided with lenders in lawsuits over deceptive practices and paused enforcement actions against the industry.Earlier this month, Trump demanded in a social media post that U.S. banks voluntarily cap credit card interest rates at 10% for a year. When they didn't, Trump this week called on lawmakers to pass legislation on the issue.\"I spoke with President Trump last week and told him that Congress could pass legislation to cap credit card rates, if he would fight for it,\" Warren wrote in her letter to Vought. \"While Congress considers legislation to address the issue, your own actions are directly undermining the President's stated goals,\" she wrote. \"Under your leadership, the CPFB has taken steps to make it easier—not harder—for big banks and credit card companies to rip off Americans.\"The letter from Warren seizes on Trump's pivot to affordability and seeks to leverage his initiative against his own administration, escalating tensions over the financial regulatory agency that she helped to create under the Obama administration. Members of the Trump administration have sought to shutter the CFPB as part of a broader pro-business deregulatory agenda.Current and former CFPB employees have said the agency is on life support under Vought, who has fought in court to enact mass layoffs and stop the agency's funding.An agency spokesperson said that the CFPB was disallowed from limiting credit card rates by the Dodd Frank Act.Vought should be \"using the full scope of [the CFPB's] authorities to address excessive credit card costs and to crack down on bad actors,\" instead of trying to dismantle the agency, Warren wrote.She directed Vought to \"immediately reinstate its rule capping credit card late fees at $8, which would save Americans more than $10 billion annually,\" Warren said.She contended Vought should also tamp down on deceptive practices around the industry's deferred interest promotions, resume enforcement of rules around monitoring interest rate increases, respond to a mounting pile of consumer complaints, and halt bait-and-switch tactics with rewards programs.\"Either President Trump is not serious about making credit cards more affordable or you are insubordinately disregarding his direction,\" she wrote.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sen. Warren blasts CFPB director for undermining Trump's credit card affordability push",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256454-1769189949669-Warren_Vought.jpg?v=1769189966&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T20:32:31.000Z",
      "dateModified": "2026-01-23T20:32:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Airlines cancel nearly 4,000 weekend flights as massive winter storm sweeps across U.S.",
    "url": "https://www.cnbc.com/2026/01/23/winter-storm-fern-flight-cancellations.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108082634-1736189865570-gettyimages-2192165643-DC_SNOW.jpeg?v=1736189903&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T21:41:00.000Z",
    "description": "Airplanes on the tarmac during a snow storm at Ronald Reagan Washington National Airport in Arlington, Virginia, US, on Monday, Jan. 6, 2025. Ting She",
    "body": "Airplanes on the tarmac during a snow storm at Ronald Reagan Washington National Airport in Arlington, Virginia, US, on Monday, Jan. 6, 2025. Ting Shen | Bloomberg | Getty ImagesAirlines canceled nearly 4,000 U.S. flights scheduled for the weekend as a massive winter storm sweeps across the country, with heavy snow and sleet in the forecast followed by bitter cold.More than 560 U.S. flights were canceled on Friday, with nearly 2,400 canceled from Saturday's schedule, according to flight tracker FlightAware. Many of Saturday's cancellations were in and out of Dallas Fort Worth International Airport, with more than 1,100 scrubbed flights, and at Dallas Love Field, with 180 cancellations, the majority of the schedule at each airport.Carriers canceled another 1,600 U.S. flights scheduled for Sunday, though those numbers could rise as the storm approaches. Airlines routinely cancel flights ahead of a major storm to prevent planes, passengers and crew from getting stranded, which can worsen disruptions after severe weather moves out. American Airlines, Delta Air Lines, JetBlue Airways, Southwest Airlines, United Airlines and other U.S. carriers said they are waiving change and cancellation fees as well as fare differences to rebook for customers with tickets to and from more than 40 airports around the country. The waivers include restrictive basic economy tickets.American said it was repositioning its airplanes and increasing staffing at major airports to help soften the impact of the storm and to \"set the stage for a fast, safe recovery once conditions improve.\"The National Weather Service is warning that the winter storm could affect hundreds of millions of people and is expected to \"bring widespread heavy snow, sleet, and freezing rain from the Southern Rockies to New England through Monday.\"Read more CNBC airline newsBoeing outsold Airbus last year for first time since 2018, deliveries rise to 600Allegiant to buy rival budget airline Sun Country in $1.5 billion cash and stock dealWhy airline class wars will intensify in 2026American Airlines no longer lets basic economy flyers earn miles",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Airlines cancel nearly 4,000 weekend flights as massive winter storm sweeps across U.S.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108082634-1736189865570-gettyimages-2192165643-DC_SNOW.jpeg?v=1736189903&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T21:41:00.000Z",
      "dateModified": "2026-01-23T21:41:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran is not a major oil producer, but it still moves prices. Here's why",
    "url": "https://www.cnbc.com/2026/01/23/iran-protests-why-oil-markets-care-so-much-about-the-country.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108042257-1727878433464-gettyimages-1079998236-IRAN_GAS.jpeg?v=1769194545&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T18:55:50.000Z",
    "description": "watch nowOil prices rose Friday as President Donald Trump's renewed threats against Iran raise concerns about supply disruptions.Iran is not a major o",
    "body": "watch nowOil prices rose Friday as President Donald Trump's renewed threats against Iran raise concerns about supply disruptions.Iran is not a major oil producer. The country pumps about 3.4 million barrels per day, according to Kpler. That number pales in comparison with the U.S. and Saudi Arabia, which pump about 13.5 million barrels per day and 9.5 million barrels per day, respectively, according to data from the U.S. Energy Information Administration and OPEC.Yet a recent wave of protests in Iran spurred by the plummet in the nation's rial currency and Trump's subsequent suggestions that the U.S. could take military action in the country have rocked energy markets.\"Oil markets are moving on fear,\" Helima Croft, global head of commodity strategy at RBC Capital Markets, told CNBC. \"It's basically a concern about disruption.\"Market anxiety grew Friday as tensions between Iran and the U.S. escalated. \"We're watching Iran,\" Trump told reporters Thursday. \"You know we have a lot of ships going in that direction just in case. We have a big flotilla going in that direction and we'll see what happens.\"Trump's comments come as more than 5,000 people have died in Iran since the protests began on Dec. 28, according to the Human Rights Activists News Agency. \"They were going to hang 837 people,\" Trump said in an interview with CNBC on Wednesday. \"And I told them, you can't do that. If you do that, it's going to be bad.\" While the market is well supplied for the time being, OPEC and its allies, which pump about 40% of the world's oil, hiked their output last year, cutting into spare capacity.\"If we were to get a confrontation between the U.S. and Iran that led to the loss of Iranian oil exports, there just isn't a lot left in the OPEC tank to cover that,\" Croft said. Concerns around a larger regional conflict have also lifted prices given Iran's proximity to some of the world's largest oil producers -- namely Saudi Arabia.\"Iran's location is strategically very important when we think about critical waterways like the Strait of Hormuz, which is a major chokepoint for oil, and we have seen Iran and Iranian-backed groups before target tankers and target critical infrastructure in the Gulf,\" said Croft. In 2019, Iran launched a series of attacks on oil tankers in the Strait of Hormuz. About 20% of global crude flows through the narrow waterway, according to the EIA.Despite pulling back threats of military intervention, Trump confirmed to CNBC on Wednesday that 25% tariffs on countries doing business with Iran are \"going forward.\"Existing sanctions on Iran have already hampered the country's crude exports, with the vast majority going to independent Chinese refiners that buy the oil at a discount to benchmark prices.\"Can you really squeeze Iran much more given where their barrels are going?\" said Croft. \"[Have] sanctions now lost [the] ability to kind of move the needle when it comes to Iranian policy?\"Watch the video above to learn more about Iran's impact on oil markets and what it could mean for consumers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran is not a major oil producer, but it still moves prices. Here's why",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108042257-1727878433464-gettyimages-1079998236-IRAN_GAS.jpeg?v=1769194545&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T18:55:50.000Z",
      "dateModified": "2026-01-23T18:55:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Intel stock drops 17%, its worst day since 2024, as manufacturing troubles overshadow earnings beat",
    "url": "https://www.cnbc.com/2026/01/23/intel-stock-earnings-q4-2025-supply.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214642-1761048654431-gettyimages-2240015417-jhangiani-indiamob251011_np4YW.jpeg?v=1769180659&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T21:01:06.000Z",
    "description": "The Intel logo is seen at the India Mobile Congress 2025 in Delhi, Oct. 11, 2025.Kabir Jhangiani | Nurphoto | Getty ImagesIntel shares plunged 17% on ",
    "body": "The Intel logo is seen at the India Mobile Congress 2025 in Delhi, Oct. 11, 2025.Kabir Jhangiani | Nurphoto | Getty ImagesIntel shares plunged 17% on Friday after the chipmaker issued lackluster guidance and warned of a supply shortage.The stock notched its worst day since August 2024.During a fourth-quarter earnings call with analysts Thursday, CEO Lip-Bu Tan said the company wouldn't be able to meet full demand for its products. He said production efficiency, or yield, is also below his targets. \"We are on a multiyear journey,\" he said. \"It will take time and resolve.\"The chipmaker expects first-quarter revenue to range between $11.7 billion and $12.7 billion, and adjusted earnings per share to break even. That was below LSEG expectations for earnings of 5 cents per share and $12.51 billion in revenue. Over the last year, Intel shares have rallied more than double on hopes of a turnaround for the embattled American chipmaker, following investments from the U.S. government, SoftBank and Nvidia.Read more CNBC tech newsWaymo launches robotaxi service in Miami, extending U.S. leadTrump wants Nvidia to sell powerful AI chips to Beijing. Washington's China hawks are pushing backOpenAI seeking investments from Middle East sovereign wealth funds for multibillion-dollar roundJeff Bezos' Blue Origin launches satellite internet service to rival SpaceX, AmazonThe company's foundry business has long underperformed competitors, which are profiting massively from the data center artificial intelligence boom. Investors were looking for clarity on foundry customers as the next momentum mover for the stock. The company's foundry business creates chips for other companies. CFO David Zinsner told CNBC that Intel expects customers for its next-generation 14A technology to appear in the second half of the year. But analysts at RBC Capital Markets warned that a \"meaningful revenue contribution\" from 14A customers may not pop up until late 2028. \"We appreciate the recent excitement around opportunity for INTC but still don't see a clear path forward given further share loss, no AI strategy and unclear fab/packaging opportunities,\" wrote analysts at Jefferies.Despite the soft outlook, Intel topped Wall Street's fourth-quarter earnings and revenue expectations. WATCH: BofA's Vivek Arya on Intel: We see no reason to buy a stock at 90x P/Ewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Intel stock drops 17%, its worst day since 2024, as manufacturing troubles overshadow earnings beat",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214642-1761048654431-gettyimages-2240015417-jhangiani-indiamob251011_np4YW.jpeg?v=1769180659&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T21:01:06.000Z",
      "dateModified": "2026-01-23T21:01:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta's Reality Labs cuts sparked fears of a 'VR winter'",
    "url": "https://www.cnbc.com/2026/01/24/metas-reality-labs-cuts-sparked-fears-of-a-vr-winter.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108039322-17273001022024-09-25t204232z_1101917728_rc2u7aaqtwho_rtrmadp_0_meta-platforms-virtual-reality-zuckerberg.jpeg?v=1727300136&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-24T12:00:02.000Z",
    "description": "Meta CEO Mark Zuckerberg tries on Orion AR glasses at the Meta Connect annual event at the company's headquarters in Menlo Park, California, U.S., Sep",
    "body": "Meta CEO Mark Zuckerberg tries on Orion AR glasses at the Meta Connect annual event at the company's headquarters in Menlo Park, California, U.S., September 25, 2024. REUTERS/Manuel OrbegozoManuel Orbegozo | ReutersMeta's deprioritizing virtual reality in favor of artificial intelligence and Internet-connected smart glasses has chilled the industry, leading to concerns about its future. \"I can see how it feels like a VR winter,\" said Jessica Young, an independent VR content creator specializing in Horizon Worlds, Meta's virtual social network. The social media giant last week laid off 10% of employees who work within its Reality Labs unit, with the cuts centering on VR-related initiatives like the Quest VR headsets, CNBC reported. Teams working on  Horizon Worlds were hit hard and some in-house studios were shuttered. Approximately 1,000 jobs were cut, CNBC reported. The move was part of the company's effort to redirect Reality Labs investments from VR to AI and wearable devices like the Ray-Ban Meta smart glasses that are co-produced with EssilorLuxottica, a spokesperson for the social media company said in a statement last week. Meta declined to comment further beyond its previous statement.Meta's reduced investment in VR is notable considering how much the company has helped grow the industry since its $2 billion acquisition of Oculus in 2014. The company became synonymous with VR when CEO Mark Zuckerberg changed its name from Facebook to Meta, representing the founder's obsession with a future of digital worlds referred to as the metaverse. Since late 2020, Meta's Reality Labs division has logged over $70 billion in cumulative losses.Zuckerberg's sudden reversal has some VR developers worried about their future prospects. While they said they don't see Meta killing its VR efforts, a major shift appears to be underway. Andrew Bosworth, chief technology officer and head of Reality Labs at Meta Platforms Inc., during the Meta Connect event in Menlo Park, California, US, on Thursday, Sept. 18, 2025. David Paul Morris | Bloomberg | Getty ImagesMeta traditionally announces new Quest VR headsets during its annual Connect conference in the fall, but in 2025, the company skimped on VR hardware. Instead, Meta introduced its $799 Meta Ray-Ban Display glasses that contain a single, built-in digital screen. \"If Meta's not putting out a new headset for another year or two, it's going to feel stale,\" Young said. \"It already kind of does.\"Since the layoffs, Meta tech chief Andrew Bosworth has been vocal that the social media giant is not abandoning VR.\"We're still continuing to invest heavily in this space, but obviously, VR is growing less quickly than we hoped,\" Bosworth told tech newsletter Sources. \"And so you want to make sure that your investment is right-sized.\"Bosworth this week also circulated a post by Oculus co-founder Palmer Luckey, who on Sunday wrote on X that Meta still employs the \"largest team working on VR by about an order of magnitude.\" Although Luckey said that he feels \"really bad for the people impacted\" by the layoffs, the Reality Labs changes represent \"a good thing thing for the long-term health of the industry, especially the ongoing incentives.\"'The market has spoken'Market research firm IDC said in a December report that a major transition is occurring in the so-called Extended Reality, or XR, device segment. This category includes VR and so-called mixed-reality headsets that allow users to switch between virtual environments and see their surroundings outside the helmet. The category also counts AI-powered smart glasses and more powerful versions with digital displays.IDC projects the XR device category to have grown 41.6% year-over-year to 14.5 million units shipped for 2025. But that growth has nothing to do with VR and mixed-reality headsets — those shipments are expected to drop 42.8% to 3.9 million in 2025. The rest of this XR category, which includes AI glasses with and without displays, is projected to grow 211.2% year-over-year to 10.6 million units shipped for 2025.Jitesh Ubrani, a research manager for market analyst firm IDC, characterized the VR headset market as niche and appealing to only a small segment of video gamers. Average consumers seem uninterested in wearing \"big, bulky headsets\" for lengthy VR sessions like much of the tech industry hoped for roughly a decade ago, he said.\"The market has spoken,\" Ubrani said. \"There are certain niche audiences that will continue to use these headsets, but it's not going to be broadly appealing.\"Visitors experience the new AR+AI glasses flagship product at the XREAL booth at WAIC 2025 in Shanghai, China, on July 27, 2025. Costfoto | Nurphoto | Getty ImagesAndrew Eiche, the CEO of the Google-owned VR gaming studio Owlchemy Labs, said it was always misguided to think VR was on the cusp of having its breakthrough smartphone moment. He called it a \"strategic mistake\" to compare VR headsets to iPhones The VR market, Eiche said, more closely resembles old-school Atari video game consoles that were popular before sales crashed during an infamous 1983 gaming market meltdown. It wasn't until the late 1980s that Nintendo consoles helped revive the market, laying the groundwork for the overall industry to balloon to the massive sector it is today.\"Lot of tech people thought [VR] was going to be instantly amazing, and the same thing's happening with AI,\" Eiche said about the tech industry's pivot to the latest craze. \"When you're looking at long-term technologies, VR is not going anywhere.\"Still, Eiche said that beyond Meta's layoffs, other VR studios have also recently downsized as part of a broader video game industry slump. Because Quest is the dominant VR headset on the market, its app store is a key distribution channel for third-party VR.Making matters worse, Eiche said that Meta's Horizon Worlds push came at the expense of third-party developers who were trying to find visibility among Quest users.\"We're at the mercy of Meta,\" Eiche said, adding that it \"creates a situation where if Meta pulls back, we all pull back.\" Eiche said he's optimistic that the upcoming Steam Frame wireless VR headset from gaming company Valve will help the market, as well as the recent entries of other devices like the Samsung Galaxy XR, which debuted in October, and Apple's Vision Pro. But Apple's entry into the VR space in February 2024 hasn't done much to move the needle, and in January, IDC said that Apple's Chinese manufacturing partner Luxshare stopped producing new Vision Pro headsets, signaling a lack of widespread consumer demand. Still, Ubrani said that Apple's $3,499 spatial computing headset has found some footing as a business tool.\"Apple did do well in selling to a lot of developers, but they also sold into some very big companies,\" Ubrani said.watch nowVR's hope shifts to the enterprise market\"There were certain quarters where Apple beat Meta in enterprise,\" Ubrani said, due in part to the iPhone-maker's experience selling devices to businesses. The enterprise VR market may not be as glamorous as its consumer counterpart, but it represents an area where IDC has \"seen slow but upwards movement, because companies are realizing that there is great ROI attached with deploying these headsets.\"As part of Meta's Reality Labs cuts, the company said in a support page that it would end its Horizon managed services program that was for businesses that used Quest headsets for internal tasks like virtual employee trainings.Meta failed to realize \"how big VR could be if they adopted the bigger picture outside of gaming,\" said Sean Mann, CEO of the startup RP1, which develops a \"metaverse browser\" for people to access virtual and augmented reality environments. As Meta downsizes its VR ambitions and steers Horizon Worlds to be a mobile-focused online gaming platform like Roblox, Young said she plans to keep creating experiences on the platform. Young has been able to make a living by getting paid by other Horizon developers to create trailers to promote experiences available to users on the service. She's also earned money from Meta by winning Horizon-related competitions intended to help improve the overall platform.But Young said she's less enthusiastic about Horizon's mobile push, because there was something special about the platform during its earlier, VR-centric years, particularly during the Covid era. \"Horizon became a lifeline for people isolated by the pandemic, disability, age or geography,\" she said. \"Many users who never imagined themselves as creators, who had no background in art or programming, were inspired by their friends to try.\"But Horizon lost is way, and \"what's frustrating now is watching people declare it dead without ever having experienced or understanding what it was,\" Young said. WATCH: Meta's Joel Kaplan on AI investments: Our ambition is to build 'personal superintelligence.'watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta's Reality Labs cuts sparked fears of a 'VR winter'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108039322-17273001022024-09-25t204232z_1101917728_rc2u7aaqtwho_rtrmadp_0_meta-platforms-virtual-reality-zuckerberg.jpeg?v=1727300136&w=1920&h=1080"
      ],
      "datePublished": "2026-01-24T12:00:02.000Z",
      "dateModified": "2026-01-24T12:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Adani group stocks plunge as U.S. SEC looks to question founder over fraud charges",
    "url": "https://www.cnbc.com/2026/01/23/adani-group-shares-sec-investigation-fraud.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108070014-17331600242024-12-02t070458z_587775375_rc2rfbajk3cu_rtrmadp_0_adani-group-usa.jpeg?v=1733160050&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T10:18:34.000Z",
    "description": "Indian billionaire Gautam Adani attends the 51st Gems and Jewellery Awards in Jaipur, India, November 30, 2024. Stringer | ReutersShares of Adani Grou",
    "body": "Indian billionaire Gautam Adani attends the 51st Gems and Jewellery Awards in Jaipur, India, November 30, 2024. Stringer | ReutersShares of Adani Group companies fell between 5 to 13% on Friday as court filings showed that the U.S. Securities and Exchange Commission is looking to send summons to founder Gautam Adani and nephew Sagar Adani on charges of bribery and fraud.  Indian billionaire Gautam Adani, chair of India's Adani Group and one of the world's richest people, was indicted with seven other men in New York federal court in November 2024 on charges related to a massive bribery and fraud scheme.The SEC has approached a U.S. District Judge, Nicholas Garaufis in Brooklyn, seeking permission to issue a legal summons to Adani Group Chairman Gautam Adani and the executive director of Adani Green Energy, Sagar Adani, according to court filings. CNBC has reached out to Adani Group and the U.S. SEC for comment.Shares of Adani Green Energy ended the session nearly 14% lower, while those of the flagship company Adani Enterprises closed 10.7% lower on Friday. Shares of Adani Power dropped 5.7%.The Adani Group executives are charged with misleading U.S. and international investors about their company's compliance with anti-bribery and anti-corruption practices, as they raised more than $3 billion in capital to fund those energy contracts.India's Ministry of Law and Justice has twice refused last year to deliver the summons to Gautam Adani and Sagar Adani under the Hague Convention, the SEC told the court. \"The Ministry appeared to suggest that the SEC lacks authority to invoke the Hague Convention or seek service of the Summonses,\" it said.Adani and several other defendants are accused of having paid Indian government officials more than $250 million in bribes to obtain solar energy supply contracts worth more than $2 billion in profits.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Adani group stocks plunge as U.S. SEC looks to question founder over fraud charges",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108070014-17331600242024-12-02t070458z_587775375_rc2rfbajk3cu_rtrmadp_0_adani-group-usa.jpeg?v=1733160050&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T10:18:34.000Z",
      "dateModified": "2026-01-23T10:18:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House passes final funding bills 8 days before shutdown, Senate now will consider",
    "url": "https://www.cnbc.com/2026/01/22/government-funding-shutdown-house.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256212-17691712382026-01-23t000421z_2144178006_rc2l6jawqs8u_rtrmadp_0_usa-congress.jpeg?v=1769171252&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T12:28:57.000Z",
    "description": "US House Speaker Mike Johnson, a Republican from Louisiana, center, joined by Republican lawmakers, speaks during a news conference at the US Capitol ",
    "body": "US House Speaker Mike Johnson, a Republican from Louisiana, center, joined by Republican lawmakers, speaks during a news conference at the US Capitol in Washington, DC, US, on Thursday, Jan. 22, 2026. Kent Nishimura | Bloomberg | Getty ImagesThe House of Representatives on Thursday passed the final set of outstanding government funding bills as a partial federal government shutdown looms on Jan. 30.The four bills account for the largest chunk of government spending, about $1.2 trillion in total. They would fund the departments of Defense; Health and Human Services; Homeland Security; Labor; Housing and Urban Development; Transportation; and Education. The Homeland Security bill passed 220-207, while the other three cleared 341-88 as part of a package known as a \"minibus.\"The bills represent the final quartet of 12 annual appropriations bills required to fund the government and avoid a partial shutdown on Jan. 30. The Senate still needs to approve them, along with two other House-passed funding bills, before they head to President Donald Trump's desk for a signature. The Senate does not return until next week, and a winter storm closing in on Washington over the weekend threatens to complicate those plans. House lawmakers were widely expected to pass the bills on Thursday, with lawmakers desperate to avoid another shutdown after enduring a record 43-day shutdown last year. Despite bipartisan accord on avoiding another shutdown, some of the bills still face serious hurdles in the Senate. Read more CNBC politics coverageGreenland PM: Trump-NATO deal framework unclear, sovereignty is a red lineTrump sues Jamie Dimon, JPMorgan Chase over debanking the suit calls 'political'Trump says he reached Greenland deal 'framework' with NATO, backs off tariffsTrump interview live updates: CNBC's Joe Kernen sits down with the president at DavosRussia watches as ally Iran edges closer to collapse. Here's why it matters for MoscowTrump's latest geopolitical gambits all lead back to ChinaTrump says anything less than U.S. control of Greenland is 'unacceptable' ahead of talksDemocrats have warned they will not support a bill to fund the Homeland Security Department after an Immigration and Customs Enforcement Agent fatally shot a U.S. citizen in Minnesota earlier this month. The Homeland bill was being considered separately from the other three bills in the House due to the political peril. Meanwhile, Republicans from the Midwest demanded a provision be added to the spending package to allow year-round sale of gasoline with a heavy mix of ethanol, known as E15. The fuel is currently restricted in the summer months due to smog concerns, though that restriction is frequently waived.House Republican leadership agreed to create a congressional \"E-15 Rural Domestic Energy Council\" instead to assuage those Republicans.Trump told Fox Business on Thursday that he \"think[s] we're going to probably end up in another Democrat shutdown,\" but did not specify whether he was referring to the deadline at the end of this month. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House passes final funding bills 8 days before shutdown, Senate now will consider",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256212-17691712382026-01-23t000421z_2144178006_rc2l6jawqs8u_rtrmadp_0_usa-congress.jpeg?v=1769171252&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T12:28:57.000Z",
      "dateModified": "2026-01-23T12:28:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wall Street braced for a private credit meltdown. The risk of one is rising",
    "url": "https://www.cnbc.com/2026/01/23/wall-street-private-credit-risk-rising.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108242891-1765977615868-gettyimages-2234195958-TRICOLOR_LENDER.jpeg?v=1769092444&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T21:26:18.000Z",
    "description": "watch nowThe sudden collapse last fall of a string of American companies backed by private credit has thrust a fast-growing and opaque corner of Wall ",
    "body": "watch nowThe sudden collapse last fall of a string of American companies backed by private credit has thrust a fast-growing and opaque corner of Wall Street lending into the spotlight.Private credit, also known as direct lending, is a catch-all term for lending done by nonbank institutions. The practice has been around for decades but surged in popularity after post-2008 financial crisis regulations discouraged banks from serving riskier borrowers. That growth — from $3.4 trillion in 2025 to an estimated $4.9 trillion by 2029 — and the September bankruptcies of auto-industry firms Tricolor and First Brands have emboldened some prominent Wall Street figures to raise alarms about the asset class.JPMorgan Chase CEO Jamie Dimon warned in October that problems in credit are rarely isolated: \"When you see one cockroach, there are probably more.\" Billionaire bond investor Jeffrey Gundlach a month later accused private lenders of making \"garbage loans\" and predicted that the next financial crisis will come from private credit.While fears about private credit have subsided in recent weeks in the absence of more high-profile bankruptcies or losses disclosed by banks, they haven't lifted completely.Companies that are most linked to the asset class, such as Blue Owl Capital, as well as alternative asset giants Blackstone and KKR, still trade well below their recent highs.The rise of private creditPrivate credit is \"lightly regulated, less transparent, opaque, and it's growing really fast, which doesn't necessarily mean there's a problem in the financial system, but it is a necessary condition for one,\" Moody's Analytics chief economist Mark Zandi said in an interview. Private credit's boosters, such as Apollo co-founder Marc Rowan, have said that the rise of private credit has fueled American economic growth by filling the gap left by banks, served investors with good returns and made the broader financial system more resilient.Big investors including pensions and insurance companies with long-term liabilities are seen as better sources of capital for multiyear corporate loans than banks funded by short-term deposits, which can be flighty, private credit operators told CNBC. But concerns about private credit — which tend to come from the sector's competitors in public debt — are understandable given its attributes.After all, it's the asset managers making private credit loans that are the ones valuing them, and they can be motivated to delay the recognition of potential borrower problems. \"The double-edged sword of private credit\" is that the lenders have \"really strong incentives to monitor for problems,\" said Duke Law professor Elisabeth de Fontenay.\"But by the same token … they do in fact have incentives to try to disguise risk, if they think or hope that there might be some way out of it down the road,\" she said.De Fontenay, who has studied the impact of private equity and debt on corporate America, said her biggest concern is that it's difficult to know if private lenders are accurately marking their loans, she said.\"This is a market that is extraordinarily large and that is reaching more and more businesses, and yet it's not a public market,\" she said. \"We're not entirely sure if the valuations are correct.\"In the November collapse of home improvement firm Renovo, for instance, BlackRock and other private lenders deemed its debt to be worth 100 cents on the dollar until shortly before marking it down to zero.Defaults among private loans are expected to rise this year, especially as signs of stress among less creditworthy borrowers emerge, according to a Kroll Bond Rating Agency report.And private credit borrowers are increasingly relying on payment-in-kind options to forestall defaulting on loans, according to Bloomberg, which cited valuation firm Lincoln International and its own data analysis.Ironically, while they are competitors, part of the private credit boom has been funded by banks themselves.Finance frenemiesAfter investment bank Jefferies, JPMorgan and Fifth Third disclosed losses tied to the auto industry bankruptcies in the fall, investors learned the extent of this form of lending. Bank loans to non-depository financial institutions, or NDFIs, reached $1.14 trillion last year, per the Federal Reserve Bank of St. Louis.On Jan. 13, JPMorgan disclosed for the first time its lending to nonbank financial firms as part of its fourth-quarter earnings presentation. The category tripled to about $160 billion in loans in 2025 from about $50 billion in 2018.Banks are now \"back in the game\" because deregulation under the Trump administration will free up capital for them to expand lending, Moody's Zandi said. That, combined with newer entrants in private credit, might lead to lower loan underwriting standards, he said.\"You're seeing a lot of competition now for the same type of lending,\" Zandi said. \"If history is any guide, that's a concern ... because it probably argues for a weakening in underwriting and ultimately bigger credit problems down the road.\"While neither Zandi nor de Fontenay said they saw an imminent collapse in the sector, as private credit continues to grow, so will its importance to the U.S. financial system.When banks hit turbulence because of the loans they made, there is an established regulatory playbook, but future problems in the private realm might be harder to resolve, according to de Fontenay.\"It raises broader questions from the perspective of the safety and soundness of the overall system,\" de Fontenay said. \"Are we going to know enough to know when there are signs of problems before they actually occur?\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wall Street braced for a private credit meltdown. The risk of one is rising",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108242891-1765977615868-gettyimages-2234195958-TRICOLOR_LENDER.jpeg?v=1769092444&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T21:26:18.000Z",
      "dateModified": "2026-01-23T21:26:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A former Trump official wants to build a massive data center in a remote corner of Greenland. Will it work?",
    "url": "https://www.cnbc.com/2026/01/23/greenland-data-center-trump-greenmet.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255706-1769093603396-gettyimages-2162650655-sg019483_u12rqe7i.jpeg?v=1769093648&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T16:47:22.000Z",
    "description": "KANGERLUSSUAQ, GREENLAND - JULY 09: Passenger planes for local flights of Air Greenland stand on the tarmac at the airport as signs show the flight ti",
    "body": "KANGERLUSSUAQ, GREENLAND - JULY 09: Passenger planes for local flights of Air Greenland stand on the tarmac at the airport as signs show the flight times to various global destinations on July 09, 2024 in Kangerlussuaq, Greenland. (Photo by Sean Gallup/Getty Images)Sean Gallup | Getty Images News | Getty ImagesA former official of U.S. President Donald Trump's first administration is planning a multi-billion-dollar data center project in a remote corner of Greenland, as hyperscalers scramble to build out capacity across the globe to keep up with the AI rollout.The data center is aiming to be operational at 300 megawatts (MW) by mid-2027, before further expansion would see it hit 1.5 gigawatts (GW) by the end of 2028.While that's currently several times the power capacity of any active data center in the world, there are plans to build multiple 1 GW-plus facilities across the globe over the next two years as the race to develop AI infrastructure continues to gather pace.The Greenland data center project will cost billions of dollars to complete and has binding commitments with investors to finance half of its initial phase of development and half of the final phase, Drew Horn, a senior aide to Trump's first-term vice president Mike Pence and CEO of GreenMet, a company that's offering strategic support to the project, told CNBC. The venture is eyeing a buildout in the Kangerlussuaq area, a small settlement at the end of a deep fjord on the southwest coast of the Arctic island, with an airport, he added.Technical partners have been enlisted to help with the physical buildout, but the project has yet to secure land or approvals from the local authorities, Horn said. He declined to share the names of the other companies involved in the venture because the information isn't public yet.Commercial opportunities in Greenland have been thrust into the spotlight in recent weeks as the Arctic island has become the center of a geopolitical firestorm after U.S. President Donald Trump doubled down on acquisition talk. Critical minerals mining and freshwater reserves have been touted as potential prospects, though skeptics point to logistical challenges around tapping into them with Greenland's limited infrastructure.  watch nowMulti-billion-dollar data centerData center deals hit a record $61 billion in 2025 amid a rush to build out the infrastructure needed to power energy-intensive AI workloads. Big tech firms, including Meta, OpenAI, Oracle, AWS, Microsoft and Google are investing huge sums into developing facilities across the globe. Work on plans for the Greenland data center project began a year ago, and Horn told CNBC it has secured technical partners to assist with construction, operation and supplying energy.Committed financing, which is in the form of debt and equity, is contingent on the project meeting key milestones, including securing permits from local government, said Horn — who was also a senior advisor to both the energy and intelligence departments towards the end of Trump's first term.Other former senior Trump employees also have stakes in GreenMet, which says on its website that it helps companies with government and private funding and strategic partnerships.  George Sorial, who was an executive vice president and chief compliance counsel at the Trump Organization until 2019, and Keith Schiller, who was a longtime bodyguard for Trump and director of Oval Office operations during the U.S. president's first term, helped set up the company in 2021 and remain shareholders.\"We are not actively involved with GreenMet or Greenland,\" Sorial told CNBC. \"We are passive minority shareholders in GreenMet and have no management role in the company.\" Schiller had not responded to a CNBC request for comment as this story went live.The GreenMet CEO has been developing relationships with officials in the Greenlandic and Danish administrations as he looks to advance the project. He met the Danish Ambassador to the U.S. Jesper Møller Sørensen on Wednesday, as part of a \"continuing dialogue,\" to discuss the data center, Horn said. CNBC has approached Denmark's U.S. embassy for comment.While officials on all sides have been supportive of the project, the \"issue is not so much on the private side, it's on the diplomatic,\" Horn said, pointing to the geopolitical tensions surrounding the U.S. push to acquire Greenland, a semi-autonomous Danish territory.Tensions have cooled since Trump backtracked on plans to impose tariffs on several European nations over the issue, but questions still remain as negotiations around U.S. military and economic involvement in Greenland continue.\"Our effort, which is purely private, it succeeds only if we have the buy-in from the relevant affected parties and countries,\" Horn said.Securing power\"Larger corporate entities\" will be taking the lead on the construction and development of the data center, but GreenMet will continue to be involved as an advisor as the project looks to secure government investment from nations including the U.S., Greenland, Denmark, and other NATO countries, Horn told CNBC. \"We've spent about a year putting together everything from the power to the technology components, [and] we have a Greenlandic partner on the ground,\" Horn said. \"Right now we're waiting on approvals from the Greenlandic side.\"A big challenge for projects of this scale in Greenland is access to power. For the first phase of the project, which is targeting 300 MW power capacity, the plan is to use specialized barges carrying Liquefied Natural Gas to the fjord, Horn said.The venture plans to build a hydroelectric facility — 70% of the island's energy comes from such facilities — to power the second phase, which would see the data center hit 1.5 GW capacity. Permits and approvals from the Greenlandic government are still pending for both the barges and the facility. Greenland's Ministry of Business has been approached for comment.Kangerlussuaq Fjord. Large iceberg in scenic fjord surrounded by snow-capped mountains, Southeast coast, Greenland.Vw Pics | Universal Images Group | Getty ImagesHorn argues that if local authorities greenlight the large hydroelectric facility, energy prices will make the project commercially viable long-term. There are some significant advantages to building data centers in an environment with low temperatures, analysts told CNBC.\"The biggest value sits in its resource profile, specifically in hydro for electricity generation and a 'free cooling' proposition given the lower ambient temperature,\" Noah Ramos, strategist at investment research firm Alpine Macro, told CNBC.But there are hurdles the project will have to overcome. \"Building in the Arctic is capital intensive; construction seasons are short, and the heat from the servers can melt the very ground the building sits on... specialized engineering is needed,\" Ramos said.Nvidia is also touting a new generation of chips that require less cooling. \"It's early days, but if future generations of chips are even more efficient in this regard, it could negate the need for expensive data centre build outs in places like Greenland,\" Michael Field, chief equity strategist at Morningstar, told CNBC.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A former Trump official wants to build a massive data center in a remote corner of Greenland. Will it work?",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255706-1769093603396-gettyimages-2162650655-sg019483_u12rqe7i.jpeg?v=1769093648&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T16:47:22.000Z",
      "dateModified": "2026-01-23T16:47:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pardoned Binance founder Zhao says his business relationship with the Trumps was 'misconstrued'",
    "url": "https://www.cnbc.com/2026/01/23/pardon-binance-founder-cz-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108255873-1769103185430-DSC00106.JPG?v=1769103720&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-23T18:14:38.000Z",
    "description": "watch nowBinance founder Changpeng \"CZ\" Zhao said his business relationship with President Donald Trump's family has been \"misconstrued\" in the wake o",
    "body": "watch nowBinance founder Changpeng \"CZ\" Zhao said his business relationship with President Donald Trump's family has been \"misconstrued\" in the wake of his pardon. \"There's no business relationships whatsoever,\" Zhao told CNBC's Andrew Ross Sorkin on Thursday in an interview at the World Economic Forum in Davos, Switzerland.The former Binance CEO served four months in prison after pleading guilty in 2023 to charges he enabled money laundering during his time leading the company. Zhao was released in September 2024.Trump's pardon in October 2025 drew attention to Binance's ties to World Liberty Financial, a crypto company founded by the president's family.The connection stems from a $2 billion investment in March 2025 by state-owned firm MGX of Abu Dhabi, United Arab Emirates, into Binance. MGX paid using USD1, a stablecoin created by World Liberty Financial.Zhao stepped down as Binance's CEO in 2023 as part of the plea deal and $4.3 billion settlement with the Department of Justice. He remains a major shareholder.\"MGX is the investor. They choose USD1,\" Zhao told CNBC. \"My request to them was they pay us in crypto. I don't want to deal with banks, really.\"\"Many people misconstrued that,\" he added.Zhao told CNBC the company has since converted that investment out of USD1 in portions over time.\"Stablecoin is just a currency for payment. Just because I accepted that, it doesn't mean I invested in the issuer of that,\" he said.\"As we have stated many times, WLFI is not a political organization and had zero role in the pardon process,\" World Liberty Financial spokesperson David Wachsman said in a statement. \"To imply otherwise is dangerous and false.\"Read more CNBC tech newsWaymo launches robotaxi service in Miami, extending U.S. leadTrump wants Nvidia to sell powerful AI chips to Beijing. Washington's China hawks are pushing backOpenAI seeking investments from Middle East sovereign wealth funds for multibillion-dollar roundJeff Bezos' Blue Origin launches satellite internet service to rival SpaceX, AmazonThe Wall Street Journal reported following the pardon that in addition to MGX's investment using USD1, Binance also helped build the technology behind the stablecoin, citing sources familiar with the matter.\"A lot of people say that he wasn't guilty of anything,\" Trump said, when asked later why he issued the order. \"And so I gave him a pardon at the request of a lot of very good people.\"NBC News reported the week of Trump's pardon that Binance had recently hired lobbyist Charles McDowell's firm, Checkmate Government Relations. McDowell is a friend of Donald Trump Jr., the president's son.Checkmate disclosed that it was paid $450,000 for work that included lobbying the White House and Treasury Department for \"executive relief\" and \"financial services policy issues relating to digital assets and cryptocurrency.\"\"There is a lot of media saying that there is some deal in place to get me the pardon,\" Zhao told CNBC at Davos. \"As far as I know, that does not exist at all.\"Zhao told CNBC at Davos that he has still not spoken directly with Trump.\"The closest that I got to him was today when he was doing the Board of Peace session,\" Zhao said. \"I was in the audience, about 30 to 40 feet away from him.\"In a CBS \"60 Minutes\" interview in November, Trump affirmed that he did not know Zhao.\"I have no idea who he is,\" Trump said. \"I was told that he was a victim, just like I was and just like many other people, of a vicious, horrible group of people in the Biden administration.\"— CNBC's Jacqueline Corba contributed to this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pardoned Binance founder Zhao says his business relationship with the Trumps was 'misconstrued'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108255873-1769103185430-DSC00106.JPG?v=1769103720&w=1920&h=1080"
      ],
      "datePublished": "2026-01-23T18:14:38.000Z",
      "dateModified": "2026-01-23T18:14:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]