[
  {
    "title": "U.S. founders are 'shameless' with feedback and Europe's should do the same: OpenAI's startup boss",
    "url": "https://www.cnbc.com/2025/10/11/american-founders-more-demanding-than-europe-openai-startup-boss-says.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108209778-1759986401217-gettyimages-2236404267-radecka-illustra250920_np0Hx.jpeg?v=1760005858&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-11T02:07:12.000Z",
    "description": "OpenAI's EMEA startups head Laura Modiano spoke at the Sifted Summit on Wednesday, 8 October.Nurphoto | Nurphoto | Getty ImagesIn the latest compariso",
    "body": "OpenAI's EMEA startups head Laura Modiano spoke at the Sifted Summit on Wednesday, 8 October.Nurphoto | Nurphoto | Getty ImagesIn the latest comparison between American and European founders, OpenAI's startup boss admitted that the Americans are \"almost shameless\" when it comes to making demands and giving feedback to the AI giant.Laura Modiano, who heads up OpenAI's startups division in EMEA, drew a comparison between American and European founders based on her extensive work with founders across both regions and rolling out AI features.\"So feedback is extremely important. We're moving at lightning speed. It has to represent your voice and I see American founders being extremely good, almost shameless, and coming in and saying: 'We need this. You need to get better at that. You need to improve that. You need this new feature,'\" Modiano said during a fireside chat at the Sifted Summit on Wednesday. \"If founders don't tell us, we don't always know.\"She called on European founders to be much more vocal — or risk missing out on big opportunities.\"Please, please, please, if you're using OpenAI ... you should always tell us what you think about it, what is working, what isn't and how we can do better.\"She cited Lovable, valued at $1.8 billion, as an example of a European company good at giving feedback. The Swedish vibe coding startup has a GPT-5-based assistant called Lovable Assistant 5.\"When GPT-5 was launched, they [Lovable] were one of the companies that launched with us, and they were in the alpha, so early access to GPT-5, and they gave us a lot of feedback. Like, I was in their office for a week, and literally every hour, we were having reviews,\" she said.\"'How is something working? What do we need?' So GPT-5 launching actually had the taste of European developers included in the model that all of you are using today. So unless you're vocal about it, you're missing out on a great opportunity.\"Swedish AI-learning platform Sana was another startup praised by Modiano.\"I was in their office a few months ago and they said: 'We really need this capability on voice, the tone of voice, the speed, this is what we need.' I got that feedback then we see who else has had similar feedback, and then we prioritize that feature on the roadmap to make sure that we're servicing what the customer is asking for,\" she said.\"I give this advice often. I say every startup, especially every AI startup, should have a chief feedback officer, because we can only ship and include things in our roadmap, different features, different improvements, if we know what customers want,\" she added.European vs. U.S. startupsWith her comments, Modiano was fanning the flames of a debate that has seen European entrepreneurs criticized for lacking the same intensity and vigor as their American counterparts.Earlier this year, some venture capitalists suggested that startup founders in Europe needed to increase their work hours — including working seven days a week — to be more competitive globally.Harry Stebbings, founder of 20VC, previously told CNBC Make It that Europeans are not as good at marketing themselves when pitching their company to venture capitalists and are often held back by a culture of reservedness.By contrast, Americans are much better at telling exciting stories to promote their businesses: \"I think, often in the U.K., we downsize in ambitions,\" he said.More recently, U.K. Business Secretary Peter Kyle fired shots at British university students, criticizing them for lacking ambition and not having the drive to start their own companies, as opposed to students at American universities.\"In Britain, if you went to a group of undergraduates, how big would that group have to be before you found someone that said their choice of going to university … was because they wanted to become a founder?\" Kyle said at an event hosted by AI chipmaker Nvidia in London. \"The entrepreneurialism simply isn't there – the drive, the vigour.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. founders are 'shameless' with feedback and Europe's should do the same: OpenAI's startup boss",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108209778-1759986401217-gettyimages-2236404267-radecka-illustra250920_np0Hx.jpeg?v=1760005858&w=1920&h=1080"
      ],
      "datePublished": "2025-10-11T02:07:12.000Z",
      "dateModified": "2025-10-11T02:07:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Julia Roberts learned to navigate career criticism: 'I had a lot of things I needed to overcome for myself'",
    "url": "https://www.cnbc.com/2025/10/11/how-julia-roberts-learned-to-navigate-career-criticism.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210249-1760039082956-gettyimages-2232666032-t_w27788_v8at4cye.jpeg?v=1760039184&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-11T13:30:01.000Z",
    "description": "Julia Roberts may an Academy Award-winning actress, but early in her career, she struggled to overcome harsh criticism.\"I don't think I entered into m",
    "body": "Julia Roberts may an Academy Award-winning actress, but early in her career, she struggled to overcome harsh criticism.\"I don't think I entered into my career with much confidence,\" Roberts told People Magazine in a recent interview.Roberts, who broke through as an actress with films like \"Steel Magnolias\" and \"Pretty Woman,\" said that in her early 20s she encountered \"a few critical people who were really cruel.\"\"Being insecure, it can be crippling. So if someone embarrassed me, it stopped me,\" she recalls. \"I was apoplectic, so learning to navigate that — because this is not an industry to be in if you can't take criticism or harshness or being embarrassed.\"Instead of being discouraged, Roberts chose to view those situations as an \"interesting challenge for me to decide the kind of person I wanted to strive to be,\" she told People.She describes her experience as a young actress as \"more bumps than smooth sailing,\" but today, she sees her past hurdles as opportunities for growth.\"I would think, 'Okay, there's a reason why it has to be so hard.' Now I look at it as some of the lessons that I'm the most grateful for because they proved my endurance to myself,\" she said.\"I had a lot of things I needed to overcome for myself,\" Roberts continued.Coping with criticism in the workplaceBuilding resilience is \"particularly important for young woman who are starting their careers,\" regardless of industry, according to career and leadership coach Phoebe Gavin.\"We receive a lot of cultural conditioning that makes us very critical of ourselves and very concerned about being observed and being judged,\" Gavin says. \"All of those things can bring up a lot of insecurity as we enter the workplace.\"No matter how self-assured you are, harsh criticism can feel crushing, she says.If abrasive feedback is taking a toll on your confidence, the most crucial thing to remember is \"to put distance between yourself and the criticism,\" Gavin says.\"When you hear people say critical things or mean things or cruel things, remember that it's about them, that that is a reflection of who they are. It's not necessarily a reflection of who you are,\" she says.Instead of internalizing others' unkind words, \"think very loudly in your own mind about the things that make you valuable and what you're bringing to the table,\" Gavin says.There may be a \"kernel of truth\" inside some criticism, according to Gavin: \"Sometimes useful feedback can come in very ugly packaging,\" she says.If that's the case, Gavin recommends taking some time to reflect on your actions and what you could change in the future.\"Instead of internalizing it as something that is permanently true about you forever, find the places where you have agency to make positive change in yourself or the way that you work,\" she says.Still, if your workplace is taking a toll on your mental health, \"it's OK for you to decide for yourself that being in that sort of environment isn't right for you,\" Gavin says.Want to earn more and grow your money? Save 30% with this earnings-boosting bundle of our top courses.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Julia Roberts learned to navigate career criticism: 'I had a lot of things I needed to overcome for myself'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210249-1760039082956-gettyimages-2232666032-t_w27788_v8at4cye.jpeg?v=1760039184&w=1920&h=1080"
      ],
      "datePublished": "2025-10-11T13:30:01.000Z",
      "dateModified": "2025-10-11T13:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I've studied over 200 kids—these 7 toxic parenting habits lead to mentally weak children",
    "url": "https://www.cnbc.com/2025/10/12/ive-studied-over-200-kids-these-7-toxic-parenting-habits-lead-to-mentally-weak-children.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210773-1760121736425-GettyImages-2203824954.jpg?v=1760121800&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-12T13:24:25.000Z",
    "description": "As parents, it's our job to give our kids the tools they need to face struggle without breaking.I've studied over 200 parent-child relationships, and ",
    "body": "As parents, it's our job to give our kids the tools they need to face struggle without breaking.I've studied over 200 parent-child relationships, and I'm a mother myself. My goal has always been to teach kids how to process hard feelings and move forward. Mentally strong kids know how to regulate their emotions, trust themselves, and rebound after setbacks. And that kind of strength is built at home, in the everyday moments between parent and child.Here are seven things to avoid if you want to raise mentally strong kids.1. Rescuing kids from every struggleKids build resilience by learning that can get through tough situations. When you rush to fix every problem, you rob your child of resilience. Let them wrestle with discomfort while staying present as their safe base.What to do: Clinical psychologist Dr. Lisa Damour says kids who regularly face age-appropriate challenges build stronger emotional regulation over time.If your child forgets their homework, let them face the natural consequence instead of driving it to school for them. Then talk afterward about what they learned and how they can plan differently next time.2. Trying to model perfectionIt's okay to lose your temper sometimes. But parents who raise mentally strong kids don't pretend like something didn't happen — or blame the child for \"making\" them react.Mental strength happens when you move through problems without destroying trust.What to do: If you snapped at them, say: \"I was stressed and took it out on you. I'm sorry.\" Your child learn will that mistakes don't end relationships, and that taking responsibility is strength.This models what experts call \"rupture and repair,\" a foundational concept in connection and emotional intelligence.3. Silencing big feelingsShutting down big feelings like anger or sadness teaches kids to fear their own emotions. Strength comes from knowing that hard feelings are manageable.This is also where kids practice social resilience. If they know anger or sadness won't destroy your bond, they're more prepared to face rejection or conflict with peers.What to do: When your child is upset, avoid saying, \"You're fine.\" Instead say: \"I know that really hurt. I'm here with you.\" Your calm presence teaches them emotions aren't emergencies.4. Prizing achievementA child who only feels valuable when they succeed will crumble under pressure. Mentally strong kids know their worth doesn't depend on grades or trophies.What to do: Studies show that perfectionism is rising in kids, which is linked to anxiety and burnout in adolescence.After a poor grade, avoid saying, \"You're smarter than this.\" Instead, say: \"I'm proud of the effort you put in. Your grade doesn't define you.\"5. Hoarding powerAuthoritarian parenting looks strong but breeds weakness. When kids never get a voice, they learn to either collapse or rebel. True strength grows when they're invited into decisions, learning that their voice matters.This is also how kids develop autonomy: They practice independence while staying connected to your guidance.What to do: Research shows that giving kids a sense of control builds motivation and reduces power struggles. Let your child choose between two chores or help decide what's for dinner. Small choices build confidence.6. Making kids feel responsible for your emotionsSome parents unknowingly expect kids to regulate their stress by comforting them. This emotional role reversal is damaging.What to do: Instead of saying, \"You're making me sad,\" try: \"I'm feeling overwhelmed. I need a moment to calm down.\" It's not your child's job to manage your nervous system.7. Glorifying burnoutChildren raised to glorify productivity grow into burned-out adults. Show them that strength includes knowing when to pause, recharge, and value themselves beyond constant output.When you demonstrate rest, you're teaching body awareness: how to recognize stress signals and respond before burnout.What to do: Say, \"I'm going to rest for 20 minutes. Taking care of myself helps me feel better.\"Mental strength is all about helping kids face hard things, feel their feelings, take ownership, and rest — while knowing they're deeply loved for who they are.Reem Raouda is a leading voice in conscious parenting and the creator of FOUNDATIONS, a step-by-step guide that helps parents heal and become emotionally safe. She is widely recognized for her expertise in children's emotional safety and for redefining what it means to raise emotionally healthy kids. Connect with her on Instagram.Want to be your own boss? Sign up for CNBC's new online course, How To Start A Business: For First-Time Founders. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I've studied over 200 kids—these 7 toxic parenting habits lead to mentally weak children",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210773-1760121736425-GettyImages-2203824954.jpg?v=1760121800&w=1920&h=1080"
      ],
      "datePublished": "2025-10-12T13:24:25.000Z",
      "dateModified": "2025-10-12T13:24:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I studied 5 of the world's healthiest countries: 5 things I'm doing now to live a longer, happier life",
    "url": "https://www.cnbc.com/2025/10/12/i-studied-5-of-the-worlds-healthiest-countries-things-im-doing-to-live-a-longer-happier-life.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108208332-1759772495260-Ken_Stern_Singapore_IMG_1912.jpg?v=1759772571&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-12T13:13:50.000Z",
    "description": "Last year, while researching for my book \"Healthy to 100: How Strong Social Ties Lead to Long Lives,\" I visited five of the world's healthiest countri",
    "body": "Last year, while researching for my book \"Healthy to 100: How Strong Social Ties Lead to Long Lives,\" I visited five of the world's healthiest countries — Singapore, Japan, South Korea, Italy, and Spain — to see how they keep older adults active, engaged, purposeful, and healthy.I picked these countries because they have some of the longest healthy life expectancies in the world (in some cases, a decade longer than the U.S.). And none of them the most ideal environments for aging: Singapore is hot, crowded, and has a notoriously competitive work environment, for instance. In Spain, obesity and smoking rates are significant. If these countries can succeed, so can we.At a community development center in Kanazawa, Japan, older adults teach, volunteer, run the restaurant, or just hang out with young people and those with Down syndrome. In Korea, lifelong learning is written into the Constitution. Singapore is building a whole \"health district.\" Italy taps into the wisdom and energy of seniors through volunteering.After seeing how these countries are rewriting the rules on aging, I'm doing five things to live a longer, happier life.1. I'll plan for the next 20 years, like I did the last 20In other countries, definitions of \"old age\" are fluid, tied to individual circumstances rather than arbitrary dates. At 62, I can easily have another 20 or more years of good health, and unlike many older adults, I am going to plan them with the same seriousness of purpose I did the last 20.   I spent the first big chunk of my career managing people who create content. It was only in my 50s that I realized I was much happier telling the stories myself. In the last decade, I've written three books, hosted my own podcast, launched two weekly newsletters, and started a video channel on Instagram called GrandPeople. While our society often pushes us to make big, intentional career and life plans in our 20s, 30s, 40s, and 50s, we don't typically expect as much from people over the age of 60. But as I look ahead, I'm excited to continue honing and developing my craft. Because there's no reason the next 20 years can't be as meaningful and purposeful as the last. 2. I won't retire anytime soon, but I will rethink how I workJapan has the highest percentage of older workers in the world, and many of them aren't working just for the money. They do it for purpose, connection, and health. Most work part-time, on flexible schedules, or in job shares.While in Japan, I met older adults working on candy assembly lines, managing books for a machine tool company, running parking lots, driving taxis, and guiding tours.The lesson they embodied stuck with me. As I think about my own future, I plan to continue working, but on my terms. I'll keep writing books and telling stories. But maybe I won't commit to putting out two newsletters a week forever. And that's okay. Instead of working full-steam or retiring completely, I can find a middle ground. The goal is to keep working in a way that fits the life I want to lead.3. I'll spend time with people of all agesAmericans don't tend to think of intergenerational connection as a public health strategy, but people in the countries I visited see how important this is. Studies all over the world have shown the benefits of intergenerational relationships, such as increased happiness, a better sense of well-being, and improved physical and mental health.Even in the U.S., which has been described as one of the most age-segregated societies in the world, there are opportunities for intergenerational collaboration: at work, in neighborhoods, in volunteer settings, in families. I'll proactively find places and activities that connect me with younger generations, and choose to foster my friendships with people of all ages. Down the line, I'd consider moving into a place like Mirabella at Arizona State University or Gorham House in Maine, which combines a nursing home with a preschool. 4. I'll prioritize socializing over scrollingTime spent with friends has dropped precipitously in the U.S., while time spent with technology has skyrocketed. It doesn't have to be that way. I saw for myself how Italians spend more time at meals and with family and less time online. This couldn't be more important. A decades-long Harvard study tells us that positive relationships are key to living a longer, happier, healthier life — more crucial even than career achievement, money, exercise, or a healthy diet.My baby steps include being more intentional about family meals without phones and trying to cut back on the obsessive scrolling of the news and Instagram that interferes with human conversation.  5. I'll never stop learningResearch has demonstrated that learning supports healthy aging. Many states provide free or low-cost education opportunities to older adults, and I plan to take advantage of them. As I think ahead to my next book project, I might enroll in a writing seminar at an Osher Lifelong Learning Institute designed to serve older learners. Each one is associated with a university — the closest to me is at American University — and offers a wide range of classes. Whatever class I take or learning I do, it will be in person. Because interacting face-to-face maximizes social connection and healthy longevity. Ken Stern is a nationally recognized expert on longevity and aging. He is the founder of the Longevity Project and hosts the popular \"Century Lives\" podcast from the Stanford Center on Longevity. His most recent book is Healthy to 100: How Strong Social Ties Lead to Long Lives.\" He is also the former CEO of NPR.Want to be your own boss? Sign up for Smarter by CNBC Make It's new online course, How To Start A Business: For First-Time Founders. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue. Sign up today with coupon code EARLYBIRD for an introductory discount of 30% off the regular course price of $127 (plus tax). Offer valid September 16 through September 30, 2025.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I studied 5 of the world's healthiest countries: 5 things I'm doing now to live a longer, happier life",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108208332-1759772495260-Ken_Stern_Singapore_IMG_1912.jpg?v=1759772571&w=1920&h=1080"
      ],
      "datePublished": "2025-10-12T13:13:50.000Z",
      "dateModified": "2025-10-12T13:13:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "33-year-old was rejected from a baseball internship, now she's the team's general manager: 'I never pictured I could have a career in baseball'",
    "url": "https://www.cnbc.com/2025/10/12/33-year-old-was-rejected-from-a-baseball-internship-now-shes-the-teams-general-manager.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108209973-1760018731166-WooSox_AshGreen_127.jpg?v=1760019288&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-12T13:45:01.000Z",
    "description": "Brooke Cooper was 12 years old when she thought her career in baseball was over.She had aged out of her local Little League offerings and there were n",
    "body": "Brooke Cooper was 12 years old when she thought her career in baseball was over.She had aged out of her local Little League offerings and there were no more opportunities for girls to play the sport, Cooper tells CNBC Make It. She tried playing softball next, which is traditionally seen as the female counterpart to baseball, but says she \"didn't have the same passion.\"\"I loved playing baseball,\" Cooper, now 33, says. \"I never pictured I could have a career in baseball.\"In March 2024, Cooper became the general manager of the Worcester Red Sox, a Triple-A minor league affiliate of the Boston Red Sox, in Worcester, Massachusetts. She is the first female general manager in Boston Red Sox franchise history.However, Cooper says she was rejected the first time she applied for an internship with the team, then known as the Pawtucket Red Sox. That summer, the then 20-year-old waited tables and volunteered at a sports marketing firm instead, she says.From intern to general managerTwo years later, she says she applied for the merchandising internship again, this time as an MBA student at Providence College, and got the job.\"The first time, I tried to play it cool, which sounds so ridiculous because I was 20 years old and had no idea what I was doing,\" she says. \"That second time, I made it so clear how much I wanted it, how hard I would work, and I'm sure I probably had a better sense of maturity a couple of years later.\"As an intern, Cooper says she balanced business school classes with vacuuming and managing merchandise inventory in the team store.\"I was running my own small business within the larger business,\" and while the gig only paid her minimum wage, she says the experience itself was \"professionally fulfilling.\"Worcester Red SoxSoon, she began climbing the ranks, first as an assistant to the director of merchandising, and then a manager of merchandising. As the team's director of marketing and merchandising, she helped temporarily rebrand the Pawtucket Red Sox to the Hot Wieners in 2018. In 2021 she was promoted to the vice president of marketing, and the year after she became the team's assistant general manager.Dealing with imposter syndromeWhen Cooper started with the Worcester Red Sox in 2015, she says she didn't think it was possible to have a career in professional baseball. There was only one other woman working for the team's front office, and Cooper says her dream was to open a community center similar to a YMCA or Boys and Girls Club anyways.\"I say I don't have imposter syndrome, and then when I describe it, it's the definition of imposter syndrome,\" Cooper says.Looking back, she says having that imposter syndrome ended up working to her benefit because it allowed her to speak up and share her candid thoughts with managers and in meetings without being afraid of losing the job.  'I'm really, really happy to be part of an organization where this can be normalized'Cooper never felt singled out for being a woman either, she says. Her managers and team leadership have treated every promotion as a matter of fact, recognizing her as the best person for the job, she says. Becoming the Red Sox franchise's first female general manager wasn't \"a big deal\" in her organization until it was publicly announced, Cooper says.Of the 120 Minor League Baseball teams that serve as developmental programs for 30 Major League Baseball teams, 14 were led by female general managers in the 2025 season, according to the league. In 2020, Kim Ng was became the first and only female general manager to lead a Major League Baseball team. Ng left her role with the Miami Marlins in 2023.\"I'm really, really happy to be part of an organization where this can be normalized,\" Cooper says of the Worcester Red Sox. \"I find working in Minor League Baseball professionally challenging in a good way, and also very personally fulfilling … I am kind of living out my dream.\"Want to be your own boss? Sign up for CNBC's new online course, How To Start A Business: For First-Time Founders. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "33-year-old was rejected from a baseball internship, now she's the team's general manager: 'I never pictured I could have a career in baseball'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108209973-1760018731166-WooSox_AshGreen_127.jpg?v=1760019288&w=1920&h=1080"
      ],
      "datePublished": "2025-10-12T13:45:01.000Z",
      "dateModified": "2025-10-12T13:45:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top Wall Street analysts are bullish on these 3 stocks for the long term",
    "url": "https://www.cnbc.com/2025/10/12/top-wall-street-analysts-are-bullish-on-these-3-stocks-for-the-long-term.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108190867-1756224416073-gettyimages-2205145572-cros-mobilewo250305_npQpc.jpeg?v=1756224514&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-12T11:35:49.000Z",
    "description": "The Snowflake Inc logo, the American cloud computing-based data company that offers cloud-based storage and analytics services, is on their pavilion d",
    "body": "The Snowflake Inc logo, the American cloud computing-based data company that offers cloud-based storage and analytics services, is on their pavilion during the Mobile World Congress 2025 in Barcelona, Spain, on March 5, 2025.Joan Cros | Nurphoto | Getty ImagesInvestors are looking beyond the prolonged U.S. government shutdown and remain optimistic about growth drivers like the artificial intelligence boom and expectations of further interest rate cuts.Ignoring the short-term noise, those looking for attractive investment opportunities can consider the stock picks of top Wall Street analysts, whose recommendations are based on a thorough analysis of a company's fundamentals and growth catalysts.Here are three stocks favored by the Street's top pros, according to TipRanks, a platform that ranks analysts based on their past performance.SnowflakeFirst on this week's list is Snowflake (SNOW), a cloud-native data platform. At the recently held Snowflake World Tour event in New York City, the company highlighted its product innovation and the vision for driving business transformation through data and artificial intelligence.After attending this customer conference, Jefferies analyst Brent Thill reiterated a buy rating on SNOW stock with a price forecast of $270. Based on his conversations with customers and partners at the event, the analyst noted that Snowflake's product innovation and velocity are accelerating.Thill highlighted that while traction for Snowflake's AI offerings is building, the inflection point is still ahead. For instance, the top-rated analyst noted that a retailer using Snowpark ML for demand forecasting, and a travel company integrating Snowflake ML models into its customer experience pipeline, both believe that broader usage across their organizations will take a few more quarters.Another key takeaway was that Snowflake's unstructured data capabilities have strengthened, but there are still some gaps to address. Overall, Thill believes that while traction is building for Snowflake, the \"AI Blizzard\" still lies ahead.\"SNOW remains one of our favorite data & AI stories and stands to benefit meaningfully as enterprise AI strategies mature and AI driven data volumes grow exponentially in the coming years,\" concluded Thill. Interestingly, TipRanks' AI Analyst has a \"neutral\" rating on Snowflake stock with a price target of $255.Thill ranks No. 251 among more than 10,000 analysts tracked by TipRanks. His ratings have been successful 65% of the time, delivering an average return of 14.1%. See Snowflake Ownership Structure on TipRanks.Advanced Micro DevicesMoving on to chipmaker Advanced Micro Devices (AMD), which recently made headlines after announcing a game-changing partnership with OpenAI. Under this deal, OpenAI will deploy up to 6 gigawatts of AMD Instinct GPUs over multiple years, starting with a 1-gigawatt rollout in the second half of 2026. The agreement also involves a warrant for up to 160 million shares (vesting tied to certain milestones), which, if fully exercised by OpenAI, will give it about a 10% stake in AMD.Following the news, Jefferies analyst Blayne Curtis upgraded AMD stock to buy from hold and boosted the price target to $300 from $170. Additionally, TipRanks' AI Analyst has an \"outperform\" rating on AMD stock with a price target of $232.Curtis believes that AMD's deal with OpenAI clearly changed the AI narrative for the semiconductor company. While the chipmaker will still have to achieve some milestones, the 5-star analyst believes that this partnership is a solid confirmation of AMD's AI roadmap and a proof of robust AI demand in general.Interestingly, Curtis recently raised his estimates for AMD following positive server checks. The analyst stated he was incrementally positive on AMD after his recent Asia trip, with the expectation of 500 basis points per year share gains in server CPUs with the company's Venice platform.However, these recent checks hadn't helped Curtis grasp anything from the original device manufacturers (ODMs) in terms of AI ramps. \"The announcement of OpenAI as a lead customer with the potential for $80-100B in revenue across 6GW of compute through 2030 materially changes that outlook,\" said Curtis.Curtis ranks No. 68 among more than 10,000 analysts tracked by TipRanks. His ratings have been profitable 65% of the time, delivering an average return of 27.5%. See AMD ETF Exposure on TipRanks.Dell TechnologiesIT infrastructure and personal computing solutions provider Dell Technologies (DELL) announced an increase in its long-term financial targets during its analyst meeting on Oct. 7. The improved outlook is backed by demand from the ongoing AI wave.Following the event, Mizuho analyst Vijay Rakesh reiterated a buy rating on DELL stock and raised his price target to $170 from $160. Meanwhile, TipRanks' AI Analyst has a \"neutral\" rating on DELL stock with a price target of $135.Rakesh noted management's commentary about momentum in enterprise and sovereign AI, with strong demand signals over 12-18 months. The top-rated analyst highlighted that the company raised its compound annual growth rate target for revenue for fiscal 2026 to 2030 to the range of 7% to 9%, with non-GAAP EPS expected to rise by 15% or more.Furthermore, Rakesh noted that Dell's fiscal 2026 AI server revenue estimate of $20 billion is in line with the Street's consensus of $20.6 billion and reflects over 100% growth from $9.8 billion in the previous year. The company expects a 20% to 25% CAGR through Fiscal 2030, implying AI server revenue of $46 billion.However, the analyst believes that this growth outlook could be conservative, as the company is involved in all at-scale AI cluster deployments and leads in T2 CSP (tier 2 cloud service providers) and enterprise AI deployments with more than 3,000 customers.Rakesh ranks No. 81 among more than 10,000 analysts tracked by TipRanks. His ratings have been successful 65% of the time, delivering an average return of 24.3%. See Dell Technologies Hedge Fund Activity on TipRanks.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top Wall Street analysts are bullish on these 3 stocks for the long term",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108190867-1756224416073-gettyimages-2205145572-cros-mobilewo250305_npQpc.jpeg?v=1756224514&w=1920&h=1080"
      ],
      "datePublished": "2025-10-12T11:35:49.000Z",
      "dateModified": "2025-10-12T11:35:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China defends rare earth export curbs as ‘legitimate,’ hits back at U.S. tariffs as Trump-Xi meeting hangs in balance",
    "url": "https://www.cnbc.com/2025/10/12/china-defends-rare-earth-export-curbs-as-legitimate-hits-back-at-us-tariffs-ahead-of-possible-trump-xi-meeting.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210930-1760237541506-gettyimages-121393135-65965310.jpeg?v=1760237569&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-12T12:44:46.000Z",
    "description": "U.S. and China national flags adorn motorcades in Beijing, China.Pool | Getty Images News | Getty ImagesChina on Sunday defended its new export contro",
    "body": "U.S. and China national flags adorn motorcades in Beijing, China.Pool | Getty Images News | Getty ImagesChina on Sunday defended its new export controls on rare earths as a \"legitimate\" measure under international law, pushing back against U.S. accusations of economic coercion after Washington announced sweeping retaliatory tariffs and export restrictions.The Chinese Ministry of Commerce said the controls, issued Oct. 9, were part of Beijing's effort to strengthen its export control system and \"better safeguard world peace and regional stability\" amid what it described as a turbulent global security environment.The measures, which now cover not only rare earth materials but also related intellectual property and technologies, were announced just weeks before a potential meeting between U.S. President Donald Trump and Chinese leader Xi Jinping.\"These controls do not constitute export bans. Applications that meet the requirements will be approved,\" a commerce ministry spokesperson said. \"China has fully assessed the potential impact of these measures on the supply chain and is confident that the impact will be very limited.\"Beijing's new curbs also require foreign entities to obtain a license to export products containing more than 0.1% of domestically-sourced rare earths, or manufactured using China's extraction, refining, magnet-making or recycling technology. Applications for items that could be used in weapons or other military purposes will be denied.Shortly after Beijing tightened export controls on rare earths, the European Chamber of Commerce in China reported a backlog of export license applications awaiting approval, saying the new restrictions \"add further complexity to the global supply chains of rare earth elements.\"\n\t\t\n\t\t\n\t\t\n\t\t\tWeekly analysis and insights from Asia's largest economy in your inbox\n\t\t\tSubscribe now\n\t\t\n\tIn response to Beijing's move, Trump on Oct. 10 announced new tariffs of 100% on imports from China \"over and above any Tariff that they are currently paying\" beginning Nov. 1. Trump also said that the U.S., on that same date, would also impose export controls on \"any and all critical software.\"Stock markets plunged after Trump said on Truth Social that \"there is no way that China should be allowed to hold the World 'captive'\" with its rare earths policy — wiping $2 trillion in market value.The Chinese Commerce Ministry on Sunday local time accused the U.S. of \"double standards,\" noting that the U.S. control list covers more than 3,000 items, compared to fewer than 1,000 on China's list.China accounts for about 70% of the global supply and has repeatedly used the critically needed minerals as a bargaining chip in trade discussions.Tensions whipsawHours after tightening export controls on rare earths, Beijing also announced that it would start charging U.S. ships docking at Chinese ports from Oct. 14, mirroring a new U.S. fee on Chinese vessels arriving at U.S. ports, set to take effect the same day.The U.S. accounts for only 0.1% of global shipbuilding, compared to 53.3% for China, according to the Center for Strategic and International Studies.The Chinese commerce ministry defended its reciprocal decision as \"necessary passive defensive actions.\" It added that the U.S. actions \"seriously undermined the atmosphere of the economic and trade talks between the two sides.\"Senior U.S. and Chinese officials met for trade negotiations in Geneva in May — the first since Trump launched a global trade war. A follow-up meeting in London in June led to a trade \"framework,\" while a third round of high-level talks took place a month later in Stockholm, where both sides signaled progress in negotiations.The most recent trade meetings in Madrid in September yielded a \"basic framework consensus\" on the divestment of Chinese-owned TikTok, ahead of a deadline to either sell off its U.S. business or shut down the social media app in the country.On Sept. 19, Trump and Xi spoke on the phone but did not finalize a deal on TikTok. After the call, Trump announced that he and Xi agreed to meet on the sidelines of the Asia-Pacific Economic Cooperation forum during the last week of October in Gyeongju, South Korea.While China has been silent on future meetings, Trump had also said he would visit China early next year and that Xi would come to the U.S. at a later date.However, Trump on Friday threatened in a social media post to cancel his upcoming meeting with Xi after China's latest tightening of export curbs on rare earths.— CNBC's Anniek Bao and Evelyn Cheng contributed to this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China defends rare earth export curbs as ‘legitimate,’ hits back at U.S. tariffs as Trump-Xi meeting hangs in balance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210930-1760237541506-gettyimages-121393135-65965310.jpeg?v=1760237569&w=1920&h=1080"
      ],
      "datePublished": "2025-10-12T12:44:46.000Z",
      "dateModified": "2025-10-12T12:44:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Global week ahead: Three-speed Europe heads to Washington D.C.",
    "url": "https://www.cnbc.com/2025/10/12/global-week-ahead-three-speed-europe-heads-to-washington-dc.html",
    "image": "https://image.cnbcfm.com/api/v1/image/103667094-greece.png?v=1760096265&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-12T02:17:24.000Z",
    "description": "It's that time of the year when the CNBC International team gets to cross the Atlantic for a full week of coverage from Washington, D.C.While we may b",
    "body": "It's that time of the year when the CNBC International team gets to cross the Atlantic for a full week of coverage from Washington, D.C.While we may be on American soil, Europe will take center stage as we speak to central bank governors and finance ministers from across the continent who are attending the International Monetary Fund and World Bank Annual Meetings.Besides the many macro-economic demands, there are some homegrown challenges to confront.So far, the second half of the year has been marked by political and economic divergence in Europe. At a time when the bloc should be united, given a raft of external pressures, nations are preoccupied with domestic issues.TheaDesign | Getty ImagesFrance firstFrance remains a flashpoint. As CNBC's Charlotte Reed reports from Paris, the unprecedented political uncertainty has rattled the French bond market.In Washington, D.C., CNBC's Karen Tso will speak to Banque de France Governor and European Central Bank Board Member Francois Villeroy de Galhau about how the turmoil in the Elysée Palace is affecting monetary policy decisions.Last week, he told RTL Radio, \"we're all fed up with this political mess\", warning it's eroding business and consumer sentiment, and could shave up to 0.2% off economic growth.Making the Merz of itGermany, by contrast, is on firmer footing. Goldman Sachs forecasts the economy will outperform in 2026 as Chancellor Friedrich Merz's government prioritizes fiscal \"speed and execution.\"Music to the ears of Bundesbank Chief Joachim Nagel, who will be speaking to CNBC during the IMF/World Bank meeting. However, he has urged caution, warning in a New York Times interview that Europe cannot afford complacency over trade tariffs, Chinese competition or central bank independence.Spain's bull runMeanwhile, the sun continues to shine on the Spanish economy, as the nation receives a double thumbs-up from the ratings agencies, with both Moody's and Fitch joining S&P Global in upgrading its credit rating.This week, CNBC will speak to Finance Minister Carlos Cuerpo, who used strong economic momentum, relative to its European neighbors, to push for reforms to the bloc's financial markets.watch nowEconomic data and earnings this week:Monday: China trade dataTuesday: German inflation data, U.K. unemployment data, Ericsson earningsWednesday: China and French inflation data, ASML earningsThursday: U.K. GDP data, ABB earningsFriday: EU inflation data, AB Volvo earnings",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Global week ahead: Three-speed Europe heads to Washington D.C.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/103667094-greece.png?v=1760096265&w=1920&h=1080"
      ],
      "datePublished": "2025-10-12T02:17:24.000Z",
      "dateModified": "2025-10-12T02:17:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Qatar Air Force facility to be built at USAF base in Idaho, Defense Secretary Hegseth says",
    "url": "https://www.cnbc.com/2025/10/10/us-qatar-air-force-idaho-hegseth-defense.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210598-17601067472025-10-10t141500z_784719524_rc229hapk785_rtrmadp_0_usa-qatar.jpeg?v=1760106767&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-11T04:20:07.000Z",
    "description": "U.S. Defense Secretary Pete Hegseth and Qatar's Deputy Prime Minister and Minister of Defense Sheikh Saoud bin Abdulrahman al-Thani present a signed a",
    "body": "U.S. Defense Secretary Pete Hegseth and Qatar's Deputy Prime Minister and Minister of Defense Sheikh Saoud bin Abdulrahman al-Thani present a signed agreement as they meet at the Pentagon in Washington, D.C., U.S., October 10, 2025. Ken Cedeno | ReutersDefense Secretary Pete Hegseth on Friday announced an agreement to build a Qatari Emiri Air Force facility at a U.S. Air Force Base in Idaho.Hegeth said the facility at the Mountain Home Air Force Base will allow pilots from Qatar's air force to train with American military personnel.The Defense secretary made the announcement at a Pentagon press conference with Qatari Defense Minister Sheikh Saoud bin Abdulrahman Al Thani.Hegseth said the facility will \"host a contingent a Qatari F-15's and pilots to enhance our combined training, increase lethality, interoperability, it's just another example of our partnership.\"Qatar is a key U.S. ally in the Middle East. The Al-Udeid Air Base, whose 10,000 or so service members make it the largest American military installation in the Middle East, is located in Qatar, near the capital of Doha.Laura Loomer, a right-wing activist who has influence with President Donald Trump, blasted the announcement.\"Never thought I'd see Republicans give terror financing Muslims from Qatar a MILITARY BASE on US soil so they can murder Americans,\" Loomer wrote on X.\"I don't think I'll be voting in 2026. I cannot in good conscience make any excuses for the harboring of jihadis. This is where I draw the line,\" Loomer wrote.Trump himself in 2017 said, \"The nation of Qatar, unfortunately, has historically been a funder of terrorism at a very high level.\" That comment came during a dispute between Qatar and other Arab countries, Saudi Arabia, the United Arab Emirates, Egypt and Bahrain, who had blockaded Qatar over claims that it had backed extremist Muslim groups.Qatar has denied financing terrorists.After a backlash among some Trump supporters, such as Loomer, to Friday's announcement, Hegseth posted what he called an \"important clarification\" on X, saying, \"The U.S. military has a long-standing partnership w/ Qatar, including today's announced cooperation w/ F-15QA aircraft.\"\"However, to be clear, Qatar will not have their own base in the United States — nor anything like a base,\" Hegseth wrote. \"We control the existing base, like we do with all partners.\"The Mountain Home Air Force Base currently has a contingent of F-15 fighter jets from Singapore's air force stationed there as part of a training program for that nation's pilots.The Pentagon didn't immediately respond to a request for comment on Hegseth's announcement.The announcement is another sign of the deepening of the relationship between the Trump administration and Qatar.Read more CNBC politics coverageTrump puts extra 100% tariff on China imports, adds export controls on 'critical software'Qatar Air Force facility to be built at USAF base in Idaho, Defense Secretary Hegseth saysTrump nominee Paul Ingrassia reportedly accused of sexual harassmentTrump administration begins layoffs of federal workers amid government shutdownNew York AG James indicted by grand jury after Trump called for chargesTrump threatens 'massive' tariff hike on China over rare earths disputeNobel Peace Prize winner Machado praises Trump after White House criticizes snub'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett saysEpstein bank records sought by top House Democrat from Jamie Dimon, other CEOsTreasury weighs minting $1 coin with Trump's face for U.S. 250th anniversaryGovernment shutdown: Senate funding measures fail again as deadlock continuesIn September, after Israel executed an airstrike on senior leaders of the Hamas terror group in Doha, Trump signed an executive order \"assuring the security of the state of Qatar.\"Earlier this year, the U.S accepted a Boeing 747 jet as a gift from the Qatari royal family. Trump has said he wants that jet, valued at $400 million, converted for use as Air Force One, the presidential aircraft.NBC News has reported that the jet is expected to be handed over to Trump's future presidential library after he leaves the White House in January 2029.A Pentagon spokesperson told CNBC that Hegseth accepted the luxury plane \"in accordance with all federal rules and regulations.\"The gift drew criticism from Democrats and others who said the jet looked like a bribe to Trump.Trump's family business has also been expanding its footprint in the Middle East -- including a golf resort in Doha with Qatar's sovereign wealth fund's real estate arm, as well as a Trump International Hotel & Tower in Dubai, a Trump Tower located in Jeddah, and a hotel that is under construction in Muscat.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Qatar Air Force facility to be built at USAF base in Idaho, Defense Secretary Hegseth says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210598-17601067472025-10-10t141500z_784719524_rc229hapk785_rtrmadp_0_usa-qatar.jpeg?v=1760106767&w=1920&h=1080"
      ],
      "datePublished": "2025-10-11T04:20:07.000Z",
      "dateModified": "2025-10-11T04:20:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Airlines tell passengers to prepare for delays as government shutdown continues",
    "url": "https://www.cnbc.com/2025/10/10/government-shutdown-airlines-passengers-delays.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108208728-1759839195695-gettyimages-2239662825-6m0a0441_ak6jtsxa.jpeg?v=1759949227&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T20:57:46.000Z",
    "description": "The Hollywood Burbank Airport air traffic control tower stands in Burbank, California, on Oct. 6, 2025.Mario Tama | Getty ImagesTravelers should prepa",
    "body": "The Hollywood Burbank Airport air traffic control tower stands in Burbank, California, on Oct. 6, 2025.Mario Tama | Getty ImagesTravelers should prepare for potential flight disruptions this holiday weekend as the government shutdown continues, a group representing the largest U.S. airlines said Friday.Air traffic controller shortages this week delayed flights at some U.S. airports, including in Burbank, California, and Nashville, Tennessee.\"It is safe to fly, but ATC staffing shortages strain the system and cause flights to be spaced out, slowing down everything. In some cases, flights may be delayed or even cancelled,\" said Airlines for America, whose members include Delta Air Lines, United Airlines, American Airlines and others.Bad weather could also snarl travel over the long weekend. The National Weather Service on Friday issued a flood watch for New York, Long Island, and parts of Connecticut and New Jersey from an expected storm.During a federal government shutdown, \"essential\" workers such as air traffic controllers and TSA agents worth without pay, while many other employees are placed on furlough.A more than monthlong shutdown starting in late 2018 ended hours after a shortage of air traffic controllers snarled air travel in the New York area.Absences of air traffic controllers rose this week as the current shutdown stretched into its second week, Bryan Bedford, head of the Federal Aviation Administration, reiterated to staff on Friday.\"Air traffic controllers are still required to report to work and carry out their critical duties. The safety and efficiency of our airspace depend on them,\" he said in a note to employees, which was seen by CNBC.Tuesday will mark the first partial paycheck for air traffic controllers, and Oct. 28 would be the first suspended payday, the National Air Traffic Controllers Association, the controllers' union, said on Friday.The union said it plans to start informational leafleting on Tuesday at New York's LaGuardia Airport about the effects of the shutdown on controllers. Similar events are scheduled at other airports in Washington, D.C., Chicago and Philadelphia. \"Participating air traffic controllers and other aviation safety professionals plan to engage with travelers to explain how the government shutdown introduces unnecessary risk to the National Airspace System (NAS) and is detrimental to efficiency,\" the union said.Delta CEO Ed Bastian earlier this week told CNBC that the carrier has so far not seen \"any impacts at all\" to its operation because of the shutdown. However, he said that could change if it continued for another roughly 10 days.On Friday, close to 3,700 U.S. flights were delayed, according to flight-tracking site FlightAware, below the average daily rate of about 4,100 for U.S. airlines so far this year.Read more CNBC airline newsAir traffic control shortages add to U.S. flight delays, FAA saysSpirit Airlines on track for a $475 million bankruptcy lifeline'Seconds count': Avoiding airplane collisions at airports could come down to cockpit alertsU.S. startup airline Breeze Airways plans first international flights",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Airlines tell passengers to prepare for delays as government shutdown continues",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108208728-1759839195695-gettyimages-2239662825-6m0a0441_ak6jtsxa.jpeg?v=1759949227&w=1920&h=1080"
      ],
      "datePublished": "2025-10-10T20:57:46.000Z",
      "dateModified": "2025-10-10T20:57:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Market sell-off: Trump post lops off $2 trillion from stocks in a single day",
    "url": "https://www.cnbc.com/2025/10/11/trump-post-costs-stocks-2-trillion-in-single-day.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210870-17601331522025-10-10t214814z_634557862_rc299hapl1m3_rtrmadp_0_usa-trump.jpeg?v=1760133181&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-11T13:32:09.000Z",
    "description": "U.S. President Donald Trump looks on during an announcement about lowering U.S. drug prices, at the White House in Washington, D.C., U.S., Oct. 10, 20",
    "body": "U.S. President Donald Trump looks on during an announcement about lowering U.S. drug prices, at the White House in Washington, D.C., U.S., Oct. 10, 2025. Kent Nishimura | ReutersOn Friday morning, the S&P 500 was less than a couple of points from another all-time high. Then, after a single social media post from President Donald Trump, $2 trillion in market value was wiped out.The unraveling shows the sway the president's one-man trade policy still has over the fate of the global economy.Trump at 10:57 a.m. ET wrote on his Truth Social platform that China was \"becoming very hostile\" with the rest of the world, especially when it comes to its control of rare earth metals. He accused China of holding the world \"captive\" because of its \"monopoly\" on these crucial resources. The key part that the stock market reacted to in the 500-word Trump post was this: \"One of the policies that we are calculating at this moment is a massive increase of tariffs on Chinese products coming into the United States of America.\"That's all it took.Bespoke Investment Group calculates that about $2 trillion in value from the U.S. stock market was erased by that single post. The S&P 500 lost 2.7% as the closing bell rang out at the New York Stock Exchange. It was its worst performance since early April, when the stock market was in the throes of a cascading sell-off from Trump's so-called liberation day rollout of higher-than-expected duties for every country on the globe.Stock Chart IconStock chart iconS&P 500, 1-dayThe Nasdaq Composite, home to the technology companies that rely on trade with China, sank 3.56%, also its worst performance since April. The Nasdaq touched an all-time high before the Trump post in Friday's session.The Dow Jones Industrial Average dropped 879 points, or 1.9% for its worst performance since May. The Russell 2000 small-cap benchmark shed 3%.Why such a violent drop?While the Trump administration's trade talks with China have been progressing at a much slower pace than those with other countries, the stock market consensus was that something would eventually be worked out between the two nations and that overall relations were improving. Trump and the Chinese leader Xi Jinping were set to meet at the Asia-Pacific Economic Cooperation (APEC) summit at the end of this month.The market had also become comfortable with the around 40% tariff rate already applied to China, reasoning that the U.S. economy was stronger than previously thought to withstand it, and exemptions for products made in China — like Apple's iPhones — were broad enough to soften any economic impact.A trader works at the New York Stock Exchange on Oct. 10, 2025. NYSEIf Trump follows through with his latest threat, investors fear that the load may be too great to bear for the U.S. economy, which is still reliant on imported parts to build automobiles, solar panels, and the like.Perhaps the greater risk that weighs on the market is retaliation from China on U.S. goods that could lead to an all-out trade war.What sparked Trump's threat?China, overnight into Thursday, tightened its grip further on the rare earths market, of which it controls about 70% of the global supply. Beijing said outside entities must obtain licenses to export pretty much anything using its rare earths and that companies using the metals for military applications would be denied. The companies' usage would be reviewed on a case-by-case basis by China.A trader works at the New York Stock Exchange on Oct. 10, 2025. NYSERare earths are crucial for making semiconductors, electric vehicles and materials for advanced missiles. Trump has been trying to bolster the U.S. supplies of the metal by supporting, and even investing in, U.S. and Canada-based companies that mine for the metal.What led Friday's sell-off?Chipmakers such as Nvidia and AMD led the stock market drop Friday. Nvidia, which is still trying to gain support from the two countries to sell a less-advanced AI chip to China, lost 5%. AMD, which had been leading the latest leg of the rally, sank nearly 8%. Apple lost 3%, while Tesla shed 5%.Stock Chart IconStock chart iconNvidia, 1-dayBut it wasn't just shares of companies directly related to China trade that declined. It was a broad market sell-off, with 424 of the S&P 500 members closing in the red. Pro investors were forced to reduce risk in everything due to a sudden drop of this magnitude. With their tech positions getting hit, other holdings needed to be sold to raise cash. Plus, there's the threat the potential new tariffs pose to the U.S. economy. Domestic financials Bank of America and Wells Fargo lost more than 2% each, for example.A few stocks did manage to stay green on the day. Walmart and the tobacco/nicotine stocks were slightly higher because of their defensive properties.How long will this sell-off last?Monday could be another rough day for the markets because Trump followed up his morning post after the closing bell by saying he would impose 100% tariffs on China \"over and above any tariff that they are currently paying.\" Trump added that the U.S. would put export controls on \"any and all critical software,\" which could significantly impact AI leaders like Nvidia. The new duties would begin at the start of next month, around the time of the summit when Trump was set to meet with Xi. Trump's Friday morning post suggested those talks may not happen now.The SPDR S&P 500 ETF Trust, a fund that tracks the S&P 500, added a bit to Friday's session losses after the bell.Still, some traders and investors believe it may be wise to wait and see if Trump follows through fully on this threat. Most of the stiff tariffs threatened in early April — which sent global markets reeling — were subsequently pared back significantly through negotiations and exemptions, laying the groundwork for a monster comeback rally to new highs for the market. It paid then to call Trump on his bluff and buy the dip — and many investors think it will again.\"The good news is that this may just be another negotiating tactic used by the administration that could yield good results over the long term,\" said Jay Woods, chief market strategist at Freedom Capital Markets, during the height of the selling pressure at the NYSE. \"The knee-jerk sell-off should be another buying opportunity.\"It's worth having some perspective on Friday's sell-off as well. The drop only took the S&P 500 back to its lowest level in a month. The benchmark is still up more than 11% for the year, with a seemingly unstoppable AI trade overshadowing any threat from tariffs, global conflicts and an ongoing government shutdown.Stock Chart IconStock chart iconS&P 500, YTDThe move disrupted an unusually placid period for the stock market, jarring complacent investors into running for cover for the first time in a long while and adding to the pain. Thursday was the 33rd straight day without a 1% S&P 500 move in either direction, the longest calm streak since January 2020. The market hasn't had a major decline since the April tariff rollout correction.One risk is that this sell-off breaks other things on Wall Street. There's a small, but still growing contagion related to the bankruptcy of private auto parts supplier First Brands. It's roiling banks with exposure like Jefferies Financial Group and raising concerns about the once-booming private credit industry. Jefferies was down 4% on Friday and another 6% in after-hours trading.That's an area to watch, along with the possibility that large hedge funds buying on margin were caught too-long on Friday and now have to aggressively deleverage, which could add to selling pressures next week. The crypto markets, especially the smaller coins outside of bitcoin, were hit especially hard on Friday. The TRUMP meme coin is down 20% in the last 24 hours.Stock market futures open for trading Sunday evening at 6 p.m. ET. The bond market is closed Monday for Columbus Day.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Market sell-off: Trump post lops off $2 trillion from stocks in a single day",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210870-17601331522025-10-10t214814z_634557862_rc299hapl1m3_rtrmadp_0_usa-trump.jpeg?v=1760133181&w=1920&h=1080"
      ],
      "datePublished": "2025-10-11T13:32:09.000Z",
      "dateModified": "2025-10-11T13:32:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Govini, a defense tech startup taking on Palantir, hits $100 million in annual recurring revenue",
    "url": "https://www.cnbc.com/2025/10/10/defense-tech-govini-palantir-revenue.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108128052-1744079576004-gettyimages-1317950512-_r0a0224.jpeg?v=1760117396&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T21:16:32.000Z",
    "description": "watch nowGovini, a defense tech software startup taking on the likes of Palantir, has blown past $100 million in annual recurring revenue, the company",
    "body": "watch nowGovini, a defense tech software startup taking on the likes of Palantir, has blown past $100 million in annual recurring revenue, the company announced Friday.\"We're growing faster than 100% in a three-year CAGR, and I expect that next year we'll continue to do the same,\" CEO Tara Murphy Dougherty told CNBC's Morgan Brennan in an interview. With how \"big this market is, we can keep growing for a long, long time, and that's really exciting.\"CAGR stands for compound annual growth rate, a measurement of the rate of return.The Arlington, Virginia-based company also announced a $150 million growth investment from Bain Capital. It plans to use the money to expand its team and product offering to satisfy growing security demands.In recent years, venture capitalists have poured more money into defense tech startups like Govini to satisfy heightened national security concerns and modernize the military as global conflict ensues.The group, which includes unicorns like Palmer Luckey's Anduril, Shield AI and artificial intelligence beneficiary Palantir, is taking on legacy giants such as Boeing, Lockheed Martin and Northrop Grumman, that have long leaned on contracts from the Pentagon.Read more CNBC tech newsSingapore police probe Nvidia customer Megaspeed over alleged China export violationsTesla faces U.S. auto safety probe after reports FSD ran red lights, caused collisionsTop Hollywood agencies slam OpenAI's Sora as 'exploitation' and a risk to clientsGoogle launches Gemini subscriptions to help corporate workers build AI agentsDougherty, who previously worked at Palantir, said she hopes the company can seize a \"vertical slice\" of the defense technology space.The 14-year-old Govini has already secured a string of big wins in recent years, including an over $900-million U.S. government contract and deals with the Department of War.Govini is known for its flagship AI software Ark, which it says can help modernize the military's defense tech supply chain by better managing product lifecycles as military needs grow more sophisticated.\"If the United States can get this acquisition system right, it can actually be a decisive advantage for us,\" Dougherty said.Looking ahead, Dougherty told CNBC that she anticipates some setbacks from the government shutdown.Navy customers could be particularly hard hit, and that could put the U.S. at a major disadvantage.While the U.S. is maintaining its AI dominance, China is outpacing its shipbuilding capacity and that needs to be taken \"very seriously,\" she added.Dougherty also noted China's dominance in rare earths and processed minerals that are critical to making parts and systems for the military. \"The rare earth crisis that we're in is a serious one,\" she said, \"because one of the things that you can see in the data that we have in our proprietary data set tracks national security programs down to the raw materials.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Govini, a defense tech startup taking on Palantir, hits $100 million in annual recurring revenue",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108128052-1744079576004-gettyimages-1317950512-_r0a0224.jpeg?v=1760117396&w=1920&h=1080"
      ],
      "datePublished": "2025-10-10T21:16:32.000Z",
      "dateModified": "2025-10-10T21:16:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "We tested OpenAI’s Sora 2 video generator to find out why Hollywood is freaking out",
    "url": "https://www.cnbc.com/2025/10/10/how-sora-2-by-openai-is-challenging-hollywood.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210376-OpenAI_Hollywood_C_Clean.jpg?v=1760071837&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T18:11:35.000Z",
    "description": "The launch of OpenAI's updated Sora 2 AI video service kicked off another round of anxiety among musicians, actors and other content creators.Sora all",
    "body": "The launch of OpenAI's updated Sora 2 AI video service kicked off another round of anxiety among musicians, actors and other content creators.Sora allows users to generate short videos for free by typing in a prompt. The app is only available on iOS devices and is limited to invitees, meaning people need a code to access it. Still, Sora has climbed to the No. 1 spot in Apple's App Store, and OpenAI said this week it hit 1 million downloads in less than five days after launch.Major Hollywood groups like the Motion Picture Association have objected to OpenAI's copyright policies, and top Hollywood agencies are calling it \"exploitation.\" That's led to changes in how the model handles prompts for certain sensitive categories of generated content. CNBC's Julia Boorstin got access to Sora 2 and tried prompts like \"show me a video of a fat orange cartoon cat eating lasagna\" and \"create a superhero that wears a black cape and is saving a woman from a burning building.\" Some of the prompts failed due to copyright infringement, while others worked. Watch the video to see what happens when we put Sora 2 to the test.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We tested OpenAI’s Sora 2 video generator to find out why Hollywood is freaking out",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210376-OpenAI_Hollywood_C_Clean.jpg?v=1760071837&w=1920&h=1080"
      ],
      "datePublished": "2025-10-10T18:11:35.000Z",
      "dateModified": "2025-10-10T18:11:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says 'a lot' of federal workers are being laid off during government shutdown",
    "url": "https://www.cnbc.com/2025/10/10/trump-russ-vought-layoffs-government-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207436-1759492228982-gettyimages-2226037132-US_FED_WHITE_HOUSE.jpeg?v=1759492260&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-11T04:27:26.000Z",
    "description": "Russell Vought, director of the Office of Management and Budget (OMB), speaks to members of the media outside the White House in Washington, DC, US, o",
    "body": "Russell Vought, director of the Office of Management and Budget (OMB), speaks to members of the media outside the White House in Washington, DC, US, on Thursday, July 24, 2025. Aaron Schwartz | Bloomberg | Getty ImagesThe Trump administration began laying off thousands of federal workers across a range of agencies on Friday, the 10th day of the U.S. government shutdown.President Donald Trump on Friday afternoon told reporters in the Oval Office that the number of federal workers who will be laid off will \"be a lot.\"\"It'll be Democrat-oriented,\" Trump said, reiterating his promise to target programs he believes are favored by Democratic officials.The permanent job cuts, formally known as \"Reductions in Force,\" are different from the furloughing of government workers. Furloughed employees return to their jobs after a government shutdown ends.The layoffs were first announced by Russell Vought, the director of the Office of Management and Budget.\"The RIFs have begun,\" Vought wrote on X.OMB soon after confirmed his tweet, and said the cuts \"are substantial.\"RIF notices went to workers at the departments of Treasury, Health and Human Services, Commerce, Education, Energy, EPA, Homeland Security, Housing and Urban Development, and Interior. A filing by the Justice Department in U.S. District Court in San Francisco late Friday showed at least 4,000 federal workers received layoff notices, with Treasury and HHS seeing the largest cuts, of more than 1,100 employees apiece.The filing came in response to a lawsuit filed on Sept. 30 by two unions that represent many federal workers, the American Federation of Government Employees and the American Federation of County, State & Municipal Employees.The lawsuit challenges the legality of the RIFs, which at the time the suit was filed were threatened by the Trump administration. A hearing on the unions' request for a temporary restraining order to block the layoffs is scheduled for Wednesday in San Francisco.\"These mass firings are illegal and will have devastating effects on the services millions of Americans rely on every day,\" AFSCME President Lee Saunders said in a statement.\"Whether it's food inspectors, public safety workers, or the countless other public service workers who keep America running, federal employees should not be bargaining chips in this administration's political games,\" Saunders said.The layoffs started four days after National Economic Council Director Kevin Hassett warned in a CNBC interview that could \"start taking sharp measures\" if the shutdown continued due to the lack of a stopgap funding deal approved by Congress.Hassett said that \"any government worker who loses their job\" will have Democrats to blame for their layoff.watch nowWhile many federal workers have been furloughed because of the shutdown, it is not the normal practice in shutdowns to permanently lay off government employees.Senate Minority Leader Chuck Schumer, a New York Democrat, said, \"Russell Vought just fired thousands of Americans with a tweet. \"Let's be blunt: nobody's forcing Trump and Vought to do this,\" Schumer said in a statement. \"They don't have to do it; they want to. They're callously choosing to hurt people — the workers who protect our country, inspect our food, respond when disasters strike. This is deliberate chaos.\" \"Here's what's worse: Republicans would rather see thousands of Americans lose their jobs than sit down and negotiate with Democrats to reopen the government,\" Schumer said.Sen. Susan Collins, a Maine Republican who chairs the Senate Appropriations Committee, in a statement said, \"I strongly oppose OMB Director Russ Vought's attempt to permanently lay off federal workers who have been furloughed due to a completely unnecessary government shutdown caused by Senator Schumer.\"\"Regardless of whether federal employees have been working without pay or have been furloughed, their work is incredibly important to serving the public,\" Collins said. \"Arbitrary layoffs result in a lack of sufficient personnel needed to conduct the mission of the agency and to deliver essential programs, and cause harm to families in Maine and throughout our country.\"Since the shutdown began last week, Vought has announced in tweets decisions by the Trump administration to freeze and cut billions of dollars in federal funding for projects in states and cities controlled by Democratic elected officials.The Trump administration and Republicans in Congress have repeatedly sought to blame Democrats for the government shutdown and any negative fallout from it.Democratic senators have largely refused to vote for a Republican stopgap funding plan that would reopen the government, saying that any such resolution must include an agreement to extend enhanced Affordable Care Act tax credits.Those tax credits lower the cost of Obamacare health insurance plans purchased by millions of Americans from government-run ACA marketplaces.Dueling Republican and Democratic funding resolutions failed to pass in the Senate for the seventh time on Thursday.The shutdown is expected to continue until at least early next week because the Senate is not due to resume business until Tuesday.Although Republicans hold majorities in both the Senate and House, they need the votes of at least some Democratic senators to pass a funding bill because of the 60-vote threshold in the Senate required to avoid filibusters blocking legislation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says 'a lot' of federal workers are being laid off during government shutdown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108207436-1759492228982-gettyimages-2226037132-US_FED_WHITE_HOUSE.jpeg?v=1759492260&w=1920&h=1080"
      ],
      "datePublished": "2025-10-11T04:27:26.000Z",
      "dateModified": "2025-10-11T04:27:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Activist Irenic takes a stake in Atkore, urges company to consider a sale",
    "url": "https://www.cnbc.com/2025/10/11/activist-irenic-takes-a-stake-in-atkore-urges-company-to-consider-a-sale.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210131-1760029991604-gettyimages-2219076826-TFSPI_11062025-8118.jpeg?v=1760030031&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-11T13:09:33.000Z",
    "description": "Thomas Fuller | SOPA Images | Lightrocket | Getty ImagesCompany: Atkore (ATKR)Business: Atkore is a manufacturer of electrical products for constructi",
    "body": "Thomas Fuller | SOPA Images | Lightrocket | Getty ImagesCompany: Atkore (ATKR)Business: Atkore is a manufacturer of electrical products for construction and renovation markets, and safety and infrastructure products for the construction and industrial markets. The company's segments include electrical and safety & infrastructure. The electrical segment manufactures products used in the construction of electrical power systems including conduit, cable and installation accessories. This segment serves contractors in partnership with the electrical wholesale channel. The safety & infrastructure segment designs and manufactures solutions including metal framing, mechanical pipe, perimeter security and cable management for the protection and reliability of critical infrastructure. These solutions are marketed to contractors, OEMs, and end-users. It manufactures products in 42 facilities and operates a total footprint of over 8.5 million square feet of manufacturing and distribution space in eight countries.Stock Market Value: $2.09 billion ($61.97 per share)Activist: Irenic Capital ManagementOwnership: 2.5%Average Cost: n/aActivist Commentary: Irenic Capital was founded in October 2021 by Adam Katz, a former portfolio manager at Elliott Investment Management, and Andy Dodge, a former investment partner at Indaba Capital Management. Irenic invests in public companies and works collaboratively with firm leadership. Their activism has thus far focused on strategic activism, recommending spinoffs and sales of businesses.What's happeningOn Sept. 30, Irenic announced that they have taken a 2.5% position in Atkore and are urging the company to pursue a potential sales process.Behind the scenesAtkore is a manufacturer of electrical products for construction and renovation markets, and safety and infrastructure products for the construction and industrial markets. Its electrical segment produces conduit, cable, and installation accessories for electrical power systems. The safety & infrastructure segment manufactures solutions including metal framing, mechanical pipe, perimeter security, and cable management systems. For years Atkore operated as part of a stable oligopoly — Hubbell, Eaton and nVent being among the other major domestic players.The pandemic catalyzed a surge in construction and, in turn, the demand for Atkore's electrical products that are essential in the wiring processes. As a result, the company got aggressive in pricing and, from fiscal year 2019 to 2022, revenue grew from $1.9 billion to $3.9 billion, and EBITDA grew alongside from $300 million to $1.3 billion. However, as we have seen with many companies, demand ultimately normalized after Covid and revenue stopped growing. To make matters worse, Atkore's aggressive pricing strategy backfired, as it invited import competition into a market that had long been protected by high freight costs and distributor preference for local supply. By raising prices too sharply, they effectively undermined their own market position. As a result, revenue has declined to $2.9 billion and EBITDA to $462 million.Moreover, despite a $1 billion decrease in revenue, SG&A has increased, and the company's headcount has risen over 40%. On top of this is a misallocation of capital. Instead of using Covid-era windfalls to invest into the core electric business, management has pursued non-core ventures such as water infrastructure and fiber conduit for rural broadband, many of which projects never materialized. Now, a company that once traded at the top of the market around $190 per share in early 2024, has fallen all the way down to around $60 per share; and amid this underperformance, in late August, CEO Bill Waltz unexpectedly announced his retirement without a successor in place.This has all prompted Irenic Capital Management to announce a 2.5% position in Atkore. With no CEO, operational and capital challenges, and a poor market perception, Atkore is now at a critical inflection point where the board will have the biggest decision it will ever make that will determine the outcome for shareholders.The most important thing a board does is identify and retain a CEO and Atkore is now at that point. However, when a company faces similar issues to Atkore and is on the precipice of a serious restructuring, the board needs to make one more decision before hiring a new CEO – whether the company should remain independent or not. We would expect that Irenic would want one or two new directors identified by them on the board to take part in this analysis and decision, likely independent directors with relevant experience.Atkore currently trades at approximately 6.5x EBITDA but offers clear cost cutting and divesture opportunities that private equity may be able to more effectively execute. Thus, it is fair to assume a takeout at multiple turns above the company's current valuation, potentially 8 to 10 times EBITDA. If a review of strategic alternatives concludes that an acquisition would happen in that range, then the board would need to use that as the benchmark against a standalone plan.The first step in a standalone plan would be identifying the right CEO who would be tasked with realigning the company's operational and capital focus with its core electrical business, divesting non-core assets, cutting costs, and implementing pricing discipline. As Rocco says to Michael Corleone, this would be difficult, but not impossible. There is definitely at least $100 million of costs that could be cut from SG&A and the headwinds that caused the decline in revenue have now reversed, with pricing low enough to once again discourage importers even before the issuance of tariffs, which is a tailwind for Atkore.But it is worth repeating that none of this is possible without the right CEO and it is important to have the best possible board to make that decision, and this board has given shareholders the right to be worried. Currently, both the company's chairman and former CEO come from water industry backgrounds, likely contributing to the strategic shift away from the company's core.Moreover, Atkore recently announced a strategic review focused on non-core asset sales, including its water conduit business. While this might be the right decision, launching a strategic review without a permanent CEO seems rushed and poorly timed, and conducting such a review at this time without weighing the possibility of a full sale is even more perplexing. A refreshed board with directors who bring in relevant electrical industry expertise that can guide the CEO succession process, and the sale analysis would be an essential first step.Irenic has significant experience in strategic activism, identifying companies that are struggling in the public markets and helping implement spinoffs and sales of businesses. The nomination window for directors opened on Oct. 2 and we do not think it is a coincidence that Irenic went public with their campaign the day prior to the nomination window opening. We expect that they will be talking to the company about board composition. Ideally, shareholders would benefit most with the addition of a couple of new independent directors with relevant experience and having Irenic as an active shareholder to support the board in its analysis.Ken Squire is the founder and president of 13D Monitor, an institutional research service on shareholder activism, and the founder and portfolio manager of the 13D Activist Fund, a mutual fund that invests in a portfolio of activist investments.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Activist Irenic takes a stake in Atkore, urges company to consider a sale",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210131-1760029991604-gettyimages-2219076826-TFSPI_11062025-8118.jpeg?v=1760030031&w=1920&h=1080"
      ],
      "datePublished": "2025-10-11T13:09:33.000Z",
      "dateModified": "2025-10-11T13:09:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]