[
  {
    "title": "Trump puts extra 100% tariff on China imports, adds export controls on 'critical software'",
    "url": "https://www.cnbc.com/2025/10/10/trump-trade-tariffs-china-software.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108208535-1759788270410-gettyimages-2239631205-imgl9887_ddrca3ok.jpeg?v=1759788310&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T22:11:52.000Z",
    "description": "U.S. President Donald Trump points a finger as he speaks during a roundtable on \"Antifa,\" an anti-fascist movement he designated a domestic \"terrorist organization\" via executive order on September 22, at the...",
    "body": "U.S. President Donald Trump points a finger as he speaks during a roundtable on \"Antifa,\" an anti-fascist movement he designated a domestic \"terrorist organization\" via executive order on September 22, at the White House in Washington, D.C., U.S., Oct. 8, 2025.Evelyn Hockstein | ReutersPresident Donald Trump on Friday said the United States would impose new tariffs of 100% on imports from China \"over and above any Tariff that they are currently paying,\" starting on Nov. 1.Trump also said that the U.S., on that same date, would also impose export controls on \"any and all critical software.\"The president's announcement came hours after he threatened to slap \"a massive increase\" of tariffs on Chinese imports in retaliation for new controls that China imposed on exports of rare earths minerals from that nation.Around 70% of the global supply of rare earths minerals comes from China. The minerals are essential for high-tech industries, including automobiles, defense and semiconductors.Trump suggested earlier Friday that he would cancel a meeting with Chinese President Xi Jinping at the upcoming Asia-Pacific Economic Cooperation summit in South Korea because of China's new controls.Nearly every product imported into the U.S. from China already faces steep tariffs. While there are different levels of specific duties on imports, ranging from 50% on steel and aluminum, to 7.5% on consumer goods, the so-called effective tariff rate on Chinese imports currently is 40%, according to Wells Fargo Economics and analysts at the Federal Reserve Bank of New York.\"It has just been learned that China has taken an extraordinarily aggressive position on Trade in sending an extremely hostile letter to the World, stating that they were going to, effective November 1st, 2025, impose large scale Export Controls on virtually every product they make, and some not even made by them,\" Trump wrote in a Truth Social post on Friday.Read more CNBC politics coverageTrump puts extra 100% tariff on China imports, adds export controls on 'critical software'Qatar Air Force facility to be built at USAF base in Idaho, Defense Secretary Hegseth saysTrump nominee Paul Ingrassia reportedly accused of sexual harassmentTrump administration begins layoffs of federal workers amid government shutdownNew York AG James indicted by grand jury after Trump called for chargesTrump threatens 'massive' tariff hike on China over rare earths disputeNobel Peace Prize winner Machado praises Trump after White House criticizes snub'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett saysEpstein bank records sought by top House Democrat from Jamie Dimon, other CEOsTreasury weighs minting $1 coin with Trump's face for U.S. 250th anniversaryGovernment shutdown: Senate funding measures fail again as deadlock continues\"This affects ALL Countries, without exception, and was obviously a plan devised by them years ago. It is absolutely unheard of in International Trade, and a moral disgrace in dealing with other Nations,\" Trump wrote.\"Based on the fact that China has taken this unprecedented position, and speaking only for the U.S.A., and not other Nations who were similarly threatened, starting November 1st, 2025 (or sooner, depending on any further actions or changes taken by China), the United States of America will impose a Tariff of 100% on China, over and above any Tariff that they are currently paying,\" he wrote.\"Also on November 1st, we will impose Export Controls on any and all critical software.\"China's Ministry of Commerce on Thursday said that starting Dec. 1 foreign entities must have a license to export products that contain more than 0.1% of rare earths sourced from that country, or that are manufactured using Chinese extraction, refining, magnet-making or recycling technology."
  },
  {
    "title": "Qatar Air Force facility to be built at USAF base in Idaho, Defense Secretary Hegseth says",
    "url": "https://www.cnbc.com/2025/10/10/us-qatar-air-force-idaho-hegseth-defense.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210598-17601067472025-10-10t141500z_784719524_rc229hapk785_rtrmadp_0_usa-qatar.jpeg?v=1760106767&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-11T04:20:07.000Z",
    "description": "U.S. Defense Secretary Pete Hegseth and Qatar's Deputy Prime Minister and Minister of Defense Sheikh Saoud bin Abdulrahman al-Thani present a signed agreement as they meet at the Pentagon in Washington, D.C.,...",
    "body": "U.S. Defense Secretary Pete Hegseth and Qatar's Deputy Prime Minister and Minister of Defense Sheikh Saoud bin Abdulrahman al-Thani present a signed agreement as they meet at the Pentagon in Washington, D.C., U.S., October 10, 2025. Ken Cedeno | ReutersDefense Secretary Pete Hegseth on Friday announced an agreement to build a Qatari Emiri Air Force facility at a U.S. Air Force Base in Idaho.Hegeth said the facility at the Mountain Home Air Force Base will allow pilots from Qatar's air force to train with American military personnel.The Defense secretary made the announcement at a Pentagon press conference with Qatari Defense Minister Sheikh Saoud bin Abdulrahman Al Thani.Hegseth said the facility will \"host a contingent a Qatari F-15's and pilots to enhance our combined training, increase lethality, interoperability, it's just another example of our partnership.\"Qatar is a key U.S. ally in the Middle East. The Al-Udeid Air Base, whose 10,000 or so service members make it the largest American military installation in the Middle East, is located in Qatar, near the capital of Doha.Laura Loomer, a right-wing activist who has influence with President Donald Trump, blasted the announcement.\"Never thought I'd see Republicans give terror financing Muslims from Qatar a MILITARY BASE on US soil so they can murder Americans,\" Loomer wrote on X.\"I don't think I'll be voting in 2026. I cannot in good conscience make any excuses for the harboring of jihadis. This is where I draw the line,\" Loomer wrote.Trump himself in 2017 said, \"The nation of Qatar, unfortunately, has historically been a funder of terrorism at a very high level.\" That comment came during a dispute between Qatar and other Arab countries, Saudi Arabia, the United Arab Emirates, Egypt and Bahrain, who had blockaded Qatar over claims that it had backed extremist Muslim groups.Qatar has denied financing terrorists.After a backlash among some Trump supporters, such as Loomer, to Friday's announcement, Hegseth posted what he called an \"important clarification\" on X, saying, \"The U.S. military has a long-standing partnership w/ Qatar, including today's announced cooperation w/ F-15QA aircraft.\"\"However, to be clear, Qatar will not have their own base in the United States — nor anything like a base,\" Hegseth wrote. \"We control the existing base, like we do with all partners.\"The Mountain Home Air Force Base currently has a contingent of F-15 fighter jets from Singapore's air force stationed there as part of a training program for that nation's pilots.The Pentagon didn't immediately respond to a request for comment on Hegseth's announcement.The announcement is another sign of the deepening of the relationship between the Trump administration and Qatar.Read more CNBC politics coverageTrump puts extra 100% tariff on China imports, adds export controls on 'critical software'Qatar Air Force facility to be built at USAF base in Idaho, Defense Secretary Hegseth saysTrump nominee Paul Ingrassia reportedly accused of sexual harassmentTrump administration begins layoffs of federal workers amid government shutdownNew York AG James indicted by grand jury after Trump called for chargesTrump threatens 'massive' tariff hike on China over rare earths disputeNobel Peace Prize winner Machado praises Trump after White House criticizes snub'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett saysEpstein bank records sought by top House Democrat from Jamie Dimon, other CEOsTreasury weighs minting $1 coin with Trump's face for U.S. 250th anniversaryGovernment shutdown: Senate funding measures fail again as deadlock continuesIn September, after Israel executed an airstrike on senior leaders of the Hamas terror group in Doha, Trump signed an executive order \"assuring the security of the state of Qatar.\"Earlier this year, the U.S accepted a Boeing 747 jet as a gift from the Qatari royal family. Trump has said he wants that jet, valued at $400 million, converted for use as Air Force One, the presidential aircraft.NBC News has reported that the jet is expected to be handed over to Trump's future presidential library after he leaves the White House in January 2029.A Pentagon spokesperson told CNBC that Hegseth accepted the luxury plane \"in accordance with all federal rules and regulations.\"The gift drew criticism from Democrats and others who said the jet looked like a bribe to Trump.Trump's family business has also been expanding its footprint in the Middle East -- including a golf resort in Doha with Qatar's sovereign wealth fund's real estate arm, as well as a Trump International Hotel & Tower in Dubai, a Trump Tower located in Jeddah, and a hotel that is under construction in Muscat."
  },
  {
    "title": "Chinese stocks slide as Trump threatens tariffs, accuses Beijing of holding world ‘captive’",
    "url": "https://www.cnbc.com/2025/10/10/chinese-stocks-slide-as-trump-threatens-tariffs-accuses-beijing-of-holding-world-captive.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108184635-1754997432684-gettyimages-2229683352-img_3022.jpeg?v=1760113597&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T19:56:13.000Z",
    "description": "Cheng Xin | Getty ImagesChinese stocks trading in the U.S. tumbled Friday after former President Donald Trump threatened to sharply raise tariffs on Chinese imports if he returns to office, warning that China...",
    "body": "Cheng Xin | Getty ImagesChinese stocks trading in the U.S. tumbled Friday after former President Donald Trump threatened to sharply raise tariffs on Chinese imports if he returns to office, warning that China has become \"very hostile.\"Alibaba and Baidu each slid about 8%, while JD.com and PDD Holdings fell 6.6% and 5.2%, respectively. The iShares MSCI China ETF (MCHI), which tracks major Chinese companies listed in the U.S., dropped 5.2%.Stock Chart IconStock chart iconiShares MSCI China ETF FridayThe selloff underscored renewed investor anxiety over escalating U.S.-China tensions, which have flared periodically amid disputes over trade, technology and national security.Trump accused China of holding the world \"captive\" through its dominance in rare earth metals. Earlier this week, Beijing tightened its grip on the sector, requiring foreign companies to obtain government licenses to export any products containing rare earth elements that make up 0.1% or more of their total value.\"Friday served as a reminder of how emotion and uncertainty can drive markets,\" said Mark Hackett, chief market strategist at Nationwide.\" \"It is too early to say with confidence if the comments will trigger the next phase of the trade conflict between the US and China or more negotiating in public, but investors have chosen a wait-and-see tactic.\"Chinese stocks have staged a strong rebound this year, buoyed by signs of economic stabilization and renewed investor optimism after years of underperformance. The iShares MSCI China ETF is still up 32% even after Friday's pullback.— CNBC's Sarah Min contributed reporting."
  },
  {
    "title": "CPI inflation report will be released by Labor Department, while other data is delayed by shutdown",
    "url": "https://www.cnbc.com/2025/10/10/cpi-inflation-data-government-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108196858-1757515078328-gettyimages-2233831123-AA_09092025_2411982.jpeg?v=1759229945&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T17:53:59.000Z",
    "description": "A large US flag is seen on the facade of the Department of Labor headquarters building in Washington DC, United States on September 8, 2025. Celal Gunes | Anadolu | Getty ImagesThe Labor Department will bring...",
    "body": "A large US flag is seen on the facade of the Department of Labor headquarters building in Washington DC, United States on September 8, 2025. Celal Gunes | Anadolu | Getty ImagesThe Labor Department will bring back staff to work on a key consumer inflation report despite the ongoing federal government shutdown, CNBC has learned.The department's Bureau of Labor Statistics will \"promptly resume\" work on September's consumer price index data, a White House official said. The report will come out at 8:30 a.m. ET on Oct. 24, nine days after it was originally scheduled, according to the BLS.The department had originally paused work on the CPI report – which tracks a broad basket of goods and services for price changes over time — because of its shutdown plan, the official said. But the Social Security Administration needs third-quarter CPI data for calculating and publishing annual cost-of-living adjustments before Nov. 1.Other BLS data releases including the nonfarm payroll report haven't been published as originally intended since the federal government shutdown due to a lapse in funding. The Senate on Thursday failed to pass funding bills for the seventh time that would have ended the closure, which began last week.Bloomberg News first reported that the BLS was calling employees back to work on the CPI data.— CNBC's Steve Liesman contributed to this report.Correction: The Social Security Administration needs third-quarter CPI data for calculating and publishing annual cost-of-living adjustments before Nov. 1. An earlier version misstated the organization's name."
  },
  {
    "title": "Applied Digital stock climbs 16% as AI demand fuels data center growth",
    "url": "https://www.cnbc.com/2025/10/10/applied-digital-stock-ai-data-center-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210756-1760119642025-gettyimages-2147797953-PGONCHAR_5058.jpeg?v=1760119665&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T20:32:05.000Z",
    "description": "Sopa Images | Lightrocket | Getty ImagesApplied Digital shares jumped as much as 30% on Friday after the company posted strong first-quarter revenue that was boosted by artificial intelligence data center...",
    "body": "Sopa Images | Lightrocket | Getty ImagesApplied Digital shares jumped as much as 30% on Friday after the company posted strong first-quarter revenue that was boosted by artificial intelligence data center demand, putting the stock up more than 350% for the year.The company closed up 16%, extending its impressive run this year. Shares are up 344% so far.Here's how the company did compared to LSEG estimates:Loss per share: Loss of 7 cents vs. a loss of 13 cents expectedRevenue: $64.2 million vs. $50 million expectedFirst quarter revenue of $64.2 million was up 84% from a year ago, when it reported $34.85 million in revenue.The data center company reported earnings after the bell on Thursday.During the quarter, Applied Digital built on its $7 billion lease agreement with CoreWeave that was announced in June for another 150 megawatts at the firm's Polaris Forge 1 campus in North Dakota. The additional capacity brings the anticipated contracted lease revenue for the project up to $11 billion.Read more CNBC tech newsSingapore police probe Nvidia customer Megaspeed over alleged China export violationsTesla faces U.S. auto safety probe after reports FSD ran red lights, caused collisionsTop Hollywood agencies slam OpenAI's Sora as 'exploitation' and a risk to clientsGoogle launches Gemini subscriptions to help corporate workers build AI agents\"With hyperscalers expected to invest approximately $350 billion into AI deployment this year, we believe we are in a prime position to serve as the modern-day picks and shovels of the intelligence era,\" CEO Wes Cummins said in a release.The new 150 MW building will join two other data cell blocks, each hosting 100 MW and 150 MW. The company noted that one building is nearly complete and construction will begin on the other.Applied Digital also secured funding from Macquarie Equipment Capital for a second campus in North Dakota, dubbed Polaris Forge 2. The estimated $3 billion factory will hold two 150 MW buildings, bringing the total leased capacity to 600 MW across both campuses.An initial 200 MW of power is expected to come online in 2026 and reach full capacity in 2027, the company said.The company had a net loss of $18.5 million in the first quarter, a loss of 7 cents per share. A year ago, the company posted a net loss of $4.29 million, a loss of 3 cents per share.Analysts polled by LSEG expect a loss of 15 cents per share for the second quarter on revenue of $76 million.Stock Chart IconStock chart iconApplied Digital 5-year stock chart."
  },
  {
    "title": "Trump nominee Paul Ingrassia reportedly accused of sexual harassment",
    "url": "https://www.cnbc.com/2025/10/10/trump-ingrassia-accused-sexual-harassment.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210589-1760105851117-Paul_Ingrassia_official_portrait.jpg?v=1760114727&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T19:21:21.000Z",
    "description": "Paul J. Ingrassia, nominee to lead the Office of Special Counsel.Source: DHSPresident Donald Trump's nominee to head the U.S. Office of Special Counsel, Paul Ingrassia, was accused of sexual harassment,...",
    "body": "Paul J. Ingrassia, nominee to lead the Office of Special Counsel.Source: DHSPresident Donald Trump's nominee to head the U.S. Office of Special Counsel, Paul Ingrassia, was accused of sexual harassment, Politico reported.Ingrassia, who is currently the White House liaison for the Department of Homeland Security, was investigated in connection with an incident in late July in which he told a lower-ranking female colleague on a business trip that she would be sharing a hotel room with him, Politico reported Thursday. The outlet cited five unnamed administration officials.The woman later \"discovered that Ingrassia had arranged ahead of time to have her hotel room canceled so she would have to stay with him,\" three officials said, according to Politico.She \"initially protested\" the arrangement, but relented in order to avoid causing a scene around other colleagues, Politico reported officials saying. The two slept in separate beds in the room, according to Politico.In a letter to Politico, a lawyer for the 30-year-old Ingrassia denied the harassment allegations.The news outlet did not name the woman, but said that she was a Trump appointee, \"Mr. Ingrassia has never harassed any coworkers — female or otherwise, sexually or otherwise — in connection with any employment,\" the attorney, Edward Paltzik, wrote.Paltzik said that while the two did share a hotel room on the trip, Ingrassia did not cancel the woman's reservation and \"no party engaged in inappropriate behavior.\"In a separate letter to CNBC, Paltzik said Ingrassia \"did not engage in any wrongdoing in connection with the matters reported.\"The woman filed a human resources complaint against him but retracted it days later out of fear of retaliation, three officials told Politico. An HR investigation into Ingrassia cleared him, Paltzik and a DHS spokesperson told Politico.The woman told Politico in a statement that she \"never felt uncomfortable\" about Ingrassia's behavior and that she never made a complaint.The White House did not immediately respond to CNBC's requests for comment on Politico's report.Trump nominated Ingrassia to lead the Office of Special Counsel, an independent agency that oversees whistleblower complaints and investigates federal employees.The nomination came after Trump fired Hampton Dellinger, an appointee of President Joe Biden. Dellinger had reportedly opposed the layoffs of federal employees ordered by Trump's so-called Department of Government Efficiency. Dellinger challenged his dismissal in a lawsuit but later dropped the suit.In his role as White House liaison, Ingrassia has pushed for the hiring of candidates at the Department of Justice who show \"exceptional loyalty\" to Trump, ABC News earlier reported.Ingrassia's chances of being confirmed to lead OSC appeared to falter in July, when Sen. Thom Tillis, R-N.C., said he would not back Trump's pick.Read Politico's full report here."
  },
  {
    "title": "Airlines tell passengers to prepare for delays as government shutdown continues",
    "url": "https://www.cnbc.com/2025/10/10/government-shutdown-airlines-passengers-delays.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108208728-1759839195695-gettyimages-2239662825-6m0a0441_ak6jtsxa.jpeg?v=1759949227&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T20:57:46.000Z",
    "description": "The Hollywood Burbank Airport air traffic control tower stands in Burbank, California, on Oct. 6, 2025.Mario Tama | Getty ImagesTravelers should prepare for potential flight disruptions this holiday weekend...",
    "body": "The Hollywood Burbank Airport air traffic control tower stands in Burbank, California, on Oct. 6, 2025.Mario Tama | Getty ImagesTravelers should prepare for potential flight disruptions this holiday weekend as the government shutdown continues, a group representing the largest U.S. airlines said Friday.Air traffic controller shortages this week delayed flights at some U.S. airports, including in Burbank, California, and Nashville, Tennessee.\"It is safe to fly, but ATC staffing shortages strain the system and cause flights to be spaced out, slowing down everything. In some cases, flights may be delayed or even cancelled,\" said Airlines for America, whose members include Delta Air Lines, United Airlines, American Airlines and others.Bad weather could also snarl travel over the long weekend. The National Weather Service on Friday issued a flood watch for New York, Long Island, and parts of Connecticut and New Jersey from an expected storm.During a federal government shutdown, \"essential\" workers such as air traffic controllers and TSA agents worth without pay, while many other employees are placed on furlough.A more than monthlong shutdown starting in late 2018 ended hours after a shortage of air traffic controllers snarled air travel in the New York area.Absences of air traffic controllers rose this week as the current shutdown stretched into its second week, Bryan Bedford, head of the Federal Aviation Administration, reiterated to staff on Friday.\"Air traffic controllers are still required to report to work and carry out their critical duties. The safety and efficiency of our airspace depend on them,\" he said in a note to employees, which was seen by CNBC.Tuesday will mark the first partial paycheck for air traffic controllers, and Oct. 28 would be the first suspended payday, the National Air Traffic Controllers Association, the controllers' union, said on Friday.The union said it plans to start informational leafleting on Tuesday at New York's LaGuardia Airport about the effects of the shutdown on controllers. Similar events are scheduled at other airports in Washington, D.C., Chicago and Philadelphia. \"Participating air traffic controllers and other aviation safety professionals plan to engage with travelers to explain how the government shutdown introduces unnecessary risk to the National Airspace System (NAS) and is detrimental to efficiency,\" the union said.Delta CEO Ed Bastian earlier this week told CNBC that the carrier has so far not seen \"any impacts at all\" to its operation because of the shutdown. However, he said that could change if it continued for another roughly 10 days.On Friday, close to 3,700 U.S. flights were delayed, according to flight-tracking site FlightAware, below the average daily rate of about 4,100 for U.S. airlines so far this year.Read more CNBC airline newsAir traffic control shortages add to U.S. flight delays, FAA saysSpirit Airlines on track for a $475 million bankruptcy lifeline'Seconds count': Avoiding airplane collisions at airports could come down to cockpit alertsU.S. startup airline Breeze Airways plans first international flights"
  },
  {
    "title": "Cramer's week ahead: Earnings season kicks off with reports from big banks",
    "url": "https://www.cnbc.com/2025/10/10/cramers-week-ahead-earnings-big-banks.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107060539-1652391835772-220305_IMG_0726.jpg?v=1696026975&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T22:57:25.000Z",
    "description": "watch nowCNBC's Jim Cramer walked investors through next week as Wall Street launches into earnings season, highlighting reports from financial giants including Wells Fargo, Goldman Sachs, Citigroup, Bank of...",
    "body": "watch nowCNBC's Jim Cramer walked investors through next week as Wall Street launches into earnings season, highlighting reports from financial giants including Wells Fargo, Goldman Sachs, Citigroup, Bank of America, Morgan Stanley and JPMorgan.He acknowledged Friday's major sell-off but said he doesn't think the session marks the end of the market's multi-year rally.\"It's a wild week, complicated by precipitous decline in Treasury yields, which normally would signal better times ahead,\" he said. \"But after today, it's hard to think of anything positive that can happen and a lot of negatives that might definitely happen.\"Cramer noted that Monday marks the beginning of enterprise software giant Salesforce's annual conference. He also said he expects some clarity on President Donald Trump's plans to issue new tariffs on China. The market soured on Friday after Trump threated a \"massive increase of Tariffs\" on Chinese products entering to U.S. to counter the country's expansion of rare earth mineral export restrictions. Friday evening, Trump announced on social media that he would put an extra 100% tariff on imports.Earnings season kicks off on Tuesday, starting with quarterly results from Blackrock, Wells Fargo and Goldman Sachs. Cramer said all three have had solid runs this year, and they \"aren't exactly in the crosshairs of the trade war.\" He suggested Goldman Sachs might have \"the biggest upside surprise.\" JPMorgan and Citigroup will report that day, and Cramer said he's optimistic about the results from both banks.Tuesday also brings earnings from Johnson & Johnson and Domino's Pizza. Cramer said he expects the pharmaceutical giant to report the best quarter of the sector, but indicated the pizza maker could miss the estimates.Bank of America, Morgan Stanley and Abbott Laboratories are set to report on Wednesday, and Cramer noted that Morgan Stanley has been surprisingly positive for the last several quarters. He also said Abbott Laboratories is usually reliable.Wednesday also brings analyst meetings from Salesforce and Dollar Tree. Cramer noted that both companies' stocks have been under pressure as of late — with Salesforce weighed down by worries about its artificial intelligence offerings and Dollar Tree burdened by new tariffs.Trucking giant J.B. Hunt and United Airlines are set to report Wednesday, and Cramer said these two could provide a solid read on the economy as investors largely lack economic data due to the government shutdown.On Thursday, Taiwan Semiconductor, CSX and Charles Schwab will report earnings. Cramer said he expects largely positive figures from Taiwan Semiconductor, which manufactures chips for industry leaders Nvidia and AMD. Cramer said CSX will likely explain its recent leadership shakeup, while Schwab can give insight to retail participation in the market.Friday brings quarterly reports from American Express and oil giant SLB. Shares of American Express tend to decline right after earnings, Cramer said. He added that management from SLB usually \"tells it like it is.\"watch nowSign up now for the CNBC Investing Club to follow Jim Cramer's every move in the market.Disclaimer The CNBC Investing Club Charitable Trust owns shares of Salesforce, Blackrock, Wells Fargo, Abbott Laboratories, Nvidia and Goldman Sachs.Questions for Cramer? Call Cramer: 1-800-743-CNBCWant to take a deep dive into Cramer's world? Hit him up! Mad Money Twitter - Jim Cramer Twitter - Facebook - InstagramQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com"
  },
  {
    "title": "China opens antitrust probe into the U.S. chip giant Qualcomm",
    "url": "https://www.cnbc.com/2025/10/10/qualcomm-shares-today-after-china-opens-antitrust-probe.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108178363-1753794609661-gettyimages-1251437334-porzycki-microchi230410_npEgg.jpeg?v=1760090690&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T15:55:56.000Z",
    "description": "Microchip and Qualcomm logo displayed on a phone screen are seen in this multiple exposure illustration photo taken in Krakow, Poland on April 10, 2023. Jakub Porzycki | Nurphoto | Getty ImagesQualcomm shares...",
    "body": "Microchip and Qualcomm logo displayed on a phone screen are seen in this multiple exposure illustration photo taken in Krakow, Poland on April 10, 2023. Jakub Porzycki | Nurphoto | Getty ImagesQualcomm shares fell 4% on Friday after Chinese regulators said they would investigate the American tech giant's acquisition of chip firm Autotalks, ramping up tensions between the U.S. and China ahead of key meetings between the country's leaders this month.China's State Administration of Market Regulation (SAMR) said that Qualcomm is suspected of violating the country's anti-monopoly law in regards to its acquisition of Israeli firm Autotalks. The acquisition officially closed in June, just over two years after it was first announced.In a short statement, the SAMR said it would initiate an investigation into Qualcomm.The U.S. chipmaker said in a statement that it is fully cooperating with SAMR and \"is committed to supporting the development and growth of our customers and partners.\"Qualcomm sells its smartphone chips to some of the biggest players in China, such as Xiaomi.Read more CNBC tech newsSingapore police probe Nvidia customer Megaspeed over alleged China export violationsTesla faces U.S. auto safety probe after reports FSD ran red lights, caused collisionsTop Hollywood agencies slam OpenAI's Sora as 'exploitation' and a risk to clientsGoogle launches Gemini subscriptions to help corporate workers build AI agentsU.S. tech companies have recently been in the crosshairs of Chinese regulators, ramping up tensions between Beijing and Washington ahead of key talks.In September, the SAMR alleged that Nvidia had violated the country's anti-monopoly law in relation to its acquisition of Mellanox and some agreements made during the acquisition. Meanwhile, Beijing has reportedly been discouraging local firms from buying Nvidia chips.This week, China also tightened export controls on rare earths and related technologies. Rare earths are critical to high-tech industries, including automobiles, defense and semiconductors.U.S. President Donald Trump and his Chinese counterpart Xi Jinping are expected to meet in person on the sidelines of the Asia-Pacific Economic Cooperation forum during the last week of October in Gyeongju, South Korea.watch now"
  },
  {
    "title": "Trump threatens 'massive' tariff hike on China over rare earths dispute",
    "url": "https://www.cnbc.com/2025/10/10/trump-china-tariffs-rare-earths.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108184518-1754957102304-gettyimages-2208850556-AA_10042025_2168830.jpeg?v=1760108629&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T18:43:29.000Z",
    "description": "watch nowPresident Donald Trump on Friday threatened to slap a \"massive increase of Tariffs\" on Chinese products imported into the United States to \"financially counter\" new export controls that China imposed...",
    "body": "watch nowPresident Donald Trump on Friday threatened to slap a \"massive increase of Tariffs\" on Chinese products imported into the United States to \"financially counter\" new export controls that China imposed on rare earths from that country.Trump also threatened in a social media post to cancel his upcoming meeting with Chinese President Xi Jinping because of the dispute.Stock markets dropped after Trump's bellicose Truth Social post about China, in which he said that \"there is no way that\" country \"should be allowed to hold the World 'captive'\" with its rare earths policy.China controls about 70% of the global supply of rare earths minerals, which are critical for high-tech industries, including automobiles, defense and semiconductors.\"One of the Policies that we are calculating at this moment is a massive increase of Tariffs on Chinese products coming into the United States of America,\" Trump wrote. \"There are many other countermeasures that are, likewise, under serious consideration. Thank you for your attention to this matter!\"China's Ministry of Commerce on Thursday said that foreign entities must now obtain a license to export products that contain more than 0.1% of rare earths sourced from that country, or that are manufactured using Chinese extraction, refining, magnet-making or recycling technology.The new rules for rare earths exports are set to take effect Dec. 1.U.S. and Chinese officials have been working to arrange a summit between U.S. President Donald Trump and Chinese President Xi Jinping in the coming months, which will likely take place in Beijing, experts said.Dilara Irem Sancar | Anadolu | Getty Images\"Some very strange things are happening in China!\" Trump wrote in his Truth Social post.\"They are becoming very hostile, and sending letters to Countries throughout the World, that they want to impose Export Controls on each and every element of production having to do with Rare Earths, and virtually anything else they can think of, even if it's not manufactured in China,\" Trump wrote.The president said he had not spoken to Xi about the issue \"because there was no reason to do so.\"\"This was a real surprise, not only to me, but to all the Leaders of the Free World. I was to meet President Xi in two weeks, at APEC, in South Korea, but now there seems to be no reason to do so,\" Trump wrote, referring to the Asia-Pacific Economic Cooperation summit.Trump claimed that the United States has been contacted by other countries that are \"extremely angry at this great Trade hostility, which came out of nowhere.\"\"Our relationship with China over the past six months has been a very good one, thereby making this move on Trade an even more surprising one,\" he wrote.The Chinese Embassy in Washington, D.C., did not immediately respond to a request for comment.— CNBC's Anniek Bao contributed to this story."
  },
  {
    "title": "We tested OpenAI’s Sora 2 video generator to find out why Hollywood is freaking out",
    "url": "https://www.cnbc.com/2025/10/10/how-sora-2-by-openai-is-challenging-hollywood.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210376-OpenAI_Hollywood_C_Clean.jpg?v=1760071837&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T18:11:35.000Z",
    "description": "The launch of OpenAI's updated Sora 2 AI video service kicked off another round of anxiety among musicians, actors and other content creators.Sora allows users to generate short videos for free by typing in a...",
    "body": "The launch of OpenAI's updated Sora 2 AI video service kicked off another round of anxiety among musicians, actors and other content creators.Sora allows users to generate short videos for free by typing in a prompt. The app is only available on iOS devices and is limited to invitees, meaning people need a code to access it. Still, Sora has climbed to the No. 1 spot in Apple's App Store, and OpenAI said this week it hit 1 million downloads in less than five days after launch.Major Hollywood groups like the Motion Picture Association have objected to OpenAI's copyright policies, and top Hollywood agencies are calling it \"exploitation.\" That's led to changes in how the model handles prompts for certain sensitive categories of generated content. CNBC's Julia Boorstin got access to Sora 2 and tried prompts like \"show me a video of a fat orange cartoon cat eating lasagna\" and \"create a superhero that wears a black cape and is saving a woman from a burning building.\" Some of the prompts failed due to copyright infringement, while others worked. Watch the video to see what happens when we put Sora 2 to the test."
  },
  {
    "title": "Trump says 'a lot' of federal workers are being laid off during government shutdown",
    "url": "https://www.cnbc.com/2025/10/10/trump-russ-vought-layoffs-government-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108207436-1759492228982-gettyimages-2226037132-US_FED_WHITE_HOUSE.jpeg?v=1759492260&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-11T04:27:26.000Z",
    "description": "Russell Vought, director of the Office of Management and Budget (OMB), speaks to members of the media outside the White House in Washington, DC, US, on Thursday, July 24, 2025. Aaron Schwartz | Bloomberg |...",
    "body": "Russell Vought, director of the Office of Management and Budget (OMB), speaks to members of the media outside the White House in Washington, DC, US, on Thursday, July 24, 2025. Aaron Schwartz | Bloomberg | Getty ImagesThe Trump administration began laying off thousands of federal workers across a range of agencies on Friday, the 10th day of the U.S. government shutdown.President Donald Trump on Friday afternoon told reporters in the Oval Office that the number of federal workers who will be laid off will \"be a lot.\"\"It'll be Democrat-oriented,\" Trump said, reiterating his promise to target programs he believes are favored by Democratic officials.The permanent job cuts, formally known as \"Reductions in Force,\" are different from the furloughing of government workers. Furloughed employees return to their jobs after a government shutdown ends.The layoffs were first announced by Russell Vought, the director of the Office of Management and Budget.\"The RIFs have begun,\" Vought wrote on X.OMB soon after confirmed his tweet, and said the cuts \"are substantial.\"RIF notices went to workers at the departments of Treasury, Health and Human Services, Commerce, Education, Energy, EPA, Homeland Security, Housing and Urban Development, and Interior. A filing by the Justice Department in U.S. District Court in San Francisco late Friday showed at least 4,000 federal workers received layoff notices, with Treasury and HHS seeing the largest cuts, of more than 1,100 employees apiece.The filing came in response to a lawsuit filed on Sept. 30 by two unions that represent many federal workers, the American Federation of Government Employees and the American Federation of County, State & Municipal Employees.The lawsuit challenges the legality of the RIFs, which at the time the suit was filed were threatened by the Trump administration. A hearing on the unions' request for a temporary restraining order to block the layoffs is scheduled for Wednesday in San Francisco.\"These mass firings are illegal and will have devastating effects on the services millions of Americans rely on every day,\" AFSCME President Lee Saunders said in a statement.\"Whether it's food inspectors, public safety workers, or the countless other public service workers who keep America running, federal employees should not be bargaining chips in this administration's political games,\" Saunders said.The layoffs started four days after National Economic Council Director Kevin Hassett warned in a CNBC interview that could \"start taking sharp measures\" if the shutdown continued due to the lack of a stopgap funding deal approved by Congress.Hassett said that \"any government worker who loses their job\" will have Democrats to blame for their layoff.watch nowWhile many federal workers have been furloughed because of the shutdown, it is not the normal practice in shutdowns to permanently lay off government employees.Senate Minority Leader Chuck Schumer, a New York Democrat, said, \"Russell Vought just fired thousands of Americans with a tweet. \"Let's be blunt: nobody's forcing Trump and Vought to do this,\" Schumer said in a statement. \"They don't have to do it; they want to. They're callously choosing to hurt people — the workers who protect our country, inspect our food, respond when disasters strike. This is deliberate chaos.\" \"Here's what's worse: Republicans would rather see thousands of Americans lose their jobs than sit down and negotiate with Democrats to reopen the government,\" Schumer said.Sen. Susan Collins, a Maine Republican who chairs the Senate Appropriations Committee, in a statement said, \"I strongly oppose OMB Director Russ Vought's attempt to permanently lay off federal workers who have been furloughed due to a completely unnecessary government shutdown caused by Senator Schumer.\"\"Regardless of whether federal employees have been working without pay or have been furloughed, their work is incredibly important to serving the public,\" Collins said. \"Arbitrary layoffs result in a lack of sufficient personnel needed to conduct the mission of the agency and to deliver essential programs, and cause harm to families in Maine and throughout our country.\"Since the shutdown began last week, Vought has announced in tweets decisions by the Trump administration to freeze and cut billions of dollars in federal funding for projects in states and cities controlled by Democratic elected officials.The Trump administration and Republicans in Congress have repeatedly sought to blame Democrats for the government shutdown and any negative fallout from it.Democratic senators have largely refused to vote for a Republican stopgap funding plan that would reopen the government, saying that any such resolution must include an agreement to extend enhanced Affordable Care Act tax credits.Those tax credits lower the cost of Obamacare health insurance plans purchased by millions of Americans from government-run ACA marketplaces.Dueling Republican and Democratic funding resolutions failed to pass in the Senate for the seventh time on Thursday.The shutdown is expected to continue until at least early next week because the Senate is not due to resume business until Tuesday.Although Republicans hold majorities in both the Senate and House, they need the votes of at least some Democratic senators to pass a funding bill because of the 60-vote threshold in the Senate required to avoid filibusters blocking legislation."
  },
  {
    "title": "Govini, a defense tech startup taking on Palantir, hits $100 million in annual recurring revenue",
    "url": "https://www.cnbc.com/2025/10/10/defense-tech-govini-palantir-revenue.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108128052-1744079576004-gettyimages-1317950512-_r0a0224.jpeg?v=1760117396&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T21:16:32.000Z",
    "description": "watch nowGovini, a defense tech software startup taking on the likes of Palantir, has blown past $100 million in annual recurring revenue, the company announced Friday.\"We're growing faster than 100% in a...",
    "body": "watch nowGovini, a defense tech software startup taking on the likes of Palantir, has blown past $100 million in annual recurring revenue, the company announced Friday.\"We're growing faster than 100% in a three-year CAGR, and I expect that next year we'll continue to do the same,\" CEO Tara Murphy Dougherty told CNBC's Morgan Brennan in an interview. With how \"big this market is, we can keep growing for a long, long time, and that's really exciting.\"CAGR stands for compound annual growth rate, a measurement of the rate of return.The Arlington, Virginia-based company also announced a $150 million growth investment from Bain Capital. It plans to use the money to expand its team and product offering to satisfy growing security demands.In recent years, venture capitalists have poured more money into defense tech startups like Govini to satisfy heightened national security concerns and modernize the military as global conflict ensues.The group, which includes unicorns like Palmer Luckey's Anduril, Shield AI and artificial intelligence beneficiary Palantir, is taking on legacy giants such as Boeing, Lockheed Martin and Northrop Grumman, that have long leaned on contracts from the Pentagon.Read more CNBC tech newsSingapore police probe Nvidia customer Megaspeed over alleged China export violationsTesla faces U.S. auto safety probe after reports FSD ran red lights, caused collisionsTop Hollywood agencies slam OpenAI's Sora as 'exploitation' and a risk to clientsGoogle launches Gemini subscriptions to help corporate workers build AI agentsDougherty, who previously worked at Palantir, said she hopes the company can seize a \"vertical slice\" of the defense technology space.The 14-year-old Govini has already secured a string of big wins in recent years, including an over $900-million U.S. government contract and deals with the Department of War.Govini is known for its flagship AI software Ark, which it says can help modernize the military's defense tech supply chain by better managing product lifecycles as military needs grow more sophisticated.\"If the United States can get this acquisition system right, it can actually be a decisive advantage for us,\" Dougherty said.Looking ahead, Dougherty told CNBC that she anticipates some setbacks from the government shutdown.Navy customers could be particularly hard hit, and that could put the U.S. at a major disadvantage.While the U.S. is maintaining its AI dominance, China is outpacing its shipbuilding capacity and that needs to be taken \"very seriously,\" she added.Dougherty also noted China's dominance in rare earths and processed minerals that are critical to making parts and systems for the military. \"The rare earth crisis that we're in is a serious one,\" she said, \"because one of the things that you can see in the data that we have in our proprietary data set tracks national security programs down to the raw materials.\""
  },
  {
    "title": "Tech megacaps lose $770 billion in value as Nasdaq suffers steepest drop since April",
    "url": "https://www.cnbc.com/2025/10/10/tech-megacaps-market-cap-mag-7.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108200522-1758187156935-gettyimages-2235458143-boivin-notitle250917_npZhw.jpeg?v=1760081677&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-11T05:24:13.000Z",
    "description": "Jensen Huang, CEO of Nvidia, speaking with CNBC's Jim Cramer during a CNBC Investing Club with Jim Cramer event at the New York Stock Exchange on Oct. 7th, 2025.Kevin Stankiewicz | CNBCShares of Amazon,...",
    "body": "Jensen Huang, CEO of Nvidia, speaking with CNBC's Jim Cramer during a CNBC Investing Club with Jim Cramer event at the New York Stock Exchange on Oct. 7th, 2025.Kevin Stankiewicz | CNBCShares of Amazon, Nvidia and Tesla each dropped around 5% on Friday, as tech's megacaps lost $770 billion in market cap, following President Donald Trump's threats for increased tariffs on Chinese goods.With tech's trillion-dollar companies occupying an increasingly large slice of the U.S. market, their declines sent the Nasdaq down 3.6% and the S&P 500 down 2.7%. For both indexes, it was the worst day since April, when Trump said he would slap \"reciprocal\" duties on U.S. trading partners.After market close on Friday, Trump declared in a social media post that the U.S. would impose a 100% tariff on China and, on Nov. 1, it would apply export controls \"on any and all critical software.\"Amazon, Nvidia and Tesla all slipped about 2% in extended trading following the post.The president's latest threats are disrupting, at least briefly, what had been a sustained rally in tech, built on hundreds of billions of dollars in planned spending on artificial intelligence infrastructure.Read more CNBC tech newsSingapore police probe Nvidia customer Megaspeed over alleged China export violationsTesla faces U.S. auto safety probe after reports FSD ran red lights, caused collisionsTop Hollywood agencies slam OpenAI's Sora as 'exploitation' and a risk to clientsGoogle launches Gemini subscriptions to help corporate workers build AI agentsIn late September, Nvidia, which makes graphics processing units for training AI models, became the first company to reach a market cap of $4.5 trillion. Nvidia alone saw its market capitalization decline by nearly $229 billion on Friday.OpenAI counts on Nvidia's GPUs from a series of cloud suppliers, including Microsoft. OpenAI is only seeing rising demand.In September it introduced the Sora 2 video creation app, and this week the company said the ChatGPT assistant now boasts over 800 million weekly users. Microsoft, which spends heavily on infrastructure to operate its cloud data centers, saw its market cap drop by $85 billion on Friday.The sell-off wiped out Amazon's gains for the year. That stock is now down 2% so far in 2025. Amazon competes with Microsoft to rent out GPUs from its cloud data centers. The online retailer lost $121 billion in value during the day.\"There continues to be a lot of noise about the impact that tariffs will have on retail prices and consumption,\" Amazon CEO Andy Jassy told analysts in July. \"Much of it thus far has been wrong and misreported. As we said before, it's impossible to know what will happen.\"Tesla, which introduced lower-priced vehicles on Tuesday, saw its market capitalization sink by $71 billion.The automaker reports third-quarter results on Oct. 22, with Microsoft earnings scheduled for the following week. Nvidia reports in November.Google parent Alphabet and Facebook owner Meta fell 2% and almost 4%, respectively.WATCH: Pres. Trump: Calculating massive increase of tariffs on Chinese products into U.S.watch now"
  },
  {
    "title": "How new federal tax changes for 2026 may affect families",
    "url": "https://www.cnbc.com/2025/10/10/irs-2026-tax-changes-child-tax-credit-family-refunds.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108158738-1749758371410-gettyimages-665242940-family-supermarket-20022017-1044.jpeg?v=1760034187&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-10-10T16:49:52.000Z",
    "description": "Vgajic | E+ | Getty ImagesThe IRS has announced new tax inflation adjustments for 2026.Those changes may affect just how much federal taxes families pay in taxes or receive in their refunds come tax...",
    "body": "Vgajic | E+ | Getty ImagesThe IRS has announced new tax inflation adjustments for 2026.Those changes may affect just how much federal taxes families pay in taxes or receive in their refunds come tax time.Qualifying families may see higher amounts for the child tax credit and earned income tax credit in 2026. Moreover, the adoption credit and gift tax exclusion have also been adjusted for next year.In its Thursday announcements, the IRS also increased figures for dozens of other provisions, including federal income tax brackets and long-term capital gains brackets, among others.The IRS announcements came a day after the agency said it would furlough nearly half its workforce due to the ongoing government shutdown. Read more CNBC personal finance coverageHow new federal tax changes for 2026 may affect familiesIRS announces new federal income tax brackets for 2026The IRS unveils higher capital gains tax brackets for 2026Gold hits $4,000 but stocks still win over time, top advisor saysAttending a wedding can cost you as much as a typical month’s rentAI is poised to disrupt the job market. Some roles could ‘radically transform'This tax move is one of the IRS’ ‘best-kept secrets for retirees,’ advisor saysFurloughed federal workers face threat of no back pay from shutdownConsumer outlook sours as inflation expectations rise: New York FedHow the S&P 500 performed after 10 previous government shutdownsS&P 500 continues to notch new highs. Where to invest in case of a pullbackIRS CEO also heads Social Security. Why that dual role worries some expertsPretax vs. Roth 401(k) contributions: This calculation could help you decideChild tax credit for 2026As the IRS noted in its announcement, President Donald Trump's \"big beautiful bill\" enacted in July bumped the maximum child tax credit — a tax break for parents of qualifying children — to $2,200 starting in 2025. Prior to that legislation, the maximum child tax credit was $2,000 per child.The maximum $2,200 child tax credit will be in effect for tax years 2025 and 2026, according to an IRS spokesperson. That threshold will be adjusted for inflation for tax year 2027, the spokesperson said.The refundable portion of the child tax credit is $1,700 for 2026, according to the IRS, which is unchanged from 2025. That represents the amount families may potentially receive back as a tax refund if their tax liability is less than their child tax credit amount.Earned income tax credit for 2026The earned income tax credit — a tax break for low- to middle-income individuals and families — will be adjusted for 2026 based on the taxpayer's number of children and income.The maximum earned income tax credit, or EITC, will increase to $8,231 in 2026 for qualifying taxpayers with three or more eligible children — up from $8,046 for tax year 2025.For qualifying taxpayers with two children, the maximum EITC will increase to $7,316 in 2026, up from $7,152 in 2025.For taxpayers with one child, the maximum will be $4,427, up from $4,328 in 2025.For qualifying filers with no children, the maximum amount will be $664 in 2026, up from $649 in 2025.watch nowTo qualify for the tax credit, individuals and families must be under certain thresholds for adjusted gross income.Married couples who file jointly will completely phase out at $70,224 in adjusted gross income if they have three or more children, $65,899 in AGI with two children, $58,863 with one child and $26,820 with no children.For other tax filing statuses — single, head of household or widowed — the EITC will completely phase out at $62,974 for those with three or more children, $58,629 for two children, $51,593 for one child and $19,540 for no children.To qualify for the EITC, taxpayers cannot have more than $12,200 in certain investment income in 2026.Adoption credit for 2026The maximum credit for qualified adoption expenses rises to $17,670 in 2026, up from $17,280 in 2025. The amount of the credit that may be refundable will be $5,120 in 2026.Gift tax exclusion changesThe annual exclusion for gifts will be $19,000 in 2026 — which is unchanged from 2025.The annual exclusion for gifts to a spouse who is not a U.S. citizen will go up to $194,000 for 2026 — a $4,000 increase from 2025."
  }
]