[
  {
    "title": "This is how exposed European Big Pharma is to the U.S.",
    "url": "https://www.cnbc.com/2025/12/19/this-is-how-exposed-european-big-pharma-is-to-the-us.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222573-17624550972025-11-06t184628z_1673660215_rc25rhas1dn5_rtrmadp_0_usa-trump.jpeg?v=1762455130&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T12:22:06.000Z",
    "description": "Novo Nordisk CEO Maziar Mike Doustdar shakes hands with U.S. President Donald Trump during an event to announce a deal with Eli Lilly and Novo Nordisk",
    "body": "Novo Nordisk CEO Maziar Mike Doustdar shakes hands with U.S. President Donald Trump during an event to announce a deal with Eli Lilly and Novo Nordisk to reduce the prices of GLP-1 weight‑loss drugs during an event in the Oval Office at the White House in Washington, D.C., U.S., November 6, 2025. Jonathan Ernst | ReutersDrug pricing has emerged as one of the biggest issues for pharmaceutical companies this year, as the U.S. looks to dramatically reduce the costs paid by consumers.As the largest single market for most pharma and biotech firms, higher drug prices in the U.S. — often nearly three times as costly as in other countries — are a key factor in the industry's reliance on American sales, with branded drugs commanding even steeper premiums.President Donald Trump has pushed for lower drug prices for Americans through so-called Most Favored Nations drug pricing, whereby the prices in the U.S. are set at the lowest price paid by other wealthy countries. That could have a tremendous impact on companies' balance sheets.But exactly how exposed are Europe's biggest pharma companies to the U.S. market?Majority U.S. salesAmong the 10 largest biopharmaceutical companies in the Stoxx 600 health index, five have a majority of their total sales from the U.S.: Roche, Novo Nordisk, GSK, Argenx, and UCB.Argenx is the most exposed, with 85% of total sales originating in the U.S. in its last reported period.The least exposed are Germany's Merck KGaA and Bayer, with about 30% of sales coming from the U.S. Both Merck and Bayer have diversified businesses that go beyond pharmaceuticals while Roche also has a sizeable diagnostics division. Meanwhile, AstraZeneca, the FTSE 100's largest company, generates 42% of its sales from the U.S., and is aiming to boost this share as it targets $80 billion in revenue by 2030. In its third-quarter earnings report, the company, which has a broad portfolio of blockbuster drugs comprising cancer, respiratory, and diabetes medicines, said it is delivering on its strategy to strengthen operations in the U.S. to \"power growth.\"The Cambridge, U.K.-based company has also pledged significant investments in the U.S., just like peers Novartis, Roche, and GSK, since Trump took up his second presidential term.Making deals​Trump's push for slashing drug prices has led many firms on both sides of the Atlantic to make deals with the administration.​In May this year, the president signed an executive order establishing MFN drug pricing. He has also sent letters to 17 major drugmakers, calling for them to slash U.S. prescription prices to levels paid overseas.​At the same time, Trump has made a push for onshoring production of various goods, including pharmaceuticals, and threatened triple-digit tariffs for drugmakers that fail to invest in U.S. manufacturing — further ramping up the pressure on companies to make deals with his administration.​AstraZeneca, Novo Nordisk, and other U.S. pharma giants have already made deals with Trump to lower prices of their medicines in the country, although analysts say it may not have a significant impact on their bottom lines due to the way the deals were structured. \"[AstraZeneca's] MFN deal is more benign than appreciated, but EU countries may see access to drugs reduced,\" said Jefferies analysts in November. ​Late Wednesday, Bloomberg reported that heavyweights Roche and Novartis – the two biggest European pharma companies by market value – were closing in on drug pricing deals with the Trump administration, which may be announced as soon as Friday. Both companies told CNBC they supported the administration's goal of lowering drug costs for Americans but declined to confirm an imminent deal. Novartis said it was \"in discussion with the Administration.\"– Carolin Roth contributed to this report",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This is how exposed European Big Pharma is to the U.S.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222573-17624550972025-11-06t184628z_1673660215_rc25rhas1dn5_rtrmadp_0_usa-trump.jpeg?v=1762455130&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T12:22:06.000Z",
      "dateModified": "2025-12-19T12:22:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Avatar: Fire and Ash' snares $12 million in Thursday previews",
    "url": "https://www.cnbc.com/2025/12/19/avatar-disney-james-cameron.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108244193-1766158242052-g_avatarfireandash_26_e4776d57_Cropped.jpg?v=1766158364&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T19:34:51.000Z",
    "description": "Still from Disney's \"Avatar: Fire and Ash.\"DisneyDisney and James Cameron's third Avatar movie, \"Avatar: Fire and Ash,\" hit theaters Thursday, snappin",
    "body": "Still from Disney's \"Avatar: Fire and Ash.\"DisneyDisney and James Cameron's third Avatar movie, \"Avatar: Fire and Ash,\" hit theaters Thursday, snapping up $12 million in early preview screenings domestically.The second installment in the film series, \"The Way of Water,\" had a better start and tallied $5 million more in its Thursday preview haul in 2022. Still, box office analysts expect \"Fire and Ash\" will bring in at least $100 million during its opening weekend in the U.S. and Canada.\"A lot is riding on the performance of 'Avatar: Fire and Ash,' and with less than two weeks remaining in the year, the film's results will play a pivotal role in shaping the annual box office totals,\" Paul Dergarabedian, head of marketplace trends at Comscore, told CNBC.Fueling global ticket sales will be international markets, which collected $43.1 million in preview screenings. \"The circumstances surrounding each 'Avatar' film have been quite different,\" said Shawn Robbins, director of analytics at Fandango and founder of Box Office Theory. \"The first was a sleeper-turned-phenomenon during a pre-streaming box office heyday, the second a beneficiary of pent-up sequel demand and eventized-status in moviegoing's post-Covid recovery and the third is now opening in a more competitive and new-normal market.\"The Avatar franchise is a unicorn in Hollywood. Despite garnering widespread acclaim and massive financial success at the box office, the franchise has never quite captured the cultural relevance that \"Star Wars\" or the Marvel Cinematic Universe — both also owned by Disney — have enjoyed. Toy sales fizzled and cosplayers donning heavy blue makeup at pop culture fan conventions have become few and far between.Yet, both 2009's \"Avatar\" and 2022's \"Avatar: The Way of Water\" have topped $2 billion at the global box office, with the first film teetering close to $3 billion in total ticket receipts. \"The constant is the James Cameron factor,\" Robbins said. \"Audiences expect grand visuals, sound and storytelling when they buy tickets to his movies. They consistently meet or exceed expectations with long runways at the box office and exclusive theatrical windows because they deliver an experience that cannot be duplicated at home.\"Driving these strong hauls is the sale of premium large format tickets for screens like IMAX and Dolby, as well as 3D showings, which tend to be more expensive than regular tickets. While 3D films have fallen out of favor with domestic audiences, they remain popular internationally —especially in China. Indeed, \"Avatar\" made the bulk of its money outside of the U.S., with a whopping $2.08 billion coming from overseas.Dergarabedian said the franchise has consistently benefited from moviegoers' enthusiasm for seeing the films in 3D. \"The original 'Avatar,' released in 2009, was a groundbreaking film that reignited widespread interest in 3D cinema, setting the stage for subsequent entries to capitalize on this trend,\" he said.The international preview sales shared by Disney on Friday did not include China. The company noted that early estimates indicate an opening day of around $17.1 million, which would mark the third-highest opening day for a Motion Picture Association film since \"The Way of Water.\" \"While 'Fire and Ash' is looking at a diminished box office opening relative to 'The Way of Water,' it's all about the long game,\" Robbins said. \"Premium screens are locked up into the new year, Cameron's films are not front-loaded like most Hollywood franchises, and international performance will again far outweigh domestic.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Avatar: Fire and Ash' snares $12 million in Thursday previews",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108244193-1766158242052-g_avatarfireandash_26_e4776d57_Cropped.jpg?v=1766158364&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T19:34:51.000Z",
      "dateModified": "2025-12-19T19:34:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waller had a 'strong interview' for Fed chair with Trump as president appears to turn focus to job market",
    "url": "https://www.cnbc.com/2025/12/19/waller-had-a-strong-interview-for-fed-chair-with-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108213027-1760627921657-gettyimages-2240984013-WALLER_FED.jpeg?v=1766140968&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T15:51:21.000Z",
    "description": "Christopher Waller, governor of the US Federal Reserve, speaks during the C. Peter McColough Series on International Economics at the Council on Forei",
    "body": "Christopher Waller, governor of the US Federal Reserve, speaks during the C. Peter McColough Series on International Economics at the Council on Foreign Relations in New York, US, on Thursday, Oct. 16, 2025. Michael Nagle | Bloomberg | Getty ImagesFederal Reserve Governor Christopher Waller had a \"strong interview\" for the central bank chair position with President Donald Trump in which the two discussed the labor market in depth and how to jump-start job creation, according to senior administration officials.The interview took place in the president's residence and concluded shortly before Trump addressed the nation on the economy Wednesday night. Treasury Secretary Scott Bessent, chief of staff Susie Wiles and deputy chief of staff Dan Scavino also attended the interview.Blackrock's Rick Rieder will be interviewed at Mar-a-Lago for the Fed chair job the last week of the year, the officials said. Fed Governor Michelle Bowman is no longer a candidate for the job, they also said.National Economic Council Director Kevin Hassett, the favorite for the job in prediction markets, and former Fed Governor Kevin Warsh have previously been interviewed by Trump.The officials said the conversation about jobs with Waller showed concern and criticism was misplaced that the president was seeking a candidate based on the criteria that the next Fed chair would bow to the whims of Trump on rates. They said the president's interest in the interviews with candidates had been broad-based across a series of economic issues.Last week, Trump told The Wall Street Journal he thought the Fed chair should consult with him on rates. \"It doesn't mean—I don't think he should do exactly what we say,\" the president said. \"But certainly we're—I'm a smart voice and should be listened to.\"In the Oval Office on Thursday, Trump praised Waller in response to a reporter's question. \"I think he's great. I mean, he's been a man who has been there a long time, somebody that I was very involved with.\" Trump interviewed Waller in 2019 and nominated him to be a Fed governor.Despite the praise of Waller and the positive description of the interview, there was no indication that he was a favorite candidate for the job. It was only clear that the process of interviews continues with the obvious implication that the president had yet to make a decision. The officials said the interviews are following a \"highly organized process.\"In his speech Wednesday, Trump said, \"I will soon announce our next chairman of the Federal Reserve, someone who believes in lower interest rates by a lot, and mortgage payments will be coming down even further.\"Waller's weightliftingIn an interview on Wednesday with CNBC at the Yale CEO Summit in New York, which took place before he met with the president, Waller said he believed rates could decline by 50 to 100 basis points below the current level because he expects inflation to drop and was concerned about the weak job market.Waller dissented in July when the Fed kept rates on hold, a move that seemed prescient with the Fed then starting cuts in September and taking rates down another two times before year-end.No details were provided of what the two men discussed about jobs, but the conversation suggests Trump could be more focused on the issue. The recent November jobs report showed a rise in the unemployment rate to 4.6% from 4.4% in September while payroll growth slowed to a crawl.In his speech Wednesday, Trump said that \"there are more people working today than at any time in American history. And 100 percent of all jobs created since I took office have been in the private sector.\"Since January, the private sector has added 687,000 jobs and the government has lost 188,000 as part of sweeping job cuts by the administration.On a lighter note, the president was said to have been seriously impressed when informed that Waller could dead lift 350 pounds.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waller had a 'strong interview' for Fed chair with Trump as president appears to turn focus to job market",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108213027-1760627921657-gettyimages-2240984013-WALLER_FED.jpeg?v=1766140968&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T15:51:21.000Z",
      "dateModified": "2025-12-19T15:51:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "November home sales struggle as supply stalls",
    "url": "https://www.cnbc.com/2025/12/19/november-home-sales.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108244157-1766154648196-108244157-1766154565483-gettyimages-2251016437-yanow-housingm251212_npETP.jpg?v=1766154667&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T16:39:44.000Z",
    "description": "watch nowHigh home prices, stubbornly high mortgage rates and now less supply are all weighing on potential homebuyers. Sales of previously owned home",
    "body": "watch nowHigh home prices, stubbornly high mortgage rates and now less supply are all weighing on potential homebuyers. Sales of previously owned homes rose just 0.5% in November from October and were 1% lower than November 2024, according to the National Association of Realtors. Sales came in at an annualized rate of 4.13 million units.This count is based on closings, so it reflects contracts likely signed in September and October, when mortgage rates initially came down slightly but then stayed in a tight range.   Supply, which had been gaining for much of this year, fell in November. There were 1.43 million homes for sale at the end of the month, down 5.9% from October but up 7.5% year over year, according to the association. At the current sales pace, that represents a 4.2-month supply. A six-month supply is considered balanced between buyer and seller. \"Inventory growth is beginning to stall,\" Lawrence Yun, chief economist for the Realtors, said in a release. \"With distressed property sales at historic lows and housing wealth at an all-time high, homeowners are in no rush to list their properties during the winter months.\"Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.Sellers who were on the market also began to delist their properties at a higher rate than usual. Sellers often take unsold homes off the market heading into winter, but that dynamic was much stronger this year. And that is keeping pressure on home prices. The median price of a home sold in November was $409,200, an increase of 1.2% from November 2024, and the highest November reading on record. The Realtors use a median measurement, which can skew to what end of the market is selling most. The high end is currently doing much better than the low end. Sales of homes priced in the $100,000 to $250,000 range were down nearly 8% from a year ago, while homes priced at more than $1 million were up 1.4%.\"Wage growth is outpacing home price gains, which improves housing affordability. Still, future affordability could be hampered if housing supply fails to keep pace with demand,\" Yun said.Homes are staying on the market longer, at 36 days compared with 32 days last November. First-time homebuyers made up 30% of sales, unchanged from a year ago, but historically they make up about 40%. Investors stepped back into the market, making up 18% of transactions, up from 13% in November 2024.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "November home sales struggle as supply stalls",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108244157-1766154648196-108244157-1766154565483-gettyimages-2251016437-yanow-housingm251212_npETP.jpg?v=1766154667&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T16:39:44.000Z",
      "dateModified": "2025-12-19T16:39:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump suspends U.S. green card lottery after Brown University shooting",
    "url": "https://www.cnbc.com/2025/12/19/us-green-card-lottery-suspended-after-brown-shooting-officials-say.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240689-17654720522025-12-11t163917z_391446468_rc2geiawcjv6_rtrmadp_0_usa-congress-threats.jpeg?v=1765472080&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T18:54:13.000Z",
    "description": "U.S. Homeland Security Secretary Kristi Noem speaks during a House Homeland Security hearing entitled \"Worldwide Threats to the Homeland,\" on Capitol ",
    "body": "U.S. Homeland Security Secretary Kristi Noem speaks during a House Homeland Security hearing entitled \"Worldwide Threats to the Homeland,\" on Capitol Hill in Washington, D.C., U.S. Dec. 11, 2025.  Elizabeth Frantz | ReutersU.S. Department of Homeland Security Secretary Kristi Noem said she was suspending the diversity visa program at President Donald Trump's direction, saying the man suspected of killing two students at Brown University and a MIT professor had been granted one.Noem posted on X late Thursday that she had instructed the U.S. Citizenship and Immigration Services to pause the (DV1) program \"to ensure no more Americans are harmed by this disastrous program.\"On Dec. 13, two students died and nine others were injured when someone opened fire at the physics building at Brown University in Providence, Rhode Island. Police later identified Portuguese national Claudio Manuel Neves Valente, 48, as the suspect.Valente was a former student at the university and had been enrolled in a Ph.D. program in physics in 2000, the university's president, Christina H. Paxson, said. Valente is also suspected of having killed MIT physics professor Nuno Loureiro, 47, in his home in Brookline, Massachusetts, two days after the Brown shooting. Valente and Loureiro are believed to have attended the same university in their native Portugal.Authorities announced the suspect's identity hours after Valente was found dead in a New Hampshire storage facility on Thursday, Providence Police Chief Oscar Perez said. Guns were also found at the scene.\"There's no longer a threat to the public,\" the U.S. attorney's office in Boston said in a statement after Valente's death was confirmed. Authorities believe Valente acted alone and have not disclosed a motive for the killings. Noem said that Valente entered the U.S. through the DV1 program in 2017 and was granted a green card.\"In 2017, President Trump fought to end this program, following the devastating NYC truck ramming by an ISIS terrorist, who entered under the DV1 program, and murdered eight people,\" she wrote on X.The Diversity Immigrant Visa Program (DV Program) allocates up to 50,000 immigrant visas every year, according to the USCIS website.The program is a lottery. Visas are randomly allocated to individuals from countries with low rates of immigration to the U.S.— Dan Mangan contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump suspends U.S. green card lottery after Brown University shooting",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240689-17654720522025-12-11t163917z_391446468_rc2geiawcjv6_rtrmadp_0_usa-congress-threats.jpeg?v=1765472080&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T18:54:13.000Z",
      "dateModified": "2025-12-19T18:54:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Musk's $56 billion Tesla pay package must be restored as court rules cancellation was too extreme",
    "url": "https://www.cnbc.com/2025/12/19/musk-tesla-pay-delaware-supreme-court.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108168278-17518962972025-06-13t010710z_885255829_rc2gk1a9xltd_rtrmadp_0_space-warfare.jpeg?v=1753301789&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T23:44:32.000Z",
    "description": "watch nowElon Musk's 2018 CEO pay package from Tesla, worth some $56 billion when it vested, must be restored, the Delaware Supreme Court ruled Friday",
    "body": "watch nowElon Musk's 2018 CEO pay package from Tesla, worth some $56 billion when it vested, must be restored, the Delaware Supreme Court ruled Friday.\"We reverse the Court of Chancery's rescission remedy and award $1 in nominal damages,\" the judges wrote in their opinion. In the decision, the Delaware Supreme Court judges said a lower court's decision to cancel Musk's 2018 pay plan was too extreme a remedy and that the lower court did not give Tesla a chance to say what a fair compensation ought to be.The decision on the appeal in this case, known as Tornetta v. Musk, likely ends the yearslong fight over Musk's record-setting compensation. Musk's net worth is currently estimated at around $679.4 billion, according to the Forbes Real Time Billionaires List. Dorothy Lund, a professor at Columbia Law School, told CNBC that while the Friday opinion may restore the 2018 pay plan for Musk, it leaves the rest of the lower court's decision unaddressed and intact. \"The court had previously decided that Musk was a controlling shareholder of Tesla and that the Tesla board and he arranged an unfair pay plan for him,\" she said. \"None of that was reversed in this decision.\"\"We are proud to have participated in the historic verdict below, calling to account the Tesla board and its largest stockholder for their breaches of fiduciary duty,\" lawyers representing plaintiff Richard J. Tornetta said in an e-mailed statement.Tesla did not immediately respond to requests for comment.The Delaware Supreme Court issued the order per curiam with no single judge taking credit for writing the opinion and no dissent noted.Read more CNBC tech newsGoogle and Nvidia VC arms back vibe coding startup Lovable at $6.6 billion valuationMetaX and Moore Threads' IPOs underscore Chinese chipmakers' growing challenge to NvidiaInstacart shares drop on report that FTC is probing company over AI pricing toolAmazon says AI chief Rohit Prasad is leaving, Peter DeSantis to lead 'AGI' groupMusk's 2018 CEO pay package from Tesla, comprised of 12 milestone-based tranches of stock, was unprecedented at the time it was proposed. After it was granted, the pay plan made Musk the wealthiest individual in the world.Tesla shareholder Tornetta sued Tesla, filing a derivative action in 2018, accusing Musk and the company's board of a breach of their fiduciary duties. Delaware's business-specialized Court of Chancery decided in January 2024 that the pay plan was improperly granted and ordered it to be rescinded.In her decision, Chancellor Kathaleen McCormick also found that Musk \"controlled Tesla,\" and that the process leading to the board's approval of his 2018 pay plan was \"deeply flawed.\" Among other things, she found the Tesla board did not disclose all the material information they should have to investors before asking them to vote on and approve the plan.After the earlier Tornetta ruling, Musk moved Tesla's site of incorporation out of Delaware, bashed McCormick by name in posts on his social network X, formerly Twitter, where he has tens of millions of followers, and called for other entrepreneurs to reincorporate outside of the state.Tesla also attempted to \"ratify\" the 2018 CEO pay plan by holding a second vote with shareholders in 2024. In November, Tesla shareholders voted to approve an even larger CEO compensation plan for Musk. The 2025 pay plan consists of 12 tranches of shares to be granted to the CEO if Tesla hits certain milestones over the next decade and is worth about $1 trillion in total. The new plan could also increase Musk's voting power over the company from around 13% today to around 25%. Shareholders had also approved a plan to replace Musk's 2018 CEO pay if the Tornetta decision was upheld on appeal. That plan is now nullified.As CNBC previously reported, a law firm that currently represents Tesla in this appeal penned a bill to overhaul corporate law in Delaware earlier this year. The bill was passed by the Delaware legislature in March, and if it had applied retroactively, it could have affected the outcome of this case.Read the Delaware Supreme Court's ruling here. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Musk's $56 billion Tesla pay package must be restored as court rules cancellation was too extreme",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108168278-17518962972025-06-13t010710z_885255829_rc2gk1a9xltd_rtrmadp_0_space-warfare.jpeg?v=1753301789&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T23:44:32.000Z",
      "dateModified": "2025-12-19T23:44:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shoppers are focusing on quality, not deals, in the final days before Christmas",
    "url": "https://www.cnbc.com/2025/12/19/christmas-shoppers-focus-on-quality-rather-than-deals.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240950-1765493235313-gettyimages-2250706012-AFP_87VJ8ZY.jpeg?v=1765493301&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T23:36:42.000Z",
    "description": "watch nowWhile discounts drove purchasing in the early days of the holiday shopping season, consumers are shifting into more thoughtful, quality gifts",
    "body": "watch nowWhile discounts drove purchasing in the early days of the holiday shopping season, consumers are shifting into more thoughtful, quality gifts in the back half of the season as total spending growth slows.U.S. consumers had spent $187.3 billion so far online between Nov. 1 and Dec. 12, up 6.1% from the same stretch last year, according to Adobe Analytics. Total holiday season e-commerce spend is still expected to cross $253 billion, which would be 5.3% above last year, with the growth rate slowing later into December as delivery in time for Christmas gets tighter. E-commerce sales typically \"slow sharply\" from about Dec. 16 to Dec. 18, and then \"decline rapidly\" in the ensuing days, until Christmas Eve is the slowest shopping day of the season, Casey Armstrong, chief marketing officer for ShipBob, told CNBC. Armstrong said shopping picks up again on Dec. 27, which is typically the strongest day for ShipBob's customers late in the season. The company is a third-party logistics firm that ships for small, medium and social-oriented brands. A shopper carries packages in Union Square in San Francisco, Dec. 11, 2025.David Paul Morris | Bloomberg | Getty ImagesFor shoppers who are willing to order online in the back half of the season, quality, rather than discounts, is driving interest. Captify analyzes more than 1 billion search events per day from 3 million websites, and it shows outsize search growth in apparel and athleisure brands including Alo Yoga, Warby Parker, Aritzia, Bombas and Quince into December compared to earlier in the season. Searches for Alo Yoga rose 256% for the period between Dec. 7 and Dec. 15 compared to the stretch from Nov. 28 to Dec. 6. Quince searches are up 124% for those same time frames. \"These gains point to a rise in thoughtful, quality-driven gifting as shoppers seek products from highly regarded brands\" said Oscar Chow, Captify head of insights for the U.S.RetailNext, which tracks in-store shopping, has also seen evidence of consumers valuing quality this season, even if that means buying fewer items. \"Consumers are willing to pay more to get those decisions right\" said Joe Shasteen, global manager of advanced analytics at RetailNext. The firm expects this dynamic to peak in the days leading up to Christmas.There is also evidence showing a shift toward gifting experiences and subscriptions as the season winds down. Chow said they offer shoppers a \"deadline-proof gift.\"Examples include growth in interest in the later weeks of the season for Roblox Robux, Cameo Kids, Kindle Unlimited, Strava Subscription, Peloton All-Access, MasterClass subscriptions and the Disney+, Hulu and HBO Max subscription bundle.Discounts are still available as holiday shopping winds down, but they're much lower than during Cyber Week highs. Adobe Analytics said toys will see the biggest promotions, peaking at 15% off list price in December, followed by furniture, bedding and televisions at 10% off.To be sure, there are discount-motivated consumers throughout the season, which makes toys a strong category. Data from Adobe and Captify show consumers are still seeking out Mattel's Barbie Dreamhouse, Disney's Stitch toys, and Play-Doh sets, among others. Armstrong said the Toniebox 2 audio player and the Ms. Rachel Tonies figurine is \"a top item driving buzz\".Stores save ChristmasA woman holds shopping bags as people make their way through Herald Square on Dec. 11, 2025 in New York City. Angela Weiss | AFP | Getty ImagesFor those that want a physical gift to give, stores are critical in the days leading up to Christmas.The last Saturday before Christmas has been coined \"Super Saturday\" by the retail sector and is often one of the top store shopping days of the year. But with Christmas landing on a Thursday this year, the volume will likely be lower on Super Saturday this year than on Dec. 22 through Dec. 24, according to RetailNext. \"We expect some of the highest conversion rates of the season to occur in the final days before Christmas, potentially rivaling or even surpassing Black Friday,\" Shasteen of RetailNext said. The warmer temperatures and dry conditions hitting much of the country this weekend should also help lift store traffic this weekend, according to Evan Gold, Planalytics executive vice president of global partnerships and alliances.Shoppers who don't want to navigate stores, but also don't want to chance shipping timelines, are increasingly using buy online, pick up in store options in the final stretch of the holiday shopping season. Adobe Analytics predicts BOPIS will peak on Dec. 22 and Dec. 23, with 32% to 37% of e-commerce orders utilizing the service, a spike in typical usage from the rest of the year.Kohl's told CNBC its pickup orders more than double in the week leading up to Christmas and that a quarter of shoppers who pickup an online order end up buying something else while they are there. At Bath and Body Works, about 30% of customers picking up online orders add something before checkout. It's also a cost savings for retailers to fulfill online orders from stores. Target has said order pickup or drive-up saves the retailer 90% over brown-box delivery from fulfillment centers. So far this season, three-quarters of its digital orders have been picked up from stores.Walmart told CNBC last year that weekly scheduled pickup volume increased 14% in the two weeks leading up to Christmas compared to the average volume in the prior 12 weeks. More than 80% of Walmart customers say they shop in-store in the three days before Christmas, according to its customer insights and strategy holiday pulse tracker conducted this month.Last December, volumes of Walmart Express Delivery, orders fulfilled from store inventory that come with an extra fee, reached 2.5 times the monthly average. The retailer said on Christmas Eve alone, 77% of digital orders were fulfilled via the express option.While Dick's Sporting Goods declined to share specifics, the retailer said it sees a \"significant uptick in BOPIS\" as Christmas nears, and it also sees an \"attach rate\" for shoppers \"to make sure they grab those last-minute gifts on a single trip to the store.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shoppers are focusing on quality, not deals, in the final days before Christmas",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240950-1765493235313-gettyimages-2250706012-AFP_87VJ8ZY.jpeg?v=1765493301&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T23:36:42.000Z",
      "dateModified": "2025-12-19T23:36:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UnitedHealth Group commits to improvements after independent audit, patient backlash",
    "url": "https://www.cnbc.com/2025/12/19/unitedhealth-group-results-independent-audit-investigation.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240926-17654900472025-12-11t214140z_538099618_rc2jeiaiann8_rtrmadp_0_health-unitedhealth.jpeg?v=1765490122&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T14:25:37.000Z",
    "description": "UnitedHealthcare sign is displayed at its office building in Minnetonka, Minnesota, U.S., Dec. 11, 2025. Tim Evans | ReutersUnitedHealth Group on Frid",
    "body": "UnitedHealthcare sign is displayed at its office building in Minnetonka, Minnesota, U.S., Dec. 11, 2025. Tim Evans | ReutersUnitedHealth Group on Friday released the first results from a sprawling independent audit of its business practices and committed to a wide range of steps to track and implement improvements in three specific areas. The health-care giant said it has adopted 23 ongoing \"action plans\" to put in place and monitor recommended improvements, with oversight by its internal audit and advisory services team. Around 65% of those actions will be complete by the end of 2025, while 100% of those plans will be finished by the end of March next year. The results come as private insurers try to rebuild trust with the American public after fierce, pent-up backlash over their practices and the broader U.S. health-care system. Critics say insurer business tactics have made it harder for some patients to access and pay for care. The company owns UnitedHealthcare, the nation's largest and most powerful insurer. While the announcement on Friday is a step toward improving the business, it's unclear how much it will change the public's view on the company and the broader industry.UnitedHealth in July announced that two independent consultancies had launched a third-party review of its business policies and performance metrics. That same day, UnitedHealth also confirmed that it is facing Department of Justice investigations over its Medicare billing practices. The independent audit marked one of Steve Hemsley's earliest steps as CEO after he took the reins in May, following the abrupt departure of Andrew Witty.\"We hope that you see these assessments as a commitment to setting a new standard of transparency for the health care marketplace, as we believe that you and every person who engages with our health system deserves to understand how we go about our work,\" Hemsley said in a letter Friday. \"We know that our actions and decisions have significant impacts on patients, care providers and the broader health system, and we are determined to hold ourselves to the highest standard,\" he added. FTI Consulting reviewed UnitedHealthcare's approaches to risk assessment operations within its Medicare Advantage programs, which refers to how the company rates the health status of members in those privately run plans. The firm also examined the company's care services management policies, procedures and processes. Consulting firm the Analysis Group also assessed the policies and processes of Optum Rx – the company's pharmacy benefit manager, or PBM  – for ensuring prescription discounts from drug manufacturers are \"accurately collected and distributed to clients.\" PBMs are middlemen who negotiate rebates with drug manufacturers on behalf of insurers, create lists of medications covered by insurance and reimburse pharmacies for prescriptions.Hemsley said the firms determined that the company's policies and practices are \"robust, rigorous and generally sound; and, in many respects, industry leading.\" But he noted that they also provided recommendations for improvements. For example, a review by the Analysis Group found that OptumRx has \"implemented a comprehensive and well-structured framework that governs all stages of manufacturer discount administration.\" More CNBC health coverageThe Trump administration is changing Covid, childhood vaccine recommendations – here's what it means for youU.S. to impose 100% tariff on branded, patented drugs unless firms build plants locally, Trump saysEli Lilly to build $6.5 billion Texas manufacturing facility for obesity pill, other drugsThe assessment identified at least 25 distinct \"controls\" in place that collectively lower the risk of miscalculating or delaying the distribution of discounts owed to clients and collecting incomplete discounts from drugmakers, said Aaron Yeater, managing principal at the Boston office of Analysis Group, in a document Friday. The review found \"no deficiencies or need for corrective measures\" but recommended ways to enhance Optum Rx's practices. That includes strengthening Optum Rx's escalation processes for resolving nonpayment and dispute cases through communication with manufacturers. Among UnitedHealth's action plans is to develop a formal policy that supports procedures for addressing those cases. Yeater noted that he examined the business processes and not the legal and regulatory issues the company is facing with its PBM. Meanwhile, FTI Consulting found that UnitedHealth scored better than its peers by several measures when it came to Medicaid and Medicare. But the firm pointed to slow decision-making on authorizations, documentation issues and the need to better address the findings raised in regulatory audits. Beyond these first results, UnitedHealth said it will share the findings from a review of medical records of diagnosis codes during the first quarter. The company will also report on its processes to craft what it calls \"evidence-based medical policy\" by the middle of the year. Shares of UnitedHealth Group are down more than 35% for the year after it suspended its 2025 forecast amid skyrocketing medical costs, announced the surprise exit of Witty and grappled with the probes into its Medicare Advantage business. It followed a difficult 2024 marked by a historic cyberattack and public blowback after the murder of UnitedHealthcare's CEO, Brian Thompson.Correction: UnitedHealth Group had a difficult 2024. An earlier version misstated the year. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UnitedHealth Group commits to improvements after independent audit, patient backlash",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240926-17654900472025-12-11t214140z_538099618_rc2jeiaiann8_rtrmadp_0_health-unitedhealth.jpeg?v=1765490122&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T14:25:37.000Z",
      "dateModified": "2025-12-19T14:25:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Data center deals hit record $61 billion in 2025 amid construction frenzy",
    "url": "https://www.cnbc.com/2025/12/19/data-center-deals-hit-record-amid-ai-funding-concerns-grip-investors.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218278-1761690885230-aws-ss3.png?v=1761691961&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T10:59:21.000Z",
    "description": "Global data centers dealmaking surged to hit another record high this year, driven by a rush to build out the infrastructure required for energy-inten",
    "body": "Global data centers dealmaking surged to hit another record high this year, driven by a rush to build out the infrastructure required for energy-intensive AI workloads.That surge came even as investors grew increasingly wary of inflated artificial intelligence valuations and the financing underpinning the rapid expansion of data centers. Global stocks sold off in November as worries of an AI-fueled bubble persisted.But S&P Global reported that more than $61 billion has flowed into the data center market this year, up slightly from $60.8 billion last year, amid what it called a \"global construction frenzy.\"A surge in debt financing contributed to the record high as hyperscalers increasingly tap private equity markets rather than funding the expensive infrastructure themselves. That trend has sparked concerns from some investors as they question the value of the advanced tech that data centers house.Shares of cloud company Oracle fell 5% on Wednesday following a report that Blue Owl Capital was pulling out of a deal to back a $10 billion data center in Michigan. Oracle has denied the report, but Broadcom, Nvidia and Advanced Micro Devices retreated after it was published. The Nasdaq Composite lost 1.81% in its worst day in nearly a month.Iuri Struta, TMT analyst at S&P Global Market Intelligence, said his team expects market concerns around AI and Oracle to be temporary and unlikely to have a \"massive impact\" on data center buildout and M&A in the near future.\"The competitive dynamic among frontier AI model providers, like OpenAI, Alphabet and Anthropic, is changing quickly, and this can have an impact on investor sentiment in public markets. But overall, we see demand for AI applications continuing to grow strongly in 2026.\"watch nowDespite the recent pullback in AI stocks, many analysts remain bullish on the sector. ING expects secular trends to point to healthy investment levels in 2026 driven by AI advancements and growing public and private support for digital innovation.\"There are two sides to the development of AI, one that would cater for optimism such as faster development of medicine and at the same time there would be concerns typically around (public) safety,\" Wim Steenbakkers, global head of datacenters and technology at ING, told CNBC.\"Hence uncertainty remains around the monetisation of the technology and business models. Questions around the high levels of investment will only be answered in the future when the uncertainties diminish and the applications of the technology and its advantages become clearer.\"There were more than 100 data center transactions in the first 11 months of the year, whose total value already exceeds all the deals done in 2024, according to S&P Global Market Intelligence data. The majority of those deals took place in the U.S., followed by the Asia-Pacific region.\"In Europe, the buildout of data centers is expected to grow at a lower rate than other regions, but it remains to be seen if this results in an M&A rush amid scarcity of assets,\" Struta said.The pace of growth in the U.S. is leaving Europe \"in the dust\" according to a recent report from ING which predicted data center investment in the U.S. could be fivefold higher. Growth is also increasingly coming from the Middle East, as the wealthy Gulf States look to position themselves as the next global AI hub.Debt issuance nearly doubles in 2025Debt issuance nearly doubled to $182 billion in 2025, up from $92 billion last year, according to the data from S&P. It noted that Meta and Google were among the most active issuers, with Facebook's owner raising $62 billion in debt since 2022 — nearly half of that total was issued in 2025 alone.Google and Amazon raised $29 billion and $15 billion, respectively, according to the report, which noted that hyperscalers are increasingly working with AI labs to buy assets to finance construction in an \"unusual arrangement\" that underscores the significant capital required to meet demand.Struta expects more \"robust\" M&A investment activity in the data center space in 2026.\"I wouldn't be surprised if already high valuations get even higher,\" he told CNBC. \"The buildout of new data centers can be temporarily tempered by a lack of energy supply, making already built data centers more valuable. As the availability of large data center companies remains scarce, we could see more asset sales by companies that don't view data centers as their core business.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Data center deals hit record $61 billion in 2025 amid construction frenzy",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218278-1761690885230-aws-ss3.png?v=1761691961&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T10:59:21.000Z",
      "dateModified": "2025-12-19T10:59:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NY Fed President Williams says some 'technical factors' distorted November's CPI reading downward",
    "url": "https://www.cnbc.com/2025/12/19/ny-fed-president-williams-says-some-technical-factors-distorted-novembers-cpi-reading-downward.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229871-1763730470574-gettyimages-2233025865-WILLIAMS_ECNY.jpeg?v=1766151272&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T15:48:35.000Z",
    "description": "watch nowNew York Federal Reserve President John Williams said Friday that \"technical factors\" likely distorted November's inflation data, pushing the",
    "body": "watch nowNew York Federal Reserve President John Williams said Friday that \"technical factors\" likely distorted November's inflation data, pushing the headline reading lower than it otherwise would have been.\"There were some special factors or practical factors that really are related to the fact that they weren't able to collect data in October and not in the first half of November. And because of that, I think the data were distorted in some of the categories, and that pushed down the CPI reading, probably by a tenth or so,\" Williams said on CNBC's \"Squawk Box.\"\"It's hard to know, we'll get some when we'll get to December data, I think we'll get a better reading of how much that distortion, how big the effect was, but I do think that that was pushed down a bit by these technical factors,\" he added.The consumer price index rose at a 2.7% annualized rate last month, a delayed report from the Bureau of Labor Statistics showed. Economists polled by Dow Jones expected the CPI to have risen 3.1%.Williams said the data may have a downward bias because it was collected mainly in the second half of November, when sales were widespread, and noted there were also complications with rent and other categories. The New York Fed president said he took some comfort from categories not affected by those issues, seeing cooling price pressures in certain sectors.\"Some of the data that we're seeing is actually pretty encouraging in the sense of the CPI news. and I think it represents a continuation of the disinflationary process we've seen,\" Williams said.Because the October CPI release was canceled, Thursday's report lacked several of the standard data points typically included in a CPI report. The Bureau of Labor Statistics said it could not go back and collect October survey data, though it relied on \"nonsurvey data sources\" to construct the index. As a result, economists may be cautious about interpreting the report as clear evidence that inflation is on a sustained downward path, given the absence of an October comparison. Economists believe some some inputs to the owners' equivalent rent calculation for the canceled October month were estimated by the BLS to have zero inflation, distorting that calculation downward.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NY Fed President Williams says some 'technical factors' distorted November's CPI reading downward",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229871-1763730470574-gettyimages-2233025865-WILLIAMS_ECNY.jpeg?v=1766151272&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T15:48:35.000Z",
      "dateModified": "2025-12-19T15:48:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Starbucks brings in new chief technology officer from Amazon Grocery",
    "url": "https://www.cnbc.com/2025/12/19/starbucks-hires-new-cto-from-amazon-grocery.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107107846-1661255533520-gettyimages-1242665144-zawrzel-starscof220823_np9fW.jpeg?v=1766168355&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T21:12:17.000Z",
    "description": "Anand Varadarajan, Amazon Vice President of product and technology and worldwide grocery stores speaks during the Delivering the future conference in ",
    "body": "Anand Varadarajan, Amazon Vice President of product and technology and worldwide grocery stores speaks during the Delivering the future conference in Mt. Juliet, Tennessee, on October 9, 2024.Seth Herald | Afp | Getty ImagesStarbucks announced Friday that it has hired its new chief technology officer, Amazon veteran Anand Varadarajan. Varadarajan, who spent nearly 19 years at Amazon, most recently led technology and supply chain for the tech giant's worldwide grocery stores business.Varadarajan, who also previously held software engineering roles at Oracle, will begin Jan. 19 as executive vice president and CTO, reporting directly to CEO Brian Niccol, according to a memo. The hire comes after Deb Hall Lefevre, Starbucks' former CTO, departed in September as the company underwent a second round of layoffs and announced a $1 billion restructuring plan as a part of its ongoing turnaround. \"[Varadarajan] knows how to create systems that are reliable and secure, drive operational excellence and scale solutions that keep customers at the center. Just as important, he cares deeply about supporting and developing the people behind the scenes that build and enable the technology we use,\" Niccol wrote in a memo announcing the hiring. At Amazon, Varadarajan had recently been elevated to oversee the worldwide grocery technology and supply chain organizations, which include both its homegrown Fresh brand and Whole Foods. He reported directly to Jason Buechel, Amazon's grocery chief and the CEO of Whole Foods. During his tenure, Amazon has experimented further with grocery tech innovations like a pilot to incorporate mini robotic warehouses in Whole Foods supermarkets that enable consumers to shop both its in-store selection and products from Amazon's wider inventory that aren't typically stocked by the organic grocer.Starbucks, meanwhile, is still in the early stages of a turnaround overseen by Niccol, who took over as CEO in September 2024. In the most recent quarter, Starbucks' quarterly same-store sales returned to growth for the first time in nearly two years, a sign that its strategy is winning over lapsed customers. Holiday sales have also been strong so far this season as the company contends with an ongoing strike of unionized baristas impacting a small number of its stores.Part of that strategy is its hospitality platform, Green Apron Service, which at $500 million is the company's largest investment into labor. The program is backed by changes to ensure proper staffing and better technology to keep service times fast. It was born out of growth in digital orders — which now make up more than 30% of sales — and feedback from baristas.watch now— CNBC's Annie Palmer contributed to this report",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Starbucks brings in new chief technology officer from Amazon Grocery",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107107846-1661255533520-gettyimages-1242665144-zawrzel-starscof220823_np9fW.jpeg?v=1766168355&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T21:12:17.000Z",
      "dateModified": "2025-12-19T21:12:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google's boomerang year: 20% of AI software engineers hired in 2025 were ex-employees",
    "url": "https://www.cnbc.com/2025/12/19/google-boomerang-year-20percent-ai-software-devs-hired-2025-ex-employees.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108198795-1757946595578-gettyimages-2218001070-BLOOMBERG_TECH.jpeg?v=1765922244&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T22:52:52.000Z",
    "description": "Sundar Pichai, chief executive officer of Alphabet Inc., during the Bloomberg Tech conference in San Francisco, California, US, on Wednesday, June 4, ",
    "body": "Sundar Pichai, chief executive officer of Alphabet Inc., during the Bloomberg Tech conference in San Francisco, California, US, on Wednesday, June 4, 2025. David Paul Morris | Bloomberg | Getty ImagesWith the AI talent wars heating up between companies like OpenAI, Meta and Anthropic, one way Google has been competing is by aggressively rehiring former employees.Some 20% of software engineers working on artificial intelligence that Google hired in 2025 were so-called boomerang employees, an increase from prior years, CNBC has learned. A Google spokesperson confirmed the statistic remains accurate as of December, and said the company saw a jump in the number of AI researchers coming from major competitors compared to 2024. \"We're energized by our momentum, compute and talent — engineers want to work here to keep building groundbreaking products,\" the spokesperson said in a statement.John Casey, Google's head of compensation, recently told employees in a meeting about the rehiring. Casey said AI-focused software engineers are drawn to Google's deep pockets and hefty computational infrastructure that's needed to perform advanced AI work, according to audio reviewed by CNBC. Google has a large pool of ex-employees to mine, particularly after its largest ever round of layoffs in early 2023, when parent company Alphabet cut 12,000 jobs, reducing headcount by 6%. That followed a market downturn driven by soaring inflation and rising interest rates. Google has since continued with rolling layoffs and buyouts. Across the industry, employee boomerangs are up, according to data published earlier this year by ADP Research, with the sector it classifies as information showing the starkest numbers. watch nowGoogle has been racing to catch up in generative AI after a slow start that followed OpenAI's release of ChatGPT in late 2022. After fumbling a number of product rollouts, the company has bounced back this year, thanks to hefty investments in AI infrastructure and the success of its Gemini app. Google announced its latest model, Gemini 3, last month. Alphabet's stock price is up more than 60% this year, outperforming all of its megacap peers.As a historical hotbed of engineering and innovation, Google has long been a place where competitors have turned to try and poach talent. That's still the case.Earlier this year, Microsoft hired around two dozen employees from Google's DeepMind AI research lab, CNBC reported in July. OpenAI, meanwhile, has opened its wallet wide, along with Meta. OpenAI CEO Sam Altman told employees in June that Meta had been offering $100 million signing bonuses, and that he was aggressively trying to retain staffers. Late last year, Google brought back a major figure in AI: Noam Shazeer.Shazeer and Daniel De Freitas left Google in 2021 to start AI platform Character.AI, reportedly departing after Google rebuffed their attempts to try and get the company to push its internal chatbot forward. Along with other members of the Character.AI research team, Shazeer and De Freitas rejoined DeepMind in August 2024 under a licensing deal for the startup's technology. Over the past year, Google has taken more risks, shipping products more quickly, even if they aren't viewed as completely ready. Google has also made a companywide effort to remove bureaucracy, enacting widespread employee buyouts and eliminating more than one-third of its managers overseeing small teams, CNBC reported in August.Google co-founder Sergey Brin, who came out of retirement in 2023, has at times personally reached out to prospective candidates to recruit them, according to people familiar with the matter who asked not to be named because they weren't authorized to speak to the media. Meta CEO Mark Zuckerberg has also reportedly reached out to researchers on behalf of his company.WATCH: OpenAI's Sam Altman says Google is still a huge threatwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google's boomerang year: 20% of AI software engineers hired in 2025 were ex-employees",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108198795-1757946595578-gettyimages-2218001070-BLOOMBERG_TECH.jpeg?v=1765922244&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T22:52:52.000Z",
      "dateModified": "2025-12-19T22:52:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Palo Alto Networks announces multibillion-dollar deal with Google Cloud",
    "url": "https://www.cnbc.com/2025/12/19/palo-alto-networks-google-cloud-ai-threats.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108187120-17555215432025-08-18t075037z_2134280156_rc2j9ga8302u_rtrmadp_0_palo-alto-networks-results.jpeg?v=1755521639&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T19:20:48.000Z",
    "description": "Dado Ruvic | ReutersPalo Alto Networks will migrate key internal workloads to Google Cloud as part of a new multibillion-dollar agreement, the compani",
    "body": "Dado Ruvic | ReutersPalo Alto Networks will migrate key internal workloads to Google Cloud as part of a new multibillion-dollar agreement, the companies announced Friday.The companies said the deal is an expansion of their existing strategic partnership and will deepen their engineering collaboration. Palo Alto Networks is now using Google's Gemini artificial intelligence models to power its copilots, and it is also using Google Cloud's Vertex AI platform, according to a release.  \"Every board is asking how to harness AI's power without exposing the business to new threats,\" BJ Jenkins, president of Palo Alto Networks, said in a statement. \"This partnership answers that question.\"Read more CNBC tech newsGoogle and Nvidia VC arms back vibe coding startup Lovable at $6.6 billion valuationMetaX and Moore Threads' IPOs underscore Chinese chipmakers' growing challenge to NvidiaInstacart shares drop on report that FTC is probing company over AI pricing toolAmazon says AI chief Rohit Prasad is leaving, Peter DeSantis to lead 'AGI' groupPalo Alto Networks, which offers a range of cybersecurity products, already has more than 75 joint integrations with Google Cloud and has completed $2 billion in sales through the Google Cloud Marketplace.As part of the new phase of the partnership, Palo Alto Networks customers will be able to protect live AI workloads and data on Google Cloud, maintain security policies, accelerate Google Cloud adoption, and simplify and unify their security solutions, the companies said. Palo Alto Networks' shares were up nearly 1% on Friday. Shares of Google parent Alphabet rose less than 1%. \"This latest expansion of our partnership will ensure that our joint customers have access to the right solutions to secure their most critical AI infrastructure and develop new AI agents with security built in from the start,\" Google Cloud President Matt Renner said in a statement.WATCH: Google unveils ‘Gemini 3 Flash’ AI model focused on speed and costwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Palo Alto Networks announces multibillion-dollar deal with Google Cloud",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108187120-17555215432025-08-18t075037z_2134280156_rc2j9ga8302u_rtrmadp_0_palo-alto-networks-results.jpeg?v=1755521639&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T19:20:48.000Z",
      "dateModified": "2025-12-19T19:20:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wall Street banked on a flurry of deals under Trump in 2025. It wasn't that simple",
    "url": "https://www.cnbc.com/2025/12/19/wall-street-deals-2025-trump-tariffs-uncertainty.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108070888-1733274802301-gettyimages-1229038380-mcgrego_snowstorm111618_22.jpeg?v=1766078954&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T20:12:42.000Z",
    "description": "The Wall Street Bull statue covered in snow on Nov. 15, 2018.Erik Mcgregor | Lightrocket | Getty ImagesWall Street expected U.S. mergers and acquisiti",
    "body": "The Wall Street Bull statue covered in snow on Nov. 15, 2018.Erik Mcgregor | Lightrocket | Getty ImagesWall Street expected U.S. mergers and acquisitions to roar back in 2025. The reality was something closer to fits and starts.  Following the election of President Donald Trump more than a year ago, executives and bankers prepared for a looser regulatory environment and a robust pipeline for mergers and acquisitions. Instead, they were met with tariff uncertainty, high interest rates, and an unpredictable process for winning over the Trump administration and getting deal approval. While the year saw high-profile megadeals inked — Union Pacific's proposed acquisition of Norfolk Southern for $85 billion; Netflix's proposed takeover of Warner Bros. Discovery's streaming and studio assets for $72 billion; the pending take-private of Electronic Arts for roughly $50 billion — generally, U.S. deal volume was down year over year, according to Pitchbook data. \"When you read the headlines they seem to suggest there has never been a better M&A market in the history of the planet. And while that's true in some ways, when you get underneath the front page headlines and these massive transactions ... you see a less active market,\" said Benjamin Sibbett, co-head of the Americas M&A practice at Clifford Chance.Through Dec. 15 this year, there were roughly 13,900 transactions in the U.S., compared with 15,940 deals  during the same period in 2024, the last year of the Biden administration, according to Pitchbook data. Deal value, however, was up, boosted by high-dollar-figure agreements: The 2025 deals tracked by Pitchbook totaled roughly $2.4 trillion in value, compared with roughly $1.83 trillion in 2024. The data represents both corporate M&A and private equity buyout activity and considers both announced and closed transactions. In particular, middle-market deal volume was low this year with those large M&A transactions padding the stats, according to a S&P Global analysis of deal-making as of November. \"This has been a decade-high level of megadeals, double the number of deals from last year. When you look at the importance of scale, it's been an all-time record in terms of the premium that the market has given to scale,\" said Anu Aiyengar, JPMorgan's global head of advisory and M&A, on a recent JPMorgan podcast episode. Over the last 10 years, 2021 remains the biggest year on record for U.S. deal activity, a reflection of low interest rates at the time. By this point in the year in 2021, there were 19,666 deals recorded with a total valuation of roughly $5.55 trillion, according to Pitchbook. Executives, lawyers and bankers like Aiyengar note that the sluggishness in deal-making this year took place primarily in the first half of the year as Trump's rolling tariff announcements roiled the financial markets and industry leaders tried to make sense of the effects. Uncertain timesU.S. President Donald Trump delivers remarks at the White House in Washington, D.C., on April 2, 2025.Brendan Smialowski | Afp | Getty ImagesEarly in the year, consultants and bankers across sectors agreed that the Trump administration would make for smoother deal-making and a friendlier regulatory environment after a number of big consumer deals were squashed by President Joe Biden's Federal Trade Commission. Then came Trump's trade war and his so-called liberation day tariffs. Trump's April announcement of \"reciprocal tariffs\" on more than 180 countries left executives with an unclear path forward. \"Macroeconomic uncertainty\" became an often-used phrase in company updates and on investor calls as executives were hesitant to make plans or offer guidance without a clear understanding of how the future with tariffs would play out. \"We knew there was going to be some disruption with tariffs, but probably not to the extent that sort of slowed things down,\" KPMG partner and U.S. automotive leader Lenny LaRocca told CNBC of deal-making in that sector. \"With all that uncertainty around where things were going to land, I think it just put a big pause on M&A in general.\"In addition to automakers, retail and consumer companies bore the brunt of the uncertainty as they navigated whether and how to pass on undetermined higher costs to already-burdened shoppers. Overall deal value in the consumer space was 17% lower during the first three quarters of 2025 than the same period a year prior, according to an October report from Boston Consulting Group. Meanwhile transactions by deal value grew in the industrials, energy and health-care sectors, the study found. Through mid-December, there were 227 U.S. deals in the retail space, compared with 296 in the prior year period, according to Pitchbook. The combined valuation of deals, however, was more than $40 billion year to date, compared with roughly $28.4 billion at the same point in 2024, Pitchbook found. Add in the rise of artificial intelligence, which has commanded major spending by companies across the board, and still-high Federal Reserve interest rates that make borrowing more expensive, and the deal-making equation was even trickier for much of the year. \"That has felt like a bit of a roller-coaster ride,\" said Kevin Foley, JPMorgan's global head of capital markets, on its recent podcast. \"We went through that six-week pause post-liberation day ... and then after that, the level of uncertainty, at least the perception of it, started to fade. \"The sentiment became more positive, benefiting from the fact that you've got the secular tail winds of what's happening with AI investments, the anticipation of the Fed being more supportive, along with a pro-business fiscal policy out of this administration,\" Foley said. \"All of that had a very positive impact on sentiment in both the equity and debt markets.\"Last week the Fed approved its third rate cut this year, but the central bank committee's vote signaled a tougher road ahead for more reductions. While Trump continues to pressure the Fed to bring rates down further, he's also exerting his influence in other arenas and keeping industries guessing. Policy playbookAhead of Trump taking office for his second term, automotive industry insiders and onlookers believed the auto supplier industry was ripe for consolidation. The sector was coming off years of turmoil due to parts shortages and an industrywide move toward electrification.But the end of federal tax credit programs for all-electric vehicles caused many companies to reverse course on EVs and redesign their lineups yet again. Ford Motor on Monday said it would take a $19.5 billion write-down tied to changing plans on electric vehicles. That policy shift and need for automakers to adjust to tariffs and higher costs slowed transactions in the sector.There were more than 8,800 deals globally last year involving industrial manufacturing, which includes automotive, totaling $303.7 billion, according to advisory firm KPMG. The number of deals increased 3.1% from the prior year but notably fell during the fourth quarter of last year – a trend that continued into 2025.Through the third quarter of this year, deals in the automotive industry represented the largest decline by volume of KPMG's industrial manufacturing sectors, off 19.9% year over year compared with a 3.6% decline in the broader category, which also includes aerospace, transportation and logistics and other manufacturing sectors. LaRocca said he believes the broad pullback in EVs, as well as slowing industry sales and a need for diversification, will drive an uptick in deals in the coming year following this year's lull. \"If volumes aren't growing, you can't sit still, you've got to think about what other deals you can do,\" LaRocca said. \"Everybody needs to, I think, be thinking very strongly around consolidation to continue to grow.\"In media, it's a similar story. Media companies are antsy for consolidation but have faced choppy seas in trying to get deals approved by the Trump administration. Broadcast stations owner Nexstar Media Group is awaiting federal regulation changes (or substantial waivers) to complete its proposed $6.2 billion acquisition of Tegna. While Federal Communications Commission Chairman Brendan Carr has shown support for removing the decades-old rules, change has been slow to come, and Trump has more recently come out against broadcast tie-ups. Earlier in the year, Trump's crusade against diversity, equity and inclusion programs also appeared to play a role in winning regulatory approvals. Verizon ended its DEI policies to usher through FCC approval of its $20 billion acquisition of broadband provider Frontier Communications. David Ellison, chairman and chief executive officer of Paramount Skydance Corp., center, outside the New York Stock Exchange (NYSE) in New York, US, on Monday, Dec. 8, 2025.Michael Nagle | Bloomberg | Getty ImagesThe merger of Paramount Skydance closed this summer after nearly a year in limbo. In the official blessing of approval from the FCC, Carr noted that Skydance didn't have any DEI programs and had agreed not to establish any such initiatives as a new company. Paramount had previously ended its DEI politics due to Trump's executive order to ban such initiatives.The Paramount Skydance deal also notably received regulatory approval shortly after Paramount agreed to pay $16 million to Trump after he sued the company's CBS over the editing of a \"60 Minutes\" interview with former Vice President Kamala Harris. Paramount Skydance is now endeavoring another tie-up, this time with Warner Bros. Discovery. Paramount launched a hostile bid for WBD shortly after Netflix announced a deal to buy the legacy media company's streaming and studio assets after a monthslong bidding war. Paramount Skydance has argued it has a higher likelihood of receiving regulatory approval from the Trump administration than Netflix. WBD told shareholders to reject the offer this week. 'The window is open' In the second half of the year, deal activity picked up and Wall Street leaders appeared to settle into a new normal under the Trump administration. Even in the biotech and pharmaceutical industry — which spent most of the year reeling from various Trump administration policies, including tariffs and a sweeping upheaval of federal agencies under Robert F. Kennedy Jr. — there was more activity in middle-market transactions into the final months of 2025. Tim Opler, a managing director in Stifel's global health-care group, noted more buyouts of smaller biotech firms by large drugmakers. And while activity didn't reach the frenzied heights of 2021, several factors have driven a resurgence in deal-making. That includes big pharma's need to fill revenue gaps from expiring drug patents toward the end of the decade, strong company cash reserves and promising innovation.Many of the \"big uncertainties\" around geopolitical issues also \"seem to be all priced in now to a large extent,\" Arda Ural, EY's Americas life sciences leader, told CNBC.US Secretary of Health and Human Services Robert F. Kennedy Jr. speaks in the Oval Office during an event with President Donald Trump at the White House in Washington, DC on Nov. 6, 2025.Andrew Caballero-Reynolds | AFP | Getty ImagesPharmaceutical companies have also shown an increased interest in deals with Chinese biotechs, even as Trump and U.S. policymakers pursue protectionist policies in technology like AI and semiconductors.Pfizer, for example, struck an up to $6 billion deal with Chinese biotech 3SBio to license its cancer drug.Meanwhile, pharmaceutical companies are keen to expand in red-hot areas such as obesity, including the drugmakers that already dominate that space. Pfizer recently won a takeover war with Novo Nordisk over the obesity biotech Metsera, whose pipeline includes potential once-monthly treatments.A busier end to the year is leading many to predict a more active 2026 for M&A across the board. This is particularly true of the banking sector, which showed the most signs of life outside of megadeal activity. \"Clients began the year with cautious optimism, quickly adapting to persistent tariff, macroeconomic and geopolitical uncertainties,\" said Dorothee Blessing, JPMorgan's global head of investment banking coverage on a recent podcast. \"But as the year progressed, uncertainty became more part of the business-as-usual environment.\"The number of announced deals among banks surged by 88% in the second half of this year, while the total size of transactions nearly quadrupled to $39 billion, according to Stephens banker Frank Sorrentino, who cited S&P Global Market Intelligence data.A consolidation in regional banks especially has been driven in part by the arrival of activist investors like HoldCo, who this year has taken on lenders with more than $200 billion in combined assets so far, CNBC has reported. The hedge fund pressured Comerica to find a buyer in the weeks before it agreed to sell itself to rival Fifth Third for $10.9 billion in the biggest bank merger of the year.\"There was a lot of enthusiasm at the end of last year that the regulatory environment was finally going to loosen up, and that absolutely happened,\" Sorrentino said. \"The time it takes to get a deal approval has probably been cut in half; I've never seen anything like it.\"The window for healthy deal activity could last another year or two, according to Sorrentino, who said that he expects some banks will even pull off two or three acquisitions over the next 12 months.\"Deals are getting approved at record speed, and the types of deals getting approved now would never have gotten approval under the last administration,\" he said.Investors are now wondering if big banks will announce deals of their own, either to plug holes in their product offerings, or even attempting the combination of two large institutions, said Truist analyst Brian Foran.\"The window is open,\" Foran said. \"It feels like everyone's looking at their options right now.\"— CNBC's Gabrielle Fonrouge, Michael Wayland, Annika Kim Constantino and Hugh Son contributed to this article. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wall Street banked on a flurry of deals under Trump in 2025. It wasn't that simple",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108070888-1733274802301-gettyimages-1229038380-mcgrego_snowstorm111618_22.jpeg?v=1766078954&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T20:12:42.000Z",
      "dateModified": "2025-12-19T20:12:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Inside Intel’s new Arizona fab, where the chipmaker’s fate hangs in the balance",
    "url": "https://www.cnbc.com/2025/12/19/intel-aims-to-find-clients-and-catch-tsmc-with-new-chip-fab-in-arizona.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108243967-1766101436309-Katie_Lea_5.jpg?v=1766116700&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-19T13:00:01.000Z",
    "description": "watch nowIntel was once the world's largest semiconductor company, but its market cap plummeted in recent years as the chipmaker fell behind Taiwan Se",
    "body": "watch nowIntel was once the world's largest semiconductor company, but its market cap plummeted in recent years as the chipmaker fell behind Taiwan Semiconductor Manufacturing Co. and spent billions of dollars trying to catch up. Now, Intel has entered high-volume production of 18A, the new chip node it says will turn things around.The biggest problem? Convincing a big chipmaker to trust Intel with manufacturing on the new node. For now, Intel's only major customer is itself. The company's long-awaited Core Ultra series 3 PC processor, code-named Panther Lake, will come to PCs in January as the first major product made on 18A.\"It's become an internal node for now,\" said Daniel Newman, CEO of Futurum Group. \"So many companies have made such massive investments into TSMC to ensure yield, to ensure capacity wafers that they just will not make the switch just yet.\"Intel is pinning its hopes of attracting customers on a new chip fabrication plant, Fab52, in Chandler, Arizona, where CNBC got an exclusive on-camera tour in November. Some 50 miles north, in Phoenix, TSMC also has a new fab, where it's making chips with 4 nanometer technology. Its most advanced 2nm tech is currently only made in Taiwan.Intel's 18A is generally on par with TSMC's 2nm node in some metrics such as transistor density. But as Intel works out the kinks after years of delays on previous nodes, some 18A wafers have had defects, making for a lower number of usable chips per wafer, typically referred to as yield.\"Yields are always an issue at the advanced node. This is not an uncommon problem,\" said Harvard Business School professor David Yoffie, who served on Intel's board from 1989 to 2018. He pointed to early yield issues with Nvidia's Blackwell GPUs at TSMC that were quickly fixed.Intel's renewed focus on foundry — manufacturing chips for outside clients — came when Pat Gelsinger took the helm as CEO in 2021. Gelsinger was pushed out last December and replaced by Lip-Bu Tan in March. \"Over the past several years, the company invested too much, too soon – without adequate demand,\" Tan wrote in a memo in July. Intel's campus in Chandler, Arizona, now includes five chip fabrication plants, with Fab52 being the newest addition, shown here on November 17, 2025. Tony PuyolWith Intel awaiting a big outside customer, the U.S. government stepped up in August, taking a 10% stake in the company with an $8.9 billion investment, primarily coming from grants promised under the CHIPS Act signed by President Joe Biden in 2022.Days earlier, SoftBank invested $2 billion in Intel, followed by a $5 billion investment in September from Nvidia, which agreed to use some Intel technology but didn't commit to using its foundry.Here's a look behind the curtain of Intel's new chip factory where it hopes to find major foundry customers and, with them, redemption.Fall of a giantFounded in 1968 by Silicon Valley chip pioneers Robert Noyce and Gordon Moore and legendary investor Arthur Rock, Intel brought the world's first commercially available microprocessor to market just three years later. From the late 1970s through the early 2000s, Intel pumped out increasingly advanced process nodes at a rapid pace, leading to the term \"Moore's Law\" — the doubling of components on a chip every couple years.\"The 1990s was a period of wonder and excitement at Intel,\" Yoffie said. \"We were the world's largest semiconductor company, the world's most profitable.\"But Intel largely missed the mobile revolution, famously turning down a deal to make Apple's processors for the original iPhone. Then came a whiff in AI.In 2024, Intel saw its worst year ever, losing about 60% of its value. The plunge came after two of its previous chip nodes, 10nm and 7nm, were delayed by several years. Analysts say the delays may have been triggered by an earlier choice to hold off on using ASML's costly Extreme Ultraviolet Lithography machines. \"I think we lost the discipline of cycle time,\" said client computing head Jim Johnson, who joined Intel more than 30 years ago. \"Cycle time requires you to commit and deliver, and we started talking ourselves into, hey, we can have longer cycle times and try and lift more or do more.\"As it hustles to get back on track, Intel told CNBC there will be at least 15 EUV machines in Fab52.Intel 18A production manager Lea Tensuan shows CNBC's Katie Tarasov the EUV machines inside Fab52 in Chandler, Arizona, on November 17, 2025.By 2021, TSMC had become the node leader, and Intel began to outsource some leading-edge chip production to the Taiwanese giant. Around the same time, Apple began replacing Intel chips in Mac computers with its own M-series chips, also manufactured primarily at TSMC. In his earlier stint at Intel, more than a decade before rejoining as CEO, Gelsinger \"was given the responsibility to build a GPU to compete with Nvidia,\" Yoffie said. \"Unfortunately, that project failed and that ultimately meant we ended up not playing a significant role in the AI revolution.\"Intel may now be considering a deal to buy custom AI chip design startup SambaNova for $1.6 billion, though the company declined to comment on the matter.'Changing our culture'The trademark of Gelsinger's tenure as CEO was Intel's focus on chip manufacturing. His ambitious roadmap had Intel catching back up to TSMC by releasing five nodes in four years.Now, Tan is CEO and Naga Chandrasekaran is in charge of foundry.\"We are making yield improvements, defect density improvements, month-over-month and hitting our goals,\" Chandrasekaran told CNBC in an interview in November. \"So I believe we have turned the corner.\" Chandrasekaran joined Intel last year after more than two decades at leading memory maker Micron. He said his top goal is finding foundry customers.\"I have to become part of their team and convince them that they can trust Intel Foundry to execute,\" Chandrasekaran said. \"That's number one. And to do that, we are changing our culture. We are bringing a huge execution focus internally into Intel Foundry.\" Chandrasekaran told CNBC that Fab52 is capable of more than 10,000 18A wafer starts per week. There's more than a million square feet of manufacturing cleanroom space in Arizona, with five fabs all connected by 30 miles of overhead track moving wafers between them. A sixth fab, Fab62, is expected to be ready around 2028.18A also uses RibbonFet, Intel's gate-all-around architecture that improves power control by fully surrounding the transistor, unlike previous designs that only contact the top and sides. Chandrasekaran said 18A offers \"more than 15% performance per watt improvement\" over Intel 3.Perhaps the biggest way Intel stands out is in advanced packaging, the assembly and connections of chips onto the final systems where they appear in real-world applications. Intel engineer Shripad Gokhale shows CNBC's Katie Tarasov its next Xeon data center chip in Intel's advanced packaging lab in Chandler, Arizona, on November 17, 2025.Tony PuyolCNBC went to Intel's advanced packaging lab in Chandler to see several steps in the process, such as protecting chips with a polymer-based seal, and exposing them to a liquid that detects any defects. Yoffie said Intel's advanced packaging \"can help mitigate some of the power consumption problems.\"\"One of the biggest problems today for everybody making chips for data centers is the power that it consumes,\" Yoffie said.Chandrasekaran said the Arizona fab is on almost 100% renewable energy. As for water, Intel's Arizona facilities used more than 3 billion gallons in 2024 and returned 2.4 billion gallons to the local supply through a water recycling plant it has on site. 'No blank checks'Tan's message to employees when it comes to spending on future foundry nodes is clear: \"No more blank checks.\" The company needs customers.Intel's big new Ohio chip fab is delayed until at least 2030, and Tan has made major cost cuts by slashing 15% of the workforce in July and axing projects in Germany and Poland.\"That's what the company needed,\"  said Newman of Futurum. \"It needed to be faster. It needed to be leaner. It needed to be more focused. It needed someone that would be a little bit more shrewd.\"Tan is waiting to see how demand shapes up before giving solid details about Intel's next node, 14A.  Chandrasekaran told CNBC it will first be developed in Oregon, with a goal of volume production in 2028.Finding customers for 18A won't be easy. Unlike TSMC which only makes chips for outside clients, Intel also makes devices powered by its chips, positioning it as a competitor to some of the customers it hopes to land. \"If I'm an Nvidia or AMD or Qualcomm or Broadcom, do you really want to put your secret sauce into a manufacturing operation where you're giving Intel access to that secret sauce?\" Yoffie said.He suggests breaking out foundry into a different company.\"If you actually separated the two, I think you'd give Intel a much better shot at being successful,\" Yoffie said. \"And you'd also give the United States a much stronger position for being the home of a major semiconductor manufacturing organization.\"Intel client computing head Jim Johnson gives CNBC's Katie Tarasov an early look at its Panther Lake CPU in Santa Clara, California, on November 12, 2025.Marc GanleyFor now, Intel hopes Panther Lake will be a big proof point when it debuts in PCs from major companies like Samsung, Dell, HP, Lenovo, Asus and Acer in January. Intel's next data center chip, Xeon 6+, is also made on 18A.\"If you're a major company that wants to bet on a process node, you're going to feel a lot more comfortable if you see Intel ramping the heart of their client product line to high volume on that process node,\" Johnson said.Microsoft and Amazon signed early deals last year committing to use Intel's foundry for some of their in-house custom chips.\"It's a good sign, but of course their volumes are very small relative to Nvidia and the other major chip companies,\" Yoffie said.Recent reports suggest AMD is considering manufacturing at Intel, and one analyst predicts Apple may once again make some Mac chips at Intel by 2027.In the meantime, Intel got a lifeline with the U.S. government's 10% stake.\"It shows the confidence that the U.S. government has in Intel and the belief that we need to have leading edge R&D and manufacturing on U.S. soil,\" Chandrasekaran said.The government investment came days after President Donald Trump called for Tan to resign, then reversed course.\"I worry sometimes about the scope creep here and how the U.S. could decide to take stakes in all kinds of things,\" Newman said. \"But you have industries that we have let leave the U.S. to an extent that put us into indefensible risk, and we need to bring them back.\"Some 92% of the world's most advanced chips are made in Taiwan, following a decades-long decline in the percentage of chips made in the U.S.\"The stakes are incredibly high for Intel, for the U.S. and for the world,\" Yoffie said. \"The whole idea that the world's most advanced products are dependent on a single location in an island a few miles off the Chinese coast is a terrible situation for the whole world to have to deal with.\"Chandrasekaran, for his part, is committed to turning Intel into a manufacturer of advanced chips.\"As a semiconductor community, we have to enable this solution for the world to move forward with AI,\" he said. \"There's no other option than to be successful.\" WATCH:  Inside the Arizona chip fab key to Intel's redemption",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inside Intel’s new Arizona fab, where the chipmaker’s fate hangs in the balance",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108243967-1766101436309-Katie_Lea_5.jpg?v=1766116700&w=1920&h=1080"
      ],
      "datePublished": "2025-12-19T13:00:01.000Z",
      "dateModified": "2025-12-19T13:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]