[
  {
    "title": "Nvidia is partnering with major Indian VC firms in search for the country's next AI start-ups",
    "url": "https://www.cnbc.com/2026/02/18/nvidia-india-ai-vc-data-center-partners.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238981-1765286153900-gettyimages-2153607836-INDIA_YOTTA_NVIDIA.jpeg?v=1771381315&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T03:54:50.000Z",
    "description": "Nvidia H100 chips inside a server room at the Yotta Data Services Pvt. data center, in Navi Mumbai, India, March 14, 2024.Dhiraj Singh | Bloomberg | G",
    "body": "Nvidia H100 chips inside a server room at the Yotta Data Services Pvt. data center, in Navi Mumbai, India, March 14, 2024.Dhiraj Singh | Bloomberg | Getty ImagesAmerican AI chip darling Nvidia is expanding its partnerships in India, including with venture capital firms, as it bets on the country's AI ecosystem that has drawn massive Big Tech investments. The company in statement on Wednesday said it was working with several venture capital firms, including Peak XV, Z47, Elevation Capital, Nexus Venture Partners and Accel India to identify and fund AI startups.This comes as venture capital investors have been increasingly showing interest in India's technology startups, with the country's strong initial public offerings market providing lucrative returns. India is currently holding an AI summit that has seen major tech CEOs as well as heads of states participate in the event. Nvidia top boss Jensen Huang was also expected to attend it but withdrew due to \"unforeseen circumstances.\" More than 4,000 AI startups in India's have already joined Nvidia's global startup program, which helps tech startups build, scale, and go to market, according to the chip designer. The world's largest company by market cap also said it was collaborating with government agencies and research institutions, as well as continuing efforts to build the country's domestic data centers.Nvidia's efforts are framed around New Delhi's \"IndiaAI mission,\" aimed at strengthening the country's AI capabilities and free up funding for its AI entrepreneurs. More broadly, Prime Minister Narendra Modi's government has set goals for India to grow into a global tech superpower. As of September last year, New Delhi had approved $18 billion worth of semiconductor projects as it looks to build a domestic supply chain.Nvidia has also partnered with Indian cloud providers such as Yotta, Larsen & Toubro, and E2E Networks to provide its AI chip clusters and help build data centers in the country.A New Delhi official reportedly said Tuesday that the country expects as much as $200 billion in investments for data centers over the next few years.India's Adani has announced plans to invest $100 billion toward renewable energy-powered AI-ready data centers. American tech firms including hyperscalers Amazon, Microsoft and Google have committed more than $50 billion toward AI infrastructure and chips in the country.Meanwhile, Nvidia said it was also supporting India's AI companies through its \"NVIDIA Nemotron models\" — a family of Nvidia AI models that organizations can use to build new chatbots, agents, and speech systems. These Nvidia models can be used by Indian companies to train new AI systems on India-specific data and language, aligning with the the country's goal of build sovereign AI. Sovereign AI refers to a country's ability to build artificial intelligence based on its own infrastructure, data and industry, so that increasingly critical AI systems don't depend on foreign providers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia is partnering with major Indian VC firms in search for the country's next AI start-ups",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238981-1765286153900-gettyimages-2153607836-INDIA_YOTTA_NVIDIA.jpeg?v=1771381315&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T03:54:50.000Z",
      "dateModified": "2026-02-18T03:54:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CFTC defends its right to prediction market enforcement as states challenge platforms",
    "url": "https://www.cnbc.com/2026/02/17/cftc-defends-prediction-market-enforcement-states-challenge.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108228693-17635888792025-11-19t214628z_803884803_rc2vzhanro2e_rtrmadp_0_usa-congress.jpeg?v=1771349791&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T17:45:51.000Z",
    "description": "Michael Selig, President Donald Trump's nominee to serve as Commodity Futures Trading Commission chairman, testifies in a Senate Agriculture Committee",
    "body": "Michael Selig, President Donald Trump's nominee to serve as Commodity Futures Trading Commission chairman, testifies in a Senate Agriculture Committee hearing on his nomination on Capitol Hill, Nov. 19, 2025.Jonathan Ernst | ReutersThe Commodity Futures Trading Commission filed an amicus brief in federal court on Tuesday to assert the agency's right to enforce prediction markets instead of individual states, according to its new chairman, Michael Selig.Selig argued in a Monday Wall Street Journal op-ed that the CFTC has always had authority over prediction markets and determining whether the event contracts constitute gambling, as critics allege. Selig noted nearly 50 active legal cases against prediction markets and said the CFTC would be stepping in to prevent state encroachment.\"The CFTC will no longer sit idly by while overzealous state governments undermine the agency's exclusive jurisdiction over these markets by seeking to establish statewide prohibitions on these exciting products,\" he wrote.The move comes as prediction markets like Kalshi and Polymarket face legal challenges in multiple states over event contracts. The platforms allow users to bet on the outcomes of events in pop culture, sports, entertainment and more.Critics of prediction markets have argued that the offerings amount to little more than gambling, though Kalshi has defended its platform and argued that it abides by federal regulations. Sports betting on the prediction platforms has drawn comparisons to legalized sports betting in the U.S. In his first public comments as CFTC chairman at the end of January, Selig said he was prepared to draft new, clear rules to govern prediction markets and revisit the agency's rules on involvement in federal and circuit court cases.\"Where jurisdictional questions are at issue, the Commission has the expertise and responsibility to defend its exclusive jurisdiction over commodity derivatives,\" he said at the time.In his Monday op-ed, Selig said event contracts \"serve legitimate economic functions\" and operate under CFTC rules as \"swaps\" rather than gambling. He also posited that trading on event contracts is beneficial for the market and for Americans at large.\"These exchanges aren't the Wild West, as some critics claim, but self-regulatory organizations that are examined and supervised by experienced CFTC staff,\" Selig wrote.In a Tuesday video posted to X, Selig said his message to those who challenge the CFTC's authority is clear: \"We will see you in court.\"\"Today, the CFTC is taking an important step to ensure that these markets have a place here in America and have the integrity and resilience and vibrancy that our derivative markets deserve,\" he said.Selig said the amicus brief would be filed in the Ninth U.S. Circuit Court of Appeals in support of Crypto.com in its dispute with the Nevada Gaming Control Board.CNBC could not verify that the amicus brief had been filed.Disclosure: CNBC and Kalshi have a commercial relationship that includes a CNBC minority investment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CFTC defends its right to prediction market enforcement as states challenge platforms",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108228693-17635888792025-11-19t214628z_803884803_rc2vzhanro2e_rtrmadp_0_usa-congress.jpeg?v=1771349791&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T17:45:51.000Z",
      "dateModified": "2026-02-17T17:45:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump lauds Japan’s pledge to invest $36 billion in U.S. oil, gas and critical mineral projects",
    "url": "https://www.cnbc.com/2026/02/18/trump-us-japan-oil-gas-mineral-projects-trade-deal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266616-1771401074830-gettyimages-2243738157-ah702329_8i2ufjny.jpeg?v=1771401144&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T08:18:37.000Z",
    "description": "U.S. President Donald Trump speaks to journalists aboard Air Force One en route to South Korea on October 29, 2025 in Japan.Andrew Harnik | Getty Imag",
    "body": "U.S. President Donald Trump speaks to journalists aboard Air Force One en route to South Korea on October 29, 2025 in Japan.Andrew Harnik | Getty Images News | Getty ImagesU.S. President Donald Trump has welcomed Japan's pledge to invest nearly $36 billion in oil, gas and critical mineral projects in Texas, Ohio and Georgia. The commitment represents the first tranche of investments by Japan following a landmark trade deal between the two countries, one in which Tokyo pledged to invest $550 billion in American-based projects and Trump cut tariffs on most Japanese imports to 15%.\"Our MASSIVE Trade Deal with Japan has just launched!\" Trump said Tuesday in a social media post.\"The scale of these projects are so large, and could not be done without one very special word, TARIFFS,\" he added. Japanese Prime Minister Sanae Takaichi said the projects strengthen the Japan-U.S. alliance and were expected to bring increased sales and business expansion for Japanese companies.\"We believe these initiatives truly embody the purpose of this Strategic Investment Initiative, namely the promotion of mutual benefit between Japan and the United States, the enhancement of economic security, and the promotion of economic growth,\" Takaichi said in a post on X, according to a Google translation.By far the largest investment is a natural gas facility in Ohio that's expected to generate 9.2 gigawatts of power.U.S. Commerce Secretary Howard Lutnick said the Portsmouth Powered Land Project, valued at $33 billion and operated by SB Energy, a subsidiary of Japan's SoftBank, would be \"the largest natural gas generation facility in history.\" Read moreThe White House said Japan would also finance a $2.1 billion deepwater crude oil export facility off the Texas coast. At full capacity, the Texas GulfLink project is expected to generate up to $30 billion in annual U.S. crude exports. Dallas-based energy infrastructure group Sentinel Midstream is developing the project. The Commerce Department said the third major project refers to plans to create a synthetic diamond grit facility in Georgia, with Japan set to invest approximately $600 million.The project is set to be operated by Element Six, part of De Beers Group, the world's leading diamond company. Diamond grit, dust and powder are critical raw materials in U.S. industrial manufacturing due to their exceptional hardness and wear resistance, the Commerce Department said, making the material to U.S. economic and national security.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump lauds Japan’s pledge to invest $36 billion in U.S. oil, gas and critical mineral projects",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266616-1771401074830-gettyimages-2243738157-ah702329_8i2ufjny.jpeg?v=1771401144&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T08:18:37.000Z",
      "dateModified": "2026-02-18T08:18:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CNBC Daily Open: Iran-U.S. talks and Ukraine-Russia negotiations in focus — progress in sight?",
    "url": "https://www.cnbc.com/2026/02/18/iran-us-talks-and-ukraine-russia-negotiations-in-focus-progress-in-sight.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266619-1771401538743-gettyimages-2261644880-AFP_97W433U.jpeg?v=1771401567&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T08:23:00.000Z",
    "description": "Iran's Foreign Minister Abbas Araghchi (3rd L) and Switzerland's Foreign Minister Ignazio Cassis (2nd R) attend a bilateral meeting between Switzerlan",
    "body": "Iran's Foreign Minister Abbas Araghchi (3rd L) and Switzerland's Foreign Minister Ignazio Cassis (2nd R) attend a bilateral meeting between Switzerland and Iran during a second round of US-Iranian talks with Washington pushing Tehran to make a deal to limit its nuclear programme, in Geneva on February 17, 2026. Cyril Zingaro | Afp | Getty ImagesGeopolitics will be the main theme of the day, with markets watching the high-stakes talks between the U.S. and Iran, as well as Ukraine and Russia, that are being held in Geneva.The talks between Kyiv and Moscow represent the latest round of the U.S.-brokered negotiations between the countries as Russia's invasion of Ukraine nears its 4-year mark.The talks kicked off on Tuesday and are expected to enter their second and final day on Wednesday, with no concrete agreements yet reported. Russia reportedly struck Ukraine's power infrastructure on Tuesday, drawing condemnation from President Volodymyr Zelenskyy.Washington's and Tehran's negotiations appear to be yielding more progress so far.Iranian Foreign Minister Abbas Araghchi said that the sides reached a general understanding on \"guiding principles,\" Reuters reported, though that does not mean a deal on the countries' longstanding nuclear disputes is imminent.Still, Araghchi's comments eased fears of an immediate conflict in the region, with oil futures down on Wednesday.U.S. stock futures were trading slightly up on Wednesday, led by the Nasdaq which gained 0.25%. That was after a tepid session for U.S. equities on Tuesday, which saw major averages post slim gains.Investors remain jittery about the impact of artificial intelligence. The software sector, which has already been under pressure due to fears of disruption by AI tools, continued to fall on Tuesday, with leaders such as CrowdStrike and ServiceNow losing 3.6% and 1.1%, respectively.In an interview with CNBC's Arjun Kharpal, the CEO of leading European start-up Mistral AI, predicted that more than 50% of enterprises' current software could be replaced by AI. He made the comments on the sidelines of India's AI Impact summit which will continue this week. Major announcements have come from the event so far, such as a pledge from Adani to invest $100 billion into data centers in the country by 2035. Also coming Wednesday will be consumer price inflation numbers from the UK, a day after jobs data showed the UK's unemployment rate rose to a 5-year high while wage growth slowed in the last three months of 2025.Shares of German multinational life sciences company Bayer will be in focus after its Monsanto unit said it had reached an agreement worth as much as $7.25 billion to resolve thousands of current and future lawsuits regarding concerns that its Roundup weedkiller caused cancer.What you need to know todayAnthropic rolled out Claude Sonnet 4.6. The new and improved AI model is the company's second major product launch in less than two weeks.China exports add to freight trade slump for the biggest U.S. port. New data from the Port of Los Angeles shows that commitments made by China to buy more U.S. agricultural products have yet to materialize. Meta expands Nvidia deal to use millions of AI chips. The new sweeping deal will see Meta use the chips, including Nvidia's new standalone CPUs and next-generation Vera Rubin systems, in its AI data centers. Nvidia is partnering with Indian VC firms in AI start-up push. The company says it was working with several major venture capital firms, to identify and fund AI start-ups in India's growing AI market. Iran partially closed the strategically vital Strait of Hormuz. State media reported the news citing \"security precautions\" as Tehran's Revolutionary Guard conducts military drills in the waterway.Japan export growth surges to over 3-year high. Exports climbed 16.8% year on year in January, sharply beating market expectations and growing at their fastest rate since November 2022.[Pro] Appaloosa Management's David Tepper bullish on Micron, Korean stocks. The billionaire hedge fund manager added to his Micron stake and took a position in Korean stocks, both of which are AI plays. And finally...Businesses scramble to reach China's growing experiences economyThere's nothing quite like the holiday rush in China for the Lunar New Year.The Beijing city streets start emptying out several days in advance as the majority of residents return to their hometowns or travel elsewhere. A quiet calm replaces the normally tense atmosphere of people rushing to work or school.So where are the locals going? Immersive experiences rank high.— Evelyn Cheng ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CNBC Daily Open: Iran-U.S. talks and Ukraine-Russia negotiations in focus — progress in sight?",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266619-1771401538743-gettyimages-2261644880-AFP_97W433U.jpeg?v=1771401567&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T08:23:00.000Z",
      "dateModified": "2026-02-18T08:23:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Treasury yields nudged higher as investors await Fed meeting minutes ",
    "url": "https://www.cnbc.com/2026/02/18/us-treasury-yields-investors-await-fed-meeting-minutes-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108262716-1770403451402-gettyimages-2259635545-FARM_IPO.jpeg?v=1771399015&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T08:07:34.000Z",
    "description": "U.S. Treasury yields edged higher on Wednesday as investors anticipated the Federal Reserve's meeting minutes and key inflation data. At 2:48 a.m. ET,",
    "body": "U.S. Treasury yields edged higher on Wednesday as investors anticipated the Federal Reserve's meeting minutes and key inflation data. At 2:48 a.m. ET, the 10-year Treasury yield rose over 2 basis points to 4.075%, and the 30-year Treasury bond yield was up 1 basis point to 4.7%. The 2-year Treasury note yield was 1 basis point higher at 3.453%.One basis point is equal to 0.01%, and yields and prices move in opposite directions. Investors will be keeping an eye out for the FOMC meeting minutes, which will be released at 2 p.m. ET, offering insights into policymakers' decision-making at the Fed's January meeting. The central bank held its key interest rates steady in January at a range between 3.5% and 3.75%, in line with traders' expectations.Fed Chairman Jerome Powell said at the time that the committee would make decisions about rates \"meeting by meeting\" and based on incoming data.Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets, said in a note on Tuesday: \"We'll be watchful of the discourse between the hawks and doves as the Committee held rates steady for the first time since restarting the process of normalization in September 2025.\"He added: \"The release will be informative insofar as the Fed's reaction function to the incoming data, as well as providing some detail regarding the underlying motivation not to cut rates in January.\" Investors are also looking ahead to the release of the personal consumption expenditure price index, the Fed's preferred inflation gauge, on Friday, which they will provide further insight into the state of the economy. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Treasury yields nudged higher as investors await Fed meeting minutes ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108262716-1770403451402-gettyimages-2259635545-FARM_IPO.jpeg?v=1771399015&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T08:07:34.000Z",
      "dateModified": "2026-02-18T08:07:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Palo Alto Networks slumps 6% as third quarter profit guidance falls short",
    "url": "https://www.cnbc.com/2026/02/17/palo-alto-networks-panw-q2-2026-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108137406-17458547422025-03-25t214442z_1404614266_rc2jkda1kvqf_rtrmadp_0_paloalto-stocks.jpeg?v=1753825094&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T22:24:14.000Z",
    "description": "watch nowPalo Alto Networks beat Wall Street's fiscal second-quarter estimates after the bell on Tuesday but shares fell 6% on disappointing guidance.",
    "body": "watch nowPalo Alto Networks beat Wall Street's fiscal second-quarter estimates after the bell on Tuesday but shares fell 6% on disappointing guidance.Here's how the company did versus LSEG estimates:Earnings per share: $1.03 per share excluding items vs. 94 cents expectedRevenue: $2.59 billion vs. $2.58 billion expectedThe cybersecurity company forecasted lackluster earnings for the fiscal third quarter in the range of 78 cents and 80 cents, falling short of an estimate of 92 cents from LSEG. Revenue is expected to hit $2.94 billion to $2.95 billion, topping a $2.60 billion estimate.Revenue grew 15% from $2.3 billion a year ago, the company said. Net income totaled $432 million, or 61 cents per share, up from $267 million, or 38 cents per share a year ago.Palo Alto also said on Tuesday that it's buying Israeli cybersecurity startup Koi to secure AI agents as rising artificial intelligence innovation fuels more sophisticated cyberattacks. The company has bet big on AI tools, and recently launched AI agents to help customers automate certain security responses.The company is also in the midst of a significant spending spree as CEO Nikesh Arora transforms Palo Alto into a hub for all things cybersecurity. Since joining the company in 2018, he's overseen more than 20 acquisitions.Earlier this month, the Santa Clara, California-based company closed its biggest acquisition ever, paying $25 billion for Israeli identity security company CyberArk. In January, it closed the more than $3 billion purchase of cloud observability platform Chronosphere.\"We saw continued strength in platformizations, a trend that is accelerating due to AI - customers are keen to both modernize and normalize their cybersecurity stack, aligning them to our approach,\" Arora wrote in a release. Remaining performance obligations, which track the value of contracts to be delivered to customers, totaled $16 billion and topped a StreetAccount estimate of $15.78 billion. Annual recurring revenue rose 33% to $6.33 billion.Palo Alto shares have slumped 11% year to date. Read more CNBC tech newsSnap to launch creator subscriptions in push to diversify revenueAlibaba unveils Qwen3.5 as China's chatbot race shifts to AI agentsByteDance says it will add safeguards to Seedance 2.0 following Hollywood backlashAnthropic got an 11% user boost from its OpenAI-bashing Super Bowl ad, data shows",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Palo Alto Networks slumps 6% as third quarter profit guidance falls short",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108137406-17458547422025-03-25t214442z_1404614266_rc2jkda1kvqf_rtrmadp_0_paloalto-stocks.jpeg?v=1753825094&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T22:24:14.000Z",
      "dateModified": "2026-02-17T22:24:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "More than 50% of enterprise software could switch to AI, Mistral CEO says",
    "url": "https://www.cnbc.com/2026/02/18/ai-mistral-software-switch-ceo-india-ai-impact-summit.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266601-1771392963474-gettyimages-2219062309-FRANCE_VIVATECH.jpeg?v=1771393101&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T06:30:31.000Z",
    "description": "Arthur Mensch, founder of Mistral AI, during the 'Nvidia GTC' meeting at the 2025 VivaTech conference in Paris, France, on Wednesday, June 11, 2025. N",
    "body": "Arthur Mensch, founder of Mistral AI, during the 'Nvidia GTC' meeting at the 2025 VivaTech conference in Paris, France, on Wednesday, June 11, 2025. Nathan Laine | Bloomberg | Getty ImagesNEW DELHI — More than 50% of enterprises' current software could be replaced by AI, the CEO of Mistral AI told CNBC on Wednesday, potentially adding to investor concerns over software stocks.The comments by Arthur Mensch, CEO of Mistral AI, come after a sell-off in major software names that was sparked in part by Anthropic's Cowork product as investors grow increasingly worried that AI can do more of what current enterprise software does. Investors fear AI could eat into so-called software as a service, or SaaS, business models. The iShares Expanded Tech-Software Sector ETF, which counts names such as Microsoft and Salesforce among its top holdings, is down more than 20% this year. In India, major software stocks like Tata Consultancy Services and Infosys have also fallen. \"I would say more than half of what's currently being bought by IT in terms of SaaS is going to shift to AI,\" Mensch told CNBC at the India Accelerates event on the sidelines of the AI Impact Summit in New Delhi, India. \"AI is making us able to develop software at the speed of light,\" Mensch added.watch nowThe Mistral CEO said as long as enterprises have the \"right infrastructure in place\" they're able to connect their data to AI systems to create applications to run certain parts of work.\"Then we do see with our customers ... in a couple of days, we can create fully custom applications to run a workflow, to run a procurement workflow, or to run supply chain workflows, for instance, in a way where I would say five years ago, you would actually need a vertical SaaS.\" Mensch said there is a \"replatforming\" taking place where businesses are looking to use more AI instead of current SaaS. \"The replatforming is a big opportunity for us, because we now have more than 100 enterprise customers coming to us also with that will of maybe changing and replatforming their IT system, so maybe getting rid of certain things that they bought 20 years ago, and that is starting to be a bit expensive,\" Mensch said. \"They see AI as a way to replatform the thing so that it becomes more efficient and less costly.\"Mensch said software focused on systems of records \"are not going to change,\" however. This type of software is responsible for data within an organization and often works in tandem with AI. Bipul Sinha, CEO of Rubrik, has similar views to Mensch. In an interview on Wednesday with CNBC, Sinha said \"workflow software\" could be \"significantly disrupted by AI.\" However, system of record or data infrastructure software that is enabling AI, \"will be a positive.\" Mistral expansion in IndiaMensch also told CNBC that the company plans to open its first office in India this year as it expands into a market that global tech giants are all trying to get a slice of. Mistral is currently working with international companies that have a footprint in India but is now \"prospecting\" potential customers based in the country in both the public and private sectors.While Mistral is building data centers in Europe, the approach will be different in India, with the company planning to partner with companies that already have a physical infrastructure footprint in the country, Mensch said.The Indian government is pushing AI firms to create models that can run locally with data stored domestically. India also has various languages such as Hindi and Punjabi which Mistral said its large language models are able to accommodate. \"That's something that down the line will be super important for the Indian consumer market,\" Mensch said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "More than 50% of enterprise software could switch to AI, Mistral CEO says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266601-1771392963474-gettyimages-2219062309-FRANCE_VIVATECH.jpeg?v=1771393101&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T06:30:31.000Z",
      "dateModified": "2026-02-18T06:30:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran partially closes Strait of Hormuz, a vital oil choke point, as Tehran holds talks with U.S.",
    "url": "https://www.cnbc.com/2026/02/17/iran-us-strait-of-hormuz-oil-nuclear-talks-geneva.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108162405-1750689685731-108162405-1750681542505-gettyimages-1241742205-nikoubazl-iranmili190430_npxNQ.jpg?v=1771333430&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T15:52:07.000Z",
    "description": "Iranian Navy soldiers at an armed speed boat in Persian Gulf near the strait of Hormuz about 1320km (820 miles) south of Tehran, April 30, 2019.Mortez",
    "body": "Iranian Navy soldiers at an armed speed boat in Persian Gulf near the strait of Hormuz about 1320km (820 miles) south of Tehran, April 30, 2019.Morteza Nikoubazl | Nurphoto | Getty ImagesIran partially closed the strategically vital Strait of Hormuz on Tuesday, state media reported, citing \"security precautions\" as Tehran's Revolutionary Guard conducts military drills in the waterway.It comes as the U.S. and Iran hold talks in the Swiss city of Geneva, seeking to resolve an ongoing dispute over Tehran's nuclear program.It marks the first time Iran has shut parts of the Strait of Hormuz, a major international waterway that links crude producers in the Middle East with key markets across the globe, since U.S. President Donald Trump threatened Tehran with military action in January.Located in the gulf between Oman and Iran, the strait is recognized as one of the world's most important oil choke points.About 13 million barrels per day of crude oil transited the Strait of Hormuz in 2025, accounting for roughly 31% of global seaborne crude flows, data provided by market intelligence firm Kpler showed.Tuesday's temporary closure of the waterway was aimed at ensuring shipping safety as part of the Revolutionary Guard's \"Smart Control of the Strait of Hormuz\" drill. The exercise is designed to improve Iran's operational readiness and bolster its deterrence, among other objectives.Iran and the U.S. reached an understanding of the \"guiding principles\" during the talks, Iranian Foreign Minister Abbas Araghchi told reporters after they concluded, Reuters reported. The progress does not mean an agreement will be reached soon and more work still needs to be done, he added.watch nowEnergy market participants had been closely watching the outcome of the U.S.-Iran talks, particularly as both sides have increased their military presence in the region.Oil prices were last seen trading lower, erasing earlier gains. International benchmark Brent crude futures with April delivery fell 1.8% to $67.48 a barrel, while U.S. West Texas Intermediate futures with March delivery stood 0.4% lower at $62.65 Jakob Larsen, chief safety and security officer at Bimco, which represents global shipowners, said the temporary closure of the Strait of Hormuz was likely to cause \"minor nuisance and delays\" to inbound shipping headed for the Persian Gulf — but no major disruptions.\"The exercise establishes a live firing exercise area overlapping the inbound part of Strait of Hormuz's Traffic Separation Scheme, and requests that shipping keeps clear of the area for the duration of a few hours,\" Larsen said.\"Given the level of tension in the area, it is expected that commercial shipping will comply with the Iranian request to keep clear of the exercise area,\" he added.— CNBC's Lori Ann LaRocco and Lee Ying Shan contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran partially closes Strait of Hormuz, a vital oil choke point, as Tehran holds talks with U.S.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108162405-1750689685731-108162405-1750681542505-gettyimages-1241742205-nikoubazl-iranmili190430_npxNQ.jpg?v=1771333430&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T15:52:07.000Z",
      "dateModified": "2026-02-17T15:52:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK inflation cools markedly in January, boosting odds of Bank of England rate cut",
    "url": "https://www.cnbc.com/2026/02/18/uk-inflation-cools-jan-2026-boe-cut.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108007382-1721205391133-gettyimages-2147876940-UK_INFLATION.jpeg?v=1721205443&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T07:32:35.000Z",
    "description": "A customer looks at goods on a shelf in a supermarket on January 15, 2025 in London, England. Dan Kitwood | Getty Images News | Getty ImagesThe U.K. i",
    "body": "A customer looks at goods on a shelf in a supermarket on January 15, 2025 in London, England. Dan Kitwood | Getty Images News | Getty ImagesThe U.K. inflation rate cooled to 3% in January, according to the latest figures from the Office for National Statistics (ONS).Economists polled by Reuters had expected the consumer price index to fall to 3%, down from 3.4% in the twelve months to December.Core inflation, excluding energy, food, alcohol, and tobacco, stood at 3.1% in January, down from 3.2% in December. The fall in Inflation, to its lowest annual rate since March 2025, was driven partly by a decrease in petrol prices, the ONS' Chief Economist Grant Fitzner said in comments on X.\"Airfares were another downward driver this month with prices dropping back following the increase in December. Lower food prices also helped push the rate down, particularly for bread and cereals and meat. These were partially offset by the cost of hotel stays and takeaways,\" he noted.Sterling was flat against the dollar following the as-expected data, at $1.3562.The data will be closely analysed by the Bank of England as it looks for further signs to confirm its view that inflation will fall close to the central bank's 2% target by April. U.K. jobs and wage data out Tuesday gave the BOE further signs of weakness in the labor market and an easing of inflationary pressures with the unemployment rate rising to 5.2% in December, the highest level in five years. Annual wage growth, a key inflation metric closely watched by the central bank, weakened in the last three months of 2025.watch nowGrowth data released last week showed the wider slowdown continued, with the economy growing a meager 0.1% in the fourth quarter. We'll get another shot of economic activity in the country this coming Friday when purchasing managers' index (PMI) data is released.Economists expect that the latest batch of data could prompt the BOE to cut its benchmark interest rate, currently at 3.75%, at its next meeting in March. \"Sticky inflation has been the Achilles' heel for the UK for a number of years, requiring the Bank of England to keep interest rates restrictive. But it appears that we have finally turned a corner,\" Zara Nokes, global market analyst at J.P. Morgan Asset Management, said in emailed comments Wednesday. \"Today's data showed a meaningful step down in headline inflation, with broad-based disinflation across sectors. Crucially, this progress should continue with headline inflation likely to fall in touching distance of the 2% target by April,\" she added. \"The recent moderation in wage growth should also help to keep all-important services inflation – which has been a thorn in the Bank of England's side for a number of years – at bay,\" Nokes said, noting that the BOE likely has room to deliver another couple of 25-basis-point rate cuts before hitting the neutral rate. \"Based on the latest string of employment data, I would expect these cuts to be front-loaded,\" she said.The gloomy picture painted by recent U.K. growth figures and Tuesday's evidence of a lackluster jobs market has increased the likelihood that the BOE will cut rates at the next meeting in March, Danni Hewson,  head of financial analysis at AJ Bell, said in emailed comments Tuesday. \"It has also increased expectation that rates could reach as low as 3% by the end of the year,\" Hewson added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK inflation cools markedly in January, boosting odds of Bank of England rate cut",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108007382-1721205391133-gettyimages-2147876940-UK_INFLATION.jpeg?v=1721205443&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T07:32:35.000Z",
      "dateModified": "2026-02-18T07:32:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ford to follow Tesla Cybertruck with electrical tech in new EV pickup",
    "url": "https://www.cnbc.com/2026/02/17/ford-ev-platform-pickup-truck.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108265618-1770997305074-cq5damweb12801280.jpeg?v=1771024020&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T17:29:35.000Z",
    "description": "Early renderings released by Ford Motor of its next-generation, electric pickup truck, based on its upcoming universal electric vehicle platform.Court",
    "body": "Early renderings released by Ford Motor of its next-generation, electric pickup truck, based on its upcoming universal electric vehicle platform.Courtesy FordDETROIT — Ford Motor's $5 billion \"bet\" on its next generation of all-electric vehicles will feature a budding technology that Tesla commercialized in the U.S. on its Cybertruck, the Detroit automaker said Tuesday.The system, known as a 48-volt electrical architecture, had been discussed in the automotive industry for decades but Tesla was the first to bring it to consumers in 2023.The auto industry has historically used a 12-volt system with a lead-acid battery for all vehicles to power the car's accessories — but that's been problematic and caused recalls for many EVs. The new architecture instead uses the EV's high-voltage battery to power everything.The 48-volt system improves efficiency, allows for additional electrical bandwidth and saves weight through the reduction of wiring, officials have said. The power also can be \"stepped down\" to 12 volts, when needed, through the use of new electronic control units, or ECUs, that handle different groups of an EV's architecture.The new electrical system is one of many innovations that Ford believes will allow its next-generation EVs — starting with a $30,000 small electric pickup truck in 2027 — to compete against Tesla as well as rapidly expanding Chinese brands in global markets.\"At Ford, we took on the challenge many others have stopped doing. We're taking the fight to our competition, including the Chinese,\" Ford CEO Jim Farley said during an August event at a plant in Kentucky that will produce the unnamed electric pickup. \"For too long, legacy automakers played it safe.\"Read moreFarley has called it a \"Model T moment\" for the company, referring to the company's flagship vehicle that came out more than a century ago and led to the mass adoption of vehicles during the early 1900s. He's also called it a \"bet\" for Ford given the amount of changes it will make to the EVs as well as the company and its processes. Ford expects the new EVs, which will be based on a common \"Universal Electric Vehicle,\" or UEV, to have comparable costs to gas-powered vehicles through new technologies and efficiencies. Currently, the massive batteries that power EVs have made them far more expensive to produce and have been infamously unprofitable. The Detroit automaker has said the new EVs will reduce parts by 20% versus a typical vehicle, with 25% fewer fasteners, 40% fewer workstations dock-to-dock in the plant and 15% faster assembly time.\"It represents the most radical change on how we design and how we build vehicles at Ford since the Model T,\" Farley said at the plant. \"Now is time to change the game once again.\"Ford CEO Jim Farley speaks at the Louisville Assembly Plant as the company shares its plans to design and assemble breakthrough electric vehicles in the United States, Aug. 11, 2025.Courtesy: FordFord said those improvements, as well as price points that are more similar to gas-powered models, will lead to greater adoption of EVs. That's despite a significant slowdown in U.S. EV sales amid changes to federal support by the Trump administration as well as less-than-expected consumer adoption.U.S. EV sales peaked in September, ahead of the federal incentives ending, at 10.3% of the new vehicle market, according to Cox Automotive. That demand plummeted to preliminary estimates of 5.8% during the fourth quarter.Those market conditions recently led Ford to announce $19.5 billion in write-downs, largely related to a pullback in EV plans, but the company said it will continue to invest $5 billion for its new UEV platform through 2027.\"Our focus has been on giving them everything they would get in a nice vehicle and more, and we think that that will allow us to ultimately not just make an affordable vehicle, but make one that's extremely desirable,\" Alan Clarke, Ford's executive director of advanced EV development, said during a media briefing.48-volt systemThe 48-volt system provides significant benefits to other parts of the vehicle aside from just the battery and is expected to continue to do so as the bandwidth of 12-volt batteries gets maxed out, according Clarke, a former Tesla executive. \"It's less expensive, has smaller wires and is the future of automotive,\" he said. \"So, if you want to future-protect this platform to exist for more than a decade … it's very clear that 48 made the most sense.\"Alan Clarke, Ford’s executive director of advanced EV development, during a video presentation on Ford's Universal Electric Vehicle platform.Courtesy FordFord said the wiring harness in the new midsize truck will be more than 4,000 feet shorter and 22 pounds lighter than the wiring harness used in Ford's first-generation electric SUV.Tesla CEO Elon Musk sent competitors such as Ford and General Motors a \"how-to\" guide on developing a 48-volt system in 2023.Clarke said Ford had already decided on a 48-volt platform before getting the letter but that it \"certainly added fuel to the fire\" and was a \"helpful starting point to see how they thought about\" it. It also helped suppliers get ready to assist with 48-volt systems, he added.GigacastingsIn addition to the 48-volt system, the company on Tuesday released additional details on how it's achieving its targets with the new EV through aerodynamics, team \"bounties\" to increase vehicle efficiency and turning to Tesla-pioneered \"gigacastings.\"Gigacasting is a manufacturing process that can replace dozens of traditionally small, stamped parts with larger pieces. The process requires massive machines to pressurize large sheets of metal into parts such as a vehicle's facia or underlying structure.A Ford F-150 Lightning next to a Tesla Cybertruck.Michael Wayland / CNBCFord said the new pickup will only have two structural front and rear parts compared with 146 such components on its current gas-powered Maverick small pickup.Ford also said its aluminum castings for the upcoming EV are more than 27% lighter than those features on a Tesla Model Y.\"We're still on a really steep decline of EV costs, and you can only get that by innovating, and you can only get that by system level, optimizing into what eventually becomes a product that a customer wants,\" Clarke said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ford to follow Tesla Cybertruck with electrical tech in new EV pickup",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108265618-1770997305074-cq5damweb12801280.jpeg?v=1771024020&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T17:29:35.000Z",
      "dateModified": "2026-02-17T17:29:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘A matter of national survival’: European governments on how they're accelerating digital sovereignty as geopolitical tensions ramp up",
    "url": "https://www.cnbc.com/2026/02/18/europe-digital-sovereignty-geopolitical-tensions.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108167613-1751550537568-gettyimages-2219856064-20090101250617-99-188051.jpeg?v=1771258027&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T06:00:01.000Z",
    "description": "Digital sovereignty is a \"matter of national survival,\" a European minister has told CNBC, as the continent scrambles to undo the dominance of U.S. di",
    "body": "Digital sovereignty is a \"matter of national survival,\" a European minister has told CNBC, as the continent scrambles to undo the dominance of U.S. digital services in its infrastructure amid geopolitical tensions.The region's dependence on U.S. tech and military protection has come into sharp focus, as its relationship with President Donald Trump's administration has deteriorated amid challenges from China and Russia.Trump alarmed Europe by imposing tariffs last year after returning to the White House. This year, he caused further alarm with his provocative refusal to rule out military action to acquire Greenland, a semi-autonomous Danish territory, before eventually ruling it out.U.S. cloud providers dominate the European market with an 85% share, according to data from Synergy Research Group.Critics warn that this dependency on non-sovereign providers is a risk amid reports of increasing cyberattacks by Russia and growing geopolitical tensions with the U.S. administration. Under the 2018 Cloud Act, the country's law enforcement can request user data from American companies, regardless of where the data is stored.'A matter of national survival'Estonia told CNBC it was accelerating its \"open-source first\" principle because of \"heightened security threats on Europe's eastern flank.\" Russia's full-scale invasion of Ukraine raised fears it could target the Baltic states, including Estonia. \"This has made digital sovereignty a matter of national survival, not just IT policy,\" Liisa Pakosta, the country's minister of justice and digital affairs, said.Other European governments told CNBC how they were exploring homegrown and open-source alternatives to U.S. tech platforms and upping budgets for digital sovereignty.\"Strengthening digital sovereignty is one of the central goals\" of the current German government, a spokesperson for its federal ministry for digital transformation and government modernization told CNBC, pointing to \"geopolitical developments\" of recent years.\"The current situation is characterized by high volatility and ongoing conflicts,\" they said, adding that multilateral structures are being called into question by \"strained\" relations between the U.S. and Europe.But Amazon, Microsoft and Google control more than 70% of the cloud market in the region, with U.S. companies holding at least 59% of the enterprise software market. In January, France announced it would roll out Visio — a video conferencing tool developed by the government — which it said would be available to all state services by 2027, in place of U.S. tools like Microsoft Teams and Zoom.The same month, the EU said it faced a \"significant problem of dependence on non-EU countries in the digital sphere...potentially creating vulnerabilities, including in critical sectors.\"watch nowThe Belgian federal administration is \"reassessing its dependencies in the digital domain, starting with the most critical areas,\" a spokesperson for the minister for digitalization told CNBC. \"In this context, a Belgian cloud computing strategy for the federal administration is being examined, alongside an analysis of the federal data center landscape,\" they added. \"This approach aims to address issues related to data sovereignty, resilience, and security, including the storage of the most sensitive data.\"Numerous European nations have said they have been subjected to Russian state-sponsored cyber attacks in recent years. The EU said it had observed a \"deliberate and systematic pattern of malicious behaviour attributed to Russia,\" in a statement in July.Estonia's Pakosta said: \"While we value our technological partnerships, relying solely on closed, proprietary 'black box' solutions creates a strategic vulnerability.\"\"Open source ensures that even if global connections are severed or external vendor policies change, we retain full control over the code and can keep the Estonian digital state running locally,\" she added.The country is increasing investments in strengthening sovereign digital capabilities in its 2026 state budget, Pakosta added.Open-source alternatives to U.S. tech systems are increasingly being explored by European governments. Denmark said it would launch a pilot of an open-source alternative to Microsoft Office for some government employees in June. \"Too much public digital infrastructure is currently tied up with very few foreign suppliers,\" Minister for Digital Affairs Caroline Stage Olsen said in a translated LinkedIn post at the time. \"This makes us vulnerable.\"GLADSAXE, DENMARK - 2025/08/13: Minister for Digital Affairs Caroline Stage Olsen seen after 2 stage of PostNord Danmark Rundt 2025. (Photo by Kristian Tuxen Ladegaard Berg/SOPA Images/LightRocket via Getty Images)Sopa Images | Lightrocket | Getty ImagesBut a spokesperson for the department played down the move when approached by CNBC. Describing the pilot as \"minor\", they added it was intended to \"increase our understanding of alternative technologies\" and that no decision to move away from Microsoft and Windows had been made.Europe's reliance on U.S. tech solutionsIn November, all 27 European Union member states signed a declaration stating their \"shared ambition to strengthen Europe's digital sovereignty\" and reduce \"strategic dependencies.\"Spending on sovereign cloud infrastructure-as-a-service platforms in European countries will more than triple to $23 billion in Europe in 2027, compared to 2025 levels, a recent report by research firm Gartner predicted — a much bigger increase than in North America and China.\"As geopolitical tensions rise, organisations outside the US and China are investing more in sovereign cloud IaaS to gain digital and technological independence,\" said Rene Buest, senior director analyst at Gartner.\"Governments will remain the main buyers to meet digital sovereignty needs, followed by regulated industries and critical infrastructure organisations, such as energy and utilities and telecommunications,\" he added.U.S. tech platforms aren't going to disappear from Europe any time soon. In their comments to CNBC, many European countries emphasized they were still keen to continue working with American tech companies for certain aspects of their digital infrastructure.\"We recognise and value the longstanding role that U.S. technology companies have played in Europe's digital transformation,\" said Estonia's Pakosta. \"American hyperscalers are important and trusted partners in the European cloud ecosystem.\"Even if they wanted to fully remove U.S. digital systems from Europe's tech infrastructure, it would be unlikely to happen anytime soon.\"In order to be a leading player, you have to be continually investing large amounts in research, service development, technical infrastructure, customer support and channel partners,\" John Dinsdale, Synergy Research Group's chief analyst, told CNBC.\"It will be incredibly difficult for European cloud providers to meaningfully reverse the market share trend,\" he added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘A matter of national survival’: European governments on how they're accelerating digital sovereignty as geopolitical tensions ramp up",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108167613-1751550537568-gettyimages-2219856064-20090101250617-99-188051.jpeg?v=1771258027&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T06:00:01.000Z",
      "dateModified": "2026-02-18T06:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berkshire Hathaway trims Apple stake, buys NYTimes stock in Buffett's last moves as CEO",
    "url": "https://www.cnbc.com/2026/02/17/berkshire-hathaway-trims-apple-stake-buys-nytimes-stock-in-buffetts-last-moves-as-ceo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107410598-1718628180986-107410598-1714845728257-Buffet-BAM-050424-9.jpg?v=1728667817&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-17T22:02:39.000Z",
    "description": "Warren Buffett speaks during the Berkshire Hathaway Annual Shareholders Meeting in Omaha, Nebraska, on May 4, 2024.CNBCWarren Buffett's Berkshire Hath",
    "body": "Warren Buffett speaks during the Berkshire Hathaway Annual Shareholders Meeting in Omaha, Nebraska, on May 4, 2024.CNBCWarren Buffett's Berkshire Hathaway trimmed more of its Apple stake and began a new position in The New York Times in the fourth quarter, according to a new securities filing.The Omaha-based conglomerate disclosed that it pared its position in the iPhone maker by 4.3% to $61.96 billion, per data from InsiderScore. Even with the cut, Apple remains by far Berkshire's largest equity holding.Berkshire revealed that it trimmed its stake in Apple and started a stake in fellow \"Magnificent Seven\" name Alphabet in the third quarter. The conglomerate had also cut its equity holding of Apple in the second quarter of last year after slashing its stake by two-thirds in 2024.While Apple posted its third consecutive winning year in 2025, rising around 9%, it still underperformed the S&P 500, which gained more than 16% last year. The stock has been lagging even more this year, falling about 3%. In fact, it experienced its worst day since April 2025 just last week.Stock Chart IconStock chart iconApple shares, year-to-dateIt's unclear whether the moves were done by Buffett or investment managers Todd Combs and Ted Weschler. Buffett has viewed Apple as more of a consumer products company rather than a pure technology play, and the moves may reflect Buffett making the portfolio more easily manageable for his successor.In addition to the cut in its Apple holding, Berkshire disclosed a relatively small $351.7 million stake in The New York Times. The position is ranked 29th out of its 41 total positions.Berkshire Hathaway's Top 10 Holdings, as of the end of Q4TICKER NAME VALUE ($ BILLION) CHANGE IN NO. OF SHARES (%) AAPLApple61.96-4.3AXPAmerican Express56.09N/ABACBank of America28.45-8.9KOCoca-Cola27.96N/ACVXChevron19.846.6MCOMoody's12.6N/AOXYOccidental Petroleum10.89N/ACBChubb10.699.3KHCKraft Heinz7.9N/AGOOGLAlphabet5.59N/ASource: InsiderScoreThe fourth quarter marked the last quarterly period with Buffett at the helm of Berkshire, as Greg Abel – who had been serving as vice chairman of non-insurance operations at the company – took the reins as CEO at the start of the new year.Prior to Buffett's departure, structural changes were announced at the company, including one involving Combs. After resigning in December, the former Berkshire investment manager and Geico CEO joined JPMorgan Chase as head of its new Security and Resiliency Initiative in January.watch nowBuffett first announced at Berkshire's annual meeting last May that he was going to ask Berkshire's board to have Abel replace him. Though Buffett is no longer the chief executive, he remains chairman of the board.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berkshire Hathaway trims Apple stake, buys NYTimes stock in Buffett's last moves as CEO",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107410598-1718628180986-107410598-1714845728257-Buffet-BAM-050424-9.jpg?v=1728667817&w=1920&h=1080"
      ],
      "datePublished": "2026-02-17T22:02:39.000Z",
      "dateModified": "2026-02-17T22:02:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Crap': Stephen Colbert blasts CBS for denying it blocked James Talarico interview from air",
    "url": "https://www.cnbc.com/2026/02/18/stephen-colbert-cbs-james-talarico-paramount-fcc-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266428-1771351319474-gettyimages-2233503364-3105552_0248_g.jpeg?v=1771351358&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T06:34:34.000Z",
    "description": "The Late Show with Stephen Colbert and on Tuesday, Sept. 2, 2025. Scott Kowalchyk | CBS | Getty Images\"Late Show\" host Stephen Colbert on Tuesday nigh",
    "body": "The Late Show with Stephen Colbert and on Tuesday, Sept. 2, 2025. Scott Kowalchyk | CBS | Getty Images\"Late Show\" host Stephen Colbert on Tuesday night called CBS's denial of his claim that it blocked the broadcast of his interview with Texas state Rep. James Talarico \"crap\" — and urged the network and its parent, Paramount Skydance, to stand up to the \"bullies\" in the Trump administration.Colbert's broadside came hours after CBS issued a statement on the controversy. The host, whose show will end in May as it was canceled by CBS, held up a printed copy of the network's statement about Talarico's interview during his show Tuesday night and said, \"I don't even know what to do with this crap.\"He then pulled a plastic doggy bag from behind his desk, picked up the statement, tied a knot, and mimed throwing it away before cutting to commercial.The controversy is the latest flap to spark speculation that CBS is currying favor with the Trump administration as Paramount makes a hostile tender bid for Warner Bros Discovery. If WBD's shareholders accept Paramount's bid, the federal government regulators would need to sign off on the deal.Colbert had invited Talarico, who is running in the Democratic primary for a U.S. Senate seat from Texas, to appear on the \"Late Show\" for Monday night's broadcast. But early in that night's show, Colbert said to his studio audience that CBS' lawyers had told him \"in no uncertain terms ... that we could not have him on the broadcast.\" Colbert said the lawyers wanted to avoid running afoul of new guidance by the Federal Communications Commission Chairman Brendan Carr that suggests broadcast talk shows could be required to abide by the so-called equal time provision requiring broadcasters to give political candidates equal coverage if their opponents appear on air.Colbert noted that he had put Talarico's interview on the \"Late Show\" YouTube channel — the video has been seen more than 4.4 million times.CBS, in its statement on Tuesday afternoon, denied Colbert's main allegation that it had barred the interview from being aired.\"The Late Show was not prohibited by CBS from broadcasting the interview with Rep. James Talarico,\" the network said.\"The show was provided legal guidance that the broadcast could trigger the FCC equal-time rule for two other candidates, including Rep. Jasmine Crockett [D-Texas], and presented options for how the equal time for other candidates could be fulfilled,\" CBS said.Colbert scoffed at the statement during Tuesday's show.\"They know damn well that every word of my script last night was approved by CBS lawyers who, for the record, approved every script that goes on the air,\" Colbert said.\"In fact, between the monologue I did last night, and before I did the second act talking about this issue, I had to go backstage,\" he said. \"I got called backstage to get more notes from these lawyers. Something that had never, ever happened before, and they told us the language they wanted me to use to describe that equal time exception, and I used that language,\" Colbert said. \"So I don't know what this is about.\"Colbert went on to say that he wasn't \"mad\" at the network and does not want an \"adversarial relationship.\"\"I'm just so surprised that this giant global corporation would not stand up to these bullies,\" he said.\"Come on. You're Paramount. No, no, no, you're more than that. You're Paramount+,\" Colbert cracked. \"And for the lawyers to release this [statement] without even talking to me is really surprising.\"The host also noted that there has long been \"a very famous exception to\" the equal time rule, \"and that exception included talk shows, interviews with politicians.\"\"We looked, and we can't find one example of this rule being enforced for any talk show interview, not only for my entire late-night career, but for anyone's late-night career, going back to the 1960s,\" he said.Colbert said that Carr has \"not gotten rid of\" that exception for talk-show hosts \"yet.\"\"But CBS generously did it for him and told me, unilaterally, that I had to abide by the equal time rules, something I have never been asked to do for an interview in the 20 years of this job,\" he added.\"Now, that decision, I want to be clear, is their right, just like I have the right to talk about their decision on air last night,\" Colbert said.Paramount did not immediately respond to CNBC's request for comment.Early voting in the Texas Democratic primary began Tuesday. Talarico is in a close contest against Rep. Jasmine Crockett. The winner will face the victor of the Republican primary between Sen. John Cornyn and Texas Attorney General Ken Paxton. Democrats have not won a statewide race in Texas since 1994.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Crap': Stephen Colbert blasts CBS for denying it blocked James Talarico interview from air",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266428-1771351319474-gettyimages-2233503364-3105552_0248_g.jpeg?v=1771351358&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T06:34:34.000Z",
      "dateModified": "2026-02-18T06:34:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan exports growth surges to over 3-year high, up nearly 17% in January, as shipments to China soar",
    "url": "https://www.cnbc.com/2026/02/18/japan-trade-data-january-exports-imports.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107137735-1666228139613-gettyimages-1235971665-JAPAN_TRADE.jpeg?v=1734478196&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T02:14:05.000Z",
    "description": "Containers at a shipping terminal in Yokohama, Japan on Oct. 18, 2021. Japan's trade deficit surged in September as imports overwhelmed export growth.",
    "body": "Containers at a shipping terminal in Yokohama, Japan on Oct. 18, 2021. Japan's trade deficit surged in September as imports overwhelmed export growth.Kiyoshi Ota | Bloomberg | Getty ImagesJapanese exports climbed 16.8% year on year in January, sharply beating market expectations and growing at their fastest rate since November 2022 as shipments to Asia and Western Europe surged, government data on Wednesday showed.Growth was higher than December's 5.1%, and beat Reuters-polled economists' estimates of 12%.  Value of exports to China, Japan's largest trading partner, jumped 32%, after rising 5.6% in December at a time when the two countries are locked in a diplomatic standoff over Prime Minister Sanae Takaichi's comments over Taiwan.Shipments to the U.S. fell 5%, after declining 11.1% in December. Washington is Japan's second largest trading partner.Region-wise, a near 26% jump in shipments to Asia and over 25% to Western Europe helped accelerate exports growth, and more than offset the 3.3% decline in North America.  Food, machinery and electrical machinery — which includes chips — were commodities that saw the sharpest growth, up 31.3%, 14.3% and 27.3%, respectively. Transport equipment, which contributed over 20% to exports, climbed by 0.8%. The segment, which includes cars and auto parts and has been a key growth driver for Japanese exports, has come under pressure following U.S. tariffs.Japan's Nikkei 225 stock index rose 0.9%, while the broader Topix gained 1.26%. The yen marginally strengthened to 153.43 against the U.S. dollar, while yield on benchmark 10-year government bonds was was down 1 basis point at 2.119%.   Stock Chart IconStock chart iconNikkei 225 performance so far this yearImports in January fell 2.5% year on year, compared with Reuters estimates of a 3% rise, and a 5.1% jump in the prior month. The stellar growth in outbound shipments will be a welcome start to the new year after Japan's exports growth declined to 3.1% last year, compared to the 6.2% rise seen in 2024.The Japanese economy expanded by just 0.1% year on year in the fourth quarter, supported by private demand, but net exports shaved 0.8 percentage point off growth. For the full year, GDP grew 1.1% year on year, also weighed down by net exports. Japanese shipments fell during the middle of 2025, hit by U.S. tariff worries, but saw a rebound toward the end of the year after a trade deal with the U.S. was announced that saw duties slashed to 15%.The U.S. on Tuesday announced projects valued at $36 billion, according to a Reuters report, including an oil export facility in Texas, an industrial diamonds plant in Georgia and a natural gas power plant in Ohio, to be financed by Japan as part of its $550 billion U.S. investment pledge.\"Our MASSIVE Trade Deal with Japan has just launched! Japan is now officially, and financially, moving forward with the FIRST set of Investments under its $550 BILLION Dollar Commitment to invest in the United States of America,\" U.S. President Donald Trump said in a post on Truth Social.Last week, Japan's Economy Minister Ryosei Akazawa was quoted by public broadcaster NHK as saying he hoped the initial projects would be finalized before Takaichi and Trump met.Trump had announced the meeting with Takaichi just before the Feb. 8 Lower House election, which saw Takaichi lead the ruling Liberal Democratic Party to a landslide victory.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan exports growth surges to over 3-year high, up nearly 17% in January, as shipments to China soar",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107137735-1666228139613-gettyimages-1235971665-JAPAN_TRADE.jpeg?v=1734478196&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T02:14:05.000Z",
      "dateModified": "2026-02-18T02:14:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stephen Colbert says CBS blocked James Talarico interview from air",
    "url": "https://www.cnbc.com/2026/02/17/james-talarico-stephen-colbert-cbs-fcc-interview.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108266430-1771351522928-gettyimages-2234583921-bb2_3347_guxfkca3.jpeg?v=1771362901&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-18T01:20:08.000Z",
    "description": "Democratic Texas state Rep. James Talarico speaks during a U.S. Senate campaign launch rally in Round Rock, Texas, Sept. 9, 2025.Brandon Bell | Getty ",
    "body": "Democratic Texas state Rep. James Talarico speaks during a U.S. Senate campaign launch rally in Round Rock, Texas, Sept. 9, 2025.Brandon Bell | Getty ImagesStephen Colbert ripped CBS for barring him from airing on his late-night TV show an interview with Texas state Rep. James Talarico, a Democrat running for the U.S. Senate.\"You know who's not one of my guests tonight? That's Texas Representative James Talarico,\" Colbert told his show's studio audience for Monday night's broadcast of \"The Late Show with Stephen Colbert.\"\"He was supposed to be here, but we were told in no uncertain terms by our network's lawyers, who called us directly, that we could not have him on the broadcast,\" said Colbert, drawing boos from the crowd.\"Then I was told in some uncertain terms that not only could I not have him on, I could not mention me not having him on,\" Colbert said.\"And because my network clearly doesn't want us to talk about this, let's talk about this,\" Colbert said to laughs and applause.\"The Late Show with Stephen Colbert\" during the June 25, 2025, show.Scott Kowalchyk | CBS | Getty ImagesColbert suggested that CBS' move was the result of concern that the network would draw the ire of the Federal Communications Commission.Colbert's comments are the latest escalation in tension between talk show hosts and the FCC, following the brief suspension by ABC of fellow late-night comedian Jimmy Kimmel's show last summer.The FCC last month issued guidance to the three broadcast networks, reminding them of the 1934 law that requires networks to provide equal opportunity for coverage for political candidates if their opponents appear on air. The guidance pointedly said there is no evidence that late-night and daytime talk show interviews would qualify for an exemption allowed under the law for \"bona fide\" news coverage.Colbert, during Monday's show, pointed to reports earlier this month that the FCC was investigating the ABC daytime talk show \"The View\" because of an appearance by Talarico on that program.CBS, in a statement to CNBC, said, \"The Late Show was not prohibited by CBS from broadcasting the interview with Rep. James Talarico.\"\"The show was provided legal guidance that the broadcast could trigger the FCC equal-time rule for two other candidates, including Rep. Jasmine Crockett [D-Texas], and presented options for how the equal time for other candidates could be fulfilled,\" CBS said.\"The Late Show decided to present the interview through its YouTube channel with on-air promotion on the broadcast rather than potentially providing the equal-time options.\"Read more CNBC politics coverageEpstein files: DOJ says it logs Congress members' searches to 'protect' victim informationEpstein files: AG Pam Bondi seemed to have Rep. Jayapal's DOJ database search history at hearingJudge blocks Pete Hegseth's censure of Sen. Mark Kelly over troops video, for nowWatch Pam Bondi hearing: AG touts record Dow as Democrats grill her over Trump, EpsteinTalarico on Tuesday posted a link to his interview with Colbert, which was available online.In a statement provided to CNBC by his Senate campaign, Talarico said, \"I think [President] Donald Trump is worried we're about to flip Texas. This is the party that ran against cancel culture.\"Now they're trying to control what we watch, what we say, and what we read,\" Talarico said. \"This is the most dangerous kind of cancel culture, the kind that comes from the top. A threat to one of our First Amendment rights is a threat to all of our First Amendment rights.\"Talarico is in a close Democratic primary for a U.S. Senate seat against Crockett, in which early voting began Tuesday. The winner will face off against the winner of the Republican primary between Sen. John Cornyn and Texas Attorney General Ken Paxton. Democrats last won a statewide race in Texas in 1994.The FCC didn't immediately respond to a request for comment about whether CBS would have run afoul of agency guidance by airing Talarico's interview.FCC Commissioner Anna Gomez, in a statement, called CBS' decision \"yet another troubling example of corporate capitulation in the face of this Administration's broader campaign to censor and control speech.\"\"The FCC has no lawful authority to pressure broadcasters for political purposes or to create a climate that chills free expression,\" Gomez said. \"CBS is fully protected under the First Amendment to determine what interviews it airs, which makes its decision to yield to political pressure all the more disappointing,\" Gomez said. \"It is no secret that Paramount, CBS' parent company, has regulatory matters before the government, but corporate interests cannot justify retreating from airing newsworthy content. The FCC is powerless to impose restrictions on protected speech, and any attempt to intimidate broadcasters into self-censorship undermines both press freedom and public trust.\"I once again urge broadcasters and their parent companies to stand firm against these unlawful pressures and continue exercising their constitutional right to speak freely and without government interference,\" Gomez said.Paramount Skydance has launched a hostile tender bid for Warner Bros. Discovery, a deal that would require regulatory approval from the federal government if WBD shareholders accept the offer.CBS in July said Colbert's show would be canceled in May.That announcement came shortly after Colbert blasted the network for giving what he called a \"big fat bribe\" to Trump. Paramount Skydance, earlier had agreed to pay $16 million for Trump's future presidential library to settle a lawsuit over the editing of a \"60 Minutes\" interview with then-Vice President Kamala Harris.A week after CBS said it was canceling Colbert's show, the FCC approved the $8 billion merger between Paramount and Skydance Media.Colbert, in September, spoke up for Kimmel when ABC pulled Kimmel off the air following remarks by FCC Chair Brendan Carr that the network's broadcast license was at risk because of comments Kimmel made about the alleged killer of conservative activist Charlie Kirk.Kimmel's show returned to the air about a week later.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stephen Colbert says CBS blocked James Talarico interview from air",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108266430-1771351522928-gettyimages-2234583921-bb2_3347_guxfkca3.jpeg?v=1771362901&w=1920&h=1080"
      ],
      "datePublished": "2026-02-18T01:20:08.000Z",
      "dateModified": "2026-02-18T01:20:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]