[
  {
    "title": "Microsoft to invest $17.5 billion in India's AI infra as Big Tech queues up for the Asian market",
    "url": "https://www.cnbc.com/2025/12/10/microsoft-india-investment-ai-infra-as-big-tech-google-aws.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107261846-1687543923071-gettyimages-1258977786-BIDEN_MODI.jpeg?v=1765329196&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T01:56:16.000Z",
    "description": "Microsoft CEO Satya Nadella appears at an event with tech CEOs and senior officials, including Indian Prime Minister Narendra Modi, in the East Room o",
    "body": "Microsoft CEO Satya Nadella appears at an event with tech CEOs and senior officials, including Indian Prime Minister Narendra Modi, in the East Room of the White House in Washington on June 22, 2023.Chris Kleponis | CNP | Bloomberg | Getty ImagesMicrosoft on Tuesday announced it would invest $17.5 billion in India's cloud and artificial intelligence infrastructure, making it the U.S. tech giant's largest investment in Asia. The company said that the investments, aimed at expanding hyperscale infrastructure, embedding AI into national platforms, and advancing workforce readiness, will be spread over 4 years, building on its  $3 billion pledge made in January. The announcement follows a meeting between Microsoft CEO Satya Nadella and Indian Prime Minister Narendra Modi in which the two discussed India's AI ambitions. Modi met with other tech CEOs on Tuesday too including Intel's Lip-Bu Tan. In a post on social media, Nadella thanked Modi and said that Microsoft's investments would \"help build the infrastructure, skills, and sovereign capabilities needed for India's AI first future.\" The move comes as India attempts to catch up on AI, with Modi emphasizing building a comprehensive tech ecosystem and AI sovereignty. The country has also recently attracted data center investment pledges of $15 billion from Google and $8 billion from Amazon Web Services. \"The youth of India will harness this opportunity to innovate and leverage the power of AI for a better planet,\" Modi said in a post on X, referring to Microsoft's investment.Microsoft plans to use the funds to scale up its existing cloud and AI infrastructure to serve customers across regions in India. It now provides \"Sovereign Public Cloud\" and \"Sovereign Private Cloud\" services in several regions.The company added that it was doubling its January commitment to train 20 million Indians in AI by 2030, with hopes to grow and skill its more than 22,000 employees in the country. Microsoft also announced on Tuesday that it would be integrating its Azure AI capabilities into two key digital public platforms of India's Ministry of Labour and Employment and the National Career Service. India's Union Minister of Electronics & Information Technology Ashwini Vaishnaw called the investment a signal of India's rise as a reliable global technology partner, accelerating the shift from digital to AI public infrastructure.While India lags far behind global leaders in advanced technologies like chips and AI, the country's massive consumer market and public funding have attracted major tech players. Under its \"India Semiconductor Mission,\" the country has approved 10 chip projects with total investments of over $18 billion.On Monday, American chip designer Intel signed a deal with Mumbai-based Tata Electronics aimed at collaborating on chip offerings in the country, including on products for AI applications.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft to invest $17.5 billion in India's AI infra as Big Tech queues up for the Asian market",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107261846-1687543923071-gettyimages-1258977786-BIDEN_MODI.jpeg?v=1765329196&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T01:56:16.000Z",
      "dateModified": "2025-12-10T01:56:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China consumer inflation hits near two-year high despite deeper-than-expected producer deflation",
    "url": "https://www.cnbc.com/2025/12/10/chinas-cpi-ppi-deflation-november-consumer-prices.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108024866-1724422380419-gettyimages-2167210138-AFP_36EP7CN.jpeg?v=1765326262&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T02:52:33.000Z",
    "description": "People walk along the Huguosi street, Xicheng district, a dedicated food street in Beijing on August 23, 2024. Adek Berry | AFP | Getty ImagesChina's ",
    "body": "People walk along the Huguosi street, Xicheng district, a dedicated food street in Beijing on August 23, 2024. Adek Berry | AFP | Getty ImagesChina's consumer inflation climbed in November to hit its highest level in nearly two years, while producer price deflation deepened, underscoring the challenge policymakers face in reviving domestic demand amid persistent trade tensions.Consumer prices edged up 0.7% from a year earlier, its highest level since February last year, National Bureau of Statistics data showed Wednesday. The increase followed a 0.2% rise in October and matched the 0.7% gain expected in a Reuters poll of economists. Factory-gate prices fell 2.2% in November from a year earlier, largely because of a higher comparison base, missing the forecast of a 2% decline and extending the deflationary stretch into its fourth year The decline followed a 2.1% fall in October. Core inflation, which excludes volatile prices of food and energy, was up 1.2% year-on-year in November, unchanged from the rise in the prior month. Dong Lijuan, chief statistician at NBS, attributed the improvement in CPI to higher food prices, which grew 0.2% from a year earlier, reversing a 2.9% drop in October. Energy prices slid 3.4% from a year earlier, a sharper decline than the previous month. Beijing's consumption-focused stimulus measures continued to lift prices for home appliances and clothes, which rose 4.9% and 2%, respectively. Prices for gasoline-powered and new-energy vehicles fell by 2.5% and 2.4%, respectively. Gold accessories prices rose 58.4% from a year earlier.    On a monthly basis, CPI slipped 0.1%, below the anticipated 0.2% gain in a Reuters poll, as prices for hotels, flights, transportation, and travel agencies cooled after the extended holiday period in October.  Among the categories that posted the sharpest drops in factory-gate prices, the coal mining and washing industry saw prices fall 11.8% from a year ago, while the oil and gas extraction sector recorded a 10.3% decline. Growth faltersEconomists warned that deflationary pressure on the world's second-largest economy will persist into next year as the protracted housing downturn and weak labour market conditions continue to weigh on household spending, pointing to the need for further policy support.watch nowWhile economic growth slowed to its weakest pace in a year in the third quarter, China appears to be on track to reach its annual growth target of \"around 5%\" this year, supported by the resilient exports as manufacturers ramped up shipments to non-U.S. markets.  China recorded more than $1 trillion in trade surplus in the first 11 months of the year, topping the full-year record set in 2024, as the country navigated ongoing trade tensions and growing economic protectionism worldwide.   In a key meeting earlier this month, the Politburo, top decision-making body of the ruling Communist Party, named expanding domestic demand and rebalancing supplies among the top economic priorities for 2026.  \"Although policymakers maintained their easing bias, they appeared less inclined towards broad-based stimulus measures,\" said Lisheng Wang, China economist at Goldman Sachs, noting that policymakers may need to strengthen their easing rhetoric again and step up pro-growth policy efforts next year to offset the drag from the property sector and labour market.  Investors and economists are watching closely the annual Central Economic Work Conference expected in the coming days, where policymakers will set key growth targets and policy priorities for next year. The official figures will not be made public until the annual parliamentary meeting in March.  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China consumer inflation hits near two-year high despite deeper-than-expected producer deflation",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108024866-1724422380419-gettyimages-2167210138-AFP_36EP7CN.jpeg?v=1765326262&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T02:52:33.000Z",
      "dateModified": "2025-12-10T02:52:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hinge founder leaves CEO role to launch AI-powered dating startup",
    "url": "https://www.cnbc.com/2025/12/09/hinge-founder-leaves-ceo-role-to-launch-ai-powered-dating-service.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108239371-1765317122165-108239371-1765316980395-gettyimages-2236103042-_egp3729_aaxesujv.jpeg?v=1765317142&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T22:41:00.000Z",
    "description": "Justin McLeod speaks during the Fast Company Innovation Festival 2025 on Sept. 18, 2025 in New York City.Eugene Gologursky | Getty ImagesHinge founder",
    "body": "Justin McLeod speaks during the Fast Company Innovation Festival 2025 on Sept. 18, 2025 in New York City.Eugene Gologursky | Getty ImagesHinge founder Justin McLeod is stepping down as CEO of the dating app to launch a dating service powered by artificial intelligence.McLeod will be replaced by Jackie Jantos, the dating app's president and chief marketing officer, Hinge parent company Match Group announced on Tuesday. \"The company's momentum, including being on track to reach $1 billion in revenue by 2027, gives me full confidence in where Hinge is headed,\" said McLeod in a statement. He created the dating app in 2011. McLeod will remain as an advisor to Hinge through March. Overtone, his new venture, will use AI and voice tools to \"help people connect in a more thoughtful and personal way,\" according to the announcement.Along with a dedicated team, McLeod spent much of this year developing the startup with support from Match Group, which said it plans to lead Overtone's initial funding round in early 2026.Match Group, which also owns Tinder and various other dating apps, will hold a significant ownership position in Overtone. Match Group CEO Spencer Rascoff will join Overtone's board.\"We're proud to have incubated Overtone within Hinge and to now lead its funding round as he builds his next venture,\" Rascoff said in a statement. WATCH: Software could start benefitting from AI in 2026, says Intelligent Alpha CEO Doug Clintonwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hinge founder leaves CEO role to launch AI-powered dating startup",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108239371-1765317122165-108239371-1765316980395-gettyimages-2236103042-_egp3729_aaxesujv.jpeg?v=1765317142&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T22:41:00.000Z",
      "dateModified": "2025-12-09T22:41:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pfizer adds to obesity bet with up to $2.1 billion deal to develop Chinese company's pill ",
    "url": "https://www.cnbc.com/2025/12/09/pfizer-deal-yaopharma-obesity-pill.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107364661-17062120762021-04-23t143705z_84240954_rc2q1n97o4om_rtrmadp_0_health-coronavirus-eu-pfizer.jpeg?v=1706212117&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T17:20:56.000Z",
    "description": "Pfizer CEO Albert Bourla talks during a press conference with European Commission President Ursula von der Leyen after a visit to oversee the producti",
    "body": "Pfizer CEO Albert Bourla talks during a press conference with European Commission President Ursula von der Leyen after a visit to oversee the production of the Pfizer-BioNtech COVID-19 vaccine at the factory of U.S. pharmaceutical company Pfizer in Puurs, Belgium April 23, 2021. John Thys | ReutersPfizer on Tuesday said it has struck an up to $2.1 billion licensing deal with YaoPharma to develop and commercialize its obesity pill, furthering the pharmaceutical company's push into the weight loss space. Pfizer will pay YaoPharma, a subsidiary of Chinese drugmaker Shanghai Fosun Pharmaceutical, an up-front payment of $150 million. YaoPharma could also receive up to $1.94 billion in milestone payments, along with tiered royalties on sales if the drug is approved. YaoPharma's drug works by targeting the same gut hormone, GLP-1, as Novo Nordisk's blockbuster weight loss injection Wegovy. But the pill is still in early-stage development, which means it will take several years to reach patients. The deal will help Pfizer beef up and diversify its obesity drug pipeline after a string of setbacks, including its decisions to scrap two different pills over the past two years. The drugmaker boosted its prospects in the competitive space with its up to $10 billion acquisition of the obesity biotech Metsera last month, following a fierce bidding war with Novo Nordisk. \"We look forward to contributing our expertise and resources to continue the development of this investigational GLP-1 small molecule which complements and strengthens our growing portfolio of novel candidates for treating obesity and its adjacent diseases,\" said Chris Boshoff, Pfizer's chief scientific officer, in a statement. Under the terms of the agreement, YaoPharma will conduct a phase one trial on its drug, while Pfizer will take control of later development. Pfizer also plans to conduct studies combining YaoPharma's treatment with its own drug targeting another gut hormone receptor called GIP, which is currently in mid-stage development.That combination isn't new in the space: Eli Lilly's weight loss injection Zepbound and diabetes drug Mounjaro use a dual approach targeting both GLP-1 and GIP. In a note on Tuesday, BMO Capital Markets analyst Evan Seigerman said limited information is available on YaoPharma's drug, called YP05002. But Seigerman said he views \"obesity diversification as promising in the short term\" for Pfizer. He added that Pfizer's $150 million up-front payment reflects \"prudent capital conservation in light of the recent Metsera bidding war.\"The opportunity to enter the booming weight loss drug market could be huge for Pfizer. Some analysts expect the weight loss drug space could be worth roughly $100 billion by the 2030s.It's unclear exactly how many people are using GLP-1s in the U.S., especially for obesity in particular. But around 1 in 8 adults said they were taking a GLP-1 drug to lose weight or treat another chronic condition as of November, according to a poll from health policy research organization KFF.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pfizer adds to obesity bet with up to $2.1 billion deal to develop Chinese company's pill ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107364661-17062120762021-04-23t143705z_84240954_rc2q1n97o4om_rtrmadp_0_health-coronavirus-eu-pfizer.jpeg?v=1706212117&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T17:20:56.000Z",
      "dateModified": "2025-12-09T17:20:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here's what to expect in Paramount's quest to elbow out Netflix and buy Warner Bros. Discovery  ",
    "url": "https://www.cnbc.com/2025/12/08/paramount-wbd-netflix-hostile-bid-what-to-expect.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223534-1765229953687-108223534-1762779602224-gettyimages-2245339877-PARAMOUNT_STUDIOS.jpeg?v=1765229975&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T22:01:46.000Z",
    "description": "Paramount Skydance CEO David Ellison at Netflix's \"America's Team: The Gambler and His Cowboys\" at The Egyptian Theatre in Los Angeles, Aug. 11, 2025.",
    "body": "Paramount Skydance CEO David Ellison at Netflix's \"America's Team: The Gambler and His Cowboys\" at The Egyptian Theatre in Los Angeles, Aug. 11, 2025.Gilbert Flores | Variety | Getty ImagesParamount Skydance laid out its plan Monday to persuade Warner Bros. Discovery shareholders that it's a better buyer for the company than Netflix. The hostile bid kicks off a tug-of-war that could get complicated. Paramount has officially launched a tender offer for current WBD shares at $30 per share, all cash. That bid is backed by $41 billion in equity financing. The remainder will be money from RedBird Capital and Jared Kushner's Affinity Partners. Paramount also has $54 billion in debt commitments from Bank of America, Citi and Apollo Global Management.Paramount's tender offer will be open for 20 business days, Paramount Chief Strategy Officer Andy Gordon said during a conference call for investors Monday. Warner Bros. Discovery has 10 days to respond, and after the 20 business days are up, Paramount has the option to extend the deadline to keep the offer open for WBD shareholders, Gordon said.During this time, any shareholder of WBD can sell its shares to Paramount for $30. If Paramount buys 51% of outstanding shares, it would control the company. \"We do believe the [Paramount] offer should garner meaningful traction,\" Raymond James equity analyst Ric Prentiss wrote in a note to clients. \"That said, we believe that Netflix is committed to this deal; if [Paramount] seems to be gaining traction, we would not be surprised to see a reaction.\"That reaction could come in the form of an increased Netflix offer, though Netflix co-CEO Ted Sarandos didn't mention as much when speaking Monday at the UBS Global Media and Communications Conference. A prolonged battle could eventually invite lawsuits or proxy fights that would demand full shareholder votes. The WBD board said in a statement Monday it \"is not modifying its recommendation with respect to the agreement with Netflix.\" It advised shareholders \"not to take any action at this time with respect to Paramount Skydance's proposal.\"Still, the board will \"carefully review and consider Paramount Skydance's offer in accordance with the terms of Warner Bros. Discovery's agreement with Netflix, Inc.,\" the board said in its statement. Making a caseIf WBD shareholders seem to be convinced that Paramount's is the superior bid, Warner Bros. Discovery management could restart friendly discussions with Paramount to make sure it's getting the best deal possible. Paramount CEO David Ellison told CNBC's David Faber on Monday that the company's $30-per-share offer was not its \"best and final,\" suggesting Paramount is open to paying more for WBD if discussions begin again.Ellison hopes to convince WBD shareholders that a $30-per-share, all-cash offer is more valuable than Netflix's $27.75-per-share, cash-and-stock offer for WBD's streaming and studio assets. Ellison told CNBC on Monday that he values the linear cable networks, which aren't part of Netflix's bid, at just $1 per share. WBD internally has valued that business at about $3 per share, CNBC previously reported.If WBD reaches a deal with Paramount, WBD would owe Netflix $2.8 billion as a breakup fee — meaning Paramount may have to increase its bid, or agree to pay the fee, to adjust for the added cost. Regulatory jittersEllison said Monday that Paramount's odds for regulatory approval, combined with what he views as a higher bid, should sway shareholders that the WBD board made a mistake in choosing Netflix's offer. A Netflix-HBO max combination would create a streamer \"at such a scale that it would be bad for Hollywood and bad for the consumer,\" said Ellison, noting it would be \"anticompetitive in every way you fundamentally look at it.\"Sarandos disagreed.\"We're super confident we're going to get it across the line and finish,\" Sarandos said Monday at the UBS conference. Sarandos also jabbed Paramount's estimate of $6 billion in synergies, noting those potential cost cuts would likely mean job losses.\"We're not cutting jobs, we're making jobs,\" Sarandos said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's what to expect in Paramount's quest to elbow out Netflix and buy Warner Bros. Discovery  ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223534-1765229953687-108223534-1762779602224-gettyimages-2245339877-PARAMOUNT_STUDIOS.jpeg?v=1765229975&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T22:01:46.000Z",
      "dateModified": "2025-12-08T22:01:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eli Lilly to build $6 billion manufacturing plant in Alabama to help make upcoming obesity pill, other drugs",
    "url": "https://www.cnbc.com/2025/12/09/eli-lilly-6-billion-alabama-manufacturing-plant-obesity-pill.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203224-1758715854126-gettyimages-2237030698-hc091925lillypharmaplant1.jpeg?v=1758715935&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T21:02:55.000Z",
    "description": "Eli Lilly CEO David A. Ricks speaks at a press conference at Generation Park in Houston, Monday, Sept. 23, 2025. The company announced plans for a $6.",
    "body": "Eli Lilly CEO David A. Ricks speaks at a press conference at Generation Park in Houston, Monday, Sept. 23, 2025. The company announced plans for a $6.5 billion biomanufacturing plant in north Houston. (Raquel Natalicchio/Houston Chronicle via Getty Images)Raquel Natalicchio | Houston Chronicle | Getty ImagesEli Lilly on Tuesday said it will spend $6 billion to build a manufacturing plant in Huntsville, Alabama, to help boost production of its closely watched experimental obesity pill and other drugs. It is the third facility in a string of new planned U.S. investments by the drugmaker. Eli Lilly announced in February that it would spend at least $27 billion to build four new domestic manufacturing plants, adding to $23 billion in previous investments since 2020.The company said it expects construction of the Alabama plant to start in 2026 and for it to be completed in 2032. \"Today's investment continues the onshoring of active pharmaceutical ingredient (API) production, strengthening supply chain resilience and reliable access to medicines for patients in the U.S.,\" said Eli Lilly CEO David Ricks in a release. That added production capacity for Eli Lilly's obesity pill, orforglipron, is crucial as the company races to file for its approval and tries to maintain its dominance in the booming market for GLP-1s. The company and its chief rival, Novo Nordisk, faced supply shortages for their existing weekly injections after demand skyrocketed in the U.S. in recent years, though they have managed to alleviate those issues.Eli Lily's pill in November won a priority review voucher from the Food and Drug Administration, which will significantly speed up the regulator's assessment of the drug to potentially a few months. Drugmakers have been scrambling to boost their production in the U.S. after threats by President Donald Trump to impose tariffs on pharmaceuticals imported into the U.S. But concerns about those potential tariffs have eased following recent drug pricing deals with Trump that exempt companies from the levies.Eli Lilly said the Alabama site will bring 450 jobs to the area, including engineers, scientists, operations personnel and lab technicians, as well as 3,000 construction jobs. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eli Lilly to build $6 billion manufacturing plant in Alabama to help make upcoming obesity pill, other drugs",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108203224-1758715854126-gettyimages-2237030698-hc091925lillypharmaplant1.jpeg?v=1758715935&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T21:02:55.000Z",
      "dateModified": "2025-12-09T21:02:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Fed decision is expected to feature a rate cut and a lot more. Here's what to expect",
    "url": "https://www.cnbc.com/2025/12/09/the-fed-decision-is-expected-to-feature-a-rate-cut-and-a-lot-more-heres-what-to-expect.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235078-1765312576456-108235078-1764678439927-gettyimages-2249465246-_73a5220_qpe3os8i.jpeg?v=1765312604&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T20:36:45.000Z",
    "description": "watch nowThe Federal Reserve is poised to deliver its third straight interest rate cut Wednesday, while simultaneously firing a warning shot about wha",
    "body": "watch nowThe Federal Reserve is poised to deliver its third straight interest rate cut Wednesday, while simultaneously firing a warning shot about what's ahead.Following a period of remarkable indecision about which way central bank policymakers would lean, markets have settled on a quarter percentage point reduction. If that's the case, it will take the Fed's key interest rate down to a range of 3.5%-3.75%.However, there are complications.The rate-setting Federal Open Market Committee is split between members who favor cuts as a way to head off further weakness in the labor market against those who think easing has gone far enough and threatens to aggravate inflation.That's why the term \"hawkish cut\" has become the buzzy term for this meeting. In market parlance, it refers to a Fed that will reduce, but deliver a message that no one should be holding their breath for the next one.\"The likeliest outcome is a kind of hawkish cut where they cut, but the statement and the press conference suggesting that they may be done cutting for now,\" said Bill English, the Fed's former director of monetary affairs and now a Yale professor. English expects the message to be \"that they've made an adjustment and they're comfortable where they are, and they don't see a need to do anything more in the near term, as long as things play out more or less as they expect.\"Where the full committee falls will be expressed in the post-meeting statement and Chair Jerome Powell's news conference. Wall Street economic commentary anticipates a tweak in the statement to harken back to a year ago with language regarding \"the extent and timing of additional adjustments\" that Goldman Sachs expects to reflect \"the bar for any further cuts will be somewhat higher.\"In addition to the rate decision and the statement, investors will be watching an update to the \"dot plot\" of individual officials' rate expectations; expectations for gross domestic product, unemployment and inflation, and a possible update of the Fed's asset purchase intentions, with some expecting the committee to pivot from ceasing the runoff of maturing bond proceeds back to purchases.Many moving partsAs for Powell, his tone \"will also likely get across that the bar has risen in his press conference and will likely again make a point of explaining the views of participants who opposed a cut,\" Goldman economist David Mericle said in a note.About that dissent: The October meeting saw two \"no\" votes on the final statement, one from each side of the rate debate. Mericle said that is likely to happen again, accompanied by multiple other \"soft dissents\" who will represent divergent views on the \"dot plot\" that indicates, anonymously, the rate outlook for each of 19 individual meeting participants, a group that includes 12 voters.While Mericle added that there is a \"solid case\" for a third cut, there are arguments to be made for both sides.\"It's a tough meeting, and so they'll presumably be a few dissents,\" English said. \"It's often hard to get the committee together. You have people who just have very different views about how the economy works and how policy works and so on. But this moment for the economy is particularly fraught.\"Even with the dearth of official government data due to the since-settled shutdown, hiring has shown signs of flattening, with sporadic signals that layoffs are accelerating. A Bureau of Labor Statistics report Tuesday showed job openings little changed in October but hiring down by 218,000 and layoffs rising by 73,000.On the inflation side, the most recent reading of the Fed's preferred gauge showed the annual rate at 2.8% in September, slightly below the Wall Street forecast but still well above the central bank's 2% goal.Inflation worriesDespite President Donald Trump's protestations that inflation has disappeared, it has at best stabilized and at worst is holding above the Fed's target in part due to the tariffs implemented under his watch. While Fed officials mostly have said they expect the duties to provide a temporary boost to prices,  the gap between the current level and the central bank goal is enough to give some economists and policymakers pause.\"Inflation is not back to 2% so they're going to need to keep policy somewhat restrictive if they are going to put downward pressure on inflation,\" former Cleveland President Loretta Mester said Tuesday on CNBC. \"Right now, inflation is pretty well above the goal, and it's not just all tariff-driven.\"Still, Mester thinks the FOMC will approve one more cut Wednesday. Like market participants, Mester saw a Nov. 21 speech from New York Fed President John Williams as the pivotal sign \"quite clearly\" that another reduction was coming. Prior to that, markets had been betting against a cut, particularly after Powell said explicitly at his October news conference that a December move was not a \"foregone conclusion. Far from it.\"\"I think they're going to follow through with that last cut,\" Mester said. \"I do hope that they signal that they think the economy has gotten to a place where policy is in a good place and they are going to slow down the cuts, because I am more concerned about the inflation risk, the stickiness.\"Aside from rate questions and the dot plot update, the committee may signal its next step regarding management of its balance sheet.The committee in October signaled that it would halt the process of \"quantitative tightening,\" or allowing maturing bond proceeds to roll off. With pressures ongoing in the overnight funding markets, some market participants expect the Fed will announce it will resume bond purchases, though not a pace that would suggest the \"quantitative easing,\" or QT's opposite.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Fed decision is expected to feature a rate cut and a lot more. Here's what to expect",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235078-1765312576456-108235078-1764678439927-gettyimages-2249465246-_73a5220_qpe3os8i.jpeg?v=1765312604&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T20:36:45.000Z",
      "dateModified": "2025-12-09T20:36:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump's blessing of Nvidia AI chip sales to China gets a chilly reception from GOP",
    "url": "https://www.cnbc.com/2025/12/09/trump-nvidia-china-ai-chips-gop-congress.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108139104-1746048626472-gettyimages-2212178893-AFP_444Y2UG.jpeg?v=1765299307&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T21:18:00.000Z",
    "description": "Nvidia CEO Jensen Huang, right, speaks alongside President Donald Trump about investing in America, at the White House in Washington, on April 30, 202",
    "body": "Nvidia CEO Jensen Huang, right, speaks alongside President Donald Trump about investing in America, at the White House in Washington, on April 30, 2025.Jim Watson | AFP | Getty ImagesPresident Donald Trump's decision to let U.S. tech giant Nvidia sell more advanced semiconductors to China is getting pushback from some Republicans wary of giving Beijing an edge in the global race to AI dominance.The agreement, which Trump announced in a Truth Social post Monday evening, would allow Nvidia to sell its H200 artificial intelligence chips to China on the condition that the U.S. government gets 25% of the sales.The H200 chips aren't Nvidia's most advanced, but are more powerful than the company's H20s, which were previously developed specifically for the China market.The White House, over the summer, gave approval for Nvidia and Advanced Micro Devices to sell their less-powerful chips to China in exchange for 15% of sales revenue. Beijing reportedly told companies not to buy those chips.Chinese President Xi Jinping \"responded positively\" to the latest proposal, Trump wrote in the social media post.CNBC has reached out to the Chinese Embassy in Washington, D.C., for comment.Experts warn that giving China access to the better chips will shrink America's hardware advantage and help Chinese developers vastly improve their AI models and other tech.Some of Trump's Republican allies appear to agree.\"Alarm bells go off in my head here,\" Sen. Lindsey Graham, R-S.C., told CNBC on Tuesday when asked about the chip sales agreement.\"I don't mind doing normal business with China. But if you can prove to me this will accelerate their military capability, I'll oppose it,\" Graham said.\"My general view on this is that China's progress on AI is almost entirely parasitic on our technology, in particular on our hardware,\" Sen. Josh Hawley, R-Mo., said on Capitol Hill earlier Tuesday.\"So I don't want China to win the AI race. I want to win the AI race,\" Hawley said. \"But if we want to beat China, I think we need to constrain their ability to leverage our own technology, and I think we would want to reduce their access to our hardware, not increase it.\"Hawley did not directly criticize Trump, and noted that the president is privy to more information about the situation than he is. \"So I think he deserves some deference here,\" Hawley said.\"But I think in the general matter I would want to constrain American hardware going to China,\" he added.Sen. John Cornyn, R-Texas, asked about the chip agreement, was more succinct. \"I'm concerned,\" he said. Cornyn did not respond to follow-up questions.The U.S. House Select Committee on China, a Republican-led panel formed to focus on the \"threat posed by the Chinese Communist Party,\" echoed Hawley's concerns.\"Right now, China is far behind the United States in chips that power the AI race. Because the H200s are far better than what China can produce domestically, both in capability and scale, @nvidia selling these chips to China could help it catch up to America in total compute,\" the committee said in a statement on X.Beijing will use the H200s, which boast significantly more processing power and memory bandwidth than China's top chips, \"to strengthen its military capabilities and totalitarian surveillance,\" the panel's statement said.\"Finally, Nvidia should be under no illusions – China will rip off its technology, mass produce it themselves, and seek to end Nvidia as a competitor,\" the panel said. \"That is China's playbook and it is using it in every critical industry.\"Asked for comment on the GOP lawmakers' remarks, White House spokesman Kush Desai told CNBC, \"The Trump administration is committed to ensuring the dominance of the American tech stack – without compromising on national security.\"Not all Republicans are piling on.\"I don't have a real problem with providing them some [chips],\" Sen. Thom Tillis, R-N.C., told CNBC. \"But we've got to know where it is, how they're using it, those sorts of things.\"But there is vocal support among both parties for slowing China's ability to obtain the world's best chips.Sen. Pete Ricketts, R-Neb., last week introduced bipartisan legislation that would direct the Trump administration to deny export licenses for advanced chips to China and other foreign adversaries for at least 30 months.\"The best AI chips are made by American companies. Denying Beijing access to these AI chips is essential to our national security,\" Ricketts said in a press release unveiling the bill.Sen. Tom Cotton, R-Ark., one of the bill's co-sponsors, said, \"It's crucial that we protect American AI innovation from Communist China to win the AI race.\"Read more CNBC politics coverageTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationTrump announces $12 billion aid package for farmers caught up in trade warTrump says Netflix, WBD deal could be 'problem' as son-in-law backs Paramount bidSupreme Court to hear case on Trump birthright citizenship orderTrump can fire labor, employment board members without cause: Appeals courtTrump administration views Netflix, Warner Bros. deal with 'heavy skepticism'Costco adds Biden Commerce Sec. Raimondo to board after Trump tariff lawsuitNew York Times sues Pentagon, Hegseth over media access policyCongressional watchdog probes Trump FHFA chief Bill PulteJan. 6 pipe bomb suspect Brian Cole arrested, faces explosives charges, DOJ saysJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'Democrats have been sounding alarms about the Trump administration's willingness to sell China better AI chips.Senate Intelligence Committee Vice Chairman Mark Warner, D-Va., slammed the Trump administration's \"haphazard and transactional approach to export policy,\" saying it \"risks squandering U.S. AI leadership and deferring to the People's Republic of China up and down the AI stack.\"Sen. Elizabeth Warren, D-Mass., highlighted the fact that the Department of Justice touted a crackdown on a \"major China-linked AI tech smuggling network\" shortly before Trump announced the H200 sales agreement.\"Trump is letting NVIDIA export cutting-edge AI chips that his own DOJ revealed are being illegally smuggled into China,\" she wrote on X. \"His own DOJ called these chips 'building blocks of AI superiority,'\" she noted.Warren added that she wants Trump and Commerce Secretary Howard Lutnick to \"answer to Congress on why they are selling out US security.\"— CNBC's Mary Catherine Wellons and Justin Papp contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's blessing of Nvidia AI chip sales to China gets a chilly reception from GOP",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108139104-1746048626472-gettyimages-2212178893-AFP_444Y2UG.jpeg?v=1765299307&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T21:18:00.000Z",
      "dateModified": "2025-12-09T21:18:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI hires Slack CEO Denise Dresser to lead global revenue strategy",
    "url": "https://www.cnbc.com/2025/12/09/openai-slack-ceo-denise-dresser-chief-revenue-officer.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108054456-1730227996732-gettyimages-2181105069-TECHCRUNCH_DISRUPT.jpeg?v=1765311152&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T21:07:11.000Z",
    "description": "Slack CEO Denise Dresser during TechCrunch Disrupt in San Francisco, Oct. 29, 2024.David Paul Morris | Bloomberg | Getty ImagesOpenAI on Tuesday annou",
    "body": "Slack CEO Denise Dresser during TechCrunch Disrupt in San Francisco, Oct. 29, 2024.David Paul Morris | Bloomberg | Getty ImagesOpenAI on Tuesday announced that it's tapped Slack CEO Denise Dresser as its chief revenue officer. Dresser will oversee the artificial intelligence startup's global revenue strategy across both customer success and enterprise, OpenAI said in a release. After spending more than a decade as an executive at Salesforce, Dresser was named Slack's chief executive in 2023. Salesforce acquired the messaging company for more than $27 billion in 2020.\"I've spent my career helping scale category-defining platforms, and I'm looking forward to bringing that experience to OpenAI as it enters its next phase of enterprise transformation,\" Dresser said in a statement.OpenAI kickstarted the generative AI boom with the launch of its chatbot ChatGPT three years ago, and it has quickly ballooned into one of the fastest-growing commercial entities on the planet. Read more CNBC tech newsU.S. uncovers scheme to reroute Nvidia GPUs worth $160 million to China despite export bansICEBlock developer sues U.S. government after DOJ demanded Apple remove app from storePressure builds on Apple and CEO Tim Cook with holiday executive shake-upGoogle to launch the first of its AI glasses in 2026The startup said in November that it is on track to reach more than $20 billion in annualized revenue run rate this year, with plans to grow to hundreds of billions in sales by 2030.But as competition heats up from rivals like Google and Anthropic, OpenAI is facing pressure to deliver. The company has made more $1.4 trillion in infrastructure commitments as it works to scale up its technology, and the immense sum has raised eyebrows and sparked concerns about a potential AI bubble.More than 800 million people use ChatGPT every week, and OpenAI supports more than 1 million business customers. Dresser will help more companies integrate AI into their daily operations, OpenAI said. \"We're on a path to put AI tools into the hands of millions of workers, across every industry,\" Fidji Simo, OpenAI's CEO of Applications said in a statement. \"Denise has led that kind of shift before, and her experience will help us make AI useful, reliable and accessible for businesses everywhere.\"WATCH: Sam Altman hits reset at OpenAI, pausing side bets to defend ChatGPT’s AI leadwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI hires Slack CEO Denise Dresser to lead global revenue strategy",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108054456-1730227996732-gettyimages-2181105069-TECHCRUNCH_DISRUPT.jpeg?v=1765311152&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T21:07:11.000Z",
      "dateModified": "2025-12-09T21:07:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration moves to remove millions of student loan borrowers from payment pause ",
    "url": "https://www.cnbc.com/2025/12/09/save-student-loan-payment-pause.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229361-17636636062025-11-20t183240z_1355639605_rc260iadbnwv_rtrmadp_0_usa-trump.jpeg?v=1763663630&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T18:58:05.000Z",
    "description": "Linda McMahon, President Donald Trump’s nominee to be Secretary of Education, testifies during her Senate Health, Education, Labor and Pensions Commit",
    "body": "Linda McMahon, President Donald Trump’s nominee to be Secretary of Education, testifies during her Senate Health, Education, Labor and Pensions Committee confirmation hearing in the Dirksen Senate Office Building on February 13, 2025 in Washington, DC. Win Mcnamee | Getty ImagesThe Trump administration announced a proposed joint settlement with Missouri that could soon force millions of borrowers in a Biden-era payment pause back into repayment. Student loan borrowers who remain enrolled in the Saving on a Valuable Education plan forbearance will need to select a new repayment option, the U.S. Department of Education said in a press release Tuesday. The entire SAVE plan has been blocked since February, when the 8th U.S. Circuit Court of Appeals sided with Republican-led states that argued former President Joe Biden lacked the authority to establish the student loan relief plan.As of July, the Education Department had identified more than 7.6 million borrowers in the SAVE forbearance.Read more CNBC personal finance coverage53% of investors with a required withdrawal for 2025 still haven't taken it: FidelityWhy jewelry owners may want to check their homeowners insurance coverageWhat another Fed cut could mean for your personal borrowing costsMany student loan borrowers say it's harder to cover basic needs: surveyAlmost all companies with 401(k)s allow Roth savings — who benefits401(k) changes for 2026 —one is 'impactful' for high earners, CFP saysKeeping your 401(k) when you retire is easier. What you need to knowAt 22, she found $200,000 in debt in her name. It took a decade to clear itHow Social Security services may change with three bills in Congress'Trump accounts' could give your child up to $1,000. What to knowThe first step workers should take after a layoff, as job losses soarPolitics is now the No. 1 money worry, financial planners sayMedicare prescription drug costs may change in 2026 — what to knowTurning to AI for financial advice has risks, top-ranked advisor saysETFs make it easy to invest in gold. What to know about taxes CNBC's Financial Advisor 100: Best financial advisors, top firms rankedThe proposed settlement would dismiss the SAVE litigation in exchange for the Education Department agreeing not to enroll any new borrowers in SAVE and to move all borrowers currently in the plan \"into legal repayment plans,\" according to the department.Based on the details, borrowers will likely need to leave the SAVE forbearance early next year, said higher education expert Mark Kantrowitz. That's sooner than many advocates and borrowers may have expected: President Donald Trump's \"big beautiful bill\" set the SAVE program's expiration date at July 1, 2028.In their lawsuits, the GOP states had argued that Biden, with SAVE, was trying to find a roundabout way to forgive student debt after the Supreme Court blocked his sweeping debt cancellation plan in June 2023. SAVE came with two key provisions that the lawsuits targeted: it had lower monthly payments than any other federal student loan repayment plan, and it led to quicker debt erasure for those with small balances.The proposed settlement comes four months after the Education Department resumed charging interest on the loans of borrowers who remained in the SAVE forbearance.Consumer advocates slammed the agreement. Persis Yu, deputy executive director and managing counsel at Protect Borrowers, said it would \"strip borrowers of the most affordable repayment plan.\"More than 42 million Americans hold student loans and the outstanding debt exceeds $1.6 trillion, according to the Congressional Research Service. How will the end of the SAVE forbearance impact you? If you're willing to share your experience for an upcoming story, please email annie.nova@nbcuni.com.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration moves to remove millions of student loan borrowers from payment pause ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229361-17636636062025-11-20t183240z_1355639605_rc260iadbnwv_rtrmadp_0_usa-trump.jpeg?v=1763663630&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T18:58:05.000Z",
      "dateModified": "2025-12-09T18:58:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jim Cramer rejects Wall Street doubts about Nvidia, Apple and Warner Bros. Discovery",
    "url": "https://www.cnbc.com/2025/12/09/jim-cramer-rejects-doubts-about-nvidia-apple-warner-bros-discovery.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106349570-1579719779302img_3404r.jpg?v=1694617758&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T23:36:54.000Z",
    "description": "watch nowCNBC's Jim Cramer on Tuesday told investors that it can be worthwhile to put trust in a good stock, even if a negative narrative about the co",
    "body": "watch nowCNBC's Jim Cramer on Tuesday told investors that it can be worthwhile to put trust in a good stock, even if a negative narrative about the company is gaining traction on Wall Street.\"If you want to make big money in individual stocks, you need to be a believer,\" he said. \"Sometimes it doesn't pay off — everybody makes mistakes — but if you don't believe in your stocks, then you'll never be able to stick with them through thick and thin.\"He reviewed prominent concerns with three major companies: artificial intelligence giant Nvidia, iPhone maker Apple and entertainment outfit Warner Bros. Discovery.Nvidia has exploded over the past few years as hyperscalers clamor for its advanced semiconductors. The company became the first stock to reach a market cap of $4 trillion earlier this year — and it briefly topped $5 trillion during a session in October.But investors are worried about the company's business prospects in China due to potential restrictions on sales of its coveted chips. But Cramer reiterated his confidence in Nvidia's success. He noted that President Donald Trump just granted Nvidia permission to sell some of its chips in China, and he suggested there is still demand for them in the country.Wall Street broadly has had reservations about Apple over the years, Cramer said, but he dubbed the company a long-term winner. He noted that many doubted the success of the company's latest iPhone over the past several months. However, Cramer pointed out that Apple stock has \"been on a huge winning streak since September.\" Shares are currently up more than 10% year-to-date. Cramer applauded WBD CEO David Zaslov's efforts to pay down his company's substantial debt and refine the HBO streaming service. While Netflix and Paramount Skydance are now locked in a struggle over the company, Cramer suggested many on Wall Street had doubted WBD could attract buyers willing to pay a premium. \"Now the acquirers are here and it looks like what the media originally called a preposterous price was too low,\" he said.watch nowSign up now for the CNBC Investing Club to follow Jim Cramer's every move in the market.Disclaimer The CNBC Investing Club holds shares of Nvidia and Apple.Questions for Cramer? Call Cramer: 1-800-743-CNBCWant to take a deep dive into Cramer's world? Hit him up! Mad Money Twitter - Jim Cramer Twitter - Facebook - InstagramQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jim Cramer rejects Wall Street doubts about Nvidia, Apple and Warner Bros. Discovery",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106349570-1579719779302img_3404r.jpg?v=1694617758&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T23:36:54.000Z",
      "dateModified": "2025-12-09T23:36:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he 'heard' Biden Fed appointments were signed by autopen, tells aide to investigate",
    "url": "https://www.cnbc.com/2025/12/09/trump-biden-fed-autopen-powell.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108239441-17653227542025-12-09t230720z_262217472_rc29diago9qs_rtrmadp_0_usa-trump.jpeg?v=1765322785&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T03:25:16.000Z",
    "description": "President Donald Trump on Tuesday claimed to have \"just heard\" that all four of former President Joe Biden's appointments to the Federal Reserve were ",
    "body": "President Donald Trump on Tuesday claimed to have \"just heard\" that all four of former President Joe Biden's appointments to the Federal Reserve were approved by \"autopen,\" suggesting they are not authorized to serve in those roles.Trump provided no evidence for the claim, which piggybacks on his repeated assertion that all of his predecessor's documents that were signed using an autopen are invalid.But he said he thinks it is \"something we have to look into.\" And the president suggested that the list of autopen-signed appointees could include Fed Chair Jerome Powell, who has faced near-constant criticism from Trump over his handling of the central bank and U.S. interest rate levels.Trump's comments came on the eve of a meeting by the Fed's Federal Open Market Committee, which sets interest rates. After reentering the White House for his second term in January, Trump for months had repeatedly pressed Powell and the Fed, without success, to cut interest rates, and lambasted them when they failed to do his bidding.The FOMC in September made its first rate cut of Trump's current term, and then cut them again in October. The FOMC is expected to reduce rates for a third time on Wednesday. Trump, in his first term, appointed Powell as Fed chair. Biden reappointed Powell in 2021. The chairman's term is set to expire in May.Three other current members of the Fed's Board of Governors — Vice Chair Philip Jefferson, Michael Barr,  Lisa Cook — are Biden appointees. With Powell, they comprise a majority of the Fed's board.The autopen comments came during a campaign-style speech in Mount Pocono, Pennsylvania, where Trump had traveled to speak about the economy and counter Democrats' messaging about an affordability crisis in the U.S.\"By the way, it looks — you're gonna have to check this, please — I just heard, it could be that all four commissioners in the Fed signed by Biden ... I hear that the autopen may have signed those commissions,\" Trump said.Trump interspersed his accusation with criticism for Powell, derisively calling him \"Too Late\" and claiming JPMorgan Chase CEO Jamie Dimon had urged the central bank chief to lower rates.\"But I hear that the autopen may have signed those commissions. If they signed those commissions — now maybe I'm wrong, but we're going to check,\" Trump said.He then appeared to address a member of his administration, asking, \"Have you checked that? Are you hearing it? Who signed it? Did he sign it, or did the autopen sign it?\"Read more CNBC politics coverageTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationTrump announces $12 billion aid package for farmers caught up in trade warTrump says Netflix, WBD deal could be 'problem' as son-in-law backs Paramount bidSupreme Court to hear case on Trump birthright citizenship orderTrump can fire labor, employment board members without cause: Appeals courtTrump administration views Netflix, Warner Bros. deal with 'heavy skepticism'Costco adds Biden Commerce Sec. Raimondo to board after Trump tariff lawsuitNew York Times sues Pentagon, Hegseth over media access policyCongressional watchdog probes Trump FHFA chief Bill PulteJan. 6 pipe bomb suspect Brian Cole arrested, faces explosives charges, DOJ saysJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'\"So, I don't know. I think it's something we have to look into,\" Trump said. \"They put people there that are not authorized to be there.\"Trump then said, \"Would you check that, Scott?\" appearing to refer to Treasury Secretary Scott Bessent.\"Because I'm hearing that the autopen could have signed maybe all four, but maybe a couple of them,\" Trump said.\"We'll take two,\" he added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he 'heard' Biden Fed appointments were signed by autopen, tells aide to investigate",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108239441-17653227542025-12-09t230720z_262217472_rc29diago9qs_rtrmadp_0_usa-trump.jpeg?v=1765322785&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T03:25:16.000Z",
      "dateModified": "2025-12-10T03:25:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump trade rep changes China soybean purchase timeline, cites 'discrepancy'",
    "url": "https://www.cnbc.com/2025/12/09/trump-trade-rep-changes-china-soybean-purchase-timeline-cites-discrepancy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108239407-1765319667874-gettyimages-2250345551-AFP_87LT8EJ.jpeg?v=1765319705&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-10T01:17:15.000Z",
    "description": "US Trade Representative Jamieson Greer testifies during a US Senate Appropriations Subcommittee on Commerce, Justice, Science, and Related Agencies he",
    "body": "US Trade Representative Jamieson Greer testifies during a US Senate Appropriations Subcommittee on Commerce, Justice, Science, and Related Agencies hearing on 2026 funding priorities, on Capitol Hill in Washington, DC, Dec. 9, 2025.Saul Loeb | AFP | Getty ImagesU.S. Trade Representative Jamieson Greer told a Senate Appropriations subcommittee on Tuesday that the deadline for China to buy 12 million metric tons of soybeans from American farmers was not the end of December as the White House has said, but the end of the \"growing season.\"Greer's comment at the hearing came on the heels of a report by NBC News showing that the pace of China's purchase of soybeans in recent weeks was well short of reaching the agreed amount by the end of the calendar year.China, which in October agreed to end its monthslong boycott of American soybeans amid a trade war, to date has bought only about 3 million metric tons, the trade representative told members of the  Agriculture, Rural Development, Food and Drug Administration, and Related Agencies subcommittee.Greer said there was a \"discrepancy\" in what the White House has described as the deadline and the actual deadline for the purchases to be completed.The most recent growing season for soybeans ended in November, according to the U.S. Department of Agriculture.CNBC has asked Greer's office whether there is a hard or rough deadline for China to reach 12 million metric tons of purchases, as agreed to as part of a trade agreement with President Donald Trump in October.Greer's disclosure came in response to a question by Sen. Deb Fischer, R-Neb.\"There remains anxiety about if and when China will fully follow through on those purchase commitments that were made,\" Fischer said.She noted that the White House fact sheet on the trade deal said China would purchase 12 million metric tons by the end of the calendar year -- contradicting recent comments from Greer.The fact sheet says, \"China will purchase at least 12 million metric tons (MMT) of U.S. soybeans during the last two months of 2025 and also purchase at least 25 MMT of U.S. soybeans in each of 2026, 2027, and 2028.\"Greer told Fischer, \"It is for this growing season, so, thank you for highlighting that.\"'\"We've heard from a couple farmers, they wanted to know about that discrepancy, and it is a discrepancy, it's through the growing season,\" he said.Joe Glauber, a former U.S. Department of Agriculture chief economist during the Obama administration, told CNBC in an interview he doesn't know what the administration means when it refers to the growing season.\"It's not a term that USDA means by any chance,\" Glauber said. \"Does that mean at harvests or does that mean actually the end of the marketing year, which is the more common way?\"Treasury Secretary Scott Bessent last week said that he expected China to reach the 12 million metric ton mark by \"the end of the season.\"\"So I think that'll be February 28th,\" Bessent said, during an interview with Andrew Ross Sorkin at The New York Times \"Deal Book Summit\" in New York. \"They are in a perfect cadence to complete that goal,\" Bessent said, after Ross Sorkin said data from the U.S. Department of Agriculture as of Nov. 14 showed that China had only purchased 330,000 metric tons.Bessent called the figure Ross Sorkin cited \"bad information.\"Glauber said the marketing year for soybeans is September, when the soybeans are harvested and ready to sell, through August of the next year. China would be more likely to hit buying targets from the U.S. by next August, since Brazil dominates the soybean market in the early months of the new year that coincides with their harvest season and cheap prices. The U.S. typically exports more to China later in the year, when its soybeans are cheaper.But that's a far longer time than the initial two-month window the White House pitched when it announced the China framework.\"That's a long time,\" he said. \"This is not any sort of immediate relief.\"CNBC has asked USDA for comment on Greer's remarks. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump trade rep changes China soybean purchase timeline, cites 'discrepancy'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108239407-1765319667874-gettyimages-2250345551-AFP_87LT8EJ.jpeg?v=1765319705&w=1920&h=1080"
      ],
      "datePublished": "2025-12-10T01:17:15.000Z",
      "dateModified": "2025-12-10T01:17:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China is buying U.S. soybeans again — but falling short of goal set by Trump trade agreement",
    "url": "https://www.cnbc.com/2025/12/09/china-buys-us-soybeans-trump-trade-agreement.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238609-1765227335419-gettyimages-2250794852-aw1a9411_bsd1c8wq.jpeg?v=1765307646&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T19:28:38.000Z",
    "description": "PoliticsPublished Tue, Dec 9 20251:08 PM ESTUpdated Tue, Dec 9 20252:28 PM ESTKey PointsChina has resumed purchases of U.S. soybeans after a monthslon",
    "body": "PoliticsPublished Tue, Dec 9 20251:08 PM ESTUpdated Tue, Dec 9 20252:28 PM ESTKey PointsChina has resumed purchases of U.S. soybeans after a monthslong boycott.But China has bought less than 3 million metric tons of soybeans since October, which is well short of the 12 million metric tons goal set by a trade deal with President Donald Trump.Trump on Monday announced a $12 billion aid package for American farmers.U.S. Treasury Secretary Scott Bessent delivers remarks during a roundtable discussion with farmers hosted by President Donald Trump in the Cabinet Room of the White House in Washington, Dec. 8, 2025.Alex Wong | Getty ImagesChina has resumed buying U.S. soybeans, but still lags goals set by a trade agreement with President Donald Trump, an NBC News analysis found.China previously was a top buyer of U.S. soybeans, but last spring stopped purchasing American soybeans because of a trade war launched by Trump.The country resumed purchasing soybeans in October after reaching a trade agreement with the United States.Under that deal, China promised to buy at least 12 million metric tons of U.S. soybeans during the last two months of 2025.Read more CNBC politics coverageTrump officials move to end student loan payment pause for millions of borrowersJudge unseals Ghislaine Maxwell grand jury materials, citing Epstein files actUkraine at 'critical moment' in war as European allies ramp up pressure on RussiaDemocrats establish AI working group as industry bolsters DC presenceEx-Trump lawyer Habba resigns as NJ U.S. attorney after disqualificationTrump announces $12 billion aid package for farmers caught up in trade warTrump says Netflix, WBD deal could be 'problem' as son-in-law backs Paramount bidSupreme Court to hear case on Trump birthright citizenship orderTrump can fire labor, employment board members without cause: Appeals courtTrump administration views Netflix, Warner Bros. deal with 'heavy skepticism'Costco adds Biden Commerce Sec. Raimondo to board after Trump tariff lawsuitNew York Times sues Pentagon, Hegseth over media access policyCongressional watchdog probes Trump FHFA chief Bill PulteJan. 6 pipe bomb suspect Brian Cole arrested, faces explosives charges, DOJ saysJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'But China has bought just 2.85 million metric tons of soybeans since Oct. 30, according to U.S. Department of Agriculture data compiled by NBC News.Treasury Secretary Scott Bessent recently said that China is on track to purchase 12 million metric tons of U.S. soybeans by the end of February. The Trump administration has said China would buy at least 25 million tons of soybeans in the next three years. Trump on Monday announced that he was giving $12 billion in aid to American farmers who have been affected by his trade war. Trump said that the aid will come from U.S. tariff revenues.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China is buying U.S. soybeans again — but falling short of goal set by Trump trade agreement",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238609-1765227335419-gettyimages-2250794852-aw1a9411_bsd1c8wq.jpeg?v=1765307646&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T19:28:38.000Z",
      "dateModified": "2025-12-09T19:28:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump ban on wind power projects overturned by federal judge",
    "url": "https://www.cnbc.com/2025/12/08/trump-ban-on-wind-power-projects-overturned-by-federal-judge.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108172672-1765308437884-108172672-1752670603147-gettyimages-2223833483-6e6a2361_copy_pexbla4m.jpg?v=1765308446&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T14:07:33.000Z",
    "description": "Power generating wind turbines tower over the rural landscape on July 5, 2025 near Pomeroy, Iowa.Scott Olson | Getty ImagesA federal judge on Monday s",
    "body": "Power generating wind turbines tower over the rural landscape on July 5, 2025 near Pomeroy, Iowa.Scott Olson | Getty ImagesA federal judge on Monday struck down President Donald Trump's sweeping ban on new wind power projects in the U.S., a major victory for an industry that has been singled out by the White House since the administration's first day.Judge Patti Saris of the U.S. District Court for the District of Massachusetts ruled that Trump's ban is \"arbitrary and capricious and contrary to law,\" tossing out the president's action in its entirety.  Trump issued a memorandum on Jan. 20 halting permits and leases for offshore and onshore wind farms, pending federal review. Saris said that federal agencies had failed to provide a reasoned explanation for such a drastic change in U.S. policy. Seventeen states led by New York Attorney General Letitia James sued Trump in May to overturn the president's ban. They argued it created \"an existential threat to the wind industry.\"watch now\"This is a big victory in our fight to keep tackling the climate crisis and protect one of our best sources of clean, reliable, and affordable energy,\" James said in a post Monday on social media platform X. States in the Northeast and mid-Atlantic in particular have been pursuing offshore wind projects to meet future energy demand as they seek to reduce carbon dioxide emissions. White House spokeswoman Taylor Rogers said in a statement that \"offshore wind projects were given unfair, preferential treatment while the rest of the energy industry was hindered by burdensome regulations.\"  watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump ban on wind power projects overturned by federal judge",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108172672-1765308437884-108172672-1752670603147-gettyimages-2223833483-6e6a2361_copy_pexbla4m.jpg?v=1765308446&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T14:07:33.000Z",
      "dateModified": "2025-12-09T14:07:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]