[
  {
    "title": "ICE Minneapolis shooting: Noem to deploy hundreds more federal agents to city",
    "url": "https://www.cnbc.com/2026/01/11/ice-minneapolis-shooting-noem.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240689-17654720522025-12-11t163917z_391446468_rc2geiawcjv6_rtrmadp_0_usa-congress-threats.jpeg?v=1765472080&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-11T18:44:03.000Z",
    "description": "U.S. Homeland Security Secretary Kristi Noem speaks during a House Homeland Security hearing entitled \"Worldwide Threats to the Homeland,\" on Capitol ",
    "body": "U.S. Homeland Security Secretary Kristi Noem speaks during a House Homeland Security hearing entitled \"Worldwide Threats to the Homeland,\" on Capitol Hill in Washington, D.C., U.S. Dec. 11, 2025.  Elizabeth Frantz | ReutersHomeland Security Secretary Kristi Noem on Sunday said the federal government will surge more law enforcement to Minneapolis after a U.S. citizen was shot and killed by an Immigration and Customs Enforcement agent on Wednesday. \"We're sending more officers today and tomorrow; they'll arrive, there'll be hundreds more, in order to allow our ICE and our Border Patrol individuals that are working in Minneapolis to do so safely,\" Noem said in an appearance on Fox News' \"Sunday Morning Futures.\" The latest surge comes after Renee Nicole Good, the U.S. citizen, was shot and killed by an Immigration and Customs Enforcement officer on Wednesday. Noem has said, without providing evidence, that Good was engaged in an act of domestic terrorism when she was shot.\"If you look at what the definition of domestic terrorism is, it completely fits the situation on the ground,\" Noem claimed in an interview on CNN's \"State of the Union.\" \"This officer was hit by her vehicle, she weaponized it, and he defended his life and those colleagues around him and the public.\" Good, 37, was shot by an ICE agent positioned in front of her car on Wednesday while driving her SUV forward after agents attempted to remove her from her vehicle. The ICE agent has been identified as Jonathan Ross, two sources familiar with the investigation told MS Now.Videos of the incident surfaced on Wednesday, prompting protests and nationwide scrutiny of the Trump administration's tactics as it carries out its mass deportation agenda. The administration and Noem have defended Ross, arguing that Good attempted to run him over with her vehicle, and have pledged to surge additional officers into Minneapolis. The administration had already moved more federal officers to the region amid reports of widespread social services fraud.Pressed by CNN host Jake Tapper over why she was comfortable labeling Good a domestic terrorist before an investigation into the shooting can play out, Noem said, without proof, \"Everything that I've said has been proven to be factual and the truth.\"Read more CNBC politics coverageNew cellphone video of Minneapolis ICE shooting incident revealedIran's leader accuses protesters of acting for TrumpTrump suggests U.S. military will hit cartels on 'land' in MexicoPortland: Border Patrol agent shoots 2 after ICE killing in MinneapolisTrump 'instructing' his 'Representatives' to buy $200B in mortgage bondsEpstein files: Reps ask judge to appoint special master for document releaseDemocrats have threatened to impeach Noem over the killing, while noting that an investigation into the incident is underway. On Thursday, state officials with Minnesota's Bureau of Criminal Apprehension claimed that the FBI is impeding the state-level investigation.Minneapolis Mayor Jacob Frey, in a Sunday interview on NBC's \"Meet the Press,\" demanded an impartial investigation of the incident.\"Let's have the investigation in the hands of someone that isn't biased,\" he said. \"Let's not have it exclusively run through the FBI at the federal government or the Department of Justice.\" \"When you've got a federal administration that is so quick to jump on a narrative as opposed to the truth, I think we all need to be speaking out,\" Frey added.Frey also bristled at Noem's characterization of Good's actions. \"They were trying to leave the scene; that is not a person that's trying to run an ICE agent over,\" Frey said.Noem on CNN blamed Frey and other Democrats, including Minnesota Gov. Tim Walz, for the killing, arguing their rhetoric has prompted people to attempt to obstruct ICE. Frey called for ICE to \"Get the f--- out of Minneapolis,\" in the immediate aftermath of the shooting.\"They've extremely politicized and inappropriately talked about the situation on the ground in their city, they've inflamed the public,\" Noem said on CNN Sunday. \"They've encouraged the kind of destruction and violence that we've seen in Minneapolis the last several days.\"Frey, asked on NBC to respond to Noem, said, \"I'm sorry I offended their delicate ears.\"\"I dropped an F-bomb, and they killed somebody. I think the 'killing somebody' is the inflammatory element here, not the F-bomb,\" Frey said. On NBC's \"Meet the Press\" on Sunday, White House Border Czar Tom Homan argued that everyone should \"let the investigation play out.\"\"I don't know what [the] secretary has that I don't,\" Homan said, though he said he believes what Good did was illegal.This story is developing. Please refresh for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ICE Minneapolis shooting: Noem to deploy hundreds more federal agents to city",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240689-17654720522025-12-11t163917z_391446468_rc2geiawcjv6_rtrmadp_0_usa-congress-threats.jpeg?v=1765472080&w=1920&h=1080"
      ],
      "datePublished": "2026-01-11T18:44:03.000Z",
      "dateModified": "2026-01-11T18:44:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "European markets open the week on a somber note as Fed Powell probe in focus",
    "url": "https://www.cnbc.com/2026/01/12/european-markets-live-updates-stoxx-600-ftse-dax-cac.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231481-1764054802400-gettyimages-2246869568-UK_BUSINESS.jpeg?v=1764120301&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T08:06:29.000Z",
    "description": "Lights on in skyscrapers and commercial buildings on the skyline of the City of London, UK, on Tuesday, Nov. 18, 2025. U.K. business chiefs urged Chan",
    "body": "Lights on in skyscrapers and commercial buildings on the skyline of the City of London, UK, on Tuesday, Nov. 18, 2025. U.K. business chiefs urged Chancellor of the Exchequer Rachel Reeves to ease energy costs and avoid raising the tax burden on corporate Britain as she prepares this year's budget.Bloomberg | Bloomberg | Getty ImagesLONDON — European stocks began the new trading week in negative territory as investors weigh geopolitical developments in Iran, and renewed pressure on Federal Reserve Chair Jerome Powell.The pan-European Stoxx 600 index was almost 0.2% lower shortly after the opening bell, with major bourses and sectors mainly in the red.The U.K.'s FTSE index opened 0.26% lower with Germany's DAX down almost 0.1%. France's CAC 40 was down 0.25% and Italy's FTSE MIB dropped 0.38%.Market watchers will be keeping an eye on the developments in Iran this week after widespread protests were met with a violent crackdown by the Iranian authorities. U.S. President Donald Trump is weighing options to take action against Iran, according to multiple reports on Sunday.The president has been shown potential plans, ranging from possible military strikes to action that doesn't include the military, according to MS Now and other media outlets, citing U.S. officials. Trump aides are reportedly set to brief the president Tuesday on measures, including military, cyber and economic, to follow through on his threats.In other news, U.S. Stock futures fell overnight after the Department of Justice opened a criminal investigation into Federal Reserve Chair Jerome Powell in an apparent escalation by Trump in his attempt to pressure the central bank.Powell confirmed in a video statement Sunday evening that federal prosecutors have opened a criminal investigation related to his Senate Banking Committee testimony on the renovation of Fed office buildings.Powell said the investigation was another attempt by Trump to influence the central bank's monetary policy and he would not bow to the pressure. His term as chair due to end in May.There are no major earnings or data releases in Europe on Monday.— CNBC's Jennifer Elias, John Melloy and Yun Li contributed to this market report. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "European markets open the week on a somber note as Fed Powell probe in focus",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231481-1764054802400-gettyimages-2246869568-UK_BUSINESS.jpeg?v=1764120301&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T08:06:29.000Z",
      "dateModified": "2026-01-12T08:06:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Walmart teams up with Google's Gemini to make it easier for shoppers to find and buy products",
    "url": "https://www.cnbc.com/2026/01/11/walmart-partners-with-google-gemini-on-shopping-tool.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229495-1763673071760-gettyimages-2247687115-jr_12925_4e6vzwin.jpeg?v=1763673473&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-11T15:42:17.000Z",
    "description": "A Walmart sign hangs on the exterior of the store on Nov. 20, 2025 in Hollywood, Florida. Joe Raedle | Getty ImagesWalmart and Google said Sunday that",
    "body": "A Walmart sign hangs on the exterior of the store on Nov. 20, 2025 in Hollywood, Florida. Joe Raedle | Getty ImagesWalmart and Google said Sunday that shoppers will soon be able to use Google's artificial intelligence assistant Gemini to more easily discover and buy products from the retail giant and its warehouse club, Sam's Club.Incoming Walmart CEO John Furner and Google CEO Sundar Pichai announced that the companies have teamed up on stage at the National Retail Federation's Big Show, an annual industry conference held at New York City's Javits Center. The CEOs did not say when the new feature will launch or share financial terms. The company said the experience will start first in the U.S. and then expand internationally.With the Google deal, Walmart is boosting its effort to keep up with customers who are using AI chatbots to save time or look for inspiration. Walmart announced a deal with a rival to Gemini, OpenAI's ChatGPT, in October to allow shoppers to make purchases with \"Instant Checkout,\" a feature that allows them to buy an item without leaving the AI chatbot. OpenAI recently launched that feature with Walmart and it has Instant Checkout deals with other retailers, including Etsy and several Shopify merchants like Skims, Vuori and Spanx.Walmart also has its own AI chatbot, a yellow smiley-faced assistant on its app called Sparky.\"The transition from traditional web or app search to agent-led commerce represents the next great evolution in retail,\" Furner said in a news release. \"We aren't just watching the shift, we are driving it.\"In his remarks on stage, Furner, who will step into Walmart's top role on Feb. 1, said Walmart is \"rewriting the retail playbook\" and, with AI, it's \"trying to close the gap between I want it and I have it.\"Pichai said that Google is excited to work with Walmart and described the adoption of AI as a \"transformative\" moment.For Walmart, the evolution of customers' shopping habits — such as searches that start in an AI chatbot rather than its own app or website — is reshaping the retailer's digital strategy. In a statement, David Guggina, Walmart U.S.'s chief ecommerce officer, said agentic AI \"helps us meet customers earlier in their shopping journey and in more places.\" \"Over time, these agents will make it easier for customers to find what they need, want and love,\" he said.Walmart leaders have also been vocal about how AI will change the workforce and employees' roles, comments that carry additional weight as the company is the largest private employer in the U.S.Walmart CEO Doug McMillon, who is retiring and will be succeeded by Furner, has spoken about the sweeping impact of the technology, saying that \"it's very clear that AI is going to change literally every job.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Walmart teams up with Google's Gemini to make it easier for shoppers to find and buy products",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229495-1763673071760-gettyimages-2247687115-jr_12925_4e6vzwin.jpeg?v=1763673473&w=1920&h=1080"
      ],
      "datePublished": "2026-01-11T15:42:17.000Z",
      "dateModified": "2026-01-11T15:42:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Malaysia and Indonesia block Elon Musk's Grok due to nonconsensual sexual content",
    "url": "https://www.cnbc.com/2026/01/12/malaysia-indonesia-block-elon-musks-grok-obscene-non-consensual-content.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250953-1768191951390-gettyimages-2254970254-kokovlis-notitle260110_npk4T.jpeg?v=1768192247&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T06:21:59.000Z",
    "description": "Nurphoto | Nurphoto | Getty ImagesMalaysia and Indonesia blocked access to Elon Musk's artificial intelligence chatbot Grok over the weekend due to co",
    "body": "Nurphoto | Nurphoto | Getty ImagesMalaysia and Indonesia blocked access to Elon Musk's artificial intelligence chatbot Grok over the weekend due to concerns that the tool was being used to generate nonconsensual, sexually explicit content. Malaysian regulators ordered temporary restrictions be placed on the chatbot from xAI on Sunday following \"repeated failures by X Corp\" to address risks associated with the AI tool.The move came just one day after Indonesia stepped in to pause access to Grok over similar concerns and summoned X officials on the matter, according to CNBC's translation of the statement.The Southeast Asian countries' actions come after it was discovered that xAI's Grok enabled users to easily generate and share images online that included nonconsensual explicit images and child sexual abuse material (CSAM).Musk's company had recently updated its Grok Imagine features, enabling easier image generation from text-based prompts on the chatbot, which is integrated with Musk's social media platform X, giving it a wide reach. Amid escalating concerns over Grok's content moderation policy, xAI announced it would limit image generation and editing features to paying subscribers, in an effort to patch safeguard gaps that permitted sexualized outputs. Musk, responding on X, has also asserted that users creating illegal content via Grok would face consequences equivalent to uploading such material directly to the social media platform. CNBC attempted to reach xAI for comment regarding the developments over the weekend. A press email for the company returned an automatic message that read \"Legacy Media Lies.\"\"Insufficient\" responses X's public and private responses amid the controversy have failed to satisfy the concerns of regulators in Indonesia and Malaysia, as well as others that have launched probes. The Malaysian Communications and Multimedia Commission said that X's \"insufficient\" replies have \"relied primarily on user-initiated reporting mechanisms and failed to address the inherent risks posed by the design and operation of the AI tool.\"\"Accordingly, the restriction is imposed as a preventive and proportionate measure while legal and regulatory processes are ongoing,\" the watchdog said. \"Access to Grok will remain restricted until effective safeguards are implemented, particularly to prevent content involving women and children.\" Both Indonesia and Malaysia maintain strict anti-pornography laws, which ban the sharing of obscene and sexual content online more broadly. Meanwhile, Indonesia's Ministry of Communications and Digital Affairs Meutya Hafid said that \"The government views nonconsensual sexual deepfakes as a serious violation of human rights, dignity, and citizens' security in the digital space.\"Hafid also categorized the misuse of AI for producing fake pornography as a form of \"digital-based violence,\" according to statements shared by state-owned Antara News.Authorities in other jurisdictions, including the European Union, the UK, Brazil, and India, have also called for probes into Grok's role in facilitating obscene deepfakes.A UK watchdog, the Internet Watch Foundation, said last week that its analysts had discovered \"criminal imagery\" of children aged between 11 and 13, which appears to have been created using Grok. Some Democratic lawmakers in Washington have recommended that app stores suspend the AI tool, at least until Musk implements major changes. In an email to CNBC last week, the Department of Justice said in a statement that \"it takes AI-generated child sex abuse material extremely seriously and will aggressively prosecute any producer or possessor of CSAM.\" \"We continue to explore ways to optimize enforcement in this space to protect children and hold accountable individuals who exploit technology to harm our most vulnerable,\" it added. — CNBC's Lora Kolodny contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Malaysia and Indonesia block Elon Musk's Grok due to nonconsensual sexual content",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250953-1768191951390-gettyimages-2254970254-kokovlis-notitle260110_npk4T.jpeg?v=1768192247&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T06:21:59.000Z",
      "dateModified": "2026-01-12T06:21:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What the Big Oil executives told Trump about investing in Venezuela",
    "url": "https://www.cnbc.com/2026/01/10/what-the-big-oil-executives-told-trump-about-investing-in-venezuela.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250797-1767993431085-gettyimages-2255449568-aw1a3909_ixnjfdqj.jpeg?v=1767993482&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-10T12:59:40.000Z",
    "description": "watch nowLeading U.S. oil executives told President Donald Trump at the White House on Friday that Venezuela will need major reforms to attract invest",
    "body": "watch nowLeading U.S. oil executives told President Donald Trump at the White House on Friday that Venezuela will need major reforms to attract investment. Trump said Friday the industry would invest at least $100 billion to rebuild Venezuela's energy sector with U.S. security guarantees. But the CEOs of big oil companies like ExxonMobil and ConocoPhillips did not commit at the meeting to quickly re-enter Venezuela. Exxon CEO Darren Woods told Trump that the Venezuelan market is \"uninvestable\" in its current state. Venezuela seized Exxon's and Conoco's assets in 2007, and Caracas owes the companies billions of dollars in outstanding claims from arbitration cases.\"We've had our assets seized there twice, and so you can imagine to re-enter a third time would require some pretty significant changes from what we've historically seen here,\" Woods told Trump at the White House. \"If we look at the legal and commercial constructs and frameworks in place today in Venezuela today, it's uninvestable.\" Exxon is prepared to send a technical team to evaluate the current state of Venezuela's oil industry and assets, Woods said. ConocoPhillips CEO Ryan Lance congratulated Trump on ousting former President Nicolás Maduro. He said the banking sector will need to help restructure Venezuela's debt and provide billions of dollars in financing for the restore the country's infrastructure. Lance also called for the restructuring of state-owned oil company Petróleos de Venezuela (PDVSA).\"As we think that big and bold, we need to be also thinking about even restructuring the entire Venezuelan energy system including PDVSA,\" Lance told the president. Trump told the Conoco CEO that the U.S. government is not looking at recovering the assets the company lost during the 2007 nationalization. \"We're not going to look at what people lost in the past, because that was their fault,\" Trump said. \"That was a different president. You're going to make a lot of money, but we're not going to go back.\"Chevron is the only U.S. oil major operating in Venezuela through joint ventures with PDVSA. Vice Chairman Mark Nelson said Chevron has a way forward to rapidly ramp up its production, which currently stands at about 240,000 barrels per day. \"We have a path forward here very shortly to be able to increase our liftings from those joint ventures 100% essentially effective immediately,\" Nelson told Trump. \"We are also able to increase our production within our own disciplined investment schemes by about 50% just in the next 18 to 24 months.\"Treasury Secretary Scott Bessent indicated Thursday that the U.S. might rely more on smaller oil companies, rather than the majors, to invest in Venezuela. \"The big oil companies who move slowly, who have corporate boards, are not interested,\" Bessent said Thursday at the Economic Club of Minnesota. \"I can tell you that the independent oil companies and individuals, wildcatters – our phones are ringing off the hook,\" Bessent said. \"They want to get to Venezuela yesterday.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What the Big Oil executives told Trump about investing in Venezuela",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250797-1767993431085-gettyimages-2255449568-aw1a3909_ixnjfdqj.jpeg?v=1767993482&w=1920&h=1080"
      ],
      "datePublished": "2026-01-10T12:59:40.000Z",
      "dateModified": "2026-01-10T12:59:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What a U.S. intervention in Iran could look like as Trump weighs options",
    "url": "https://www.cnbc.com/2026/01/12/iran-trump-military-intervention-strikes-venezuela-islamic-protests.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250926-1768176463058-gettyimages-2255173378-710a2861.jpeg?v=1768176479&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T06:44:05.000Z",
    "description": "LONDON, ENGLAND - JANUARY 11: People take part in a rally in solidarity with protesters in Iran on January 11, 2026 in London, England. Alishia Abodun",
    "body": "LONDON, ENGLAND - JANUARY 11: People take part in a rally in solidarity with protesters in Iran on January 11, 2026 in London, England. Alishia Abodunde | Getty Images News | Getty ImagesU.S. President Donald Trump is readying for a likely intervention in Iran, as the country cracks down on protestors, with several hundreds reportedly killed and internet access cut off.   The possible next steps could include boosting antigovernment sources online, deploying cyber weapons against the Iranian military and civilian sites, placing more sanctions on the regime as well as military strikes, The Wall Street Journal reported. Trump's aides are set to brief him on Tuesday on a possible intervention.The options being presented to Trump range from targeted strikes inside Iran to offensive cyber attacks, Politico also reported, citing an unnamed official familiar with the ongoing development. \"If the U.S. decides it needs to act to protect personnel or assets, or to protect energy flows, then it has a range of tools, from cyber and sabotage, to drones and missile strikes from air and sea,\" said Matt Gertken, chief geopolitical strategist at BCA Research.  The U.S. could also attack nuclear or military infrastructure or government facilities to reduce the regime's abilities and \"deter the regime from disruptive actions,\" Gertken added.  The unrest in Iran, which started in late December over soaring prices and the collapse of Iran's currency, has intensified and morphed into wider antigovernment protests that threaten the Islamic regime. Tehran has over the weekend stepped up action against protestors, with more the 500 people killed,  according to U.S.-based Human Rights Activists News Agency. Iran has warned the U.S. and Israel against any intervention, with President Masoud Pezeshkian on Sunday, blaming them for fueling the unrest. \"Iran is far more capable of retaliating against the U.S., especially by attacking regional energy infrastructure,\" Gertken said, adding that the Trump administration was \"not necessarily eager to destroy the regime\" unless it deteriorates \"so significantly that the U.S. finds it cannot pass up the opportunity to intervene to force a change of regime.\" Trump takes aim Trump's administration's playbook often \"changes day by day,\" but his threats still carry weight as Iran has long been on his agenda and the unrest swells into the \"deepest and most widespread protest\" in years that the regime does not have under control, Dan Yergin, vice chairman at S&P Global, told CNBC's \"Access Middle East.\"  Trump has openly backed Iranian protestors and telegraphed his interest in intervening several times on his Truth Social platform, saying that the U.S. would come to the \"rescue\" of Iranians if the authorities there continued to kill protesters. \"Iran is looking at FREEDOM, perhaps like never before. The USA stands ready to help!!!\" Trump said in a social media post Saturday. \"We're looking at it very seriously. The military is looking at it, and we're looking at some very strong options,\" Trump told reporters Sunday on Air Force One as he returned to Washington from his Mar-a-Lago home in Florida. \"We'll make a determination.\" The dilemma is at its peak: a strong strike could potentially undermine the regime's repression efforts, but at the same time it might lead to greater cohesion within the regime and a broader escalation.Danny CitrinowiczSenior Researcher, Institute for National Security StudiesTrump is also considering non-kinetic measures including cyber and covert action, according to Politico, noting the U.S. President was not expected to send American forces into the country and there has been no major movement of U.S. military assets. The U.S. is looking at restoring internet communications in Iran as its leaders have cut off internet and phone services in the country. \"We may get the internet going, if that's possible,\" Trump told reporters. \"We may speak to Elon Musk. I'm going to call him as soon as I'm finished with you.\" Iran has reportedly jammed Musk's Starlink during the latest protests. Even if the U.S. administration considers a \"symbolic\" kinetic strike, it could trigger a \"much broader escalation,\" said Danny Citrinowicz, a senior researcher at the Institute for National Security Studies.  \"The dilemma is at its peak: a strong strike could potentially undermine the regime's repression efforts, but at the same time it might lead to greater cohesion within the regime and a broader escalation,\" Citrinowicz said. \"Given the absence of leadership in the opposition, such a strike may achieve an operational success but not a strategic one,\" he added. Mohammad Baqer Qalibaf, Iranian Parliament speaker, warned during a session broadcast live by state television that Israel and \"all American military centers, bases and ships in the region will be our legitimate targets\" if the U.S. attacks Iran. Iran's Supreme Leader Ayatollah Ali Khamenei said last Friday that Iran's government will \"not back down\" amid the protests. The unrest comes as the Islamic republic has been increasingly vulnerable with leaders facing mounting internal and domestic strains and a population growing angrier over a deepening economic crisis. Its official currency rial has lost half of its value over the past year, plunging to record-lows of about 1 million rials per U.S. dollar, according to LSEG data. \"These protests, whatever the outcome, will further damage an already fractured legitimacy for a state system that is at the end of its life,\" said Sanam Vakil, director of Middle East and North Africa program at Chatham House. — CNBC's Dan Murphy contributed to this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What a U.S. intervention in Iran could look like as Trump weighs options",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250926-1768176463058-gettyimages-2255173378-710a2861.jpeg?v=1768176479&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T06:44:05.000Z",
      "dateModified": "2026-01-12T06:44:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World's most vital oil chokepoint back in focus amid possible U.S. action against Iran",
    "url": "https://www.cnbc.com/2026/01/12/strait-of-hormuz-back-in-focus-amid-possible-us-intervention-in-iran.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108162591-1750694632193-gettyimages-2221006178-AFP_63G96JB.jpeg?v=1750694774&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T07:55:33.000Z",
    "description": "Tankers are seen at the Khor Fakkan Container Terminal, the only natural deep-sea port in the region and one of the major container ports in the Sharj",
    "body": "Tankers are seen at the Khor Fakkan Container Terminal, the only natural deep-sea port in the region and one of the major container ports in the Sharjah Emirate, along the Strait of Hormuz, a waterway through which one-fifth of global oil output passes on June 23, 2025. Giuseppe Cacace | AFP | Getty ImagesThe Strait of Hormuz is once again back in focus as a possible U.S. intervention in Iran raises the risk of Tehran disrupting one of the world's most critical energy chokepoints.U.S. President Donald Trump is considering a range of options against Iran, according to multiple media reports on Sunday, as it cracks down on domestic protests. Industry experts cautioned that a military confrontation could provoke Iran to choke off the Strait of Hormuz, a narrow waterway that that connects the Persian Gulf and the Arabian Sea and through which nearly a third of the world's seaborne crude flows.\"A disruption through the Strait of Hormuz could cause a global oil and gas crisis\" especially when considering the \"desperate and ill advised lengths the current Iranian regime may go to\" should they find themselves increasingly backed into a corner with their power and lives at stake, said Saul Kavonic, head of energy research at MST Marquee. About 13 million barrels per day of crude oil transited the Strait of Hormuz in 2025, accounting for roughly 31% of global seaborne crude flows, data provided by market intelligence firm Kpler showed. The risk of the waterway being blocked had also surfaced during the flare-up between Washington and Tehran in June last year.As Iran's production and exports are far larger than Venezuela's, the global market would inevitably feel stronger ripple effects, said Muyu Xu, senior crude analyst at Kpler, adding that Chinese refiners could be forced to seek alternatives.Unlike Venezuela, any military action involving Iran carries \"materially higher risks\" given the volume of crude and refined product supply and transit exposure, said Bob McNally, president of Rapidan Energy Group, who sees a 70% likelihood of selective U.S. strikes on Iran.In an extreme escalation scenario, where tankers are unable to pass or energy infrastructure is damaged, oil prices could surge by double digits, said analysts.\"The fear of a closure will cause the price of oil to rise a few dollars per barrel, but it is the complete closure of the Strait that can result in a $10 to $20 per barrel spike,\" said Andy Lipow, president of Lipow Oil Associates.Kavonic sees an \"immediate oil price spike\" in the wake of any U.S. attack on Iran, but that will soften on any sign of the disruption being temporary. Global benchmark Brent last hovered around $63 a barrel, while U.S. West Texas Intermediate futures held at $59 per barrel.Most analysts stress that any catastrophic outcomes still remain low-probability events.While Iran can always threaten to close the Strait of Hormuz, they may not want to do so given the complexity of power dynamics in the region and may not have the capability to fully close it given how the U.S. Navy is patrolling the area, said Kpler's Xu.Even in a scenario where Iran attempts a temporary disruption, such as harassing tankers or briefly blocking transit, the physical impact on supply would be limited. Kpler estimates the oil market is currently tilting toward oversupply, with roughly 2.5 million barrels per day of excess supply in January and over 3 million barrels per day in February and March.Additionally, any closure will likely be met with a show of force by the U.S. and allies to restore flows again, Kavonic said.Still, experts cautioned against drawing direct parallels between Iran and Venezuela, where the Trump administration used sanctions, seizures to exert pressure on the Venezuelan regime, before capturing President Nicolás Maduro.It would be very difficult for the U.S. to adopt a strategy toward Iran similar to Venezuela, because Iran is far from U.S. soil and the geopolitical situation in the Middle East is a lot more complex than in Latin America, Xu said. \"Plus, Trump's priority right now appears to be consolidating U.S. power in the Western Hemisphere.\"Lipow echoed that view, saying a Venezuela-style playbook in Iran is more likely to involve sanctions and enforcement rather than military occupation or attacks on infrastructure.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World's most vital oil chokepoint back in focus amid possible U.S. action against Iran",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108162591-1750694632193-gettyimages-2221006178-AFP_63G96JB.jpeg?v=1750694774&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T07:55:33.000Z",
      "dateModified": "2026-01-12T07:55:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top Wall Street analysts recommend these dividend stocks for consistent income",
    "url": "https://www.cnbc.com/2026/01/11/top-wall-street-analysts-recommend-these-dividend-stocks-for-consistent-income.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214044-1760962400323-gettyimages-2234419123-20090101250912-99-09254.jpeg?v=1760962422&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-11T13:18:05.000Z",
    "description": "The IBM logo at the headquarters of IBM Germany in the Highlight Towers in Parkstadt Schwabing in Munich (Bavaria). Mattias Balk | Picture Alliance | ",
    "body": "The IBM logo at the headquarters of IBM Germany in the Highlight Towers in Parkstadt Schwabing in Munich (Bavaria). Mattias Balk | Picture Alliance | Getty ImagesIn a time of geopolitical tensions and macro uncertainty, dividend-paying stocks can offer investors some steady portfolio income.In this regard, recommendations of top Wall Street analysts can help investors pick attractive stocks of companies that generate solid cash flows to support continued dividend payments.Here are three dividend-paying stocks, highlighted by Wall Street's top pros, as tracked by TipRanks, a platform that ranks analysts based on their past performance.Permian ResourcesWe start this week with Permian Resources (PR), an independent oil and natural gas company with assets in the Permian Basin, with a concentration in the core of the Delaware Basin. At a base dividend of 15 cents per share (an annualized dividend of 60 cents per share), PR stock offers a dividend yield of 4.3%.In a recent research report, Siebert Williams analyst Gabriele Sorbara reiterated a buy rating on Permian Resources stock with a price forecast of $19, saying, \"Extending track record of operational execution with a near-term focus on 4Q25, where the implied oil production guidance midpoint is ~187.4 Mbbls/d on a capex of $484.6 mn.\" TipRanks' AI Analyst also has an \"outperform\" rating on PR stock with a price target of $16.Sorbara noted that Permian is sticking to its plan to reward shareholders through a quarterly dividend of 15 cents per share and opportunistic stock buybacks. Notably, the company has a $1 billion buyback authorization with no end date. The five-star analyst expects Permian to raise its dividend next year and beyond. Meanwhile, Sorbara expects the company to release its 2026 outlook in February once it finalizes a plan that fits the commodity price and service cost backdrop. The analyst expects Permian to benefit from several positives in 2026, including lower drilling costs, an increased production base in the second half of last year, steady operational strength, and better pricing from recent deals. Sorbara expects these tailwinds to drive efficiency in production, capital spending and free cash flow.Additionally, Sorbara noted Permian's efforts to further strengthen its balance sheet, aiming for a long term net-debt/EBITDA (earnings before interest, taxes, depreciation, and amortization) target of 0.5x-1.0x. Also, the $500 million to $1 billion of cash on hand gives the company flexibility to execute capital allocation options like acquisitions, buybacks, and debt reduction even at West Texas Intermediate crude prices in the range of $35 to $40/bbl.Sorbara ranks No. 522 among more than 10,400 analysts tracked by TipRanks. His ratings have been successful 52% of the time, delivering an average return of 15.4%. See Permian Resources Ownership Structure on TipRanks.International Business MachinesTech giant IBM (IBM) is this week's second dividend pick. The company returned $1.6 billion in dividends to shareholders in the third quarter of 2025. With a quarterly dividend of $1.68 per share (annualized dividend of $6.72 per share), IBM offers a yield of 2.2%.Recently, Jefferies analyst Brent Thill upgraded IBM stock to buy from hold and raised the price target to $360 from $300, citing \"a clearer path to software acceleration, improving fundamentals, and valuation not yet fully reflecting the software premium.\" TipRanks' AI Analyst has an \"outperform\" rating on IBM stock with a price target of $354.The five-star analyst noted management's more favorable outlook across key growth areas, with tech transformation and rapid AI adoption fueling broad-based demand. Thill noted that improving regulatory and tax policies, solid organic software growth, synergies from recent mergers and acquisitions and key wins in generative AI consulting are also supporting management's optimism.Notably, synergies from the HashiCorp acquisition and the pending Confluent (CFLT) deal are expected to drive accelerated software growth in 2026 compared to just under 10% exiting 2025. Thill also expects IBM to deliver consistently improving margins (estimates pretax margin of 21% in 2027 compared to 19% in 2025), driven by a growing software mix and operational discipline.With IBM trading at 26x 2027 P/E multiple, compared to the large-cap software peer average of 35x, Thill finds the stock's valuation attractive and contends that it still has upside as the software reacceleration expectation is not priced in.Thill ranks No. 539 among more than 10,400 analysts tracked by TipRanks. His ratings have been successful 61% of the time, delivering an average return of 11%. See IBM Statistics on TipRanks. Kinetik HoldingsKinetik Holdings (KNTK) is a midstream energy company focused on the Delaware Basin in the Permian. With a quarterly cash dividend of 78 cents per share (an annualized dividend of $3.12 per share), KNTK stock offers a yield of 8.5%.On Jan. 5, Raymond James analyst Justin Jenkins upgraded Kinetik stock to buy from hold with a price target of $46. In comparison, TipRanks' AI Analyst has a \"neutral\" rating with a price target of $34.\"The stock is down ~38% TTM, and the magnitude of that reset is a core component of our thesis as investor focus shifts toward 2026-27, where operational visibility improves while valuation continues to reflect meaningful skepticism,\" said Jenkins.Jenkins believes that KNTK's risk-reward is getting more attractive, with the earnings outlook for 2026 to 2027 becoming clearer. The improving earnings expectations are backed by more meaningful full-year contributions from the Kings Landing project and better system connectivity as the ECCC pipeline moves toward its Q2 2026 start-up.The analyst's optimism is also backed by its acid-gas injection project, planned for late 2026, which will open access to more sour gas and ease utilization constraints in the Delaware system. Jenkins also expects several macro and operational factors that affected 2025 performance to improve into mid-2026, including Waha price conditions and additional volumes tied to Permian dry gas expansion.Trading at about 8x 2027 EV/EBITDA, at the low end of the midstream peer group valuation range of 8x to 12x, Jenkins finds KNTK stock attractive, with the balance sheet getting stronger after the divestiture of its equity interest in EPIC Crude Holdings, LP. Interestingly, Jenkins sees the possibility of KNTK being a buyout target for midstream companies that want to combine more Permian NGL (natural gas liquids) volumes.Jenkins ranks No. 63 among more than 10,400 analysts tracked by TipRanks. His ratings have been profitable 74% of the time, delivering an average return of 17.1%. See Kinetik Holdings Financials on TipRanks. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top Wall Street analysts recommend these dividend stocks for consistent income",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214044-1760962400323-gettyimages-2234419123-20090101250912-99-09254.jpeg?v=1760962422&w=1920&h=1080"
      ],
      "datePublished": "2026-01-11T13:18:05.000Z",
      "dateModified": "2026-01-11T13:18:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why most Greenlanders favor a future without Trump — or Denmark",
    "url": "https://www.cnbc.com/2026/01/12/greenland-independence-denmark-trump-military-operation.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250368-1767951493013-gettyimages-2207659302-GREENLAND_NUUK.jpeg?v=1767951552&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T07:32:57.000Z",
    "description": "A snow-cleared asphalt road outside Sisimiut, Greenland, on Monday, March 31, 2025.Bloomberg | Bloomberg | Getty ImagesGreenland has been thrust into ",
    "body": "A snow-cleared asphalt road outside Sisimiut, Greenland, on Monday, March 31, 2025.Bloomberg | Bloomberg | Getty ImagesGreenland has been thrust into a geopolitical firestorm as U.S. President Donald Trump ramps up his threats to annex the self-governing Danish territory.But, while Trump says the U.S. needs the huge Arctic island for its national security, and European leaders have responded that security is a collective endeavor, independence for the island of just 57,000 people remains a long-term goal.Opinion polls have shown that Greenlanders overwhelmingly oppose U.S. control, while a strong majority support independence from Denmark.The White House has said Trump and his national security team are \"actively\" discussing a potential offer to buy Greenland — and that while diplomacy is the first option, all options, including military force, were on the table.\"For many years, the majority of Greenlanders have been fighting for our right to represent ourselves,\" Aaja Chemnitz, a pro-independence MP and one of two lawmakers in the Danish parliament representing Greenland, told CNBC by video call.\"We say nothing about us without us — and that's why it's important for us to still fight for making sure that we have even more autonomy in the time to come,\" she added. watch nowChemnitz said the \"U.S. used to be a very close ally just a year ago,\" and that Greenlanders wanted to \"make sure that we're not dehumanized, which I think we have been in this whole situation.\"\"Greenland never has been for sale and never will be for sale,\" she added. \"The people are resilient. And I think it's important to remember that, of course, you can't buy a country, but you can also not buy a population.\"Greenland was granted greater autonomy over its affairs through the Self-Government Act in 2009, a motion that enables the island the right to hold an independence referendum. Denmark, however, remains responsible for its foreign, defense and security policies. Lawmakers presented a draft constitution in 2023 for an independent Greenland, but there were no immediate plans to adopt it. To be sure, most Greenlandic political parties support independence, but disagree over when and how to reach it. Indeed, the independence movement has become something of a balancing act between the island's ultimate goal of self-determination and the need for Denmark's financial support for essential welfare services, such as health and education. Last January, Greenland's then-Prime Minister Múte Egede said that it was time to take the next step toward independence. His successor, Jens-Frederik Nielsen, who led the center-right Democrats to a surprise victory in parliamentary elections last March, favors a more gradual path. Read moreChemnitz, a member of the Inuit Ataqatigiit party and chair of the Greenland Committee, told CNBC that the Arctic island's independence push is a long-term goal, given the need to be on \"good economic terms\" to maintain living standards.Trump previously sought to buy Greenland in 2019 during his first term as U.S. president, only to be told the island was not for sale.Now, the prospect of U.S. military action in Greenland has triggered a strong response from Denmark, with Prime Minister Mette Frederiksen warning that a U.S. attack would mark the end of the NATO military alliance.Approximately 1,500 protesters rally outside the U.S. Embassy, condemning U.S. pressure on Greenland and Denmark and denouncing the U.S. government's controversial visit to Greenland in Copenhagen, Denmark, on March 29, 2025.Nurphoto | Nurphoto | Getty ImagesThe issue has raised alarm in Europe, particularly given that Trump's renewed interest follows a U.S. military operation in Venezuela to depose that country's president, Nicolas Maduro on Jan. 3.U.S. Secretary of State Marco Rubio said Wednesday that he intends to hold talks with Danish officials to discuss the Arctic island.Trump's takeover threatsClayton Allen, head of practice at Eurasia Group, a political risk consultancy, said that like many externally governed territories, there would always be some political appetite for independence.\"I'm not sure that pressures from the U.S. for greater sovereign control of Greenland are necessarily going to be the way that they want to do that,\" Allen told CNBC by video call.\"Put simply, I don't know that people are going to want to trade one foreign power for another. If you want to be independent, you want to be independent,\" he added. watch nowOtto Svendsen, associate fellow with the Europe, Russia and Eurasia Program at the Center for Strategic and International Studies, a Washington-based think tank, said external observers should tread carefully when assessing the impact of Trump's takeover threats on Greenland's independence movement.He told CNBC the movement has been \"present for decades\" and has secured a commitment from the Danish government to respect the results of any independence referendum.Svendsen added the feeling in Greenland's capital, Nuuk, was that Trump's \"very overt attempts to bring Greenland closer to the United States\" would harm the prospects of independence, as \"one of the best cards up the sleeves of the government in Nuuk is to rely on the deterrent value of Denmark.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why most Greenlanders favor a future without Trump — or Denmark",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250368-1767951493013-gettyimages-2207659302-GREENLAND_NUUK.jpeg?v=1767951552&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T07:32:57.000Z",
      "dateModified": "2026-01-12T07:32:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Inside GM's new world headquarters: Modernized midcentury designs with artifacts, surprises from the American icon ",
    "url": "https://www.cnbc.com/2026/01/11/gm-hq-detroit-artifacts-company-history.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250740-1767989464225-1_lighted_General_Motors_corporate_logo_shines_from_the_Hudsons_Detroit_building.jpg?v=1767991996&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-11T09:00:01.000Z",
    "description": "A 1963 Chevrolet K20 pickup truck and a new Chevrolet Silverado EV sit outside General Motors' new world headquarters on Jan. 6, 2026 in Detroit.Micha",
    "body": "A 1963 Chevrolet K20 pickup truck and a new Chevrolet Silverado EV sit outside General Motors' new world headquarters on Jan. 6, 2026 in Detroit.Michael Wayland | CNBCDETROIT – Outside General Motors' new world headquarters, between the 12-story building and the city's first new skyscraper in more than 30 years, sit two red Chevrolet pickup trucks. One is a 1963 Chevrolet K20. The other is a new Silverado EV. The trucks, while part of a temporary holiday display, are symbolic of what's inside the new global offices for the Detroit automaker: its past and present, woven together.GM is occupying four of six office floors of the building and has filled them with artifacts, design nods and \"Easter eggs\" tied to the Detroit automaker's history. They range from a blueprint of GM's iconic design dome and an early map of its nearby proving grounds to an interior wallpaper of 300 patented technologies and a decorative wall of cassette tapes with songs featuring the automaker's brands as well playful references to executive stalwarts such as CEO Mary Barra and President Mark Reuss.One of the centerpiece objects of GM's new headquarters is the McCormick Speed Form, an aerodynamic wind-tunnel model developed at the Warren Technical Center.Courtesy: GM\"Leadership asked when we were helping design the space to bring in some Easter eggs and details to represent who we are at GM, you know, honoring our culture and our history and our innovation,\" Rebecca Waldmeir, GM industrial design architecture and experience manager, told CNBC during a tour of the new headquarters.Other surprises include references to relevant Detroit streets, design influences from GM's famed design campus in suburban Detroit and artwork and sculptures of its products.Aside from the aesthetics, GM officials say the new offices will assist with collaboration and are more relevant to how the company expects its employees to work in a post-pandemic world. It will house executive offices and other corporate functions such as marketing, legal and finance.\"A headquarters really should be, at some level, a beacon for the culture of the company,\" said David Massaron, GM vice president of infrastructure and corporate citizenship. \"When you come in here, it should help people understand who we want to be.\"A wall inside GM's new Detroit headquarters includes cassette tape cases featuring songs referencing the automaker's brands and vehicles as well as custom ones featuring GM executives such as CEO Mary Barra and President Mark Reuss.Michael Wayland | CNBCFrom fortress to functionalityThe new headquarters marks a significant square-foot reduction for the automaker's corporate office — from a towering complex called the Renaissance Center along the city's riverfront to just four floors, roughly 200,000 square feet, in the new building.GM's new HQ is less than a mile from the RenCen, as it's commonly called, which has been a symbol for the city since, ironically, Ford Motor built the complex but decided not to make it its headquarters in the 1970s. GM purchased the building in 1996 as its third headquarters, all of which have been in the Motor City.The RenCen is Detroit's fortress, a 5.6-million-square-foot complex complete with a more-than-700-foot center tower surrounded by four 500-foot towers and two smaller adjacent ones. GM's new headquarters at the Hudson's Detroit development in the city's downtown.Courtesy: GMThe complex is infamously difficult to get in and out of and to navigate. For much of its existence, it was surrounded by concrete barriers before a redesign around the turn of the millennium. It has long been something of a physical permutation of GM's historically siloed culture, which Barra has made a priority to change during her roughly 11-year tenure as CEO.\"The RenCen was designed in a different era, in a pre-Covid era where everybody went to work five days a week, everybody went to their desk,\" Massaron said. \"Particularly, in a post-pandemic world, you need office space that people want to come to, because we have options.\"GM's roughly 50,000 U.S. salaried employees are currently required to work in-office Tuesday through Thursday, but the rules are more flexible than before regarding location and remote working. The Renaissance Center (complex of skyscrapers with the Chrevrolet sign) by the Detroit River.Roberto Machado Noa | Lightrocket | Getty ImagesMost of the company's new executive offices on the top floor of the building will be open for executives to use as they please, Massaron said. Only four of the offices will be permanently assigned to top GM executives, such as Barra and Reuss, he said.GM declined to disclose how many employees are expected to regularly work at the new headquarters, saying foot traffic will fluctuate based on priorities and workflows. The company also declined to disclose financial details of its 15-year lease at the new headquarters.The building complex, known as Hudson's Detroit, is owned by a real estate company of Rocket Companies chairman and billionaire Dan Gilbert, who has been purchasing and renovating properties in Detroit for more than a decade.Showroom, pickleball Aside from the office areas and the executive floor, which all overlook an open atrium, GM also plans to open a semi-public space to display products and host events on the first floor of the building. Other amenities include social gathering areas and lounges, food and beverage services and a pickleball court and recreation area. A common area outside of the executive offices of GM's new headquarters in downtown Detroit.Michael Wayland | CNBCGM's new headquarters, which remains under construction, comes months after Ford christened a new 2.1-million-square-foot global HQ and product design and development center in nearby Dearborn, Michigan.Ford's new facility includes offices, design and industrial operations and a host of amenities such as a 160,000-square-foot dining area with eight \"kitchen concepts,\" multiple courtyards and other upgrades.The notable difference in the size between GM's and Ford's new headquarters comes down to location, headcount and the automakers' portfolios of offices and operations throughout the region.A pickleball court and seating area inside the building that includes GM's new headquarters in Detroit.Michael Wayland | CNBCGM, for example, has a vast technology and design center that occupies 710 acres in nearby Warren, Michigan. That campus houses more than 24,000 employees. Massaron said GM didn't feel it needed to create \"a city within a city\" for its new headquarters, because it's actually \"a building within a city.\"Here's a look inside GM's new world headquarters:The entry of the executive floor inside GM's new global headquarters in Detroit.Michael Wayland | CNBCThe executive hallway of GM's new headquarters in Detroit.Courtesy: GMOne of a dozen or so executive offices inside GM's new headquarters in downtown Detroit.Michael Wayland | CNBCOne of a dozen or so executive offices inside GM's new headquarters in downtown Detroit.Michael Wayland | CNBCThe interior design draws inspiration from Eero Saarinen’s iconic GM Global Technical Center, incorporating golden\nmetallic finishes, wood feature walls, warm recessed lighting and a blend of clean linear geometries with subtle\ncurves.Courtesy: GMPatent wall graphics highlight 300 of more than 49,000\npatents granted since the company’s founding in 1911.Courtesy: GMA wall of cassette tapes celebrates GM’s broad cultural impact, nodding to the more than 78,000 songs that\nreference GM brands and vehicles.Courtesy: GMA model of the Chevrolet Corvette CX concept hangs on the wall outside the executive boardroom of GM's new headquarters.Courtesy: GMThe executive boardroom inside GM's new headquarters in Detroit.Courtesy: GMInside the common atrium area of GM's new global headquarters in Detroit.Michael Wayland | CNBCA coffee shop and cafe inside the atrium area of GM's new global headquarters in Detroit.Michael Wayland | CNBCA common lounge area near the atrium of the building that houses GM's new headquarters in Detroit.Michael Wayland | CNBCThree-dimensional sound-wave art profiles feature engine and EV tones from notable GM vehicles across\nperformance, EV and ICE categories, transforming acoustic engineering into sculptural expression.Courtesy: GMA statue of GM's \"Cadillac Goddess\" sits on a table inside the executive floor of its new headquarters in Detroit.Michael Wayland | CNBC",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inside GM's new world headquarters: Modernized midcentury designs with artifacts, surprises from the American icon ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250740-1767989464225-1_lighted_General_Motors_corporate_logo_shines_from_the_Hudsons_Detroit_building.jpg?v=1767991996&w=1920&h=1080"
      ],
      "datePublished": "2026-01-11T09:00:01.000Z",
      "dateModified": "2026-01-11T09:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fed Chair Powell says he's under criminal investigation, won't bow to Trump intimidation",
    "url": "https://www.cnbc.com/2026/01/12/fed-jerome-powell-criminal-probe-nyt.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108176748-17533904772025-07-24t205335z_1716152589_rc28tfaxc9sf_rtrmadp_0_usa-trump-fed.jpeg?v=1753390550&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T06:34:12.000Z",
    "description": "US Federal Reserve Board Chairman Jerome Powell speaks during a news conference following a Federal Open Market Committee (FOMC) meeting in Washington",
    "body": "US Federal Reserve Board Chairman Jerome Powell speaks during a news conference following a Federal Open Market Committee (FOMC) meeting in Washington, DC, on Dec. 10, 2025.Saul Loeb | AFP | Getty ImagesFederal prosecutors are conducting a criminal investigation of Federal Reserve Chairman Jerome Powell focused on the $2.5 billion renovation to the central bank's headquarters in Washington, D.C., and his related testimony to Congress, he said on Sunday evening.Powell said the probe is the result of longstanding frustration by President Donald Trump over the Fed's refusal to cut interest rates as quickly and as much as the president has demanded. \"The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the President,\" Powell said in a video statement tweeted by the Fed's X account.The chairman warned that the outcome of the investigation will determine the future of the central bank's decisions.\"This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions — or whether instead monetary policy will be directed by political pressure or intimidation,\" Powell said. Stock futures fell on the heels of Powell's statement.Powell said the Department of Justice on Friday served the Fed \"with grand jury subpoenas threatening a criminal indictment related to my testimony before the Senate Banking Committee last June.\"\"That testimony concerned, in part, a multi-year project to renovate historic Federal Reserve office buildings,\" he said.The threat of indictment, Powell said, \"is not about my testimony last June or about the renovation of the Federal Reserve buildings.\"U.S. President Donald Trump looks at Federal Reserve Chair Jerome Powell holding a document during a tour of the Federal Reserve Board building, which is currently undergoing renovations, in Washington, D.C., U.S., July 24, 2025. Kent Nishimura | Reuters\"It is not about Congress's oversight role; the Fed, through testimony and other public disclosures, made every effort to keep Congress informed about the renovation project,\" he said. \"Those are pretexts.\"\"I have deep respect for the rule of law and for accountability in our democracy,\" Powell said in his statement. \"No one, certainly not the chair of the Federal Reserve, is above the law, but this unprecedented action should be seen in the broader context of the administration's threats and ongoing pressure.\"\"I have served at the Federal Reserve under four administrations, Republicans and Democrats alike,\" Powell said. \"In every case, I have carried out my duties without political fear or favor, focused solely on our mandate of price stability and maximum employment,\" he said. \"Public service sometimes requires standing firm in the face of threats. I will continue to do the job the Senate confirmed me to do, with integrity and a commitment to serving the American people.\" A DOJ spokesperson, in a statement to CNBC, without saying the comment was about Powell, said, \"The Attorney General has instructed her US Attorneys to prioritize investigating any abuse of taxpayer dollars.\"Read more CNBC politics coverageNew cellphone video of Minneapolis ICE shooting incident revealedIran's leader accuses protesters of acting for TrumpTrump suggests U.S. military will hit cartels on 'land' in MexicoPortland: Border Patrol agent shoots 2 after ICE killing in MinneapolisTrump 'instructing' his 'Representatives' to buy $200B in mortgage bondsEpstein files: Reps ask judge to appoint special master for document releaseThe New York Times first reported the probe, citing officials briefed on the matter. A person familiar with the investigation told CNBC that they would not dispute the idea that the probe of Powell is related to the building renovation and his testimony to Congress.The investigation is being overseen by the U.S. Attorney's Office for the District of Columbia, according to the newspaper. That office is led by U.S. Attorney Jeanine Pirro, a former New York state prosecutor and Fox News host, who was appointed to her post by Trump.Trump, in an interview with NBC News on Sunday evening, said, \"I don't know anything about it,\" referring to the criminal probe of Powell.\"But he's certainly not very good at the Fed, and he's not very good at building buildings,\" Trump told the news outlet.Trump has repeatedly blasted Powell for the Fed not cutting interest rates as much and as quickly as the president has demanded since entering the White House in January 2025.But the president told NBC on Sunday that the DOJ's subpoenas do not have anything to do with interest rates, according to the outlet.\"No. I wouldn't even think of doing it that way,\" Trump said. \"What should pressure him is  the fact that rates are far too high. That's the only pressure he's  got.\"Trump on Dec. 29 said, \"We're thinking about bringing a suit against Powell for incompetence\" in connection with the renovation of Fed buildings.\"It's going to end up costing more than $4 billion,\" Trump said. \"Highest price of construction per square foot in the history of the world.\" Trump also said that day that \"I would love to fire him.\"U.S. President Donald Trump speaks to the media during a tour of the Federal Reserve Board building, which is currently undergoing renovations, in Washington, D.C., U.S., July 24, 2025. Kent Nishimura | ReutersThe probe came to light nearly six months after Rep. Anna Paulina Luna, R-Fla., first said she had referred Powell to the DOJ for the potential crimes of perjury and false statements to federal officials in connection with his testimony about the renovation project for the Fed's headquarters.\"I laid out, in detail, how Jerome Powell lied under oath to Congress and misrepresented facts in official communications to senior administration officials, including OMB Director Russell Vought,\" Luna said in a tweet on Sunday. \"Unelected bureaucrats do not get a free pass. This is exactly why oversight exists, and I am thankful the @DOJ  is taking this seriously. No one is above the law.Trump has made no secret of his intention to remove Powell as chair after his term expires in May. The two leading contenders are believed to be former Fed Gov. Kevin Warsh and Kevin Hassett, the current director of the National Economic Council.Sen. Thom Tillis, a North Carolina Republican and a member of the Senate Banking Committee, blasted the investigation of Powell and said that he would oppose the nomination of Powell's replacement by Trump, and any other Fed Board nominee, \"until this legal matter is fully resolved.\"\"If there were any remaining doubt whether advisers within the Trump Administration are actively pushing to end the independence of the Federal Reserve, there should now be none,\" Tillis said in a statement.\"It is now the independence and credibility of the Department of Justice that are in question,\" the senator said.Senate Minority Leader Chuck Schumer, a New York Democrat, said Trump's \"assault on the Fed's independence continues,\" adding that the president is threatening the strength and stability of the U.S. economy.\"This is the kind of bullying that we've all come to expect from Donald Trump and his cronies. Anyone who is independent and doesn't just fall in line behind Trump gets investigated,\" Schumer said in a statement. \"Jay Powell and the Fed aren't the reason Trump's economy and his poll numbers are in the toilet. If he's looking for the person who caused that he should look in the mirror.\"Sen. Elizabeth Warren of Massachusetts, the ranking Democrat on the Banking Committee, echoed Tillis.\"As Donald Trump prepares to nominate a new Fed Chair, he wants to push Jerome Powell off the Fed Board for good and install another sock puppet to complete his corrupt takeover of America's central bank,\" Warren said in a statement.\"Trump is abusing the authorities of the Department of Justice like a wannabe dictator so the Fed serves his interests, along with his billionaire friends,\" Warren said. \"This Committee and the Senate should not move forward with any Trump nominee for the Fed, including Fed Chair.\"Brian Jacobsen, chief economic strategist at Annex Wealth Management, in a note to clients on Sunday, wrote, \"President Trump is trying to bring criminal charges against Powell related to his testimony before Congress about the Fed's headquarters renovation.\"\"Powell may protest by staging a sit-in. His term as Chair is up in May, but his term as a governor isn't up until January 2028,\" Jacobsen wrote.\"With the political pressure on the Fed, he may choose to stay on as a governor out of spite. It would deprive President Trump of the ability to stack the board with another appointee,\" Jacobsen wrote. \"Stephen Miran's term is up in January 2026 and that may be the only vacancy Trump gets to fill. It would be unconventional for Powell to stay on, but everything these days is unconventional.\"Trump nominated Powell to the Fed chair position in 2017; he was confirmed in 2018.But almost from the onset of Powell's term, Trump has repeatedly badgered the Fed chair about interest rates. At various times, Trump has called Fed officials \"boneheads\" and once referred to Powell as a golfer who cannot putt.Those criticisms intensified during Trump's second term, as he hectored the central bank to cut rates for months, even after it implemented three consecutive quarter-percentage-point reductions beginning in September.During that time, Trump installed his handpicked choice, Miran, as a Fed governor and has sought to remove another governor, Lisa Cook, from the board over allegations that she committed mortgage fraud.Cook denies those claims, which were made in the form of criminal referrals to the DOJ by Federal Housing Finance Agency Director Bill Pulte, who has been an attack dog against perceived enemies of Trump, who appointed Pulte to his post.The Supreme Court is set to hear arguments on a case challenging Cook's removal later in January.Krishna Guha, vice chairman of Evercore ISI and head of its Global Policy and Central Bank Strategy Team, in a note to clients on the probe of Powell, said, \"We are stunned by this deeply disturbing development which came out of the blue after a period in which tensions between Trump and the Fed seemed to be contained.\"\"We expect the dollar, bonds and stocks to all fall in Monday trading in a sell-America trade similar to that in April last year at the peak of the tariff shock and earlier threat to Powell's position as Fed chair, with global investors applying a higher risk premium to US assets,\" Guha said. \"Gold and other safe havens should rally.\"— CNBC's Jeff Cox, Eamon Javers, and Garrett Downs contributed to this article",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fed Chair Powell says he's under criminal investigation, won't bow to Trump intimidation",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108176748-17533904772025-07-24t205335z_1716152589_rc28tfaxc9sf_rtrmadp_0_usa-trump-fed.jpeg?v=1753390550&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T06:34:12.000Z",
      "dateModified": "2026-01-12T06:34:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China's AI and robotics push isn't enough to kickstart its economy, leaving growth more exposed to trade risks",
    "url": "https://www.cnbc.com/2026/01/12/china-ai-robotics-tech-push-property-slump-trade-risk-rhodium-kkr.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250932-1768179128415-gettyimages-2255363049-img_4849.jpeg?v=1768179152&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T05:33:07.000Z",
    "description": "A tower crane stands above residential buildings in an urban district in the afternoon light, on January 9, 2026, in Chongqing, China.Cheng Xin | Gett",
    "body": "A tower crane stands above residential buildings in an urban district in the afternoon light, on January 9, 2026, in Chongqing, China.Cheng Xin | Getty Images News | Getty ImagesBEIJING — China's push into high-tech industries isn't large enough to offset the country's property slump, leaving the economy more exposed to trade tensions, U.S.-based research firm Rhodium Group said in a report Monday.From 2023 to 2025, new industries such as artificial intelligence, robotics and electric cars added just 0.8 percentage points to economic output, while real estate and other traditional sectors saw a combined 6 percentage point decline, the report said. The analysis drew on official Chinese data and industry-specific sources.The findings come as China seeks to boost technological self-reliance in response to U.S. restrictions. Under a five-year development plan set to kick off in earnest in March, Beijing is doubling down on advanced technologies with state investment and favorable policies.\"China's growth strategy isn't going to work,\" Logan Wright, partner at Rhodium and a co-author of the report, told CNBC. \"They're not going to achieve their targeted rates of GDP growth based on the policies they have outlined so far.\"watch nowBeijing has targeted annual GDP growth of around 5% in recent years. For China to sustain that pace, new industries would need to expand sevenfold over the next five years to generate the roughly 2 percentage points of annual investment growth required, Rhodium estimated.That translates to an additional 2.8 trillion yuan in new investment required this year — or 120% more than in 2025. While investment in artificial intelligence or robotics could increase in the next year or two, other emerging industries are unlikely to sustain such rapid growth, the analysts said.\"Electric vehicles have likely already reached their fastest rates of growth, and output in the industry may be slowing in the years ahead,\" the Rhodium report said. Property drag deepensWhile Beijing has prioritized high-tech development, it has taken fewer steps to address a yearslong slump in real estate. The sector once accounted for more than a quarter of the economy. New home sales by floor area last year fell to levels not seen since 2009, according to a report last week by the China Real Estate Information Corp.Only in recent weeks have sighs appeared that some policymakers are considering more forceful property support. China's top leaders are due to formalize economic targets for the year at an annual parliamentary meeting in March.A macro outlook published by global investment firm KKR estimated that property weakness will shave 1.2 percentage points off China's GDP growth this year. Even with a projected 2.6 percentage point contribution from digital technologies, the estimated total growth was still on the low end at 4.6%. \"Despite a potential 5% growth target for 2026, headwinds from real estate and a weak job market cast doubt on achievability,\" the report said. KKR predicts the property drag could halve in 2027, but sees limited improvement in digital industries or consumer demand.From jobs to trade tensionsAn overemphasis on tech could have broader economic consequences.New industrial sectors may offer higher wages, but they employ far fewer people than traditional industries, the Rhodium analysis found. Increased factory automation, coupled with China's already high 30% share of global manufacturing output, could lead to the loss of up to 100 million jobs over the next decade — a displacement that would exceed the total workforce of most developed economies, KKR said.China's urban unemployment rate remained above 5% for much of last year, while youth unemployment has been about three times higher.Since it's unlikely that domestic investment, even in newer industries, will produce sufficient demand, \"Beijing will become even more dependent upon gaining market share in export markets,\" the Rhodium report said.\"China will remain even more reliant upon exports in the future, leaving the economy vulnerable to new trade restrictions,\" the report said.As lower-priced Chinese goods, including electric vehicles, have expanded overseas, Mexico and the European Union have joined the U.S. in raising tariffs on imports from China. \n\t\t\n\t\t\n\t\t\n\t\t\tWeekly analysis and insights from Asia's largest economy in your inbox\n\t\t\tSubscribe now\n\t\t\n\tChina's economic imbalance mirrors a similar divergence in the U.S., where AI-linked companies have led stock market gains, while other parts of the economy have struggled.But many in Beijing argue that the country has longer-term interests at stake.Zhang Jianping, a deputy director at China's Commerce Ministry, told CNBC last week that the country's policies are designed to support innovation over multiple years. Traditional industries such as steel and real estate, he added, must integrate new technologies to remain competitive.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China's AI and robotics push isn't enough to kickstart its economy, leaving growth more exposed to trade risks",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250932-1768179128415-gettyimages-2255363049-img_4849.jpeg?v=1768179152&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T05:33:07.000Z",
      "dateModified": "2026-01-12T05:33:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boeing's airplane deliveries are the highest in 7 years. Now it's about to pick up the pace",
    "url": "https://www.cnbc.com/2026/01/11/boeing-plane-deliveries-production-pace.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250215-1767906239901-gettyimages-2249102626-BOEING_737_MAX.jpeg?v=1767906284&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-11T12:00:01.000Z",
    "description": "A Boeing Co. 737 Max airplane at the company's manufacturing facility in Renton, Washington, US, on Thursday, Nov. 20, 2025. David Ryder | Bloomberg |",
    "body": "A Boeing Co. 737 Max airplane at the company's manufacturing facility in Renton, Washington, US, on Thursday, Nov. 20, 2025. David Ryder | Bloomberg | Getty ImagesBoeing is set to report this week that it delivered the most airplanes since 2018 last year after it stabilized its production, the clearest sign of a turnaround yet after years of safety crises and snowballing quality defects. Now, the aerospace giant is planning to ramp up production.\"It's a long road back from a ... shall we say, a rather dysfunctional culture, but they're making big progress,\" said Richard Aboulafia, managing director at AeroDynamic Advisory, an aerospace industry consulting firm.Boeing was forced to scale back production in recent years following two fatal crashes of its popular 737 Max aircraft in 2018 and 2019 and a midair blowout of a door plug from one of its planes in the first week of 2024. The Covid pandemic snarled airplane assembly at both Boeing and its chief rival, Airbus, with supply chain delays and loss of experienced workers, even after the worst of the health crisis subsided.A Boeing 737 approaches San Diego International for a landing, May 10, 2025.Kevin Carter | Getty ImagesBoeing's leaders, including CEO Kelly Ortberg — a longtime aerospace executive who came out of retirement to take the top job months after the midair door plug accident — are gearing up to increase production this year of its cash cow 737 Max aircraft and the longer-range 787 Dreamliners.That could help the manufacturer, the top U.S. exporter by value, return to profitability, as analysts expect this year, territory that was out of reach for seven years as its leaders focused on damage control and were stuck reassuring frustrated airline executives who were awaiting late planes.Their tone has changed as Boeing has become more predictable and increased production, with the Federal Aviation Administration's blessing. In a sign of the FAA's increased confidence in Boeing, the agency in September said Boeing could issue its own air worthiness certificates before customers receive some of its 737s and 787s after years of restrictions.Boeing's commercial aircraft business is its largest unit, accounting for about 46% of sales in the first nine months of last year, with the rest coming from its defense and services business. Boeing last reported a full-year profit in 2018.Investors are optimistic for further improvement. Boeing shares have gained 36% over the last 12 months, outpacing the S&P 500's nearly 20% advance. \"Boeing is definitely better and more stable,\" said Bob Jordan, CEO of all-Boeing airline Southwest Airlines, in an interview Dec. 10. The company is scheduled to outline its production plans for 2026 later this month when it reports quarterly results on Jan. 27.Getting into gearFor Boeing, the recent turnaround has taken place largely on the assembly floor. Under Ortberg, the manufacturer has slashed so-called traveled work, in which assembly tasks are done out of order, to avoid costly mistakes. The company has made other manufacturing changes, as well, including added training.The National Transportation Safety Board in June said inadequate training and management oversight had been among the problems at the company, according to its investigation into what led to the door plug blowout in January 2024.On Dec. 8, Boeing also completed its acquisition of fuselage maker Spirit AeroSystems, which Boeing had spun out of the company two decades ago. It now has more direct control of the crucial supplier.Moving out jetsBoeing handed over 537 aircraft in the first 11 months of last year. It reports December deliveries on Tuesday, but Jefferies estimates the company delivered 61 commercial jets last month, 44 of them Boeing's bestseller, the 737 Max.Boeing delivered 348 aircraft in 2024 and 528 in 2023. Last year's total would still be far off the 806 airplanes it handed over in 2018.Last October, the FAA raised its production cap on Boeing's 737 Max from 38 a month to 42. (The FAA required its sign-off after the door plug accident.) CFO Jay Malave said at a UBS conference on Dec. 2 that he expects the company to get to that rate in early 2026. Ortberg told investors in October that further rate increases are on the table, in increments of five planes.Kelly Ortberg, chief executive officer of Boeing Co., during a media event at the Boeing Delivery Center in Seattle, Washington, US, on Wednesday, Jan. 7, 2026. M. Scott Brauer | Bloomberg | Getty ImagesHandovers to airlines in 2026 will likely be new production, compared with clearing out older inventory, Malave had said. Boeing is also likely to produce about eight Dreamliners a month as of early this year, he added.Deliveries are key for airplane makers, because airlines and other customers pay the bulk of an airplane's price when they receive the aircraft. Boeing's chief competitor, Airbus, is scheduled to report 2025 orders and deliveries on Monday.Still, several planes that were expected to already flying passengers aren't certified yet, including the Boeing 777X as well as the Max 7 and Max 10 variants, depriving Boeing of cash and driving up costs.Southwest is awaiting the delayed Max 7, the smallest plane of the Max family. The model is important for airline routes that have lower demand so airlines can avoid oversupplying the market with seats, pushing down fares.Southwest CEO Jordan last month said that he doesn't expect the airline to fly the Max 7 before the first half of 2027 as Boeing certification work continues. Boeing at one point expected it to enter service in 2019.\"They're still very short in terms of delivering the aircraft that we need, but I'm glad to see the progress on the Max 7,\" Jordan told CNBC. watch nowRobust demandOrders for both Boeing and Airbus jets look solid, with demand set to continue outstripping supply into the next decade, Bernstein aerospace analyst Douglas Harned said in a note last week.Airbus outpaced Boeing in deliveries last year, though Boeing appears to have outsold its European competitor in new orders.Through November, Boeing logged 1,000 gross orders compared with 797 from Airbus. Airline customers have started to look beyond this decade, snagging delivery slots into the mid-2030s as they plot out growth and international expansions.On Wednesday, Alaska Airlines said it is ordering 105 Boeing 737 Max 10 jets, the longest aircraft of the Max group. Alaska fleet chief Shane Jones told CNBC the order is a sign of \"our confidence in the Max 10 certification\" as well as \"our confidence in Boeing and their turnaround and their ability to produce quality aircraft on time.\"  Alaska also exercised options for five 787 Dreamliners for more international routes just over a year after it acquired Hawaiian Airlines — a combination that handed Alaska more Dreamliners and Airbus A330s to reach for destinations that it couldn't get to before, like Japan, South Korea and Italy.The wide-body aircraft market is now picking up steam, said Ron Epstein, aerospace analyst at Bank of America, with orders starting to get handed over faster to customers. Read more CNBC airline newsBoeing's deliveries are highest in 7 years. It's about to pick up the paceWhy airline class wars will intensify in 2026American Airlines no longer lets basic economy flyers earn milesArchitect of Delta's premium strategy to retire in FebruaryFrontier Airlines replaces longtime CEO Barry Biffle with carrier's presidentInternational travel, especially at the high end, has been particularly strong in the years after the pandemic as travelers splash out on vacations around the world. More and more global airlines are looking at snagging long-haul jets like Boeing's Dreamliner and Airbus' A330 and A350s for the coming years, heating up the wide-body airplane market, analysts said.Globally, airplanes flew nearly 84% full in November, the highest level on record, according to the latest data available from the International Air Transport Association, an airline industry group.With travel demand still robust, orders to replace older jets and secure new ones will continue to fuel growth.\"The magic, if you will, of air transportation is until somebody comes up with a transporter, you know, [like] 'Star Trek,' where you sort of vaporize and show up someplace else, we're going to be flying,\" Epstein said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boeing's airplane deliveries are the highest in 7 years. Now it's about to pick up the pace",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250215-1767906239901-gettyimages-2249102626-BOEING_737_MAX.jpeg?v=1767906284&w=1920&h=1080"
      ],
      "datePublished": "2026-01-11T12:00:01.000Z",
      "dateModified": "2026-01-11T12:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Korea's Kospi closes at a record high as Asia-Pacific markets mostly rise ",
    "url": "https://www.cnbc.com/2026/01/12/asia-pacific-markets-crude-wti-oil-iran-protests-hang-seng-index-csi-300-kospi.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107241460-1684193320038-gettyimages-1251294654-CHINA_SHANGHAI.jpeg?v=1768174042&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T08:03:21.000Z",
    "description": "Shanghai's city skyline as seen from observation deck at Shanghai Tower in China.Qilai Shen | Bloomberg | Getty ImagesSouth Korea's Kospi closed at an",
    "body": "Shanghai's city skyline as seen from observation deck at Shanghai Tower in China.Qilai Shen | Bloomberg | Getty ImagesSouth Korea's Kospi closed at an all-time high Monday as Asia-Pacific markets mostly rose, with investors weighing a possible U.S. intervention in Iran.  The Kospi index added 0.84% to 4,624.79, while the Kosdaq advanced 0.2% to 949.81.Shares of Hyundai Glovis soared as much as 7% after analysts raised their price target for the South Korean logistics company.Robot-maker Boston Dynamics, in which Hyundai Glovis owns an 80% stake, announced a partnership with Google DeepMind last Monday to integrate AI into humanoid robots.Oil prices are in focus as Iran entered a third week of protests, which have seen more than 500 people killed, according to a U.S.-based rights group. President Donald Trump is reportedly weighing options for intervention in Iran, according to multiple reports Sunday.Brent crude futures reversed course to fall to $63.05 per barrel, while the U.S. West Texas Intermediate crude declined 0.49% to $58.83 per barrel, as of 10 a.m. Singapore time (9 p.m. ET Sunday). Spot gold prices rose more than 1.6% to hit all-time high of $4,581.29 per ounce.Stock Chart IconStock chart iconGold spot priceAustralia's S&P/ASX 200 added 0.48% to 8,759.4.Hong Kong's Hang Seng Index added 0.93%, and mainland China's CSI 300 climbed 0.56%.India's Nifty 50 retreated 0.68%, and the BSE Sensex index lost 0.59%. Shares of Reliance Industries fell 1.38% after the Indian conglomerate halted plans to make lithium-ion battery cells domestically after failing to secure Chinese technology, Bloomberg reported, citing sources.Japanese markets were closed for a holiday. On Sunday, Japanese Prime Minister Sanae Takaichi's coalition partner, Hirofumi Yoshimura, said that she may call an early general election. His comments come after domestic media reported that Takaichi was considering a snap election in February, citing government sources.The Japanese yen weakened sharply Monday, hitting a one-year low of 158.19 against the greenback. U.S. equity futures declined after the Department of Justice opened a criminal investigation into Federal Reserve Chair Jerome Powell, an apparent escalation by Trump in his attempt to pressure the central bank.On Friday stateside, the S&P 500 closed up 0.65% to 6,966.28, a fresh record close. It also notched a new all-time intraday high in the session. The Nasdaq Composite gained 0.81% to 23,671.35. The Dow Jones Industrial Average added 237.96 points, or 0.48%, to end at 49,504.07, scoring a new closing record as well.— CNBC's John Melloy, Sean Conlon and Pia Singh contributed to this report.Correction: This story has been updated to accurately reflect Brent crude futures prices. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Korea's Kospi closes at a record high as Asia-Pacific markets mostly rise ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107241460-1684193320038-gettyimages-1251294654-CHINA_SHANGHAI.jpeg?v=1768174042&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T08:03:21.000Z",
      "dateModified": "2026-01-12T08:03:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Trump’s Venezuela intervention means for Guyana’s vast oil wealth",
    "url": "https://www.cnbc.com/2026/01/12/oil-trump-venezuela-guyana-essequibo-territorial-dispute.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250909-1768125147983-gettyimages-2232161209-AFP_72VN7BP.jpeg?v=1768125175&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-12T07:07:47.000Z",
    "description": "A woman holding an umbrella crosses a road at the entrance of Demerara Harbour Bridge with a sign that reads \"Essequibo belongs to Guyana\" in Georgeto",
    "body": "A woman holding an umbrella crosses a road at the entrance of Demerara Harbour Bridge with a sign that reads \"Essequibo belongs to Guyana\" in Georgetown on September 2, 2025.Joaquin Sarmiento | Afp | Getty ImagesThe Trump administration's military intervention in Venezuela is expected to radically reshape regional risk, including when it comes to the South American country's territorial claims over a large, resource-rich area in neighboring Guyana.The U.S. operation on Jan. 3 to oust Venezuelan President Nicolas Maduro and his wife, Cilia Flores, sent shockwaves across the globe, with many condemning Washington's actions as a breach of international law.President Donald Trump has shrugged off those concerns, saying in a recent interview with the New York Times that he doesn't \"need international law\" and that only his own mortality and mind can stop him.Regionally, the fallout from the U.S. intervention is set to put Venezuela's longstanding claims over the Essequibo territory on ice, analysts told CNBC, a development that likely prompted a collective sigh of relief from the energy majors operating there.Essequibo refers to a disputed area that constitutes around two-thirds of Guyana. It is known to be rich in natural resources, such as gold and diamonds, as well as vast offshore oil reserves. Read more\"Sighs of relief will have been exhaled in some offices, particularly on the ground, because that's a constant threat whether you're trying to manage logistics and so on, or making sure that ships are getting around safely,\" said Eileen Gavin, principal Americas analyst at Verisk Maplecroft, a risk intelligence company.\"These are all offshore facilities — and highly expensive ones at that. So, having the U.S. armada, as they are calling it, is certainly helpful,\" Gavin told CNBC by telephone.U.S. oil majors Exxon Mobil and Chevron, as well as China's CNOOC, are among some of the companies that operate in the offshore region administered by Guyana. The U.S. president, who said Friday that he'd canceled a second wave of attacks on Venezuela, has been pushing for American oil companies to invest billions in the country to fully tap its expansive crude reserves. Trump insisted a large \"armada\" of ships off the oil-rich country's coast would help to protect U.S. investments. Essequibo disputeGuyana has been transformed by an economic boom over the last decade. A blockbuster discovery by Exxon Mobil in 2015 revealed vast reserves of high-quality crude in waters offshore Guyana, turning the small South American country of about 830,000 people into a major energy player with the world's fastest growing economy.The discovery caught the attention of foreign investors and oil majors, as well as neighbouring Venezuela, which claims sovereignty over the Essequibo region. watch nowThe dispute over Essequibo is more than a century old. In 1899, an international arbitral tribunal awarded the territory to Britain, when Guyana was still under its colonial rule. Venezuela has since actively disputed this. Maduro has previously accused Guyana, the U.S. and oil firms of robbing Venezuela of its territory through \"legal colonialism.\" Guyana has maintained that the accord is legal and binding, and in 2018 the country had sought the International Court of Justice (ICJ) to rule it as such. The ICJ also issued a binding order in May prohibiting Venezuela from holding elections in Essequibo, prompting Maduro's government to reject the pronouncement. Caracas has repeatedly said it does not recognize the ICJ's jurisdiction. 'Removing a nuisance'Venezuela's Maduro has adopted an increasingly aggressive stance toward Essequibo in recent years, ratcheting up regional tensions. In late 2023, for instance, Venezuela's electoral authority announced citizens had approved a referendum called by Maduro's regime to claim sovereignty over Essequibo, raising fears of a possible annexation attempt.A voter casts a ballot at a polling station during a referendum vote in Caracas, Venezuela, on Sunday, Dec. 3, 2023.Bloomberg | Bloomberg | Getty ImagesAllen Good, director of equity research at Morningstar, said Maduro's assertion over Essequibo was always likely to have been more bluster than it was actionable.\"With Venezuela already in the US's crosshairs and Exxon the largest operator in Guyana, any aggression would likely have elicited a US response,\" Good told CNBC by email. \"Now, with the US's intent to control the country, any action by Venezuela becomes even more remote, removing a nuisance for Exxon and Guyana,\" he added.  Guyanese President Irfaan Ali, with US Secretary of State Marco Rubio (R) speaks during a press conference in Georgetown, Guyana, March 27, 2025. Secretary Rubio warned Venezuela on March 27 of consequences — and hinted at military force — if the country moves against oil-rich neighbor Guyana.Nathan Howard | Afp | Getty ImagesSpeaking during a press conference alongside Guyanese President Irfaan Ali in March last year, U.S. Secretary of State Marco Rubio warned Venezuela of consequences if it moved to attack Guyana or Exxon Mobil and hinted at the use of military force.  What next?Shortly after the U.S. military operation in Venezuela, Rubio spoke with Guyana's Ali about strengthening bilateral security cooperation.In a statement on Jan. 6, Guyanese Foreign Secretary Robert Persaud said Ali reiterated Guyana's \"steadfast commitment to working with the United States - the region's strategic and important security ally.\" Notably, Persaud said Ali also welcomed Rubio's \"reaffirmation of the US continued support for and partnership with Guyana in defence of our sovereignty and territorial integrity.\"watch nowFor Verisk's Gavin, the U.S. military operation in Venezuela appears to have temporarily halted Venezuela's territorial claims over Essequibo, rather than removed them altogether.\"I don't think this dispute is going to go away. It's a longstanding Venezuelan claim [and] the regime is still in place,\" Gavin said. \"But, obviously, Caracas is now under intense pressure from the U.S., so I don't think this is something they will be wanting to be making much noise about in the very near term,\" she added.— CNBC's Lee Ying Shan contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Trump’s Venezuela intervention means for Guyana’s vast oil wealth",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250909-1768125147983-gettyimages-2232161209-AFP_72VN7BP.jpeg?v=1768125175&w=1920&h=1080"
      ],
      "datePublished": "2026-01-12T07:07:47.000Z",
      "dateModified": "2026-01-12T07:07:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]