[
  {
    "title": "A 'quiet revolution': How young people are swapping social media for lunch dates, vinyl records and brick phones",
    "url": "https://www.cnbc.com/2026/02/07/young-people-quiet-revolution-social-media.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108261199-1770201657530-gettyimages-2221212207-img_6956.jpeg?v=1770394916&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-07T12:29:47.000Z",
    "description": "A young woman wearing headphones browses vintage vinyl records in a store.Mihailomilovanovic | E+ | Getty ImagesAccount manager Matt Richards, 23, del",
    "body": "A young woman wearing headphones browses vintage vinyl records in a store.Mihailomilovanovic | E+ | Getty ImagesAccount manager Matt Richards, 23, deleted all his social media apps from his phone last year, and was surprised to find that his life changed for the better. Richards had been using a smartphone since he was 11 years old and grew up with the device like most Gen Z and millennials. However, in the past few years, he noticed social media didn't feel as fun anymore with artificial-intelligence slop dominating his feed, influencers advertising brands, and constant lifestyle comparison.\"I think people back then used to take a break from the real world by going on their phone, but now people are taking a break from their phone to spend time in the real world,\" Richards told CNBC Make It in an interview. As many of his Gen Z friends also caught on, he noticed instant benefits, from connecting with people in real life to feeling more confident about himself. Going chronically offline is the latest trend to grip young people, and ironically it's going viral on social media. There's been an surge in TikTok videos of people vowing to delete social media apps in 2026 and engaging with in-person and analog hobbies. When I discovered the trend, I decided to make a post on LinkedIn to see if there were any young people willing to speak to me about going offline. To my surprise, I received nearly 100 responses from Gen Z and millennials sharing stories about social media detoxes and digital burnout. They talked about ditching their smartphones for flip phones, visiting record stores to buy vinyl, taking up analog hobbies like knitting, and most importantly, connecting with their friends in person. A 2025 Deloitte consumer trends survey of more than 4,000 Brits found that nearly a quarter of all consumers had deleted a social media app in the previous 12 months, rising to nearly a third for Gen Zers. Meanwhile, social media use has steadily declined, with time spent on the platforms peaking in 2022, an analysis of the online habits of 250,000 adults in more than 50 countries by the Financial Times and digital audience insights firm GWI found. Globally, adults 16 and over spent an average of two hours and 20 minutes per day on social platforms by the end of 2024, down almost 10% since 2022, with the decline being particularly pronounced amongst teens and 20-something-year-olds. Jason Dorsey, President of the Center for Generational Kinetics, said that the increased \"nastiness and divisiveness\" online, including from leaders and politicians, is driving young people away from social media as they seek out greater control of their lives. \"We're seeing that a group of Gen Z [and millennials] is choosing to leave social media entirely, and probably a larger group that's choosing just to limit social media as they sort of regain more of what they're trying to find: balance and security and safety in their life,\" Dorsey said in a conversation with CNBC Make It. 'Pressure platform' Young people deleting their social media platforms cite the increasing pressures of being online as well as the damage to their mental health. Deloitte's consumer survey showed that almost a quarter of respondents who deleted social media reported that it was because it negatively impacted their mental health and consumed too much of their time. \"I feel like social media is now more like a pressure platform … you're being sold everything, everywhere,\" Richards said, adding that he felt like he didn't have enough things or had accomplished enough in his career. We're definitely seeing a trend where people that are offline, unreachable, have a sort of cool factor around them...this person doesn't need validation.Matt Richards 23-year-old account manager Similarly, 36-year-old millennial entrepreneur Lucy Stace told CNBC Make It that she's limiting her social media use because it's \"diminishing\" her mental health despite it being essential to her business. \"We are just inundated all of the time with so much information … our brains aren't capable of handling that much information,\" she said. \"We're actually diminishing our brain's capacity to be able to look inward and listen to ourselves, and we're value tagging all of these things that aren't actually important to us.\" Tech giants face \"tremendous pressure\" to monetize everything and drive revenue and profit, which is off-putting to younger generations, generational expert Dorsey explained. \"The result of that is that Gen Z, who are already sensitive to being advertised to  —  they are the most advertised-to generation in the history of the world  —  now they're getting advertised to even more and their feeds feel just commercial after commercial,\" Dorsey said. Offline is the new 'cool' As the tide shifts against social media, account manager Richards noted that those who have gone offline have become more interesting. In the past, it was cooler to have lots of followers, but that appeal has faded, Richards noted. \"I think we're definitely seeing a trend where people that are offline, unreachable, have a sort of cool factor around them, in terms of this person doesn't need validation from how many likes or followers (they have) … and living life like they were in the 80s,\" he added. Social media manager Julianna Salguero, 31, said that social media stopped being cool when politicians and brands started using the platform.\"The more that we see brands and government officials and everybody being as online as you are, as a casual user, the more you're going to want to pull back and switch it,\" she said. As the digital generation struggles to make friends and find partners, they're instead seeking out in-person events from speed dating to professional networking, citing high levels of loneliness and isolation as a key driver. The University of Sheffield's digital media lecturer, Ysabel Gerrard, said going offline is a way for young people to take back control of their lives. Social media forces users to go through an \"extremely exhausting process\" of having to create an identity and edit themselves, she said. \"There's an unbelievable wealth of literature now to tell us that the person we are on social media is not, and cannot be, the same person who we are in face-to-face settings,\" Gerrard told CNBC Make It. \"It's so much more than a trend.\" However, GWI analyst Chris Beer said he's not convinced that the FT and GWI findings reflect a structural shift and is instead a \"legitimate post-pandemic correction,\" as people are spending less time at home and therefore less time on social media. He said shift is \"largely due to structural time allocation,\" especially for younger users, rather than \"an attitude-driven wholesale rejection of digital media,\" as social media is still very integrated into people's lives in areas including shopping, news and education.Analog is back In a Substack post in September, social media manager Salguero expressed a yearning to have lived life in the '90s when dating apps and doom scrolling weren't a prerequisite of being a young adult. The article titled \"How to have an analog fall\" wasn't about doing digital detoxes or setting timers to limit social media use. Instead, Salguero outlined all the hobbies one could have outside of social media from writing physical letters, going on lunch dates, or opting for physical media like newspapers. The post received 5,000 likes, and Salguero told CNBC that going analog is a \"quiet revolution\" against social media, streaming, and content overload. Lacy Stace and her boyfriend's record collection.\"When you spend too much time in that world, it's rewiring your brain to perceive things algorithmically, where I'd rather perceive things as I come across them, so for me the going analog of it all isn't necessarily  throwing my phone into the ocean, it's more about 'how do I reset my relationship with it',\" she said. Indeed, more young people are increasingly turning towards physical media, such as purchasing vinyl and record players, as they seek a break from digital life. Others are investing in flip phones, a relic of the 2000s. Now, entrepreneur Stace and her boyfriend have started building a record collection and visit record stores when they can. Meanwhile, after deleting all the social media apps off his smartphone, Richards said his conversation with CNBC Make It has motivated him to purchase a brick phone, too. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A 'quiet revolution': How young people are swapping social media for lunch dates, vinyl records and brick phones",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108261199-1770201657530-gettyimages-2221212207-img_6956.jpeg?v=1770394916&w=1920&h=1080"
      ],
      "datePublished": "2026-02-07T12:29:47.000Z",
      "dateModified": "2026-02-07T12:29:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bitcoin gets slashed in half. What's behind the crypto's existential crisis",
    "url": "https://www.cnbc.com/2026/02/06/bitcoin-gets-slashed-in-half-whats-behind-the-cryptos-existential-crisis.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108262123-1770318565681-gettyimages-1329055819-bitcoin-chart.jpeg?v=1770393833&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T18:50:10.000Z",
    "description": "Nastco | GettyBitcoin tumbled toward $60,000 this week as investors reassessed its utility. And while there isn't one clear catalyst driving the blood",
    "body": "Nastco | GettyBitcoin tumbled toward $60,000 this week as investors reassessed its utility. And while there isn't one clear catalyst driving the bloodbath, one thing is clear: the crypto market is in crisis. \"There's nothing going on in the marketplace that should have necessitated this type of a crash,\" Anthony Scaramucci, founder and managing partner of alternative investment firm SkyBridge, told CNBC. \"And so I think that's made people, frankly, more fearful. ... You have to ask yourself, 'is it over for bitcoin?'\"Bitcoin fell as low as $60,062 on Thursday, bringing it to its lowest level since Oct. 11, 2024. That's more than 52% off from its record high of $126,000 hit in early October 2025.  The previous session marked one of bitcoin's bloodiest ever, with the token shedding more than 15% on the day. Its daily relative strength index fell to 18, putting the asset in extremely oversold territory. As of Thursday, other digital assets like ether and solana were also down 24%  and 26% for the week to date, respectively — a sign investors' confidence in the entire crypto market is faltering.Bitcoin bounces, but losses loom largeBitcoin was rebounding on Friday, with the token last trading at $69,631.97, up more than 9% on the day.But, its recent drawdown has prompted investors to reevaluate its utility, including its role as a digital currency or as a store of value. Simultaneously, institutional appetite for the flagship crypto appears to be waning as spot bitcoin exchange-traded funds record outsized outflows, threatening to drive bitcoin deeper into the red. \"This time is markedly different from other bear markets, however, in that it's not in response to a structural blowup,\" Jasper De Maere, desk strategist at crypto market-making firm Wintermute, said in a statement shared with CNBC. \"It's a fundamentally macro-driven deleveraging tied to positioning, risk appetite and narratives rather than systemic failures within crypto itself.\"Stock Chart IconStock chart iconBitcoin prices over the past yearOver the past few months, investors have grown increasingly skeptical of efforts to recast bitcoin as \"digital gold,\" or an alternative to traditional safe havens such as gold. Bitcoin is down 28% over the past 12 months, while gold is up 72% during the same period — a testament to the latter's utility as a hedge against macro risks. Conversely, bitcoin has often traded down alongside other risk-on assets such as equities amid periods of high macroeconomic and geopolitical uncertainty, raising doubts about its utility as a safe haven. Nearly a week after Trump's \"liberation day\" tariff announcement on April 2, 2025, bitcoin had fallen about 10% to below $80,000, while the S&P 500 had declined roughly 4%. Separately, investors are also reassessing the extent to which financial institutions, treasury firms and governments are willing to adopt bitcoin — a major catalyst for the token in recent years. Large institutional outflows are mounting as investors brace for bitcoin to go lower, thinning liquidity for the token, according to a recent analyst note from Deutsche Bank.Those outflows are also noticeable among spot bitcoin ETFs in recent months, according to the investment firm. The funds have seen outflows of more than $3 billion in January, in addition to roughly $2 billion last December and about $7 billion last November.Additionally, a swath of Strategy copycats that emerged over the past year or so have slowed or paused their bitcoin purchases amid the digital asset's correction. Finally, traders have acknowledged that longtime efforts to market bitcoin as an alternative to fiat currencies have largely faded. While Steak 'n Shake and Compass Coffee have rolled out support for bitcoin payments in recent years, initiatives to make the asset a form of payment have largely died, particularly as interest in dollar-pegged stablecoins grows, according to Bitwise's Ryan Rasmussen. \"We're seeing Wall Street adopt stablecoins because it is a fundamental transformation of the way payments work, and bitcoin is just a different asset. It's not meant for that today,\" Rasmussen said, arguing that the token's purpose has evolved from that of a currency to a decentralized, nongovernable store of value. \"I've never paid for coffee or a sandwich with bitcoin, and I never will.\"And beyond those more immediate concerns, investors are also increasingly worried that bitcoin's underlying network could be hacked, driving the token to zero. \"It certainly is a risk that is seeing more attention from investors as they're getting more worried about [it], and I think you're seeing a little bit of that risk priced into bitcoin,\" Rasmussen said.He noted that Bitwise has allocated funds toward efforts to mitigate the threat from quantum computing.Nevertheless, traders' appetite for bitcoin has largely dwindled, denting its price. That's true even as long-time believers are still proudly betting on bitcoin, despite of the charts and the naysayers. \"I believe that the story is intact,\" said Scaramucci, adding that he bought bitcoin for his fund on Thursday. \"But, I don't have a crystal ball. … Who the hell knows?\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bitcoin gets slashed in half. What's behind the crypto's existential crisis",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108262123-1770318565681-gettyimages-1329055819-bitcoin-chart.jpeg?v=1770393833&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T18:50:10.000Z",
      "dateModified": "2026-02-06T18:50:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump holds leverage over Iran thanks to low oil prices, Energy Secretary says",
    "url": "https://www.cnbc.com/2026/02/06/trump-iran-oil-prices.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108262756-1770406678613-gettyimages-2255448037-aw1a3682_s963ly3l.jpeg?v=1770406703&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T20:23:13.000Z",
    "description": "watch nowLow oil prices give President Donald Trump more leverage over Iran, U.S. Energy Secretary Chris Wright said Friday, speaking as the two adver",
    "body": "watch nowLow oil prices give President Donald Trump more leverage over Iran, U.S. Energy Secretary Chris Wright said Friday, speaking as the two adversaries teeter on the brink of another conflict. \"The world is very well supplied with oil right now, and I think it gives President Trump more leverage in his geopolitical actions to not worry about a crazy spike in oil prices,\" Wright told CNBC in an interview when asked about the risk of a supply disruption due to tensions with Iran. The oil market is closing monitoring tensions in the Middle East for any sign that crude supplies could be disrupted. U.S. crude oil rose 26 cents, or 0.4%, to close at $63.55 per barrel Friday. Prices are up more than 10% since the start of the year, after losing 20% in 2025. Oil market analysts are generally expecting a surplus this year after OPEC+ increased output and as U.S. production remains strong. Trump has deployed the USS Abraham Lincoln aircraft carrier strike group to the Middle East as he threatens Iran with military action if it does not negotiate over its nuclear program. The president threatened Iran with strikes in January during a mass uprising against the regime, but ultimately refrained. U.S. and Iranian diplomats held negotiations over the Islamic Republic's nuclear program in Muscat, Oman earlier on Friday. Iranian Foreign Minister Abbas Araghchi told state media that the talks were a \"good start.\" Iran is an OPEC member and produces more than 3 million barrels per day. Wright expects production in Venezuela to grow by several hundred thousand barrels per day this year, after the U.S. captured former President Nicolas Maduro early in January. The U.S. has seized control of Venezuela's oil sales and President Trump is pressuring U.S. companies to rebuild its energy sector.\"It will be a substantial percent of global demand growth this year,\" Wright said of output growth in the South American nation. \"Venezuela is going to be another helpful stabilizer of energy markets.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump holds leverage over Iran thanks to low oil prices, Energy Secretary says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108262756-1770406678613-gettyimages-2255448037-aw1a3682_s963ly3l.jpeg?v=1770406703&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T20:23:13.000Z",
      "dateModified": "2026-02-06T20:23:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "India is reportedly 'ready' to buy up to $80 billion in Boeing aircraft following trade deal with U.S.",
    "url": "https://www.cnbc.com/2026/02/06/india-buy-boeing-aircrafts-80-billion-trade-us-deal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107385241-1710118435774-gettyimages-1241368697-Indian_Minister_Of_Trade_And_Industry_Piyush_Goyal_Visits_The_EU_Commission.jpeg?v=1727788313&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T15:32:07.000Z",
    "description": "Indian Minister of Commerce and Industry, Consumer Affairs, Food and Public Distribution and Textiles Shri Piyush Goyal is talking to media on EU-Indi",
    "body": "Indian Minister of Commerce and Industry, Consumer Affairs, Food and Public Distribution and Textiles Shri Piyush Goyal is talking to media on EU-India trade relations. India will waive tariffs on industrial imports from four European nations for a $100 billion investment over 15 years, ending nearly 16 years of negotiations.Thierry Monasse | Getty Images News | Getty ImagesNew Delhi is ready to place orders worth up to $80 billion for Boeing planes, India's commerce and industry minister, Piyush Goyal, reportedly said, signaling the country's willingness to expand trade with the U.S.India's demand for aircraft alone, with orders for Boeing \"yet to be placed but ready,\" is nearly $80 billion, Goyal said Thursday, adding that if engines and other spare parts are added, imports from U.S. will \"cross $100 billion just [from] aircrafts.\"Families of passengers who died in the Air India plane crash in Ahmedabad in June of last year are suing Boeing, over the alleged role of defective dual switches in the disaster that saw 241 of the 242, the minister said, on board lose their lives.The minister also said that there was potential to procure a minimum of $500 billion worth of goods from the U.S. over the next five years, but clarified that there was no explicit investment commitment made as part of the trade deal with Washington.On Monday, within a week of the India-European Union trade deal, U.S. President Donald Trump announced in a social media post that Washington and New Delhi had agreed a trade deal. Trump said that the U.S. will reduce tariffs on Indian goods to 18%, while New Delhi will lower duties on U.S. goods to zero, replace Russian oil with supply from U.S. and Venezuela, open sensitive markets such as agriculture, and buy $500 billion worth of American goods.The Indian prime minister expressed delight over the cut in duties, as goods from the country entering the U.S. have been subjected to 50% tariffs, but did not acknowledge any other details shared by Trump.watch nowWhile experts agree that India will buy more from the U.S., they have said the target of buying goods worth $500 billion from Washington \"seems a stretch.\"India's overall goods imports stood at $720.24 billion in financial year 2025, with its trade deficit at $94.3 billion. That includes goods worth $45.3 billion from the U.S.Deal timelineIndia and the U.S. will sign a joint statement in the next three to four days, finalizing the first tranche of the trade deal between the two countries, Goyal said on Thursday. The 18% tariffs on Indian exports to the U.S. will become effective after the joint statement is issued, he added.The two sides will then sign a formal agreement in mid-March, after which the tariff concession for U.S. goods entering India will become effective.Since the deal has been announced, the Indian government has been scant with details and is facing questions from opposition political parties. The leader of India's opposition, Rahul Gandhi, has accused Modi of being \"compromised\" and of having \"surrendered on Tariffs.The Indian government has not confirmed some of Trump's claims about the trade deal such as India reducing duties on U.S. goods to zero and halting imports of Russian oil, as well as a firm commitment to purchasing goods worth $500 billion.Experts say Trump's claims seem \"unrealistic\" and risk the U.S. backtracking on the trade deal, citing his threats to raise tariffs on South Korea, after slashing them in July last year, despite a trade deal.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "India is reportedly 'ready' to buy up to $80 billion in Boeing aircraft following trade deal with U.S.",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107385241-1710118435774-gettyimages-1241368697-Indian_Minister_Of_Trade_And_Industry_Piyush_Goyal_Visits_The_EU_Commission.jpeg?v=1727788313&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T15:32:07.000Z",
      "dateModified": "2026-02-06T15:32:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon leads Big Tech’s $1 trillion wipeout as AI bubble fears ignite sell-off",
    "url": "https://www.cnbc.com/2026/02/06/ai-sell-off-stocks-amazon-oracle.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108259472-1769776783103-gettyimages-2258454612-20090101260130-99-336595.jpeg?v=1770397509&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T21:34:55.000Z",
    "description": "watch nowAmazon shares sunk more than 5% on Friday after the company's hefty spending forecast surprised investors who were already wary that the arti",
    "body": "watch nowAmazon shares sunk more than 5% on Friday after the company's hefty spending forecast surprised investors who were already wary that the artificial intelligence boom is at risk of becoming a bubble. The e-commerce company on Thursday was the latest tech giant to announce plans for a massive increase in capital expenditures, after Google parent Alphabet, Microsoft and Meta all signaled they expect their spending sprees to continue. Amazon, Alphabet, Microsoft and Meta reported about $120 billion in capital expenditures in the fourth quarter alone. That figure could exceed more than $660 billion this year, the Financial Times reported, which is higher than the gross domestic product of countries like the United Arab Emirates, Singapore and Israel.Wall Street has responded differently to the companies' spending plans, cheering Meta and Alphabet's forecasts, while punishing Amazon and Microsoft. Amazon, Microsoft, Nvidia, Meta, Google and Oracle collectively lost more than $1 trillion from their valuations over the past week, according to FactSet data. Amazon shed just over $300 billion from its market cap, the most out of the group. Shares of companies developing hardware for the AI build-out will likely face continued volatility as \"sentiment contagion takes hold,\" Paul Markham, investment director at GAM Investments, told CNBC.\"Questions over the extent of capex as a result of LLM build-outs, the eventual return on that, and the fear of eventual over-expansion of capacity will be persistent,\" he added.Stock Chart IconStock chart iconAmazon shares over the past month'Investors questioning every angle in AI race'Amazon announced in its fourth-quarter earnings report that its capital expenditures are expected to reach $200 billion in 2026, which was more than $50 billion above analysts' expectations. While management is confident of long-term returns on investment, the lack of visibility is not sitting well with investors, Mamta Valechha, consumer discretionary analyst at Quilter Cheviot, said Friday morning.\"We have suddenly gone from the fear that you cannot be last, to investors questioning every single angle in this AI race.\"Analysts at D.A. Davidson downgraded Amazon's stock on Friday to neutral from a buy rating over concerns around its spending plans, risks to its cloud dominance and the potential for AI to erode its retail business. \"With the context of results from Microsoft and Google, we see AWS continuing to lose its lead and now scrambling to catch up through escalating investment,\" the analysts wrote in a research note. \"We are also increasingly concerned about Amazon retail's transition to a new chat-driven internet dominated by Gemini and ChatGPT.\"Apple, on the other hand, which has faced pressure from Wall Street over its AI strategy and has previously committed far less on capex than other Big Tech firms, has seen its stock jump 7% since Monday on the back of what CEO Tim Cook described as \"staggering\" demand for the iPhone. \"The bet is becoming binary,\" Michael Field, chief equity strategist at Morningstar, told CNBC, referring to the huge investments in so-called Magnificent Seven companies. \"Either a big pay off if these investments come good, or a huge waste of shareholder's cash if it goes wrong.\"— CNBC's Annie Palmer and Elsa Ohlen also contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon leads Big Tech’s $1 trillion wipeout as AI bubble fears ignite sell-off",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108259472-1769776783103-gettyimages-2258454612-20090101260130-99-336595.jpeg?v=1770397509&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T21:34:55.000Z",
      "dateModified": "2026-02-06T21:34:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Uber held liable, ordered to pay $8.5 million in driver rape suit",
    "url": "https://www.cnbc.com/2026/02/06/uber-liable-pay-8-5-million-driver-rape-suit.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218632-1761751680797-gettyimages-2240390282-porzycki-brandsan251012_npUSM.jpeg?v=1770384939&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T21:45:22.000Z",
    "description": "Uber signs are seen on cars in Krakow, Poland on October 12, 2025. Jakub Porzycki | Nurphoto | Getty ImagesUber on Thursday was ordered to pay $8.5 mi",
    "body": "Uber signs are seen on cars in Krakow, Poland on October 12, 2025. Jakub Porzycki | Nurphoto | Getty ImagesUber on Thursday was ordered to pay $8.5 million to the plaintiff in an Arizona trial that is the first lawsuit to be tried of thousands involving alleged sexual assault and misconduct by drivers on the ridesharing platform.In the lawsuit, Jaylynn Dean alleged that she was raped by her Uber driver in November 2023 while returning to her hotel.  The verdict, which was delivered in a U.S. District Court in Phoenix, found Uber liable for apparent agency and lays the groundwork for about 3,000 similar lawsuits nationwide that have been consolidated in federal court. The jury did not find Uber liable for negligence or design defects, and the company was not ordered to pay punitive damages.\"This verdict affirms that Uber acted responsibly and has invested meaningfully in rider safety. We will continue to put safety at the heart of everything we do,\" a spokesperson for Uber wrote in a statement to CNBC.Sarah London, a lawyer at Girard Sharp who is representing Dean, called the verdict a \"victory\" for the plaintiff in a statement to CNBC and said it \"validates the thousands of survivors who have come forward at great personal risk to demand accountability against Uber for its focus on profit over passenger safety.\"The company is planning to appeal the decision.The ride-hailing company has said it should not be held liable for the misconduct of drivers, who are classified as contractors on its platform. Last year, the New York Times reported that Uber received over 400,000 sexual assault and misconduct reports between 2017 and 2022, which was far more than the company had disclosed. In a report last August, Uber said serious sexual assault on the platform had fallen by 44%.Uber has taken steps to address safety on the platform and implemented new features, including an in-app emergency button and pin verification. In July, Uber began piloting a program in the U.S. that allows women drivers and riders to opt out of being paired with a man. Ridesharing rival Lyft has also faced lawsuits tied to sexual assault and harassment. watch nowRead more CNBC tech newsGoogle and Microsoft offer lucrative deals to promote AI, but even $500,000 won't sway some creatorsNvidia shares rise 8% as Jensen Huang says $660 billion capex buildout is sustainableAmazon leads Big Tech's $1 trillion wipeout as AI bubble fears ignite sell-offWhy Amazon's CEO is 'confident' with $200 billion spending plan",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Uber held liable, ordered to pay $8.5 million in driver rape suit",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218632-1761751680797-gettyimages-2240390282-porzycki-brandsan251012_npUSM.jpeg?v=1770384939&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T21:45:22.000Z",
      "dateModified": "2026-02-06T21:45:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump condemns racist video showing Obamas as apes after removing it, but says he won't apologize",
    "url": "https://www.cnbc.com/2026/02/06/trump-obama-post-white-house.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108262493-1770386563014-gettyimages-1068802366-AFP_1BD4RE.jpeg?v=1770393237&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-07T02:11:18.000Z",
    "description": "watch nowPresident Donald Trump's official Truth Social account on Friday morning deleted a video showing a racist image of former President Barack Ob",
    "body": "watch nowPresident Donald Trump's official Truth Social account on Friday morning deleted a video showing a racist image of former President Barack Obama and former first lady Michelle Obama portrayed as apes, following widespread bipartisan calls for its removal.The depiction of the Obamas, posted late Thursday from Trump's official Truth Social account, was included in a video clip pushing a conspiracy theory about voting machines during the 2020 election. The post stayed up for about 12 hours.Trump late Friday during a gaggle with reporters accompanying him aboard Air Force One said that he won't apologize for the post. \"I didn't make a mistake,\" he said.Trump told reporters that he didn't watch the whole video, just the beginning.\"I didn't see the whole thing,\" Trump said. \"I looked at the first part, and it was really about voter fraud in the machines, how ‌crooked ‌it is, how disgusting it is. Then I gave it to the people. Generally, they look at ​the whole thing. But I guess somebody didn't.\"When asked if he condemned the video, he replied, \"Of course I do.\"The White House initially defended Trump's post.A screenshot from a video President Donald Trump posted to his social media platform, Truth Social, on Feb. 5, 2026. The video shows the faces of President Barack Obama and former first lady Michelle Obama superimposed over animated apes.Source: Truth Social\"This is from an internet meme video depicting President Trump as the King of the Jungle and Democrats as characters from the Lion King,\" press secretary Karoline Leavitt said in an emailed statement when asked for comment on Friday morning.\"Please stop the fake outrage and report on something today that actually matters to the American public,\" Leavitt said.Hours later, the post was deleted from Trump's Truth Social account.A White House official, speaking on condition of anonymity, said that a White House staffer erroneously posted the video and that it since had been taken down.The White House did not immediately respond to CNBC's follow-up questions, including who the staffer was and how often they are posting from the president's official accounts. A source familiar with the matter, however, later told CNBC that Trump \"had not seen that video before it was posted.\"\"As soon as he found out, he ordered it taken down,\" the source added.Leavitt's initial reply included a link to a longer video posted Oct. 24 from a pro-Trump meme account on X.In addition to showing the Obamas as apes, the full video shows other animals bearing the faces of prominent Democrats, including former Secretary of State Hillary Clinton, House Minority Leader Hakeem Jeffries of New York and Rep. Alexandria Ocasio-Cortez.(Left to right) U.S. President Donald Trump, first lady Melania Trump, former U.S. President Barack Obama and wife Michelle Obama attend the funeral service for former U.S. President George H. W. Bush at the National Cathedral in Washington, D.C., on Dec. 5, 2018.Mandel Ngan | Afp | Getty ImagesTrump is depicted in that video as a lion. The song \"The Lion Sleeps Tonight\" by The Tokens plays in the background.Sen. Tim Scott, R-S.C., a close ally of Trump's who is usually one of his reliable defenders, blasted the image posted on Trump's account.\"Praying it was fake because it's the most racist thing I've seen out of this White House,\" the senator wrote in a post on X. \"The President should remove it,\" he added before the post was deleted.Rep. Mike Lawler, a New York Republican who is considered at risk of losing his seat in the House of Representatives in November's election, also criticized Trump's post.\"The President's post is wrong and incredibly offensive — whether intentional or a mistake — and should be deleted immediately with an apology offered,\" Lawler said on X. The Obama Foundation did not respond to CNBC's request for comment.The video that Trump reposted carried the watermark of an entity calling itself Patriot News Outlet.CNBC reached out to Patriot News Outlet via its email address, requesting comment on the new video, asking who created it and for what purpose, and reaction to the video being removed from Trump's Truth Social feed.In response, the group said, \"We fully unaware of anything that President Trump might have posted including any video claiming to be from Patriot News Outlet. I cannot comment or any your questions for this reason [sic].\"\"Do you have a link to the video or copy of the video you can share?\" the group said.Trump's opponents may seek to make the post an issue for the midterm election in November, though it's still nine months away. Read more CNBC politics coverageTrump posts racist image of Obamas, White House defends it and slams 'fake outrage'Sen. Slotkin refuses DOJ interview request over troops video: ‘The intimidation is the point’Hillary Clinton wants testimony on Jeffrey Epstein in public: ‘Let’s stop the games’Trump would decide whether to investigate Fed pick Warsh over refusal to cut rates: BessentTrump's fellow Republicans in Congress have expressed worries that they will not be able to retain their slim majorities in both the House and Senate in November's election.The NAACP, in a post on X, said: \"Trump posting this video — especially during Black History Month— is a stark reminder of how Trump and his followers truly view people. And we'll remember that in November.\"Democratic elected officials quickly called on other Republicans to condemn the post.\"President Obama and Michelle Obama are brilliant, compassionate and patriotic Americans,\" Jeffries wrote on X. \"They represent the best of this country. Donald Trump is a vile, unhinged and malignant bottom feeder.\"\"Why are GOP leaders like John Thune continuing to stand by this sick individual? Every single Republican must immediately denounce Donald Trump's disgusting bigotry,\" Jeffries wrote, referring to the Senate majority leader.The press office of California Gov. Gavin Newsom, another Democrat mocked in the video, said on X: \"Disgusting behavior by the President. Every single Republican must denounce this. Now.\"Rep. Raja Krishnamoorthi, D-Ill., in his own post on X, said, \"This kind of Jim Crow-style dehumanization is pathetic and a disgrace to the office.\"— CNBC's Eamon Javers contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump condemns racist video showing Obamas as apes after removing it, but says he won't apologize",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108262493-1770386563014-gettyimages-1068802366-AFP_1BD4RE.jpeg?v=1770393237&w=1920&h=1080"
      ],
      "datePublished": "2026-02-07T02:11:18.000Z",
      "dateModified": "2026-02-07T02:11:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Goldman Sachs taps Anthropic’s Claude to automate accounting, compliance roles",
    "url": "https://www.cnbc.com/2026/02/06/anthropic-goldman-sachs-ai-model-accounting.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108142522-17466508042025-05-07t204524z_1758890738_rc28deam98qs_rtrmadp_0_usa-stocks.jpeg?v=1746650891&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T18:10:44.000Z",
    "description": "Goldman Sachs has been working with the artificial intelligence startup Anthropic to create AI agents to automate a growing number of roles within the",
    "body": "Goldman Sachs has been working with the artificial intelligence startup Anthropic to create AI agents to automate a growing number of roles within the bank, the firm's tech chief told CNBC exclusively.The bank has, for the past six months, been working with embedded Anthropic engineers to co-develop autonomous agents in at least two specific areas: accounting for trades and transactions, and client vetting and onboarding, according to Marco Argenti, Goldman's chief information officer.The firm is \"in the early stages\" of developing agents based on Anthropic's Claude model that will collapse the amount of time these essential functions take, Argenti said. He expects to launch the agents \"soon,\" though he declined to provide a specific date.\"Think of it as a digital co-worker for many of the professions within the firm that are scaled, are complex and very process intensive,\" he said.Goldman Sachs CEO David Solomon said in October that his bank was embarking on a multiyear plan to reorganize itself around generative AI, the technology that has made waves since the arrival of OpenAI's ChatGPT in late 2022. Even as investment banks like Goldman are experiencing surging revenue from trading and advisory activities, it will seek to \"constrain headcount growth\" amid the overhaul, Solomon said.The news from Goldman comes as model updates from Anthropic, co-founded by a former OpenAI executive, have sparked a sharp sell-off among software firms and their credit providers as investors wager on who the winners and losers from the AI trade will be.watch nowGoldman began last year by testing an autonomous AI coder called Devin, which is now broadly available to the bank's engineers. But it quickly found that Anthropic's AI model could work in other parts of the bank, Argenti said. \"Claude is really good at coding,\" Argenti said. \"Is that because coding is kind of special, or is it about the model's ability to reason through complex problems, step-by-step, applying logic?\"Argenti said the firm was \"surprised\" at how capable Claude was at tasks besides coding, especially in areas like accounting and compliance that combine the need to parse large amounts of data and documents while applying rules and judgment, he said.Now, the view within Goldman is that \"there are these other areas of the firm where we could expect the same level of automation and the same level of results that we're seeing on the coding side,\" he said.The upshot is that, with the help of the agents in development, clients will be onboarded faster and issues with trade reconciliation or other accounting matters will be solved faster, Argenti said.Goldman could next develop agents for tasks like employee surveillance or making investment banking pitchbooks, he said. While the bank employs thousands of people in the compliance and accounting functions where AI agents will soon operate, Argenti said that it was \"premature\" to expect that the technology will lead to job losses for those workers.Still, Goldman could cut out third-party providers it uses today as AI technology matures, he said.\"It's always a trade-off,\" Argenti said. \"Our philosophy right now is that we're injecting capacity, which in most cases will allow us to do things faster, which translates to a better client experience and more business.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Goldman Sachs taps Anthropic’s Claude to automate accounting, compliance roles",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108142522-17466508042025-05-07t204524z_1758890738_rc28deam98qs_rtrmadp_0_usa-stocks.jpeg?v=1746650891&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T18:10:44.000Z",
      "dateModified": "2026-02-06T18:10:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tech AI spending may approach $700 billion this year, but the blow to cash raises red flags",
    "url": "https://www.cnbc.com/2026/02/06/google-microsoft-meta-amazon-ai-cash.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108226426-1763156326564-gettyimages-2246161011-1texasgov.jpeg?v=1770417173&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T22:52:19.000Z",
    "description": "The Google Midlothian Data Center in Texas, Nov. 14, 2025.Ron Jenkins | Getty ImagesAlphabet, Microsoft, Meta and Amazon are expected to spend nearly ",
    "body": "The Google Midlothian Data Center in Texas, Nov. 14, 2025.Ron Jenkins | Getty ImagesAlphabet, Microsoft, Meta and Amazon are expected to spend nearly $700 billion combined this year to fuel their AI build-outs.For investors who love cash above all else, some warning signs may be flashing. With the heart of tech earnings season wrapping up this week, Wall Street has a clearer picture of how the artificial intelligence race is poised to accelerate in 2026. The four hyperscalers are now projected to increase capital expenditures by more than 60% from the historic levels reached in 2025, as they load up on high-priced chips, build new mammoth facilities and buy the networking technology to connect it all.Getting to those kinds of numbers is going to require sacrifice in the form of free cash flow. Last year, the four biggest U.S. internet companies generated a combined $200 billion in free cash flow, down from $237 billion in 2024. The more dramatic drop appears to be ahead, as companies invest heavily up front, promising future returns on investment. That means margin pressures, less cash generation in the near term and the potential need to further tap the equity and debt markets. Alphabet held a $25 billion bond sale in November, and its long-term debt quadrupled in 2025 to $46.5 billion.Amazon, which on Thursday said it expects to spend $200 billion this year, is now looking at negative free cash flow of almost $17 billion in 2026, according to analysts at Morgan Stanley, while Bank of America analysts see a deficit of $28 billion. In a filing with the SEC on Friday, Amazon let investors know that it may seek to raise equity and debt as its build-out continues.watch nowDespite beating on revenue for the quarter, Amazon saw its stock sink almost 6% on Friday, bringing its drop for the year to 9%. Microsoft is down 17%, the most in the group, while Alphabet and Meta are up slightly. While Amazon laid out the most aggressive spending plan among the megacaps, Alphabet wasn't far behind. The company, which is investing in its cloud infrastructure business as well as its Gemini models, sees up to $185 billion in capex this year. Morgan Stanley managing director Brian Nowak told CNBC's \"Power Lunch\" that he's projecting even more spend in coming years, with Alphabet shelling out up to $250 billion in 2027.Pivotal Research projects Alphabet's free cash flow to plummet almost 90% this year to $8.2 billion from $73.3 billion in 2025. Analysts at Mizuho wrote in a report that bearish investors may look at the potential doubling of capex this year as \"leaving limited FCF in 2026 with uncertain\" return on investment.Still, the analysts remain bullish and all kept their buy recommendations on the respective stocks. Longbow Asset Management CEO Jake Dollarhide is right there with them. He counts Amazon as the biggest holding in his portfolio, followed by Alphabet at fourth and Microsoft ninth. \"If you're going to pour all this money into AI, it's going to reduce your free cash flow,\" Dollarhide said. \"Do they have to go to the debt markets or short-term financing to find the optimal mix of equity and debt? Yeah. That's why CEOs and CFOs are paid what they're paid.\"'Somewhat shocking'Analysts at Barclays now see a drop of almost 90% in Meta's free cash flow, after the social media company said last week that capex this year will reach as high as $135 billion. They kept their overweight rating even as they forecast an even tougher cash position the next two years. \"We are now modeling negative FCF for '27 and '28, which is somewhat shocking to us but likely what we eventually see for all companies in the AI infrastructure arms race,\" the analysts wrote in a note after earnings. When Meta CFO Susan Li was asked on the earnings call about capital allocation and the company's plans for future buybacks, she responded that the \"highest order priority is investing our resources to position ourselves as a leader in AI.\"At Microsoft, where capex is going up but at a slower rate than at its tech peers, Barclays estimates that free cash flow will slide by 28% this year before popping back up in 2027. Representatives from Alphabet, Amazon, Microsoft and Meta declined to comment. watch nowA big advantage the tech industry's most-valuable companies have over high-flying AI upstarts like OpenAI and Anthropic is that they've accumulated a massive cash pile in recent years. As of the end of the latest quarter, the four leaders had a total of over $420 billion in cash and equivalents. Deutsche Bank analysts wrote in a report on Thursday about Alphabet that the company's infrastructure build-out is creating a \"meaningful moat.\" It's a sentiment shared broadly by industry executives and experts who view AI as a generational opportunity with revenue reaching will into the trillions. Businesses today are testing and building new AI agents to handle all sorts of tasks, including developing applications with just a few text prompts. All of that advancement requires hefty amounts of compute, which the cloud providers say is creating insatiable demand for their technology. \"Between what's happening in business and enterprise — they are all building on these AI companies Google, Meta, Amazon,\" Futurum Group CEO Daniel Newman told CNBC in an interview \"These are core technologies.\"  Morgan Stanley's Nowak said Alphabet is \"seeing a lot of signal on return when it comes to Google Cloud, return on Google search and YouTube.\" And Amazon CEO Andy Jassy said on his company's earnings call that growth at Amazon Web Services was \"the fastest we've seen in 13 quarters.\"But plenty of unknowns remain, and some skeptics worry that a slipup at OpenAI, which has announced over $1.4 trillion in AI deals, could lead to a market contagion because so much of the AI industry's growth prospects are tied to the ChatGPT creator. \"The truth is, we're at the dawn of a new technology shift and it's really hard to know the sustainability of top line,\" Michael Nathanson, co-founder of equity research firm MoffettNathanson, told CNBC. \"We're entering new times and predicting the top line has gotten a lot harder. There's a ton of surprising going on.\"— CNBC's Deirdre Bosa, Jordan Novet, Annie Palmer and Jonathan Vanian contributed to this report. WATCH: Megacap tech stocks sell off as AI spending outpaces revenue growthwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tech AI spending may approach $700 billion this year, but the blow to cash raises red flags",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108226426-1763156326564-gettyimages-2246161011-1texasgov.jpeg?v=1770417173&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T22:52:19.000Z",
      "dateModified": "2026-02-06T22:52:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Amazon’s CEO is ‘confident’ with $200 billion spending plan",
    "url": "https://www.cnbc.com/2026/02/05/why-amazons-ceo-is-confident-with-200-billion-spending-plan.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217788-1761657947456-gettyimages-2201505685-ALEXA_AI_UNVEILING.jpeg?v=1770336524&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T14:49:10.000Z",
    "description": "Andy Jassy, CEO of Amazon, speaks during an unveiling event in New York, Feb. 26, 2025.Michael Nagle | Bloomberg | Getty ImagesAmazon's stock plunged ",
    "body": "Andy Jassy, CEO of Amazon, speaks during an unveiling event in New York, Feb. 26, 2025.Michael Nagle | Bloomberg | Getty ImagesAmazon's stock plunged 11% in extended trading Thursday, dragged lower by market jitters around the company's $200 billion capex plans, the highest spending forecast among the megacap companies. The forecast is a sharp increase from Amazon's capital expenditures last year, and it was more than $50 billion above analysts' expectations. The company reported spending roughly $131 billion on purchases of property and equipment in 2025, up from about $83 billion in the year prior.  Tech companies have laid out aggressive spending plans on artificial intelligence infrastructure since OpenAI ushered in the modern era of this technology with the release of ChatGPT in late 2022, but at the start of 2026, those lavish commitments have only kept growing. Google parent Alphabet on Wednesday said it would spend up to $185 billion in 2026, while Meta last week said its capital expenditures could nearly double from last year to somewhere between $115 billion and $135 billion in 2026On a conference call with investors, Wall Street analysts pressed Amazon executives for more clarity around the spending blitz and when it could begin to pay off. CEO Andy Jassy said in prepared remarks at the beginning of the call that he was \"confident\" that company's cloud unit will see a \"strong return on invested capital,\" though he didn't say when it could materialize.\"Help us, get to that — get to your level of confidence in having a strong long-term return on that invested capital,\" Mark Mahaney, Evercore ISI head of internet research, said to Jassy. Jassy said the company needs the capital to keep pace with \"very high demand\" for Amazon's AI compute, which requires more infrastructure such as data centers, chips and networking equipment.\"This isn't some sort of quixotic, top-line grab,\" Jassy said. \"We have confidence that we, that these investments will yield strong returns on invested capital. We've done that with our core AWS business. I think that will very much be true here as well.\"Sales at Amazon Web Services grew 24% to $35.6 billion in the most recent period, beating analysts' expectations and marking the cloud unit's \"fastest growth in 13 quarters,\" Jassy said. AWS could've grown faster if it had more capacity to meet demand, \"so we are being incredibly scrappy around that,\" he said. The company's cloud unit added almost 4 gigawatts of computing capacity in 2025, and AWS expects to double that power by the end of 2027, Jassy noted.Barclays analyst Ross Sandler asked Jassy how he sees the AI market evolving from the current landscape, where it remains \"a bit top-heavy with a lot of the spend clustering around a few of the AI-native labs.\"Jassy said the AI market has become more like a \"barbell,\" with the AI labs on one side and enterprises on the other end, looking to the technology as a \"productivity and cost avoidance\" tool. The middle is comprised of enterprises that are in various stages of building AI applications, he said. \"That middle part of the barbell very well may end up being the largest and most durable,\" Jassy said. WATCH: Amazon shares fall on earnings miss, $200 billion guidance for 2026 capex spendingwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Amazon’s CEO is ‘confident’ with $200 billion spending plan",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217788-1761657947456-gettyimages-2201505685-ALEXA_AI_UNVEILING.jpeg?v=1770336524&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T14:49:10.000Z",
      "dateModified": "2026-02-06T14:49:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stellantis CEO says automaker is stronger together as stock plummets amid $26 billion charge",
    "url": "https://www.cnbc.com/2026/02/06/stellantis-stla-ceo-antonio-filosa.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108236700-17648675632025-12-04t160441z_1876970717_rc2o3iaf0cbg_rtrmadp_0_autos-stellantis-filosa.jpeg?v=1768424783&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T21:09:39.000Z",
    "description": "Stellantis CEO Antonio Filosa speaks during an event in Turin, Italy, Nov. 25, 2025.Daniele Mascolo | ReutersDETROIT — Stellantis CEO Antonio Filosa o",
    "body": "Stellantis CEO Antonio Filosa speaks during an event in Turin, Italy, Nov. 25, 2025.Daniele Mascolo | ReutersDETROIT — Stellantis CEO Antonio Filosa on Friday said the automaker plans to move forward as one company amid speculation that it would be better off selling brands or splitting up after disappointing results. \"Stellantis is a very strong global company that is very proud to have very deep regional groups,\" Filosa, an Italian native, told reporters during a media call. \"It makes all of sense to stay together. We want to stay together for many years to come.\" His comments come hours after the company announced 22 billion euros ($26 billion) in charges from a business restructuring that includes pulling back on electrification plans and reintroducing V8 engines to U.S. models.  Filosa described the actions as an \"important strategic reset of our business model, with the only intention to put our customer preferences back at the center of what we do globally and in each regions.\" He said the \"mission is to grow\" after notable declines in market share in recent years.In Milan, the company's Italian shares fell 25% Friday. On Wall Street, the transatlantic firm's New York-listed stock plummeted 23%. Filosa on Friday did not specifically rule out the possibility of regionally refocusing or shrinking the company's vast portfolio of 14 auto brands that includes U.S. brands Jeep, Ram and Chrysler, as well as Italian nameplates Fiat and Alfa Romeo, which have not performed well domestically.Stock Chart IconStock chart iconStellantis-listed shared in Milan and New York\"We want to really manage our brands in the sense to provide to them the products and the technology that our customers, that are now at the center of our strategic reset, will tell us that they want and they need,\" he said. \"This is our core mission.\"Filosa said additional information about the company's plans moving forward will come at a May 21 investor day.Friday's announcement comes days after Stellantis executives met with the company's U.S. franchised dealers at their annual National Automobile Dealers Association conference with a message that the automaker planned to grow sales across its U.S. lineup of brands, according to two dealers who attended the meeting.$26 billion in chargesThe majority of Friday's announced charges — 14.7 billion euros — are related to realigning product plans with consumer preferences and new emission regulations in the U.S. Other charges include 2.1 billion euros in resizing the company's EV supply chain, 4.1 billion euros in warranty costs and 1.3 billion euros in restructuring European operations. The automaker also canceled its dividend for 2026 and issued a 5 billion euro nonconvertible hybrid bond.2026 Jeep Grand WagoneerJeepThe charges related to EVs follow General Motors and Ford Motor announcing billions of dollars in similar expenses due to pullbacks in plans for all-electric vehicles.Shares of Ford and GM were not as impacted as much as Stellantis, which also issued lower-than-expected guidance amid years of strategic problems with the company.Stellantis said it anticipates a net loss for 2025. For 2026, the auto giant is targeting a mid-single-digit percentage increase in net revenue and a low-single-digit rise in its adjusted operating income margin.\"While charges were expected, the amount comes in above F ($19.5B) and GM ($7.6B). Expect shares to trade meaningfully lower today as a result. We continue to believe STLAM is a show-me-story. In the US, the company has lost substantial market share given high pricing and a perceived lack of product investment,\" RBC Capital Markets analyst Tom Narayan said in a Friday investor note.Past mistakesFilosa on Friday called out mistakes by former company leaders more than he has since he succeeded Carlos Tavares as CEO in June. Tavares, who was ousted in December 2024 amid disagreements with the Stellantis board, in a book last year reportedly said that the group's French, Italian and U.S. operations might have to be split amid pressure from its main stakeholders.It's been just over five years since Stellantis was created through a $52 billion combination of Italian American automaker Fiat Chrysler and France-based Groupe PSA on Jan. 16, 2021.watch nowThe merger formed the fourth-largest automaker by volume, but the company has run into significant problems in recent years amid its investments in all-electric vehicles, focus on profits over market share and cost-cutting efforts to the detriment of products.Stellantis' global sales under Tavares fell 12.3% from 6.5 million in 2021 — the year the company was formed — to 5.7 million in 2024. That included a roughly 27% collapse in the U.S. in that period to 1.3 million vehicles sold. The automaker dropped from fourth in U.S. sales to sixth, declining from an 11.6% market share to 8% during that time frame.Stellantis' global market share has fallen from 8.1% in 2020 to an estimated 6.1% last year, according to S&P Global Mobility.  Correction: Global market share for Stellantis has fallen from 8.1% in 2020 to an estimated 6.1% last year, according to S&P Global Mobility. An earlier version mischaracterized the percentage.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stellantis CEO says automaker is stronger together as stock plummets amid $26 billion charge",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108236700-17648675632025-12-04t160441z_1876970717_rc2o3iaf0cbg_rtrmadp_0_autos-stellantis-filosa.jpeg?v=1768424783&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T21:09:39.000Z",
      "dateModified": "2026-02-06T21:09:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "White House launches direct-to-consumer drug site TrumpRx. Here's what to know",
    "url": "https://www.cnbc.com/2026/02/05/trump-rx-white-house-launches-direct-to-consumer-drug-site.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108262460-1770383887859-gettyimages-2259525568-TRUMPRX_LAUNCH.jpeg?v=1770384067&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T13:20:50.000Z",
    "description": "US President Donald Trump speaks in the South Court Auditorium of the Eisenhower Executive Office Building at the White House in Washington, DC, US, o",
    "body": "US President Donald Trump speaks in the South Court Auditorium of the Eisenhower Executive Office Building at the White House in Washington, DC, US, on Thursday, Feb. 5, 2026.Aaron Schwartz | Bloomberg | Getty ImagesPresident Donald Trump on Thursday announced the launch of TrumpRx — a direct-to-consumer website that is key to his administration's efforts to lower prescription drug costs in the U.S. The president said millions of Americans would save money through the platform. But it's still unclear if all patients — particularly those with insurance coverage — will see more cost savings from using that site to buy their medicines than they would through existing methods. TrumpRx targets people who are willing to pay with cash and forgo insurance, which suggests that patients without or with limited coverage may benefit the most. \"You're going to save a fortune and this is also so good for overall health care,\" Trump said at an event Thursday night unveiling the website.The site does not sell drugs directly to American patients, but acts as a central hub that points them to drugmakers that are offering discounts on certain products on their own direct-to-consumer sites, or gives them discount coupons to take to pharmacies. For example, Eli Lilly and Novo Nordisk were already offering their blockbuster obesity drugs at hefty discounts to cash-paying patients, even before the reductions Trump touted on Thursday.Clicking on the platform's offer for Lilly's popular Zepbound weight loss injection sends consumers to the company's LillyDirect platform, where they can order the treatment and submit prescription details.A screenshot of a Zepbound order on the TrumpRx website.\nPreview\nFilters\nSource InfoIn recent months, Lilly, Novo and at least 14 other drugmakers have negotiated agreements with the Trump administration to participate on the platform and voluntarily sell certain medicines at a discount to Medicaid patients. Those landmark deals are part of Trump's broader \"most favored nation\" policy, which pushes to link U.S. drug prices to the lowest ones abroad.At launch, the site features only medications from the first five companies to strike pricing deals with the administration: AstraZeneca, Lilly, EMD Serono, Novo Nordisk and Pfizer, according to a White House fact sheet. It will list drugs from other companies \"in the coming months,\" the administration said.The platform is the government's latest effort to try to rein in U.S. prescription drug prices, which are two to three times higher on average than those in other developed nations — and up to 10 times more than in certain countries, according to the Rand Corp., a public policy think tank.But TrumpRx \"doesn't seem like it is the only solution\" to that issue for most Americans, said Juliette Cubanski, deputy director of the program on Medicare Policy at KFF, a health policy research organization. The cash-pay offerings could be better deals for patients without insurance, but it's difficult to assess exactly how many people stand to benefit from TrumpRx, she added. \"If they're able to get a drug covered by their insurance at a relatively affordable copay, then there's not a great upside to using the TrumpRx website,\" Cubanski said. She said people with insurance coverage who buy through direct-to-consumer platforms may also not have their purchases count toward their benefits, which means it doesn't help them meet their deductible or out-of-pocket maximum. But Cubanski said there's potential for TrumpRx to be helpful in expanding access to certain drugs at more affordable prices, particularly medicines not covered widely by insurance in the U.S., such as obesity drugs. Medicare will start covering weight loss treatments for the first time later this year as part of the deals Lilly and Novo struck with Trump, but many employers are still hesitant to cover those drugs. Still, many of the other products expected to be listed on TrumpRx are already widely covered through insurance, and some are available as cheaper generics from competing drugmakers. Questions about savingsQuestions remain about how much savings people can expect if they buy their medicines at direct-to-consumer prices. The announced price reductions for certain drugs are framed as steep cuts from their so-called retail list prices. For example, under Novo Nordisk's agreement with the administration, some doses of its diabetes drug Ozempic will be priced at $350 per month on TrumpRx, which is less than half of its roughly $1,000 monthly list price. But those list prices are often far higher than what private insurers and government programs ultimately pay for medicines after rebates, discounts and other concessions, according to researchers at Georgetown's Medicare Policy Initiative. That suggests some payers may already be securing prices comparable to — or lower than — the newly announced discounts on medications under the Trump deals. The Georgetown researchers cited one study that found that average discounts on brand-name drugs in Medicare Part D run around 40% of list prices. Meanwhile, discounts in Medicaid exceed 75%, according to a Congressional Budget Office study. In the private sector, \"we've got insurers and pharmacy benefit managers negotiating lower prices and designing an insurance benefit that enables people to benefit from those price negotiations,\" said KFF's Cubanski. \"My guess is that for most drugs, at least most brand-name medications, people are likely to get a better deal using their insurance rather than purchasing a drug through a direct-to-consumer website,\" she said. Drugs on TrumpRxAt the launch of the site, the administration listed a range of major drugs as available for discounts, with a particular emphasis on popular GLP-1 products:Ozempic injection for diabetes, made by Novo Nordisk: Starting at $199 per month, down from around $1,000Wegovy injection for obesity, made by Novo Nordisk: Starting at $199 per month, down from around $1,350Wegovy pill for obesity, made by Novo Nordisk: $149 per month for the starting dosesZepbound injection for obesity, made by Eli Lilly: starting at $299 per month, down from $1,086The White House also put an emphasis on cash-pay discounts for fertility drugs like Gonal-F from EMD Serono, which was listed at $168. Dozens of other drugs that companies expected to be be listed on the platform were not as of Thursday night. Those include key treatments from companies including Amgen, Merck and Gilead, among others.In an interview with CNBC at a conference in January, Bristol Myers Squibb CEO Chris Boerner said the company has multiple products on its existing direct-to-consumer platform, which first offered a cash-pay discount on its blood thinner Eliquis. That platform will eventually link to TrumpRx, he said. The company is going to examine ways to put additional products in its portfolio on its own platform, \"where it makes sense,\" Boerner added. He said Bristol Myers is \"aligned with the administration\" on the issue of the U.S. health care system being too complex, and said several middlemen can increase costs. \"What we like about these [direct-to-consumer models], where they make sense from a business standpoint, is you're able to circumvent some of that,\" Boerner said. Meanwhile, in an exclusive interview with CNBC last week, Eli Lilly CEO Dave Ricks said the company was the first drugmaker to sell obesity treatments directly to patients, and that TrumpRx is \"taking that and expanding it across the industry\" to other medicines.\"We're all for that,\" Ricks said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White House launches direct-to-consumer drug site TrumpRx. Here's what to know",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108262460-1770383887859-gettyimages-2259525568-TRUMPRX_LAUNCH.jpeg?v=1770384067&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T13:20:50.000Z",
      "dateModified": "2026-02-06T13:20:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shares of Jennifer Garner's Once Upon a Farm pop 17% in public market debut",
    "url": "https://www.cnbc.com/2026/02/06/once-upon-a-farm-ipo-ofrm-starts-trading-on-the-new-york-stock-exchange.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108262710-1770402935998-OFRM-OB-Photo-20260206-CC-PRESS-206.jpg?v=1770403035&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T21:06:15.000Z",
    "description": "Jennifer Garner, co-founder of Once Upon a Farm, center, and Cassandra Curtis, co-founder of of Once Upon a Farm, center right, during the company's i",
    "body": "Jennifer Garner, co-founder of Once Upon a Farm, center, and Cassandra Curtis, co-founder of of Once Upon a Farm, center right, during the company's initial public offering (IPO) on the floor of the New York Stock Exchange (NYSE) in New York, US, on Friday, Feb. 6, 2026. Michael Nagle | Bloomberg | Getty ImagesOnce Upon a Farm made its public market debut on Friday, trading on the New York Stock Exchange under the ticker \"OFRM.\"The stock opened at $21 per share, up 16% from its initial public offering price. The shares closed on Friday up 17%.The organic children's nutrition company priced its IPO at $18 per share on Thursday, in the middle of the expected range of $17 to $19. Once Upon a Farm and backers sold about 11 million shares, raising $197.9 million and valuing the company at $724 million.Founded in 2015 by Cassandra Curtis and Ari Raz, the Berkeley, California-based company sells a range of organic cold-processed, refrigerated baby foods and kid snacks. In 2017, actress Jennifer Garner and former Annie's Homegrown CEO John Foraker joined the company as co-founders. Garner sits on the company's board and holds the formal title \"Farmer Jen,\" while Foraker, whom she calls the \"Grand Poobah of organic,\" is CEO.\"We want to feed babies to big kids, as we're helping make parents lives easier,\" Garner told CNBC.Once Upon a Farm's market debut comes as shoppers and policymakers alike have pushed back on ultra-processed foods, particularly when consumed by children. For example, the \"Make America Healthy Again\" movement, spearheaded by Health and Human Services Secretary Robert Kennedy Jr., has found evangelists in so-called MAHA moms, who agree with his opinions on everything from junk food to childhood vaccinations. The shift in behavior has hurt Big Food, while fueling growth for insurgent brands like Once Upon a Farm. In 2024, the company recorded net sales of $156.8 million, up 66% from the prior year, although its losses widened from $17.6 million to $23.8 million, according to a regulatory filing.\"With these tailwinds and consumer trends being in the right spot, we're really trying to take advantage of that and deliver more for consumers,\" Foraker said in an interview.Retailers have taken note of the shift and are allotting prime shelf space to organic foods, a far cry from Foraker's early days at Annie's, when its products were relegated to the undesirable \"organic\" corner in grocery stores, he said.Once Upon a Farm, which is officially designated as a public benefit corporation, aims to \"drive systemic change in childhood nutrition,\" according to its mission statement. Foraker said its commitment to that goal is why it chose to go public rather than seek a sale, a much more common ambition for upstart consumer goods businesses. While Foraker said he had a good experience with General Mills after it bought Annie's in 2014, he noted that across the food and beverage industry, many companies do not stick to the promises that they make to brands they are buying and honor their mission. (Look no further than the yearslong dust-up between Ben & Jerry's and its former owner Unilever and current parent Magnum Ice Cream Co., which spun out from the Dove owner last year.)Once Upon a Farm was planning to go public last year, before the longest-ever government shutdown disrupted those plans. The company plans to spend the IPO proceeds to pay down its debt, purchase new equipment and fund general corporate purposes, according to a regulatory filing.Broadly, more IPOs are expected this year, thanks to interest rate cuts and a large backlog of companies that have been scared off by market volatility and recession fears. This week alone saw seven companies go public through IPOs that raised at least $150 million each, including Bob's Discount Furniture, according to Renaissance Capital data.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shares of Jennifer Garner's Once Upon a Farm pop 17% in public market debut",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108262710-1770402935998-OFRM-OB-Photo-20260206-CC-PRESS-206.jpg?v=1770403035&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T21:06:15.000Z",
      "dateModified": "2026-02-06T21:06:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cramer's week ahead: A key jobs report. Plus, earnings from Robinhood, McDonald's and more ",
    "url": "https://www.cnbc.com/2026/02/06/cramers-week-ahead-earnings-from-robinhood-and-mcdonalds-plus-key-jobs-data-ahead.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108249252-1767789403014-gettyimages-2247519635-jr_12610_nrxesonq.jpeg?v=1767789516&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-07T00:00:01.000Z",
    "description": "watch nowCNBC's Jim Cramer on Friday outlined what to watch in Wall Street's week ahead, from key labor data to big earnings reports from McDonald's, ",
    "body": "watch nowCNBC's Jim Cramer on Friday outlined what to watch in Wall Street's week ahead, from key labor data to big earnings reports from McDonald's, Robinhood and others. \"There's a lot going on next week, but the most important thing, believe it or not, is the Labor Department's nonfarm payroll report on Wednesday,\" Cramer said. \"If that comes in soft, it means the Fed can keep cutting rates, and that's great news for the stock market itself.\"Cramer said the recent rallies in decent stocks like PepsiCo, Procter & Gamble and Johnson & Johnson suggests the market believes the U.S. economy is showing signs of weakness. The January jobs report was originally due out Friday morning, but was delayed a few days due to the partial U.S. government shutdown. According to FactSet, economists estimate the U.S. added 80,000 jobs last month.The \"Mad Money\" host then turned his attention to upcoming corporate earnings.CVS Health reports quarterly results on Tuesday morning. Although the stock has been hammered with other health insurers on the Trump administration's proposed reimbursement rates for Medicare Advantage plans, Cramer said it's the only stock in that space he would own. \"CEO David Joyner has done a terrific job and I think it's a fascinating time to own the stock,\" he added. \"They're the last real national drugstore chain now that Walgreens has been taken private.\"Meanwhile, Cramer said DuPont's earnings report that same day should highlight how great of a job CEO Lori Koch has done to improve the chemicals company. DuPont spun off its electronics business into a separate company called Qnity late last year, a long-awaited move that has helped kickstart the stock, which has soared about 58% over the past six months. DuPont is also a holding in Cramer's Charitable Trust, the portfolio managed by the CNBC Investing Club. The Club booked gains on this stock into strength on Thursday. Tuesday also brings results from Robinhood. Cramer said this one has been concerning investors because of how closely its trades with cryptocurrency markets. Shares of Robinhood are down nearly 27% year to date versus the S&P 500's 1.3% gain. McDonald's releases earnings on Wednesday. Cramer described the fast food chain as \"blessed\" because while beef inflation remains an issue, its value proposition has improved for cash-strapped consumers. Finally, Cisco Systems is up to bat after the bell. Shares of the networking company have surged ahead of Wednesday's report, up 10% year to date. \"The stock's been soaring. I don't know. We have to find out if this is a company that's got less software [and] more hardware,\" Cramer said. Cisco is also a holding in Cramer's Charitable Trust. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cramer's week ahead: A key jobs report. Plus, earnings from Robinhood, McDonald's and more ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108249252-1767789403014-gettyimages-2247519635-jr_12610_nrxesonq.jpeg?v=1767789516&w=1920&h=1080"
      ],
      "datePublished": "2026-02-07T00:00:01.000Z",
      "dateModified": "2026-02-07T00:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hims & Hers shares tick lower after Novo's legal threat",
    "url": "https://www.cnbc.com/2026/02/06/wegovy-hims-hers-stock-novo-nordisk-pill-latest.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108099400-1738953241476-AP24142287309268.jpg?v=1738953354&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-06T17:27:07.000Z",
    "description": "Rafael Henrique | SOPA Images | APThe stock of Hims & Hers fell Friday after a legal threat from Novo Nordisk.The online teleheath company announced o",
    "body": "Rafael Henrique | SOPA Images | APThe stock of Hims & Hers fell Friday after a legal threat from Novo Nordisk.The online teleheath company announced on Thursday plans to launch a cheaper, copycat version of Novo's weight loss pill, prompting Novo to take legal action.Hims stock spiked as much as 15% on the news in Thursday trading, but quickly pared gains and ended the session down 3.8% at a 12-month low after Novo said the action was \"illegal.\" Shares fell as much as 10% more on Friday before paring losses. It was last trading about 2% down. Hims said it will launch a Wegovy-style pill containing the same active ingredient as the original brand, semaglutide, for as little as $49 for the first month when customers sign up for a subscription. After the first month, the price will rise to $99. That's significantly lower than the $149 Novo Nordisk sells its starting dose for on its direct-to-consumer website NovoCare. Stock Chart IconStock chart iconHims & Hers stock has been volatile over the past year.Hims is launching its pill even though semaglutide has patent protection in the U.S. until 2032. The telehealth firm's business flourished when it started selling compounded semaglutide in an injectable format, using a loophole in U.S. regulation that allows competitors to sell a drug protected by intellectual property laws if the drug is in short supply.In the early days of the Wevovy jab, demand significantly outstripped supply, but Novo Nordisk has since invested heavily in manufacturing capacity and resolved the supply issues. There are no shortages reported for the pill version.Hims says that its versions are \"personalized\" in dosage, and therefore legal. Novo says the action is illegal and a risk to patient safety. \"This is another example of Hims & Hers' historic behaviour of duping the American public with knock-off GLP-1 products, and the FDA has previously warned them about their deceptive advertising of GLP-1 knock-offs,\" Novo said in a statement Thursday.Hims is a volatile stock, inherently tied to its perceived ability to sell weight loss drugs like its Wegovy copy. Shares have hit highs of $69 and lows of roughly $21 in the past 12 months.Leerink Partners analyst Michael Cherny, who rates Hims stock at \"Market Perform,\" suggested the telehealth provider could also consider launching copycat versions of Eli Lilly's weight loss drugs. Lilly didn't respond to a CNBC request for comment.Meanwhile, Barclays analyst James Gordon called the $49 Wegovy copy a \"new concern\" for Novo.\"While compounded alternatives may attract cost-sensitive patients in the near term, questions remain about their regulatory sustainability and clinical consistency,\" he added. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hims & Hers shares tick lower after Novo's legal threat",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108099400-1738953241476-AP24142287309268.jpg?v=1738953354&w=1920&h=1080"
      ],
      "datePublished": "2026-02-06T17:27:07.000Z",
      "dateModified": "2026-02-06T17:27:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]