[
  {
    "title": "Paramount Skydance launches hostile bid for WBD 'to finish what we started,' CEO Ellison tells CNBC",
    "url": "https://www.cnbc.com/2025/12/08/paramount-skydance-hostile-bid-wbd-netflix.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238393-1765214232072-108238393-1765211822234-gettyimages-2250111360-PARAMOUNT_NYSE.jpeg?v=1765214244&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T22:25:39.000Z",
    "description": "watch nowParamount Skydance is launching a hostile bid to buy Warner Bros. Discovery after it lost out to Netflix in a monthslong bidding war for the ",
    "body": "watch nowParamount Skydance is launching a hostile bid to buy Warner Bros. Discovery after it lost out to Netflix in a monthslong bidding war for the legacy assets, the company said Monday. Paramount will go straight to WBD shareholders with an all-cash, $30 per share offer. That's the same bid WBD rejected last week and equates to an enterprise value of $108.4 billion. The offer is backstopped with equity financing from the Ellison family and the private equity firm RedBird Capital as well as $54 billion in debt commitments from Bank of America, Citi and Apollo Global Management, Paramount said in a news release. A portion of the equity financing comes from outside Middle Eastern financing partners including Saudi Arabia's Public Investment Fund, Abu Dhabi's L'imad Holding Company PJSC, and the Qatar Investment Authority. Another portion derives from Jared Kushner's Affinity Partners. Kushner is U.S. President Donald Trump's son-in-law. Those partners have agreed to \"forgo any governance rights,\" including board seats, as part of their non-voting equity investment, according to a Paramount filing. The modifications allow the deal to be outside of the jurisdiction of the Committee on Foreign Investment in the U.S., or CFIUS. Shares of Paramount gained 9% Monday. Warner Bros. Discovery's shares rose about 4% while Netflix was down 3%.\"We're really here to finish what we started,\" Paramount Skydance CEO David Ellison told CNBC's \"Squawk on the Street\" on Monday. \"We put the company in play.\" Paramount Skydance began its hunt for Warner Bros. Discovery in September, submitting three bids before WBD launched a formal sale process that ultimately brought in other suitors. On Friday, Netflix announced a deal to acquire WBD's studio and streaming assets for a combination of cash and stock, valued at $27.75 per WBD share, or $72 billion. Paramount had been bidding for the entirety of Warner Bros. Discovery, including those assets and the company's TV networks like CNN and TNT Sports. \"We're sitting on Wall Street, where cash is still king. We are offering shareholders $17.6 billion more cash than the deal they currently have signed up with Netflix, and we believe when they see what it is currently in our offer that that's what they'll vote for,\" Ellison said. Ellison said Monday he places a value of $1 per share on the linear cable assets, which are set to trade as a separate public entity called Discovery Global in mid-2026. WBD executives have privately valued the assets closer to $3 per share. Paramount has repeatedly argued to the WBD board of directors that keeping Warner Bros. Discovery whole is in the best interest of its shareholders. Paramount made a bid on Dec. 1 and heard back from WBD that it needed to make certain alterations to the offer, Ellison said Monday. When Paramount made the changes and upped its bid to $30 per share, Ellison never heard back from WBD CEO David Zaslav, he said.Ellison said he told Zaslav via text message that $30 per share wasn't the company's best and final offer, suggesting the company is willing to bid higher still.Ellison argued Paramount's deal will have a shorter regulatory approval process given the company's smaller size and friendly relationship with the Trump administration. He called Trump a believer \"in competition\" and said Paramount's combination with WBD will be \"a real competitor to Netflix, a real competitor to Amazon.\"Ellison also threw cold water on Netflix's chances of regulatory approval.\"Allowing the No. 1 streaming service to combine with the No. 3 streaming service is anticompetitive,\" Ellison said.CNBC reported Friday that the Trump administration was viewing the deal with \"heavy skepticism,\" and Trump said Sunday that the market share considerations could pose a \"problem.\" Netflix agreed to pay Warner Bros. Discovery $5.8 billion if the deal is not approved, according to a Securities and Exchange Commission filing Friday. Warner Bros. Discovery said it would pay a $2.8 billion breakup fee if it decides to call off the deal to pursue a different merger.Netflix, for its part, once again championed the deal as positive for shareholders, consumers and the media industry as a whole when its top leadership spoke at the UBS Global Media and Communications Conference on Monday. Co-CEO Greg Peters said they recognize the Netflix deal came as a shock but called the Warner Bros. studio and HBO Max content complementary to Netflix's business.Co-CEO Ted Sarandos said the acquisition would protect jobs at a time when layoffs have been rampant across media: \"In the offer that Paramount was talking about today, they also were talking about $6 billion of synergies. Where do you think synergies come from? Cutting jobs. So we're not cutting jobs, we're making jobs.\" — CNBC's Lillian Rizzo contributed to this report. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paramount Skydance launches hostile bid for WBD 'to finish what we started,' CEO Ellison tells CNBC",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238393-1765214232072-108238393-1765211822234-gettyimages-2250111360-PARAMOUNT_NYSE.jpeg?v=1765214244&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T22:25:39.000Z",
      "dateModified": "2025-12-08T22:25:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Home sellers are giving up at 'unusually high rate,' says new Realtor report",
    "url": "https://www.cnbc.com/2025/12/08/home-sellers-delisting-high-rate-realtor.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225446-1763044516213-gettyimages-2245906783-MORTGAGE_APPLICATION_FIGURES.jpeg?v=1765142012&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T16:06:04.000Z",
    "description": "watch nowLate fall tends to be the time when the most homes come off the market, as so-far unsuccessful sellers would rather not sit through the slowe",
    "body": "watch nowLate fall tends to be the time when the most homes come off the market, as so-far unsuccessful sellers would rather not sit through the slowest winter months. In October, however, delistings, which are reported with a one-month lag, were up 45.5% year to date and rose nearly 38% from October 2024, according to a new report from Realtor.com. The report calls it an \"unusually high rate,\" as this is now the highest delisting year since Realtor.com began tracking in 2022. Delistings started to rise in June and have remained elevated for five straight months. About 6% of active listings are coming off the market each month, which is typically only seen in the dead of winter. In addition, more potential buyers are heading to what Realtor.com calls \"refuge markets.\" These are areas where home prices are much more affordable and didn't see the run-up in prices during the first years of the pandemic. \"Rising delistings and the growth of refuge markets capture the push and pull defining today's housing market,\" said Danielle Hale, chief economist at Realtor.com, in a release. \"These dynamics reflect how higher rates and years of rapid price growth have rewritten the rules of engagement for both buyers and sellers.\"  Hale does forecast a gradual improvement next year, with potentially lower mortgage rates and more consistent supply creating an increasingly balanced market between buyer and seller.Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.Some of the cities that saw the most price growth over the past five years are now seeing the largest share of frustrated sellers. Miami, Denver and Houston saw the highest ratio of homes delisted compared with newly listed.The median list price in November nationally was 0.4% lower than November 2024, according to Realtor.com. It was still, however, 36% higher than November 2019, pre-pandemic. New listings were up just 1.7% from a year ago.Price gains are much stronger in refuge markets, like Grand Rapids, Michigan, where they're up 5.5% year over year and St. Louis where they're up 5%. Cleveland, Milwaukee and Pittsburgh round out the top-performing refuge markets, according to the report. Prices in these markets are still 20%-30% lower than the national median. Another troubling trend this fall -- canceled contracts. Roughly 15% of home purchase agreements were canceled in October, up from 14% the year before, according to Redfin. Cancellations are now well above pre-pandemic levels. Regionally, San Antonio saw the most canceled deals, with more than 1 in 5 (21%) pending home sales falling through in October. It was followed by Fort Lauderdale, Florida (20%), Fort Worth, Texas (19.7%), Las Vegas (19.2%) and Jacksonville, Florida (19.2%). The report cited high housing costs as well as economic uncertainty. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Home sellers are giving up at 'unusually high rate,' says new Realtor report",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225446-1763044516213-gettyimages-2245906783-MORTGAGE_APPLICATION_FIGURES.jpeg?v=1765142012&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T16:06:04.000Z",
      "dateModified": "2025-12-08T16:06:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Asia-Pacific markets mostly lower following Wall Street losses ahead of Fed rate decision",
    "url": "https://www.cnbc.com/2025/12/09/asia-markets-live-today-tuesday-fed-decision-nikkei-225-kospi-hang-seng-index-nifty-50.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108173667-1752803324163-gettyimages-2195350309-4072_14_mrb_24-sydneytasmania-1799.jpeg?v=1764720520&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-09T00:46:57.000Z",
    "description": "Asia-Pacific markets opened mostly lower Tuesday, following losses on Wall Street as investors held back ahead of the U.S. Federal Reserve's decision ",
    "body": "Asia-Pacific markets opened mostly lower Tuesday, following losses on Wall Street as investors held back ahead of the U.S. Federal Reserve's decision on Dec. 10 stateside.The central bank is widely expected to cut rates by another 25 basis points at its final meeting of the year, bringing the Federal Funds rate to 3.5%-3.75%. However, experts said the Fed will then take a more data-dependent stance. \"I would not be surprised for Jerome Powell to be like, 'We've cut, and now we're in a place where we really need to watch the data,' and he'll stop just short of being hawkish, because we have seen the softness in the labor market,\" said Stephen Kolano, chief investment officer at Integrated Partners.Japan's markets started trading in positive territory before reversing gains, with the Nikkei 225  down 0.29% while the broad-based Topix was 0.17% lower. South Korea's Kospi slipped 0.32%, but the small-cap Kosdaq was 0.18% higher.Australia's S&P/ASX 200 declined 0.43% in early trade. Hong Kong Hang Seng index futures were at 25,763, nearly unchanged from the last close of 25,765.26.U.S. stock futures were slightly higher Monday night, buoyed by President Donald Trump's approval of Nvidia H200 chip sales to China in a deal that gives the U.S. government a hefty cut.In after-hours trading, Nvidia climbed 2.2% following a Truth Social post Monday evening that said the chipmaking giant could ship its H200 chips to \"approved customers\" in China and elsewhere under the condition that a quarter of the sales will be paid to the U.S. government. Overnight in the U.S., the S&P 500 pulled back 0.35%, while the Nasdaq Composite slid 0.14%. The Dow Jones Industrial Average shed 215.67 points, or 0.45%.—CNBC's Sean Conlon and Alex Harring contributed to this report. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Asia-Pacific markets mostly lower following Wall Street losses ahead of Fed rate decision",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108173667-1752803324163-gettyimages-2195350309-4072_14_mrb_24-sydneytasmania-1799.jpeg?v=1764720520&w=1920&h=1080"
      ],
      "datePublished": "2025-12-09T00:46:57.000Z",
      "dateModified": "2025-12-09T00:46:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says Netflix, WBD deal could be 'problem' as son-in-law Kushner backs Paramount bid",
    "url": "https://www.cnbc.com/2025/12/08/trump-netflix-wbd-paramount.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238234-17651982762025-12-08t032859z_1258967570_rc2zbiafwrbt_rtrmadp_0_usa-trump-kennedy-center.jpeg?v=1765198299&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T21:03:28.000Z",
    "description": "U.S. President Donald Trump poses on the red carpet for the 2025 Kennedy Center Honors at the John F. Kennedy Center for the Performing Arts in Washin",
    "body": "U.S. President Donald Trump poses on the red carpet for the 2025 Kennedy Center Honors at the John F. Kennedy Center for the Performing Arts in Washington, D.C., U.S., December 7, 2025. Jeenah Moon | ReutersPresident Donald Trump expressed skepticism on Sunday night about Netflix's proposed acquisition of parts of Warner Bros. Discovery, saying the massive deal \"could be a problem\" because of how much market share Netflix would end up with.Trump also said that he will be involved in the process of approving the deal, which was announced on Friday.The streaming giant Netflix needs regulatory sign-off for its planned purchase of WBD's film studio and streaming properties, including HBO Max. The deal has an enterprise value of nearly $83 billion.Paramount Skydance on Monday said it was launching a hostile bid to buy all of WBD after losing out to Netflix. Larry Ellison, the billionaire father of Paramount CEO David Ellison, is close to Trump.David Ellison told CNBC's \"Squawk on the Street\" on Monday morning, \"We've had great conversations with the president about this, but I don't want to speak for him.\"Trump, asked Monday afternoon about Paramount's bid, said he knew nothing about it.He also said he wants to see the competing companies' market percentages — signaling that the size of the media giant that would result from the deal is a major factor for him.\"None of them are particularly great friends of mine,\" Trump said.Paramount revealed in a filing with the Securities and Exchange Commission that its bid is being backed by Trump's son-in-law, Jared Kushner, who is a former White House advisor.Trump suggested he was unaware of Kushner's involvement with Paramount.The filing also said other outside financing partners included the investment funds of three Gulf states: Saudi Arabia, Abu Dhabi, United Arab Emirates, and Qatar.Kushner's firm, Affinity Partners, and the Gulf funds \"have agreed to forgo any governance rights – including board representation – associated with their non-voting equity investments,\" the filing said,\"Accordingly, the Transaction will not be within CFIUS's jurisdiction,\" the filing said, referring to the Committee on Foreign Investment in the United States, which reviews such investments. Asked Sunday if WBD's deal with Netflix should be allowed, Trump said, \"Well, that's the question.\"\"They have a very big market share,\" the president said, referring to Netflix.\"And when they have Warner Brothers, you know, that share goes up a lot,\" Trump told reporters on the red carpet before an event at the Kennedy Center in Washington.\"So I don't know, that's going to be for some economists to tell,\" Trump said. \"I'll be involved in that decision, too.\"Trump said that Netflix CEO Ted Sarandos made no guarantees about the merger when he visited the Oval Office last week.\"He's a great person,\" Trump said of Sarandos. \"He's done one of the greatest jobs in the history of movies and other things, and he's got a lot of interesting things happening, aside from what you're talking about.\"\"But it is a big market share. There's no question,\" Trump said. \"It could be a problem.\"Read more CNBC politics coverageJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'A senior Trump administration official told CNBC on Friday that the administration views the deal with \"heavy skepticism.\"The proposed acquisition has raised antitrust concerns from lawmakers, including Sen. Elizabeth Warren, D-Mass., who said it \"looks like an anti-monopoly nightmare.\"Paramount warned WBD's lawyers in a recent letter that a sale to Netflix likely would \"never close\" because of regulatory challenges in the U.S. and abroad, The Wall Street Journal reported.Comcast also had sought to buy WBD's film and streaming assets.In addition to the sale of those assets to Paramount, WBD plans to spin out Discovery Global, which would include the CNN, TNT Sports and Discovery channels. Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast's planned spinoff of Versant.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says Netflix, WBD deal could be 'problem' as son-in-law Kushner backs Paramount bid",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238234-17651982762025-12-08t032859z_1258967570_rc2zbiafwrbt_rtrmadp_0_usa-trump-kennedy-center.jpeg?v=1765198299&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T21:03:28.000Z",
      "dateModified": "2025-12-08T21:03:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stellantis to bring tiny Fiat car to U.S. following Trump remarks",
    "url": "https://www.cnbc.com/2025/12/08/fiat-stellantis-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238663-1765231391832-Topolino.jpeg?v=1765231800&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T22:23:04.000Z",
    "description": "Stellantis plans to offer the Fiat Topolino, an all-electric quadricycle vehicle, in the U.S.StellantisDETROIT – Chrysler parent Stellantis on Monday ",
    "body": "Stellantis plans to offer the Fiat Topolino, an all-electric quadricycle vehicle, in the U.S.StellantisDETROIT – Chrysler parent Stellantis on Monday announced it will offer an all-electric small \"car\" called the Fiat Topolino in the U.S.The automaker did not announce timing for the vehicle, but Fiat CEO Olivier François confirmed plans to bring the vehicle to the market, with \"more details to come next year.\"Fiat's announcement comes less than a week after President Donald Trump praised small \"Kei\" cars from Japan during a meeting at the White House with Stellantis CEO Antonio Filosa and other U.S. lawmakers and automotive executives.\"They're very small. They're really cute,\" Trump said during the Wednesday meeting. \"And I said, 'How would that do in this country?' And everyone seems to think 'good,' but you're not allowed to build them.\"Trump said he ordered U.S. Transportation Secretary Sean Duffy to allow small vehicles like the Kei \"micro\" cars to be built and driven in the U.S. It's not necessarily illegal to produce such cars in America, but they have to meet American safety standards, speed requirements and other regulations.watch nowA Stellantis spokeswoman said Fiat's announcement was unrelated to Trump's comments last week and that the automaker has been gauging customer interest for the Topolino at U.S. events such as auto shows.The Topolino, which translates to \"little mouse\" in Italian, is actually categorized as \"an all-electric quadricycle\" rather than a car, according to Stellantis. It has a top speed of roughly 28 miles per hour and driving range of up to 75 kilometers (less than 50 miles) on a single charge. The vehicle is produced in Morocco.Small cars have historically not sold well in the U.S.The most recent meaningful push to sell small cars in the U.S. occurred after the Great Recession in 2009 under the Obama administration. Back then, Italian automaker Fiat was allowed to purchase bankrupt automaker Chrysler, in part, to help bring such vehicles to the U.S.Fiat and its small 500 city car reentered the U.S. market in 2011 amid Fiat's takeover of Chrysler (both now owned by Stellantis). In its first full year in 2012, Fiat sold 43,772 vehicles in the U.S. Those sales have since dwindled to roughly 1,500 Fiat vehicles sold last year in the U.S.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stellantis to bring tiny Fiat car to U.S. following Trump remarks",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238663-1765231391832-Topolino.jpeg?v=1765231800&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T22:23:04.000Z",
      "dateModified": "2025-12-08T22:23:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former Trump lawyer Alina Habba resigns as New Jersey U.S. attorney after disqualification",
    "url": "https://www.cnbc.com/2025/12/08/trump-alina-habba-new-jersey-prosecutor.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108234428-17645999272025-12-01t143746z_55320301_rc2imdaiph2a_rtrmadp_0_usa-trump-habba.jpeg?v=1765220340&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T21:29:29.000Z",
    "description": "Alina Habba attends her swearing-in ceremony as interim U.S. Attorney for the District of New Jersey, in the Oval Office at the White House in Washing",
    "body": "Alina Habba attends her swearing-in ceremony as interim U.S. Attorney for the District of New Jersey, in the Oval Office at the White House in Washington, D.C., U.S., March 28, 2025.Evelyn Hockstein | ReutersAlina Habba, who had previously served as President Donald Trump's defense lawyer, said Monday that she was stepping down as U.S. attorney for New Jersey after judges disqualified her from that position.Habba's resignation came a week after the 3rd Circuit U.S. Court of Appeals upheld a district court judge's ruling that found her ineligible for the top prosecutor's job because of the circumstances of her appointment as the interim holder of that post.Habba and Attorney General Pam Bondi said Habba would remain at the Department of Justice as senior advisor to the attorney general for U.S. attorneys.Bondi also said the DOJ would appeal the 3rd Circuit's ruling and that the department is confident it would be reversed.\"As a result of the Third Circuit's ruling, and to protect the stability and integrity of the office which I love, I have decided to step down in my role as the U.S. Attorney for the District of New Jersey,\" Habba said in a statement on X.\"But do not mistake compliance for surrender. This decision will not weaken the Justice Department and it will not weaken me,\" Habba said.\"Make no mistake, you can take the girl out of New Jersey, but you cannot take the New Jersey out of the girl.\"Bondi said on X, \"I am saddened to accept Alina's resignation.\"\"The court's ruling has made it untenable for her to effectively run her office, with politicized judges pausing trials designed to bring violent criminals to justice,\" Bondi said. \"These judges should not be able to countermand the President's choice of attorneys entrusted with carrying out the executive branch's core responsibility of prosecuting crime.\"Trump called the reasons for Habba's resignation \"a shame.\"\"She's not disqualified,\" Trump said.\"You got a blue slip thing that's horrible,\" Trump said, referring to the practice of the Senate Judiciary Committee to allow effective vetoes of nominations  of U.S. attorneys unless the senators from the state housing that office agree on the person nominated.\"It's a shame ... Republicans should be ashamed of themselves\" for allowing it to go on, Trump said.Deputy Attorney General Todd Blanche appointed three people to supervise the criminal, civil and appellate, and administrative functions of the New Jersey U.S. Attorney's Office in light of Habba's departure.Lindsey Halligan, another former lawyer for Trump, was recently disqualified by a judge from serving as the top federal prosecutor for the Eastern District of Virginia because of the circumstances of her appointment.Because of Halligan's disqualification, the grand jury indictments she obtained against former FBI Director James Comey and New York Attorney General Letitia James were dismissed last month.Bondi appointed Habba as interim U.S. attorney in March after her predecessor resigned.Trump later nominated her to hold the post permanently, but her nomination was never considered by the Senate, as is required. The DOJ engaged in a byzantine series of maneuvers that it argued enabled Habba to automatically become the acting U.S. attorney, but a federal judge and then the 3rd Circuit rejected that effort, saying they failed to comply with the Federal Vacancies Reform Act.— Additional reporting by Justin Papp and Garrett Downs",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former Trump lawyer Alina Habba resigns as New Jersey U.S. attorney after disqualification",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108234428-17645999272025-12-01t143746z_55320301_rc2imdaiph2a_rtrmadp_0_usa-trump-habba.jpeg?v=1765220340&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T21:29:29.000Z",
      "dateModified": "2025-12-08T21:29:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google to launch first of its AI glasses in 2026",
    "url": "https://www.cnbc.com/2025/12/08/google-ai-glasses-launch-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231458-1764050689057-gettyimages-2246202362-3h4a0159_jgqqwm01.jpeg?v=1764719141&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T20:10:40.000Z",
    "description": "A Google logo is at the announcement of Google's biggest-ever investment in Germany on November 11, 2025 in Berlin, Germany. Sean Gallup | Getty Image",
    "body": "A Google logo is at the announcement of Google's biggest-ever investment in Germany on November 11, 2025 in Berlin, Germany. Sean Gallup | Getty Images News | Getty ImagesGoogle on Monday said it plans to launch the first of its AI-powered glasses in 2026, as the tech company ramps up its efforts to compete against Meta in a heating consumer market for AI devices. The Alphabet-owned company is collaborating on hardware design with Samsung, Gentle Monster and Warby Parker, with whom Google agreed to a $150 million commitment in May.Google plans to release audio-only glasses that will allow users to speak with the Gemini artificial-intelligence assistant, the company said in a blog. Google also said there will be glasses with an in-lens display that show users information such as navigation directions and language translations. The company said the first of these glasses will arrive next year, but it did not specify which styles that will include. In a Monday filing, Warby Parker said that the first of its glasses in partnership with Google are expected to launch in 2026.The glasses will be built on top of Android XR, Google's operating system for its headsets.Google's Monday updates come after the company in May announced that it would be getting back into the smart glasses game. At the time, co-founder Sergey Brin said he learned from Google's past mistakes of failed smart glasses, citing less advanced AI and a lack of supply chain knowledge, which led to expensive price points.\"Now, in the AI world, the things these glasses can do to help you out without constantly distracting you — that capability is much higher,\" Brin said in May.The AI wearables space has been gaining traction with Meta leading the pack. the social media company's Ray-Ban Meta glasses were met with surprising success. The glasses, which were designed in partnership with eyewear giant EssilorLuxottica, are infused with the Meta AI digital assistantMeta also released its own display glasses in September, which allows users to see features like messages, photo previews and live captions through a small display that's built into one of the device's lenses. Other companies like Snap and Alibaba have also been churning out their own AI glasses offerings as the small but competitive market continues to grow.Google on Monday also revealed more software updates to the Galaxy XR headset, including the ability to link it to Windows PCs and a travel mode that will allows the device to be used in planes and cars.WATCH: Google's vibe-coding playwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google to launch first of its AI glasses in 2026",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231458-1764050689057-gettyimages-2246202362-3h4a0159_jgqqwm01.jpeg?v=1764719141&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T20:10:40.000Z",
      "dateModified": "2025-12-08T20:10:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Confluent stock soars 29% as IBM announces $11 billion acquisition deal",
    "url": "https://www.cnbc.com/2025/12/08/ibm-confluent-deal-data.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108135103-1745360941849-gettyimages-2204006403-Keynote_From_Sci-Fi_to_Society_The_Next_Era_of_AI_and_Quantum_Computing.jpeg?v=1753287447&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T22:33:40.000Z",
    "description": "watch nowIBM announced Monday it is acquiring data streaming platform Confluent in a deal valued at $11 billion.Shares of Confluent soared 29%. IBM's ",
    "body": "watch nowIBM announced Monday it is acquiring data streaming platform Confluent in a deal valued at $11 billion.Shares of Confluent soared 29%. IBM's stock closed little changed.\"Data, and especially real-time data, is incredibly important to how an enterprise functions,\" IBM CEO Arvind Krishna told CNBC's \"Squawk on the Street\" on Monday. \"Nobody can live with month-old data, or even week-old data, and Confluent has the most capable technology to unlock the real-time value of data.\"Krishna said Confluent will be part of its software unit.IBM will pay $31 per share in cash for all of the issued and outstanding common shares of Confluent, according to a release. The transaction is expected to close by the middle of 2026. Shares of Confluent closed at $23.14 on Friday.\"With the acquisition of Confluent, IBM will provide the smart data platform for enterprise IT, purpose-built for AI,\" Krishna said in a release.Read more CNBC tech newsBlackRock bets on 'pick and shovel' trade, singling out clear winners in AI spending spreeElon Musk calls for abolition of European Union after X fined $140 millionJudge finalizes remedies in Google antitrust caseSalesforce shares pop 5%, continuing post-earnings rally and pushing stock to best week since 2023IBM said the deal will bolster its artificial intelligence offerings as it expects global data growth to more than double by 2028, with the movement into AI agents accelerating in 2026.\"I think this ability to now have one layer, one control plane, where people can manage to give data to the AI agents, but still manage to make sure that it's done with the correct security and the correct controls, I think, is going to unlock a lot,\" Krishna told CNBC.Wedbush called it a \"strong move\" from IBM that adds more data processing capabilities to its hybrid cloud ecosystem and is a natural fit to help eliminate data silos for powering AI.\"We loudly applaud this deal as Arvind takes IBM further into the AI Revolution with more acquisitions likely ahead,\" the analysts said in a note.Wedbush maintained its overweight rating on IBM and $325 price target. IBM closed at $307.94 on Friday.The addition of Confluent fits with IBM's deal last year to land cloud software maker HashiCorp for $6.4 billion and the 2023 move to acquire Apptio in a deal valued at $4.6 billion. Both of those acquisitions were all-cash deals.Confluent has more than 6,500 clients across major industries and works with Anthropic, Amazon's AWS, Google Cloud Platform, Microsoft, Snowflake and others.Stock Chart IconStock chart iconConfluent one-day stock chart.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Confluent stock soars 29% as IBM announces $11 billion acquisition deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108135103-1745360941849-gettyimages-2204006403-Keynote_From_Sci-Fi_to_Society_The_Next_Era_of_AI_and_Quantum_Computing.jpeg?v=1753287447&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T22:33:40.000Z",
      "dateModified": "2025-12-08T22:33:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BlackRock bets on ‘pick and shovel’ trade, singling out clear winners in AI spending spree",
    "url": "https://www.cnbc.com/2025/12/08/blackrock-ben-powell-bet-trade-as-ai-spending-frenzy-hyperscalers-investment-credit.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238092-1765175935536-gettyimages-2188429158-UAE_ADFW.jpeg?v=1765184848&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T09:24:08.000Z",
    "description": "Ben Powell, chief strategist for Middle East and Asia Pacific at BlackRock Investment Institute, at the Abu Dhabi Finance Week (ADFW) conference.Bloom",
    "body": "Ben Powell, chief strategist for Middle East and Asia Pacific at BlackRock Investment Institute, at the Abu Dhabi Finance Week (ADFW) conference.Bloomberg | Getty ImagesThe wave of capital pouring into artificial intelligence infrastructure is far from peaking, said Ben Powell, chief investment strategist for APAC at BlackRock, arguing the sector's \"picks and shovels\" suppliers — from chipmakers to energy producers and copper-wire manufacturers — remain the clearest winners as hyperscalers race to outspend one another.The surge in AI-related capital expenditure shows no sign of slowing as tech giants push aggressively to secure an edge in what they see as a winner-takes-all contest, Powell told CNBC Monday on the sidelines of the Abu Dhabi Finance Week.\"The capex deluge continues. The money is very, very clear,\" he said, adding that BlackRock is focused on what he called a \"traditional picks and shovels capex super boom, which still feels like it's got more to go.\" AI infrastructure has been one of the biggest drivers of global investment this year, fueling a broader market rally, even as some investors question how long the boom can last.Nvidia, whose GPU chips are the backbone of the AI revolution, became the first company to briefly surpass $5 trillion in market capitalization amid a dizzying AI-fueled market rally that sparked talk of an AI bubble. Microsoft and OpenAI also reached a restructuring deal in October to support the ChatGPT developer's fundraising efforts. OpenAI has reportedly been preparing for an initial public offering that could value the company at $1 trillion, according to Reuters.The build-out has set off long-term procurement efforts across the tech sector, from chip supply agreements to power commitments. Grid operators from the U.S. to the Middle East are racing to meet soaring electricity demand from new data centers. Companies, including Amazon and Meta, have budgeted tens of billions of dollars annually for AI-related investments.S&P Global estimates data-center power demand could nearly double by 2030, mostly driven by hyperscale, enterprise and leased facilities, along with crypto-mining sites.'Dipping toes into credit market' Powell also noted that leading tech firms have only begun to tap capital markets to fund the next phase of AI expansion, suggesting additional capital is on the way. watch now\"The big companies have only just started dipping their toes into the credit markets… feels like there's a lot more they can do there,\" he said.  The \"hyperscalers\" are behaving as if coming second would effectively leave them out of the market, Powell said. That mindset, he added, has pushed firms to accelerate spending even at the risk of overshooting.  Much of that capital, Powell noted, is likely to flow to the companies powering the AI build-out rather than model developers, reinforcing a growing view among global investors that the most durable gains from the AI boom may lie in the hardware, energy and infrastructure ecosystems behind the technology.\"If we're the recipients of that cash flow, I guess that's a pretty good place to be, whether you're making chips, whether you're making energy all the way down to the copper wiring,\" Powell noted, expecting \"positive surprises driving those stocks in the year ahead.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BlackRock bets on ‘pick and shovel’ trade, singling out clear winners in AI spending spree",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238092-1765175935536-gettyimages-2188429158-UAE_ADFW.jpeg?v=1765184848&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T09:24:08.000Z",
      "dateModified": "2025-12-08T09:24:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pressure builds on Apple and CEO Tim Cook with holiday executive shake-up",
    "url": "https://www.cnbc.com/2025/12/08/apple-tim-cook-pressure-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107427163-17181132562024-06-10t210852z_29637192_rc2l88axhchs_rtrmadp_0_apple-conference.jpeg?v=1718113330&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T19:24:31.000Z",
    "description": "watch nowSeveral big shots in Cupertino are getting a career change for the holidays.In the last seven days, there has been extraordinary turnover amo",
    "body": "watch nowSeveral big shots in Cupertino are getting a career change for the holidays.In the last seven days, there has been extraordinary turnover among Apple's top ranks, from its head of artificial intelligence to its top lawyer.CEO Tim Cook now has two fewer direct reports than he did before Thanksgiving.The executive who designed the software for the Apple Vision Pro also bounced and is heading to Meta to do the same thing for AI glasses in Menlo Park.As if last week's departures weren't enough, there was another potential exit over the weekend. Senior vice president of hardware technologies Johny Srouji told Cook he wanted out soon, according to Bloomberg. But any drama seems to have passed, with Srouji telling his staff Monday morning in a memo seen by CNBC that he isn't planning to leave Apple any time soon.Srouji is the chip design guru who kicked Intel while it was down and made in-house chips for Mac that performed a lot better, leading to a healthy surge in sales. Srouji is essentially the Jony Ive of chip design, a singular talent, and it is tough to imagine him leaving Apple.An Apple spokesperson provided no comment on Srouji or any of the recently departed executives.There are multiple ways to read into all the changes at the top of a company known for keeping a steady leadership team while producing innovative and industry-leading products.Apple stayed the course while the tech world changed around it in just three short years, as the entire industry has made a massive pivot to AI.Read more CNBC tech newsBlackRock bets on 'pick and shovel' trade, singling out clear winners in AI spending spreeElon Musk calls for abolition of European Union after X fined $140 millionJudge finalizes remedies in Google antitrust caseSalesforce shares pop 5%, continuing post-earnings rally and pushing stock to best week since 2023So it was no surprise AI chief John Giannandrea was out last week. It was on him to deliver an innovative AI experience on the iPhone. Instead, Apple had to admit it couldn't launch the supercharged version of Siri it had been advertising for months.Perhaps the new strategy of partnering with an established AI leader such as Google or Anthropic will make up for all of it, but the pressure is enormous for Apple to get it right after the flop this year.Getting the AI launch right is important for other products as well.If Apple isn't going to charge for its AI system, then using it as a selling point for new hardware is its best bet to show it can make some cash.There are already hints that 2026 is going to be a monumental year.Some new, rumored AI product categories are expected, such as AI glasses similar to what Meta sells and a tablet for controlling all your smart home appliances.Apple will also turn 50 on April 1 next year, and it's expected to launch its first-ever foldable iPhone. Plus, there are more challenges ahead with a looming antitrust trial and whether Apple can maintain its truce with President Donald Trump.Taken together, perhaps the shake-ups were necessary, especially regarding AI.It looks like next year will show if Apple got it right.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pressure builds on Apple and CEO Tim Cook with holiday executive shake-up",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107427163-17181132562024-06-10t210852z_29637192_rc2l88axhchs_rtrmadp_0_apple-conference.jpeg?v=1718113330&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T19:24:31.000Z",
      "dateModified": "2025-12-08T19:24:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here's what to expect in Paramount's quest to elbow out Netflix and buy Warner Bros. Discovery  ",
    "url": "https://www.cnbc.com/2025/12/08/paramount-wbd-netflix-hostile-bid-what-to-expect.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223534-1765229953687-108223534-1762779602224-gettyimages-2245339877-PARAMOUNT_STUDIOS.jpeg?v=1765229975&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T22:01:46.000Z",
    "description": "Paramount Skydance CEO David Ellison at Netflix's \"America's Team: The Gambler and His Cowboys\" at The Egyptian Theatre in Los Angeles, Aug. 11, 2025.",
    "body": "Paramount Skydance CEO David Ellison at Netflix's \"America's Team: The Gambler and His Cowboys\" at The Egyptian Theatre in Los Angeles, Aug. 11, 2025.Gilbert Flores | Variety | Getty ImagesParamount Skydance laid out its plan Monday to persuade Warner Bros. Discovery shareholders that it's a better buyer for the company than Netflix. The hostile bid kicks off a tug-of-war that could get complicated. Paramount has officially launched a tender offer for current WBD shares at $30 per share, all cash. That bid is backed by $41 billion in equity financing. The remainder will be money from RedBird Capital and Jared Kushner's Affinity Partners. Paramount also has $54 billion in debt commitments from Bank of America, Citi and Apollo Global Management.Paramount's tender offer will be open for 20 business days, Paramount Chief Strategy Officer Andy Gordon said during a conference call for investors Monday. Warner Bros. Discovery has 10 days to respond, and after the 20 business days are up, Paramount has the option to extend the deadline to keep the offer open for WBD shareholders, Gordon said.During this time, any shareholder of WBD can sell its shares to Paramount for $30. If Paramount buys 51% of outstanding shares, it would control the company. \"We do believe the [Paramount] offer should garner meaningful traction,\" Raymond James equity analyst Ric Prentiss wrote in a note to clients. \"That said, we believe that Netflix is committed to this deal; if [Paramount] seems to be gaining traction, we would not be surprised to see a reaction.\"That reaction could come in the form of an increased Netflix offer, though Netflix co-CEO Ted Sarandos didn't mention as much when speaking Monday at the UBS Global Media and Communications Conference. A prolonged battle could eventually invite lawsuits or proxy fights that would demand full shareholder votes. The WBD board said in a statement Monday it \"is not modifying its recommendation with respect to the agreement with Netflix.\" It advised shareholders \"not to take any action at this time with respect to Paramount Skydance's proposal.\"Still, the board will \"carefully review and consider Paramount Skydance's offer in accordance with the terms of Warner Bros. Discovery's agreement with Netflix, Inc.,\" the board said in its statement. Making a caseIf WBD shareholders seem to be convinced that Paramount's is the superior bid, Warner Bros. Discovery management could restart friendly discussions with Paramount to make sure it's getting the best deal possible. Paramount CEO David Ellison told CNBC's David Faber on Monday that the company's $30-per-share offer was not its \"best and final,\" suggesting Paramount is open to paying more for WBD if discussions begin again.Ellison hopes to convince WBD shareholders that a $30-per-share, all-cash offer is more valuable than Netflix's $27.75-per-share, cash-and-stock offer for WBD's streaming and studio assets. Ellison told CNBC on Monday that he values the linear cable networks, which aren't part of Netflix's bid, at just $1 per share. WBD internally has valued that business at about $3 per share, CNBC previously reported.If WBD reaches a deal with Paramount, WBD would owe Netflix $2.8 billion as a breakup fee — meaning Paramount may have to increase its bid, or agree to pay the fee, to adjust for the added cost. Regulatory jittersEllison said Monday that Paramount's odds for regulatory approval, combined with what he views as a higher bid, should sway shareholders that the WBD board made a mistake in choosing Netflix's offer. A Netflix-HBO max combination would create a streamer \"at such a scale that it would be bad for Hollywood and bad for the consumer,\" said Ellison, noting it would be \"anticompetitive in every way you fundamentally look at it.\"Sarandos disagreed.\"We're super confident we're going to get it across the line and finish,\" Sarandos said Monday at the UBS conference. Sarandos also jabbed Paramount's estimate of $6 billion in synergies, noting those potential cost cuts would likely mean job losses.\"We're not cutting jobs, we're making jobs,\" Sarandos said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's what to expect in Paramount's quest to elbow out Netflix and buy Warner Bros. Discovery  ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223534-1765229953687-108223534-1762779602224-gettyimages-2245339877-PARAMOUNT_STUDIOS.jpeg?v=1765229975&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T22:01:46.000Z",
      "dateModified": "2025-12-08T22:01:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple's chip boss squashes exit rumors, says he's not leaving the company",
    "url": "https://www.cnbc.com/2025/12/08/apple-chips-johny-srouji.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238391-1765211516315-gettyimages-1239032037-APPLE_PEEK_PERFORMANCE.jpeg?v=1765211545&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T17:02:52.000Z",
    "description": "Johny Srouji, senior vice president of hardware technologies at Apple Inc., speaks during the Peek Performance virtual event in New York, U.S., on Tue",
    "body": "Johny Srouji, senior vice president of hardware technologies at Apple Inc., speaks during the Peek Performance virtual event in New York, U.S., on Tuesday, March 8, 2022. Gabby Jones | Bloomberg | Getty ImagesApple chip leader Johny Srouji addressed rumors of his impending exit in a memo to staff on Monday, saying he doesn't plan on leaving the company anytime soon.\"I love my team, and I love my job at Apple, and I don't plan on leaving anytime soon,\" he wrote.Bloomberg reported on Saturday that Srouji had told CEO Tim Cook that he was considering leaving, citing people with knowledge of the matter. Srouji is seen as one of the most important executives at the company and he's been in charge of the company's hardware technologies team that includes chip development. At Apple since 2008, he has led teams that created the M-series chips used in Macs and the A-series chips at the heart of iPhones. The memo confirming that he plans to stay at Apple comes as the company has seen several high-profile executive exits in the past weeks, raising questions about the stability of Apple's top leadership.In addition to developing the chips that enabled Apple to drop Intel from its laptops and desktops, in recent years Srouji's teams have developed a cellular modem that will replace Qualcomm's modems in most iPhones. Srouji frequently presents at Apple product launches. \"I know you've been reading all kind of rumors and speculations about my future at Apple, and I feel that you need to hear from me directly,\" Srouji wrote in the memo. \"I am proud of the amazing Technologies we all build across Displays, Cameras, Sensors, Silicon, Batteries, and a very wide set of technologies, across all of Apple Products.\"Last week, Apple announced that its head of artificial intelligence, John Giannandrea, was stepping down.Two days later, the company announced the departure of Alan Dye, the head of user interface design. Dye, who was behind the \"Liquid Glass\" redesign, is joining Meta.A day after Dye's departure, Apple announced the retirement of general counsel Kate Adams and vice president for environment, policy, and social initiatives Lisa Jackson. Both Adams and Jackson reported directly to Cook.Apple's chief operating officer, Jeff Williams, retired this fall. Read more CNBC tech newsBlackRock bets on 'pick and shovel' trade, singling out clear winners in AI spending spreeElon Musk calls for abolition of European Union after X fined $140 millionJudge finalizes remedies in Google antitrust caseSalesforce shares pop 5%, continuing post-earnings rally and pushing stock to best week since 2023",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple's chip boss squashes exit rumors, says he's not leaving the company",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238391-1765211516315-gettyimages-1239032037-APPLE_PEEK_PERFORMANCE.jpeg?v=1765211545&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T17:02:52.000Z",
      "dateModified": "2025-12-08T17:02:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo crosses 450,000 weekly paid rides as Alphabet robotaxi unit widens lead on Tesla",
    "url": "https://www.cnbc.com/2025/12/08/waymo-paid-rides-robotaxi-tesla.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232733-17641870362025-11-26t195224z_716338900_rc2g4iabs6at_rtrmadp_0_waymo-robotaxi.jpeg?v=1764187076&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T21:58:22.000Z",
    "description": "Waymo driverless taxi parks in lower Manhattan in New York City, U.S., Nov. 26, 2025.  Brendan McDermid | ReutersWaymo, the robotaxi unit owned by Alp",
    "body": "Waymo driverless taxi parks in lower Manhattan in New York City, U.S., Nov. 26, 2025.  Brendan McDermid | ReutersWaymo, the robotaxi unit owned by Alphabet, has crossed 450,000 weekly paid rides, according to a letter from investor Tiger Global viewed by CNBC.That's almost double the milestone it hit in April, when Waymo reported 250,000 paid robotaxi rides a week in the U.S. \"Waymo is the clear leader in autonomous driving, recently surpassing 450k trips per week with a product that is 10x safer than human drivers,\" Tiger Global wrote in a letter to investors announcing the launch of a new fund. Tiger's 450,000-ride estimate is based on publicly available data. Waymo is one of the largest positions in Tiger's 2024 fund. Waymo declined to comment.watch nowThis year, Waymo has also announced a slew of expansions, including its debut on freeways in three cities, and autonomous driving in cities including Miami, Dallas, Houston, San Antonio and Orlando.The latest milestone is also another sign that Waymo is continuing to push ahead of aspiring self-driving competitor Tesla, which has run limited pilots in Austin and operates a ride-hailing service in the Bay Area.Tesla vehicles include human drivers or safety supervisors on board and are not driverless like Waymo's fleet vehicles.According to Tesla's latest earnings call, executives said the company hit a quarter of a million miles with its fleet in Austin, and more than one million in the Bay Area. In July, Waymo announced 100 million total fully autonomous miles. Read more CNBC tech newsBlackRock bets on 'pick and shovel' trade, singling out clear winners in AI spending spreeElon Musk calls for abolition of European Union after X fined $140 millionJudge finalizes remedies in Google antitrust caseSalesforce shares pop 5%, continuing post-earnings rally and pushing stock to best week since 2023CNBC's Lora Kolodny contributed to this article.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo crosses 450,000 weekly paid rides as Alphabet robotaxi unit widens lead on Tesla",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232733-17641870362025-11-26t195224z_716338900_rc2g4iabs6at_rtrmadp_0_waymo-robotaxi.jpeg?v=1764187076&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T21:58:22.000Z",
      "dateModified": "2025-12-08T21:58:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump greenlights Nvidia H200 AI chip sales to China if U.S. gets 25% cut, says Xi responded positively",
    "url": "https://www.cnbc.com/2025/12/08/trump-nvidia-h200-sales-china.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108238598-17652267672025-12-08t204421z_1493856068_rc2icia2wgwu_rtrmadp_0_usa-trump.jpeg?v=1765226804&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T22:54:15.000Z",
    "description": "watch nowPresident Donald Trump on Monday said Nvidia will be allowed to ship its H200 artificial intelligence chips to \"approved customers\" in China ",
    "body": "watch nowPresident Donald Trump on Monday said Nvidia will be allowed to ship its H200 artificial intelligence chips to \"approved customers\" in China and elsewhere, on the condition that the U.S. gets a 25% cut.Chinese President Xi Jinping \"responded positively\" to the proposal, Trump wrote in a Truth Social post.The policy \"will support American Jobs, strengthen U.S. Manufacturing, and benefit American Taxpayers,\" Trump wrote.\"The Department of Commerce is finalizing the details, and the same approach will apply to AMD, Intel, and other GREAT American Companies,\" he added in the post.Both Nvidia and chip rival AMD, short for Advanced Micro Devices, agreed in August to share 15% of the revenue from China chip sales with the U.S. government. But around that same time, China reportedly warned companies against using the H20 AI chip that Nvidia designed especially for the country.The H200 is a higher-grade chip than the H20, but not the company's top-of-the-line product.Nvidia shares climbed earlier Monday on news that the Commerce Department was set to approve the China sales, but later pared those gains. The stock rose about 2% after hours.Stock Chart IconStock chart iconNvidia (NVDA) and Advanced Micro Devices (AMD) stock prices\"We applaud President Trump's decision to allow America's chip industry to compete to support high paying jobs and manufacturing in America,\" a spokesman from Nvidia told CNBC in a statement. \"Offering H200 to approved commercial customers, vetted by the Department of Commerce, strikes a thoughtful balance that is great for America,\" the spokesman said.Semiconductors, which are key components in nearly every category of electronics, are at the center of the AI race between the U.S. and China.They have also played a role in the tumultuous trade relationship between the two economic superpowers.Read more CNBC tech newsBlackRock bets on 'pick and shovel' trade, singling out clear winners in AI spending spreeElon Musk calls for abolition of European Union after X fined $140 millionJudge finalizes remedies in Google antitrust caseSalesforce shares pop 5%, continuing post-earnings rally and pushing stock to best week since 2023When Beijing imposed export controls on rare-earth minerals, which are used in the production of some high-end chips, the Trump administration threatened to massively increase tariffs on U.S. imports from China.After meeting in South Korea in late October, Trump and Xi struck a tentative trade truce in which China committed to end \"retaliation\" against U.S. chipmakers, according to the White House.Trump said after that meeting that he discussed the export of Nvidia chips with Xi.— CNBC's Kristina Partsinevelos and Kif Leswing contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump greenlights Nvidia H200 AI chip sales to China if U.S. gets 25% cut, says Xi responded positively",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108238598-17652267672025-12-08t204421z_1493856068_rc2icia2wgwu_rtrmadp_0_usa-trump.jpeg?v=1765226804&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T22:54:15.000Z",
      "dateModified": "2025-12-08T22:54:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ray Dalio says Middle East is becoming a 'Silicon Valley of capitalists’",
    "url": "https://www.cnbc.com/2025/12/08/ray-dalio-middle-east-silicon-valley-ai-bubble.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217912-1761667354340-Dalio1.jpg?v=1761667468&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T09:58:57.000Z",
    "description": "Ray Dalio, founder of Bridgewater, speaking to CNBC at the Future Investment Institute 2025 summit in Riyadh on Oct. 28th, 2025.CNBCThe Middle East is",
    "body": "Ray Dalio, founder of Bridgewater, speaking to CNBC at the Future Investment Institute 2025 summit in Riyadh on Oct. 28th, 2025.CNBCThe Middle East is fast emerging as one of the world's most powerful AI hubs, Bridgewater Associates' founder Ray Dalio said Monday, comparing the region's rise to Silicon Valley's pull for all things tech. Speaking to CNBC, Dalio said the United Arab Emirates and its neighbors have combined vast pools of capital with an influx of global talent, creating a magnet for investment managers and AI innovators alike.The UAE and Saudi Arabia have this year launched multibillion-dollar initiatives to build cloud, data centers and other AI infrastructure, underpinned by sovereign-wealth capital and global tech partnerships. A $10 billion agreement between Google Cloud and Saudi Arabia's Public Investment Fund announced this year aims to create a \"global AI hub\" in the country, as part of a broader push to host data-centers and AI workloads locally.Earlier this year, technology giants OpenAI, Oracle, Nvidia and Cisco combined forces to build a major Stargate artificial intelligence campus in the United Arab Emirates.When asked if he thinks that the UAE, Saudi Arabia and Qatar can be leaders in the AI race, Dalio said, \"What they've done is to create talented people. So this [region] is kind of becoming a Silicon Valley of capitalists ... So now people are coming in … money is coming in, talent is coming in.\"watch nowDalio, who has been visiting Abu Dhabi for more than three decades, said the Gulf's transformation is the result of deliberate statecraft and long-term planning. He described the UAE as \"a paradise in a world that's troubled,\" citing its leadership, stability, quality of life and ambition to build a globally competitive financial ecosystem.\"There's a buzz here, the way there's a buzz in San Francisco, places like that, about AI or technology. It's very similar to that,\" Dalio said.'Precarious' next two yearsThe Bridgewater founder warned that the global economy was headed toward an uncertain future in the near term due to a confluence of multiple forces, reiterating his concerns about markets being in bubble.  \"The next year or two in the future is going to be more precarious,\" he said, pointing to the convergence of what he calls the three dominant cycles: debt, U.S. political conflict and geopolitics.The global debt overhang is already forcing stress into pockets of the market.\"We're seeing cracks in the markets in a number of ways, private equity, venture capital, debt that's being refinanced, and all of those. So we are in a bubble, I believe, by almost all of those measures,\" Dalio said, highlighting similarities with the 2000 bubble but not the one in 1929.He also expects U.S. politics to become more disruptive heading into 2026. \"As we go into the 2026 elections … you will see a lot more conflict in different ways,\" Dalio said, adding that elevated interest rates and concentrated market leadership compound the vulnerability.\"Every country … cannot continue to accumulate the debt they have, yet politically they can't raise taxes and they can't cut benefits. So they're stuck.\" That fiscal bind feeds into a broader rise in domestic polarization: \"We now have populism of the left and populism of the right … which means irreconcilable differences.\"Dalio reiterated his view that the AI rally is in bubble territory, but advised investors not to rush for exits just because valuations are stretched.Concerns about an AI bubble have been swirling in recent months, with notable voices such as OpenAI CEO Sam Altman suggesting that the AI market was in a bubble. Investor Michael Burry, who called the 2008 subprime mortgage crash, has forecast the artificial intelligence market bubble could collapse in the next two years. \"All the bubbles took place in times of great technological change,\" Dalio said. \"You don't want to get out of it just because of the bubble. You want to look for the pricking of the bubble.\"The catalyst for that \"pricking,\" he said, usually comes from a tightening of money or a forced need to sell wealth to meet obligations. He also warned of stress in venture capital, private equity and commercial real estate, sectors where cheap debt is now rolling over at higher rates. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ray Dalio says Middle East is becoming a 'Silicon Valley of capitalists’",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217912-1761667354340-Dalio1.jpg?v=1761667468&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T09:58:57.000Z",
      "dateModified": "2025-12-08T09:58:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]