[
  {
    "title": "PepsiCo's drink sales are improving, and it's planning to cut snack prices",
    "url": "https://www.cnbc.com/2026/02/03/pepsico-pep-q4-2025-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210253-1760039359660-gettyimages-2240162112-dsc06124_zq13d7aq.jpeg?v=1760039442&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T14:59:09.000Z",
    "description": "Packages of  Pepsi are displayed on a store shelf on Oct. 9, 2025 in San Anselmo, California. Justin Sullivan | Getty ImagesPepsiCo on Tuesday reporte",
    "body": "Packages of  Pepsi are displayed on a store shelf on Oct. 9, 2025 in San Anselmo, California. Justin Sullivan | Getty ImagesPepsiCo on Tuesday reported quarterly earnings and revenue that topped analysts' expectations, fueled by improving organic sales across its business.Demand for the company's snacks has been sluggish as consumers balk at higher prices. This year, Pepsi plans to lower prices on products like chips from its North American food division to \"improve competitiveness and the purchase frequency of our brands,\" executives said in prepared remarks. Productivity savings will offset the lower prices, they said.Shares of the food and beverage giant rose more than 3% in morning trading.Here's what the company reported compared with what Wall Street was expecting, based on a survey of analysts by LSEG:Earnings per share: $2.26 adjusted vs. $2.24 expectedRevenue: $29.34 billion vs. $28.97 billion expectedPepsi reported fourth-quarter net income attributable to the company of $2.54 billion, or $1.85 per share, up from $1.52 billion, or $1.11 per share, a year earlier.Excluding restructuring and impairment charges and other items, the company earned $2.26 per share.Net sales rose 5.6% to $29.34 billion. Organic revenue, which strips out foreign currency, acquisitions and divestitures, increased 2.1% in the quarter.\"PepsiCo's fourth quarter results reflected a sequential acceleration in reported and organic revenue growth, with improvements in both the North America and International businesses,\" CEO Ramon Laguarta said in a statement.However, the company is seeing volume declines, particularly for its North American businesses. The metric excludes pricing and foreign exchange fluctuations to reflect demand more accurately. Global volume for its food fell 2% in the quarter, although global volume for its drinks ticked up 1%.Pepsi's home market was once again the weak point of the quarter, although it is showing signs of improvement. Inflation-weary shoppers have been buying less of Pepsi's snacks and drinks in a sign of consumer backlash against higher prices. \"Affordability\" is the biggest obstacle to attracting low- and middle-income consumers, Laguarta said on the company's conference call.PepsiCo Beverages North America, which includes Gatorade, Starry and Poppi, saw volume shrink 4%, though its organic sales rose 2%. PepsiCo's North American food division, which spans brands from Quaker Oats to Cheetos, reported that volume fell 1%. Although it reported higher volume growth than the North American beverage unit this quarter, Pepsi's domestic food business has been the laggard of the portfolio for more than a year.Retailers that sell Pepsi products have responded to the price cuts with enthusiasm, according to executives. As a result, its products will become even more ubiquitous, starting this spring; the company expects a double-digit increase in shelf space with its top retail customers, on average.To further improve demand for its snacks, Pepsi is planning to cut prices on some packages of select brands, including Lay's, Tostito's, Doritos and Cheetos, executives said in prepared remarks. In addition to price cuts, key brands, like Lay's, Tostitos, Gatorade and Quaker have been undergoing makeovers that include simpler ingredients and new packaging to help bring back customers. Pepsi is also working on expanding its portfolio to include more functional drinks, whole grains, protein and fiber.Pepsi also reiterated the outlook for 2026 that the company provided in December. The company is projecting that organic revenue will rise between 2% and 4% and core constant currency earnings per share will increase in a range of 4% to 6%.In December, Pepsi struck a deal with activist investor Elliott Investment Management, which had revealed a roughly $4 billion stake in the company two months earlier. As part of the agreement, Pepsi said it would slash its U.S. product lineup by 20%, cut costs across its food and beverage operations, and lower snack prices. Elliott did not receive any seats on Pepsi's board.As Pepsi implements that plan this year, the company is projecting that its North American business will improve, while its international divisions remain \"resilient,\" according to Laguarta.Programming note: PepsiCo CEO Ramon Laguarta will discuss the company's earnings after 10 a.m. ET. Watch on CNBC or CNBC+. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "PepsiCo's drink sales are improving, and it's planning to cut snack prices",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210253-1760039359660-gettyimages-2240162112-dsc06124_zq13d7aq.jpeg?v=1760039442&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T14:59:09.000Z",
      "dateModified": "2026-02-03T14:59:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SoftBank subsidiary to work with Intel on next-gen memory for AI",
    "url": "https://www.cnbc.com/2026/02/03/softbank-subsidiary-saimemory-intel-ai-memory-z-angle-program.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108260523-1770088498257-gettyimages-2230217289-AA_19082025_2377515.jpeg?v=1770088635&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T03:21:44.000Z",
    "description": "Saimemory, a subsidiary of multinational investment giant SoftBank, has signed a collaboration agreement with American chipmaker Intel Corp. to advanc",
    "body": "Saimemory, a subsidiary of multinational investment giant SoftBank, has signed a collaboration agreement with American chipmaker Intel Corp. to advance the commercialization of next-generation memory technology, the companies announced Tuesday.The partnership focuses on next-generation memory technologies that can support the growing demands of artificial intelligence and high-performance computing. The effort is currently known as the \"Z-Angle Memory program,\" or ZAM.Prototypes are expected by the fiscal year ending March 31, 2028, with commercialization targeted for fiscal 2029, according to a SoftBank press release. Shares of SoftBank rose 3.13%, while Intel stock rose 5% in overnight trading on Robinhood following the announcement.Stock Chart IconStock chart iconSaimemory, established in December 2024, will draw on memory technology and expertise from Intel, particularly from initiatives it undertook as part of the U.S. Department of Energy's Advanced Memory Technology program.The program focused on developing core technologies for advanced memory. Intel's involvement specifically targeted improvements in performance and power efficiency for next-generation Dynamic random-access memory (DRAM) used in computers and servers.\"Standard memory architectures aren't meeting AI needs,\"  Dr. Joshua Fryman, Intel Fellow and CTO of Intel Government Technologies, said in a statement. He added that Intel has developed a new memory architecture and assembly approach that improves DRAM performance while lowering power use and costs, positioning the technology for broader adoption over the next decade.The partnership comes amid surging demand for memory used in AI-related applications. This demand has vastly outpaced supply, which has triggered shortages across the memory supply chain.  The emphasis on energy efficiency for the ZAM program also also reflects growing concerns over the vast energy consumption needed for AI computing.  The collaboration between Intel and SoftBank on next-generation memory technology was first reported by Nikkei Asia last year. Fujitsu, a Japanese multinational IT equipment and services company, is also reportedly involved in the project. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SoftBank subsidiary to work with Intel on next-gen memory for AI",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108260523-1770088498257-gettyimages-2230217289-AA_19082025_2377515.jpeg?v=1770088635&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T03:21:44.000Z",
      "dateModified": "2026-02-03T03:21:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jim Cramer's top 10 things to watch in the stock market Tuesday",
    "url": "https://www.cnbc.com/2026/02/03/jim-cramers-top-10-things-to-watch-in-the-stock-market-tuesday.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108215556-1761161061507-gettyimages-617288676-93063630.jpeg?v=1770122193&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T14:14:42.000Z",
    "description": "NEW YORK, NY - OCTOBER 22:  Jim Cramer of CNBC speaks during the Martha Stewart American Made Summit at Martha Stewart Living Omnimedia Headquarters o",
    "body": "NEW YORK, NY - OCTOBER 22:  Jim Cramer of CNBC speaks during the Martha Stewart American Made Summit at Martha Stewart Living Omnimedia Headquarters on October 22, 2016 in New York City.  (Photo by John Lamparski/Getty Images)John Lamparski | Getty Images Entertainment | Getty ImagesMy top 10 things to watch Tuesday, Feb. 31. The S&P 500 was headed for a higher open this morning, boosted by post-earnings gains in Palantir stock and sharp bounces in gold and silver. This follows yesterday's strong start to February on Wall Street.2. Palantir shares jumped more than 11% following a fourth-quarter report that beat earnings estimates on rising spending in AI data tools from businesses and government agencies. This is the fastest-growing, most lucrative software and consulting company. High margins and high growth. Will it be considered the same way Club name Salesforce and ServiceNow will be? Both of those stocks have been dogs on concerns of AI-driven disruption risks. But I think Palantir is such a money saver that it will not be similarly described.3. Shares of Teradyne surged more than 20% after the maker of tests for semiconductors and robotics reported better-than-expected results in the fourth quarter. Management's fiscal 2026 Q1 guidance far exceeded estimates. Demand remains incredibly strong.4. Sandisk stock rose another 4% after closing at a record high for four straight sessions. The AI infrastructure trade has sent shares of the data storage company up more than 180% year to date. JPMorgan suspended its rating on Sandisk for policy reasons because of restrictions.5. Club holding Eaton shares dropped more than 4% on a mixed fourth quarter. The power management company, whose products are used in AI data centers, beat on earnings-per-share but missed on revenue. The Q1 and full-year 2026 guides at the midpoints for EPS were short of estimates.6. Elon Musk's SpaceX will acquire his artificial intelligence startup xAI in a record-setting deal that unifies his rocket company with the Grok chatbot maker. The transaction reportedly values SpaceX at $1 trillion, and xAI at $250 billion, according to Reuters. The acquisition marks the largest M&A deal of all time. 7. PayPal CEO Alex Chriss will be replaced by HP CEO Enrique Lores, the payments company announced after its profit and revenue fell short of expectations this morning. Jamie Miller, the chief financial officer of PayPal, will step in as interim CEO until Lores takes over next month. Shares of PayPal dropped 15%.8. Disney announced this morning that Josh D'Amaro, chairman of Disney Experiences, will succeed Bob Iger as CEO effective March 18. It's the second time in six years that the entertainment giant has named a successor to Iger. We previously owned Disney, but exited in November following a subpar quarter.9. Club holding Alphabet's price target was taken up to $400 from $365 at Mizuho. Analysts, who kept their buy rating, are constructive on fundamentals in large-cap advertisers, forecasting that the market will accelerate in 2026. Additionally, Waymo, the autonomous driving business from Alphabet, announced a $16 billion raise at a $126 billion valuation yesterday. Even more than reports. Alphabet will contribute $13 billion to the financing round. The Google parent will release earnings tomorrow evening.10. Mizuho raised its price target on GE Vernova to $714 from $660, and maintained a hold rating on shares. Analysts pointed to the firm's service growth and gas turbine capacity expansion. The Club stock was up 1%.Sign up for my Top 10 Morning Thoughts on the Market email newsletter for free(See here for a full list of the stocks at Jim Cramer's Charitable Trust.)As a subscriber to the CNBC Investing Club with Jim Cramer, you will receive a trade alert before Jim makes a trade. Jim waits 45 minutes after sending a trade alert before buying or selling a stock in his charitable trust's portfolio. If Jim has talked about a stock on CNBC TV, he waits 72 hours after issuing the trade alert before executing the trade.THE ABOVE INVESTING CLUB INFORMATION IS SUBJECT TO OUR TERMS AND CONDITIONS AND PRIVACY POLICY, TOGETHER WITH OUR DISCLAIMER.  NO FIDUCIARY OBLIGATION OR DUTY EXISTS, OR IS CREATED, BY VIRTUE OF YOUR RECEIPT OF ANY INFORMATION PROVIDED IN CONNECTION WITH THE INVESTING CLUB.  NO SPECIFIC OUTCOME OR PROFIT IS GUARANTEED.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jim Cramer's top 10 things to watch in the stock market Tuesday",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108215556-1761161061507-gettyimages-617288676-93063630.jpeg?v=1770122193&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T14:14:42.000Z",
      "dateModified": "2026-02-03T14:14:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Merck tops quarterly estimates, posts modest 2026 guidance as generic competition looms",
    "url": "https://www.cnbc.com/2026/02/03/merck-mrk-earnings-q4-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250093-17678956902026-01-08t180322z_237136326_rc28ldawa07r_rtrmadp_0_usa-vaccines-hpv.jpeg?v=1767895707&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T14:33:08.000Z",
    "description": "Dado Ruvic | ReutersMerck on Tuesday reported fourth-quarter earnings and revenue that topped estimates on strong demand for its cancer immunotherapy ",
    "body": "Dado Ruvic | ReutersMerck on Tuesday reported fourth-quarter earnings and revenue that topped estimates on strong demand for its cancer immunotherapy Keytruda and some newer products. But the company posted a modest 2026 outlook that fell short of Wall Street's expectations as it prepares for a few drugs to lose patent protection later this year and face generic competition. That includes Type 2 diabetes drugs, Januvia and Janumet, and Bridion, a treatment that helps restore muscle function that was blocked during surgery. While those medicines aren't top-selling products like Keytruda, their combined lower sales will likely pressure the company. The pharmaceutical giant anticipates its 2026 revenue will come in between $65.5 billion and $67 billion. Analysts expected revenue of $67.6 billion, according to LSEG. Merck also expects adjusted earnings to be between $5 and $5.15  per share. That compares with analysts' estimate of $5.36 per share, according to LSEG.That range includes a one-time charge of roughly $9 billion, or around $3.65 per share, related to Merck's acquisition of Cidara, a biotech company that is developing a flu prevention drug. The guidance includes \"manageable impacts\" from the drug pricing deal Merck struck with President Donald Trump in December, as well as his administration's recent move to pare back the pediatric vaccine schedule in the U.S., according to a company spokesperson.Under that \"most-favored-nation\" deal, Merck will voluntarily sell its existing treatments to Medicaid patients at the lowest price offered in other developed nations and guarantee that pricing for new medicine, among other efforts. In exchange, Merck will get a three-year reprieve from tariffs.Here's what Merck reported for the fourth quarter compared with what Wall Street was expecting, based on a survey of analysts by LSEG: Earnings per share: $2.09 adjusted vs. $2.01 expectedRevenue: $16.4 billion vs. $16.19 billion expectedThe company posted net income of $2.96 billion, or $1.19 per share, for the quarter. That compares with net income of $3.74 billion, or $1.48 per share, for the year-earlier period. Excluding acquisition and restructuring costs, Merck earned $2.04 per share for the fourth quarter.Merck raked in $16.4 billion in revenue for the quarter, up 5% from the same period a year earlier.The results come as Merck slashes $3 billion in costs by the end of 2027, and prepares to offset revenue losses from the upcoming patent expiration of Keytruda in 2028. Keytruda drives growth amid Gardasil woesMerck's pharmaceutical unit, which develops a wide range of drugs, booked $14.84 billion in revenue during the fourth quarter. That's up 6% from the same period a year earlier.Sales of Keytruda topped $8.37 billion for the quarter, rising 7% from the same period a year ago. Analysts were expecting revenue of $8.35 billion, according to StreetAccount estimates. The increase in Keytruda revenue was driven by higher uptake of the drug for earlier-stage cancers and strong demand for the treatment for metastatic cancers, which spread to other parts of the body, the company said. Sales of the more convenient subcutaneous version of Keytruda, which won approval last year, came in at $35 million during the fourth quarter. That version of Keytruda is key to Merck's efforts to offset likely declines in revenue after the original formulation of the drug, which is administered intravenously, goes off patent. Meanwhile, Merck's newer drug Winrevair, which is used to treat a rare, deadly lung condition, recorded $467 million in sales for the quarter, up 133% from the same period a year earlier. Analysts had expected the medication to bring in $459 million, according to StreetAccount estimates. More CNBC health coverageThe Trump administration is changing Covid, childhood vaccine recommendations – here's what it means for youU.S. to impose 100% tariff on branded, patented drugs unless firms build plants locally, Trump saysEli Lilly to build $6.5 billion Texas manufacturing facility for obesity pill, other drugsThe growth of Winrevair, which first entered the market in mid-2024, largely reflects higher uptake in the U.S. and its early launch in some international markets.Merck continued to see trouble with China sales of Gardasil, a vaccine that prevents cancer from HPV, the most common sexually transmitted infection in the U.S.Last February, Merck announced it would halt shipments of Gardasil into China beginning that month. In July, CFO Caroline Litchfield said the company would not resume shipments to China through at least the end of 2025, noting that inventories remain high and demand is still soft.Gardasil generated sales of $1.03 billion for the quarter, down 34% from the same period a year ago because of lower demand in China. Still, that was in line with what analysts were expecting, according to StreetAccount.Gardasil's revenue could face more pressure in 2026. As part of the Centers for Disease Control and Prevention's changes to the pediatric vaccine schedule, the agency said that children should get one dose of the HPV vaccine instead of the two to three doses recommended on the label.Merck's animal health division, which develops vaccines and medicines for dogs, cats and cattle, posted nearly $1.51 billion in sales, up 8% from the same period a year prior. The company said that reflects higher demand across all species. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Merck tops quarterly estimates, posts modest 2026 guidance as generic competition looms",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250093-17678956902026-01-08t180322z_237136326_rc28ldawa07r_rtrmadp_0_usa-vaccines-hpv.jpeg?v=1767895707&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T14:33:08.000Z",
      "dateModified": "2026-02-03T14:33:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Walmart hits $1 trillion market cap, fueled by growth of e-commerce, new businesses",
    "url": "https://www.cnbc.com/2026/02/03/walmart-wmt-hits-1-trillion-market-cap.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108239272-17653094962025-12-09t162104z_212304965_rc21dials529_rtrmadp_0_walmart-nasdaq.jpeg?v=1765310250&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T15:56:45.000Z",
    "description": "Walmart associates celebrate during the opening bell ceremony at the Nasdaq Market to celebrate the company’s listing transfer, in New York City, U.S.",
    "body": "Walmart associates celebrate during the opening bell ceremony at the Nasdaq Market to celebrate the company’s listing transfer, in New York City, U.S., December 9, 2025.Brendan McDermid | ReutersWalmart crossed the $1 trillion market cap threshold on Tuesday after a dizzying stock climb fueled by the growth of digital businesses and the acquisition of new customers. In hitting the benchmark, the largest U.S. retailer and grocer joins an exclusive club made up almost entirely of technology companies. Walmart's stock has climbed more than 24% in the past year, and more than 11% so far in 2026. That has outpaced the nearly 16% and 2% gains in those timeframes, respectively, for the S&P 500. The retailer's inclusion in a group heavy on tech companies illustrates much about its ambitions. Walmart has tried to grow profits faster than sales in recent years by leaning into its third-party marketplace and advertising businesses — both of which bring higher margins than its traditional brick-and-mortar operations.The boom in its online selling platform followed the path of key rival Amazon. And Walmart put out the clearest signal yet of its tech ambitions when it listed on the tech-heavy Nasdaq 100 last month.The milestone comes only days into the tenure of new Walmart CEO John Furner, who took the position on Sunday. He replaced longtime chief executive Doug McMillon.watch nowAs CEO of Walmart's U.S. business, Furner oversaw many of the key initiatives that drove the retailer's growth in recent years. Efforts like curbside pickup and better private-label brands helped the discounter draw higher-income shoppers as elevated inflation bit into grocery budgets.For its fiscal 2026 third quarter reported in November, Walmart said revenue rose 5.8%, boosted by a 27% jump in e-commerce sales and 53% growth for its advertising business. Walmart said it expected sales growth of 4.8% to 5.1% for its full fiscal year.The company is expected to post fourth-quarter earnings later this month.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Walmart hits $1 trillion market cap, fueled by growth of e-commerce, new businesses",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108239272-17653094962025-12-09t162104z_212304965_rc21dials529_rtrmadp_0_walmart-nasdaq.jpeg?v=1765310250&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T15:56:45.000Z",
      "dateModified": "2026-02-03T15:56:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World’s largest jeweler falls after analysts warn it will be hit by volatile silver price",
    "url": "https://www.cnbc.com/2026/02/03/pandora-stock-price-pndora-silver-jeweler-volatile.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108186462-1755257649488-gettyimages-485385398-86775955.jpeg?v=1755258104&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T14:14:30.000Z",
    "description": "A Pandora Bracelet at the PANDORA Concept Store.Franziska Krug | German Select | Getty ImagesPandora, the world's largest jeweler, fell almost 7% afte",
    "body": "A Pandora Bracelet at the PANDORA Concept Store.Franziska Krug | German Select | Getty ImagesPandora, the world's largest jeweler, fell almost 7% after analysts warned it would struggle amid the volatile price of silver, downgrading it from Buy to Hold.\"The confluence of a more pressured consumer and heightened silver mean the business is caught between a rock and a hard place,\" Jefferies analysts said in a Tuesday note. \"The most pernicious problem will be a long-lasting hesitancy to engage in the name, given silver price moves. This means that even if silver retrenches and the stock lifts on mechanical earnings momentum, investor engagement will be slow in returning,\" the note added.Pandora stock was down 6.7% in afternoon trading, following two days of gains. Shares fell 46% in 2025, and are down 26% year-to-date. Stock Chart IconStock chart iconPandora shares have fallen sharply over the past year, while silver has rallied.In January, Pandora cut its earnings guidance and warned about weakening consumer sentiment in the U.S. The real culprit, however, is the price of silver, Jefferies said.\"With silver now jumping around, we are reluctant to endorse an active recommendation subject to a special situation and volatile input,\" the analyst said. \"The challenges of the last few months will mean, even in a more normal silver price world, PNDORA will remain substantially cheaper than even a year ago.\"While there was a significant silver sell-off in recent days, prices remain nearly three times higher than they were a year ago, implying 60% lower profits in 2027, according to Jefferies' model. The analysts cut their price target on shares to 530 Danish kroner ($84) from 850 kroner. \"We doubt a switch to silver-plating or stainless steel will act as a panacea given the added complexity of manufacturing and the potential deterioration of customer offer these imply,\" they added. On Friday, silver had its worst day since 1980 after President Donald Trump announced Kevin Warsh was his nominee to be the next Chair of the Federal Reserve, easing fears about the central bank's independence that had been fueling a drive into safe-haven assets like metals.While rising input costs are squeezing Pandora's margins from one side, a deteriorating macroeconomic backdrop is hitting it from the other. The company's core demographic, lower-income consumers, is struggling to cope with rising costs in what's been dubbed the \"K-shaped economy.\"To combat rising input costs, Pandora raised prices by about 14%, which damaged consumer engagement, Jefferies said.Citi analysts in January also downgraded Pandora shares to Neutral, citing slowing sales momentum and extreme silver inflation.\"Near-term visibility has diminished considerably, worsened by a volatile macro environment in the US and Europe (~80% of sales) and potential brand and jewellery consumption fatigue,\" they said. Pandora is slated to report full-year results on Thursday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World’s largest jeweler falls after analysts warn it will be hit by volatile silver price",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108186462-1755257649488-gettyimages-485385398-86775955.jpeg?v=1755258104&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T14:14:30.000Z",
      "dateModified": "2026-02-03T14:14:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oracle's credit default swaps are plummeting as financing plan boosts investor confidence",
    "url": "https://www.cnbc.com/2026/02/02/oracles-credit-default-swaps-are-plummeting-after-financing-plans.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108241389-1765566253538-gettyimages-2236546557-STARGATE_DATA_CENTER.jpeg?v=1770060445&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-02T22:14:54.000Z",
    "description": "watch nowOracle's 5-year credit default swaps tumbled 17% after the software vendor's plan to raise $50 billion in debt and equity bolstered investor ",
    "body": "watch nowOracle's 5-year credit default swaps tumbled 17% after the software vendor's plan to raise $50 billion in debt and equity bolstered investor confidence that the company will be able to avoid a credit downgrade as it funds its artificial intelligence buildout.  \"Equity financing significantly inhibits the downside for credit,\" Andrew Keches, a credit analyst at Barclays, wrote in a note to clients on Monday. Keches upgraded Oracle's debt to overweight and said that its CDS should compress further.Credit default swaps are like insurance for investors, with buyers paying for protection in case the borrower can't repay its debt.Oracle's CDS soared late last year on concerns that the company's massive data center commitments would damage its balance sheet, putting debt investors at risk. Oracle raised $18 billion in a jumbo bond sale in September, one of the largest debt issuances on record in the tech industry. The 5-year swaps have been viewed by the market as a way for investors to hedge their bets on the AI boom. Oracle has been caught in a \"peak fear\" cycle for the past couple months, with the market reacting negatively to virtually any headline, wrote Keches.Oracle said on Sunday it planned to raise $45 billion to $50 billion in debt and equity this year to build additional capacity to meet contracted demand from its cloud customers, which include Nvidia, Meta, OpenAI and Elon Musk's xAI. Using equity as a lever is a notable signal to bond investors that the company isn't solely reliant on debt. Shares of Oracle are down by half since they peaked in September on fears tied to the company's financing plans and its dependency on OpenAI. At least $300 billion of Oracle's $523 billion in remaining performance obligations is tied to OpenAI, according to analysts at D.A. Davidson. Following the company's quarterly earnings report in December, Oracle executives held back from detailing a comprehensive financing plan, hurting the stock, and pushing up CDS prices.While the latest funding announcement instilled confidence among debt investors, the stock slid another 3% on Monday because the issuance of equity will dilute existing shareholders, at least in the near term. Oracle is using an at-the-money offering that will likely entail selling about 10% of its total traded volume over the next few weeks, traders told CNBC.UBS analysts warned in a note that raising $20 billion to 25 billion from stock sales \"may not be warmly received by all equity holders.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oracle's credit default swaps are plummeting as financing plan boosts investor confidence",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108241389-1765566253538-gettyimages-2236546557-STARGATE_DATA_CENTER.jpeg?v=1770060445&w=1920&h=1080"
      ],
      "datePublished": "2026-02-02T22:14:54.000Z",
      "dateModified": "2026-02-02T22:14:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House Republicans move toward reopening U.S. government ",
    "url": "https://www.cnbc.com/2026/02/03/house-republicans-reopen-us-government-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108256242-17691743212026-01-22t233410z_269951071_rc2l6javdsxz_rtrmadp_0_usa-congress.jpeg?v=1770135318&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T16:28:08.000Z",
    "description": "U.S. Speaker Mike Johnson (R-La.) signs a poster during a press conference on Capitol Hill in Washington, D.C., U.S., January 22, 2026.Aaron Schwartz ",
    "body": "U.S. Speaker Mike Johnson (R-La.) signs a poster during a press conference on Capitol Hill in Washington, D.C., U.S., January 22, 2026.Aaron Schwartz | ReutersHouse Speaker Mike Johnson said he's optimistic the three-day partial shutdown of much of the U.S. government is nearing an end.Johnson told reporters Tuesday morning he has the votes for a key procedural vote to reopen the parts of the government, which has been shuttered since Saturday morning. Democratic Leader Hakeem Jeffries has told Johnson that Democrats will not help Republicans advance the procedure under which the government funding vote will happen, requiring Johnson to work within his own razor-thin majority to fund the government. After a new Democratic lawmaker was sworn in Monday, Johnson can only afford to lose one Republican vote on any party-line measure.\"We're gonna pass the rule today, it was never in doubt to me,\" Johnson said in a press conference Tuesday morning. \"We're governing responsibly and we're getting the job done.\"Read more CNBC politics coverageHouse hardliners complicate ending government shutdown as Speaker Johnson moves aheadTrump says U.S. and India reached trade deal, will lower tariffs immediatelyUnited Arab Emirates' 'Spy Sheikh' bought secret stake in Trump crypto company: WSJEpstein files: Ro Khanna says DOJ's latest release is 'not good enough'Speaker Johnson: 'Confident' government shutdown will end by TuesdayJohnson spent most of Monday trying to work through rebellions in his party against ending the shutdown. Among them were conservative lawmakers demanding a vote on a controversial voter-ID bill known as the SAVE Act. The bill would fully fund the departments of Defense, Treasury, State, Health and Human Services, Labor, Housing and Urban Development, Transportation and Education through the remainder of the fiscal year on Sept. 30. Democrats in the Senate had the Department of Homeland Security funding stripped and replaced with a two-week stopgap after two U.S. citizens were shot and killed by federal immigration officers. A negotiation is now underway on new guardrails for immigration enforcement in the bill to fund DHS.This story is developing. Please check back for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House Republicans move toward reopening U.S. government ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108256242-17691743212026-01-22t233410z_269951071_rc2l6javdsxz_rtrmadp_0_usa-congress.jpeg?v=1770135318&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T16:28:08.000Z",
      "dateModified": "2026-02-03T16:28:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pfizer beats quarterly estimates despite Covid product decline, reaffirms modest outlook ",
    "url": "https://www.cnbc.com/2026/02/03/pfizer-pfe-earnings-q4-2025.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108254867-1769002498225-QjhBpZKA.jpg?v=1769013313&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T15:33:04.000Z",
    "description": "watch nowPfizer on Tuesday reported fourth-quarter results that topped estimates even amid dwindling demand for its Covid products, while reaffirming ",
    "body": "watch nowPfizer on Tuesday reported fourth-quarter results that topped estimates even amid dwindling demand for its Covid products, while reaffirming its modest 2026 guidance that rattled investors in December.The pharmaceutical giant is looking to longer-term investments in its pipeline, including its $10 billion acquisition of the obesity biotech Metsera, to counter waning Covid product sales and declines from older drugs. Pfizer moved to show the promise of that investment Tuesday, when it also reported mid-stage data showing that an obesity injection from Metsera can be taken once a month and drive solid weight loss. In addition, Pfizer is on track to cut costs by about $7.7 billion by the end of 2027 as part of two separate initiatives. Here's what the company reported for the fourth quarter compared with what Wall Street was expecting, based on a survey of analysts by LSEG: Earnings per share: 66 cents adjusted vs. 57 cents expectedRevenue: $17.56 billion vs. $16.95 billion expectedPfizer reported revenue of $17.56 billion for the fourth quarter, down around 1% from the same period a year ago. That is largely because of lower demand for its Covid vaccine and Paxlovid, an antiviral pill for the virus. The company booked a net loss of $1.65 billion, or 29 cents per share. That compares with net income of $410 million, or 7 cents per share, during the same period a year ago. Excluding certain items, including restructuring charges and costs associated with intangible assets, the company posted earnings per share of 66 cents for the quarter.Pfizer expects 2026 adjusted profit to come in between $2.80 and $3 per share, and revenue to total $59.5 billion to $62.5 billion. Those sales would largely be flat compared with 2025 revenue. Pfizer previously said the lackluster revenue outlook comes in part from declining sales of its Covid vaccine and antiviral pill Paxlovid, which it expects to fall by about $1.5 billion year over year to $5 billion. The company also pointed to another roughly $1.5 billion year-over-year expected drop in sales due to certain products losing their market exclusivity. Some blockbuster drugs, such as the company's pneumonia vaccine Prevnar, are facing more competition from rivals.More CNBC health coverageThe Trump administration is changing Covid, childhood vaccine recommendations – here's what it means for youU.S. to impose 100% tariff on branded, patented drugs unless firms build plants locally, Trump saysEli Lilly to build $6.5 billion Texas manufacturing facility for obesity pill, other drugsIn December, Pfizer CFO Dave Denton told investors there is also \"price compression and margin compression baked into\" the company's 2026 guidance as it plans to provide \"deeper discounts\" in its Medicaid business as part of a landmark drug pricing deal struck with President Donald Trump. Under that agreement, Pfizer agreed to sell its existing drugs to Medicaid patients at the lowest price offered in other developed countries and guarantee the same \"most-favored-nation\" pricing on its new drugs for Medicare, Medicaid and commercial payers. In return, the company will get a three-year exemption from tariffs. Pfizer's Xeljanz and Xeljanz XR, treatments for rheumatoid arthritis and other inflammatory conditions, were selected in January for the third round of Medicare drug price negotiations. New negotiated prices will come into effect in 2028. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pfizer beats quarterly estimates despite Covid product decline, reaffirms modest outlook ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108254867-1769002498225-QjhBpZKA.jpg?v=1769013313&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T15:33:04.000Z",
      "dateModified": "2026-02-03T15:33:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney shares lose ground this week after Q1 earnings, succession announcement",
    "url": "https://www.cnbc.com/2026/02/03/disney-stock-price-earnings-ceo-bob-iger.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222081-1762381144496-gettyimages-2232929413-Illustration_Disney.jpeg?v=1762382103&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T16:23:48.000Z",
    "description": "CFOTO | Future Publishing | Getty Imageswatch nowThe company's overall revenue was roughly $26 billion, up 5% yearly, and beating Wall Street's expect",
    "body": "CFOTO | Future Publishing | Getty Imageswatch nowThe company's overall revenue was roughly $26 billion, up 5% yearly, and beating Wall Street's expectations of $25.7 billion.CEO transition is an 'overhang' on sharesThe company's CEO announcement marks the second time it's appointed a successor for Iger. His first stint as CEO ended in 2020 when Disney picked Bob Chapek to take the top position. But Chapek was fired in late 2022, prompting Iger to return. Jefferies analysts said in a note Monday, before Disney tapped D'Amaro as its next CEO, that the \"leadership transition remains an overhang on shares.\" In a Monday note, BofA analysts also said succession had \"been an overhang on the shares recently.\"watch nowIger said Monday his successor will be \"handed, I think, a good hand in terms of the strength of the company, a number of opportunities to grow and also the expectation that in a world that changes, you also have to continue to change and evolve as well.\"The BofA analysts said Monday that, given the value of the experiences division to the company's earnings, the appointment of D'Amaro would be \"well received by the investment community.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney shares lose ground this week after Q1 earnings, succession announcement",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222081-1762381144496-gettyimages-2232929413-Illustration_Disney.jpeg?v=1762382103&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T16:23:48.000Z",
      "dateModified": "2026-02-03T16:23:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rocket Companies shares jump 6% after CEO says mortgage loan volume is surging",
    "url": "https://www.cnbc.com/2026/02/03/rocket-companies-shares-jump-6percent-after-ceo-says-mortgage-loan-volume-is-surging.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108250825-1767996840794-gettyimages-2255450236-_75a7271_grcqw3qs.jpeg?v=1770123775&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T13:32:19.000Z",
    "description": "watch nowRocket Companies shares jumped on Tuesday after CEO Varun Krishna told CNBC the company was writing a larger amount of mortgage loans.\"We're ",
    "body": "watch nowRocket Companies shares jumped on Tuesday after CEO Varun Krishna told CNBC the company was writing a larger amount of mortgage loans.\"We're getting ready for our earnings call here in just a couple of weeks, and I will share with this group that we're on track to produce the highest mortgage loan production in terms of volume that we've had in four years, and the highest gain on sale that we've had in four years as well,\" Krishna said on CNBC's \"Squawk Box.\"Rocket shares were last up about 6.3%, jumping as Krishna shared the news. Rocket reports on February 19.Stock Chart IconStock chart iconRocket Cos., 1 dayThe rate on a 30-year mortgage dropped 22 basis points to 5.99% last month, matching the low from Feb. 2, 2023, according to Mortgage News Daily. The decline came after President Donald Trump said on social media that he is instructing mortgage giants Fannie Mae and Freddie Mac to buy $200 billion in mortgage bonds.Rocket's advantage stems from its ability to retain customers by tightly linking mortgage servicing and origination, the CEO said. Rocket keeps relationships intact through its servicing platform, allowing it to recapture borrowers when they return to the market for a home purchase or cash out refinance, he added.\"When they're ready for their next purchase, when they're ready for a cash out refinance, Rocket is there with a great experience, powered by AI. And because of that, we're able to retain our clients, whereas other players simply lose the asset,\" he said. Krishna said Rocket is optimistic about the broader housing outlook. Industry forecasts point to mortgage market growth of as much as 25% through 2026, while existing home sales could rise by up to 10% as affordability improves and pent-up demand returns, he noted. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rocket Companies shares jump 6% after CEO says mortgage loan volume is surging",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108250825-1767996840794-gettyimages-2255450236-_75a7271_grcqw3qs.jpeg?v=1770123775&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T13:32:19.000Z",
      "dateModified": "2026-02-03T13:32:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says India will stop buying Russian oil. Shadow fleet vessels are still unloading sanctioned crude at its ports",
    "url": "https://www.cnbc.com/2026/02/03/russian-oil-sanctions-trump-us-india-trade-deal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108249323-1767794989092-G-EH9LGXUAA3k85.jpg?v=1767807459&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T16:35:17.000Z",
    "description": "The oil tanker \"Grinch\" (R), suspected of belonging to the Russian's shadow fleet, is seen outside the coast of Martigues near the port of Marseille-F",
    "body": "The oil tanker \"Grinch\" (R), suspected of belonging to the Russian's shadow fleet, is seen outside the coast of Martigues near the port of Marseille-Fos on January 25, 2026, as it's surveilled by the French Navy. Thibaud Moritz | Afp | Getty ImagesPresident Donald Trump announced a U.S. trade deal with India on Monday which he said includes a promise from India to stop buying Russian oil and potentially buy from the U.S. and Venezuela, but data shows the shadow fleet of tankers moving sanctioned crude continues to unload at Indian ports.Global data and analytics firm Kpler's vessel tracking shared with CNBC shows four tankers associated with Russia's shadow fleet unloading or in the process of unloading sanctioned oil at Indian ports: the Giannis, unloading Urals at Chennai Refinery; the Nyxora, unloading Urals at Paradip Refinery; the Tiburon, unloading Urals at Vadinar Refinery; and the Seasons I, which is being tracked outside Vadinar on Tuesday morning but was yet to unload, according to Kpler.In recent months, the global shadow fleet moving sanctioned oil, estimated to be as large as 1,400 vessels, has navigated around the tightening U.S. enforcement campaign on Venezuela and Iranian oil, and Europe's interventions against the increasing flow of stateless tankers loading Russian crude. A recent Lloyd's List analysis on the global shadow fleet after the U.S. military actions in Venezuela found that out of the approximately 50 tankers that were full of Venezuelan oil, at least five tankers completed deliveries to China with the vessel's Automatic Identification System (AIS) operating normally, and suggesting \"the enforcement pressure has yet to bite.\" The U.S. recently completed its first sales of Venezuelan oil in the legal crude market.Sanctioned Russian crude has also faced increasing enforcement measures. Recently, the French seized the tanker Grinch, which departed Murmansk earlier this month with a cargo of Russian oil. The French, with British assistance in tracking and monitoring, boarded the vessel to conduct a flag verification. The flag of the Comoros Islands has been deemed false. This seizure was the first instance of the EU-UK plan to interdict Russia's shadow fleet. The sanctioning and seizure of the Russian shadow fleet is one of the efforts to cut Russian energy revenue to reduce Moscow's ability to pursue its war in Ukraine.India's imports of Russian oil have reached a record level this year.\"In 2025, India's oil imports from Russia made up 33% of the country's total seaborne oil imports and 25 percent of Russia's seaborne oil exports,\" said Niels Rasmussen, chief shipping analyst at Bimco. \"A new trade agreement between the U.S. and India could, according to U.S. President Donald Trump, put an end to that trade,\" he said. But Kremlin officials have pushed back, telling reporters they have not officially heard from India about any suspension of oil purchases by the Indian government.India's Prime Minister, Narendra Modi, has also yet to publicly confirm the terms of the trade deal Trump announced, though Indian officials have said an announcement will be coming. Trump's announcement of the trade deal came days after the E.U. and India signed a major trade agreement slashing tariffs to zero on many goods over a number of years.The Trump administration has been pressuring India during the trade war to stop buying Russian oil, and Trump said on Monday India should purchase oil from the U.S. or Venezuela. Even if it does stop importing Russian crude, Rasmussen says it could instead purchase more oil from the Persian Gulf. Before Russia invaded Ukraine on February 24, 2022, up to two-thirds of India's crude oil and oil product imports arrived from the Persian Gulf. In 2025, these crude imports had fallen to 45%, according to Bimco.Rasmussen said he would not expect Russian oil exports to fall by a similar amount as Russia will likely aim to find new buyers, even if it requires a higher rebate to buyers of Russian oil. The shadow fleet often has to sell at a discount, and those discounts may increase as global enforcement measures tighten. Russian crude, because it is sanctioned, already trades at a lower price than crude sold on the public markets.Kevin Book, managing director at ClearView Energy Partners, said if India does close the door on Russian oil, it will give other buyers of last resort more market power. \"That could pressure Russian receipts to the downside. Barrels generally find a buyer. The question is the price,\" he said.But some analysts caution that a smaller market for Russian oil could make it harder for the shadow fleet to find additional employment in its bid to replace India. \"The only major country left to purchase Russian oil is China, and they may already have all the Russian oil that they want,\" said Andy Lipow, president of Lipow Oil Associates.With less crude oil out of Venezuela to feed the dark fleet and the Indian market potentially shut down, Lipow says many of those vessels may be idled or ultimately be scrapped. But Book says the global shadow fleet is fungible, and if there is an opportunity to move sanctioned oil, the owners of these vessels will take advantage of it, with Venezuela an example. \"The shadow fleet moves from one area of demand to another, and as long as sanctions remain in place against other major producing exporters, you can expect that there will still be some shadow vessels being used,\" he said. \"The tankers that were in Venezuelan trade would now go into Iranian and Russian trade.\"The U.S. has announced the seizure of the Bella-1 for violations of U.S. sanctions. The vessel, known as the Marinera after recently reflagging to Russia, was seized in the North Atlantic pursuant to a warrant issued by a U.S. federal court after being tracked by USCGC Munro.Source: @US_EUCOM | U.S. Coast Guard | Via XDespite the sanctioned crude crackdown, Russia has been quickly adding to its shadow fleet, reflagging vessels that once moved Venezuelan oil. In December, 17 sanctioned vessels were reflagged to Russia. One of the tankers seized by the U.S. in the blockade of Venezuelan oil was a recently reflagged Russian vessel.Oil analysts say with the discounted sanctioned oil a separate market from conventional above-board crude oil commerce, all of the enforcement actions and tariffs continue to change the economics of the crude shipments. \"The overall trade between nations matters,\" Book said. \"We are seeing oil flows have shifted locations through sanctions and then shifted again through tariffs. There will be logistical costs associated with these shifts.\" The higher costs come from shipping petroleum longer distances, as well as through intermediaries to circumvent sanctions. A prime example Book gave was the transport of Russian oil, which previously went to Europe, and is now often bound for China.Book explained that economics in the oil refining business, where margins are tight, favor discounted sanctioned oil. \"Discounts are extremely attractive to refiners,\" he said, and that means the barrels of sanctioned oil being moved by the dark fleet \"are going to find a home. As long as there are sanctions in place, sanctions circumvention and workarounds are likely,\" Book added. These workarounds end up being a plus for China, which is the primary buyer of Russian and Iranian crude. \"The more fraught a barrel becomes, the more it generates a profit for its buyer and a discount for its seller. China is probably going to continue looking for distressed discounted barrels,\" Book said.The Marinera oil tanker is seen on January 14, 2026 in Burghead, Scotland. The Marinera oil tanker, previously known as the Bella 1, has entered UK waters at the request of the US to be replenished with \"essential supplies.\" The Russian-flagged tanker was seized by US forces on 7 January 2026, between Iceland and Scotland, for allegedly violating sanctions by transporting oil for Venezuela, Russia, and Iran. Peter Summers | Getty ImagesLloyd's Shadow Fleet Tracker, which covers the roughly 1,400 vessels that predominantly move sanctioned Russian oil, shows there has been an increasing flow of stateless tankers loaded with Russian oil, anchored in the waters of Malaysia. The increase continues despite the government's pledge to shut it down. Malaysia has a trade agreement with the U.S. that restricts dealings with sanctioned entities.Maritime intelligence from Kpler shows that the pressure of the U.S. brokering Venezuelan oil trades, and the existing sanctions on Russia and Iran, are forcing more of these vessels to conduct ship-to-ship transfers as part of their efforts to go dark when moving sanctioned oil. \"It is clear that there are still avid buyers of this sanctioned oil, namely China and India,\" said Jean‑Charles Gordon, vice president of maritime and logistics at Kpler. \"China consumes half of the Iranian oil.\"In 2025, 251 vessels were loaded with sanctioned Iranian oil — 217 of those vessels (86%) are sanctioned, the vessels are targeted by a government identifying them in moving the illicit oil, according to Kpler data. The remaining 34 vessels are in the active shadow fleet, which moves the sanctioned crude through deceptive practices. The majority of these vessels (96%) conducted dark ship-to-ship transfers; 77% spoofed their vessel location; and 72% turned off their vessel location beacons for prolonged stretches of time.In 2025, there were 510 vessels loaded with sanctioned Russian oil, according to Kpler. Among those, 305, or 59% of the fleet, were sanctioned. Another 86 vessels representing roughly 17% of the total fleet would be considered \"shadow fleet.\" These vessels also engaged in spoofing vessel locations and prolonged AIS gaps.\"The dark fleet isn't disappearing, it's becoming more offshore, more fragmented, and more behaviorally extreme,\" Gordon said.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says India will stop buying Russian oil. Shadow fleet vessels are still unloading sanctioned crude at its ports",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108249323-1767794989092-G-EH9LGXUAA3k85.jpg?v=1767807459&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T16:35:17.000Z",
      "dateModified": "2026-02-03T16:35:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gold and silver rebound, pulling global mining stocks and precious metal ETFs higher",
    "url": "https://www.cnbc.com/2026/02/03/gold-and-silver-rebound-after-historic-wipeout-as-analysts-say-thematic-drivers-stay-intact-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235976-1764776147223-gettyimages-2212118870-SPAIN_GOLD.jpeg?v=1769461477&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T15:12:43.000Z",
    "description": "watch nowGold and silver prices rebounded on Tuesday after suffering a historic sell-off, pulling global stocks and funds linked to the metals higher.",
    "body": "watch nowGold and silver prices rebounded on Tuesday after suffering a historic sell-off, pulling global stocks and funds linked to the metals higher.Spot gold was last up about 5.5% to $4,913.97 per ounce. Gold futures gained about 6%, hovering at around $4,929.Spot silver rose over 9% to settle at around $86.89 per ounce. Silver futures were up 12.5% at $86.57. Stock Chart IconStock chart iconGold and silver prices rebound after steep selloffThe moves marked a slight recovery from a decline on Monday that came after a fall of nearly 10% for gold on Friday, and a 30% collapse in silver prices that marked the metal's worst one-day performance since 1980. Mining stocks and exchange-traded funds listed across the globe also notched gains, as the metals continued to rise Tuesday. In Europe, the regional Stoxx 600 Basic Resources index — home to the continent's most valuable mining firms — jumped more than 2% on Tuesday morning. London-listed mining giants notched gains in early trade on Tuesday, with Rio Tinto up 2.2%, Anglo American up more than 3%, and Antofagasta jumping 2.5%. Fresnillo — the world's leading silver producer and the top performing stock on London's FTSE 100 in 2025 — was last seen trading 3.1% higher.In U.S. markets, the ProShares Ultra Silver ETF was last seen trading 15% higher ahead of the opening bell, while the abrdn Physical Silver Shares ETF gained around 8.3%. The iShares Silver Trust (SLV) — which has been at the center of a retail investment frenzy — had also gained 8.3%.Shares of U.S.-listed gold and silver miners were also significantly higher. Endeavour Silver jumped 7.5% in pre-market trading, while Coeur Mining added 7.7%. Hecla Mining and First Majestic Silver were both up by around 8%.Will the gold and silver rally continue?The rebound came as investors reassessed whether the rout signaled a structural turning point or an exaggerated reaction to short-term catalysts.Strategists at Deutsche Bank said history suggests it is short-term catalysts, even as the scale of the sell-off has raised fresh questions about market positioning. The bank said that while signs of elevated speculative activity have been building for months, they are insufficient on their own to explain the magnitude of last week's move.\"The adjustment in precious metal prices overshot the significance of its ostensible catalysts. Moreover, investor intentions in precious (official, institutional, individual) have not likely changed for the worse.\"The sell-off was triggered by a combination of factors, including a rebound in the U.S. dollar, shifts in expectations around Federal Reserve leadership following President Donald Trump's nomination of Kevin Warsh as the next Fed chair, and position-trimming ahead of the weekend.Deutsche Bank said the broader investment case for gold and silver remains intact.\"Gold's thematic drivers remain positive and we believe investors' rationale for gold (and precious) allocations will not have changed. The conditions do not appear primed for a sustained reversal in gold prices, and we draw some contrasts between today's circumstance and the context for gold's weakness in the 1980s and 2013.\"Barclays struck a similar tone, acknowledging overheated technicals and stretched positioning, but said that the broader \"bid\" for gold can remain resilient amid geopolitical and policy uncertainties and reserve-diversification themes.Silver's whipsaw has been more dramatic, reflecting its smaller market, higher volatility and heavier retail participation. However, some analysts still maintain a bullish case for the white metal.\"Speculative positioning has definitely played a role in the short term. Silver has attracted more retail participation than gold and that makes it that much more sensitive to fast-moving sentiment and short-term trading,\" said Zavier Wong, market analyst at eToro.Wong, however, added it may be \"too simplistic\" to attribute the entire move to speculation. Silver has genuine industrial demand, particularly tied to areas linked to data centers and AI infrastructure. A study published in January projected that global silver demand will surge this decade, driven largely by solar photovoltaics and the shift to more silver-intensive cell technologies. Total demand is forecast to reach 48,000 tonnes to 54,000 tonnes a year by 2030, while supply is expected to rise only to about 34,000 tonnes, meaning just 62%-70% of demand would be met.The solar sector alone is seen consuming 10,000-14,000 tonnes annually, or up to 41% of global supply.\"That demand hasn't gone away. What we're seeing here is silver running ahead of itself, which is something it has always done during strong phases,\" said Wong.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gold and silver rebound, pulling global mining stocks and precious metal ETFs higher",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235976-1764776147223-gettyimages-2212118870-SPAIN_GOLD.jpeg?v=1769461477&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T15:12:43.000Z",
      "dateModified": "2026-02-03T15:12:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rare earth stocks jump after Trump launches $12 billion critical minerals stockpile",
    "url": "https://www.cnbc.com/2026/02/03/rare-earths-stocks-trump-critical-minerals-stockpile-project-vault.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108260585-1770110816896-gettyimages-2259102449-AFP_94VW633.jpeg?v=1770110845&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T15:30:00.000Z",
    "description": "watch nowU.S.-listed rare earth miners surged on Tuesday, following President Donald Trump's announcement to establish a critical mineral reserve. Cri",
    "body": "watch nowU.S.-listed rare earth miners surged on Tuesday, following President Donald Trump's announcement to establish a critical mineral reserve. Critical Metals advanced more than 10%, USA Rare Earth rose nearly 11%, and MP Materials gained about 4%. Shares of Energy Fuels werea about 8% higher, while Idaho Strategic Resources popped more than 3% and NioCorp Developments rose nearly 10%.The moves come after Trump on Monday outlined details for Project Vault, a first-of-its-kind strategic minerals reserve designed for the U.S. private sector.The plan is set to pool $2 billion in private capital with a $10 billion loan from the U.S. Export-Import Bank, Trump said in the Oval Office. \"For years, American businesses have risked running out of critical minerals during market disruptions. Today, we're launching what will be known as Project Vault, to ensure that American businesses and workers are never harmed by any shortage,\" Trump said.\"We don't want to ever go through what we went through a year ago — although it did work out,\" he continued. \"Just as we have long had a strategic petroleum reserve and a stockpile of critical minerals for national defense, we're now creating this reserve for American industry, so we don't have any problems,\" Trump said. Rare earths have come to the fore as a key bargaining chip in the ongoing geopolitical rivalry between the U.S. and China, the world's two largest economies. Regional composition of rare earths and permanent magnet production in 2024, according to data compiled by the International Energy Agency.IEATo be sure, China is the undisputed leader of the critical minerals supply chain, responsible for nearly 60% of the world's rare earths mining and more than 90% of magnet manufacturing. A subset of critical minerals, rare earths refer to 17 elements on the periodic table that have an atomic structure that gives them special magnetic properties. These materials are vital components to a vast array of modern technologies, from everyday electronics, such as smartphones, to electric vehicles and military equipment.From an industry perspective, it is critically important to see the U.S. taking \"decisive steps\" to shore up minerals and rare earths, said Wade Senti, president of Florida-based magnet maker Advanced Magnet Lab. \"But looking ahead, what is even more critical will be putting these minerals to use in permanent magnets that power the technologies of the future—from EVs to humanoid robots,\" Senti told CNBC by email. \"Innovative permanent magnet technology can perform with a large variety of different critical minerals—not just neodymium—giving America more optionality and tools in supply chain security,\" he added.— CNBC's Yun Li contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rare earth stocks jump after Trump launches $12 billion critical minerals stockpile",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108260585-1770110816896-gettyimages-2259102449-AFP_94VW633.jpeg?v=1770110845&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T15:30:00.000Z",
      "dateModified": "2026-02-03T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nintendo Switch becomes the gaming giant's best-selling console ever",
    "url": "https://www.cnbc.com/2026/02/03/nintendo-switch-best-selling-console-gaming.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220992-1762236968807-gettyimages-2217743482-AFP_48YZ7NP.jpeg?v=1770115014&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-02-03T11:44:24.000Z",
    "description": "TOPSHOT - A Super Mario character is pictured at a Nintendo display ahead of the launch of the company's Switch 2 console, an electronics store in the",
    "body": "TOPSHOT - A Super Mario character is pictured at a Nintendo display ahead of the launch of the company's Switch 2 console, an electronics store in the city of Nagoya, Aichi prefecture on June 2, 2025.Richard A. Brooks | Afp | Getty ImagesThe Switch has become Nintendo's best-selling console of all time, nearly nine years after its release. The device's importance to the Japanese gaming giant cannot be understated. Ahead of the Switch's release in March 2017, Nintendo was coming off the back of a flop with the Wii U, with its share price having declined in the years prior. Since the Switch's release, Nintendo has more than tripled its valuation with its brand arguably becoming more popular than ever.\"The company was in shambles after the previous console flopped hard, so the Switch marks a major turnaround in Nintendo's long history,\" Serkan Toto, CEO of Kantan Games, told CNBC. \"It could have not come at a better time.\"The gaming giant said Tuesday that lifetime sales of the Switch now total 155.37 million units, surpassing the record of 154.02 million units that was held by the Nintendo DS, the company's most popular console. In third place sits the iconic Gameboy with 118.69 million units sold. Switch timing keyBefore the Switch came the ill-fated Wii U which Nintendo hoped would be as successful as the innovative Wii console. The Wii, released in 2006, was known for its handheld motion controllers that allowed users to mimic playing sports such as tennis.Nintendo sold more than 100 million units of the Wii. But the WiiU, released in 2012, sold just 13.56 million units. Some critics say confusing marketing over the console was to blame. Others say that it was facing intense competition from Sony's PlayStation 4. A Nintendo Wii U touch-screen controller displaying the \"Super Mario Bros.\" gameAkio Kon | Bloomberg | Getty ImagesBut the Wii U gave some hint for what Nintendo was going to attempt next. The company had employed a strategy of separate handheld consoles and those that hook up to a TV. The Switch in 2017 blurred the lines. It was a console that gamers could play on a large screen, but users can also attach controllers to a portable screen and continue gaming on the go.\"What is fundamental is that with the Switch's form factor — a innovative hybrid console offering both a handheld and TV console experience — Nintendo took the decision to combine its historic dual product strategy into a single product line,\" Piers Harding-Rolls, head of games research at Ampere Analysis, told CNBC.\"This had the impact of combining its handheld and TV console audiences, thus laying the foundation for a new level of success from a single product.\"watch nowThe timing was important. Nintendo's base of young casual gamers was being tempted by an onslaught from popular mobile games, and the Switch enabled Nintendo to counter that.\"Switch reinvigorated Nintendo's console business after mobile gaming rose to prominence to eat 3DS and Wii U's lunch,\" James McWhirter, senior analyst at Omdia, said.  What drove Switch's popularityThe Switch was a new concept when it was launched in 2017, combining a traditional console and handheld. Nintendo's success with the Switch stemmed from its ability to leverage its in-house console design and first-party games based on its most popular franchises and characters.\"Mario Kart 8 Deluxe\" was the most popular title with more than 70 million units sold. \"Animal Crossing: New Horizons\" and a slew of games based on Super Mario and friends, Zelda and Pokemon, made the rest of the best-seller list. The Switch also saw increased interest during the Covid-19 pandemic when people were stuck at home and looking to video games for entertainment. And just when it looked like interest may fade, the Super Mario movie in 2023 helped to breathe fresh life into the console. Chris Pratt and Charlie Day voice Mario and Luigi, respectively, in Universal and Illumination's \"The Super Mario Bros. Movie.\"UniversalNintendo has expanded the way it spreads its intellectual property beyond the console to toys, theme parks and movies, which brought the audience back to the Switch.\"The Switch generation was also defined by Nintendo making a broad effort to expand the reach of its globally-recognisable IP via theme parks, movies, museums, and collaborations,\" McWhirter said.Nintendo is hoping to replicate that playbook with the Switch 2 which was launched last year. So far, the console has sold more than 14 million units and Nintendo said the device is its fastest-selling of all time. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nintendo Switch becomes the gaming giant's best-selling console ever",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220992-1762236968807-gettyimages-2217743482-AFP_48YZ7NP.jpeg?v=1770115014&w=1920&h=1080"
      ],
      "datePublished": "2026-02-03T11:44:24.000Z",
      "dateModified": "2026-02-03T11:44:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]