[
  {
    "title": "Stop saying ‘don’t cry’—to raise confident, emotionally intelligent kids, use these 5 phrases instead",
    "url": "https://www.cnbc.com/2025/11/23/stop-saying-dont-cryto-raise-confident-emotionally-intelligent-kids-use-these-phrases-instead.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108228347-1763569373448-GettyImages-523244696.jpg?v=1763569488&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-23T14:30:01.000Z",
    "description": "It's natural to want to comfort a child when they're crying. When parents see their kid hurting physically or emotionally, they often want to do anyth",
    "body": "It's natural to want to comfort a child when they're crying. When parents see their kid hurting physically or emotionally, they often want to do anything in their power to stop their heartache. As a dual certified child life specialist and therapist, I've heard parents and even health care workers telling kids \"don't cry\" while wiping away their tears during medical procedures and other difficult moments. It comes from a place of wanting to fix the hurt and make it all better. But it can make kids feel like their emotions and tears aren't okay, especially when they're in pain or distress. Instead, try to validate kids' feelings and help them feel safe and supported expressing their emotions and tears. Use these five alternatives:1. 'It's okay to cry, I'm here with you.'This helps kids know and believe that their experience is real and it's natural. Staying with kids through their stress conveys the message that their feelings don't scare you, that you can handle the difficult moments with them, and that they can rely on you for real-time support, even when it's hard or uncomfortable. 2. 'I see your tears.'You may not always know exactly why a child is crying or understand their reaction to the situation. Validation doesn't necessarily mean agreement; it means, \"I see you and I believe you.\" One way to validate their experience is to simply reflect back what you're seeing. Naming their emotion can be helpful for some kids, but for others it can be upsetting if your label doesn't match what they're truly feeling. Try naming their behaviors or using a more encompassing term such as \"upset.\"3. 'Your feelings make sense.'If kids hear, \"don't cry,\" they might interpret that their response doesn't match the situation, when in fact, it often does. We want kids to trust their feelings and to know that their tears make sense for what they're experiencing, whether it's pain, fear, or isolation. Sometimes the behaviors will be out of proportion with the situation, but the underlying feelings are never wrong. 4. 'It's natural to feel sad.'Parents often want their kids to feel happy, but it's natural to feel a range of emotions including difficult or uncomfortable ones. The goal is not to stop the emotion but to help kids acknowledge and manage it. Helping kids understand that crying is not bad — and that it's perfectly natural to feel sad, angry, lonely, or frustrated sometimes — reduces a sense of shame from any negative experiences. 5. 'Crying is one healthy way our bodies let feelings out.'Lastly, it's important for kids to understand that crying is a very healthy way to release emotions. Crying is coping and so is coloring, playing, talking, running, listening to music, and breathing. You can help kids try different strategies and find the ones that work best for them. Use tears as a chance to meet kids where they're at and help them work through challenges with confidence and connection. Kelsey Mora is a Certified Child Life Specialist and Licensed Clinical Professional Counselor who provides custom support, guidance, and resources to parents, families, and communities impacted by medical conditions, trauma, grief, and everyday life stress. She is a private practice owner, mom of two, the creator and author of The Method Workbooks, and the Chief Clinical Officer of the nonprofit organization Pickles Group.Earn more and get ahead with CNBC's online courses. Black Friday starts now! Get 25% off select courses and 30% off exclusive bundles with coupon code GETSMART. Offer valid November 17 through December 5, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stop saying ‘don’t cry’—to raise confident, emotionally intelligent kids, use these 5 phrases instead",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108228347-1763569373448-GettyImages-523244696.jpg?v=1763569488&w=1920&h=1080"
      ],
      "datePublished": "2025-11-23T14:30:01.000Z",
      "dateModified": "2025-11-23T14:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How much space $2,000 a month in rent gets you in the 25 biggest U.S. cities",
    "url": "https://www.cnbc.com/2025/11/22/how-much-space-2000-a-month-in-rent-gets-in-25-biggest-us-cities.html",
    "image": "https://image.cnbcfm.com/api/v1/image/103765025-GettyImages-542768874.jpg?v=1763665334&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-22T14:00:01.000Z",
    "description": "Living alone with a $2,000 housing budget may be nearly impossible in some major cities — but in others you may be able to afford up to three bedrooms",
    "body": "Living alone with a $2,000 housing budget may be nearly impossible in some major cities — but in others you may be able to afford up to three bedrooms.Across the U.S., the average rent for a studio apartment listed on Apartments.com in October was $1,699 a month, and a two-bedroom space had an average rent of $1,887 per month, according to data collected and analyzed by Apartments.com in a November report. Of the 25 most populous cities in the U.S., New York, Boston and California cities San Francisco, San Diego and San Jose were the most expensive. Average rent for a studio apartment in these cities was over $2,000 in October, according to data from Apartments.com shared with CNBC Make It.With $2,000, you could get an average of 267 square feet in New York City, or one-third the size of a pickleball court, according to a normalized estimate from October listings. Compare that with Oklahoma City, the most affordable of the most populous cities, where $2,000 is worth about 1,900 square feet — more than two pickleball courts. While this data offers a useful benchmark for comparison across cities, it isn't necessarily indicative of the size of any single apartment a renter is likely to encounter. In reality, apartment sizes and prices can differ within the same city due to various factors, and renters should keep that in mind, the authors of the report said.Here's where $2,000 in rent would get you the least space in the 25 most populous cities in America:New York, N.Y.: 267 square feetBoston, Mass.: 336 square feetSan Francisco, Calif.: 340 square feetSan Diego, Calif.: 458 square feetSan Jose, Calif.: 427 square feetHere's where $2,000 in rent would get you the most space in the 25 most populous cities in America: Oklahoma City, Okla.: 1,900 square feetEl Paso, Texas: 1,762 square feetIndianapolis, Ind.: 1,676 square feetColumbus, Ohio: 1,633 square feetSan Antonio, Texas: 1,517 square feetHere's how much space you could get for $2,000 a month in all 25 of the most populous U.S. cities as of October.New York, N.Y.Unit type: N/A Average size for $2,000: 267 square feetLos Angeles, Calif.Unit type: StudioAverage size for $2,000: 530 square feetChicago, Ill.Unit type: One bedroomAverage size for $2,000: 679 square feetHouston, TexasUnit type: Three bedroomAverage size for $2,000: 1,443 square feetPhoenix, Ariz.Unit type: Two bedroomAverage size for $2,000: 1,230 square feetPhiladelphia, Pa.Unit type: One bedroomAverage size for $2,000: 772 square feetSan Antonio, TexasUnit type: Three BedroomAverage size for $2,000: 1,517 square feetSan Diego, Calif.Unit type: N/AAverage size for $2,000: 458 square feetDallas, TexasUnit type: Two bedroomAverage size for $2,000: 1,154 square feetJacksonville, Fla.Unit type: Three bedroomAverage size for $2,000: 1,453 square feetFort Worth, TexasUnit type: Three bedroomAverage size for $2,000: 1,305 square feetSan Jose, Calif.Unit type: N/AAverage size for $2,000: 427 square feetAustin, TexasUnit type: Two bedroomAverage size for $2,000: 1,186 square feetCharlotte, N.C.Unit type: Two bedroomAverage size for $2,000: 1,235 square feetColumbus, OhioUnit type: Three bedroomAverage size for $2,000: 1,633 square feetIndianapolis, Ind.Unit type: Three bedroomAverage size for $2,000: 1,676 square feetSan Francisco, Calif.Unit type: N/AAverage size for $2,000: 340 square feetSeattle, Wash.Unit type: StudioAverage size for $2,000: 534 square feetDenver, Colo.Unit type: One bedroomAverage size for $2,000: 852 square feetOklahoma City, Okla.Unit type: Three bedroomAverage size for $2,000: 1,900 square feetNashville, Tenn.Unit type: One bedroomAverage size for $2,000: 863 square feetWashington, D.C.Unit type: StudioAverage size for $2,000: 512 square feetEl Paso, TexasUnit type: Three bedroomAverage size for $2,000: 1,762 square feetLas Vegas, Nev.Unit type: Three bedroomAverage size for $2,000: 1,354 square feetBoston, Mass.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How much space $2,000 a month in rent gets you in the 25 biggest U.S. cities",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/103765025-GettyImages-542768874.jpg?v=1763665334&w=1920&h=1080"
      ],
      "datePublished": "2025-11-22T14:00:01.000Z",
      "dateModified": "2025-11-22T14:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bessent believes there won't be a recession in 2026 but says some sectors are challenged",
    "url": "https://www.cnbc.com/2025/11/23/bessent-economy-no-recession-2026.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222051-1762378642815-gettyimages-2245202905-ah700900_upl2drhs.jpeg?v=1762378795&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-23T18:11:03.000Z",
    "description": "Scott Bessent, US treasury secretary, arrives to speak during a site expansion groundbreaking ceremony at the Boeing South Carolina (BSC) manufacturin",
    "body": "Scott Bessent, US treasury secretary, arrives to speak during a site expansion groundbreaking ceremony at the Boeing South Carolina (BSC) manufacturing facility in North Charleston, South Carolina, US, on Friday, Nov. 7, 2025. Sean Rayford | Bloomberg | Getty ImagesTreasury Secretary Scott Bessent said on Sunday the U.S. was not at risk of entering a recession in 2026 and claimed Americans would soon benefit from the Trump administration's economic policies on trade and taxes. \"I am very, very optimistic on 2026,\" Bessent said in an interview on NBC News' \"Meet the Press.\" \"We have set the table for a very strong, noninflationary growth economy.\" Parts of the GOP's massive spending package — the One Big, Beautiful Bill Act — are still going into effect and have yet to be felt in the economy, Bessent said. The new law makes permanent Trump's 2017 tax cuts, along with a senior \"bonus\" to offset Social Security taxes and a bigger state and local tax deduction. The plan also has tax breaks for tip income, overtime pay and auto loans.Health-care costs are also expected to become more affordable, Bessent added. The secretary said the Trump administration would have more news on that subject this week. For now, a congressional deadlock tied to the extension of enhanced subsidies on the Affordable Care Act marketplace is expected to push up health-care costs for millions of people. Bessent acknowledged that there are parts of the economy showing signs of struggle, including housing and interest-rate-sensitive sectors. He cited the services economy as contributing to inflation, claiming that lower energy prices will soon help to drive down prices.Kevin Hassett, the director of the White House National Economic Council, also said on Sunday that economic data from the fourth quarter could show weakness because of the government shutdown. The 43-day congressional stalemate in Washington, D.C., was the longest in U.S. history. Around two-thirds of registered voters say the Trump administration has fallen short on the economy and the cost of living, a recent NBC News poll found. Americans' views of the economy largely depend on their income level, according to JPMorgan's latest Cost of Living Survey.High-income respondents rated their confidence a 6.2 out of 10 — with 10 being the best — on average, the bank found. More than half of this cohort chose a rating between 7 and 10. In contrast, low-income consumers reported a 4.4 score on average. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bessent believes there won't be a recession in 2026 but says some sectors are challenged",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222051-1762378642815-gettyimages-2245202905-ah700900_upl2drhs.jpeg?v=1762378795&w=1920&h=1080"
      ],
      "datePublished": "2025-11-23T18:11:03.000Z",
      "dateModified": "2025-11-23T18:11:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top Wall Street analysts favor these 3 stocks for solid upside potential",
    "url": "https://www.cnbc.com/2025/11/23/top-wall-street-analysts-favor-these-3-stocks-for-solid-upside.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108216550-1761309810055-gettyimages-2242649795-MICROSOFT_EARNS.jpeg?v=1763748089&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-23T12:16:42.000Z",
    "description": "Signage at the Microsoft campus in Mountain View, California, US, on Thursday, Oct. 23, 2025. Benjamin Fanjoy | Bloomberg | Getty ImagesConcerns about",
    "body": "Signage at the Microsoft campus in Mountain View, California, US, on Thursday, Oct. 23, 2025. Benjamin Fanjoy | Bloomberg | Getty ImagesConcerns about the steep valuations of artificial intelligence (AI) stocks and a questionable outlook for an interest rate cut in December weighed on investor sentiment in recent trading sessions. For now, however, Nvidia's solid earnings last week seemed to undermine the idea that everything tied to AI investment is in a bubble.Investors looking to capitalize on the recent selloff and pick up some attractive stocks for the long term can track the recommendations of top Wall Street analysts. These experts can help provide key insights into a company's growth potential.Here are three stocks favored by the Street's top pros, according to TipRanks, a platform that ranks analysts based on their past performance.MicrosoftWindows and Xbox owner Microsoft (MSFT) is viewed as one of the major beneficiaries of the AI boom. Last month, the company reported better-than-expected results in its fiscal first quarter, with revenue from the Azure cloud business growing by 40%.Recently, Baird analyst William Power initiated coverage on Microsoft with a buy rating and a price target of $600. TipRanks' AI Analyst is also optimistic on MSFT, giving it an \"outperform\" rating and a price target of $628.\"Microsoft is leading the AI revolution with infrastructure and applications, aided by its OpenAI relationship, providing an end-to-end AI platform for enterprises and consumers alike,\" said Power, explaining his optimism.Power sees MSFT's partnership with ChatGPT parent OpenAI as a key differentiator, helping it run AI at scale and speed. The 5-star analyst said that after a commitment to invest $13 billion, Microsoft recently announced an incremental $250 billion Azure investment over several years.The analyst discussed the impressive growth in MSFT's total revenue and Azure business in the September quarter, with the cloud business now constituting 60% of the overall top line. Power also highlighted the strength in Microsoft's core applications, including Microsoft 365, LinkedIn and Dynamics. He noted that MSFT's revenue growth in Q1 FY26 was accompanied by a solid operating margin of 49% and free cash flow margin of 33%. Microsoft's strong margins are ensuring continued double-digit EPS growth, he said.Power believes in Microsoft's near- and long-term potential, despite any immediate pressure stemming from AI capital spending concerns.Power ranks No. 287 among more than 10,100 analysts tracked by TipRanks. His ratings have been successful 57% of the time, delivering an average return of 17%. See Microsoft Ownership Structure on TipRanks.Booking HoldingsOnline travel agent (OTA) Booking Holdings (BKNG) is another pick this week. The Priceline and Kayak owner posted impressive third-quarter results, with double-digit gains in gross bookings and revenue.Impressed by the Q3 performance and attractive valuation, Wedbush analyst Scott Devitt upgraded BKNG to buy from hold with a price targe of $6,000. By comparison, TipRanks' AI Analyst has a \"neutral\" rating on Booking Holdings with a price target of $5,406.\"Booking remains the best-positioned OTA in our view,\" benefiting from several positives, from the company's scale and diversification to solid liquidity to free cash flow conversion, Devitt said.The top-rated analyst also noted management's impressive history of successfully executing major strategic initiatives. Devitt highlighted Booking Holdings' widening market share in alternative lodging while optimizing costs and driving efficiencies. The company's cost savings are supporting reinvestment in growth initiatives to achieve longer-term targets, he said.Additionally, Devitt discussed Booking's impressive growth across key metrics in the third quarter amid better-than-anticipated global travel demand. Third-quarter gross bookings growth of 14% surpassed management's guidance by 400 basis points, the analyst said. ASs a result, Devitt raised his 2025 gross bookings growth estimate by 100 basis points from his prior forecast, to 11.5%. Further, he expects BKNG to report adjusted EBITDA of $9.8 billion, reflecting year-over-year margin expansion of about 180 basis points.Devitt ranks No. 660 among more than 10,100 analysts tracked by TipRanks. His ratings have been profitable 50% of the time, delivering an average return of 12.3%. See Booking Holdings Financials on TipRanks. DoorDashDevitt also upgraded his rating for food delivery platform DoorDash (DASH) to buy from hold with a price target of $260. TipRanks' AI Analyst rates DoorDash \"neutral\" with a price target of $211. DASH shares took a hit when the company announced mixed third-quarter results and said it expects to spend \"several hundred million dollars\" on new initiatives and development in 2026.Devitt believes that the pullback in DASH shares presents an attractive risk/reward opportunity, with the stock now trading at about 17.7x his 2027 adjusted EBITDA estimate. The Wedbush analyst noted that the post earnings selloff was mainly due to concerns about the level of capital spending and pressured profit margins.Devitt admits that the higher level of spending will hurt near-term margins, but argues such investments in growth initiatives are warranted given that they'll expand DASH's addressable market and bolster its product offerings.Specifically, Devitt highlighted management's plans to direct incremental investments toward three key areas: \"(1) creating a cohesive global tech platform, (2) building new verticals and products, and (3) scaling geographic expansion.\"Overall, Devitt is bullish on DoorDash, believing it has held a dominant position in the U.S. food delivery sector. Moreover, he noted the company's solid execution across strategic initiatives as management pushes for long-term sustainable growth. See DoorDash Hedge Fund Activity on TipRanks. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top Wall Street analysts favor these 3 stocks for solid upside potential",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108216550-1761309810055-gettyimages-2242649795-MICROSOFT_EARNS.jpeg?v=1763748089&w=1920&h=1080"
      ],
      "datePublished": "2025-11-23T12:16:42.000Z",
      "dateModified": "2025-11-23T12:16:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta halted internal research suggesting social media harm, court filing alleges",
    "url": "https://www.cnbc.com/2025/11/23/meta-internal-research-social-media-harm-court-filing.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108194774-1757072533523-gettyimages-2233066222-TECH_CEOS_WH.jpeg?v=1763938045&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-24T01:08:48.000Z",
    "description": "Mark Zuckerberg, chief executive officer of Meta Platforms Inc., during a dinner with tech leaders in the State Dining Room of the White House in Wash",
    "body": "Mark Zuckerberg, chief executive officer of Meta Platforms Inc., during a dinner with tech leaders in the State Dining Room of the White House in Washington, DC, US, on Thursday, Sept. 4, 2025. US President Donald Trump said he would be imposing tariffs on semiconductor imports \"very shortly\" but spare goods from companies like Apple Inc. that have pledged to boost their US investments. Photographer: Will Oliver/EPA/Bloomberg via Getty ImagesWill Oliver | Bloomberg | Getty ImagesMeta halted internal research that purportedly showed that people who stopped using Facebook became less depressed and anxious, according to a legal filing that was released on Friday. The social media giant was alleged to have initiated the study, dubbed Project Mercury, in late 2019 as a way to help it \"explore the impact that our apps have on polarization, news consumption, well-being, and daily social interactions,\" according to the legal brief, filed in the United States District Court for the Northern District of California. The filing contains newly unredacted information pertaining to Meta. The newly released legal brief is related to high-profile multidistrict litigation from a variety of plaintiffs, such as school districts, parents and state attorneys general against social media companies like Meta, Google's YouTube, Snap and TikTok. The plaintiffs claim that these businesses were aware that their respective platforms caused various mental health-related harms to children and young adults, but failed to take action and instead misled educators and authorities, among several allegations. \"We strongly disagree with these allegations, which rely on cherry-picked quotes and misinformed opinions in an attempt to present a deliberately misleading picture,\" Meta spokesperson Andy Stone said in a statement. \"The full record will show that for over a decade, we have listened to parents, researched issues that matter most, and made real changes to protect teens—like introducing Teen Accounts with built-in protections and providing parents with controls to manage their teens' experiences.\" A Google spokesperson said in a statement that \"These lawsuits fundamentally misunderstand how YouTube works and the allegations are simply not true.\" \"YouTube is a streaming service where people come to watch everything from live sports to podcasts to their favorite creators, primarily on TV screens, not a social network where people go to catch up with friends,\" the Google spokesperson said. \"We've also developed dedicated tools for young people, guided by child safety experts, that give families control.\" Snap and TikTok did not immediately respond to a request for comment.The 2019 Meta research was based on a random sample of consumers who stopped their Facebook and Instagram usage for a month, the lawsuit said. The lawsuit alleged that Meta was disappointed that the initial tests of the study showed that people who stopped using Facebook \"for a week reported lower feelings of depression, anxiety, loneliness, and social comparison.\" Meta allegedly chose not to \"sound the alarm,\" but instead stopped the research, the lawsuit said.\"The company never publicly disclosed the results of its deactivation study,\" according to the suit. \"Instead, Meta lied to Congress about what it knew.\"The lawsuit cites an unnamed Meta employee who allegedly said, \"If the results are bad and we don't publish and they leak, is it going to look like tobacco companies doing research and knowing cigs were bad and then keeping that info to themselves?\"Stone, in a series of social media posts, pushed back on the lawsuit's implication that Meta shuttered the internal research after it allegedly showed a causal relationship between its apps and adverse mental-health effects.Stone characterized the 2019 study as flawed and said it was the reason that the company expressed disappointment. The study, Stone said, merely found that \"people who believed using Facebook was bad for them felt better when they stopped using it.\"\"This is a confirmation of other public research (\"deactivation studies\") out there that demonstrates the same effect,\" Stone said in a separate post. \"It makes intuitive sense but it doesn't show anything about the actual effect of using the platform.\"CNBC's Lora Kolodny contributed reporting.WATCH: Final trades: Meta, S&P Global and Idexx Lab.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta halted internal research suggesting social media harm, court filing alleges",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108194774-1757072533523-gettyimages-2233066222-TECH_CEOS_WH.jpeg?v=1763938045&w=1920&h=1080"
      ],
      "datePublished": "2025-11-24T01:08:48.000Z",
      "dateModified": "2025-11-24T01:08:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Painful' ambition can ruin your career, leadership coach says—how to heal your relationship with success",
    "url": "https://www.cnbc.com/2025/11/23/painful-ambition-can-ruin-your-career-leadership-coach-says.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229390-1763665066523-The_Ambition_Trap_by_Amina_AlTai_1.jpg?v=1763741940&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-23T14:00:01.000Z",
    "description": "Amina AlTai has always been a high achiever.As a child of immigrants, she was told to \"keep your head down, work really hard, and if you do that, you'",
    "body": "Amina AlTai has always been a high achiever.As a child of immigrants, she was told to \"keep your head down, work really hard, and if you do that, you'll have everything you want,\" she tells CNBC Make It.Her early career looked \"great on paper,\" she says: AlTai opened her own marketing agency in her late 20s, and says she was \"achieving all the milestones\" of success.At the same time, she was overworking herself to the point of illness, she says. One day, while driving to a client meeting, she got a call from her physician. \"My doctor called to say that if I don't go to the hospital now, instead of going to work, I'll be days away from multiple organ failure\" due to severe anemia, AlTai says.In hindsight, the moment was \"such a wake-up call,\" she says — but instead of heading straight for the hospital, AlTai first attended her client meeting.She says she was subsequently diagnosed with celiac disease and Hashimoto's thyroiditis, both of which were exacerbated by exhaustion.\"My workaholic tendencies and painful relationship to success were — quite literally — killing me,\" AlTai, now 41, wrote in her recent book, \"The Ambition Trap: How to Stop Chasing and Start Living.\"Today, AlTai is a leadership coach who teaches her clients how to protect their wellbeing and practice healthy ambition. \"So many of us are working ourselves into pain and suffering,\" she says — but it doesn't have to be that way. Here's her advice for building a healthy mindset around ambition.'Painful' versus 'purposeful' ambitionThough AlTai's unhealthy relationship with ambition caused her to \"crash and burn,\" she says, it doesn't mean that being driven is inherently a bad thing.\"I think ambition is neutral and natural,\" she says. She defines it as \"simply a desire for more life, a wish to grow, a wish to unfold.\"In AlTai's view, people tend to experience ambition in two ways, she says: \"painful\" ambition and \"purposeful\" ambition.Painful ambition, which AlTai defines as \"the voracious desire to advance, regardless of the cost,\" stems from a feeling of \"not-enoughness,\" she writes in \"The Ambition Trap.\" From a psychological perspective, painful ambition is based in emotional \"core wounds\" like rejection, abandonment, humiliation, betrayal and injustice, she says.\"If you build your ambition upon that, it's going to be a bit of a house of cards,\" AlTai says, \"because we're perpetually looking for the salve on the outside for the wound on the inside, and that never works.\"On the other hand, purposeful ambition \"comes from a place of wholeness,\" she says. People who practice purposeful ambition are driven by a desire to make a positive impact, AlTai says. They excel at collaborating with others, protect their needs and approach their mistakes with a growth mindset.Self-awareness is the key to turning painful ambition into purposeful ambition, according to AlTai. She encourages her clients to journal about their thought patterns without self-judgement, taking note when they fall into unhealthy mindsets.Habits for healthy ambitionIn order to stay in the zone of healthy ambition, one essential practice is \"honoring your energy,\" AlTai says. That means making time for the things that nourish you, from nutrition and exercise to spending time with loved ones.Without taking care of ourselves, \"it's really hard to show up fully,\" AlTai says. From a career standpoint, honoring your energy could mean designing your work week around the times you're most productive, taking walks in between meetings or blocking off certain times on your calendar to allow uninterrupted focus.Another important habit is to \"celebrate your wins,\" she says. As a leadership coach, AlTai noticed a pattern among many of her \"really ambitious\" clients: They were \"always moving the goalpost,\" she says.Instead of taking time to enjoy their successes, her clients immediately started working toward their next goal. That mindset makes it \"very tricky\" to feel satisfied with your accomplishments, according to AlTai.AlTai encourages taking time to rest after reaching a major milestone. \"In those quiet moments, you take inventory, you take stock, you see what worked, what you loved, what you didn't love, what you would do differently, and then you rise again,\" she says.Earn more and get ahead with CNBC's online courses. Black Friday starts now! Get 25% off select courses and 30% off exclusive bundles with coupon code GETSMART. Offer valid November 17 through December 5, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Painful' ambition can ruin your career, leadership coach says—how to heal your relationship with success",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229390-1763665066523-The_Ambition_Trap_by_Amina_AlTai_1.jpg?v=1763741940&w=1920&h=1080"
      ],
      "datePublished": "2025-11-23T14:00:01.000Z",
      "dateModified": "2025-11-23T14:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "56-year-old man got over $170,000 in student loan forgiveness under Trump: 'I could not believe it'",
    "url": "https://www.cnbc.com/2025/11/22/this-56-year-old-man-just-got-170000-in-student-loan-forgiveness-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220550-1762179854159-photo-2025-10-30-12-49-45_720.jpg?v=1763737667&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-22T13:44:07.000Z",
    "description": "Daniel Gray and his husband, Douglas, and their dog.Courtesy: Daniel GrayOn Oct. 23, the day after Daniel Gray's 56th birthday, he received an email t",
    "body": "Daniel Gray and his husband, Douglas, and their dog.Courtesy: Daniel GrayOn Oct. 23, the day after Daniel Gray's 56th birthday, he received an email that made him feel like he was dreaming: The U.S. Department of Education would forgive his more than $170,000 student loan balance.\"I could not believe it,\" Gray said. \"This is the first time I've been without debt since I'm 18.\"Yet the relief should not have been so surprising. Gray began paying his student loan debt in the 1990s and was eligible for the loan cancellation under the terms of his income-driven repayment plan. IDR plans lead to loan erasure after a certain period, typically 20 years or 25 years. But, like many borrowers, Gray was worried by reports that the relief was becoming harder to access under the Trump administration. \"Because of what's been going on, it was unclear whether they'd get forgiven,\" Gray said. Recently, many student loan borrowers have been left doubting if they'll get the loan cancellation to which they're entitled, said higher education expert Mark Kantrowitz. \"When borrowers worry about whether the Trump administration will renege on the student loan forgiveness promised by the federal government, it places them under extreme financial and emotional stress,\" Kantrowitz said. The U.S. Department of Education did not respond to a request for comment. Loan forgiveness becomes uncertain under Trump Earlier this year, the Education Department stopped forgiving the debt of borrowers in two long-standing student loan repayment plans, the Income-Contingent Repayment plan, or ICR, and the Pay As You Earn plan, or PAYE. It also temporarily paused debt forgiveness under the Income-Based Repayment plan, or IBR. More than 12 million student loan borrowers are enrolled in one of the Education Department's IDR plans, according to Kantrowitz.  But then, in October, there was a major victory for borrowers: The Trump administration agreed to resume clearing people's debts under ICR and PAYE, as a result of a lawsuit brought by the American Federation of Teachers. That same month, eligible borrowers enrolled in IBR also began to see their debts canceled again. The AFT contended that Trump officials were blocking borrowers from their rights mandated in their loan terms. \"We cannot say for sure, but it is possible that the AFT lawsuit prompted the discharge,\" said Weena Sanchez, a student loan counselor at the Education Debt Consumer Assistance Program in New York, a nonprofit, about Gray's student loan forgiveness. EDCAP worked with Gray on his request for the relief. Gray had earned the loan cancellation by May 2024, according to his loan forgiveness statement. \"We've heard of other clients receiving similar notices,\" Sanchez said. Read more CNBC personal finance coverageSocial Security beneficiaries will soon receive 2026 benefit notices. Here are the changes to watch for next yearRoth conversions could trigger a ‘tax torpedo’ under Trump’s ‘big beautiful bill’Why AI may kill career advancement for many young workersConcerns mount for student loan borrowers amid Education Department restructuringNew Social Security scam uses ‘high pressure’ scare tactics. What to watch forTrump administration takes further steps to dismantle Department of EducationMillions of federal student loan borrowers will start repayment soon. Here’s what to knowWhy the ACA subsidy cliff is a ‘phantom tax’ — and how to avoid itHere’s a way to graduate from college with little to no student debtStandard Medicare Part B monthly premium to jump 9.7% in 2026AI puts the squeeze on new grads — and the colleges that promised to make them employableHow baby boomers can close a retirement savings gapAfter a layoff, don't forget about your 401(k) — it's 'one of your biggest assets,' CFP saysIRS announces 2026 401(k) contribution limits, raises savings capIRS unveils 2026 IRA contribution limits, raises savings capIRS announces 401(k) catch-up contributions for 2026, raises capIRS unveils Roth IRA income limits for 2026What the Visa, MasterCard settlement means for your rewards credit cardWhere SNAP benefits stand amid negotiations to end the government shutdownWhy the AI stock boom mainly benefits the wealthyBoomers are less bullish on ETFs than younger generations — with good reasonTrump floats $2,000 tariff rebate checks: Here's what you need to knowCNBC's Financial Advisor 100: Best financial advisors, top firms for 2025 rankedBut student loan borrowers continue to get their debt excused amid unprecedented changes at the Education Department. The Trump administration announced this week that it will transfer much of the Education Department's programs to other agencies, a move experts say is part of President Donald Trump's directive to dismantle the agency. Education Department officials are also exploring options to sell portions of the $1.6 trillion federal student portfolio to the private market, Politico reported in October.A lifetime vow of poverty should not be part of the bargain. Mark Kantrowitz higher education expert Whatever changes lie ahead, it's important for borrowers to remember that the original terms of their student loans, spelled out in their Master Promissory Note, cannot change in the middle of repayment, Kantrowitz said. When borrowers signed that agreement, any programs that were in existence at the time, including repayment plans that conclude in loan forgiveness, must remain available to them, by law.Since student loans can't be discharged in normal bankruptcy proceedings, like other types of debt, borrowers \"depend on there being a light at the end of the tunnel,\" with the government's forgiveness, Kantrowitz said.\"When a low-income student is forced to borrow to pay for college, a lifetime vow of poverty should not be part of the bargain,\" he said. Student loan forgiveness 'the only way out' For some 30 years, Gray says his student loan debt weighed on him. He graduated in the mid-1990s from the University of California, Santa Barbara, with a degree in film studies and began working technical jobs in video and television production. But in the following years, he says, he grappled with substance abuse issues and clinical depression. As a result, his career took a hit, and Gray struggled to keep up with his monthly student loan payment, he said. Originally, he borrowed roughly around $30,000, but his balance steadily grew due to interest charges. \"This system is designed for students to graduate, get good jobs and start paying,\" Gray said. \"But what about for those of us who don't get our lives together until we are 37 or 38?\" By then, he said, his debt was already nearing six figures. By the time his debt was canceled by the government in October, his balance had spiraled to more than $170,000. \"I couldn't believe I had allowed it to get to this point; I felt incredibly guilty and ashamed,\" Gray said, but he also \"felt like the whole situation was engineered to take advantage of the borrower.\"  In 2011, Gray got a job offer at a television studio in Brazil. Frustrated with the cost of living in the U.S. and hoping for a major change, he made the move to São Paulo. He's lived in Brazil ever since. He met his now-husband, Douglas, a chef, there. The couple live close to the beach and take their dog for long walks every day.The biggest change Gray has felt since his student debt was wiped away is psychological: \"I suddenly feel like I can relax,\" he said. \"It's easy for people to say, 'Why don't people just pay them off? What's the big deal?\" Gray said, about his student loans. But he went on: \"It reached a point where it was beyond control. It seemed impossible. Student loan forgiveness is the only way out for a lot of people.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "56-year-old man got over $170,000 in student loan forgiveness under Trump: 'I could not believe it'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220550-1762179854159-photo-2025-10-30-12-49-45_720.jpg?v=1763737667&w=1920&h=1080"
      ],
      "datePublished": "2025-11-22T13:44:07.000Z",
      "dateModified": "2025-11-22T13:44:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Wicked: For Good' soars to $150 million domestic opening",
    "url": "https://www.cnbc.com/2025/11/23/universals-wicked-for-good-soars-to-150-million-domestic-opening.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108230583-1763912006430-wicked_for_good_Cropped.png?v=1763912047&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-23T18:39:24.000Z",
    "description": "Ariana Grande and Cynthia Erivo star in Universal's \"Wicked: For Good.\"UniversalUniversal's \"Wicked: For Good\" defied gravity at the box office, snari",
    "body": "Ariana Grande and Cynthia Erivo star in Universal's \"Wicked: For Good.\"UniversalUniversal's \"Wicked: For Good\" defied gravity at the box office, snaring an estimated $150 million from domestic ticket sales.It marks the second-highest opening weekend for a film released in 2025, just behind Warner Bros.' \"A Minecraft Movie,\" which tallied $163 million back in April. It also outpaces the debut of last year's \"Wicked,\" which tallied $112.5 million in the U.S. and Canada.The film's haul sets the record for the biggest opening weekend of a Broadway adaptation. With additional ticket sales from international markets, \"Wicked: For Good\" is set to reach a $226 million global haul for its first three days in theaters.An estimated 10 million tickets were sold for \"Wicked: For Good\" during opening weekend, topping the 8 million sold during the opening of \"Wicked\" last year, according to data from EntTelligence. The box office data company also reported that 30% of domestic screenings were in premium large format theaters, up from 18% for \"Wicked.\" These tickets are more expensive than general admission and can help bolster blockbuster releases. EntTelligence noted that general tickets for \"Wicked: For Good\" averaged at around $15.25 each while tickets for premium screens averaged at $18.75 a piece.\"Team Universal did a fantastic job of following perfectly on the success of the original film a year ago and have parlayed that into an even bigger debut for this second installment,\" said Paul Dergarabedian, head of marketplace trends at Comscore. \"'Wicked: For Good' will look forward to incredibly strong playability throughout Thanksgiving week and beyond during the all-important holiday movie-going season.\"Last year, the combination of \"Wicked,\" Paramount's \"Gladiator II\" and Disney's \"Moana 2\" helped boost the Thanksgiving holiday box office to its highest haul ever. This year, \"Wicked: For Good\" is joined by Disney's \"Zootopia 2.\"The first \"Zootopia\" opened in 2016 to $75 million domestically but went on to gross more than $1 billion worldwide. Pent-up audience demand could push the film's three-day opening to around $100 million and the five-day Thanksgiving period to north of $125 million. \"The impressive expected over-performance by 'Wicked: For Good,' in combination with the other films in the marketplace, could give last year's record Thanksgiving literally a run for its money,\" Dergarabedian said. \"This is great news after all the negative stories about the challenging October box office drove the narrative.\" Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast's planned spinoff of Versant.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Wicked: For Good' soars to $150 million domestic opening",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108230583-1763912006430-wicked_for_good_Cropped.png?v=1763912047&w=1920&h=1080"
      ],
      "datePublished": "2025-11-23T18:39:24.000Z",
      "dateModified": "2025-11-23T18:39:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia's Qube Holdings' shares jump 20% as Macquarie proposes $7.5 billion takeover deal",
    "url": "https://www.cnbc.com/2025/11/24/australia-qube-holdings-shares-jump-macquarie-takeover-deal.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108230648-1763941519081-gettyimages-2220275603-AUSTRALIA_MACQUARIE.jpeg?v=1763941533&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-24T02:40:09.000Z",
    "description": "The Macquarie Group Ltd. logo at the company's headquarters in Sydney, Australia, on Wednesday, June 18, 2025. Brent Lewin | Bloomberg | Getty Images ",
    "body": "The Macquarie Group Ltd. logo at the company's headquarters in Sydney, Australia, on Wednesday, June 18, 2025. Brent Lewin | Bloomberg | Getty Images  Australia's Qube Holdings announced on Monday that Macquarie Asset Management had submitted a non-binding proposal to acquire the logistics company at an enterprise value of 11.6 billion Australian dollars ($7.49 billion).Macquarie has offered to acquire Qube for AU$5.2 per share in cash, representing a nearly 28% premium to Qube's closing share price of AU$4.07 on Friday.Qube shares jumped over 20% to a record-high of AU$4.89 on Monday while Macquarie Group, the parent company of the asset management unit, saw its shares dip as much as 0.37% to AU$193.38. The takeover bid followed a period of negotiations after a lower unsolicited offer from Macquarie asset management earlier, Qube said in its filing, without specifying the exact value of the previous offer. Stock Chart IconStock chart iconQube share price The enterprise value represents about 14.4 times Qube's earnings before interest, taxes, depreciation and amortization, or EBITDA, for financial year 2025, according to the filing. Enterprise value typically measures a company's total value, comprising its market capitalization and the cost to pay off its debt, minus cash. Qube's operations mostly involve container leasing, car and grain cargo terminals and road and rail transport services. The deal is subject to a \"satisfactory completion\" of due diligence on Qube and its operations, final approval from both companies' boards and regulatory approvals.Qube said it has entered into an exclusivity deed with Macquarie, during which the asset manager would have the opportunity to undertake due diligence until Feb. 1, 2026. \"We look forward to continuing to engage constructively in the best interests of our shareholders,\" Qube Chairman John Bevan said in the filing. In an emailed response Monday, a spokesperson for Macquarie Asset Management declined CNBC's request for comment.  Macquarie Asset Management currently manages almost AU$960 billion in assets globally across public and private markets with portfolio companies covering infrastructure, real estate and agriculture sectors. Following Qube's announcement, Samuel Seow, vice president and equity analyst at Citi Bank, reaffirmed his \"buy\" rating on the company, with a target price of AU$4.9. Seow flagged potential downside risks such as price competition in Australian logistics market and industrial action that may impact Qube's workforce.  The Qube-Macquarie proposed transaction comes at a times when the Australian logistics sector has seen heightened dealmaking activity, with major players seeking to expand their reach in the country. DP World, which operates terminals and warehouses at ports across Australia, earlier this year acquired Silk Logistics for AU$175 million, taking over its landside warehousing and wharf cartage transportation business — operations that involves moving goods from ports to warehouses or other destinations.  Lindsay Australia in May acquired SRT Logistics, Tasmania's largest refrigerated supply chain operator,  for about $108 million, upping the ante in expanding its national cold chain footprint. That followed the acquisition of GJ Freight earlier this year as Lindsay seeks to expand its operations into Western Australia. Separately, Australia's BHP Group, the world's biggest miner, announced Monday that it was abandoning its pursuit of British mining company Anglo American, reversing its attempt at a reportedly $49 billion takeover of Anglo it initiated last year.     ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia's Qube Holdings' shares jump 20% as Macquarie proposes $7.5 billion takeover deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108230648-1763941519081-gettyimages-2220275603-AUSTRALIA_MACQUARIE.jpeg?v=1763941533&w=1920&h=1080"
      ],
      "datePublished": "2025-11-24T02:40:09.000Z",
      "dateModified": "2025-11-24T02:40:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americans are holding onto devices longer than ever and it's costing the economy",
    "url": "https://www.cnbc.com/2025/11/23/how-device-hoarding-by-americans-is-costing-economy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218921-1761766241173-gettyimages-1347665653-relax-home-photo-lucy-lambriex-zie-binnenzijde-3878.jpeg?v=1761766254&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-24T01:57:57.000Z",
    "description": "If you are holding onto your aging printer or cracked smartphone longer than you had planned, you are not alone.Heather Mitchell, 69, retired and livi",
    "body": "If you are holding onto your aging printer or cracked smartphone longer than you had planned, you are not alone.Heather Mitchell, 69, retired and living in Tucson, Arizona, is content with her phone even though it is old by smartphone standards.\"My Samsung Galaxy A71 is six-years-old. It's hanging in there surprisingly well for a jalopy. I've had issues with it, and still do, but they are minor,\" said Mitchell. \"I love Samsung phones, but can not afford a new one right now. A new phone would be a luxury.\"The average American now holds onto their smartphone for 29 months, according to a recent survey by Reviews.org, and that cycle is getting longer. The average was around 22 months in 2016.While squeezing as much life out of your device as possible may save money in the short run, especially amid widespread fears about the strength of the consumer and job market, it might cost the economy in the long run, especially when device hoarding occurs at the level of corporations. Research released by the Federal Reserve last month concludes that each additional year companies delay upgrading equipment results in a productivity decline of about one-third of a percent, with investment patterns accounting for approximately 55% of productivity gaps between advanced economies. The good news: businesses in the U.S. are generally quicker to reinvest in replacing aging equipment. The Federal Reserve report shows that if European productivity had matched U.S. investment patterns starting in 2000, the productivity gap between the U.S and European economic heavyweights would have been reduced by 29 percent for the U.K., 35 percent for France, and 101% for Germany.Experts agree lost productivity and inefficiency are the unintended consequences of people and businesses clinging to aging technology.\"Think about how much internet speeds have changed in the past decade or more. In the 2010s, 100MB speeds were considered high speed and very good. A short 10 years later and we're operating at 1GB speeds, which is roughly 10 times faster,\" said Cassandra Cummings, CEO of New Jersey-based electronics design company Thomas Instrumentation. Operating at higher GB speeds requires different electronic hardware, and a lot of the older technology can't handle it.\"Those devices were engineered when no one could fathom speeds that much faster would be mainstream,\" Cummings said. That can be a drain on nationwide networks as well.\"Both the cellular and internet infrastructure has to operate to be backwards compatible in order to support the older, slower devices. Networks often have to throttle back their speeds in order to accommodate the slowest device,\" Cummings said.  \"Often entire sections of networks or company internal networks are running slower than they would if all devices were up to the newer standards,\" she added.Cummings doesn't deny that staying up to date with new devices and hardware is expensive.\"Many companies, especially small businesses, and individual people can't afford to constantly upgrade to the latest and greatest devices,\" she said.To ease the transition to new technologies, she says there should be designs that are repairable or modular rather than the constant purge and replace cycles. \"So perhaps future devices can have a partial upgrade in say ethernet communications rather than forcing someone to purchase an entirely new computer or device,\" Cummings said. \"I'm not a fan of the throw-away culture we have these days. It may help the economy to spend more and force upgrades, but does it really help people who are already struggling to pay bills?\" she said.Indeed, entrepreneurs in the device resale market see the longer-lived tech as a success story that can be improved upon. Steven Athwal, CEO of the UK-based The Big Phone Store — which specializes in refurbished phones — says devices longevity is not the problem. \"The issue is the lag. Businesses and individuals are trying to squeeze modern workloads out of old hardware, heavy processing, rendering, generation, and admin, and that creates a productivity drag. Things like slow processors, outdated software, and degraded batteries on older tech waste energy and morale,\" Athwal said.He adds that when people hold onto their phones or laptops for five or six years, the repair and refurbishment market becomes an active part of the economy. But right now, in both European, American, and global markets, too much of that happens in the shadows.\"It's unregulated, underreported, and underutilized. If governments and big tech supported refurbishment properly, aging devices could become part of a sustainable circular economy,\" Athwal said, improving the second-hand cycle by extending software support, improving access to parts, and treating repair as infrastructure.\"That's how you disable constant replacement. No need to constantly push upgrades, which financially strains both small and large businesses alike,\" Athwal said.Still, some device manufacturers have found ways to entice consumers to ditch their older phones for newer ones. For instance, Apple just had one of its most successful new launches with the iPhone 17, and artificial intelligence could be a game-changer. Najiba Benabess, dean of the business school at Neumann University, says rising prices and sustainability concerns are among reasons \"America's gadgets are aging out,\" but the market should be focused on slowing productivity, increasing repair and maintenance expenses, and limited access to software updates and efficiency gains.\"Small businesses, in particular, lose valuable hours each year due to lagging systems, creating what economists call a 'productivity drag,'\" Benabess said. On a national scale, this translates to billions of dollars in lost output and reduced innovation. \"While keeping devices longer may seem financially or environmentally responsible, the hidden cost is a quieter erosion of economic dynamism and competitiveness,\" she added.Most people still want the newest and most up-to-date phones and tablets, according to Jason Kornweiss, senior vice president of advisory services at Diversified, a global technology solutions provider, but research does show a widening gap between businesses and individuals when it comes to aging devices. \"Corporations with hundreds or thousands of people are not investing at the same rate,\" Kornweiss said, adding that technology is changing so fast IT departments can't keep up with the pace and that bloated corporations need to vet the newest technology, which takes time, and by the time they do the vetting, something new has arrived anyway. The result: businesses with increasingly long-in-the-tooth technology.\"Businesses establish shelf-life that is multi-year. Employees look at replacing devices within an organization as too tedious and people cringe when the IT department comes with a new device,\" Kornweiss said, even when it is a meaningful upgrade, he added.The price to the organization is then paid in lack of productivity, inability to multitask and innovate, and needless, additional hours of work that stack up. Workplace research conducted by Diversified last year found that 24% of employees work late or overtime due to aging technology issues, while 88% of employees report that inadequate workplace technology stifles innovation. Kornweiss says he doesn't expect there's been any improvement in those numbers over the past year. There's a disconnect between the numbers and behavior. Many workers report that aging devices stifle productivity, but like a favorite pair of shoes or an old sweater, they don't want to give them up to learn the intricacies of a new device (which they'll learn and then have to replace with another). Familiarity can trump productivity for many workers. But the result of that IT clinginess is felt in the bottom line.\"Productivity is hampered and it all has a tangible impact on the economics,\" Kornweiss said. The biggest commodity a worker has is time, he says, and older devices gobble that up. Bring-your-own-device (BYOD) policies can be a savior for businesses slow to upgrade, with individuals using their own more functional devices easily able to integrate into most workplace systems these days, Kornweiss said. Another option for companies that don't want to buy a bunch of quickly dated devices is to lease.Kornweiss sees a future where technology continues to advance at warp speed and companies will continue to have trouble keeping up. And individuals like Heather Mitchell will continue to hang on to their devices.\"I tend to hang onto my phone until I have no choice in the matter. In 26 years, this is only my fifth phone,\" Mitchell said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americans are holding onto devices longer than ever and it's costing the economy",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218921-1761766241173-gettyimages-1347665653-relax-home-photo-lucy-lambriex-zie-binnenzijde-3878.jpeg?v=1761766254&w=1920&h=1080"
      ],
      "datePublished": "2025-11-24T01:57:57.000Z",
      "dateModified": "2025-11-24T01:57:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Figure AI sued by whistleblower who warned that startup's robots could 'fracture a human skull'",
    "url": "https://www.cnbc.com/2025/11/21/figure-ai-sued.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107379938-1709152661747-Figure_Image_4.jpg?v=1709153015&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-22T06:16:55.000Z",
    "description": "Startup Figure AI is developing general-purpose humanoid robots.Figure AIFigure AI, an Nvidia-backed developer of humanoid robots, was sued by the sta",
    "body": "Startup Figure AI is developing general-purpose humanoid robots.Figure AIFigure AI, an Nvidia-backed developer of humanoid robots, was sued by the startup's former head of product safety who alleged that he was wrongfully terminated after warning top executives that the company's robots \"were powerful enough to fracture a human skull.\"Robert Gruendel, a principal robotic safety engineer, is the plaintiff in the suit filed Friday in a federal court in the Northern District of California. Gruendel's attorneys describe their client as a whistleblower who was fired in September, days after lodging his \"most direct and documented safety complaints.\"The suit lands two months after Figure was valued at $39 billion in a funding round led by Parkway Venture Capital. That's a 15-fold increase in valuation from early 2024, when the company raised a round from investors including Jeff Bezos, Nvidia, and Microsoft.In the complaint, Gruendel's lawyers say the plaintiff warned Figure CEO Brett Adcock and Kyle Edelberg, chief engineer, about the robot's lethal capabilities, and said one \"had already carved a ¼-inch gash into a steel refrigerator door during a malfunction.\"The complaint also says Gruendel warned company leaders not to \"downgrade\" a \"safety road map\" that he had been asked to present to two prospective investors who ended up funding the company.Gruendel worried that a \"product safety plan which contributed to their decision to invest\" had been \"gutted\" the same month Figure closed the investment round, a move that \"could be interpreted as fraudulent,\" the suit says. The plaintiff's concerns were \"treated as obstacles, not obligations,\" and the company cited a \"vague 'change in business direction' as the pretext\" for his termination, according to the suit.Gruendel is seeking economic, compensatory and punitive damages and demanding a jury trial.A Figure spokesperson said in an emailed statement that Gruendel was \"terminated for poor performance,\" and that his \"allegations are falsehoods that Figure will thoroughly discredit in court.\"Robert Ottinger, Gruendel's attorney, told CNBC in a statement that, \"California law protects employees who report unsafe practices.\" \"This case involves important and emerging issues, and may be among the first whistleblower cases related to the safety of humanoid robots,\" Ottinger said. \"Mr. Gruendel looks forward to the judicial process exposing the clear danger this rush to market approach presents to the public.\"The humanoid robot market remains nascent today, with companies like Tesla and Boston Dynamics pursuing futuristic offerings, alongside Figure, while China's Unitree Robotics is preparing for an IPO. Morgan Stanley said in a report in May that adoption is \"likely to accelerate in the 2030s\" and could top $5 trillion by 2050.Read the filing here:watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Figure AI sued by whistleblower who warned that startup's robots could 'fracture a human skull'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107379938-1709152661747-Figure_Image_4.jpg?v=1709153015&w=1920&h=1080"
      ],
      "datePublished": "2025-11-22T06:16:55.000Z",
      "dateModified": "2025-11-22T06:16:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft faces uphill climb to turn enterprise dominance into widespread AI chatbot adoption",
    "url": "https://www.cnbc.com/2025/11/23/microsoft-faces-uphill-climb-to-win-in-ai-chatbots-with-copilot.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108166076-1751325646064-gettyimages-2150286124-AFP_34QG9T9.jpeg?v=1763774719&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-23T16:41:58.000Z",
    "description": "Microsoft CEO Satya Nadella speaks at Microsoft Build AI Day in Jakarta, Indonesia, on April 30, 2024.Adek Berry | AFP | Getty ImagesOn Microsoft's ea",
    "body": "Microsoft CEO Satya Nadella speaks at Microsoft Build AI Day in Jakarta, Indonesia, on April 30, 2024.Adek Berry | AFP | Getty ImagesOn Microsoft's earnings call last month, CEO Satya Nadella boasted about the company's artificial intelligence products, and said over 150 million people are using its Copilot assistant for productivity, cybersecurity, coding and other endeavors.But conversations with IT buyers at Microsoft's Ignite conference in San Francisco this week highlighted some of the hurdles the company must overcome as it tries to sell its AI chatbot in the enterprise market.\"I know a lot of customers who are like, 'Yeah, I want 300 to go to zero,'\" said Adam Mansfield of consulting firm UpperEdge, referring to Copilot licenses. Mansfield, who helps companies negotiate Microsoft deals, said those clients are saying, \"I don't even want it.\"Microsoft started selling the commercial version of 365 Copilot two years ago for $30 per person per month, as an add-on to its broader productivity suite. The chatbot can answer a user's questions based on information stored in corporate systems and can run alongside Microsoft apps, summarizing email threads, creating formatted presentations and capturing key points from calls.Microsoft is competing in AI on multiple fronts, with its heftiest investment coming out of its Azure cloud infrastructure business. Alongside a $13 billion bet on OpenAI, Microsoft is the AI startup's key cloud provider. In October OpenAI announced a $250 billion commitment. Microsoft said revenue growth at Azure reached 40% in the latest quarter, topping the growth rate at Amazon Web Services and Google's cloud business. AI agents present a different challenge. Instead of paying for the infrastructure needed to run hefty workloads, customers are buying a new tool for their employees, and the return on that investment isn't yet clear, according to a number of clients and consultants interviewed by CNBC.  watch nowAdobe, Google, Salesforce, Workday and other vendors are also trying to sell agents to corporations, schools and governments, creating a crowded market for a still nascent technology. OpenAI and Anthropic not only have popular AI models but are increasingly catering to businesses with new services as well.Eon, a Sequoia-backed cloud backup startup, runs its software in Azure. CEO Ofir Ehrlich said Microsoft has broadened Azure's appeal for software developers and operations specialists. But the company isn't standardizing on Microsoft's AI software. It relies on AI coding tools from startups Cognition and Cursor and multiple AI assistants, said Ehrlich, who previously sold startup CloudEndure to Amazon.Google's Gemini has been making rapid advancements in the market. This week, the company debuted its latest model, Gemini 3, which it says will deliver better answers to more complex questions.\"We just had a massive 16,000-employee company move all their mail back to Google so they can leverage more Gemini,\" said Julian Hamood, founder of Microsoft partner TrustedTech.Microsoft declined to comment. More discounts?Hamood said one thing Microsoft could do is provide incentives to help companies and partners pay for data-cleaning projects that would make Copilot more valuable. Microsoft has offered some clients 50% off of the $30 list price for Copilot, he said. \"But they're starting to lean away from the Copilot discounts,\" Hamood said.Tim Crawford, a former IT executive who now advises chief information officers, said many customers aren't getting enough from Copilot to justify the cost. \"Am I getting $30 of value per user per month out of it?\" he said. \"The short answer is no, and that's what's been holding further adoption back.\"Starting in December, a Microsoft 365 Copilot Business tier will become available at $21 per person per month for organizations with up to 300 end users, the company announced at Ignite this week.It's not all doom and gloom for Copilot, as Microsoft still has an advantage with its expansive user base.Nadella said on the latest earnings call that \"more than 90% of the Fortune 500 now use Microsoft 365 Copilot,\" though he didn't provide an average number of users at those companies. He named five companies and a U.K. government department that each bought over 15,000 seats in the quarter, adding that most enterprise clients continued to come back for more.Land O'Lakes butter is displayed in a supermarket in New York on Feb. 15, 2017.Brendan Mcdermid | ReutersThis year, butter maker Land O'Lakes rolled out Microsoft 365 Copilot to all of its nearly 5,000 knowledge workers, after initially granting access to about 20% of them. A small number of employees also have Gemini subscriptions.Land O'Lakes has long relied on Microsoft software and now runs over 70% of its infrastructure in Azure, said Teddy Bekele, the company's technology chief, in an interview at Ignite.Software engineers at Land O'Lakes used the GitHub Copilot AI automated programming software to build custom project and portfolio management software, Bekele said, adding that the company stopped paying for an off-the-shelf product.Now Land O'Lakes is testing Oz, an assistant for retail agronomists who advise farmers. The company developed it with Microsoft Foundry software. Oz can save Land O'Lakes money as it replaces older applications, Bekele said.'Natural choice'Education publisher Pearson, meanwhile, has turned on Microsoft 365 Copilot for all of its 18,000 employees. The company uses Windows, Office and Azure products, as well as Amazon and Google cloud services, technology chief Dave Treat said at the conference. At Ignite, Pearson announced Communication Coach, an agent that will provide personalized learning recommendations through Copilot based on Teams calls, with help from OpenAI's GPT-4o mini model. \"Microsoft is dominant in the enterprise,\" Treat said. \"It was a natural choice if we're thinking about how to train people in communication in the workplace.\"Microsoft is also adding more models into the fold. On Tuesday, Microsoft said Anthropic is bringing its Claude Haiku 4.5, Opus 4.1 and Sonnet 4.5 to Microsoft Foundry. Anthropic committed to spend $30 billion on Azure.\"Before today, we didn't have access to all the models from Anthropic,\" Treat said. \"Now we do. That's a big improvement.\"Still, Mansfield said competition has intensified this year, and some companies have been more seriously evaluating alternatives to Microsoft's AI products.\"Microsoft is trying to catch up, quite honestly,\" Mansfield said. \"That's not what a monopoly typically has to do. They're not comfortable. Their sales reps actually now have to learn to sell.\"According to Microsoft, the technology is getting more traction internally. Around 70% of commercial sales, support and partner services workers now use Microsoft 365 Copilot daily, up from 20% a year ago, said Pam Maynard, the company's chief AI transformation officer. \"We've got the 30% daily active usage to get after,\" Maynard said in an interview. \"I do believe we'll get there, and it's just part of change management and helping people to develop that habit.\"WATCH: Microsoft CEO of commercial business on Anthropic, Nvidia partnershipwatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft faces uphill climb to turn enterprise dominance into widespread AI chatbot adoption",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108166076-1751325646064-gettyimages-2150286124-AFP_34QG9T9.jpeg?v=1763774719&w=1920&h=1080"
      ],
      "datePublished": "2025-11-23T16:41:58.000Z",
      "dateModified": "2025-11-23T16:41:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Activist Ananym Capital sees upside if Baker Hughes spins off its oilfield services business",
    "url": "https://www.cnbc.com/2025/11/22/activist-ananym-capital-sees-upside-if-baker-hughes-spins-off-oil-services-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/102806958-GettyImages-94946057rr.jpg?v=1763740756&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-22T13:08:14.000Z",
    "description": "An operator for Baker Hughes conducts a wireline survey on a Chesapeake Energy natural gas rig in the North Texas Barnett Shale near Burleson, Texas.M",
    "body": "An operator for Baker Hughes conducts a wireline survey on a Chesapeake Energy natural gas rig in the North Texas Barnett Shale near Burleson, Texas.Matt Nager | Getty ImagesCompany: Baker Hughes (BKR)Business: Baker Hughes is an energy technology company with a portfolio of technologies and services that span the energy and industrial value chain. The company operates in two segments: oilfield services and equipment and industrial and energy technology. The OFSE segment provides products and services for onshore and offshore oilfield operations across the lifecycle of a well, ranging from exploration, appraisal, and development, to production, rejuvenation, and decommissioning. OFSE is organized into four product lines: well construction; completions, intervention and seasurements; production solutions and subsea and surface pressure systems. The IET segment provides technology solutions and services for mechanical-drive, compression and power-generation applications across the energy industry, including oil and gas, liquefied natural gas operations, downstream refining and petrochemical markets, as well as lower carbon solutions to broader energy and industrial sectors.Stock Market Value: $47.84 billion ($48.48 per share)Activist: Ananym Capital ManagementOwnership: n/aAverage Cost: n/aActivist Commentary: Ananym Capital Management is a New York-based activist investment firm which launched on Sept. 3, 2024, and is run by Charlie Penner (a former partner at JANA Partners and head of shareholder activism at Engine No. 1) and Alex Silver (a former partner and investment committee member at P2 Capital Partners). Ananym looks for high quality but undervalued companies, regardless of industry. They would prefer to work amicably with their portfolio companies but are willing to resort to a proxy fight as a last resort. According to their most recent 13F filing, they manage $260 million across 10 positions.What's happeningOn Oct. 21, Ananym Capital announced that they have taken a position in Baker Hughes and are calling on the company to spin out its oilfield services and equipment business, arguing such a step could help push up the stock price by at least 60%.Behind the scenesBaker Hughes is a leading provider of energy and industrial technology services. The company was formed through the 2017 merger of legacy Baker Hughes and GE Oil & Gas, combining best-in-class intellectual property shared by GE spinoff assets and the technical expertise from both organizations. The company operates through two primary segments: industrial and energy technologies and oilfield services and Equipment. The IET unit (55% of projected 2025 revenue and 60% of projected 2025 EBITDA) is a long-cycle industrial and energy business focused on gas technology equipment, including turbines and compressors, and aftermarket services, including new energy applications. The OFSE unit (45%/40%) is a short-cycle oilfield equipment and production services business with an end-to-end portfolio of oilfield services and equipment for well construction and production.Management has built up a strong track record of effective execution, and that success has been reflected in the share price, with the company delivering strong returns of 28.26%, 75.29% and 232.98% over the past 1-, 3- and 5-year periods, respectively. Within IET, the company has taken advantage of its leading position in LNG, in which Baker now has 95% global footprint for the turbomachinery required in plant construction, a market that is expected to grow at a 10% compound annual growth rate through 2030. Additionally, the company has a strong position in power generation, as Baker is one of few original equipment manufacturers supplying smaller-scale turbines and complete behind-the-meter power solutions. These offerings have allowed the company to play a pivotal role in helping to address rapidly growing data center demand, as its data center orders have gone from $0 to $550 million in just two quarters. As such, management is heavily investing in this opportunity — developing larger-scale power systems to support mega-data center deployments. Furthermore, Baker's pending acquisition of Chart Industries is expected to further strengthen IET's position in power, LNG, and industrials. As a result, IET is approaching a 20% EBITDA margin, with further margin expansion expected as the business mix continues to shift toward aftermarket services, which generate long-term recurring revenue streams supported by contracts exceeding 10 years and margins of 35% or more. For OFSE, management has taken steps to meaningfully improve the segment's earnings mix and reduce its cyclical commodity exposure. This includes exiting or downsizing non-core ventures and low-margin product lines, such as its surface pressure control joint venture with Cactus; prioritizing the Middle East and international markets (now 75% of OFSE revenue), which are less correlated to commodity prices; and implementing strong pricing discipline and cost cutting measures by enforcing minimum margin thresholds on new contracts, consolidating product lines and simplifying reporting. However, despite these efforts, OFSE remains highly subject to commodity volatility, affecting both the segment's performance and the company's overall valuation. Currently valued at about 9x EBITDA, Baker trades more closely with oilfield services peers (6–7x EBITDA), than its industrial and energy technology peers (16–18x), despite IET being the majority of the company's revenue and EBITDA. An implied sum-of-the-parts multiple for Baker would put the company at approximately 13x. It is for this reason that Ananym has launched a campaign at Baker calling for the company to either continue growing IET relative to OFSE or to pursue a sale or spin of OFSE. Ananym believes that a potential separation could result in an about 51% immediate upside through realizing Baker's sum of parts valuation, even when assuming $100 million dis-synergies from separation. Moreover, this upside does not reflect much of the potential long-term growth tailwinds and margin expansion expected from these ongoing operational initiatives — value drivers that shareholders should also be better positioned to realize through such a move.Founded in September 2024, this is Ananym's third public activist campaign. Knowing Charlie Penner and Alex Silver as we do, we would expect them to strive to work amicably with management to create value for shareholders. As such, they have already expressed full confidence in management to choose the optimal path forward, and the company's strong operational track record fully supports that confidence. Moreover, on Oct. 6, the company announced a review of its capital allocation, business, cost structure, and operations. With all signs pointing towards alignment between the two parties, we do not expect that they will insist on, or even ask for, board representation or continue to engage in much more of a public campaign. Rather, we expect them to work amicably with Baker behind the scenes to unlock meaningful shareholder value. However, this cooperative approach should not be confused for weakness, as they are fiduciaries to their own investors and will do whatever is necessary to create value at their portfolio companies. Thus, should management fail to act decisively, Ananym could quickly shift to a more assertive stance.Ken Squire is the founder and president of 13D Monitor, an institutional research service on shareholder activism, and the founder and portfolio manager of the 13D Activist Fund, a mutual fund that invests in a portfolio of activist investments.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Activist Ananym Capital sees upside if Baker Hughes spins off its oilfield services business",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/102806958-GettyImages-94946057rr.jpg?v=1763740756&w=1920&h=1080"
      ],
      "datePublished": "2025-11-22T13:08:14.000Z",
      "dateModified": "2025-11-22T13:08:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump on Marjorie Taylor Greene's resignation: She 'went BAD'",
    "url": "https://www.cnbc.com/2025/11/22/trump-marjorie-taylor-greene-mtg-resigns.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107267762-16886733362023-07-06t195202z_444395525_rc2ux1afjbjz_rtrmadp_0_usa-congress-greene.jpeg?v=1688673415&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-22T15:50:23.000Z",
    "description": "U.S. Rep. Marjorie Taylor Greene (R-GA) salutes former U.S. President Donald Trump during a rally in Commerce, Georgia, U.S. March 26, 2022. Alyssa Po",
    "body": "U.S. Rep. Marjorie Taylor Greene (R-GA) salutes former U.S. President Donald Trump during a rally in Commerce, Georgia, U.S. March 26, 2022. Alyssa Pointer | ReutersPresident Donald Trump on Saturday reacted to Rep. Marjorie Taylor Greene's surprise resignation announcement, saying, \"Marjorie went BAD.\"Trump once again called the Georgia Republican a \"traitor,\" referencing Greene's alliance with Republican Rep. Tom Massie of Kentucky, who sponsored the bill demanding the release of the Jeffrey Epstein files by the Justice Department.Greene, who had been a close ally of Trump for years, cited backlash from the president over her advocacy for the bill in her statement, saying that her last day in the House of Representatives will be Jan. 5. \"Marjorie 'Traitor' Brown, because of PLUMMETING Poll Numbers, and not wanting to face a Primary Challenger with a strong Trump Endorsement (where she would have no chance of winning!), has decided to call it 'quits' \" Trump wrote early Saturday in a Truth Social post.\"Her relationship with the WORST Republican Congressman in decades, Tom Massie of Kentucky, also known as Rand Paul Jr. because he votes against the Republican Party (and really good legislation!), did not help her,\" Trump said.\"For some reason, primarily that I refused to return her never ending barrage of phone calls, Marjorie went BAD,\" he wrote.\"Nevertheless, I will always appreciate Marjorie, and thank her for her service to our Country.\"Trump had opposed the bill ordering the release of the Epstein files until the last minute. This week, the bill passed the House in a nearly unanimous vote and passed the Senate unanimously. The president then signed it into law.Trump spoke with NBC News later Saturday morning about Greene, saying, \"It's not going to be easy\" for her to have a future in Republican politics.\"I would like to see it,\" Trump told NBC.\"She's got to take a little rest,\" he said.\"I can patch up differences with anyone,\" Trump said when asked if he believes he can reconcile with Greene.Trump last week said he would support \"the right person\" if they challenged Greene in the Republican primary next year for her seat representing Georgia's 14th District.In her resignation statement on Friday night, Greene wrote, \"I have too much self respect and dignity, love my family too much, and do not want my sweet  district to have to endure a hurtful and hateful primary against me by the President we all fought for, only to fight and win my election while  Republicans will likely lose the midterms.\"\"And in turn, be expected to defend the President against impeachment after he hatefully  dumped tens of millions of dollars against me and tried to destroy me,\"  Greene said.\"I refuse to be a 'battered wife' hoping it all goes away and  gets better.\"\"Standing  up for American women who were raped at 14, trafficked and used by rich powerful men, should not result in me being called a traitor and  threatened by the President of the United States of America, whom I fought for.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump on Marjorie Taylor Greene's resignation: She 'went BAD'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107267762-16886733362023-07-06t195202z_444395525_rc2ux1afjbjz_rtrmadp_0_usa-congress-greene.jpeg?v=1688673415&w=1920&h=1080"
      ],
      "datePublished": "2025-11-22T15:50:23.000Z",
      "dateModified": "2025-11-22T15:50:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration unresponsive after containership fire, Port of Los Angeles chief says",
    "url": "https://www.cnbc.com/2025/11/23/trump-port-of-los-angeles-containership-fire.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108230632-1763935975422-PHOTO_1.jpg?v=1763936946&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-23T23:16:23.000Z",
    "description": "The head of the largest port in the United States said the Trump administration has not reached out to offer assistance following a fire that erupted ",
    "body": "The head of the largest port in the United States said the Trump administration has not reached out to offer assistance following a fire that erupted on a containership on Friday and continues to burn outside of the port.\"I have been trying to set up meetings with Trump cabinet officials and [U.S. Trade Representative Jamieson Greer] since the inauguration,\" Gene Seroka, executive director of the Port of Los Angeles, told CNBC on Sunday.The USTR, the Department of Transportation, and the Department of Commerce did not immediately respond to a request for comment.An electrical fire on a lower deck of the Ocean Network Express (ONE) containership One Henry Hudson started at 6:38 p.m. local time on Friday, according to the Los Angeles Fire Department. Shortly before 8 p.m., the LAFD said an explosion shook the vessel, knocking out power to lights and cranes.Nearby residents were ordered to shelter in place due to hazardous material on board. The shelter-in-place order was lifted on Saturday. All crew aboard the One Henry Hudson have been safely accounted for, according to a ONE spokesperson. Port chief Seroka said approximately 117 containers were physically damaged out of the 8,000 onboard the vessel. \"ONE is deeply concerned by this incident and is closely monitoring the situation. We thank first responders onsite and remain fully committed to supporting incident management and subsequent investigations,\" the ONE spokesperson said.On Saturday, the ship was moved four miles out to sea to prevent the fire from damaging the port infrastructure. The terminal then resumed operations.\"The vessel was around two-thirds full,\" Seroka said. \"Once all the hot spots are out, we need to assess how much of the cargo is lost due to the amount of water used to stop the fire.\"Data scientists from Vizion, which tracks containers on vessels in real time, said the containers on board the ship included machinery; auto parts for Toyota Motor; components for Caterpillar; fresh fruit; Nike footwear, additional footwear from unidentified brands for tennis shoes, apparel, and sports wear; iron and steel components for automaker Honda Motor; frozen beef for numerous shippers, including Hilton Food Solutions; and medical personal protective equipment, or PPE.Director Seroka said the faster the administration can push for cleanup, the sooner U.S. companies will know whether their cargo can be deemed a loss.\"I've been doing this job for 12 years,\" said Seroka. \"U.S. companies need to know the status of their freight. We are working as fast as we can, but we need the federal government to step in and move this along faster.\"Seroka said he has spoken with Wes Moore, the governor of Maryland. Moore's office connected Seroka with the executive overseeing the commission for the Francis Scott Key Bridge cleanup.\"I am reaching out to anyone I know,\" said Seroka. The U.S. Coast Guard is leading the salvage plan. A spokesperson with the joint information center of the U.S. Coast Guard in charge of the operation told CNBC the fire is contained and a fire boat is on hand for both fire suppression and cooling. Still, Seroka said, there has been no coordination on the federal level to handle the cleanup.\"We know when the Trump administration gets involved, things get done faster,\" he said. \"The Port of Los Angeles is the largest container port in the Western Hemisphere and the busiest in North America,\" stressed Seroka. \"The administration should be reaching out to us.\"\"Thankfully, our terminals are operating, but there is a loss of freight and a massive cleanup ahead of us,\" he said.The lack of coordination, or even contact, with Trump administration officials stands in stark contrast to his experience with previous administrations, Seroka said. \"I met with President [Joe Biden] three times during his presidency. I also met with [former Secretary of Transportation] Pete Buttigieg,\" he said. \"During the Obama administration, I met with [former Commerce Secretary] Penny Pritzker and [former Secretary of Labor] Thomas Perez.\" Seroka said he also had no contact with Trump administration officials during the president's first term, which was notable considering the family of Elaine Chao, his former Transportation Secretary, owns and operates New York-based global shipping company Foremost Group.Insurers say what makes the One Henry Hudson fire different is that it occurred at a berth in a U.S. port.\"Fires aboard container vessels are notoriously difficult to fight,\" said John Miklus, president of the American Institute of Marine Underwriters. Crews have limited firefighting training and resources aboard a vessel, he said, \"never mind conditions at sea of wind and waves.\"In this case, the vessel was at a calm shoreside berth, Miklus said, and you had trained, professional firefighters and fireboats on scene to battle the fire.\"Even with all of this support, it still took many hours to bring it under control,\" said Miklus.For maritime insurers, the problems posed by vessel fires are compounded by undeclared or misdeclared cargoes, such as Lithium-Ion batteries and other hazardous freight.These types of potentially dangerous materials were on board, Seroka confirmed.\"When they catch fire, you cannot put that fire out,\" Seroka said. \"This is one of the reasons why we moved the vessel out of the port.\"As the U.S. Coast Guard continues to work to put out the blaze, the need for federal administration officials to get involved in the cleanup has become critical.\"There are federally sanctioned jobs that are associated with the cleanup of the containership fire,\" Seroka said. \"We need the push by the Trump administration for them to hustle,\" he added, \"It will take time to clean this up once the fire is completely out.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration unresponsive after containership fire, Port of Los Angeles chief says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108230632-1763935975422-PHOTO_1.jpg?v=1763936946&w=1920&h=1080"
      ],
      "datePublished": "2025-11-23T23:16:23.000Z",
      "dateModified": "2025-11-23T23:16:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]