[
  {
    "title": "Worried about layoffs? Economists say the job market is cooling but 'not falling off a cliff'",
    "url": "https://www.cnbc.com/2025/11/07/-economists-say-job-market-is-cooling-but-not-falling-off-a-cliff.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222702-1762464339041-gettyimages-2202066593-generational_business-9785.jpeg?v=1762464351&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T17:48:12.000Z",
    "description": "A recent string of high-profile layoffs have taken up headlines and caused anxiety in the workforce.Companies announced 153,074 layoffs in October, ad",
    "body": "A recent string of high-profile layoffs have taken up headlines and caused anxiety in the workforce.Companies announced 153,074 layoffs in October, adding up to 1.1 million cut announcements for the year, according to outplacement firm Challenger, Gray & Christmas. That makes it the worst year for layoff notices since 2009, CNBC reported.But job experts say they're not in panic mode. Layoff news doesn't paint the whole picture of the job market. Private data around job openings, payrolls and employee sentiment show that hiring is cooling but \"not falling off a cliff,\" says Glassdoor chief economist Daniel Zhao.The Challenger monthly data can be volatile, for one, and layoff announcements haven't yet shown up in state-level weekly filings for unemployment benefits, which are still being released during the shutdown.\"I'm not alarmed,\" says Laura Ullrich, Indeed's director of economic research. The latest available data \"does not seem today to indicate that we're going into a high layoff period for the overall economy.\"Government shutdown and layoffs are hitting worker confidenceWhile economists aren't predicting a recession anytime soon, news of layoffs and the government shutdown is hitting worker confidence.The share of Glassdoor reviews mentioning layoffs is up 22% year-over-year as of October, according to data from the jobs site. Workers' confidence in the job market is down from a small rise in September and is close to a recent record-low set in June, according to Glassdoor data.Senior-level employees saw the biggest drops in confidence over the last year, dropping 4.6 percentage points since October 2024.That's concerning since leadership confidence spreads to other employees through hiring and investment plans. If senior leaders aren't confident their business is doing well, they could decide to reduce hiring or lay people off, Zhao says.Meanwhile, for those on the market, fewer people say they've gotten a job offer and declined it, signaling they have less leverage and might be settling for jobs rather than holding out for better ones, according to Glassdoor data.Health-care openings are making up for losses elsewhereMany workers are additionally competing for a smaller pool of opportunities. As of Oct. 31, job postings on Indeed are at their lowest level since 2021, continuing a declining trend for the last four years.Job postings are lowest in areas hit by the government shutdown, including Washington, D.C., and recent tech layoffs, like California and Washington.Openings are concentrated in health-care sectors, security and safety, and engineering, which on the whole are keeping the job market stable.\"I see it a tale of two economies,\" Ullrich says. \"There are certain fields where jobs are continuing to be added, and there's others that are shedding jobs.\"Health care and private education jobs have propped up the labor economy for some time: They make up about 17% of the jobs nationally but have accounted for 56% of job growth between July 2023 and July 2025.\"If health-care employment started dipping that would ring alarm bells for me,\" Ullrich says.The bigger picture: 'The job market is in a funk'Economists say available datasets can provide a pretty good picture of the job market, but official data from the Labor Department around hiring and unemployment are necessary for a best look at the health of the labor economy.The unemployment rate remained steady 4.3% in August, the last month of available government data.The Bureau of Labor Statistics missed another jobs report Friday due to the government shutdown. Economists surveyed by Dow Jones expect it would have shown a drop in 60,000 jobs and a rising unemployment rate to 4.5%, CNBC reported.The numbers we do have point overall to a continuously slowing job market. Economic uncertainty is weighing on employers' willingness to hire, Zhao says, meaning job-seekers are frozen out of the market and employed workers have less leverage to progress in their careers, win raises and stay engaged in the workplace.Hiring experts say building your network and asking for referrals are the best ways to get a job right now. To stand out in a competitive market, consider sharpening your resume to be outcomes-based, building your personal brand on LinkedIn and doing mock interviews, GrowthLoop senior recruiter Kathleen Nolan previously told CNBC Make It.\"Overall, I would say that the job market is in a funk right now,\" Zhao says. \"Even if unemployment is even [and] some of the top line indicators still point to a job market that is not historically bad, that doesn't necessarily mean that people are happy with where the job market is today.\"Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Worried about layoffs? Economists say the job market is cooling but 'not falling off a cliff'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222702-1762464339041-gettyimages-2202066593-generational_business-9785.jpeg?v=1762464351&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T17:48:12.000Z",
      "dateModified": "2025-11-07T17:48:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Food banks are in 'disaster response mode' due to shutdown and SNAP cuts, leaders say: 'The damage gets worse and worse' every day",
    "url": "https://www.cnbc.com/2025/11/07/food-banks-are-in-disaster-response-mode-due-to-shutdown-and-snap-cuts-leaders-say.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108220677-1762190343174-gettyimages-2244067612-AFP_82QF8ZK.jpeg?v=1762462431&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T16:55:28.000Z",
    "description": "\"Neighbors need food NOW,\" the homepage of Second Harvest Food Bank of South Louisiana reads.Amid uncertainty around SNAP funding, food banks across t",
    "body": "\"Neighbors need food NOW,\" the homepage of Second Harvest Food Bank of South Louisiana reads.Amid uncertainty around SNAP funding, food banks across the U.S. are scrambling to pick up the slack for the 42 million Americans who rely on the program for food assistance.SNAP payments have been paused since Nov. 1 due to the government shutdown. On Thursday, a federal judge ordered the Trump administration to restore full funding for the program by Nov. 7. The administration quickly appealed the ruling and on Friday sought an emergency block on the order.While the larger legal battle continues, several states have said that they've started to process full food stamp payments, the New York Times reports.CNBC Make It spoke with leaders at several food banks about how they're responding to the challenges caused by SNAP cuts and the government shutdown.Brian Greene, the president and CEO of Houston Food Bank, describes the situation as \"a rolling disaster.\"SNAP payments are typically distributed on a staggered monthly schedule in Texas, Greene says, which means that each day since the beginning of November, another 125,000 Texans run out of EBT funds.As the shutdown drags on, a growing number of furloughed federal workers in Houston are turning to food banks for assistance, Greene says.\"Every day that this keeps going, the damage gets worse and worse,\" he says.Facing 'a great increase in need'According to Leslie Bacho, CEO of Second Harvest of Silicon Valley, the effects of the SNAP disruption are already becoming clear.Within its service area of Santa Clara and San Mateo counties, more than 168,000 people rely on CalFresh, the state of California's version of SNAP, Bacho says.On Monday alone, over 1,500 unique users visited the bank's online food locator tool, which connects people to nearby food distribution sites, according to Bacho. That's nearly double the usual volume.Their hotline has also experienced a 200% increase in requests for referrals, she says.\"We're in the process of ordering additional food and really trying to ramp up for what we think will be a great increase in need,\" Bacho says.Jon Toups, the CEO of Second Harvest Food Bank of South Louisiana, says his organization was \"stretched thin\" even before the SNAP delays.The Louisiana legislature has stepped in to help provide reserve funds for SNAP users, he says, but USDA cuts earlier this year had already caused supply shortages for food banks.There's \"no question\" that there's been an uptick in demand for food assistance in the past week, Toups says, and \"we're seeing an awful lot of anxiousness.\"For every meal that food banks provide, SNAP provides nine, Toups says, creating an even larger chasm of need for banks to fill.\"The shutdown is putting an additional strain on the food bank network when we can least afford it,\" he says.How food banks are respondingAbout 425,000 Houston households rely on SNAP, Greene says, and in order to meet their typical level of need, Houston Food Bank would have to double its output.They're currently using all available resources — Greene gave the bank's procurement team the go-ahead to \"spend what [they] need to spend\" — in an effort to increase output by about 50%.Right now, Houston Food Bank is in \"disaster response mode,\" Greene says.They've set up special distribution sites specifically targeting federal employees and SNAP users in parking lots across the city, including at Houston's NRG Stadium.Houston residents line up in their cars for a special free food distribution by the Houston Food Bank at the NRG Stadium in Houston, Texas, on Nov. 1, 2025.Mark Felix | AFP | Getty ImagesIt costs around $15,000 to set up one of these \"supersites,\" according to Greene, and they're \"pulling in more volunteers and paying a lot of extra expenses,\" he says.At Second Harvest Food Bank South Louisiana, Toups requested to use a \"pretty significant\" amount of the bank's reserve funds to purchase more food, he says.He's also working to spread the word about the food bank's situation.\"Our community has really stepped up. We've seen an uptick in donations, not only financially speaking, but with their time, which is a huge piece for us,\" he says.Still, staff are \"overrun right now,\" he says: \"I almost feel like I'm asking them to work 24/7 right now to stay out in front of this.\"\"We will always do the best we can do,\" Toups says, but their current situation \"is not sustainable.\"Second Harvest Silicon Valley is in \"drop everything mode\" working to allocate 15% more food to each of their distribution sites, Bacho says.Crucially, while the charitable food system is already \"very, very strained,\" the last thing Bacho wants is for people in need to worry that banks will run out of food.\"Whether that involves going into our reserves, whether it involves raising more from our community or from our greater partnerships with our counties, we're going to do everything we can to meet that increase in need,\" she says.Still 'just at the beginning' of crisisBoth Toups and Greene liken the current situation to the aftermath of a natural disaster — but in those situations, \"the federal government was there to help,\" Greene says.\"In this case, the federal government is the cause, not the solution,\" he says.Right now, local giving is keeping many food banks and aid organizations afloat, according to Greene.\"If philanthropy holds up, we can keep doing this for quite some time,\" he says, but \"in a crisis, philanthropy shoots up, but it comes right back down.\"There are a few ways that people can support food banks right now, according to Toups.Primarily, food banks need monetary donations. That's the \"most efficient\" way to help, he says, \"because it allows me to actually use that money to go do exactly what's needed at that moment in time.\"Volunteers can also help food banks with tasks like sorting donations, packing boxes and distributing food, he says.At the end of the day, though, \"we've got to get back to some level of normalcy,\" Toups says.Right now, \"we're just at the beginning of this crisis,\" according to Bacho. As more days pass without SNAP funding, the demands on food banks will only increase, she says.\"We need this man-made problem in Washington, D.C. to resolve itself,\" Toups says.Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Food banks are in 'disaster response mode' due to shutdown and SNAP cuts, leaders say: 'The damage gets worse and worse' every day",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108220677-1762190343174-gettyimages-2244067612-AFP_82QF8ZK.jpeg?v=1762462431&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T16:55:28.000Z",
      "dateModified": "2025-11-07T16:55:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump CFPB takes aim at 15 states that ban medical debt on credit reports—it's 'salt in the wound,' says consumer advocate",
    "url": "https://www.cnbc.com/2025/11/07/trump-cfpb-aims-to-nix-laws-that-ban-medical-debt-on-credit-reports.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108221909-1762366840520-gettyimages-2227846342-r5c_0825.jpeg?v=1762366864&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T17:02:56.000Z",
    "description": "The administration of President Donald Trump is taking aim at state laws that ban the inclusion of medical debt on consumers' credit reports.In late O",
    "body": "The administration of President Donald Trump is taking aim at state laws that ban the inclusion of medical debt on consumers' credit reports.In late October, the Consumer Financial Protection Bureau released what's known as an interpretive rule, stating that laws prohibiting medical debt reporting in 15 states are preempted by the Fair Credit Reporting Act.Though the move is not legally binding, it marks an abrupt about-face from CFPB guidance during former President Joe Biden's administration, which allowed states to make their own credit rules as long as they weren't \"inconsistent\" with the federal law. A state requiring each credit agency to provide consumers with two free credit reports per year, for instance, would not be at odds with the FCRA, which requires one.Consumer credit advocates are sounding the alarm. Millions of Americans are already facing the possibility of rising health-care premiums, a reality that could force more people into medical debt, says Chi Chi Wu, a senior attorney at the National Consumer Law Center.Should medical debt protections fall, \"now we're going to make it even worse by ruining your credit record,\" Wu says. \"It's just insult to injury. It's rubbing salt in the wound.\"What's at stakeMedical debt is a major source of financial insecurity among U.S. consumers. Americans owed about $220 billion in medical debt, according to a 2024 analysis from the Kaiser Family Foundation, with around 14 million people owing a debt of more than $1,000 and 3 million people owing more than $10,000.The three major credit bureaus stopped reporting medical debts below $500 in April 2023. For the 15 states that have taken things a step further by banning any medical debt on credit reports, the rationale is simple, say Wu: Adding the data to credit reports is unnecessarily punitive.The CFPB declined to comment on the reasoning behind the guidance. But the previous iteration of the agency spelled out why it says medical debt reporting hurts consumers.\"People who get sick shouldn't have their financial future upended,\" former CFPB Director Rohit Chopra said earlier this year. Reporting the debt, he continued, \"has allowed debt collectors to abuse the credit reporting system to coerce people into paying medical bills they may not even owe.\"Essentially, allowing medical debt to appear on credit reports — whose related scores determine whether consumers can access credit or buy a home — puts the burden on consumers to navigate debt that is often sudden and difficult to understand.For proponents of including medical debt on credit reports, \"the argument is that the credit report is more accurate because there's more information, and you don't want to lend to someone who has a lot of medical debt,\" Wu says.But an April 2025 study from the National Bureau of Economic Research found that removing medical data from credit reports was \"unlikely to affect credit outcomes.\" That's generally because people who have high levels of medical debt often rack up other kinds of debt to pay for treatment, Wu says.\"If you really are financially struggling from your medical debts, if you started off with an even halfway decent credit score, the first thing that happens is your credit card balances run up,\" she says.In other words, credit issuers likely have all the information they need to determine your creditworthiness, simply by looking at your credit card usage, which makes up a huge part of your score. Adding medical debt to credit reports amounts to kicking consumers when they're down, says Wu.'It's up to judges, not the CFPB'Though the CFPB's interpretive rule is perhaps the first step on the administration's part to unravel medical debt reporting bans, the guidance itself isn't legally binding. Rather, those laws would have to be challenged in court, says Brad Lipton, a former general counsel for the CFPB whose name appears on the Biden-era guidance.\"It's ultimately up to judges, not the CFPB,\" he says. The recent guidance, just like the one it contradicts, are merely pieces of evidence for a judge to consider.In the meantime, the state bans \"haven't been super controversial,\" he says. The reason, he says, is that credit reporting of medical debt is not a big driver of payment of medical bills.\"If someone doesn't pay their medical debt, it's usually because they simply don't have the money,\" he says. \"The government and the system can torture them all they want, but you're just not going to get much money out of it. It's water from a stone.\"Want to level up your AI skills? Sign up for Smarter by CNBC Make It's new online course, How To Use AI To Communicate Better At Work. Get specific prompts to optimize emails, memos and presentations for tone, context and audience.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump CFPB takes aim at 15 states that ban medical debt on credit reports—it's 'salt in the wound,' says consumer advocate",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108221909-1762366840520-gettyimages-2227846342-r5c_0825.jpeg?v=1762366864&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T17:02:56.000Z",
      "dateModified": "2025-11-07T17:02:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump pardons New York baseball star Darryl Strawberry for tax evasion conviction",
    "url": "https://www.cnbc.com/2025/11/07/trump-pardons-darryl-strawberry-tax-evasion.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223154-1762539355136-gettyimages-2158172323-0dbacksmets0019.jpeg?v=1762539430&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T20:07:25.000Z",
    "description": "Darryl Strawberry former New York Mets speaks to the media before a ceremony to retire his jersey number before a game against the Arizona Diamondback",
    "body": "Darryl Strawberry former New York Mets speaks to the media before a ceremony to retire his jersey number before a game against the Arizona Diamondbacks at Citi Field on June 1, 2024 in New York City.Adam Hunger | Getty ImagesPresident Donald Trump pardoned Major League Baseball legend Darryl Strawberry, who had pleaded guilty to tax evasion three decades ago, the White House said Friday.Strawberry, 63, \"served time and paid back taxes\" after his conviction, a White House official said in a statement to CNBC.\"Following his career, Mr. Strawberry found faith in Christianity and has been sober for over a decade – he has become active in ministry and started a recovery center which still operates today,\" the official said.Strawberry is an eight-time MLB All-Star who helped take the New York Mets and the New York Yankees to World Series championships. He pleaded guilty in 1995 to one count of tax evasion for failing to report tens of thousands of dollars of income on his federal returns.Read more CNBC politics coverageDemocrats win big on Election Night in key racesZohran Mamdani wins New York City mayor's race, NBC News projectsDemocratic candidate Mikie Sherrill wins New Jersey governor's race, NBC News projectsDemocrats win Virginia governor, attorney general races, NBC News projectsSNAP update: Trump admin will pay 50% of food stamp benefits in November amid shutdownTrump says he has 'no idea who' Binance's CZ is after pardoning himTrump backtracks on attending Supreme Court tariffs case argumentsStrawberry, who dealt with substance abuse issues for years, was suspended from the MLB in 2000 after failing a drug test, effectively ending his career.Strawberry is the latest high-profile figure to receive clemency from Trump.Last month, the president commuted the prison sentence of disgraced former Republican Rep. George Santos, who had pleaded guilty to charges of wire fraud and aggravated identity theft.Days later, Trump pardoned Changpeng Zhao, founder of cryptocurrency exchange Binance, who had served four months in jail after pleading guilty to failing to address money laundering on the platform.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump pardons New York baseball star Darryl Strawberry for tax evasion conviction",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223154-1762539355136-gettyimages-2158172323-0dbacksmets0019.jpeg?v=1762539430&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T20:07:25.000Z",
      "dateModified": "2025-11-07T20:07:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Democratic leader offers deal to reopen government with 1-year ACA tax credit extension",
    "url": "https://www.cnbc.com/2025/11/07/government-shutdown-democrats-schumer-trump-aca.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108221428-1762545471446-108221428-17622930452025-11-04t214055z_1015663874_rc2wpha3q4l8_rtrmadp_0_usa-shutdown-1.jpg?v=1762545486&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T20:13:12.000Z",
    "description": "U.S. Senate Minority Leader Chuck Schumer (D-NY) speaks at a press conference following the weekly policy luncheon, more than a month into the ongoing",
    "body": "U.S. Senate Minority Leader Chuck Schumer (D-NY) speaks at a press conference following the weekly policy luncheon, more than a month into the ongoing U.S. government shutdown on Capitol Hill in Washington, D.C., U.S., Nov. 4, 2025.Annabelle Gordon | ReutersTop Senate Democrat Chuck Schumer on Friday offered a new plan to Republicans that would allow the U.S. government to reopen from a shutdown that began Oct. 1.Schumer's proposal calls for Democrats to agree to pass a so-called clean resolution that would provide short-term funding for government operations.In exchange, the New York lawmaker said, Republicans would agree to a one-year extension of existing enhanced tax credits that are used to reduce the cost of health insurance purchased on Affordable Care Act marketplaces.The other leg of the deal calls for the establishment of a bipartisan committee to continue negotiations on long-term reforms to address the issue of health-care affordability.Read more CNBC government shutdown coverageSNAP benefits: Trump admin seeks emergency block on order to pay food stamps in fullSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key races\"Democrats have said we must address the health care crisis, but Republicans have repeatedly said they won't negotiate to lower the health care costs until the government reopens,\" Schumer said on the Senate floor on Friday afternoon.\"So let's find a path to honor both positions,\" he said.This is breaking news. Please refresh for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Democratic leader offers deal to reopen government with 1-year ACA tax credit extension",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108221428-1762545471446-108221428-17622930452025-11-04t214055z_1015663874_rc2wpha3q4l8_rtrmadp_0_usa-shutdown-1.jpg?v=1762545486&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T20:13:12.000Z",
      "dateModified": "2025-11-07T20:13:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Big Tech's AI spending spree: Smart long-term bet or short-term risk?",
    "url": "https://www.cnbc.com/2025/11/07/big-techs-ai-spending-spree-smart-long-term-bet-or-short-term-risk.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222872-1762496615369-gettyimages-2168262416-AMAZON_WEB_SERVICES.jpeg?v=1762538692&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T18:20:24.000Z",
    "description": "In this Club Check-in, CNBC's Paulina Likos and Zev Fima break down big tech's massive artificial intelligence spending spree — debating whether these",
    "body": "In this Club Check-in, CNBC's Paulina Likos and Zev Fima break down big tech's massive artificial intelligence spending spree — debating whether these billion-dollar bets will drive long-term cost savings or weigh on near-term returns.Mega-cap tech companies are shelling out billions of dollars to build out AI infrastructure. The big question we're asking is whether all this heavy spending will eventually pay off in efficiency or if Wall Street is right to worry about how much they're burning through in the short term.Concerns about AI-stock valuations seeped into the market this week and slammed stocks.Many major tech companies —including the three biggest clouds, Amazon, Microsoft, and Alphabet's Google — raised capital expenditure guidance this earnings season, sparking both investor optimism and concern.Zev Fima, portfolio analyst for the Club, argued the spending is justified: \"Too much focus on the short-term is what leads to falling behind in the long term.\" CNBC reporter Paulina Likos pushed back, noting that \"investors haven't seen efficiency gains show up in returns yet.\"Watch the video above to see where the debate played out on whether AI investments are real productivity drivers or just expensive promises until proven otherwise.(See here for a full list of the stocks in Jim Cramer's Charitable Trust, the portfolio used by the CNBC Investing Club.)As a subscriber to the CNBC Investing Club with Jim Cramer, you will receive a trade alert before Jim makes a trade. Jim waits 45 minutes after sending a trade alert before buying or selling a stock in his charitable trust's portfolio. If Jim has talked about a stock on CNBC TV, he waits 72 hours after issuing the trade alert before executing the trade.THE ABOVE INVESTING CLUB INFORMATION IS SUBJECT TO OUR TERMS AND CONDITIONS AND PRIVACY POLICY, TOGETHER WITH OUR DISCLAIMER.  NO FIDUCIARY OBLIGATION OR DUTY EXISTS, OR IS CREATED, BY VIRTUE OF YOUR RECEIPT OF ANY INFORMATION PROVIDED IN CONNECTION WITH THE INVESTING CLUB.  NO SPECIFIC OUTCOME OR PROFIT IS GUARANTEED.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Big Tech's AI spending spree: Smart long-term bet or short-term risk?",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222872-1762496615369-gettyimages-2168262416-AMAZON_WEB_SERVICES.jpeg?v=1762538692&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T18:20:24.000Z",
      "dateModified": "2025-11-07T18:20:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SNAP benefits: Trump admin seeks emergency block on order to pay food stamps in full",
    "url": "https://www.cnbc.com/2025/11/07/snap-trump-appeals-food-stamps.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219610-1761852797382-gettyimages-2244208842-mms12981_qq3w7mya.jpeg?v=1761853016&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T19:30:28.000Z",
    "description": "An EBT sign is displayed on the window of a grocery store on Oct. 30, 2025 in the Flatbush neighborhood of the Brooklyn borough in New York City.Micha",
    "body": "An EBT sign is displayed on the window of a grocery store on Oct. 30, 2025 in the Flatbush neighborhood of the Brooklyn borough in New York City.Michael M. Santiago | Getty ImagesThe Trump administration asked a federal appeals court to issue an emergency block on a judge's order that it pay 42 million Americans their full SNAP benefits for November by Friday as the federal government shutdown persists.The administration requested that the 1st Circuit U.S. Court of Appeals allow it to pay 65% of the food stamp benefits this month from a contingency fund, as it proposed to the judge earlier this week.The move came a day after Judge Jack McConnell issued an order in U.S. District Court in Rhode Island rejecting the partial payment option.McConnell ordered that the U.S. Department of Agriculture use so-called Section 32 funds to help fully fund the SNAP benefits, along with the $4.65 billion it already planned to use from the contingency fund appropriated by Congress. The administration earlier had rejected the idea of using Section 32 funds for that purpose.In its filing Friday with the appeals court, the Trump administration said that the \"crisis\" of the lack of regular funding for full SNAP payments \"can only be solved by congressional action.\"Congress, since Oct.1, has repeatedly failed to pass a stopgap funding appropriation that would allow the government to reopen, and which would fully fund the Supplemental Nutrition Assistance Program, which helps feed about 1 out of every 8 Americans.Justice Department lawyers wrote in the filing that instead of Congress passing new SNAP funding, \"a single district judge has devised his own solution: ordering USDA to cover the SNAP shortfall by transferring billions of dollars that were appropriated for different, equally critical food-security programs —and to do so within just one business day (i.e., by today).\"\"This unprecedented injunction makes a mockery of the separation of powers,\" the lawyers wrote. \"Courts hold neither the power to appropriate nor the power to spend. Courts are charged with enforcing the law, but the law is explicit that SNAP benefits are subject to available appropriations.\"Plaintiffs in the case responded later Friday, urging the appeals court to deny the administration's request. The plaintiffs include a group of cities, charitable and faith-based nonprofit groups, unions, and business organizations, who in a lawsuit last week asked McConnell to order officials to fully pay SNAP benefits.The response said that the administration's purported rationale for not tapping funds from Child Nutrition programs is \"facially implausible.\" Those programs have \"$23 billion on hand and require only $3 billion per month to operate,\" the filing noted.\"Tapping Child Nutrition funds poses no realistic threat of leaving those programs underfunded,\" lawyers for the plaintiffs said in their response. \"The Administrative Procedure Act (APA) did not preclude the district court from entering a remedy for Defendants' arbitrary and pretextual refusal to provide full funding to provide relief for children and families who are going hungry today.\"\"Time is of the essence: the stay pending appeal and administrative stay should be denied.\"The administration last week said it planned to completely cease payments to SNAP recipients in November because there was no current funding appropriated for it.Read more CNBC government shutdown coverageSNAP benefits: Trump admin seeks emergency block on order to pay food stamps in fullSNAP benefits must be fully paid by Trump administration by Friday, judge ordersDC sandwich thrower Sean Dunn found not guilty of assaulting federal agentJudge dismisses criminal case against Boeing over Max crashes despite skepticismNancy Pelosi announces retirement from CongressTrump bashes Mamdani after Democrats sweep key electionsSupreme Court justices appear skeptical that Trump tariffs are legalCalifornia voters approve new U.S. House map to boost Democrats in 2026Democrats win big on election night in key racesPrior administrations have continued paying SNAP benefits during other shutdowns.On Oct. 31, McConnell ordered the administration to pay at least partial benefits from the contingency fund as soon as possible, and to investigate whether other funds could be used to help pay for the full benefits.The administration on Monday told McConnell it would pay 50% of SNAP benefits for November by using the contingency money, but said it would not use other funds. On Wednesday, the administration told the judge that a review of the contingency funds available meant that 65% of the benefits could be paid.Plaintiffs in the case said that was not acceptable and asked McConnell to order that full benefits be paid.McConnell agreed, telling administration lawyers at a hearing on Thursday, \"People have gone without for too long.\"\"The evidence shows that people will go hungry, food pantries will be overburdened, and needless suffering will occur\" if SNAP is not fully funded, the judge said.\"While the President of the United States professes a commitment to helping those it serves, the government's actions tell a different story,\" McConnell wrote in a subsequent written order.This is developing news. Please refresh for updates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SNAP benefits: Trump admin seeks emergency block on order to pay food stamps in full",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219610-1761852797382-gettyimages-2244208842-mms12981_qq3w7mya.jpeg?v=1761853016&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T19:30:28.000Z",
      "dateModified": "2025-11-07T19:30:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ford reportedly considers ending production of all-electric F-150 Lightning",
    "url": "https://www.cnbc.com/2025/11/06/ford-f-150-lightning-ev.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108134071-1745250066122-NYIAS_DeVries_04162025-7.jpg?v=1745250419&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T15:51:32.000Z",
    "description": "The Ford Lightning is seen at the New York International Auto Show on April 16, 2025.Danielle DeVries | CNBCDETROIT — Ford Motor is reportedly conside",
    "body": "The Ford Lightning is seen at the New York International Auto Show on April 16, 2025.Danielle DeVries | CNBCDETROIT — Ford Motor is reportedly considering ending production of its all-electric F-150 Lightning pickup truck amid mounting losses and more challenging market conditions for EVs.The Wall Street Journal first reported the talks Thursday, adding they are ongoing and nothing has been finalized. A source familiar with Ford's product strategy who spoke anonymously because the talks were private confirmed to CNBC that the automaker has been evaluating its future EVs amid the company's losses and changing market conditions.\"What I can say is that F-150 Lightning is the best-selling electric pickup truck in the U.S. — despite new competition from CyberTruck, Chevy, GMC, Hummer and Rivian — and delivered record sales in Q3. Right now, we're focused on producing F-150 ICE and Hybrid as we recover from the fire at Novelis,\" a Ford spokesman said in an emailed statement Thursday, declining to comment on the discussions.Ford previously confirmed it paused production of the Lightning amid supply chain disruptions related to a fire at an aluminum plant for Novelis, a main supplier for the pickup truck.Ford President Kumar Galhotra, when asked last month by media about Lightning production potentially ending, said the company's main priority was gas-powered models. He said F-150 Lightning production could restart whenever the company would like but declined to give a timeframe.The F-150 Lightning, which Ford once said was as important to the company as founder Henry Ford's Model T, never lived up to internal or external expectations. The pickup initially received more than 200,000 nonbinding reservations that failed to convert to sales.F-150 Lightning sales this year through October are roughly level compared with a year earlier at only 24,577 units. Since going on sale in 2022 in the U.S., Ford has sold less than 100,000 F-150 Lightning models.The Lightning is manufactured at a facility connected to a large F-150 production plant in metro Detroit.Ford's EV operations, including the Lightning, have lost the company billions of dollars annually in recent years.The U.S. EV market has faced daunting changes in regulations under the Trump administration this year, including the end of consumer credits of up to $7,500 for the purchase of an EV.The reported discussions at Ford follow crosstown rival Stellantis deciding to end plans to produce an all-electric Ram 1500 pickup as well as General Motors significantly scaling back its plans for electric trucks.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ford reportedly considers ending production of all-electric F-150 Lightning",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108134071-1745250066122-NYIAS_DeVries_04162025-7.jpg?v=1745250419&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T15:51:32.000Z",
      "dateModified": "2025-11-07T15:51:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "McDonald's U.S. boss puts focus on 'value and affordability' as consumer spending splits",
    "url": "https://www.cnbc.com/2025/11/06/mcdonalds-us-boss-memo-value-affordability.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108033257-1726151049326-gettyimages-2169763658-fd-trend-valuemeals.jpeg?v=1762524267&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T14:04:54.000Z",
    "description": "McDonald's Meal Deal photographed in Washington, D.C., on Aug. 26, 2024.Scott Suchman | The Washington Post | Getty ImagesMcDonald's leadership is urg",
    "body": "McDonald's Meal Deal photographed in Washington, D.C., on Aug. 26, 2024.Scott Suchman | The Washington Post | Getty ImagesMcDonald's leadership is urging operators to stay the course on value offerings as the competition for consumers plays out across the restaurant space.In a memo to U.S. operators following the company's third-quarter earnings, McDonald's U.S. President Joe Erlinger said the brand was \"moving in the right direction\" as it continues a more-than-yearlong push on value.\"Amid industry pressures, dynamic change, and aggressive competition, winning the fight for contracting traffic means staying customer-obsessed,\" Erlinger wrote in the memo, which was viewed by CNBC. The company did not immediately respond to request for comment.On Wednesday, McDonald's reported earnings per share and revenue that came in below Wall Street expectations, but its same-store sales were a bright spot, posting positive growth across all segments.U.S. same-store sales increased more than anticipated, up 2.4%, thanks to a boost from the $2.99 Snack Wrap launch and the introduction of its Extra Value Meals, which Erlinger said drew week-to-week growth.\"While we maintained a positive comp guest count gap, overall [guest counts] continue to decline-- underscoring the need for disciplined pricing, value, and affordability,\" he wrote in the memo.Erlinger said the company has \"the right plan in place\" and said it was poised for a strong fourth quarter, including the benefit of annual comparisons to last year's E. coli outbreak that dented burger sales.\"We still need to keep our foot on the gas-- staying focused on the customer and what we can control,\" he said.CEO Chris Kempczinski told analysts this week that the fast-food chain is seeing signs of a bifurcated consumer base among quick-service restaurants.He noted \"QSR traffic from lower-income consumers declining nearly double-digits in the third quarter, a trend that's persisted for nearly two years.\"In contrast, QSR traffic growth among higher-income consumers remains strong, increasing nearly double-digits in the quarter. We continue to remain cautious about the health of the consumer in the U.S. and our top international markets, and believe the pressures will continue well into 2026,\" he said.In a separate memo to global operators, Kempczinski said the brand will continue to focus on \"sharpening value leadership to meet evolving consumer expectations and increase traffic.\"He added McDonald's will be \"investing in high-potential menu categories-- especially Chicken and Beverages-- to stay competitive and drive growth.\"McDonald's is currently testing beverages in 500 restaurants across Wisconsin and Colorado that draw on learnings from its now-shuttered beverage concept, CosMc's.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "McDonald's U.S. boss puts focus on 'value and affordability' as consumer spending splits",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108033257-1726151049326-gettyimages-2169763658-fd-trend-valuemeals.jpeg?v=1762524267&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T14:04:54.000Z",
      "dateModified": "2025-11-07T14:04:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI valuation fears grip global investors as tech bubble concerns grow",
    "url": "https://www.cnbc.com/2025/11/07/ai-valuation-fears-grip-investors-as-tech-bubble-concerns-heighten.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107408458-1714508015525-gettyimages-1367372037-global-stockmarket-network-wave2.jpeg?v=1762509275&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T13:08:13.000Z",
    "description": "A trader works on the floor of the New York Stock Exchange on Oct. 30, 2025 in New York.         Angela Weiss | AFP | Getty ImagesThis week's equity m",
    "body": "A trader works on the floor of the New York Stock Exchange on Oct. 30, 2025 in New York.         Angela Weiss | AFP | Getty ImagesThis week's equity market wobble, which saw a retreat in U.S. artificial intelligence-related stocks amid ongoing concerns over stretched valuations, has thrust contagion fears into the spotlight for global investors.Goldman Sachs CEO David Solomon warned this week of a \"likely\" 10-20% drawdown in equity markets at some point within the next two years, while the International Monetary Fund and the Bank of England have both sounded the alarm bells.Bank of England Governor Andrew Bailey highlighted the possibilities of an AI bubble in an interview with CNBC on Thursday, noting that the \"very positive productivity contribution\" from technology companies could be offset by uncertainty around future earning streams in the sector.\"We have to be very alert to these risks,\" Bailey said.Legrand is one of several European companies which is benefitting from the AI boom. The French company, which sells products to Alphabet, Amazon and others to help cool servers, has seen its shares surge 37% this year, roughly as much as Nvidia.watch nowAnders Danielsson, CEO of Swedish construction group Skanska, which builds data centers and other AI infrastructure assets, shrugged off concerns about a slowdown.\"In the U.S. we have a very strong pipeline of data centers — we don't see any slowdown there,\" he told CNBC. \"We are working with large international customers and they are also interested in building data centers in central Europe, and in the Nordics and the U.K. We haven't seen any slowdown really.\"Meanwhile Kiran Ganesh, multi-asset strategist at UBS, highlighted a notable lack of volatility, adding that the broader narrative remains positive.\"We've had a remarkably smooth rally given the scale of investment that's taken place, given the uncertainty about future cash flows, and given some of those concerns about valuation,\" Ganesh told CNBC's \"Europe Early Edition\" on Friday.\"As we've gone through earnings season, I think it's reasonable to have expected some volatility, but actually when we look at the results, and they have been reassuring, we're still up over the course of earnings season and they have been beating expectations. So although some volatility has been materializing this week, we think that's to be expected and the bigger picture still remains positive.\"Read moreStill, many investors appear to be souring on the increasingly-stretched valuations.In Asia, shares of SoftBank Group — which is active across AI infrastructure, semiconductor and application companies — have fallen sharply, with the Japanese group suffering almost $50 billion in weekly losses. SoftBank resumed its downward trajectory on Friday, after dropping about 10% on Wednesday.On Tuesday, it emerged that Scion Asset Management, the hedge fund led by \"The Big Short\" investor Michael Burry, had built short positions against both Palantir Technologies and Nvidia, drawing the ire of Palantir CEO Alex Karp.\"Some big tech stocks are on sale, and are presenting buying opportunities for investors, especially for investors who have missed out on the market's strength over the past two months,\" said Glen Smith, chief investment officer at GDS Wealth Management.Other investors have flagged concentration risk in U.S. equities, and advocate looking further afield.Luca Paolini, chief strategist at Pictet Asset Management, said stretched valuations mean the firm is neutral on U.S. names. \"Emerging markets are preferred, with diversified exposure across India, Brazil, and broader EM benefiting from AI-driven investment and monetary easing,\" Paolini said in a market commentary.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI valuation fears grip global investors as tech bubble concerns grow",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107408458-1714508015525-gettyimages-1367372037-global-stockmarket-network-wave2.jpeg?v=1762509275&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T13:08:13.000Z",
      "dateModified": "2025-11-07T13:08:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shutdown means another missed jobs report Friday. Here's what it probably would have shown",
    "url": "https://www.cnbc.com/2025/11/07/shutdown-means-missed-jobs-report-friday-what-it-probably-would-have-shown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108221766-1762357058291-gettyimages-2238213483-US_JOBS.jpeg?v=1762357150&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T16:42:55.000Z",
    "description": "watch nowJobs Friday won't be happening again this week as the record-long government shutdown has resulted in a lack of official data on the labor ma",
    "body": "watch nowJobs Friday won't be happening again this week as the record-long government shutdown has resulted in a lack of official data on the labor market as well as a host of other important indicators.In the absence of critical data points, alternative data is the only game in town when it comes to measuring current conditions. In a nutshell, various metrics show the U.S. labor market appears to be plodding along, with a sharp slowdown in hiring and scattered signs of an increase in layoffs.Had the Bureau of Labor Statistics released its monthly nonfarm payrolls report for October, economists surveyed by Dow Jones expect it would have shown a decline of 60,000 jobs and an unemployment rate increase to 4.5%.Other data points collected over the past several weeks paint a broad mosaic of a weak, though not collapsing, labor market that policymakers are viewing with a wary eye.\"We're in an unusual environment, which is this low-hiring, low-firing, environment,\" Austan Goolsbee, president of the Federal Reserve Bank of Chicago, told CNBC in a Thursday interview. \"That characterizes periods of high uncertainty, when businesses have pulled back.\"Though the timing was a coincidence, the Chicago Fed in October unveiled its own menu of data indicators. An update Thursday showed little change in the unemployment rate, edging toward 4.4%, still a low number by historical standards, as well as layoffs and the hiring rate.Elsewhere, though, there are signs of potential trouble, though not of a systemically weak labor market.A look at alt dataHere's a quick glimpse at a handful of other metrics various data collectors have released recently:Payrolls processing firm ADP reported earlier this week that companies added just 42,000 jobs in October, a number that was better than expected but still demonstrated anemic hiring.Outplacement and consulting firm Challenger, Gray & Christmas reported 153,074 announced job cuts in October, the highest level for the month in 22 years.The Institute for Supply Manufacturing released its purchasing managers indexes for the manufacturing and services sectors this week, both indicating that more companies plan on holding staffing levels or cutting rather than adding workers. The employment index for ISM services was 48.2% while manufacturing came in at 46%. Though both were slightly higher on the month, any reading below 50% indicates contraction.Bank of America also has begun collecting its own employment data. The bank reported year-over-year payroll growth of 0.5% in October, unchanged from September. BofA data also showed a significant disparity in wage growth, with higher earners seeing year-over-year gains of 3.7%, middle earners at 2% but lower income rising only 1%. Overall, Bank of America said its data showed \"no significant slowdown\" for the labor market.Job search site Indeed's closely watched measure of job openings saw another drop as October ended, with its index slipping further last week to its lowest level since February 2021.Workplace management site Homebase indicated a further decline in small business employment, with its \"employees working\" indicator down 2.9% from its January level and hours worked off 2.9%.Small businesses hitThe Homebase data points to another trend, in which larger firms are continuing to add workers but smaller businesses have largely bowed out.\"The story now for 12 months has been one of small business conservatism, and I don't think that's changed in aggregate,\" Homebase CEO John Waldmann said in an interview. \"Businesses are choosing to have fewer people and have them work more hours. That generally is a conservative stance in how to operate a small business.\"The ADP numbers have showed a steady erosion in employment for smaller firms. Businesses employing fewer than 250 people lost 34,000 workers in October. On the year, businesses with fewer than 50 people have added 133,000 workers, but most of that came in earlier months.However, while there's only scant signs of growth, there are also few indicators of the aggressive layoffs that would signal a broader economic downturn.Though the Labor Department isn't aggregating weekly jobless claims data during the shutdown, state-level filings show a fairly steady pattern.A \"We Are Hiring\" sign at the Appalachian State University internship and job fair in Boone, North Carolina, US, on Wednesday, Oct. 1, 2025. Allison Joyce | Bloomberg | Getty ImagesGoldman Sachs estimates that claims would have totaled 228,000 last week, an increase of 9,000 but largely in line with recent trends.\"We're showing a cooling labor market ... but certainly not a collapsing labor market,\" added David Tinsley, senior economist at the Bank of America Institute. \"Some of this cool down we've seen in jobs growth is being borne particularly by small businesses.\"For policymakers like Goolsbee, the Chicago Fed president, the data also is suggestive of a fairly stable jobs picture.Alternative data is giving Fed officials at least a general look at the labor market while the government data blackout continues. However, there's not as much alt information on inflation, which is giving Goolsbee pause as he considers whether another interest rate cut would be appropriate or even necessary barring evidence of a deeper labor downturn.\"There's been a lot of stability in the job market. The unemployment rate is objectively low and the layoff rate is objectively low,\" he said. \"That'd be very unusual for the beginning of a recession.\"watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shutdown means another missed jobs report Friday. Here's what it probably would have shown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108221766-1762357058291-gettyimages-2238213483-US_JOBS.jpeg?v=1762357150&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T16:42:55.000Z",
      "dateModified": "2025-11-07T16:42:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tesla says shareholders approve Musk's $1 trillion pay plan with over 75% voting in favor",
    "url": "https://www.cnbc.com/2025/11/06/tesla-shareholders-musk-pay.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222736-1762470015629-Screenshot_2025-11-06_at_51201_PM.png?v=1762470059&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T13:05:47.000Z",
    "description": "watch nowTesla said shareholders voted in favor of CEO Elon Musk's almost $1 trillion pay plan, with 75% support among voting shares.Board members rec",
    "body": "watch nowTesla said shareholders voted in favor of CEO Elon Musk's almost $1 trillion pay plan, with 75% support among voting shares.Board members recommended shareholders approve the pay plan, which they introduced in September. Top proxy advisors Glass Lewis and ISS recommended voting against it.Results of the vote were announced on Thursday at the company's annual shareholders meeting in Austin, Texas.A separate proposal, submitted by an individual investor, Stephen Hawk, called for Tesla to be able to invest in xAI, Musk's artificial intelligence startup that was formed in March 2023 to compete with OpenAI. Brandon Ehrhart, general counsel at Tesla, said at the meeting that the company had \"received more votes in favor than we did in against,\" but that there were a number of abstentions and that Tesla is considering next steps.The pay package for Musk, already the world's richest person, consists of 12 tranches of shares to be granted if Tesla hits certain milestones over the next decade. It would also give Musk increased voting power over the company, acceding to demands that he's made publicly since early 2024. His ownership would increase from about 13% to 25%, adding more than 423 million shares to his holdings.The first tranche of stock gets paid out if Tesla hits a market capitalization of $2 trillion. Tesla's current market cap is $1.54 trillion. Awards tied to market cap gains are paired with operational achievements.The next nine tranches would be awarded if Tesla's value increases by increments of $500 billion, up to $6.5 trillion. Musk would earn the last two tranches if the market cap rises by increments of $1 trillion, meaning it would need to hit $8.5 trillion for Musk to get the full package.Elon Musk, CEO of Tesla, speaks during the 2025 Annual Shareholder Meeting on Nov. 6, 2025.Courtesy: TeslaTesla also laid out a series of earnings milestones for Musk, beginning with $50 billion in annual adjusted profit and moving up to $400 billion. In the third quarter, Tesla reported adjusted EBITDA of $4.2 billion.Other goals tied to the newly approved pay plan include reaching 20 million vehicle deliveries, 10 million active FSD (Full Self-Driving) subscriptions​, 1 million bots (Optimus humanoid robots) delivered and​ 1 million robotaxis in commercial operation. To date, Tesla has delivered more than 8 million vehicles, according to its September proxy statement.The proposed plan doesn't specify whether the FSD subscriptions must be purchased or could include free trials. Tesla currently provides partially automated driving systems, which it markets as \"FSD Supervised\" in the U.S. The company intends to improve its FSD Supervised systems so they don't require human supervision on board.At the meeting, Musk claimed that Optimus robots \"will eliminate poverty,\" \"give everyone amazing medical care,\" and will be \"bigger than cell phones, bigger than anything.\" He also said the robots could be used for \"containment of future crime\" by following criminals around and stopping them from \"doing crime.\"There's currently no Optimus robot on the market, and Musk didn't provide a target date for reaching those goals.Read more CNBC tech newsGoogle's decade-long bet on custom chips is turning into company's secret weapon in AI raceTesla says shareholders approve Musk's $1 trillion pay plan with over 75% voting in favorAltman says OpenAI will top $20 billion in annualized revenue this year, hundreds of billions by 2030Meta reportedly projected 10% of 2024 sales came from scam, fraud adsAs Reuters previously reported, Musk could still score tens of billions of dollars without meeting most of the targets laid out for him by the board, collecting more than $50 billion just by hitting a handful of the more attainable goals.There are also a list of \"covered events\" in the award terms that would allow Musk to earn shares without meeting the required operational milestones.Covered events include natural disasters, wars, pandemics, and changes to \"international, federal, state and local law, regulations or other governmental action or inaction,\" that could hamper the company's ability to design, manufacture or sell its products down the line.Shareholders voted on the new plan after the Delaware Court of Chancery ruled last year that Musk's earlier 2018 pay plan was improperly granted by the Tesla board and must be rescinded. Musk appealed that ruling and the matter will be decided by the Delaware State Supreme Court.In addition to leading Tesla, Musk runs xAI which has merged with X, leads SpaceX and its satellite internet business Starlink, and is a founder of brain computer interface company Neuralink and tunneling venture The Boring Company.He's also been heavily engaged in politics, most notably working to propel President Donald Trump back to the White House, and then leading a sweeping effort to slash the federal government at the beginning of his second term.The National Bureau of Economic Research published a paper last month estimating that Tesla sales from October 2022 through April of this year in the U.S. would have been 67% to 83% higher without Musk's \"polarizing and partisan actions.\"The newly approved pay plan puts no limits on Musk's political activity, and does not establish a minimum amount of time he must spend working at Tesla.WATCH: Tesla shareholders approve Musk's pay plan",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tesla says shareholders approve Musk's $1 trillion pay plan with over 75% voting in favor",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222736-1762470015629-Screenshot_2025-11-06_at_51201_PM.png?v=1762470059&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T13:05:47.000Z",
      "dateModified": "2025-11-07T13:05:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MP Materials CEO warns investors to approach suddenly hot rare earths industry with caution",
    "url": "https://www.cnbc.com/2025/11/07/mp-materials-rare-earth-critical-mineral-china-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108210771-17601212712020-04-22t000000z_1304876358_rc2n9g9qajlt_rtrmadp_0_usa-rareearths.jpeg?v=1760121307&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T14:32:37.000Z",
    "description": "watch nowPentagon-backed MP Materials warned investors this week to approach other rare earths projects with caution, pointing to the industry's diffi",
    "body": "watch nowPentagon-backed MP Materials warned investors this week to approach other rare earths projects with caution, pointing to the industry's difficult economics.Stocks of U.S. rare earth companies have had wild swings in recent months as investors have speculated that the Trump administration might strike more deals along the lines of its landmark agreement with MP. Smaller retail traders have gotten involved in the stocks with the VanEck Rare Earth and Strategic Metals ETF up 60% this year.The Defense Department in July took an equity stake in MP, set a price floor for the company, and inked an offtake agreement with the rare earth miner and magnet maker in an effort to roll back China's dominance of the industry.CEO James Litinsky said he didn't want \"people to get burned\" amid the speculation. Litinsky cautioned investors \"to just be very clear-eyed about what the actual structural economics are amidst all the excitement.\"\"The vast majority of projects being promoted today simply will not work at virtually any price,\" Litinksy said on the company's third-quarter earnings call Thursday evening.Stock Chart IconStock chart iconVanEck Rare Earth and Strategic Metals ETF, YTDMP views itself as \"America's national champion,\" Litinsky said. MP is the only active rare earth miner in the U.S. and has offtake agreements with Apple and General Motors in addition to the Pentagon.\"We have structural advantage because we're fully vertically integrated,\" the CEO said. \"We're years and billions ahead of others.\"It takes years for the best rare earth producers to ramp up and stabilize their output and economics \"despite what some promoters might suggest,\" Litinksy said. Australia's Lynas took about a decade and MP will reach normalized production in about three years from the start of commissioning, he said.watch nowThe White House is \"not ruling out other deals with equity stakes or price floors as we did with MP Materials, but that doesn't mean every initiative we take would be in the shape of the MP deal,\" a Trump administration official told CNBC in September.Litinsky described the rare earth industry as close to a \"structural oligopoly,\" a system where there are just a few major players. The government investing in a dozens of sites and businesses wouldn't necessarily set up a supply chain, he said.The Trump administration should continue to encourage private capital to flow into the industry through loans, grants and other support, Litinsky said. There is room for \"a lot of other players and supply\" but the market will require \"materially higher prices\" for the industry's structural challenges to change, he said.\"If X dollars of capital can stimulate two or three X in private capital, they should be doing that as much as possible,\" Litinsky said.The CEO indicated that he views MP as a forerunner that will help create the conditions for a broader market that is not dependent on China over time.\"In the very short term the administration has made sure that we have a successful national champion in MP,\" Litinsky said. \"We are going to sort of pave the path if you will to then figure out how there's much broader supply coming online.\"Rare earths are crucial for making magnets that are key inputs in U.S. weapons platforms, semiconductor manufacturing, electric vehicles, clean energy technology and consumer electronics. Beijing dominates the global supply chain and the U.S. is dependent on China for imports.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MP Materials CEO warns investors to approach suddenly hot rare earths industry with caution",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108210771-17601212712020-04-22t000000z_1304876358_rc2n9g9qajlt_rtrmadp_0_usa-rareearths.jpeg?v=1760121307&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T14:32:37.000Z",
      "dateModified": "2025-11-07T14:32:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Archer tanks 8% after air taxi maker sells additional 85 million shares, buys LA-area airport",
    "url": "https://www.cnbc.com/2025/11/07/archer-achr-stock-evtol-hawthorne.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108166393-1751382289791-2025-0228_social2.jpg?v=1751382404&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T20:06:34.000Z",
    "description": "Courtesy: Archer AviationArcher Aviation's stock plummeted 8% after a share sale overshadowed a narrower-than-expected third-quarter loss.The company ",
    "body": "Courtesy: Archer AviationArcher Aviation's stock plummeted 8% after a share sale overshadowed a narrower-than-expected third-quarter loss.The company posted a net loss $129.9 million, narrower than the FactSet estimate of a $178.6 million loss.However, Archer disclosed a $650 million stock offering for 81.25 million shares to support its $126 million acquisition of Hawthorne Airport in Los Angeles as a hub for air taxi operations there. Archer was chosen as the official air taxi provider for the 2028 Olympics in Los Angeles.The move would dilute the value of the stock for existing shareholders. The weighted average for Archer shares outstanding has grown to about 660.9 million from 397.5 million a year ago.Interest in electric aircraft makers has picked up in recent months as major players have edged closer to certification. Earlier this week, Beta Technologies went public on the NYSE.Read more CNBC tech newsGoogle's decade-long bet on custom chips is turning into company's secret weapon in AI raceTesla says shareholders approve Musk's $1 trillion pay plan with over 75% voting in favorAltman says OpenAI will top $20 billion in annualized revenue this year, hundreds of billions by 2030Meta reportedly projected 10% of 2024 sales came from scam, fraud adsArcher, like its competitors, is taking major steps toward achieving Federal Aviation Administration certification, a key approval needed to fly commercially.In September, Archer said its Midnight aircraft reached a record altitude of 7,000 feet. The milestone came about a month after the company achieved its longest piloted flight.Archer has bet big on building and deploying air taxis in the United Arab Emirates as competitor Joby Aviation teams up with Saudi Arabia.For the current quarter, Archer said it expects a loss between $110 million and $140 million for adjusted earnings before interest, taxes, depreciation and amortization, a loss of $125 million at the midpoint. Analysts expected an loss of $119.9 million, according to FactSet.Earlier this week, Joby Aviation reported a wider-than-expected third-quarter loss. Shares have slumped 20% over the last week, while Archer has lost nearly a third of its value. Both companies have more than doubled in value over the last year.Stock Chart IconStock chart iconArcher Aviation and Joby Aviation year-to-date stock chart.watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Archer tanks 8% after air taxi maker sells additional 85 million shares, buys LA-area airport",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108166393-1751382289791-2025-0228_social2.jpg?v=1751382404&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T20:06:34.000Z",
      "dateModified": "2025-11-07T20:06:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Block sinks 10% after weak third quarter results miss Wall Street estimates",
    "url": "https://www.cnbc.com/2025/11/07/block-stock-xyz-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108222313-1762435407455-gettyimages-2244298117-raa-blockink251103_np43x.jpeg?v=1762435422&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-07T16:27:37.000Z",
    "description": "watch nowBlock shares fell 10% Friday after weak third-quarter earnings fell short of Wall Street expectations and showed slowing profit growth for th",
    "body": "watch nowBlock shares fell 10% Friday after weak third-quarter earnings fell short of Wall Street expectations and showed slowing profit growth for the company's Square service.Here is how the company did compared with LSEG estimates:Earnings per share: 54 cents adjusted vs. 67 cents expectedRevenue: $6.11 billion vs. $6.31 billion expectedRevenue for the quarter was up 2% over last year. The Jack Dorsey-founded firm's shares have fallen 24% year to date.Square's gross payment volume was up 12% year over year, but gross profit growth for the point-of-sale service was only up 9% over a year ago, slowing from last quarter's 11%.The company attributed the slower growth to a processing partner change and lower-margin hardware sales.\"Our product and go-to-market strategies are working as we continued to gain profitable market share in our target verticals like food and beverage, with larger sellers, and outside the U.S.,\" Chief Financial Officer Amrita Ahuja said on the earnings call.Cash App's gross profit growth fared much better at $1.62 billion, increasing 24% over a year ago with 58 million monthly transacting active users. The strength was driven by the service's Cash App Borrow, Cash App Card, and Buy Now Pay Later.Read more CNBC tech newsGoogle's decade-long bet on custom chips is turning into company's secret weapon in AI raceTesla says shareholders approve Musk's $1 trillion pay plan with over 75% voting in favorAltman says OpenAI will top $20 billion in annualized revenue this year, hundreds of billions by 2030Meta reportedly projected 10% of 2024 sales came from scam, fraud adsMorgan Stanley analysts wrote that they were \"encouraged by the pace of credit expansion at Cash App\" and are focused on \"whether credit expansion will ultimately produce better inflows\" per active customer and increase direct deposit accounts.Ahuja said gross profit was a bright spot for Block, as the company reported $2.66 billion in gross profit growth, up 18% over the prior year. FactSet expected $2.60 billion in gross profit for the quarter.The company raised its full-year guidance to expect a $10.2 billion gross profit for 2025, increasing from last quarter's projection of $10.2 billion.Block reported net income of $461.54 million, or 74 cents per share, which was up significantly over a year ago when the company reported net income of $283.75 million, or 45 cents per share.Stock Chart IconStock chart iconBlock year-to-date stock chart.CNBC's MacKenzie Sigalos contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Block sinks 10% after weak third quarter results miss Wall Street estimates",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108222313-1762435407455-gettyimages-2244298117-raa-blockink251103_np43x.jpeg?v=1762435422&w=1920&h=1080"
      ],
      "datePublished": "2025-11-07T16:27:37.000Z",
      "dateModified": "2025-11-07T16:27:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]