[
  {
    "title": "AI is taking jobs — here’s Coursera CEO's No. 1 tip for grads to stay competitive",
    "url": "https://www.cnbc.com/2025/11/29/coursera-ceos-top-tips-for-grads-to-stay-competitive-as-ai-takes-jobs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232286-1764147921811-Greg_Hart_-_1_Chief_Executive_Officer_Coursera.jpg?v=1764148024&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-29T06:03:21.000Z",
    "description": "Greg Hart, President and CEO of CourseraCourseraWith entry-level jobs declining as employers continue to deploy AI, Coursera's CEO has shared his top ",
    "body": "Greg Hart, President and CEO of CourseraCourseraWith entry-level jobs declining as employers continue to deploy AI, Coursera's CEO has shared his top tips for graduates to stay competitive in the job market and stand out in interviews. Greg Hart, former technical advisor to Jeff Bezos at Amazon, became president and CEO of online learning platform Coursera in February 2025. He told CNBC Make It that in the age of AI, it's important for young people to pursue additional learning alongside a degree. \"The advice that I give to my sons... is one of the best things that you can do is to augment your university degree with micro credentials specifically,\" he said in the interview. Micro credentials are short courses that provide a certification for a specific skill or knowledge and they take less time to complete than a traditional degree or diploma. It's become increasingly important to supplement degrees with additional certifications, as graduate jobs are at risk of being replaced by AI, Hart said. Major firms have been laying off staff this year and have cited AI as part of the reason, from Amazon making 14,000 workers redundant as it bets on AI to Salesforce slashing 4,000 customer support roles saying AI can do 40% of the tasks at the company. \"Say you're a young person in university right now, you are generally going to get hired into your first job based primarily on the traits that they see in you.\"Greg HartPresident and CEO of CourseraMeanwhile, 62% of U.K. employers anticipate that junior, clerical, managerial and administrative roles will be the most likely be lost to AI, according to a recent survey of 2,019 senior HR professionals and decision makers by the Chartered Institute of Personnel and Development (CIPD.)Additionally, the U.K.'s Institute for Student Employers found in its annual Student Recruitment Survey that 1.2 million applications were submitted for just 17,000 graduate roles, highlighting the intense competition and the limited positions available to young people. \"They [micro credentials] demonstrate to employers that not only did you get whatever university degree you're studying, but you augmented that with something that is generally much more workforce focused,\" Coursera's Hart added. As AI dominates, many workers are pursuing upskilling opportunities with LinkedIn's Skills on the Rise report, earlier this year finding that AI literacy was the most popular skill that people were adding to their profiles. 'Hiring you for your traits' Hart explained that fresh graduates going into job interviews should highlight their personality and character traits alongside their experience. \"Say you're a young person in university right now, you are generally going to get hired into your first job based primarily on the traits that they see in you,\" Hart said. \"They're going to be assessing your mindset and your traits as a human being more than your experience, because by definition, you really don't have much experience and so they're not really hiring you for your experience, they're hiring you for your... personality traits.\" Hart outlined that \"one of the most important traits\" that employers want to hire for are \"people who are proactive and hard working and take initiative, who prove to be ready, learners.\" The best way to show these traits is having micro credentials alongside your degree, especially ones that are tailored to your field. For example, Hart encouraged his son, who is a finance major, to take an additional course on AI for finance. In fact, experts previously told CNBC Make It that workers who have been laid off as a result of AI should train themselves up on new skills including increasing AI literacy via short courses, rather than pursuing a new degree which would be more costly and time consuming. Having the dedication to pursue additional learning demonstrates that you will also bring those traits to the job, they told CNBC. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI is taking jobs — here’s Coursera CEO's No. 1 tip for grads to stay competitive",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232286-1764147921811-Greg_Hart_-_1_Chief_Executive_Officer_Coursera.jpg?v=1764148024&w=1920&h=1080"
      ],
      "datePublished": "2025-11-29T06:03:21.000Z",
      "dateModified": "2025-11-29T06:03:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Coffee hasn't been this expensive in decades—see how much prices have risen since 1985 in one chart",
    "url": "https://www.cnbc.com/2025/11/28/chart-how-much-coffee-prices-have-risen-since-1985.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232596-1764175769462-gettyimages-1469902811-dsc05727.jpeg?v=1764175839&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T14:30:01.000Z",
    "description": "Coffee prices were already rising following poor harvests last year when the U.S. added new tariffs on coffee imports in April. Those tariffs have sin",
    "body": "Coffee prices were already rising following poor harvests last year when the U.S. added new tariffs on coffee imports in April. Those tariffs have since been rolled back, but prices at grocery stores and cafés are still high, leaving many shoppers wondering why a simple cup of coffee costs so much.As of September, roasted coffee sold in stores cost about 41% more than it did 12 months prior, rising from an average of $6.47 to $9.14 per pound, according to the most recent Bureau of Labor Statistics data.While prices can swing by roughly a dollar within a year during volatile periods, the nearly $3 increase in the most recent BLS data is unusually steep — and consumers are taking notice.\"This is ridiculous,\" 52-year-old Chuck Smith said in a TikTok video in August in which he showed receipts for the 38.2-ounce tub of Maxwell House ground coffee he buys at his local Walmart in Indiana, which had nearly doubled in price to $21.44 in under a year.Smith says he filmed the clip spontaneously in the grocery aisle after noticing the price hike. \"It was just me in the moment,\" he told CNBC Make It, adding that the reaction \"captured what a lot of folks are feeling.\" Walmart and Kraft Heinz, the maker of Maxwell House, did not respond to requests for comment. Other brands, including Nespresso and Folgers, have also increased prices in the last year.Restaurant coffee prices have risen, too: The average cost of a regular cup increased from $3.46 to $3.57 in the year ending October 2025, according to restaurant and café price data tracked by menu software company Toast.What's behind the biggest coffee price spike in decadesThe run-up in average retail coffee prices has been the steepest and most sustained since BLS began tracking those prices in 1980, the data shows.Weather issues came first. Drought and heavy rain disrupted harvests in Brazil and Vietnam in 2024, tightening supply well before tariffs took effect.Coffee futures prices then climbed from roughly $2 a pound in May 2024 to a peak of $4 by April 2025, one of the steepest increases the market has seen in decades, according to Intercontinental Exchange data. Because futures serve as the benchmark for what importers and roasters pay for beans, sharp increases often lead to higher costs, which may eventually show up in retail prices.Tariffs are another factor. In April, the U.S. imposed new tariffs on coffee imports — 10% on key coffee-growing Latin American countries and about 20% for Asian growers, with Brazil hit hardest at 50%. Since then, grocery-store coffee prices have risen about 21%, according to consumer price index data.In mid-November, the White House rolled back most of the new coffee tariffs, eliminating duties for nearly all producing countries except Brazil, which retained a 40% tariff. Last week, the administration removed the remaining 40% duty on Brazilian coffee as well, effectively ending tariffs on coffee imports from almost all major exporters.Because retail prices typically lag wholesale costs, it may take time before any easing shows up on store shelves. Still, removing tariffs should eventually help take some pressure off prices, according to the National Coffee Association, an industry trade group.\"Significant coffee price inflation has occurred during the time tariffs have been in place,\" a spokesperson for NCA tells CNBC Make It. \"Removing tariffs on the world's leading coffee producing countries is expected to significantly decrease costs.\"Black Friday sale: Want to up your AI skills and be more productive? Get 25% off our most popular course of the year, How to Use AI to Be More Successful at Work, with coupon code GETSMART. Offer valid Nov. 17 through Dec. 5, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Coffee hasn't been this expensive in decades—see how much prices have risen since 1985 in one chart",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232596-1764175769462-gettyimages-1469902811-dsc05727.jpeg?v=1764175839&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T14:30:01.000Z",
      "dateModified": "2025-11-28T14:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Too many bosses want to be liked, but it's not a sign of good leadership, says Google exec",
    "url": "https://www.cnbc.com/2025/11/28/google-learning-exec-biggest-leadership-skill-people-struggle-with.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218224-1761686575204-gettyimages-2212050379-office_apr_25_00193.jpeg?v=1761686585&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T15:05:01.000Z",
    "description": "Being a great leader takes time and practice, and a growing share of workers are trying to get better at it.Search interest in the term \"leadership\" i",
    "body": "Being a great leader takes time and practice, and a growing share of workers are trying to get better at it.Search interest in the term \"leadership\" is at an all-time high, according to Google data, along with related terms like training, best practices, advice on how to lead a team and sources for professional development.The buzz likely stems from people wanting to lead during a time of rapid business changes due to remote and hybrid policies in offices, global politics, changing economic circumstances and the adoption of technology like AI, says Brian Glaser, Google's chief learning officer.Glaser has been a manager off and on for the last 20 years and leads the onboarding, training and leadership development for some 150,000 employees worldwide. As a leadership expert, Glaser tells CNBC Make It that people of all experience levels struggle with one main aspect of being a boss: delivering \"really effective feedback so that people are clear about where they stand.\"Instead, many managers shy away from critical or constructive feedback in the pursuit of being well liked.\"As a leader, being nice is great,\" Glaser says. That can lead you to be liked among your reports, but \"the name of the game is really to be respected.\"\"If you're not delivering the feedback, you may not get the kind of respect you need as a manager,\" he says. This can be tough for first-time managers or someone who's been promoted and is now overseeing the work of former peers.But teams can grow stagnant or repeat avoidable mistakes \"if you're only looking to tell people what's working and not necessarily delivering the hard stuff,\" Glaser says.Glaser's team is behind Google's latest People Management Essentials, a paid course available to the public that covers lessons from over a dozen Google bosses about what it takes to be an excellent leader.Some of the lessons about delivering solid feedback are inspired by sports psychology, Glaser says.\"We know the best athletes are the folks who receive constant feedback from their coaches about how they're performing, he says. Win or lose, \"every time they finish a game, they debrief, they talk about what worked and what didn't. We believe those same concepts can be applied to organizational life.\"Talking about areas for improvements helps ensure stronger performance outcomes in the future. Athletes including Super Bowl champ Tom Brady and Team USA Olympic gymnast Gabby Douglas have discussed that learning from mistakes and failures fueled their successes.In the workplace, meanwhile, telling a report that \"they need to improve can be challenging,\" Glaser says, \"but we know through good practice, managers can do this, and it really matters.\"Black Friday sale: Want to up your AI skills and be more productive? Get 25% off our most popular course of the year, How to Use AI to Be More Successful at Work, with coupon code GETSMART. Offer valid Nov. 17 through Dec. 5, 2025.DON'T MISS: How to use AI to be more productive and successful at workPlus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Too many bosses want to be liked, but it's not a sign of good leadership, says Google exec",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218224-1761686575204-gettyimages-2212050379-office_apr_25_00193.jpeg?v=1761686585&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T15:05:01.000Z",
      "dateModified": "2025-11-28T15:05:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Deepak Chopra's new AI companion puts decades of wisdom 'in your pocket,' he says",
    "url": "https://www.cnbc.com/2025/11/28/deepak-chopra-new-ai-companion-was-modeled-on-his-lifes-work.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108231070-1764004518791-gettyimages-2157982348-canneslions_240617_153740_rbord_vwhu7p7p.jpeg?v=1764004572&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T15:00:01.000Z",
    "description": "Bestselling author and wellness leader Deepak Chopra is optimistic about the possibilities of artificial intelligence. \"The thing is, AI is here to st",
    "body": "Bestselling author and wellness leader Deepak Chopra is optimistic about the possibilities of artificial intelligence. \"The thing is, AI is here to stay,\" he says. Chopra believes that while the technology can be harmful, it can also be beneficial when used very specifically for self-discovery. Chopra recommends using AI chatbots to get to know yourself better, suggesting questions like, \"What is my purpose?\" and \"How can I cultivate self-compassion?\"Chopra recently launched an online wellness platform that offers meditations, community discussion boards and live sessions led by Chopra himself. And he's bullish enough on AI to have created his very own Deepak Chopra chatbot. Unlike large language models such as Anthropic's Claude and Google's Gemini, Chopra's bot is what's called a small language model. Instead of training the bot on all of human knowledge, it's trained on Chopra's work, specifically.\"I've written 95 plus books,\" he says. \"I've done innumerable conferences. I have thousands of videos on YouTube and LinkedIn and Facebook and Instagram and TikTok. So I fed all that into my AI.\" Chopra platform subscribers pay $10 monthly, which includes chatbot access. Non-subscribers can pay from 50 cents per 30-minute session to $6 a month to use the bot.The thing is, AI is here to stay.Deepak ChopraAuthor, wellness guruUsers can choose from a series of existing prompts on subjects including success, relationships, sex and spirituality, or they can simply put in their own question. Answers come back in text format and can also be played out loud in Chopra's voice. But Chopra says the bot does have its limits: \"We will not be doing suicide prevention,\" he says. \"That's for professionals.\" Chopra's chatbot will not offer psychotherapy either, he says.Instead, Chopra says you can give the bot prompts like \"I haven't slept in five days, can you give me a meditation?\" or \"I'm having difficulty in my relationship because we're not communicating.\" \"Then, we give you guidelines,\" he says. Ultimately, Chopra says he wants people to cultivate empathy, compassion, joy and peace of mind, and that he wants to be a resource for users around the clock. \"You have me as your companion in your pocket all the time,\" he says.He adds that he wouldn't mind continuing to be a presence in his family's life. \"My grandchildren's grandchildren will be able to have a conversation with me long after I'm gone,\" he says.Black Friday sale: Want to up your AI skills and be more productive? Get 25% off our most popular course of the year, How to Use AI to Be More Successful at Work, with coupon code GETSMART. Offer valid Nov. 17 through Dec. 5, 2025.DON'T MISS: How to use AI to be more productive and successful at workPlus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Deepak Chopra's new AI companion puts decades of wisdom 'in your pocket,' he says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108231070-1764004518791-gettyimages-2157982348-canneslions_240617_153740_rbord_vwhu7p7p.jpeg?v=1764004572&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T15:00:01.000Z",
      "dateModified": "2025-11-28T15:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You may be able to save more money than you think, advisor says: 'You just have to go look for it'",
    "url": "https://www.cnbc.com/2025/11/28/how-to-reorganize-your-spending-to-save-money.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108232481-1764167642698-gettyimages-2232745437-diner_june25_08349.jpeg?v=1764167648&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T14:00:01.000Z",
    "description": "With the rising cost of groceries, rent and other essentials, having money to set aside and save can feel impossible. However, saving doesn't always r",
    "body": "With the rising cost of groceries, rent and other essentials, having money to set aside and save can feel impossible. However, saving doesn't always require more money — you might just need to reorganize what you already have, says Kashif Ahmed, a certified financial planner and lecturer at Suffolk University in Boston. Ahmed, who teaches a finance class to undergraduate students, says many of his students tell him they want to save more, but say they lack the funds to start. That tracks with national data: Nearly 75% of Gen Z adults reported having $1,000 or less saved, according to a Self Financial survey of over 2,000 adults in July. But often, \"the money is there, you just have to go look for it,\" Ahmed says. Here's where he recommends starting.How to reorganize your spendingAhmed's advice: Start by writing down every dollar you spend and sincerely looking at it.When looking through your list, ask yourself which expenses were absolutely necessary and which expenses were simply \"wants.\" For example, he says, do you really need two lattes a day or five different streaming services? Sometimes, it may be smart to bring in a third-party auditor — someone like a parent or friend who isn't emotionally invested in your purchases — who can identify places to cut spending and save instead. Even packing a meal instead of buying lunch once a week can be a great way to get started, Ahmed says. \"Financial security is absolutely possible,\" he says. \"It's all about discipline.\"It's OK to make fun purchasesSaving money doesn't necessarily mean you have to cut out all purchases that may bring joy or stick to a tight budget limited to essential items.Sometimes, a restrictive budget may even backfire on you, leading to periods of spending binges, Suze Orman, personal finance expert and host of the podcast \"Women & Money (and Everyone Smart Enough to Listen),\" told the Wall Street Journal in 2024.Instead, Orman said to try focusing on smaller, everyday decisions that can make you feel more in control of your spending. \"Just do one thing that might make you feel more secure,\" Orman said. \"Is that saving $10? Is that not going out to eat?\"Black Friday sale: Want to up your AI skills and be more productive? Get 25% off our most popular course of the year, How to Use AI to Be More Successful at Work, with coupon code GETSMART. Offer valid Nov. 17 through Dec. 5, 2025.Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life, and request to join our exclusive community on LinkedIn to connect with experts and peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You may be able to save more money than you think, advisor says: 'You just have to go look for it'",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108232481-1764167642698-gettyimages-2232745437-diner_june25_08349.jpeg?v=1764167648&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T14:00:01.000Z",
      "dateModified": "2025-11-28T14:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SEC investigates Jefferies over First Brands collapse, report says",
    "url": "https://www.cnbc.com/2025/11/27/sec-investigates-jefferies-over-first-brands-collapse-report-says.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108214446-1760996506866-gettyimages-2241909727-JEFFERIES_HQ.jpeg?v=1760996569&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T18:02:34.000Z",
    "description": "The Jefferies Financial Group Inc. headquarters in New York, US, on Monday, Oct. 20, 2025. Michael Nagle | Bloomberg | Getty ImagesThe U.S. Securities",
    "body": "The Jefferies Financial Group Inc. headquarters in New York, US, on Monday, Oct. 20, 2025. Michael Nagle | Bloomberg | Getty ImagesThe U.S. Securities and Exchange Commission is investigating Jefferies' relationship into bankrupt auto parts maker First Brands Group, The Financial Times reported Thursday. The newspaper, citing people with knowledge of the matter, said the regulator is looking into whether Jefferies gave investors enough information on its Point Bonita fund's exposure to the failed auto business. The inquiry into internal controls and potential conflicts within the bank is at an early stage, the report said. It's not clear whether it will result in any allegations of wrongdoing. Jefferies came under pressure last month after its exposure to First Brands — which collapsed under a series of complex debt agreements — raised fears of other bad loans on Wall Street. Stock Chart IconStock chart iconJefferies, ytd performanceShares of Jefferies are down more than 12% this quarter and 27% this year. When asked for comment, an SEC spokesperson said the agency \"does not comment on the existence or nonexistence of a possible investigation.\"Jefferies did not respond to CNBC's request for comment. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SEC investigates Jefferies over First Brands collapse, report says",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108214446-1760996506866-gettyimages-2241909727-JEFFERIES_HQ.jpeg?v=1760996569&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T18:02:34.000Z",
      "dateModified": "2025-11-27T18:02:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saba Capital activist Boaz Weinstein calls for removal of Baillie Gifford-run tech investment trust’s entire board",
    "url": "https://www.cnbc.com/2025/11/27/saba-capitals-boaz-weinstein-targets-baillie-gifford-run-tech-trust-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107416509-1715954534877-gettyimages-1258512789-BLOOMBERG_INVEST.jpeg?v=1764240097&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T09:10:08.000Z",
    "description": "Boaz Weinstein is calling for the removal of the entire board of a tech-focused fund managed by Baillie Gifford, in a bid to reverse what the activist",
    "body": "Boaz Weinstein is calling for the removal of the entire board of a tech-focused fund managed by Baillie Gifford, in a bid to reverse what the activist investor sees as \"unprecedented\" value destruction.In a letter to the Edinburgh Worldwide Investment Trust's board on Thursday, Weinstein — whose activist investment firm Saba Capital owns around 30% of shares in the trust — said the board has \"objectively and categorically failed\" to deliver the performance expected by shareholders.EWIT's portfolio comprises a global mix of smaller and emerging public and private companies focused on tech innovation and transformation, that target \"significant disruptive growth potential,\" according to the London-listed Baillie Gifford's website. Its holdings include Elon Musk's Space Exploration Technologies, or SpaceX, which makes up 8.4% of its portfolio.Weinstein said EWIT's net asset value is down 30.8% over the past five years, while its share price return has fallen 35%, having \"massively underperformed\" its self-selected benchmark, the FTSE All-Share Index, which is up 71.4% over the same period.That means the company's NAV return and share price performance ultimately lag the benchmark by more than 100% over the five-year period, Saba noted in the letter.Stock Chart IconStock chart iconEdinburgh Worldwide Investment Trust.\"The magnitude of this value destruction is unprecedented among peer U.K. equity investment trusts over this period,\" Weinstein wrote.Jonathan Simpson-Dent, chair of EWIT, expressed disappointment with Saba's open letter.He said EWIT's benchmark is the S&P Global Small Cap Index — not the FTSE All-Share Index cited in Weinstein's letter.\"It makes little sense to judge a global small-cap trust against a U.K. all-cap benchmark,\" Simpson-Dent said in a statement, adding that EWIT's NAV total return has been 17.5% to date, ahead of the S&P Global Small Cap Index's 4.8%. A Saba Capital spokesperson told CNBC: \"In its latest 2024 Annual Report, EWI compared company performance, specifically share price return, to the FTSE All-Share Index on page 79 citing it as 'a widely used measure of performance for UK listed companies'.\"The spokesperson said that EWI's share price return has underperformed the FTSE All-Share Index on a one-, three- and five-year period, and the S&P Global Small Cap Index on both a three- and five-year period, \"including by more than 60% over the five-year.\"'Constructive dialog'The trust's total assets stood at £847.15 million ($1.1 billion) as of Oct. 31. Weinstein is calling for a general meeting to appoint a new board composed solely of \"qualified, independent directors… committed to delivering long-term value for all shareholders.\"\"We remain profoundly frustrated by the board's prolonged inertia,\" the activist investor wrote in the letter on Thursday. \"We do not have faith in the current Board's ability to implement the necessary strategic changes.\"Simpson-Dent said EWIT's board will continue to seek \"constructive dialog\" with Weinstein toward an \"equitable and holistic\" solution, including return of capital. But he warned: \"While we are open to discuss Board composition with Saba, we would strongly reject any proposal to replace the entire Board and the ambiguity that would follow.\"He added: \"The company's actions over the last year have supported a tightly managed discount, currently 5.6%, significantly narrower than the Global Smaller Companies peer group weighted average discount of 10.9%.\"The move follows an earlier attempt by Saba last year to shake up the EWI trust's board, a bid which ultimately failed to win investor support.Weinstein — whose New York-based $6 billion hedge fund trades credit relative value opportunities — has built a number of positions across the U.K. investment trust space lately. Outlining two new bets at the annual Sohn London investment conference last week, he said there is \"a storm brewing\" in the U.K. investment trust sector where discounts have widened sharply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saba Capital activist Boaz Weinstein calls for removal of Baillie Gifford-run tech investment trust’s entire board",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107416509-1715954534877-gettyimages-1258512789-BLOOMBERG_INVEST.jpeg?v=1764240097&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T09:10:08.000Z",
      "dateModified": "2025-11-28T09:10:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says U.S. to 'permanently pause migration from all Third World Countries’ after DC shooting",
    "url": "https://www.cnbc.com/2025/11/28/trump-us-to-permanently-pause-migration-from-all-third-world-countries.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108233241-1764307695737-gettyimages-2248193614-AFP_86EZ9GB.jpeg?v=1764307790&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T06:34:10.000Z",
    "description": "U.S. President Donald Trump shows a printed photo during a call with service members from his Mar-a-Lago residence in Palm Beach, Florida, on Nov. 27,",
    "body": "U.S. President Donald Trump shows a printed photo during a call with service members from his Mar-a-Lago residence in Palm Beach, Florida, on Nov. 27, 2025, during the Thanksgiving holiday. US President Donald Trump said Thursday that Sarah Beckstrom, one of the two National Guard troops shot a day earlier near the White House, had died, while the other soldier was \"fighting for his life.\"Jim Watson | Afp | Getty ImagesU.S. President Donald Trump on Thursday announced sweeping plans to tighten immigration rules, including a suspension on migration from \"Third World Countries\" and cancellation of all federal benefits and subsidies to \"noncitizens\" in the country.In a pair of Truth Social posts late Thursday night, Trump said he would \"permanently pause migration from all Third World Countries to allow the U.S. system to fully recover,\" without specifying what would be considered a \"third world\" country. The term loosely referred to countries with higher poverty rates and economic instability.The president said he would also terminate \"millions\" of admissions under his predecessor Joe Biden and remove \"anyone who is not a net asset to the United States, or is incapable of loving our Country.\"Trump added he plans to end all federal benefits and subsidies for noncitizens, \"denaturalize migrants who undermine domestic tranquility,\" and deport any foreign national he described as a \"public charge, security risk, or non-compatible with Western Civilization.\"Read more CNBC politics coverageJudge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointmentSen. Mark Kelly faces Pentagon probe for video on refusing 'unlawful orders'Trump spoke with Chinese President XiBessent says no recession in 2026 but notes some sectors are challengedU.S. lawmakers say Rubio told Trump's Ukraine peace plan is Russia's 'wish list'His comments came after two National Guard members were shot near the White House on Wednesday, one of whom died from her injuries a day later. Investigators said the attack was carried out by an Afghan national.Hours after the shooting, U.S. Citizenship and Immigration Services director Joseph Edlow said in a post on X that the agency would review every immigrant holding a Green Card from a \"country of concern.\"The agency also announced the immediate and indefinite suspension of all immigration requests involving Afghan nationals.Trump has pursued an aggressive immigration agenda since returning to the White House earlier this year. In June, he announced a broad travel ban covering immigrants from 19 countries, including Afghanistan.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says U.S. to 'permanently pause migration from all Third World Countries’ after DC shooting",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108233241-1764307695737-gettyimages-2248193614-AFP_86EZ9GB.jpeg?v=1764307790&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T06:34:10.000Z",
      "dateModified": "2025-11-28T06:34:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eric Swalwell sues FHFA chief Pulte, alleging director used private information to attack Trump critics",
    "url": "https://www.cnbc.com/2025/11/26/swalwell-mortgage-fraud-lawsuit-fhfa-pulte-democrat-governor-bid.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106237343-1573479639092rts2h5cp.jpg?v=1573479741&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-26T19:26:35.000Z",
    "description": "Rep. Eric Swalwell (D-CA)Yuri Gripas | ReutersRep. Eric Swalwell, D-Calif., filed a 19-page lawsuit Tuesday in U.S. District Court in Washington, D.C.",
    "body": "Rep. Eric Swalwell (D-CA)Yuri Gripas | ReutersRep. Eric Swalwell, D-Calif., filed a 19-page lawsuit Tuesday in U.S. District Court in Washington, D.C., alleging Federal Housing Finance Agency Director Bill Pulte abused his authority to make \"fanciful\" mortgage fraud allegations against him and other critics of President Donald Trump.The lawsuit asks the court to declare Pulte's conduct unlawful, order him and the FHFA to withdraw a criminal mortgage fraud referral, and award damages for violations of federal privacy law.Swalwell — who announced Friday that he is running for governor of California — alleges in the complaint that Pulte improperly accessed and leaked his private mortgage records in retaliation for his political speech, violating both the Privacy Act of 1974 and the First Amendment.\"Director Pulte has combed through private records of political opponents to silence them,\" Swalwell posted in a statement on X.The suit alleges Pulte's referral of the matter to the Justice Department was \"patently false,\" noting that Swalwell had sworn in an affidavit that his Washington, D.C., home would be his wife's primary residence and that he remained a California resident.Swalwell's lawyers note in the filing that the disclosures landed just as Swalwell prepared to launch his gubernatorial bid. The leak of Pulte's referral letter to the media occurred \"with remarkable speed,\" the suit states, followed by conservative commentators posting details about his home where his wife and children live, activity Swalwell's suit says increased security risks for his family.The filing casts Pulte's actions as part of a broader effort by the Trump administration to use federal agencies and the courts against political opponents. Swalwell, a seven-term congressman and former House impeachment manager during Trump's second impeachment, has long been one of the most vocal critics of the president. \"Pulte's brazen practice of obtaining confidential mortgage records from Fannie Mae and/or Freddie Mac and then using them as a basis for referring individual homeowners to DOJ for prosecution is unprecedented and unlawful,\" the lawsuit argues. In recent months, Pulte has issued similar criminal referrals to Swalwell's to other Trump critics, among them New York Attorney General Letitia James, Sen. Adam Schiff, D-Calif., and Federal Reserve Governor Lisa Cook. James' indictment was dismissed by a federal judge Monday while Schiff faces an ongoing probe though has not been charged. Cook also has not been charged, though Trump cited the criminal referral as cause in his attempt to fire her from the board of governors for the Federal Reserve in August. The firing is currently on hold pending a Supreme Court review.Pulte defended his agency's criminal referral of Cook to CNBC in August, saying it wasn't politically motivated. \"We make referrals almost every day. Lisa Cook happened to be one of them,\" he said.In an interview with \"Squawk Box\" in September, Pulte refused to tell host Andrew Ross Sorkin where the tip came from.\"I'm not going to explain our sources and methods, where we get tips from, who are whistleblowers,\" Pulte said.Swalwell's lawsuit says no comparable FHFA criminal referrals have been made against Trump allies. There is evidence that top Trump officials like Treasury Secretary Scott Bessent made mortgage claims similar to ones Trump cited to try to fire Cook.Spokespeople for the FHFA and DOJ did not immediately respond to CNBC's request for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eric Swalwell sues FHFA chief Pulte, alleging director used private information to attack Trump critics",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106237343-1573479639092rts2h5cp.jpg?v=1573479741&w=1920&h=1080"
      ],
      "datePublished": "2025-11-26T19:26:35.000Z",
      "dateModified": "2025-11-26T19:26:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Switzerland has long welcomed the ultra wealthy. A referendum on a new tax has riled them up",
    "url": "https://www.cnbc.com/2025/11/28/swiss-voters-to-decide-on-inheritance-tax-rise-for-ultra-wealthy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/49174857-8_Switzerland.jpg?v=1350683010&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T14:18:15.000Z",
    "description": "Billionaire count: 57Total wealth: $125 billionKnown as the playground of the rich and famous, Switzerland is 8th in the global billionaire sweepstake",
    "body": "Billionaire count: 57Total wealth: $125 billionKnown as the playground of the rich and famous, Switzerland is 8th in the global billionaire sweepstakes and ranks 7th as the home of those worth $30 million and more, or the ultra-wealthy.Switzerland's billionaires represent the top one percent of its 5,597 ultra-wealthy population and control more than 19 percent of the total fortune of this group. On average, these billionaires are worth $2.2 billion each.Despite Europe as a whole seeing a declinPhoto: Ingolf Pompe | LOOK-fotoSwitzerland has long been a haven for the ultra rich. Its 300 wealthiest residents are worth a combined 850 billion Swiss Francs, or just over $1 trillion, according to business magazine Bilanz. But on Sunday, voters will go to the polls to vote on an inheritance tax that has riled them up. The proposal to tax every inheritance and gift of more than 50 million Swiss Francs at 50% is likely to be defeated. A recent poll put support at just 30%.watch nowBut close followers of the debate told CNBC the initiative has shaken wealthy individuals and family-owned companies since it was proposed in 2024. Swiss billionaire Peter Spuhler, founder and owner of Stadler Rail, has threatened to leave the country if the tax becomes law. He told told Swiss daily Tagesanzeiger that his family would struggle to pay such a tax as their wealth is tied up in companies.\"A lot of people who would be affected talked to their consultants and their tax lawyers, and they did the paperwork to be sure that this time of the year, a week before the final vote, they are ready to move out if necessary,\" Stefan Legge from the University of St. Gallen in Switzerland told CNBC on Friday.'The ultra wealthy are like queens on a chessboard'Legge, who conducted research into the potential impact of the tax, said: \"If you target the super wealthy, they are like queens on a chessboard.\" \"They are very mobile. They have tons of options to optimize their taxes,\" he added.Kurt Moosmann, president of the Swiss Single Family Office Association, told CNBC the proposal had caused \"a certain uncertainty among family offices and has kept foreign capital holders away from Switzerland.\"watch nowLegge said a 50% tax would likely lead to tax revenue falling. He said that around 2,000 people, or 0.3% of Switzerland's population, would be affected and they currently pay between 5 and 6 billion Swiss Francs a year.Powerful Swiss business lobby Economiesuisse has called talk of an inheritance tax a \"superfluous and damaging discussion\"\"We are dependent on good tax payers to finance our state,\" it warned.Legge said Switzerland faced competition from wealth centers in the Middle East and other countries in Europe, but added Switzerland was \"still very strong\" on \"finding the right balance between taxes and the right public services.\"watch nowWhen asked whether wealthy clients were scared, Giorgio Pradelli, CEO of Swiss private bank EFG International, told CNBC on Tuesday, \"If you look at the overall competitive landscape, Switzerland remains the No. 1 destination for international private banking and wealth management. We have an ecosystem that is super healthy and strong.\"The proposal came from the youth wing of the country's left-wing Social Democrats. If successful, money raised from the tax would fund policies to combat climate change.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Switzerland has long welcomed the ultra wealthy. A referendum on a new tax has riled them up",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/49174857-8_Switzerland.jpg?v=1350683010&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T14:18:15.000Z",
      "dateModified": "2025-11-28T14:18:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple is challenging India's antitrust body over a potential $38 billion fine",
    "url": "https://www.cnbc.com/2025/11/27/apple-challenges-indias-anti-trust-body-over-potential-38-billion-fine.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108115188-1741833320394-gettyimages-1681507978-INDIA_IPHONE_15.jpeg?v=1748332385&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T12:36:32.000Z",
    "description": "The first day of sale of the iPhone 15 smartphone in Mumbai, India, on Sept. 22, 2023.Dhiraj Singh | Bloomberg | Getty ImagesApple has filed a case in",
    "body": "The first day of sale of the iPhone 15 smartphone in Mumbai, India, on Sept. 22, 2023.Dhiraj Singh | Bloomberg | Getty ImagesApple has filed a case in the Delhi High Court against the country's antitrust body because of how it considers global turnover when calculating penalties.The iPhone maker, which is among the fastest-growing smartphone brands in India, is challenging India's new antitrust law under which the U.S. company could face fines of up to $38 billion, according to a report by Reuters.Apple added that it was \"unconstitutional, grossly disproportionate, unjust\" for the Competition Commission of India (CCI) to use turnover when calculating penalties.Apple did not immediately respond to a request for comment from CNBC.The CCI has been investigating complaints from an alliance of Indian startups and Tinder-owner Match Group that accuse Apple of \"abusive conduct,\" which forces developers to pay high commissions for in-app purchases. Apple denied the charges.The CCI's final verdict is still pending, but it said its \"prima facie view [is] that mandatory use of Apple's IAP for paid apps and in-app purchases restricts the choice available to the app developers to select a payment processing system of their choice,\" in an order in December 2021.Apple recorded its highest-ever quarterly shipments in India of 5 million units in the third quarter of 2025, according to data from IDC. watch nowThe company is expected to sell about 15 million iPhones in India this year and could rank among the top five smartphone companies there, Navkendar Singh, associate vice president with IDC India,  on Nov. 18.Apple is among the global companies diversifying their manufacturing supply chains away from China to India. In 2024, Apple's exports from India hit a record of $12.8 billion, up more than 42% from a year earlier.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple is challenging India's antitrust body over a potential $38 billion fine",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108115188-1741833320394-gettyimages-1681507978-INDIA_IPHONE_15.jpeg?v=1748332385&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T12:36:32.000Z",
      "dateModified": "2025-11-27T12:36:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "India economy grows at faster-than-expected 8.2% in September quarter even as tariffs bite",
    "url": "https://www.cnbc.com/2025/11/28/india-economy-gdp-grows-september-quarter-tariffs-bite-trade-us-modi.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107427679-1718187214637-gettyimages-2155629437-INDIA_MUMBAI.jpeg?v=1719377830&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T11:02:54.000Z",
    "description": "Hadynyah | E+ | Getty ImagesIn a quarter partially affected by the 50% U.S. tariffs, the Indian economy grew faster than expected at an annual rate of",
    "body": "Hadynyah | E+ | Getty ImagesIn a quarter partially affected by the 50% U.S. tariffs, the Indian economy grew faster than expected at an annual rate of 8.2% in the quarter ending in September.The growth was an acceleration from 7.8% in the previous quarter, when a lower deflator unexpectedly boosted real growth. A deflator measures how inflation affects the value of total output.A Reuters poll of economists had pegged the July-September gross domestic product at 7.3%.India's nominal GDP — which does not account for inflation or deflation — grew 8.7% in the September quarter compared to 8.8% in the previous quarter.The sharp improvement in GDP growth rate was on account of a pick up in manufacturing and construction activity and domestic consumption. Financial and real estate professional services have \"sustained a substantial growth rate\" of 10.2% in Jul-Sep, the government said in a release. watch nowDuring the September quarter, domestic consumption was \"held back\" ahead of the planned cuts to the goods and services tax, Neelkanth Mishra, chief economist at Axis Bank, told CNBC's \"Inside India\" before the release of the GDP data.The 50% tariffs on Indian goods exported to the U.S. took effect in August. To cushion the impact, New Delhi announced sweeping GST tax reductions effective Sept. 22 to boost domestic consumption.Demand picked up sharply in October, with record sales of autos and gold as the GST cuts and earlier reduction of the individual income tax rate lifted disposable incomes. Even so, India's goods trade deficit hit a new high on weak exports and higher gold imports.The International Monetary Fund, in a report on Wednesday, said India's real GDP is projected to grow 6.6% in fiscal 2026 before moderating to 6.2% in fiscal 2027, assuming a prolonged delay in a U.S.-India trade deal.It also forecasted India's merchandise exports to fall 5.8% in fiscal year 2026 to $416 billion, while goods imports are expected to rise 2.4% to $746 billion.\"Despite external headwinds, growth is expected to remain robust, supported by favorable domestic conditions,\" the IMF said in the release, with its data also suggesting that India will become a $5 trillion economy by fiscal year 2029.— CNBC's Amitoj Singh contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "India economy grows at faster-than-expected 8.2% in September quarter even as tariffs bite",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107427679-1718187214637-gettyimages-2155629437-INDIA_MUMBAI.jpeg?v=1719377830&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T11:02:54.000Z",
      "dateModified": "2025-11-28T11:02:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What’s going on at Nexperia? China’s Wingtech escalates war of words with Dutch chipmaker",
    "url": "https://www.cnbc.com/2025/11/28/nexperia-crisis-dutch-chipmaker-issues-urgent-plea-to-its-china-unit.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108223391-1762732099400-gettyimages-2244812334-AFP_839X72A.jpeg?v=1764314996&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-28T13:02:22.000Z",
    "description": "This photograph shows a general view of Nexperia headquarters in Nijmegen on November 6, 2025.John Thys | Afp | Getty Images Dutch chipmaker Nexperia ",
    "body": "This photograph shows a general view of Nexperia headquarters in Nijmegen on November 6, 2025.John Thys | Afp | Getty Images Dutch chipmaker Nexperia has publicly called on its China unit to help restore supply chain operations, warning in an open letter that customers across industries are reporting \"imminent production outages.\"Nexperia's Dutch unit said Thursday that its open letter followed \"repeated attempts to establish direct communication through conventional channels\" but did not have \"any meaningful response.\"The letter marks the latest twist in a long-running saga that has threatened global automotive supply chains and stoked a bitter battle between Amsterdam and Beijing over technology transfer. \"We welcomed the Chinese authorities' commitment to facilitate the resumption of exports from Nexperia's Chinese facility and that of our subcontractors, enabling the continued flow of our products to global markets,\" Nexperia's Dutch unit said in the letter.\"Nevertheless, customers across industries are still reporting imminent production stoppages. This situation cannot persist,\" they added. The group called on the leadership of Nexperia's entities in China to take steps to restore the  established supply flows without delay.In a statement, Wingtech Technology, Nexperia's Chinese parent company, said on Friday that the Dutch unit's open letter contained \"a large number of misleading and untrue allegations.\"It said the \"unlawful deprivation of Wingtech's control and shareholder rights over Nexperia\" was the root cause of the ongoing supply chain chaos.\"Combined with the recent series of actions by the Dutch government and Nexperia B.V., we believe their true intention is to buy time for Nexperia B.V. to construct a 'de-China-ized' supply chain and permanently strip Wingtech of its shareholder rights,\" Wingtech said.In this photo illustration, the logo of semiconductor manufacturer Nexperia is displayed on a screen.Vcg | Visual China Group | Getty ImagesNexperia manufactures billions of so-called foundation chips — transistors, diodes and power management components — that are produced in Europe, assembled and tested in China, and then re-exported to customers in Europe and elsewhere. The chips are relatively low-tech and inexpensive but are needed in almost every device that uses electricity. In cars, those chips are used to connect the battery to motors, for lights and sensors, for braking systems, airbag controllers, entertainment systems and electric windows. How did we get here? The situation began in September, when the Dutch government invoked a Cold War-era law to effectively take control of Nexperia. The highly unusual move was reportedly made after the U.S. raised security concerns. Beijing responded by moving to block its products from leaving China, which, in turn, raised the alarm among global automakers as they faced shortages of the chipmaker's components. In an apparent reprieve last week, however, the Dutch government said it had suspended its state intervention at Nexperia following talks with Chinese authorities. It was thought at the time that this could bring an end to the dispute and pave the way for a restoration of normal supply chains.  Rico Luman, senior sector economist for transport and logistics at Dutch bank ING, said it remains unclear how long the situation will last.\"The imposed measures to seize the Dutch Nexperia subsidiary have been lifted, but there are still talks ongoing about restoring the corporate structure and relation with parent company Wingtech,\" Luman told CNBC by email.\"It's not only about supplies of finished chips, it's also about wafer supplies from Europe to the Chinese entity,\" Luman said, adding that companies including Japan's Nissan and German auto supplier Bosch are among the firms to have warned about looming shortages.Nissan signage at a dealership in Richmond, California, US, on Friday, June 21, 2024.Bloomberg | Bloomberg | Getty ImagesA spokesperson for the German Association of the Automotive Industry (VDA), which represents Volkswagen, Mercedes-Benz Group and BMW among hundreds of others, warned of elevated risks to supply, \"particularly for the first quarter\" of 2026.\"In recent weeks, the German automotive industry has largely been able to keep production stable through intensive efforts,\" a VDA spokesperson told CNBC by email. \"However, the disruptions in the supply chain for Nexperia parts caused by political intervention have not been fundamentally resolved. Component availability remains uncertain,\" they added. ING's Luman said the Nexperia situation is somewhat comparable to China's rare earth export controls.\"The Chinese position appears strong again as European manufacturers are dependent on the supplies. And comparable to the rare earths, it's not fully transparent which buyer is able to qualify for which chip supplies,\" Luman said. — CNBC's Annika Kim Constantino contributed to this report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What’s going on at Nexperia? China’s Wingtech escalates war of words with Dutch chipmaker",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108223391-1762732099400-gettyimages-2244812334-AFP_839X72A.jpeg?v=1764314996&w=1920&h=1080"
      ],
      "datePublished": "2025-11-28T13:02:22.000Z",
      "dateModified": "2025-11-28T13:02:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alibaba's AI glasses to rival Meta go on sale for $500 ",
    "url": "https://www.cnbc.com/2025/11/27/alibaba-quark-ai-glasses-go-on-sale-price-specs.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108177567-1753687050071-Alibaba_AI_glasses.jpg?v=1753690514&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-27T09:07:07.000Z",
    "description": "Alibaba announced plans to release a pair of smart glasses powered by its AI models. The Quark AI Glasses are Alibaba's first foray into the smart gla",
    "body": "Alibaba announced plans to release a pair of smart glasses powered by its AI models. The Quark AI Glasses are Alibaba's first foray into the smart glasses product category.AlibabaAlibaba's artificial intelligence-powered smart glasses went on sale on Thursday as the Chinese tech giant looks to ramp up its focus on consumer AI in an increasingly competitive market. The Quark AI Glasses, first announced in July, come in two variants — the S1, which starts at  3,799 Chinese yuan ($536) and G1 at 1,899 yuan.The tech giant has integrated its Qwen AI models — Alibaba's version of ChatGPT — with the device which also links to its newly-launched Qwen app. This means users can use voice control to get the glasses to carry out tasks.The lenses of the glasses are effectively screens and the device has a camera built into the frame. The main difference between the S1 and G1 is the display, Alibaba said.watch nowThe company said that some of the features include on-the-go translation, AI-generated meeting notes and the ability to ask the virtual assistants questions. Users take pictures of a product using the camera in the lens and then the device will show the price of that product on Taobao, Alibaba's main shopping app in China. Alibaba, like other technology companies such as U.S. giant Meta, are betting that smart glasses could be the next big consumer device after the smartphone.In September, Meta unveiled the $799 Meta Ray-Ban Display glasses, the social media company's first consumer-ready smart glasses with a built-in display. Users can control the device via hand gestures with a special wristband. Alibaba's glasses will initially go on sale in China and compete with domestic rivals, including consumer electronics maker Xiaomi and startup Xreal. The smart glasses market is still small but growing rapidly. By 2026, shipments of AI glasses are expected to exceed more than 10 million units, doubling from 2025, according to a forecast from Omdia. For Alibaba, the glasses are its latest play in the consumer AI market as it looks to build on its recent successes. The company's ChatGPT-style Qwen app got 10 million downloads in the first week of the public beta launch. Meanwhile, Alibaba's cloud computing business, where it books much of its AI-relate revenue, saw an acceleration of growth in the last quarter.The Hangzhou, headquartered company is one of the leaders in China's AI space, and has been investing aggressively in AI alongside rival giants like Baidu and Tencent, and aggressively launching new models.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alibaba's AI glasses to rival Meta go on sale for $500 ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108177567-1753687050071-Alibaba_AI_glasses.jpg?v=1753690514&w=1920&h=1080"
      ],
      "datePublished": "2025-11-27T09:07:07.000Z",
      "dateModified": "2025-11-27T09:07:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Airbus A320 recall disrupts global travel after glitch linked to solar flares",
    "url": "https://www.cnbc.com/2025/11/29/airbus-recall-disrupts-global-travel-a320-jets-grounded-glitch-linked-solar-flares.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108233725-1764391969803-gettyimages-2248356951-AFP_86JG66E.jpeg?v=1764391983&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-29T07:36:56.000Z",
    "description": "A Latam Airlines Airbus A320 sits on the tarmac at El Dorado airport in Bogota on Nov. 28, 2025. Sergio Yate | Afp | Getty ImagesThousands of traveler",
    "body": "A Latam Airlines Airbus A320 sits on the tarmac at El Dorado airport in Bogota on Nov. 28, 2025. Sergio Yate | Afp | Getty ImagesThousands of travelers worldwide were stranded after Airbus ordered immediate software fixes for 6,000 A320-series aircraft, a move that affected more than half of the narrow-body fleet and forced airlines to ground jets during one of the busiest travel weekends of the year.The directive — among the largest in the 55-year history of Airbus — quickly spilled into U.S. holiday travel and stretched to Australia. The disruption, linked to solar flares, hit especially hard in Asia, where the single-aisle A320 family anchors short-haul networks.American Airlines, the world's largest A320 operator, told CNBC that the Airbus recall impacted 209 aircraft, down from the more than 340 initially identified. \"As of 6 p.m. CT, American has fewer than 150 aircraft remaining to update,\" American Airlines said.\"We expect the overwhelming majority of those to be completed today and through the night, with only a handful remaining for completion tomorrow.\"United Airlines said six aircraft in its fleet were affected, and the carrier expected \"minor disruption to a few flights.\"  Delta Air Lines said less than 50 of its Airbus A320 fleet were affected.Japan's ANA Holdings canceled 95 domestic flights Saturday, affecting around 13,200 passengers. The carrier, along with affiliates such as Peach Aviation, operates the country's largest Airbus narrow-body fleet, while rival Japan Airlines relies mostly on Boeing aircraft.watch nowAir India, which is partially owned by Singapore Airlines, said it had completed software updates on over 40% of its affected aircraft and that there were no flight cancellations, although some flights were delayed or rescheduled.Scoot, another carrier under the Singapore Airlines group, said 21 of its 29 A320s required the fix and that it aimed to complete the work by Saturday.In Australia, Jetstar Airways canceled around 90 flights after identifying 34 aircraft that required the software correction. \"As of 3:30 pm [local time], 20 of the 34 affected aircraft are ready to return to service. We're expecting the remaining to be ready overnight, allowing flights to resume as planned on Sunday 30 November,\" a Jetstar spokesperson told CNBC.The budget airline and its parent company, Qantas, which is Australia's national flag carrier, together hold about 65% of the domestic market.  Rival Virgin Australia, which has four A320s in its fleet and a 35% share, said that it was unaffected by the recall.The European Union Aviation Safety Agency said in a directive on Friday that a JetBlue flight on Oct. 30 experienced an \"uncommanded and limited pitch down event.\"  The U.S. Federal Aviation Administration also issued an emergency directive later that day, ordering operators of the affected model to address the glitch.Airbus said it issued the order after it was revealed that \"intense solar radiation\" may have corrupted data critical to the functioning of flight controls.Regulators warned that the issue could lead to \"an uncommanded elevator movement\" in the worst-case scenario.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Airbus A320 recall disrupts global travel after glitch linked to solar flares",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108233725-1764391969803-gettyimages-2248356951-AFP_86JG66E.jpeg?v=1764391983&w=1920&h=1080"
      ],
      "datePublished": "2025-11-29T07:36:56.000Z",
      "dateModified": "2025-11-29T07:36:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]