[
  {
    "title": "A new buzzword is hanging over businesses as they rush into AI",
    "url": "https://www.cnbc.com/2025/09/28/a-new-buzzword-is-hanging-over-businesses-as-they-rush-into-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204429-1758889385327-gettyimages-1427840896-pi-2631715.jpeg?v=1758901276&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-28T06:08:33.000Z",
    "description": "Companies are expecting to incur more costs as a result of poorly implemented autonomous systems.Shapecharge | E+ | Getty ImagesArtificial intelligence capabilities are developing rapidly and companies...",
    "body": "<div><div><p>Companies are expecting to incur more costs as a result of poorly implemented autonomous systems.</p><p>Shapecharge | E+ | Getty Images</p></div><div><p>Artificial intelligence capabilities are developing rapidly and companies globally are frantically trying to keep up and implement AI tools, but there are consequences to sloppy execution.</p><p>In fact, 79% of companies globally expect to incur an \"AI debt\" as a result of poorly implemented autonomous tools, according to a new report by<a href=\"https://assets.asana.biz/m/10543e5e3bcb38f5/original/2025-Global-State-of-AI-at-Work.pdf\" target=\"_blank\"> Asana on the State of AI at Work</a> which surveyed over 9,000 knowledge workers across the U.S., U.K., Australia, Germany, and Japan.</p><p>The report highlighted that companies are unprepared and lack the infrastructure and oversight required to foster a smooth collaboration between human employees and autonomous <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/generative-ai-spending-investment-bubble.html\">AI agents</a>. Differing from generative AI, agents act independently, can initiate actions, and recall previous work they performed. Some examples include <a target=\"_blank\" href=\"https://www.cnbc.com/2025/01/23/openai-operator-ai-agent-can-automate-tasks-like-vacation-planning.html\">OpenAI's Operator</a> and Anthropic's Claude.</p><p>AI debt is the cost of not implementing nascent autonomous systems correctly, Mark Hoffman, an expert at Asana's Work Innovation Lab, told CNBC Make It.</p><p>\"Those costs could be money costs. They could also be lost time, which relates to money. It could also be a lot of things that you have to undo, which is costly from a financial standpoint. It burns people out to have to do it. It's all of the costs associated with poor implementation,\" Hoffman said.</p><p>The report outlined that the debt could manifest as security risks, poor data quality, low impact AI agents which will waste time and resources for human employees, and a management skills gap.</p><p>Hoffman said this is not an exhaustive list and the \"debt\" could look like a bunch of code created by AI that doesn't work right or AI-generated content that nobody is using.</p><p>New research from BetterUp Labs and Stanford Social Media Lab even found that 40% of desk workers in the U.S. have received <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/ai-generated-workslop-is-destroying-productivity-and-teams-researchers-say.html\">AI-generated \"workslop,\"</a> which the researchers defined as content that looks good but lacks any substance.</p></div><div><p><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/ai-generated-workslop-is-destroying-productivity-and-teams-researchers-say.html\"><img src=\"https://image.cnbcfm.com/api/v1/image/108202475-1758579102271-gettyimages-700712909-bld240699.jpeg?v=1758579133&w=160&h=90\" /></a></p></div><div><p>It's created almost two hours of extra work for people who encountered it, a $186 invisible tax per month, and a $9 million hit to productivity in a year, per the research.</p><p>\"There's large investment going into this space right now, and ultimately it's a question of whether those investments will pay off,\" Hoffman said.</p><p>Henry Ajder, founder of AI consulting firm Latent Space Advisory, and an advisor to the U.K. government, Meta, and AI video startup Synthesia, emphasized the need for thoughtful implementation and structures.</p><p>\"People who are CTOs or innovation officers, the good ones I've worked with, the ones who I think I did the best position to succeed with it, they aren't sugar coating the disruption that this is going to cost ... as with any kind of fundamental rework, you are going to have problems, you're gonna have bumps in the road,\" Ajder said in an interview.</p></div><h2><a></a>'It's not a magical silver bullet'</h2><div><p>Asana's report found that despite AI adoption surging to 70% in 2025 from 52% in 2024, workers are also facing higher levels of digital burnout.</p><p>Digital exhaustion increased to 84% in 2025 from 75% the prior year, while unmanageable workloads also rose to 77%, per the report.</p><p>Mona Mourshed, founding global CEO of Generation, a U.S.-based employment organization, told CNBC that despite companies rolling out AI tools and encouraging the use of it, workers are still struggling.</p><p>\"The core reason that they're struggling, and we know this from also talking to our own alumni, is that the use case for how and why are you supposed to use this AI tool in the flow of your work is often missing,\" Mourshed said.</p><p>\"Without a clear understanding of what is the use case that's going to make this particular task better, faster, cheaper ... that's what leads to the exhaustion, because you don't know what the intended outcome is,\" she added.</p><p>Mourshed noted that companies are investing in AI in the hopes that overnight work will be performed better, faster and cheaper, but they aren't offering the necessary training or guidelines to enable improvements.</p><p>\"It's not a magical silver bullet, and all of a sudden it does everything you want once you install it ... it's going to be a much more painful journey to get to those benefits than companies that have thought it through.\"</p><p>AI expert Ajder said the correct strategy is carefully testing AI use and building infrastructure around it rather than rushing into the race unprepared.</p><p>\"You don't start by just embedding, you start by piloting, you start by scoping, by sandboxing, by trialing these systems,\" he said.</p><p>This includes everything from the correct training for employees, to thinking about the kind of AI models the business might need. It's much harder to respond to mistakes or malfunctions when there's no procedure in place.</p><p>\"So I'm not saying that you can't take risk thoughtfully when it comes to using AI, but it has to be calculated and it has to be scoped,\" Ajder said.</p></div></div>"
  },
  {
    "title": "25-year-old consultant took 8 weeks of unpaid time off for reality dating show—‘I have really good relationships with people at my work’",
    "url": "https://www.cnbc.com/2025/09/28/25-year-old-consultant-took-8-weeks-unpaid-time-off-for-reality-dating-show.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108200956-1758226385808-GettyImages-2223409831.jpg?v=1758226408&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-28T13:43:01.000Z",
    "description": "People typically request time off at least a couple of weeks in advance. Elan Bibas, 25, had just three days to ask for an eight-week leave.In late May, Bibas says he was working full-time as a management...",
    "body": "<div><div><p>People <a target=\"_blank\" href=\"https://www.cnbc.com/2023/01/13/now-is-the-best-time-to-plan-out-your-pto-for-the-rest-of-the-year.html\">typically request time off</a> at least a couple of weeks in advance. Elan Bibas, 25, had just three days to ask for an eight-week leave.</p><p>In late May, <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/26/25-year-old-tech-consultant-elan-bibas-took-unpaid-time-off-to-be-on-love-island.html\">Bibas says he was working full-time as a management technology consultant</a> when he got the call: The producers of \"Love Island USA\" wanted him to be on season seven of the show. If he were to accept the offer, he had three days to get on a plane to Fiji, where the show would be filmed.</p><p>\"It was incredibly stressful,\" he says, but luckily, \"I have really good relationships with people at my work.\"</p><p>He says he wasn't really worried about any repercussions at work from appearing on a show that would make him a public figure because of those strong work relationships. While it was a little \"nerve-wracking\" to log back online after returning from Fiji, he says he received nothing but supportive and sometimes funny messages through Microsoft Teams and in meetings.</p><p>Building those relationships also allowed him to leave the job amicably. In early September, <a href=\"https://www.instagram.com/reel/DOW3v3wDYz6/?igsh=a3R5bzBweTJ2dndq\" target=\"_blank\">he posted</a> on Instagram that he had quit his job. When he told his manager, his manager wasn't just supportive of the decision but added that he was happy for Bibas and excited for what he would do next, Bibas said in the video.</p><p>\"Your work relationships really are the thing that's going to allow you to do opportunities that are of benefit to you,\" Bibas tells CNBC Make It. \"If the people at work genuinely care about you and who you are, they'll want things to work out for you.\"</p></div><h2><a></a>You need your boss to like you</h2><div><p>Not all work relationships may be equal, <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/11/stanford-expert-playing-nice-at-work-wont-help-you-gain-influence.html\">but building a relationship with your boss is crucial</a>, Stanford University professor and career development expert Jeffrey Pfeffer told CNBC Make It in September.</p><p>To build stronger work relationships with a manager, consider using some workplace flattery like complimenting the way your boss conducted a meeting or asking for career advice, Pfeffer said.</p><p>\"The people in the hierarchy are the people who are responsible for your career,\" Pfeffer said. \"You need to worry a lot about what your boss thinks about you. You don't need to worry so much about what everybody else thinks.\"</p></div><h2><a></a>Friendships can make you happier at work</h2><div><p>Still, <a target=\"_blank\" href=\"https://www.cnbc.com/2024/10/25/number-one-thing-you-can-do-to-feel-happier-at-work-according-to-an-expert.html\">becoming friends with anyone at work is beneficial</a> because it can make you happier on the job, happiness expert Jessica Weiss said last year. Even one friend can make challenges at work easier because they give you someone to talk through solutions with, Weiss said.</p><p>\"The most important thing that you can do for happiness, happiness in life and happiness at work, is friendship,\" Weiss said.</p><p><em>Disclosure: \"Love Island USA\" airs on Peacock the streaming service of NBCUniversal, parent company of CNBC.</em></p><p><em><strong>Want to be your own boss?</strong> Sign up for Smarter by CNBC Make It's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue. Sign up today with coupon code EARLYBIRD for an introductory discount of 30% off the regular course price of $127 (plus tax). Offer valid September 16 through September 30, 2025.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108200303-250830-mi-12-unl-smith-chiba-radio-v500_00_52_11still008.jpg?v=1758140295&w=750&h=422&vtcrop=y\" alt=\"I live in the countryside of Japan for $238/month – take a look inside my apartment\" /><span></span><span><span></span></span></p></div></div>"
  },
  {
    "title": "The No. 1 sign you're ready to be your own boss, says Olipop CEO: You need 'a lot of passion' ",
    "url": "https://www.cnbc.com/2025/09/28/the-no-1-sign-youre-ready-to-be-your-own-boss-says-olipop-ceo.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108203923-1758815413927-Ben_Goodwin_Olipop.jpg?v=1758815463&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-28T13:00:01.000Z",
    "description": "For some entrepreneurs, becoming their own boss was a no-brainer. Maybe they come from a family of business owners, or never really felt fulfilled working a standard 9-to-5 job.For others, the signs may not...",
    "body": "<div><p>For some entrepreneurs, becoming their own boss was a no-brainer. Maybe they come from a family of business owners, or never really felt fulfilled working a standard 9-to-5 job.</p><p>For others, the signs may not be so evident, leaving them to wonder, \"Am I ready to take the leap? Am I even supposed to be my own boss?\" According to Olipop co-founder and CEO Ben Goodwin, there's a tell-tale sign to watch out for. </p><p>\"If the excitement and fulfillment of the vision for what you want to do is more powerful than the fear and the excuses,\" then you should act on it, says Goodwin, 40. He adds that you have to have \"a lot of passion\" because when things inevitably get tough, that drive will keep you focused on your mission.</p><p><em><strong>DON'T MISS</strong></em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=body\" target=\"_blank\"><em><strong>:</strong> <strong>The ultimate guide to starting a business—everything you need to know to be your own boss</strong></em></a></p><p>Goodwin struggled with his physical and mental health as a teen who was regularly consuming unhealthy foods and beverages. Changing to a healthier diet and lifestyle made him feel much more fulfilled, he told <a href=\"https://fortune.com/well/article/olipop-cofounder-daily-habits-wellness-routine-ben-goodwin/\" target=\"_blank\">Fortune</a> in December 2023. So much so that he dropped out of college to pursue healthy drink alternatives to sodas and sugary juices. Goodwin left the University of California Santa Cruz in 2005, and 20 years later, he's still dedicated to his mission to help people lead healthier lives, he tells CNBC Make It.  </p><p>The journey wasn't linear. Goodwin's first venture, a water kefir beverage called Obi Probiotic Soda that launched in 2008, didn't gain the traction he'd hoped despite being in business for eight years. He and his business partner, David Lester, <a target=\"_blank\" href=\"https://www.cnbc.com/2023/09/16/how-olipops-founders-turned-100k-investment-into-healthier-soda-brand.html\">sold the company</a> for an undisclosed amount in 2016, and used the money to get Olipop off the ground. The company made $852,000 in gross revenue in its first year of business, and was valued at <a target=\"_blank\" href=\"https://www.cnbc.com/2025/02/12/olipop-prebiotic-soda-valued-at-1point85-billion-in-funding-round.html\">$1.85 billion</a> in February.</p><p>Goodwin says that if you're able to bounce back from hardships and enjoy facing challenges head on, you're probably ready to be your own boss. </p><p>\"One of the things I really enjoy about entrepreneurialism is that it keeps challenging you,\" he says. \"You've got to make complex ethical decisions. You've got to make complex procedure decisions. You've got to operate under extreme pressure. And a lot of people want to avoid those things, logically, because they tend to make life a lot more complicated.\" </p><p>But if you're the kind of person that \"feels more alive when they're getting deeply or dynamically challenged, and recognize the value that that can provide to your interpersonal development,\" you should try your hand at entrepreneurship, says Goodwin. </p><p>Of course, everyone isn't innately open to failing or recovering from setbacks. But resilience is a skill that can be built and nurtured over time, according to author and mental performance coach Steve Magness. He recommends that people make a <a target=\"_blank\" href=\"https://www.cnbc.com/2022/07/01/how-changing-one-word-in-your-thoughts-can-boost-your-mental-toughness-and-resilience.html\">simple mindset shift</a> to start: \"Switch 'I' to 'you,\" he wrote for CNBC Make It in July 2022. </p><p>\"Using second- or third-person language in your self-talk creates distance between an experience and our emotional response,\" said Magness. \"This linguistic trick allows us to zoom out.\"</p><p>Next time you're facing a stressful challenge, tell yourself, \"You can do this,\" or, \"[Your name] can get through this,\" instead of, \"I've done this before,\"<strong> </strong>speaking to yourself like a friend or family member giving you a push.</p><p>\"When we broaden our worldview beyond a self-immersed world, we move from emotional reaction to action,\" Magness said.</p><p><em><strong>Want to be your own boss?</strong> Sign up for Smarter by CNBC Make It's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue. Sign up today with coupon code EARLYBIRD for an introductory discount of 30% off the regular course price of $127 (plus tax). Offer valid September 16 through September 30, 2025.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div>"
  },
  {
    "title": "3 'minimizing' phrases you should never say at work, from a communication expert",
    "url": "https://www.cnbc.com/2025/09/28/3-minimizing-phrases-you-should-never-say-at-work-from-a-communication-expert.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107096553-1758814626767-phrases_to_avoid_at_work.jpeg?v=1758814648&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-28T14:00:01.000Z",
    "description": "As a former world champion debater, Kate Mason, PhD, knows that the way you communicate can matter just as much as your message.Mason, who lives in Sydney, Australia, spent a decade working in communications...",
    "body": "<div><p>As a former world champion debater, Kate Mason, PhD, knows that the way you communicate can matter just as much as your message.</p><p>Mason, who lives in Sydney, Australia, spent a decade working in communications at companies like Google and YouTube before becoming an executive coach and founding her own strategic communications firm, <a href=\"https://www.wearehedgehogandfox.com/\" target=\"_blank\">Hedgehog + Fox</a>, in 2017.</p><p>Through her work as a <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/15/dont-ask-how-are-you-how-successful-people-get-others-to-like-and-trust-them-psychology-expert.html\">communications coach</a>, Mason noticed a pattern she calls \"imposing syndrome\": many professionals, particularly women, are overly self-conscious about ruffling feathers or \"being a bother\" at work, she says, which often causes them to stay quiet and minimize their accomplishments.</p><p>These self-deprecating habits have \"an insidious effect on their work and their standing,\" she says.</p><p>\"It leads to <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/04/people-wont-take-you-seriously-if-you-use-these-phrases-make-these-powerful-swaps-says-communication-expert.html\">underestimating themselves</a> and their work by extension,\" she continues.</p><p>Mason's goal in highlighting these communication patterns isn't to point out \"all the ways we're doing it wrong,\" she says. Instead, she hopes to provide resources for leaders, especially women, who are interested in changing their communication patterns.</p><p>\"It's more like a kind acknowledgment: this is a thing, and if that's not serving you, maybe you want to experiment a little bit,\" Mason says.</p><p>She shares her top insights in her first book, <a href=\"https://www.penguinrandomhouse.com/books/745694/powerfully-likeable-by-kate-mason-phd/\" target=\"_blank\">\"Powerfully Likeable: A Woman's Guide to Effective Communication,\"</a> which debuted earlier this month.</p><p>Here are three phrases Mason recommends all professionals avoid in the workplace, along with stronger alternatives.</p><h3><strong>'It'll just take a second'</strong></h3><p>People who use this phrase are often acting on a \"very kind, emotionally aware impulse\" to demonstrate respect for others' time, Mason says.</p><p>In reality, prefacing your conversation with \"It'll just take a second\" can have the opposite effect, according to Mason.</p><p>Firstly, \"you've set an expectation to the other person that this will be very quick,\" she says, but \"literally nothing takes one second.\"</p><p>Providing an unrealistic time estimate can annoy or disappoint the person you're speaking to, Mason says.</p><p>\"That person, a couple minutes in, is already a bit irritated because they're like, 'Wait, this was only going to be a second.'\"</p><p>Moreover, the phrase also sets the expectation that whatever you have to say is minor or unimportant, Mason says, which can undercut your actual message.</p><p>A better way to articulate your request is, \"I'm going to put in an hour for us next week. I really want to talk through A, B and C. Let me know if that time works for you,\" Mason says.</p><p>With that rephrase, \"suddenly, I look like I'm coming to you with something substantive and meaty and worthy of us spending that time together,\" she says.</p><p>\"It just does the idea — and yourself — a lot more justice to reframe it that way,\" she continues.</p><h3><strong>'No worries if not'</strong></h3><p>This phrase is commonly used to 'soften' a direct request, Mason says, but it's usually not factually true.</p><p>\"There often <em>is </em>a pressing concern,\" she says. \"It's very rare that we make an ask and genuinely think, 'Oh well, if they get back to me, we'll see.'\"</p><p>Saying \"No worries if not\" communicates that your request is a low priority, Mason says: \"It does a bit of a disservice to the ask.\"</p><p>For her part, when Mason hears this phrase, she mentally places that task lower on her to-do list, she says.</p><p>\"If you're communicating with an exec or someone who's busy and you're telling them 'no worries if not,' and there is a worry, then we can get ourselves into a bit of an unnecessarily sticky situation,\" she says.</p><p>Instead, Mason suggests specifying the purpose and time frame of your request. For example, \"I would appreciate if you could send me your edits by this afternoon, because the final draft is due tomorrow.\"</p><p>As Mason cites in her book, a <a href=\"https://psycnet.apa.org/doi/10.1037/0022-3514.36.6.635\" target=\"_blank\">psychological study</a> from the 1970s<strong> </strong>found that people were more likely to comply with a request if they were given a reason behind it.</p><p>With that context, people are \"usually happy to help,\" she says.</p><h3><strong>'I'm not an expert, but…'</strong></h3><p>This phrase will instantly make you seem less credible, Mason says.</p><p>According to Mason, prefacing your point with \"I'm not an expert\" <a target=\"_blank\" href=\"https://www.cnbc.com/2025/08/14/ive-coached-leaders-at-google-and-amazon-highly-successful-people-use-these-phrases-to-command-attention.html\">reduces your authority</a> and telegraphs uncertainty: \"It immediately deescalates your status.\"</p><p>People often minimize their accomplishments when they're feeling self-conscious, Mason says, especially if they view themselves as the 'odd one out' in a group.</p><p>Whether you're the youngest in the room, or the newest to the company, \"whatever that imbalance may be, we're hyper-aware of it,\" she says.</p><p>Being conscious of your place in the professional hierarchy isn't necessarily a bad thing, Mason says, but instead of downplaying your value, she recommends embracing the unique qualities you bring to the table.</p><p>\"You weren't hired because you have the same expertise as that vice president or C-level exec,\" she says. \"You were hired because you have <em>your</em> expertise.\"</p><p>Leaning into your strengths can be \"really empowering,\" Mason says.</p><p>\"Once you start realizing like, this is the thing I was hired for, and that is the value I can bring, and that's what they want from me, it just lets you put down a lot of that hierarchical, status-oriented anxiety.\"</p><p><em><strong>Want to be your own boss?</strong> Sign up for Smarter by CNBC Make It's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue. Sign up today with coupon code EARLYBIRD for an introductory discount of 30% off the regular course price of $127 (plus tax). Offer valid September 16 through September 30, 2025.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div>"
  },
  {
    "title": "I’ve helped hundreds of Americans move abroad—don't believe these 6 biggest lies: It's 'not as cheap as you think'",
    "url": "https://www.cnbc.com/2025/09/28/ive-helped-hundreds-of-americans-move-abroadthe-6-biggest-lies-about-relocating.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108071544-1733348340180-Cepee-22.jpg?v=1733348424&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-28T12:30:01.000Z",
    "description": "In 2015, I packed up my life in Austin, Texas and moved to Madrid. I was 35 and it wasn't my first attempt. I had spent more than a decade dreaming, trying, and failing to make Spain home.Since then, I've...",
    "body": "<div><div><p>In 2015, I packed up my life in Austin, Texas and<a target=\"_blank\" href=\"https://www.cnbc.com/2024/12/07/i-help-americans-move-abroad-key-steps-to-take-before-you-go.html\"> moved to Madrid</a>. I was 35 and it wasn't my first attempt. I had spent more than a decade dreaming, trying, and failing to make Spain home.</p><p>Since then, I've built a life in Spain and created <a href=\"https://shehitrefresh.com/\" target=\"_blank\">She Hit Refresh</a>, where I've helped hundreds of other women move abroad. </p><p>Along the way, I've experienced moments when my life in Europe felt like a movie. Like the time I stumbled upon a flamenco dancer in a hidden square, sipped wine at a Parisian café while the world passed by, or rode a Vespa past the Colosseum in Rome.</p><p>But these moments aren't everyday life, and not everything about moving abroad is just as you imagine it to be. Here are the six myths I hear most often about relocating.</p></div><h2><a></a>1. 'It's so cheap'</h2><div><p>Many countries can feel more affordable than the U.S., but living abroad is probably not as cheap as you think. Costs are rising around the world, especially housing prices. <a href=\"https://ec.europa.eu/eurostat/web/products-eurostat-news/w/ddn-20250704-4\" target=\"_blank\">House prices in the EU went up</a> 57.9% between 2010 and the first quarter of 2025, while rents increased by 27.8%. </p><p>My advice: Run the numbers based on <em>today's</em> reality, not outdated blog posts. And remember, what feels affordable to you on a U.S. salary may still be unaffordable for locals. Don't overpay. It only fuels the problem.</p></div><h2><a></a>2. 'Americans aren't welcome'</h2><div><p>The real pressure comes from tourism, not the relatively small number of Americans moving abroad. And while anti-tourism sentiment exists in crowded cities, it's not really about Americans, or even expats at all. The bigger issue is affordable housing — or, as I mentioned, the lack of it.</p><p>But smaller towns across Europe <em>want</em> new residents due to depopulation. If you're serious about integrating, consider looking beyond hotspots like Lisbon, Barcelona, or Amsterdam. </p><p>Regardless, in my own experience, when you learn the language, contribute, and connect, you'll usually be <a target=\"_blank\" href=\"https://www.cnbc.com/2025/05/18/i-help-americans-move-abroad-most-welcoming-countries-in-europe.html\">welcomed with open arms</a>.</p></div><h2><a></a>3. 'You'll be lonely'</h2><div><p>Of course you'll miss family and friends, but community abroad often forms faster than you'd expect.</p><p>Other Americans and English-speaking foreigners are eager to connect. Between meetups, language exchanges, and expat events, you'll have no shortage of opportunities to meet people.</p><p>That said, deep friendships take time. I'm an extrovert, and it still took me around 2.5 years to feel like I had a strong community in Madrid. Many of <a target=\"_blank\" href=\"https://www.cnbc.com/2025/04/10/these-things-are-crucial-to-happy-friendships-says-connection-expert.html\">my closest friendships</a> came from hosting my own meetups.</p><p>For deeper integration, friendships with locals are key, though those are definitely harder to form. Many locals already have tight circles, and breaking in takes patience and persistence. Learning the language is essential, and it takes time. Most people are still beginners after a year.</p></div><h2><a></a>4. 'Life abroad is perfect'</h2><div><p>Living abroad can absolutely improve your quality of life — whether it's a slower pace, a relatively lower cost of living, or easier travel, there's a lot to love. But it's not a fairy tale.</p><p>You'll still deal with bureaucracy, taxes, and logistics like finding an apartment, setting up bank accounts, and making appointments with doctors. And sometimes the grocery store will just be closed on a Sunday when you need it most.</p><p>The hardest challenges are often personal. I'll never forget when I got the call that my father had passed away. It was in 2009, during one of my earlier stints in Spain, getting my master's degree. I learned then that the highs and lows of life still happen abroad, and the lows are tougher when you're far from home.</p></div><h2><a></a>5. 'Where you start is where you have to stay'</h2><div><p>Your first move abroad doesn't have to be your forever home. Think of it as a starting point, not a lifelong commitment. As someone once told me: It's a move, not a marriage. </p><p>When I moved to Madrid in 2015, I thought I'd never leave. But in 2020, I moved to Málaga, and now I'm considering heading back to Madrid again.</p><p>I've seen this with others, too. <a href=\"https://podcasts.apple.com/us/podcast/still-saying-yes-how-cindy-built-a-life-abroad-in-her-60s-ep-56/id1449428314?i=1000694368757\" target=\"_blank\">Cindy Sheahan</a>, for example, moved to Porto, Portugal, but then decided Italy was a better fit and relocated there a year later.</p><p>Giving yourself permission to pivot can help you <a target=\"_blank\" href=\"https://www.cnbc.com/2025/06/02/avoid-this-common-trap-that-makes-decisions-harder-and-your-life-worse-take-simple-steps-instead.html\">avoid getting stuck in research paralysis</a>, trying to make the \"perfect\" choice before you even start. There are plenty of things you just won't know until you've actually moved.</p></div><h2><a></a>6. 'It's too late for me'</h2><div><p>I was 35 when I moved and thought I was already too old. At the time, I only knew of students and <a target=\"_blank\" href=\"https://www.cnbc.com/2025/06/03/55-year-old-american-who-retired-in-portugal-shares-myths-about-living-abroad-as-an-expat.html\">retirees moving abroad</a>, not people in the middle of their careers. But at 45, I can say without hesitation that it was the best decision I've ever made.</p><p>And once I got here, I met so many people my age and older who had done the same. People make the leap at every age — 30s, 40s, 50s, even 70s.</p><p>In fact, moving in your 30s or later has advantages, since people tend to arrive with more financial stability, better <a target=\"_blank\" href=\"https://www.cnbc.com/2024/08/01/wharton-psychologist-adam-grant-to-know-yourself-better-try-this.html\">self-awareness</a>, and the wisdom to navigate challenges with perspective.</p><p><em><strong>Cepee Tabibian</strong> is the founder of </em><a href=\"https://shehitrefresh.com/\" target=\"_blank\"><em>She Hit Refresh</em></a><em>, a community and resource platform that helps women aged 30+ move abroad. She's the author of \"</em><a href=\"https://shehitrefresh.com/visaguide\" target=\"_blank\"><em>I'm Outta Here! An American's Ultimate Visa Guide to Living in Europe</em></a><em>\" and host of the </em><a href=\"https://podcasts.apple.com/us/podcast/she-hit-refresh-move-abroad-after-30/id1449428314\" target=\"_blank\"><em>She Hit Refresh podcast.</em></a><em> As the daughter of Colombian and Iranian immigrants, Cepee grew up in Houston, Texas, before becoming an immigrant herself in Spain. For tips and real talk on how to move abroad, follow her </em><a href=\"https://www.instagram.com/shehitrefresh/\" target=\"_blank\"><em>@shehitrefresh</em></a></p><p><em><strong>Want to be your own boss?</strong> Sign up for Smarter by CNBC Make It's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue. Sign up today with coupon code EARLYBIRD for an introductory discount of 30% off the regular course price of $127 (plus tax). Offer valid September 16 through September 30, 2025.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108191324-Vanessa-Berlin-Thumb1-6.jpg?v=1756387846&w=750&h=422&vtcrop=y\" alt=\"I'm much happier living in Berlin than in the U.S. — here's how much it costs\" /><span></span><span><span></span></span></p></div></div>"
  },
  {
    "title": "The No. 1 money move for neurodivergent savers, according to a money coach",
    "url": "https://www.cnbc.com/2025/09/28/the-no-1-money-move-for-neurodivergent-savers-according-to-a-money-coach.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204179-1758833136710-gettyimages-1322215349-jccmf02561.jpeg?v=1758833174&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-28T13:45:01.000Z",
    "description": "Struggling to stay on top of your money is not a unique problem.But neurodivergent people — such as those with autism or ADHD — can face a unique set of challenges when managing their finances, says Andrea...",
    "body": "<div><div><p>Struggling to stay on top of your money is not a unique problem.</p><p>But neurodivergent people — such as those with <a target=\"_blank\" href=\"https://www.cnbc.com/2023/07/31/ellie-middleton-learned-she-has-adhd-autism-in-her-20s-now-she-shares-her-experiences.html\">autism or ADHD</a> — can face a unique set of challenges when managing their finances, says Andrea Ewalefo, founder of <a href=\"https://www.modernladyvibes.com/\" target=\"_blank\">Modern Lady Vibes</a>, a financial coaching business specializing in neurodivergent women of color.</p><p>One of these challenges is something called <a href=\"https://my.clevelandclinic.org/health/symptoms/23224-executive-dysfunction\" target=\"_blank\">executive dysfunction</a>. It can crop up in variety of areas — \"anything from your impulsivity, to your ability to make decisions, to your to your ability to be consistent,\" Ewalefo says. \"Time blindness is another one, you get caught up in certain experiences. Or you don't have enough dopamine to keep you focused for a long period of time.\"</p><p>If any of this sounds like you, the <a target=\"_blank\" href=\"https://www.cnbc.com/2023/05/23/why-the-50-30-20-budgeting-rule-is-out-of-reach-for-most-americans.html\">traditional approach to managing money</a> you've been taught may not work for you, says Ewalefo, herself a member of the neurodivergent community.</p><p>\"A lot of the things people in the financial education space get caught up in is throwing systems in people's faces,\" she says. For neurodivergent folks, \"we struggle with not only getting the systems set up, but sticking to them, or getting emotionally invested in them.\"</p><p>Ewalefo knows that no two people have the exact same concerns when it comes to money, and tries to meet clients where they are. Her advice for nearly all of them: \"Don't beat yourself up.\" And whenever possible, try to automate and delegate the financial tasks that drain you the most, so you can focus more on achieving your money goals.</p></div><h2><a></a>Removing decision fatigue can make it easier to manage your money</h2><div><p>For some neurodivergent people, the \"<a href=\"https://health.clevelandclinic.org/spoon-theory-chronic-illness\" target=\"_blank\">spoon theory</a>,\" can serve as a useful metaphor for a daily store of energy that's depleted by doing tasks.</p><p>\"Brushing your teeth — things that neurotypical people just wake up and do — we have to consciously think about, and it uses our energy, our spoons,\" Ewalefo says. \"This morning brushing my teeth might take ten spoons. Yesterday it took two.\"</p><p>The idea is that you have a set amount of spoons for the day, and once they're gone, you're completely mentally spent, \"a log on the floor,\" Ewalefo says.</p><p>For many of Ewalefo's clients, the first step to getting on track financially is about taking money-related spoons off the table.</p><p>\"If we can remove as much decision fatigue as possible, particularly within our financial planning, then that can help preserve our energy to do other things,\" she says. \"What that might look like is automating as much as possible.\"</p><p>Ewalefo recommends setting your bill due dates to align with the days you get paid. If you're paid once a month, for instance, set up autopay for all your bills on payday.</p><p>\"Since it's happening right when you get that paycheck, once your bills are paid, everything left is just free spending money,\" she says. \"Now have the freedom to enjoy your impulse buying without worrying about the fact that, oh no, I just spent my car payment.\"</p><p>What's more, setting rote financial tasks on autopilot can allow you to dedicate more of your mental energy to the money goals you really care about. To make progress on those, she says, you'll also have to pay yourself from each check — and that can be put on autopilot, too.</p><p>\"It's not just the bills or the debt, it's also auto-drafting your savings and investing needs so that those are prioritized just as much as your rent, just as much as your water bill,\" Ewalefo says. \"And all of that money has been set aside and put where it needs to go, so whatever is left in your account can literally just be spent on whatever you want.\"</p><p><em><strong>Last chance to save: Want to be your own boss?</strong> Final days to get 30% off Smarter by CNBC Make It's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue. Use coupon code EARLYBIRD for an introductory discount from September 16 through September 30, 2025.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108198999-250912-mi-06-mm-perraut-lexington-fine-v200_07_35_13Still023.png?v=1757965996&w=750&h=422&vtcrop=y\" alt=\"I found a high-paying health-care job without going to medical school\" /><span></span><span><span></span></span></p></div></div>"
  },
  {
    "title": "President Trump posts cartoon image depicting him firing Fed Chief Powell",
    "url": "https://www.cnbc.com/2025/09/27/trump-cartoon-firing-powell-fed.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108176780-17533928602025-07-24t211046z_1404996714_rc28tfahau0e_rtrmadp_0_usa-trump-fed.jpeg?v=1753392902&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-27T21:29:47.000Z",
    "description": "U.S. President Donald Trump passes a document to Federal Reserve Chair Jerome Powell to fact-check the numbers during a tour of the Federal Reserve Board building, which is currently undergoing renovations,...",
    "body": "<div><div><p>U.S. President Donald Trump passes a document to Federal Reserve Chair Jerome Powell to fact-check the numbers during a tour of the Federal Reserve Board building, which is currently undergoing renovations, in Washington, D.C., U.S., July 24, 2025. </p><p>Kent Nishimura | Reuters</p></div><div><p>President Donald Trump posted on Saturday a cartoon image depicting him firing Federal Reserve Chairman Jerome Powell.</p><p>The post on Truth Social was an <a href=\"https://truthsocial.com/@realDonaldTrump/115277743579526288\" target=\"_blank\">image</a> of himself pointing his finger and shouting \"YOU'RE FIRED!\" to Powell, who was holding a box with his belongings. Behind them is a depiction of the seal of the Federal Reserve.</p><p>The image appears to be \"AI-generated or digitally illustrated,\" according to visual analysis by ChatGPT.</p><p>Trump has repeatedly criticized Powell for his cautious approach to cutting interest rates, nicknaming him \"Too Late Powell.\" The latest threat came even as the central bank lowered rates earlier this month for the first time this year. Powell's term as chair ends in May 2026.</p><p>The White House didn't immediately respond to CNBC's request for comment.</p><p>Firing the top central banker would be unprecedented as no U.S. president ever has attempted to do so, though others have criticized prior Fed chairs. A recent <a target=\"_blank\" href=\"https://www.cnbc.com/2025/05/22/supreme-court-federal-reserve-trump.html\">Supreme Court decision</a> indicated that the president does not have the authority to remove Fed officials at will.  Powell has said repeatedly that his firing is \"not permitted under the law.\"</p><p>The Trump White House has blasted Powell over renovations to the Fed's Washington headquarters, raising suspicion that Trump could try to remove the Fed leader for cause. Although lately Trump has eased his criticisms of the Fed building, while continuing to be vocal about Powell hurting the economy by keeping rates too high in his view.</p><p>Trump attempted to fire Fed Governor Lisa Cook in August on alleged mortgage fraud. The Supreme Court is set to rule on that matter soon. The Department of Justice on Friday <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/trump-fed-cook-scotus-markets.html\">said</a> in a Supreme Court filing that firing Cook for alleged misconduct would not harm the financial markets. Cook's attorneys argued in a prior filing to the high court that her removal could ruin Fed independence.</p><p>So far, the financial markets have shown little reaction to Trump's Powell threats or Cook's attempted firing. Though many economists and investors believe firing Powell before his term ends could cause longer-term interest rates to rise on the notion the Fed would start to act in Trump's interests and not according to its dual mandate from Congress of stable inflation and low unemployment.</p></div></div>"
  },
  {
    "title": "This CEO is working to make a critical test for women's health more accessible: 'Even if the visit's free,' there are other barriers, she says",
    "url": "https://www.cnbc.com/2025/09/27/this-ceo-is-working-to-make-a-critical-test-for-womens-health-more-accessible.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204488-1758896971376-Kara_Egan_Headshot.jpg?v=1758900343&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-27T15:00:01.000Z",
    "description": "Despite the prevalence of cervical cancer diagnoses and deaths in the United States, data shows that screening for the cancer is on a consistent decline.Each year in the U.S., around 4,000 women die from...",
    "body": "<div><div><p>Despite the prevalence of cervical cancer diagnoses and deaths in the United States, <a href=\"https://aacrjournals.org/cebp/article-abstract/34/6/836/762621/Prevalence-and-Review-of-Major-Modifiable-Cancer?redirectedFrom=fulltext\" target=\"_blank\">data</a> shows that screening for the cancer is on a consistent decline.</p><p>Each year in the U.S., around 4,000 women die from cervical cancer, and about 13,000 are diagnosed with the disease, according to the <a href=\"https://www.cdc.gov/cervical-cancer/statistics/index.html\" target=\"_blank\">Centers for Disease Control and Prevention</a>.</p><p>The most effective way to prevent cervical cancer is receiving the HPV vaccine, which offers protection against the HPV types that most frequently cause it, the <a href=\"https://www.cdc.gov/cervical-cancer/prevention/index.html\" target=\"_blank\">CDC states</a>. It's also important for women to get screened for the disease.</p><p>One common test for cervical cancer detection is a Pap smear, which doctors recommend once every three years for women between the ages of 21 and 65. Women ages 30 to 65 can also receive an HPV test and a Pap test every five years, or get tested for HPV alone every five years.</p><p>But, a recent report from the American Cancer Society shows that the <a href=\"https://www.cancer.org/research/acs-research-news/not-enough-females-are-being-screened-for-cervical-cancer.html\" target=\"_blank\">rate of cervical cancer screenings fell</a> during the Covid-19 pandemic, and haven't recovered.</p><p><a href=\"https://www.getteal.com/people/kara-egan\" target=\"_blank\">Kara Egan</a>, a health tech investor, saw a need for making Pap smears more accessible. She co-founded Teal Health, a healthcare company that created the <a href=\"https://www.getteal.com/teal-wand\" target=\"_blank\">Teal Wand</a>, the first FDA-approved cervical screening test that can be done at home.</p><p>\"What drove me to start Teal is just that women deserve better healthcare,\" says Egan, who is also the company's CEO.</p><p>\"And what does better look like? It looks like listening to a woman and seeing what she needs.\"</p></div><h2><a></a>'Even if the visit's free, you had to leave work, you had to get childcare'</h2><div><p>For Egan and her team, accessibility was a huge focus when creating the concept for the Teal Wand.</p><p>\"It's like, 'What are all of the touch points that we can do to make something easier for a woman, but to also build that trust with her, that she matters and that we care?\" Egan tells CNBC Make It.</p><p>\"I think a lot of them can be done in ways that you wouldn't expect or that healthcare doesn't do.\"</p><p>Before receiving a Teal Wand, customers must go through the screening process with a doctor who helps them determine their eligibility based on their insurance coverage, and teaches them how to properly use the wand to get an accurate sample.</p><p>\"We're doing the exact same test that's used in the doctor's office with the same accuracy, that's what our clinical trials show, but just you're collecting the sample at home,\" Egan explains.</p></div><div><p>The Teal Wand is the first FDA-approved cervical screening test that can be done at home.</p><p>Courtesy of Teal Health.</p></div><div><p>Once the sample is collected and tested, the results are shared via the company's online portal, and patients can connect to a medical provider<strong> </strong>via a tele-health visit to talk through next steps if a follow-up is needed.</p><p>What's unique about the process is that everything, from the screening process to the collection and receiving results is done from home. Egan says, that is by design, to make the process easier for people who struggle to get to in-person doctor's visits.</p><p>\"Cost is important, and it's critically important to us, [but] that's not the main barrier a lot of times for people,\" she says.</p><p>\"There's also the cost of going into the doctor's office. Even if the visit's free, you had to leave work, you had to get childcare, you had to [find] transportation.\"</p></div><h2><a></a>'Over 50% of women getting screened with Teal have been behind on their screening'</h2><div><p>The Teal Wand is now available in California, New York and Florida. Teal Health is in network with Cigna, Blue Cross Blue Shield, Aetna, Anthem Blue Cross and United Healthcare.</p><p>\"We're able to take [care of] the telehealth portion, and then a woman pays $99. But we are working with insurers to get the full thing covered,\" Egan says.</p><p>\"Even with a $99 charge, we're seeing over 50% of women who are getting screened with Teal have been behind on their screening, and 20% of them had never been screened before, and were well within screening age.\"</p><p>The driving factor for founding Teal Health for Egan and her team was to spread awareness of the importance of cervical cancer screening, and to offer a new option for testing, Egan notes.</p><p>\"Cervical cancer is entirely preventable if you get screened,\" she says. \"There are new ways to do it. One is in the office and one is at home, but they're highly accurate, and you should be doing it.\"</p><p><em><strong>Last chance to save: Want to be your own boss?</strong> Final days to get 30% off Smarter by CNBC Make It's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue. Use coupon code EARLYBIRD for an introductory discount from September 16 through September 30, 2025.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108112030-250211-mi-10-fe-ritual-vitamins-dirty_Copy_0100_10_31_18Still005.jpg?v=1741276914&w=750&h=422&vtcrop=y\" alt=\"I quit my job while pregnant to start a multivitamin company that brings in over $250M/Yr\" /><span></span><span><span></span></span></p></div></div>"
  },
  {
    "title": "Trump threatens mass firings of federal workers if government shutdown isn't averted, NBC News reports",
    "url": "https://www.cnbc.com/2025/09/28/trump-mass-firings-government-shutdown.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204711-17589181332025-09-26t201907z_1584268328_rc2wzgay6p3d_rtrmadp_0_usa-trump.jpeg?v=1758918169&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-28T20:10:43.000Z",
    "description": "U.S. President Donald Trump gestures, as he arrives at Joint Base Andrews, Maryland, U.S., Sept. 26, 2025.Elizabeth Frantz | ReutersPresident Donald Trump warned Sunday of widespread layoffs if the federal...",
    "body": "<div><div><p>U.S. President Donald Trump gestures, as he arrives at Joint Base Andrews, Maryland, U.S., Sept. 26, 2025.</p><p>Elizabeth Frantz | Reuters</p></div><div><p>President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> warned Sunday of widespread layoffs if the <a target=\"_blank\" href=\"https://www.cnbc.com/government-shutdown/\">federal government</a> shuts down this week, telling NBC News that \"we are going to cut a lot of the people that ... we're able to cut on a permanent basis.\"</p><p>\"[I'd] rather not do that,\" he told <a href=\"https://www.nbcnews.com/author/yamiche-alcindor-ncpn1294685\" target=\"_blank\">NBC News</a> in an exclusive interview.</p><p>The White House is doubling down on warnings that thousands of government jobs could be on the line if the government shuts down at midnight on Tuesday.</p><p>The Trump administration <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-government-shutdown-layoffs-omb.html\">last week told federal agencies</a> to begin preparing for mass firings if Congress does not agree to a deal to avert a shutdown. If the White House follows through on its threat, it would mark a break from precedent, as federal employees are typically furloughed in such cases.</p><p>When there was a full government shutdown in 2013, for instance, about 850,000 employees were furloughed, according to the <a href=\"https://www.crfb.org/papers/government-shutdowns-qa-everything-you-should-know\" target=\"_blank\">Committee for a Responsible Federal Budget.</a></p></div><div><h2>Read more CNBC government shutdown coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/government-shutdown-trump-democrats-republicans-health-care.html\">GOP leaders say Obamacare tax credit fight can wait until after shutdown is averted</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/trump-government-shutdown-golf-jeffries-ryder-cup.html\">Top Democrat slams Trump for attending Ryder Cup golf event as shutdown looms</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/government-shutdown-jobs-economy-trump.html\">Here's what to know about a federal government shutdown</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/health-aca-obamacare-federal-government-shutdown.html\">Health providers could lose $32 billion if ACA credits at center of shutdown fight expire</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-healthcare-government-shutdown-congress.html\">Democrats dig in on health care demands with government shutdown days away</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-government-shutdown-layoffs-omb.html\">Trump OMB orders prep for mass firings of federal workers if government shuts down</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-democrats-shutdown-schumer-jeffries.html\">Trump cancels meeting with top Democrats as government shutdown looms</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/trump-schumer-jeffries-government-funding-.html\">Trump to meet top Dems as their health care demands fuel government shutdown risk</a></li></ul></div></div><div><p>The warning of potential mass firings — which was made via a memo released by the <a href=\"https://www.whitehouse.gov/omb/\" target=\"_blank\">Office of Management and Budget</a> — marked a significant escalation of pressure on congressional lawmakers to head off a shutdown.</p><p>Still, with less than three days until the government funding deadline, lawmakers remain <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/government-shutdown-trump-democrats-republicans-health-care.html\">far apart on negotiations</a>, increasing the chances of a shutdown.</p></div></div>"
  },
  {
    "title": "JD Vance ‘confident' the U.S. has 'successfully separated' TikTok from China parent company ByteDance",
    "url": "https://www.cnbc.com/2025/09/28/jd-vance-trump-tiktok-china-bytedance.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204798-1759074414732-gettyimages-2193544069-jdv_0004_wiwwlqil.jpeg?v=1759074625&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-28T17:58:23.000Z",
    "description": "Vice President JD Vance visits \"Fox News Sunday\" on January 11, 2025.Paul Morigi | Getty Images Entertainment | Getty ImagesVice President JD Vance on Sunday said he is optimistic about the future of TikTok...",
    "body": "<div><div><p>Vice President JD Vance visits \"Fox News Sunday\" on January 11, 2025.</p><p>Paul Morigi | Getty Images Entertainment | Getty Images</p></div><div><p>Vice President <a target=\"_blank\" href=\"https://www.cnbc.com/jd-vance-us-vice-president/\">JD Vance</a> on Sunday said he is optimistic about the future of TikTok in the U.S.</p><p>\"I feel very confident that we have successfully separated this company from TikTok global and actually made it so that we can control people's data security,\" he said on \"<a href=\"https://www.foxnews.com/video/6380220428112\" target=\"_blank\">Fox News Sunday</a>.\" \"We can ensure that the algorithm is not being used as a propaganda tool by a foreign government.\"</p><p>The popular social media platform has long faced concerns about its data collection practices and parent company ByteDance's relationship with the Chinese government.</p><p>After months of uncertainty following former President <a target=\"_blank\" href=\"https://www.cnbc.com/joe-biden/\">Joe Biden's</a> signing of a <a target=\"_blank\" href=\"https://www.cnbc.com/2024/12/16/tiktok-asks-supreme-court-to-block-us-ban-pending-appeal.html\">national security law</a> effectively banning TikTok from U.S. app stores, President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> signed <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-approves-tiktok-deal-through-executive-order.html\">an executive order</a> on Thursday approving a proposal that would allow TikTok to continue operating in the country.</p><p>\"The way that we've set up this deal from a national security perspective is that it's the American investors and the American businesspeople who will make the determination about what's actually happening with TikTok,\" said Vance, who <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-approves-tiktok-deal-through-executive-order.html\">has said</a> the agreement values TikTok's business at $14 billion.</p><p>Under the terms of Trump's executive order, a new joint-venture company would oversee TikTok's U.S. business, with ByteDance retaining less than a 20% stake. Among the company's investors would be tech giant <a target=\"_blank\" href=\"https://www.cnbc.com/quotes/ORCL/\">Oracle</a>, private-equity firm Silver Lake and the Abu Dhabi-based MGX investment fund.</p></div><div><h2>Read more CNBC politics coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/curtis-sliwa-new-york-mayor-trump-mamdani-cuomo.html\">New York City mayor candidate Curtis Sliwa says he was offered money to quit race</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/elizabeth-warren-trump-rolex-tennis-invite-apple-nvidia.html\">Trump's tennis invite from Rolex echoes Apple, Nvidia playbook for currying favor, Warren says</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/24/ice-shooting-dallas-noem.html\">2 dead in Dallas ICE shooting, including suspect; FBI eyes ideological motive</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-un-ga-speech.html\">Trump UN escalator snafu: White House wants investigation of sudden stop</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-democrats-shutdown-schumer-jeffries.html\">Trump cancels meeting with top Democrats as government shutdown looms</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/europes-work-life-balance-could-be-key-in-trumps-h-1b-visa-shake-up.html\">Europe's work-life balance a key talent draw as Trump revamps H-1B visa</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-xi-meeting-likely-to-happen-early-next-year-says-ambassador.html\">Trump-Xi meeting likely to happen next year, says U.S. ambassador to China</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/trump-schumer-jeffries-government-funding-.html\">Trump to meet top Dems as their health care demands fuel government shutdown risk</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/trump-ftc-supreme-court-slaughter.html\">Supreme Court lets Trump fire FTC's Slaughter for now</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/jimmy-kimmel-abc-sacramento-shooting-epstein-kirk.html\">Jimmy Kimmel suspension, Trump book, Epstein note eyed in ABC affiliate shooting</a></li></ul></div></div><div><p>ByteDance investors, including General Atlantic, Susquehanna, and Sequoia, are expected to contribute equity in the new TikTok U.S. entity. According to the deal, the federal government would not take an equity stake — or a so-called <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/tiktok-golden-share-equity-trump.html\">golden share</a> — in TikTok's U.S. operations.</p><p>\"At the end of the day, I believe that north of 80% of the company will be owned by the American investors and their partners,\" said Vance. \"This is not something where the Chinese or any Chinese entity has a large stake of the table.\"</p><p>On the day he signed the executive order, Trump said Chinese President <a target=\"_blank\" href=\"https://www.cnbc.com/xi-jinping/\">Xi Jinping</a> gave the deal the go ahead, while Vance said the Chinese government had some resistance to the deal.</p><p>So far, ByteDance has not acknowledged Trump's executive order, nor has it confirmed that the transaction is actually taking place. There has also been no indication that the Chinese government has made any changes to laws that would be necessary for a deal to occur.</p></div></div>"
  },
  {
    "title": "GOP leaders say Obamacare tax credit fight can wait until after government shutdown is averted",
    "url": "https://www.cnbc.com/2025/09/28/government-shutdown-trump-democrats-republicans-health-care.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108193967-17569326742025-09-03t203804z_1739067203_rc2kkgavemog_rtrmadp_0_usa-congress.jpeg?v=1756932691&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-28T18:12:35.000Z",
    "description": "U.S. Senate Majority Leader John Thune (R-SD) speaks to members of the media alongside fellow Republicans during a press conference following Republicans weekly policy lunch on Capitol Hill in Washington,...",
    "body": "<div><div><p>U.S. Senate Majority Leader John Thune (R-SD) speaks to members of the media alongside fellow Republicans during a press conference following Republicans weekly policy lunch on Capitol Hill in Washington, D.C., U.S., September 3, 2025. </p><p>Nathan Howard | Reuters</p></div><div><p>As <a target=\"_blank\" href=\"https://www.cnbc.com/congress/\">congressional</a> Democrats push to tie extending <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/health-aca-obamacare-federal-government-shutdown.html\">Affordable Care Act</a> insurance subsidies to the government funding fight, Republican leaders say they're willing to debate the issue — but not until after a shutdown is averted.</p><p>\"The Obamacare subsidies is a policy debate that has to be determined by the end of the year ... not right now, while we're simply trying to keep the government open,\" House Speaker <a href=\"https://mikejohnson.house.gov/\" target=\"_blank\">Mike Johnson</a>, R-La., said on CNN's \"State of the Union.\"</p><p>His comments were echoed by Senate Majority Leader <a href=\"https://www.nbcnews.com/politics/congress/thune-gop-funding-bill-democrats-holding-government-host-rcna233878\" target=\"_blank\">John Thune</a>, R-S.D., who called the ACA, also known as Obamacare, a program \"in desperate need of reform.\"</p><p>\"We acknowledge that there's gonna have to be — hopefully there'll be some steps taken that can address the concerns that Democrats have,\" he said on <a href=\"https://www.nbcnews.com/politics/congress/thune-gop-funding-bill-democrats-holding-government-host-rcna233878\" target=\"_blank\">NBC News' \"Meet the Press.\"</a> \"But you can't do this by Tuesday.\"</p><p>Their comments threw cold water on Democrats' main sticking point just days before the government is <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/government-shutdown-jobs-economy-trump.html\">poised to shut down</a>.</p><p>If the ACA tax credits expire at the end of the year, premiums could soar for millions of Americans, a reality that could prove to be a political vulnerability for Republicans ahead of the 2026 midterm elections.</p><p>With the budget funding deadline looming, President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> is poised <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/trump-to-meet-with-top-congressional-leaders-as-a-government-shutdown-looms.html\">to meet</a> on Monday with the top four congressional leaders — Johnson, Thune, House Minority Leader Hakeem Jeffries, D-N.Y., and Senate Minority Leader <a target=\"_blank\" href=\"https://www.cnbc.com/chuck-schumer/\">Chuck Schumer,</a> D-N.Y.</p><p>The scheduled meeting comes after Trump last week <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-democrats-shutdown-schumer-jeffries.html\">abruptly cancelled a meeting</a> with Democratic leadership, saying that no meeting \"could possibly be productive.\"</p></div><div><h2>Read more CNBC government shutdown coverage</h2><div><ul><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/28/government-shutdown-trump-democrats-republicans-health-care.html\">GOP leaders say Obamacare tax credit fight can wait until after shutdown is averted</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/trump-government-shutdown-golf-jeffries-ryder-cup.html\">Top Democrat slams Trump for attending Ryder Cup golf event as shutdown looms</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/26/government-shutdown-jobs-economy-trump.html\">Here's what to know about a federal government shutdown</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/health-aca-obamacare-federal-government-shutdown.html\">Health providers could lose $32 billion if ACA credits at center of shutdown fight expire</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-healthcare-government-shutdown-congress.html\">Democrats dig in on health care demands with government shutdown days away</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/25/trump-government-shutdown-layoffs-omb.html\">Trump OMB orders prep for mass firings of federal workers if government shuts down</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/23/trump-democrats-shutdown-schumer-jeffries.html\">Trump cancels meeting with top Democrats as government shutdown looms</a></li><li><a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/trump-schumer-jeffries-government-funding-.html\">Trump to meet top Dems as their health care demands fuel government shutdown risk</a></li></ul></div></div><div><p>It remains unclear whether the 11th-hour meeting will yield a deal that averts a shutdown on Tuesday at midnight.</p><p>\"[Trump] wants to talk with Chuck Schumer and Hakeem Jeffries and just try to convince them to follow common sense and do what's right by the American people,\" Speaker Johnson said Sunday.</p><p>Schumer, for his part, <a href=\"https://www.nbcnews.com/politics/congress/schumer-negotiation-gop-trump-government-funding-shutdown-rcna233895\" target=\"_blank\">said</a> that the prospect of a government shutdown \"depends on the Republicans.\"</p><p>\"We need the meeting. It's a first step, but only a first step. We need a serious negotiation,\" Schumer said on <a href=\"https://www.nbcnews.com/politics/congress/schumer-negotiation-gop-trump-government-funding-shutdown-rcna233895\" target=\"_blank\">NBC News' \"Meet the Press.\"</a></p><p>Democrats have repeatedly insisted that any government funding proposal include an extension of the Obamacare tax credits.</p><p>They remained firm with their demands on Sunday.</p><p>\"We actually need to enact legislation to ensure that the Affordable Care Act tax credits are extended,\" Jeffries said, warning that \"notices\" are set to begin going out for the millions of Americans who rely on the subsidies.</p><p>Republicans, however, argue that there is still time to hammer out a deal on the subsidies.</p><p>\"That doesn't happen until the end of the year,\" Thune said during an interview on <a href=\"https://www.nbcnews.com/politics/congress/thune-gop-funding-bill-democrats-holding-government-host-rcna233878\" target=\"_blank\">NBC News' \"Meet the Press.\"</a></p><p>\"We can have that conversation, but before we do, release the hostage, set the American people free, keep the government open.\"</p><p>Republicans in the Senate need eight Democrats to vote with them to pass their continuing resolution through the upper chamber, Thune said, a prospect that, at this point, seems difficult.</p></div></div>"
  },
  {
    "title": "Trump's H-1B visa fee could have one big winner: The Middle East",
    "url": "https://www.cnbc.com/2025/09/28/trumps-h-1b-visa-fee-could-have-one-big-winner-the-middle-east.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204781-1758957764509-gettyimages-2197242148-AFP_36X97JY.jpeg?v=1758957809&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-28T06:08:14.000Z",
    "description": "People walk on Creek Harbour as the Dubai skyline with Burj Khalifa, the world's largest building (C) is seen in the background on February 5, 2025.Fadel Senna | Afp | Getty ImagesThe Middle East could emerge...",
    "body": "<div><div><p>People walk on Creek Harbour as the Dubai skyline with Burj Khalifa, the world's largest building (C) is seen in the background on February 5, 2025.</p><p>Fadel Senna | Afp | Getty Images</p></div><div><p>The Middle East could emerge as the major beneficiary of U.S. President <a target=\"_blank\" href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a>'s plan for higher <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/20/trump-h-1b-visa-tech-foreign-governments.html\">H-1B visa</a> fees.</p><p>The Gulf region's sustained push to become the next global artificial intelligence hub – which is drawing billions of dollars of investment from local sovereign wealth funds, global private equity and U.S. Big Tech – could see it outflank other geographies hoping to snap up foreign expertise caught up in the uncertainty.</p><p>Investors highlighted how governments are driving technology-focused national strategies – such as Saudi Arabia's Vision 2030 and the UAE's National AI Strategy – and creating a business-friendly environment for tech firms with long-term golden visas for skilled professionals, reduced regulations and other incentives for entrepreneurs.</p><p>\"Gulf countries, particularly Saudi Arabia, are offering comp packages among the highest in the world to capture top AI-talent from Silicon Valley,\" said Francesco Filia, CEO of Fasanara Capital.</p><p>Filia said tech pros are drawn to the Middle East by a mix of top-tier compensation, a tax-friendly environment, and the opportunity to work on large-scale, innovative projects.</p><p>\"The Gulf also offers a cosmopolitan lifestyle with high-quality infrastructure and access to everything Asia has to offer,\" Filia told CNBC.</p><p>While details of White House plans to require companies to pay a $100,000 fee on H1-B applications remain unclear, the move is expected to intensify the <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/22/h-1b-visa-what-trumps-100000-fee-means-for-top-global-talent-hubs.html\">global war for tech talent</a>.</p><p>\"Tech companies in the UAE find the flexibility of the labor market for hiring top foreign talent to be a key advantage,\" Zachary Cefaratti, founder and executive group chairman of Dalma Capital, told CNBC.</p><p>\"The impact of increasing foreign labor limitations in other countries only increases the UAE's relative attractiveness as a talent hub\" he added.</p></div><div><p>President Donald Trump signs an executive order in the Oval Office at the White House on September 19, 2025 in Washington, DC. </p><p>Andrew Harnik | Getty Images</p></div><div><p>The U.K. and Europe, whose tech sectors have a comparative lack of support and funding, could struggle to attract key expertise, while the often-hostile tone underpinning the public debate around immigration could put off prospective hires coming to the region.</p><p>\"In the UAE, talented people are welcomed with open arms,\" Simon Hopkins, CEO of Milltrust International Group, told CNBC.<strong> </strong>\"The U.S. and the U.K. have both shot themselves in the foot with ill-considered immigration policies. The focus should be on eliminating illegal immigration — not driving away valuable contributors to economic success.\"</p><p>Hopkins said mobility will prove a key driver of the global economy and will ultimately help shape its winners and losers.</p></div><h2><a></a>Not just a stepping stone</h2><div><p>\"What sets the UAE apart is its ability to combine ambition with infrastructure, creating an environment where innovation moves quickly and gains real traction,\" Amina Taher, CMO at digital financial platform Wio Bank, told CNBC.</p><p>The UAE, which struggled to retain talent outside of the oil and gas industry about 15 years ago, has since built a commercial and financial hub that it hopes will rival London and New York.</p><p>\"Increasingly, top technology and fintech talent see the region not just as a stepping stone, but as a place to build, grow, and contribute meaningfully,\" Taher said.</p><p>At the forefront of the UAE's strategy are its visa options, ranging from options for creators, freelancers and self-employed workers to the coveted Golden Visa, a 10-year stamp that is not tied to an employer.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108204349-1758876215091-1758875727-41822364508-hd.jpg?v=1758876217&w=750&h=422&vtcrop=y\" alt=\"H-1B visa turmoil: who stands to gain\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div><div><p>In April, Saudi Arabia unveiled a National Skills Platform aimed at strengthening its workforce training and development, as part of a wider strategy to address global shifts arising from AI and automation.</p><p>\"Saudi Arabia's futuristic <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/18/saudi-arabias-the-line-at-neom-is-reviewed-as-it-considers-its-megaprojects.html\">NEOM city</a> and the UAE's AI-powered smart city projects offer unique, large-scale opportunities for tech pros,\" Filia said. \"Working on these state-of-the-art data centres being built will train a new generation to support AI-driven urban development, fintech, and logistics.\"</p></div><h2><a></a>Retaining top talent</h2><div><p>While countries like the UAE and Saudi Arabia could stand to benefit from uncertainly surrounding Trump's new labor policies, not all talent will flock to the Gulf.</p><p>Michael Stull, managing director, ManpowerGroup UK, said there is not a significant pathway into citizenship in many of the Gulf states.</p><p>\"You will still be considered to be on the edge, and not part of the country. So there's a little insecurity that people feel there,\" Stull told told CNBC's \"<a target=\"_blank\" href=\"https://www.cnbc.com/squawk-box-europe/\">Squawk Box Europe</a>\" on Friday.</p><p><a href=\"https://www.nbcnews.com/world/middle-east/netanyahu-address-un-israel-gaza-trump-west-bank-annexation-rcna233836\" target=\"_blank\">Israel's war against Hamas</a> has brought Gulf states like Qatar <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/09/israel-hamas-qatar-doha-attack.html\">directly into the crossfire</a>, raising doubts over the stability and safety of the region for many looking to relocate. The UAE's geography alone, across the Strait of Hormuz from Iran, caused concerns this summer when Iran and Israel <a target=\"_blank\" href=\"https://www.cnbc.com/2025/06/23/how-the-israel-iran-standoff-took-a-turn-and-whats-next-after-a-pivotal-24-hours.html\">traded direct fire</a>, reminding residents across the Gulf that the region still must contend with the stability of its neighbors.</p></div></div>"
  },
  {
    "title": "From PepsiCo to Taco Bell, dirty soda is taking over",
    "url": "https://www.cnbc.com/2025/09/27/dirty-soda-swig-taco-bell-pepsico.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204580-1758905848952-PepsiCo_Dirty_Soda.png?v=1758905926&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-27T12:00:01.000Z",
    "description": "Utah-based drink chain Swig coined \"dirty soda\" back in 2010. Fifteen years later, the trend is fueling innovation everywhere from PepsiCo to McDonald's, infusing the sluggish beverage category with new...",
    "body": "<div><div><p>Utah-based drink chain Swig coined \"dirty soda\" back in 2010. Fifteen years later, the trend is fueling innovation everywhere from <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/PEP/\">PepsiCo</a><span><span></span></span></span> to <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/MCD/\">McDonald's</a><span><span></span></span></span>, infusing the sluggish beverage category with new life.</p><p>\"Dirty soda\" drinks use pop as a base, followed by flavored syrups, cream or other ingredients. While Swig claims credit — and the trademark — for dirty soda, TikTok videos and the reality TV show \"The Secret Lives of Mormon Wives\" have helped the trend spread far and wide, outpacing even the soda chain's speedy expansion.</p><p>Now, consumers can find it nearly everywhere, from grocery store aisles to fast-food chains.</p><p>In a few weeks, Pepsi plans to unveil two ready-to-drink dirty soda-inspired beverages at the National Association of Convenience Stores trade show in Chicago. The new drinks, the Dirty Dew and the Mug Floats Vanilla Howler, follow on the heels of the Pepsi Wild Cherry & Cream flavor, which hit shelves earlier this year.</p><p>\"I think it's a great opportunity for people like us, like PepsiCo, and for consumers to experience soda in a new way — and in some ways, an old way,\" Pepsi Beverages North America Chief Marketing Officer Mark Kirkham told CNBC, comparing the rise of dirty soda to root beer floats and the soda shops of yore.</p></div><div><p>PepsiCo's lineup of dirty soda-inspired drinks includes Pepsi Wild Cherry & Cream, Dirty Mountain Dew and Mug Floats Vanilla Howler.</p><p>Source: PepsiCo</p></div><div><p>Dirty soda has also drawn new interest beyond beverage players. According to Datassential, 2.7% of U.S. eateries offer a carbonated soft drink that includes cream or milk, up from 1.5% a decade ago.</p><p>Newcomers to the trend include TGI Fridays, which launched dirty soda as a limited-time menu item this summer that could be spiked with alcohol. McDonald's is <a target=\"_blank\" href=\"https://www.cnbc.com/2025/07/24/mcdonalds-tests-cosmcs-drinks.html\">testing flavored sodas</a>, like a \"Sprite Lunar Splash,\" at more than 500 locations after winding down its drinks-focused spinoff CosMc's in June. <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/YUM/\">Yum Brands'</a><span><span></span></span></span> Taco Bell has also been offering limited-time menu items, like a dirty Mountain Dew Baja Blast.</p></div><h2><a></a>Swig sets a trend</h2><div><p>These days, Swig has grown to more than 140 locations across 16 states. So far this year, its same-store sales have risen 8.2%, according to the privately held company. The Larry H. Miller Company, an investment firm founded by the former Utah Jazz owner, bought a majority stake in Swig in 2022 for an undisclosed sum.</p><p>\"I think we're doing for soda what Starbucks did for coffee,\" Swig CEO Alex Dunn said.</p><p>As Swig has grown, so have the number of chains looking to emulate its success. Rival soda shops like Sodalicious, Fiiz and Cool Sips are also benefiting from the trend. Coffee shops, like <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/BROS/\">Dutch Bros.</a><span><span></span></span></span>, have also added it to their menus. And now fast-food chains are hopping on the bandwagon.</p><p>\"It validates that this is a category, and McDonald's and Taco Bell wouldn't be getting into it if it wasn't something that had broad appeal that they could sell everywhere, in thousands of locations,\" Dunn said. \"It's kind of flattering that we created a category that now everybody is copying.\"</p><p>For restaurants, adding dirty soda to the menu is easier than it might sound.</p><p>\"It's a custom drink offering that, one, allows the brands to leverage something that they already have right there: their soda machine,\" said Erica Holland-Toll, culinary director at The Culinary Edge, which advises restaurants on food and beverage innovation. \"Two, it incorporates either a one-touch ingredient, or if they're already open for breakfast, it's quite likely that they've got a creamer in house.\"</p><p>On the other hand, offering customizable coffee drinks is usually much more difficult — which has contributed to the struggles at Starbucks.</p><p>\"The espresso world — that's so much more complicated,\" Holland-Toll said.</p><p>Dirty soda also has wide appeal. With less caffeine than coffee, consumers can drink it all day long. Plus, it's \"much more accessible\" than some coffee house trends, like an espresso tonic, according to Holland-Toll. The bright colors of many dirty sodas also make them more attractive to consumers, who were likely introduced to the trend via a TikTok video.</p><p>But perhaps above all, dirty soda can help restaurants draw in customers who are otherwise feeling thrifty.</p><p>\"It's an affordable fun treat. You're not going out and spending $30 or $50, right?\" said Sally Lyons Watt, chief advisor of consumer goods and foodservice insights for Circana. \"It's something that people can walk away saying, 'Wow, that was yummy' or 'I feel better because I just had that.'\"</p></div><h2><a></a>A pop for beverage companies</h2><div><p>Swig drinks.</p><p>Courtesy: Swig</p></div><div><p>A \"fun treat\" for consumers is adding up for beverage companies, helping reverse the decades-long trend of declining soda consumption in the U.S.</p><p>As health concerns mount and the array of beverage options expands, Americans have been drinking less soda for roughly two decades. In 2004, soda consumption peaked at 15.3 billion gallons, according to Beverage Marketing; by 2024, that figure had slid to 11.87 billion gallons. But consumption of carbonated soft drinks has been ticking up in the last two years, with 2025 estimated to reach 11.88 billion gallons. The rise of dirty soda, plus the growing popularity of prebiotic sodas, has likely helped the segment halt its downward trajectory.</p></div><div><p>Over the years, iced coffee has been stealing what the beverage industry calls \"share of throat\" from soda. With dirty soda, consumers can marry their love of customizing a cold drink with the lower caffeine content and taste of soda.</p><p>\"The carbonation makes it feel lighter in your mouth than coffee, for example,\" Holland-Toll said.</p><p>Dirty soda has also been attracting younger consumers who previously didn't drink much Pepsi or Dr Pepper. Swig's core customer base is young women between the ages of 18 and 35, according to Dunn.</p><p>That's true for Holly Galvin, a 31-year-old human resources professional based in Davenport, Iowa. She told CNBC that she rarely drank soda — until she saw dirty soda take the spotlight in the \"The Secret Lives of Mormon Wives\" last year. Now she makes her own dirty soda once or twice a week at home. With the onset of autumn, her go-to recipe these days uses Diet Dr Pepper as a base, with pumpkin spice creamer and a sprinkle of pumpkin pie spice on top.</p><p>Broadly, younger consumers are more inclined to seek out new drinks compared with older cohorts. Nearly three-quarters of Generation Z try a new beverage every month on average, according to Keurig Dr Pepper's 2025 trend report.</p><p>Beverage companies say that they are seeing a broader halo effect for soda as a result of the trend.</p><p>\"For us, it serves as a recruitment tool, bringing new users into the trademark,\" said Katie Webb, vice president of innovation and transformation for <span><a target=\"_blank\" href=\"https://www.cnbc.com/quotes/KDP/\">Keurig Dr Pepper</a><span><span></span></span></span>. \"It really draws them all the way back to the base brand, which ends up being extremely impact for us long after.\"</p><p>And just as craft cocktail culture led to the rise of canned cocktails, the popularity of dirty soda is leading beverage giants to cash in with ready-to-drink versions that capitalize on the trend. Dr Pepper Creamy Coconut was the company's most successful limited-time carbonated soft drink to date, based on retail dollar sales, according to Webb. And Kirkham said Pepsi Wild Cherry & Cream has been one of the fastest-growing flavor segments for the company.</p><p>\"Some trends start retail and move over to foodservice,\" Circana's Lyons Wyatt said. \"This one was a foodservice trend moving into retail.\"</p><p>With Pepsi Wild Cherry & Cream and next year's launch of Dirty Dew and the Mug Floats Vanilla Howler, Kirkham expects that consumers will become even more creative with their concoctions.</p><p>\"I think it's actually giving [consumers] the chance to experiment even more and customize more,\" he said. \"Now you have a brand new base.\"</p></div></div>"
  },
  {
    "title": "5 takeaways from CNBC’s investigation into 'nudify' apps and sites",
    "url": "https://www.cnbc.com/2025/09/28/5-takeaways-from-cnbcs-investigation-into-nudify-apps-and-sites.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108202454-1758646478899-three_shot_3.png?v=1758925569&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-28T13:16:23.000Z",
    "description": "Jessica Guistolise, Megan Hurley and Molly Kelley talk with CNBC in Minneapolis, Minnesota, on July 11, 2025, about fake pornographic images and videos depicting their faces made by their mutual friend Ben...",
    "body": "<div><div><p>Jessica Guistolise, Megan Hurley and Molly Kelley talk with CNBC in Minneapolis, Minnesota, on July 11, 2025, about fake pornographic images and videos depicting their faces made by their mutual friend Ben using AI site DeepSwap.</p><p>Jordan Wyatt | CNBC</p></div><div><p>In the summer of 2024, a group of women in the Minneapolis area learned that a male friend used their Facebook photos mixed with artificial intelligence to create sexualized images and videos.   </p><p>Using an AI site called DeepSwap, the man secretly created deepfakes of the friends and over 80 women in the Twin Cities region. The discovery created emotional trauma and led the group to seek the help of a sympathetic state senator.</p><p>As a <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/27/nudify-ai-generated-deepfake-fbi.html\">CNBC investigation shows</a>, the rise of \"nudify\" apps and sites has made it easier than ever for people to create nonconsensual, explicit deepfakes. Experts said these services are all over the Internet, with many being promoted via Facebook ads, available for download on the Apple and Google app stores and easily accessed using simple web searches.</p><p>\"That's the reality of where the technology is right now, and that means that any person can really be victimized,\" said Haley McNamara, senior vice president of strategic initiatives and programs at the National Center on Sexual Exploitation.</p><p>CNBC's <a target=\"_blank\" href=\"https://www.cnbc.com/2025/09/27/nudify-ai-generated-deepfake-fbi.html\">reporting</a> shines a light on the legal quagmire surrounding AI, and how a group of friends became key figures in the fight against nonconsensual, AI-generated porn.</p><p>Here are five takeaways from the investigation.</p></div><h2><a></a>The women lack legal recourse</h2><div><p>Because the women weren't underage and the man who created the deepfakes never distributed the content, there was no apparent crime.</p><p>\"He did not break any laws that we're aware of,\" said Molly Kelley, one of the Minnesota victims and a law student. \"And that is problematic.\"</p><p>Now, Kelley and the women are advocating for a local bill in their state, proposed by Democratic state Senator Erin Maye Quade, intended to block nudify services in Minnesota. Should the bill become law, it would levy fines on the entities enabling the creation of the deepfakes.</p><p>Maye Quade said the bill is reminiscent of laws that prohibit peeping into windows to snap explicit photos without consent.</p><p>\"We just haven't grappled with the emergence of AI technology in the same way,\" Maye Quade said in an interview with CNBC, referring to the speed of AI development.</p></div><h2><a></a>The harm is real</h2><div><p>Jessica Guistolise, one of the Minnesota victims, said she continues to suffer from panic and anxiety stemming from the incident last year.</p><p>Sometimes, she said, a simple click of a camera shutter can cause her to lose her breath and begin trembling, her eyes swelling with tears. That's what happened at a conference she attended a month after first learning about the images.</p><p>\"I heard that camera click, and I was quite literally in the darkest corners of the internet,\" Guistolise said. \"Because I've seen myself doing things that are not me doing things.\"</p><p>Mary Anne Franks, professor at the George Washington University Law School, compared the experience to the feelings victims describe when talking about so-called revenge porn, or the posting of a person's sexual photos and videos online, often by a former romantic partner.</p><p>\"It makes you feel like you don't own your own body, that you'll never be able to take back your own identity,\" said Franks, who is also president of the Cyber Civil Rights Initiative, a nonprofit organization dedicated to combating online abuse and discrimination.</p></div><h2><a></a>Deepfakes are easier to create than ever</h2><div><p>Less than a decade ago, a person would need to be an AI expert to make explicit deepfakes. Thanks to nudifier services, all that's required is an internet connection and a Facebook photo.</p><p>Researchers said new AI models have helped usher in a wave of nudify services. The models are often bundled within easy-to-use apps, so that people lacking technical skills can create the content.</p><p>And while nudify services can contain disclaimers about obtaining consent, it's unclear whether there is any enforcement mechanism. Additionally, many nudify sites market themselves simply as so-called face-swapping tools.</p><p>\"There are apps that present as playful and they are actually primarily meant as pornographic in purpose,\" said Alexios Mantzarlis, an AI security expert at Cornell Tech. \"That's another wrinkle in this space.\"</p></div><h2><a></a>Nudify service DeepSwap is hard to find</h2><div><p>The site that was used to create the content is called DeepSwap, and there's not much information about it online.</p><p>In a <a href=\"https://www.globenewswire.com/news-release/2025/07/14/3114645/0/en/DeepSwap-Redefines-the-Best-AI-Video-Generator-with-Industry-leading-Character-Consistency.html\" target=\"_blank\">press release</a> published in July, DeepSwap used a Hong Kong dateline and included a quote from Penyne Wu, who was identified in the release as CEO and co-founder. The media contact on the release was Shawn Banks, who was listed as marketing manager. </p><p>CNBC was unable to find information online about Wu, and sent multiple emails to the address provided for Banks, but received no response.</p><p>DeepSwap's website currently lists \"MINDSPARK AI LIMITED\" as its company name, provides an address in Dublin, and states that its terms of service are \"governed by and construed in accordance with the laws of Ireland.\"</p><p>However, in July, the same DeepSwap page had no mention of Mindspark, and references to Ireland instead said Hong Kong. </p></div><h2><a></a>AI's collateral damage</h2><div><div><p>Maye Quade's bill, which is still being considered, would fine tech companies that offer nudify services $500,000 for every nonconsensual, explicit deepfake that they generate in the state of Minnesota.</p><p>Some experts are concerned, however, that the Trump administration's plans to bolster the AI sector will undercut states' efforts. </p><p>In late July, Trump signed executive orders as part of the White House's<a href=\"https://www.whitehouse.gov/wp-content/uploads/2025/07/Americas-AI-Action-Plan.pdf\" target=\"_blank\"> AI Action Plan</a>, underscoring AI development as a \"national security imperative.\"</p></div><p>Kelley hopes that any federal AI push doesn't jeopardize the efforts of the Minnesota women.</p></div><div><p><img src=\"https://image.cnbcfm.com/api/v1/image/108202439-1758576040043-thumb_1.jpg?v=1758843887&w=750&h=422&vtcrop=y\" alt=\"The alarming rise of AI ‘nudify’ apps that create explicit images of real people\" /><span></span><span><div><p><span>watch now</span><span></span></p></div></span></p></div></div>"
  },
  {
    "title": "36-year-old American Air Force vet moved to Vietnam, lives on $4,000 a month: You can 'focus on what makes you happy' here",
    "url": "https://www.cnbc.com/2025/09/27/american-army-vet-moved-to-vietnam-relocated.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204482-1758896655691-celia_3.png?v=1758908481&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-09-27T20:21:26.000Z",
    "description": "Markeiz Ryan, 36, had a pretty good childhood growing up in Maryland, but the 2008 financial crisis changed things.\"It wiped my mother's job away and it really made things tough for us around the time I...",
    "body": "<div><div><p>Markeiz Ryan, 36, had a pretty good childhood growing up in Maryland, but the 2008 financial crisis changed things.</p><p>\"It wiped my mother's job away and it really made things tough for us around the time I graduated high school,\" Ryan tells CNBC Make It. \"I didn't have much of a financial security blanket to fall under. The best thing for me was to join the military so I wouldn't have to put my family into any more debt and I think that was the right decision.\"</p><p>Ryan joined the U.S. Air Force in 2010 and was stationed in various countries around the world, including Korea, Germany, and throughout Africa. In 2016, while living in Korea, Ryan got in trouble for breaking his curfew. He lost out on several months of pay, was restricted to his military base and demoted from staff sergeant to senior airman.</p><p>\"After this, I was very depressed and very sad,\" Ryan said. \"But that depression and sadness make you think about where your life is going and it makes you redirect your life into the right direction.\"</p></div><div><p>In Vietnam, Ryan lives off of roughly $4,000 a month.</p><p>Louis Corallo for CNBC Make It</p></div><div><p>In that period of time that Ryan was restricted to his military base, he planned a trip to visit a friend in Vietnam.</p><p>\"It just looked like so much fun and it really lived up to all the hype,\" he said. \"I ended up having the best time of my life, and that depression was [just] gone.\"</p><p>Ryan says that after that first trip to Vietnam and seeing how happy he was, he didn't want to let go of that feeling. He started planning his return to the country.</p><p>The veteran returned to his life in the Air Force and completed his service on a military base in Wyoming before being honorably discharged in 2019.</p></div><div><p>Ryan lives in a two-bedroom apartment in Ho Chi Minh City.</p><p>Louis Corallo for CNBC Make It</p></div><div><p>Soon after, Ryan relocated to Vietnam, where he lives off roughly $4,000 a month, according to documents reviewed by CNBC Make It.</p><p>Ryan suffers from spine arthritis, respiratory issues, auditory pain, and mental health challenges from his time in the military. He receives disability from Veterans Affairs.</p><p>His monthly income stems from several sources, including approximately $1,500 from VA disability, $1,000 from the GI Bill while he's pursuing a master's degree, and $900 to $1,300 from teaching English. Ryan also does occasional odd jobs like voiceover work, where his pay can range from $200 to $600 a month, and is an avid fan of day trading, where he averages about $300 a month.</p><p>\"This might not sound like a lot in America but trust me, this is more than enough to be middle or even above middle class in Vietnam,\" he says.</p></div><div><p>When Ryan moved to Vietnam, he bought a motorcycle to get around</p><p>Louis Corallo for CNBC Make It</p></div><div><p>Ryan lives in Ho Chi Minh City and has a two-bedroom, one-bathroom apartment in one of the country's tallest residential towers. He pays $850 a month in rent and his utilities round up to about $130, which includes electricity, water and housekeeping.</p><p>In addition to those expenses, Ryan also pays $1,000 a year for health insurance and $3 a week on gas for his motorcycle. What he spends on groceries varies from $100 to $400 a month, as he often alternates between cooking his own food or dining out frequently.</p><p>\"Vietnam is the number one safest place I've ever lived. I never have to look over my shoulder here. I noticed that there's this great level of calm,\" Ryan says. \"People are more focused on their day-to-day life and they're less focused on what's going on politically. It's a much more calm feeling.\"</p><p>Although Ryan loves living in Vietnam, one thing that irks him is the noise pollution.</p><p>\"There's a lot of honking, street sellers and sometimes karaoke really loudly, so if you are very intolerant to noise, this might not be the place for you,\" he says.</p></div><div><p>Ryan says Vietnam is now home and he has no plans of leaving.</p><p>Louis Corallo for CNBC Make It</p></div><div><p>Since moving to Vietnam, Ryan has made an effort to learn the language, but he admits he's still not the best at it.</p><p>\"I can never claim that I'm fluent in Vietnamese, but I do a lot better than most of my peers here,\" he says.</p><p>Ryan has been living in Vietnam for six years now, and says he has no plans of leaving.</p><p>\"If I leave, it's because Vietnam told me to leave. In America, I felt very unmotivated. I felt like no matter how hard you work, you're still in poverty. You're constantly chasing a standard that you can't really achieve,\" he says. \"Here in Vietnam, it takes a lot of the monetary pressure out of your day-to-day. You focus on what makes you happy, who you want to become and how you're going to get there.\"</p><p>This experience, he says, is the complete opposite of what his life was like back in the U.S.</p><p>\"Every day I wake up with a long to-do list of things I want to do, not the things that I need to do, and it's a completely different way of living. Even if you need to work 40 hours a week here, you're doing it as an investment in your future. Getting out of survival mode makes things infinitely more human.\"</p><p><em><strong>Last chance to save: Want to be your own boss?</strong> Final days to get 30% off Smarter by CNBC Make It's new online course, </em><a href=\"https://smarter.cnbcmakeit.com/p/how-to-start-a-business-for-first-time-founders?utm_source=cnbc&utm_medium=makeitarticle&utm_campaign=bottom\" target=\"_blank\"><em>How To Start A Business: For First-Time Founders</em></a><em>. Find step-by-step guidance for launching your first business, from testing your idea to growing your revenue. Use coupon code EARLYBIRD for an introductory discount from September 16 through September 30, 2025.</em></p><p><em>Plus, </em><a target=\"_blank\" href=\"https://www.cnbc.com/make-it-newsletters/\"><em>sign up for CNBC Make It's newsletter</em></a><em> to get tips and tricks for success at work, with money and in life, and </em><a href=\"https://www.linkedin.com/groups/13194471/\" target=\"_blank\"><em>request to join our exclusive community on LinkedIn</em></a><em> to connect with experts and peers.</em></p></div></div>"
  }
]