[
  {
    "title": "New York offshore wind project to resume construction after judge lifts Trump suspension ",
    "url": "https://www.cnbc.com/2026/01/15/judge-allows-equinor-empire-wind-construction-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108253113-1768498293671-gettyimages-2227154232-CABLE_BARGE.jpeg?v=1768498382&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T18:22:40.000Z",
    "description": "The Marmac 306, a cable laying barge, in the New York Harbor in New York, US, on Thursday, July 17, 2025. The crew of an American-flagged barge will l",
    "body": "The Marmac 306, a cable laying barge, in the New York Harbor in New York, US, on Thursday, July 17, 2025. The crew of an American-flagged barge will lay cable to connect the Empire Wind farm to New York City's grid a milestone for an embattled sector. Bryan Derballa | Bloomberg | Getty ImagesEmpire Wind will resume construction off the coast of New York, after a federal judge on Thursday temporarily lifted the Trump administration's suspension of the project. The preliminary injunction issued by Judge Carl J. Nichols of the U.S. District Court for the District of Columbia is the latest setback for President Donald Trump's efforts to stop offshore wind projects. Equinor, the Norwegian company developing Empire Wind, said it \"will now focus on safely restarting construction activities that were halted during the suspension period.\"\"In addition, the project will continue to engage with the U.S. government to ensure the safe, secure and responsible execution of its operations,\" Equinor said in a statement Thursday. The Department of Interior halted five wind projects off the East Coast, including Empire Wind, on Dec. 22 claiming national security concerns. Equinor in its lawsuit called the suspension \"the latest unlawful action\" by the Trump administration to stop the development of offshore wind.Empire Wind is expected to generate electricity for more than 500,000 homes by 2027, according to Equinor. It will provide power to New York City through a substation in Brooklyn. The other projects targeted by Trump are Coastal Virginia Offshore Wind, Vineyard Wind 1 off Massachusetts, Revolution Wind off Rhode Island, and Sunrise Wind off Long Island and New England. A federal judge on Monday allowed Revolution Wind to resume construction. A hearing on the suspension of Coastal Virginia Offshore Wind is scheduled for Friday at 11 a.m. ET at the U.S. District Court for the Eastern District of Virginia in Norfolk. Coastal Virginia Offshore Wind, owned by Dominion Energy, is the largest project of its kind in the U.S. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New York offshore wind project to resume construction after judge lifts Trump suspension ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108253113-1768498293671-gettyimages-2227154232-CABLE_BARGE.jpeg?v=1768498382&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T18:22:40.000Z",
      "dateModified": "2026-01-15T18:22:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College students and teens could be fueling the prediction markets boom",
    "url": "https://www.cnbc.com/2026/01/15/prediction-markets-college-students-teens-could-be-fueling-the-boom.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108252962-1768489262838-gettyimages-2217366095-dee09407.jpeg?v=1768511027&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T18:57:42.000Z",
    "description": "Fans watch Game 6 of the Eastern Conference Finals during an NBA playoffs watch party at a New York bar on May 31, 2025.David Dee Delgado | Getty Imag",
    "body": "Fans watch Game 6 of the Eastern Conference Finals during an NBA playoffs watch party at a New York bar on May 31, 2025.David Dee Delgado | Getty ImagesA version of this article first appeared in the CNBC Sport newsletter with Alex Sherman, which brings you the biggest news and exclusive interviews from the worlds of sports business and media. Sign up to receive future editions, straight to your inbox.As prediction market trading volume booms, Truist analysts say there could be an unlikely source behind the surge. Analyst Barry Jonas wrote this week that 18- to 20-year-olds, who are too young to gamble legally in most states, could be contributing significantly to the growth of prediction markets.Specifically, data from HoldCrunch, founded by a former FanDuel executive, shows prediction platform Kalshi is taking more trades on college football than on NFL and NBA. While non-college students could still wager on college results, of course, the trend could offer a clue into the demographics of prediction platform users. HoldCrunch analyzes the data on an \"OSB-equivalent handle\" rather than on volumes alone.   During the week ended Jan. 4, Kalshi's college football handle hit its highest percentage of total at 32%, the prediction platform said. The NFL accounted for 24% of total wagers, and the NBA represented 22%. The tide has been shifting in that direction since October, according to Kalshi.  Prediction markets — in which users can bet on the outcomes of events in everything from politics and world news to pop culture and sports — have skyrocketed in popularity with the help of platforms like Kalshi and Polymarket. They're quickly filling a gap in the market in states where online sports betting is not legal. And in states where it is legal, online sporting betting is often limited to those 21 years or older. Kalshi and Polymarket are open to anyone 18 or older, with some state-by-state exceptions for sports and other certain trades. \"It's clear that these new offerings are having an impact on sports bettor behavior,\" Jonas wrote. NCAA President Charlie Baker wrote this week to the Commodities and Futures Trading Commission, which regulates prediction markets, asking the agency to remove college sports from options to trade until more safeguards are in place. Juice Reel, an app that allows sports gamblers to track wagers and provides analysis of wagering and trading activity, found higher uptake of prediction markets in states where sports betting isn't legal. According to Juice Reel, 9% of its California customers have connected prediction accounts, the most of any other state. Just over 6% of Juice Reel's Texas customers have linked prediction market accounts. Neither California nor Texas offers legal, licensed sports betting.  Curiously, New York, which has legal online sports betting, ranks second on Juice Reel in customers who have connected prediction accounts (6.8%), perhaps because of the concentration of financial traders accustomed to trading futures, options and other volatile financial derivatives. Truist's analysts hypothesize 18- to 20-year-olds could be fueling the predictions action in the state, too. Residents of both New York and California demonstrate a notable propensity for gambling outside the bounds of regulated sportsbooks. New York charges a tax of 51% on sportsbooks, but not on sweeps, daily fantasy, bookie accounts and offshore sportsbooks. And those alternate platforms get 40% of the overall handle, or money wagered, from the Juice Reel customers.In part, that's because gamblers who really know what they're doing can't bet big on platforms like DraftKings or FanDuel. \"Some of the biggest and best bettors are going to prediction markets because they're limited to smaller bets by the sportsbooks,\" Juice Reel's founder Ricky Gold told CNBC. Fully 70% of the bets tracked by Juice Reel are in regulated sportsbooks, but they account for only 38% of the handle. By contrast, predictions account for only 1% of the number of bets, but 13% of the handle.  \"Prediction markets amplify bettor skill and variance,\" Truist's Jonas concluded, adding they \"show substantially larger downside for low-wallet users and substantially higher upside for high-wallet users.\"Disclosure: CNBC and Kalshi have a commercial relationship. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College students and teens could be fueling the prediction markets boom",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108252962-1768489262838-gettyimages-2217366095-dee09407.jpeg?v=1768511027&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T18:57:42.000Z",
      "dateModified": "2026-01-15T18:57:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Coinbase CEO says key crypto vote can be rescheduled after 11th hour cancellation",
    "url": "https://www.cnbc.com/2026/01/15/coinbase-ceo-says-key-crypto-vote-can-be-rescheduled-after-11th-hour-cancellation.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108253123-17684994252026-01-15t174832z_982800860_rc2t1jan8a0c_rtrmadp_0_usa-congress.jpeg?v=1768499447&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-16T00:34:56.000Z",
    "description": "CEO of Coinbase Brian Armstrong is interviewed for CNBC in the Russell Senate office building on Capitol Hill in Washington, D.C., U.S., Jan. 15, 2026",
    "body": "CEO of Coinbase Brian Armstrong is interviewed for CNBC in the Russell Senate office building on Capitol Hill in Washington, D.C., U.S., Jan. 15, 2026. Annabelle Gordon | ReutersSenators are vowing to go forward on a major crypto bill that would give the industry the rule of the road after a planned committee vote was derailed at the 11th hour. But the biggest sticking points have been issues for months as Democrats, Republican, the crypto industry and banks have tried to find common ground. The likelihood that the latest version of the bill, which was released late Monday, would be able to get the approval of the Banking Committee was already tenuous when Coinbase CEO Brian Armstrong tweeted on Wednesday afternoon that Coinbase would not be able to support the bill, listing several concerns including a reduced role for the CFTC and limits on the ability for crypto to offer consumers rewards in the bill.. \"It was the 1,000th cut in a death by 1000 cuts,\" Sen. Cynthia Lummis told CNBC of Armstrong's tweet. A few hours after Armstrong publicly opposed the bill, Banking Chair Tim Scott, R-S.C., formally called off the hearing, postponing it to a yet-to-be-announced date.  Armstrong told CNBC that after a new version of the bill was dropped late Monday night, he was surprised by some of the provisions in it. By the time Coinbase's team identified key areas of concern, it was too late for any changes to be made in a markup. \"We've got a chance to do a new draft and hopefully get back into a markup in a few weeks,\" Armstrong said.  Lummis, said it could take until February or March to re-hold the vote.  \"I feel like I got run over by a Mack truck,\" said Lummis, one of the biggest crypto proponents on Capitol Hill who has worked on similar legislation for years. \"But we'll get back at it after this break and find some ways to fix the bill.\" One of the biggest debates around the bill deals with the rewards that companies can offer stablecoin holders. Under the stablecoin law, crypto exchanges cannot offer customers interest on stablecoin – however they can offer rewards that act like interest. Banks have said the language could lead to hundreds of billions being moved from deposits to stablecoin – one Fed report suggests there could be a credit squeeze of hundreds of billion to as much as $1.2 trillion if stablecoin can offer interest.  Armstrong said he would like to speak with bank CEOs directly on this, but argued that the bill needed to treat both industries equally.  \"Crypto companies should be allowed to compete and offer loans just like banks,\" he said. Banks are also preparing to fight for more favorable language. More than 3,000 banks signed a petition lead by the American Bankers Association warning that allowing crypto to offer interest-like rewards \"will siphon trillions from local lending, leaving less money available for car loans, agricultural loans, mortgages, and small business borrowing that drive local economies.\" Sen. Angela Alsobrooks, D-Md., said she's spoken with representatives from the banking and crypto industries, and she thinks if there is more time to negotiate, an agreement can be reached soon.\"Everyone agrees that there has to be a compromise somewhere in there, and making sure that we are allowing the innovation to grow,\" she said.Caleigh Keating contributed to this article. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Coinbase CEO says key crypto vote can be rescheduled after 11th hour cancellation",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108253123-17684994252026-01-15t174832z_982800860_rc2t1jan8a0c_rtrmadp_0_usa-congress.jpeg?v=1768499447&w=1920&h=1080"
      ],
      "datePublished": "2026-01-16T00:34:56.000Z",
      "dateModified": "2026-01-16T00:34:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Morgan Stanley earnings top estimates driven by wealth management",
    "url": "https://www.cnbc.com/2026/01/15/morgan-stanley-ms-q4-2025-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108119219-1742495679668-gettyimages-2206083801-anotherday604187_of8ereqe.jpeg?v=1768478126&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T20:02:04.000Z",
    "description": "People walk past Morgan Stanley global headquarters in Manhattan on March 20, 2025 in New York City. Spencer Platt | Getty ImagesMorgan Stanley on Thu",
    "body": "People walk past Morgan Stanley global headquarters in Manhattan on March 20, 2025 in New York City. Spencer Platt | Getty ImagesMorgan Stanley on Thursday reported fourth-quarter results that exceeded Wall Street expectations on the back of strong revenue from wealth management. Here's what the company reported compared with what Wall Street analysts surveyed by LSEG were expecting:Earnings per share: $2.68 vs. $2.44 expected Revenue: $17.89 billion vs. $17.77 billion expectedFourth-quarter net income rose to $4.40 billion, or $2.68 per share, from $3.71 billion, or $2.22 per share, a year ago. Revenue increased to $17.89 billion from $16.22 billion a year ago.The bank stock jumped about 6% on Thursday following the report. The wealth management unit posted $8.4 billion in net revenue in the most recent quarter, up from $7.5 billion a year earlier. For the full year, the division generated a record $31.8 billion in net revenue. Total client assets in the wealth and investment management business climbed to $9.3 trillion, fueled by more than $350 billion in net new assets.\"Morgan Stanley delivered outstanding performance in 2025,\" Ted Pick, the bank's CEO and chairman, said in a statement. \"Our performance reflects multi-year investments which have contributed to growth and momentum across the Integrated Firm.\"Investment banking was also a standout for the firm. Net revenue for the segment jumped 47% to $2.41 billion from $1.64 billion a year earlier, driven by stronger advisory fees as completed M&A activity increased across all regions.The firm bought back $1.5 billion of its stock during the quarter and $4.6 billion over the full year under its share repurchase program.Morgan Stanley shares have gained more than 43% over the past 12 months.Other banks have mostly posted solid results. JPMorgan Chase topped expectations for fourth-quarter results on strong equities and fixed income trading revenue. Wells Fargo posted weaker-than-expected revenue, while Bank of America and Citigroup beat consensus estimates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Morgan Stanley earnings top estimates driven by wealth management",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108119219-1742495679668-gettyimages-2206083801-anotherday604187_of8ereqe.jpeg?v=1768478126&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T20:02:04.000Z",
      "dateModified": "2026-01-15T20:02:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Goldman Sachs CEO is looking at how the Wall Street bank can get involved in prediction markets",
    "url": "https://www.cnbc.com/2026/01/15/goldman-sachs-ceo-looks-at-how-to-get-involved-in-prediction-markets.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219469-17618416142025-10-30t162538z_1209307835_rc2fmha22naf_rtrmadp_0_goldman-sachs-ceo.jpeg?v=1768504936&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T22:05:15.000Z",
    "description": "Goldman Sachs CEO David Solomon speaks during an interview at the Economic Club of Washington, Oct. 30, 2025.Kevin Lamarque | ReutersGoldman Sachs CEO",
    "body": "Goldman Sachs CEO David Solomon speaks during an interview at the Economic Club of Washington, Oct. 30, 2025.Kevin Lamarque | ReutersGoldman Sachs CEO David Solomon said Thursday the giant Wall Street investment bank is actively exploring opportunities in prediction markets, signaling growing institutional interest in a corner of finance that has gained increased traction among traders.\"The prediction markets are also super interesting,\" Solomon said on Goldman's fourth-quarter earnings call, according to a FactSet transcript. \"I personally met with the two big prediction companies and their leadership in the last two weeks and spent a couple of hours with each to learn more about that. We have a team of people here that are spending time with them and are looking at it.\"Prediction markets like Kalshi and Polymarket allow investors to trade contracts tied to the outcome of world events, ranging from elections and economic data releases to policy decisions. Goldman's interest comes as prediction markets gain visibility amid debates over market transparency and regulatory boundaries.Some platforms operate under the oversight of the Commodity Futures Trading Commission, a distinction that Solomon said makes the products look increasingly similar to traditional financial instruments.\"When you think about some of these activities, particularly when you look at some of the ones that are CFTC regulated, they look like derivative contract activities,\" said the 63-year old CEO, who's led Goldman since 2018. \"So I can certainly see opportunities where these cross into our business.\"Still, Solomon struck a note of caution on timing, pushing back on expectations that Wall Street's embrace of prediction markets will be rapid.\"I think there's a lot of reason to be excited and interested in these things,\" he said. \"But the pace of change might not be as quick and as immediate as some of the pundits are talking about. But I think they're important, real. And we're spending a lot of time.\"Disclosure: CNBC and Kalshi have a commercial relationship. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Goldman Sachs CEO is looking at how the Wall Street bank can get involved in prediction markets",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219469-17618416142025-10-30t162538z_1209307835_rc2fmha22naf_rtrmadp_0_goldman-sachs-ceo.jpeg?v=1768504936&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T22:05:15.000Z",
      "dateModified": "2026-01-15T22:05:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TSMC delivers another record quarter as profit jumps 35% fueled by robust AI chip demand",
    "url": "https://www.cnbc.com/2026/01/15/tsmc-q4-profit-record-ai-chip-demand-nt1-trillion.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108190003-1756081779730-gettyimages-2147908701-TSMC_CHIP_GRANT.jpeg?v=1768435975&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T09:59:01.000Z",
    "description": "TSMC offices in San Jose, California, on April 18, 2024.Bloomberg | Bloomberg | Getty ImagesTaiwan Semiconductor Manufacturing Company on Thursday rep",
    "body": "TSMC offices in San Jose, California, on April 18, 2024.Bloomberg | Bloomberg | Getty ImagesTaiwan Semiconductor Manufacturing Company on Thursday reported a 35% increase in fourth-quarter profit, beating estimates and hitting a fresh record as demand for artificial intelligence chips remained strong.Here are the company's results versus LSEG SmartEstimates, which are weighted toward forecasts from analysts who are more consistently accurate:Revenue: 1.046 trillion new Taiwan dollars ($33.73 billion), vs. NT$1.034 trillion expectedNet income: NT$505.74 billion, vs. NT$478.37 billion expectedThe world's largest contract chipmaker has now posted year-over-year profit growth for eight consecutive quarters.Meanwhile, TSMC's revenue in the December quarter rose by 20.5% from a year ago to surpass NT$1 trillion, also beating forecasts.In an earnings call, TSMC executives guided revenue for the current quarter to hit between $34.6 billion and $35.8 billion, up 4% sequentially, or up 38% year-over-year at the midpoint. \"We expect our business to be supported by continued strong demand for our leading edge process technologies,\" said TSMC's Chief Financial Officer Wendell Huang during an earnings call, adding that the company's profit margins have been increasing. TSMC, Asia's largest technology company by market capitalization, has benefited greatly from the proliferation of artificial intelligence, producing advanced AI processors for clients such as Nvidia and AMD. Advanced chips The company's high-performance computing division, which includes artificial intelligence and 5G applications, made up the majority of sales in the October-December quarter at 55%. Demand from smartphones made up 32% of sales.TSMC said advanced chips measuring 7-nanometer or smaller made up 77% of total wafer revenue during the quarter. For full-year 2025, those chips made up 74% of revenue, up from 69% in 2024.In semiconductor technology, smaller nanometer sizes indicate more compact transistor designs, allowing faster processing speeds and greater energy efficiency. The company is looking to further ramp up its cutting-edge 2 nm offerings this year, after rolling out mass production last quarter. With TSMC further leaning into its advanced products, it said that its capital expenditure was expected to reach between $52 billion and $56 billion in 2026, as compared to $40.9 billion in 2025. \"The demand for AI remains very strong, driving overall chip demand across the entire server industry,\" Counterpoint Research senior analyst Jake Lai told CNBC, predicting that 2026 will be another \"breakout year\" for AI server demand. \"With TSMC's ongoing 2nm capacity expansion and new production contributing to revenue, along with continuous expansion of advanced packaging... TSMC is expected to maintain strong performance in 2026,\" Lai said. However, he added that chip demand tied to consumer electronics such as smartphones and PCs could be affected by the ongoing memory shortage and price hikes.During the earnings call on Thursday, TSMC Chairman and Chief Executive Officer C.C. Wei acknowledged the memory shortage but argued that TSMC is focused on high-end smartphones, which are less sensitive to the memory prices. However, Wei flagged global tariff policies as a potential risk factor headed into 2026. Global expansion TSMC has been expanding globally in recent years, with major projects underway in Japan, Europe, and Arizona, where it is accelerating capacity expansion.Chief Executive C.C. Wei said Thursday that the company recently purchased additional land in Arizona to support new facilities. \"We are going to expand many fabs over there, and this gigafab cluster can help us to improve the productivity, to lower the cost and to serve our customers in the U.S. better,\" he added. While these expansions could help lessen the impact of global tariffs in markets such as the U.S., the company has also warned that overseas plants will operate at diluted margins compared to those in Taiwan. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TSMC delivers another record quarter as profit jumps 35% fueled by robust AI chip demand",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108190003-1756081779730-gettyimages-2147908701-TSMC_CHIP_GRANT.jpeg?v=1768435975&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T09:59:01.000Z",
      "dateModified": "2026-01-15T09:59:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump unveils health-care plan outline as Congress wrestles over Obamacare subsidies",
    "url": "https://www.cnbc.com/2026/01/15/trump-congress-aca-subsidies-health-care.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108202461-17585775112025-09-22t214034z_243628697_rc29xga5yg1c_rtrmadp_0_usa-trump.jpeg?v=1758577547&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T18:37:03.000Z",
    "description": "U.S. President Donald Trump, in front of U.S. Secretary of Health and Human Services Robert F. Kennedy Jr., delivers remarks at the White House, in Wa",
    "body": "U.S. President Donald Trump, in front of U.S. Secretary of Health and Human Services Robert F. Kennedy Jr., delivers remarks at the White House, in Washington, D.C., U.S., Sept. 22, 2025. Kevin Lamarque | ReutersPresident Donald Trump on Thursday rolled out the broad outline of a health-care plan that the White House claims will lower drug prices and insurance premiums.The announcement came as a congressional effort to extend key Affordable Care Act tax credits faces headwinds from Senate Republicans, leaving millions at risk of seeing their health insurance premiums spike.The Trump administration dubbed the initiative \"The Great Healthcare Plan,\" the president said in a video unveiling the policy Thursday morning.\"I'm calling on Congress to pass this framework into law without delay,\" Trump said. \"Have to do it right now.\"The plan would codify the deals Trump recently struck with major drugmakers to slash the cost of certain prescription drugs in the U.S. by pegging them to lower prices abroad, as part of his \"most-favored-nation\" policy.More than a dozen pharmaceutical companies agreed to lower prices on certain products for Medicaid patients in exchange for a three-year exemption from tariffs. As part of those deals, companies also agreed to sell some medicines at a discount on Trump's direct-to-consumer platform, Trump Rx.Trump, in his video announcement, said those lower drug prices will take effect on the platform when it launches this month. He claimed that those prices would plunge by as much as 500%, even though that would mean prices would fall far below $0.The health-care framework would \"make more verified safe pharmaceutical drugs available for over-the-counter purchase,\" according to a White House fact sheet.It would also purportedly send money for health insurance coverage \"directly to the American people\" instead of giving \"big insurance companies billions in extra taxpayer-funded subsidy payments,\" the fact sheet says. Trump has repeatedly floated similar proposals in recent remarks.The plan would additionally \"fund a cost-sharing reduction program,\" which the administration says would \"reduce the most common Obamacare plan premiums by over 10%.\"Other components of the policy include requiring health insurers to prominently post coverage comparisons \"in plain English\" on their websites, along with other information about overhead costs and claim denial rates.It would also require providers who accept either Medicare or Medicaid \"to publicly and prominently post their pricing and fees to avoid surprise medical bills.\"The new proposal from the White House comes as senators remain at loggerheads on a deal to extend the now-lapsed ACA, or Obamacare, subsidies. A bipartisan group of senators has been working for weeks on a way forward, but hit a snag recently on language relating to the Hyde Amendment, a statute that bars the use of federal funds for abortion services. White House Press Secretary Karoline Leavitt holds a press briefing at the White House in Washington, D.C., U.S., January 15, 2026.Evelyn Hockstein | ReutersThe White House plan notably leaves out an extension of the ACA subsidies, which Democrats are demanding be extended as a part of any health-care deal. The White House had not publicly put forward a proposal until Thursday, but Trump has repeatedly said he wants funds to go directly to patients rather than insurance companies.Some negotiators wondered whether the White House plan would hamper negotiations.\"We've all known that in order to be able to advance something, we're going to have to have buy-in from the White House,\" Sen. Lisa Murkowski, R-Alaska, one of the negotiators, told reporters Thursday. \"Does this set things back if he signals that he does not support extending [the subsidies]? I mean, that's the basis of our plan here.\"Sen. Jeanne Shaheen, D-N.H., who is leading talks on the Democratic side, said Thursday that she hadn't yet seen the Trump plan, but signaled optimism about the discussions.\"Most of the areas have agreement, so what we need to do is get bill text together and then get final sign-off so that we can talk to our colleagues about what we're proposing,\" Shaheen told reporters. A White House official on Thursday said the plan does not close the door on extending the subsidies, but lays out the president's preferences. \"This does not specifically address those bipartisan congressional negotiations that are going on,\" the White House official said. \"It does say that we have a preference that money goes to people, as opposed to insurance companies.\"Read more CNBC politics coverageRussia watches as ally Iran edges closer to collapse. Here's why it matters for MoscowTrump's latest geopolitical gambits all lead back to ChinaTrump says anything less than U.S. control of Greenland is 'unacceptable' ahead of talksTrump attacks Powell again amid Fed independence fears: 'That jerk will be gone soon'Sen. Kelly sues DOD Sec. Hegseth, says he was punished for 'disfavored political speech'GOP Sen. Thom Tillis vows to block Trump's Fed nominees following Powell probe",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump unveils health-care plan outline as Congress wrestles over Obamacare subsidies",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108202461-17585775112025-09-22t214034z_243628697_rc29xga5yg1c_rtrmadp_0_usa-trump.jpeg?v=1758577547&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T18:37:03.000Z",
      "dateModified": "2026-01-15T18:37:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon threatens 'drastic' action after Saks bankruptcy, says $475M stake is now worthless",
    "url": "https://www.cnbc.com/2026/01/15/amazon-says-saks-investment-is-worthless-after-bankruptcy.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108252952-1768488329525-Untitled-1.jpg?v=1768488406&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T21:39:10.000Z",
    "description": "Amazon package and Saks Fifth Avenue bag.Getty ImagesAmazon wants a federal judge to reject Saks Global's bankruptcy financing plan, writing in court ",
    "body": "Amazon package and Saks Fifth Avenue bag.Getty ImagesAmazon wants a federal judge to reject Saks Global's bankruptcy financing plan, writing in court papers the beleaguered department store \"burned through hundreds of millions of dollars in less than a year\" and failed to hold up their agreement. When Saks acquired Neiman Marcus for $2.7 billion in December 2024, Amazon invested $475 million into the venture on the grounds the retailer would start selling its products on Amazon's website and the tech company would offer technology and logistics expertise.\"That equity investment is now presumptively worthless,\" Amazon's attorneys wrote in a Wednesday filing, hours after Saks filed for Chapter 11 bankruptcy protection. \"Saks continuously failed to meet its budgets, burned through hundreds of millions of dollars in less than a year, and ran up additional hundreds of millions of dollars in unpaid invoices owed to its retail partners.\"As part of the deal, Saks launched a branded \"Saks at Amazon\" storefront on the e-commerce company's website featuring a range of luxury fashion and beauty items. It also agreed to pay a referral fee for Saks-branded goods sold on the platform, guaranteeing at least $900 million in payments to Amazon over eight years. In its filing, Amazon argued that Saks' bankruptcy financing plan harms the company, and other creditors, because it saddles parts of the Saks corporation with new debt that it previously didn't have. It also pushes Amazon further down the pecking order in terms of repayment, which reduces the amount it could potentially be repaid during the proceedings, the e-commerce company said in the filings. Amazon wrote that it \"hopes\" Saks will resolve its concerns, but if it doesn't, it may \"seek more drastic remedies\" including the appointment of an examiner or a trustee. During a hearing Wednesday in U.S. Bankruptcy Court in Houston, Judge Alfredo Perez allowed Saks to start tapping into $1.75 billion in new bankruptcy financing after the company argued it would face immediate liquidation without it. He has yet to issue a ruling on Amazon's request. Saks' acquisition of Neiman Marcus brought a slew of new investors, including names from the technology industry. For Amazon, the deal guaranteed Saks' presence on its sprawling webstore, where the company has sought to attract bigger brands and grow its luxury selection, in particular. The Saks deal also raised the possibility that Amazon could deepen its investment in the department store chain. Amazon has been determined to have a bigger presence in physical retail and it's experimented with several concepts over the years, scrapping some along the way.The company has also struck similar investment agreements in the past. In 2022, Amazon took a 2% stake in Grubhub in exchange for the food delivery company adding perks for Prime members. Amazon expanded its stake in the company to up to 18% in 2024.Amazon and Saks both declined to comment beyond what they stated in filings.Software giant Salesforce also became a minority shareholder in Saks during its acquisition of Neiman Marcus, but it took a smaller stake than Amazon did. It's unclear if it also plans to object to the bankruptcy plan. Correction: An earlier headline on this article incorrectly quoted the Amazon filing. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon threatens 'drastic' action after Saks bankruptcy, says $475M stake is now worthless",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108252952-1768488329525-Untitled-1.jpg?v=1768488406&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T21:39:10.000Z",
      "dateModified": "2026-01-15T21:39:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MrBeast platform gets $200 million investment from Tom Lee's Bitmine",
    "url": "https://www.cnbc.com/2026/01/15/mrbeast-company-gets-200-million-investment-from-tom-lees-bitmine.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107326322-1698772881165-IMG_8209.jpg?v=1698773377&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T16:36:24.000Z",
    "description": "watch nowThe media platform founded by Jimmy Donaldson, known as the popular YouTuber MrBeast, is drawing a $200 million investment from  Bitmine Imme",
    "body": "watch nowThe media platform founded by Jimmy Donaldson, known as the popular YouTuber MrBeast, is drawing a $200 million investment from  Bitmine Immersion Technologies, the world's leading ethereum treasury company.The Bitmine investment in Beast Industries is designed to back a digital outlet that has more than 450 million subscribers and attracts more than 5 billion monthly views. The deal closes on or about Jan. 19.\"It's our view that ethereum, which is a smart contract platform, is the future of finance, where digitalization of not only dollars but stocks and equities [are] going to take place,\" Bitmine Chairman Tom Lee said on CNBC's \"Squawk Box\" on Thursday. \"Over time, that really blurs what is a service versus what's digital money, and that's where a collaboration and investment into Beast Industries makes sense.\"Alongside Lee, who also serves as head of research at Fundstrat Global Advisors, key investors in Bitmine include ARK's Cathie Wood, Bill Miller III and Galaxy Digital.\"I think it's part of the sort of evolution of digital platforms and money, and I think it's really uniting the No. 1 creator in the world with the biggest ethereum platform in the world,\" Lee added.Shares of Bitmine were up more than 1% premarket Thursday after the announcement. The stock has already soared more than 20% since New Year's, far surpassing the 1% gain in the S&P 500.Stock Chart IconStock chart iconBMNR, year-to-dateAddressing the broader cryptocurrency universe, Lee is optimistic on both bitcoin and ethereum, anticipating the former will reach a new all-time high in 2026. He's even more bullish on ethereum,  expecting its performance to outpace bitcoin this year. Lee's bullishness comes as the Senate Agriculture and Banking committees are expected to hold hearings this month on a crypto market structure bill that offers guardrails for the industry.\"Crypto really got hurt [in] October last year, so it is our view that we're going to have a pretty big recovery as we put more time between that moment,\" Lee said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MrBeast platform gets $200 million investment from Tom Lee's Bitmine",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107326322-1698772881165-IMG_8209.jpg?v=1698773377&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T16:36:24.000Z",
      "dateModified": "2026-01-15T16:36:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NATO nations deploy to Greenland after tense White House talks",
    "url": "https://www.cnbc.com/2026/01/15/greenland-nato-troops-denmark-germany-arctic-trump.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108252846-1768478144666-gettyimages-2255778538-AFP_92RZ684.jpeg?v=1768478199&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T16:14:19.000Z",
    "description": "A Royal Danish Air Force (RDAF) Lockheed C-130J Super Hercules is parked on the tarmak at Nuuk international airport on January 15, 2026 in Nuuk, Gree",
    "body": "A Royal Danish Air Force (RDAF) Lockheed C-130J Super Hercules is parked on the tarmak at Nuuk international airport on January 15, 2026 in Nuuk, Greenland, the day after it arrived transporting Danish military personnel.Alessandro Rampazzo | Afp | Getty ImagesSeveral NATO members are deploying small numbers of troops to Greenland for a joint military exercise, in the wake of tense talks at the White House about the U.S. desire to annex it.Denmark, which is responsible for Greenland's defense, Germany, France, Sweden and Norway have all confirmed plans to send military personnel to the sparsely populated island this week.U.S. President Donald Trump has renewed his sights on taking the island following an audacious military intervention in Venezuela to depose its president, Nicolás Maduro, on Jan. 3.The troop deployment comes shortly after the foreign ministers of Denmark and Greenland held talks with U.S. Vice President JD Vance and U.S. Secretary of State Marco Rubio at the White House.Speaking to reporters alongside Greenland's Vivian Motzfeldt, Danish Foreign Minister Lars Løkke Rasmussen said there had been a \"fundamental disagreement\" with the U.S., but said the hourlong meeting was \"frank but constructive.\"Vance and Rubio did not immediately comment after the meeting. Trump, however, told reporters in the Oval Office: \"We need Greenland for national security.\" The U.S., Denmark and Greenland agreed to establish a high-level working group to discuss the future of the island, although, as had been widely expected, the three countries were unable to find a diplomatic resolution to defuse tensions.(L/R) Danish Foreign Minister Lars Lokke Rasmussen and Greenland's Foreign Minister Vivian Motzfeldt speak during a news conference at the Danish Embassy in Washington, DC, on January 14, 2026.Oliver Contreras | Afp | Getty ImagesBefore the meeting, Denmark announced plans on Wednesday to beef up its military presence in and around Greenland, saying the exercise activities could include guarding national infrastructure, deploying fighter aircraft and conducting naval operations. Germany's Defense Ministry said it would deploy a \"reconnaissance team\" of 13 personnel to Nuuk, Greenland, at the invitation of Denmark.The mission, which will take place Thursday through Saturday, is designed to explore the framework for possible military contributions to ensure security in the region, the German Defense Ministry said, including maritime surveillance capabilities.'Operation Arctic Endurance'French President Emmanuel Macron said in a social media post that France will also participate in the joint exercises organized by Denmark in Greenland, referring to it as \"Operation Arctic Endurance.\" \"The first French military elements are already on their way. Others will follow,\" Macron said Wednesday on X, according to a Google translation.Read moreSwedish Prime Minister Ulf Kristersson said several officers from Sweden's armed forces were scheduled to arrive in Greenland from Wednesday.\"They are part of a group from several allied countries. Together, they will prepare for upcoming elements within the framework of the Danish exercise Operation Arctic Endurance,\" Kristersson said via X, according to a translation.Danish Prime Minister Mette Frederiksen, who has previously warned that a U.S. attack on Greenland would mark the end of NATO, thanked Rasmussen and Greenland's Motzfeldt for countering the American claims at the talks. \"It was not an easy meeting,\" Frederiksen said in a Facebook post Thursday, according to a translation. Greenland residents and political leaders have publicly rejected suggestions by U.S. President Donald Trump that the Arctic island could become part of the United States.Anadolu | Anadolu | Getty Images\"A working group is now being established to discuss how security in the Arctic can be strengthened. However, that does not change the fact that there is a fundamental disagreement because the American ambition to take over Greenland is intact,\" Frederiksen said.The Danish prime minister also mentioned that a number of NATO allies were currently contributing to joint exercise activities in and around Greenland. \"The defense and protection of Greenland is a common concern for the entire NATO alliance,\" she added.Denmark: 'We have been stepping up'Opinion polls have shown that Greenlanders overwhelmingly oppose U.S. control, while a strong majority support independence from Denmark.Denmark has pledged to boost health-care spending and infrastructure investments in recent months, while also seeking to defuse tensions with the Trump administration by investing in Arctic defense, including the purchase of 16 additional F-35 fighter jets.watch now\"We have been stepping up. We have allocated almost $15 billion within just the last couple of years to capabilities in the High North. We have been pushing within the Arctic NATO states for bigger NATO engagement,\" Rasmussen said Wednesday.\"We didn't manage to change the American position. It's clear that the president has this wish of conquering over Greenland,\" he continued. \"We made it very, very clear that this is not in the interest of the kingdom.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NATO nations deploy to Greenland after tense White House talks",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108252846-1768478144666-gettyimages-2255778538-AFP_92RZ684.jpeg?v=1768478199&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T16:14:19.000Z",
      "dateModified": "2026-01-15T16:14:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cloudflare acquires AI data marketplace Human Native",
    "url": "https://www.cnbc.com/2026/01/15/cloudflare-ai-human-native-acquisition.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108237207-17649373892025-12-05t120145z_1475346012_rc2ldcad4qxk_rtrmadp_0_cloudflare-outages.jpeg?v=1768520371&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T23:56:15.000Z",
    "description": "A logo of Cloudflare sits outside the company's house on the opening day of the 55th annual meeting of the World Economic Forum in Davos, Switzerland,",
    "body": "A logo of Cloudflare sits outside the company's house on the opening day of the 55th annual meeting of the World Economic Forum in Davos, Switzerland, Jan. 20, 2025.Yves Herman | ReutersCloudflare is acquiring artificial intelligence data marketplace Human Native, the company said Thursday, as it expands its push to develop transactions between AI developers and content creators.\"Content creators deserve full control over their work, whether they want to write for humans or optimize for AI,\" Cloudflare CEO Matthew Prince said in a release announcing the news.The internet infrastructure company said the acquisition will help it build tools for AI developers to \"find, access and purchase reliable high-quality data through fair and transparent channels.\"The press release didn't specify the deal's value, and a Cloudflare spokesperson declined to disclose further details.Prince said the acquisition will help Cloudflare accelerate its development of a new system where AI developers will pay creators for any content they use to train their models.Human Native, a U.K. startup, manages those transactions.\"This acquisition is about building the tools needed to protect the longevity of the open internet,\" Prince said in the release.Read more CNBC tech newsMeta's VR layoffs, studio closures underscore Zuckerberg's massive pivot to AIBig Tech is looking to energy talent to fuel its AI ambitionsPalantir is trying to 'destroy' Percepta through legal action, startup's execs say in filingMicrosoft says communities won't see energy price hikes near data centers as utility costs riseIn August, Prince told CNBC's \"Mad Money\" that reshaping content monetization on the internet is evolving into a new mission for the company. \"As we're helping content creators make sure that they can get paid and that the business model of the web continues to exist and evolve, I think that's going to be the fourth act of Cloudflare,\" he told Cramer.Last summer, Cloudflare launched its AI Crawl Control product, which offers customers a way to restrict and or monetize \"AI crawlers\" — a nickname for bots that gather data from across the web to train large language models — on their sites. Cloudflare's cybersecurity products have allowed the stock to benefit from the AI trade, with shares up more than 60% in the last year. watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cloudflare acquires AI data marketplace Human Native",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108237207-17649373892025-12-05t120145z_1475346012_rc2ldcad4qxk_rtrmadp_0_cloudflare-outages.jpeg?v=1768520371&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T23:56:15.000Z",
      "dateModified": "2026-01-15T23:56:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wikipedia parent partners with Amazon, Meta, Perplexity on AI access",
    "url": "https://www.cnbc.com/2026/01/15/wikipedia-amazon-meta-perplexity-ai.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108253106-1768498035396-gettyimages-2195020177-HL_RMILANI_2642279.jpeg?v=1768498060&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T22:36:55.000Z",
    "description": "Riccardo Milani | Afp | Getty ImagesWikimedia announced new deals with several artificial intelligence companies in a blog post on Thursday, including",
    "body": "Riccardo Milani | Afp | Getty ImagesWikimedia announced new deals with several artificial intelligence companies in a blog post on Thursday, including Amazon, Meta and Perplexity, as part of the company's 25th anniversary.Through the new partnerships under Wikimedia Enterprise, companies will pay Wikipedia to use its data to help develop and train AI models, instead of web scraping. The partnerships with Amazon, Meta, Microsoft, Mistral AI and Perplexity were formalized over the last year but have not been publicly shared, Wikimedia said.\"All these organizations utilize Wikimedia Enterprise to integrate human-governed knowledge into their platforms at scale,\" Wikimedia said in the release.The tech companies joined existing partners Ecosia, Pleias, ProRata and Google, which was one of Wikimedia Enterprise's first partners in 2022.\"Wikipedia's knowledge powers generative AI chatbots, search engines, voice assistants and more,\" a Wikimedia Foundation spokesperson told CNBC. \"The long-term future for AI and tech companies depends on nurturing projects like Wikipedia because it creates the human knowledge they rely on.\"The AI boom has thrown data rights into the spotlight and raised questions and legal issues about the use of human-generated content on sites like Wikipedia and Reddit.Elon Musk launched 'Grokipedia,' an AI-powered competitor to Wikipedia, last year. It was promoted by Musk to be less biased and \"anti-woke.\" Entries on Grokipedia, named after xAI's large language model Grok, are all generated by the AI model.Read more CNBC tech newsMeta's VR layoffs, studio closures underscore Zuckerberg's massive pivot to AIBig Tech is looking to energy talent to fuel its AI ambitionsPalantir is trying to 'destroy' Percepta through legal action, startup's execs say in filingMicrosoft says communities won't see energy price hikes near data centers as utility costs risewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wikipedia parent partners with Amazon, Meta, Perplexity on AI access",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108253106-1768498035396-gettyimages-2195020177-HL_RMILANI_2642279.jpeg?v=1768498060&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T22:36:55.000Z",
      "dateModified": "2026-01-15T22:36:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oil falls more than 4% as traders see Trump backing away from Iran strike threats",
    "url": "https://www.cnbc.com/2026/01/15/oil-prices-sink-more-than-2percent-as-trump-remarks-calm-concern-about-iran.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108251909-17683310112026-01-13t183914z_1803933739_rc2h0ja26e51_rtrmadp_0_usa-trump.jpeg?v=1768331058&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T20:20:41.000Z",
    "description": "watch nowOil prices fell more than 4% on Thursday, after comments from U.S. President Donald Trump eased market speculation that an American strike on",
    "body": "watch nowOil prices fell more than 4% on Thursday, after comments from U.S. President Donald Trump eased market speculation that an American strike on Iran could be imminent. Brent crude oil futures, the global benchmark, lost 4.15%, or $2.76, to close at $63.76 a barrel. Front-month West Texas Intermediate crude lost $2.83, or 4.56%, to settle at $59.19 a barrel.Speaking to reporters on Wednesday, Trump said he had been informed by \"very important sources\" in Iran that \"the killing has stopped.\"\"There's no plans for executions, I've been told that on good authority,\" he said, adding that the White House would watch how the situation unfolds. The U.S. Treasury Department on Thursday announced sanctions on Iranian officials such as Ali Larijani, secretary of the Supreme Council for National Security. Hundreds of people have reportedly been killed after mass unrest in Iran was met with a violent crackdown by the Islamic Republic's security forces. Trump has repeatedly threatened to intervene if civilians are killed or executed by the state. Stock Chart IconStock chart iconBrent crude priceOil prices jumped on Tuesday after Trump canceled meetings with Iranian officials and promised protesters that \"help is on its way,\" and extended gains on Wednesday amid mounting concerns that a U.S. strike on the country was looming. Those fears were fueled by a report from news agency Reuters that some personnel had been directed to leave the U.S. military's Al Udeid Air Base in Qatar by Wednesday evening. The BBC also reported that some British personnel were being moved out of the base. On Tuesday, the U.S. government issued an advisory to American citizens to leave Iran by land to Armenia or Turkey. \"Leave Iran now. Have a plan for departing Iran that does not rely on U.S. government help,\" the U.S. Virtual Embassy in Iran said. \"If you cannot leave, find a secure location within your residence or another safe building. Have a supply of food, water, medications, and other essential items.\"In a note on Thursday morning, Deutsche Bank's Jim Reid said Trump's comments about the killing in Iran stopping had been taken by markets as \"a signal that the U.S. might hold off on a potential military response.\"\"[But] there's clearly lingering caution, not least given the unexpected timing of U.S. strikes on Iran in June 2025,\" he noted. \"Brent crude is still clearly above its lows below $60/bbl last week, but Trump's comments had a clear impact.\"\"Bear in mind as well that Iran is a more significant oil producer than Venezuela, producing 4% of the world's total in 2023, so developments there have the potential for wider spillovers in the oil market,\" Reid added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oil falls more than 4% as traders see Trump backing away from Iran strike threats",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108251909-17683310112026-01-13t183914z_1803933739_rc2h0ja26e51_rtrmadp_0_usa-trump.jpeg?v=1768331058&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T20:20:41.000Z",
      "dateModified": "2026-01-15T20:20:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI tells investors to brace for 'deliberately outlandish' claims from Musk ahead of trial",
    "url": "https://www.cnbc.com/2026/01/15/openai-to-investors-expect-deliberately-outlandish-claims-from-musk.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204530-1758900517239-gettyimages-2236544077-STARGATE_DATA_CENTER.jpeg?v=1768518084&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-16T00:10:03.000Z",
    "description": "Sam Altman, chief executive officer of OpenAI Inc., during a media tour of the Stargate AI data center in Abilene, Texas, US, on Tuesday, Sept. 23, 20",
    "body": "Sam Altman, chief executive officer of OpenAI Inc., during a media tour of the Stargate AI data center in Abilene, Texas, US, on Tuesday, Sept. 23, 2025. Kyle Grillot | Bloomberg | Getty ImagesOpenAI sent a letter Thursday to investors and banking partners warning that it expects Elon Musk to make \"deliberately outlandish, attention-grabbing claims\" as his lawsuit against the AI lab heads to trial in April. The trial will mark a public escalation of Musk's years-long feud with OpenAI, and the company's letter serves as an attempt to preempt and alleviate investors' concerns. OpenAI has raised billions of dollars from venture capitalists, and its valuation has swelled to $500 billion.Musk co-founded OpenAI as a nonprofit research company in 2015 alongside several other researchers and executives, including the startup's CEO Sam Altman. He filed a lawsuit against OpenAI in 2024 alleging he was \"assiduously manipulated\" and \"deceived\" after the AI company explored converting to a for-profit entity and established an \"opaque web of for-profit OpenAI affiliates,\" including its multibillion-dollar partnership with Microsoft.  Musk departed OpenAI's board in 2018, but he has argued that he is owed \"the value of all intellectual property developed\" from his contributions, potentially amounting to billions of dollars, according to a complaint.  \"We have strong defenses and feel confident about our chances of winning the case,\" OpenAI said in the letter, which was viewed by CNBC. \"Regardless, based on the record so far, we believe this case is worth no more than the $38M that Elon donated - though that is not a guarantee.\" OpenAI declined to comment on the letter.Earlier this month, U.S. District Judge Yvonne Gonzalez Rogers ruled that the case will proceed to trial. The lawsuit was filed in August 2024 in the U.S. District Court in the Northern District of California.OpenAI said it expects Musk will make comments about the AI company that are not \"grounded in reality\" and are \"typical of the harassment tactics he's previously deployed,\" according to the letter.  \"Elon's lawsuit remains baseless and without merit, and our team is focused on ensuring the jury sees these claims for what they are,\" OpenAI said.WATCH: OpenAI Investor Letter: Weekly and daily active user figures ‘continue to produce all-time highs’watch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI tells investors to brace for 'deliberately outlandish' claims from Musk ahead of trial",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108204530-1758900517239-gettyimages-2236544077-STARGATE_DATA_CENTER.jpeg?v=1768518084&w=1920&h=1080"
      ],
      "datePublished": "2026-01-16T00:10:03.000Z",
      "dateModified": "2026-01-16T00:10:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taiwan will invest $250 billion in U.S. chipmaking under new trade deal",
    "url": "https://www.cnbc.com/2026/01/15/us-taiwan-chips-deal-china.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108240992-1768509472874-108240992-17654969442025-12-11t234501z_1287636350_rc2neia7vqwp_rtrmadp_0_usa-trump.jpeg?v=1768509490&w=1920&h=1080",
    "tag": "Finance",
    "date": "2026-01-15T21:54:35.000Z",
    "description": "watch nowThe U.S. and Taiwan have reached a trade agreement to build chips and chip factories on American soil, the Department of Commerce announced T",
    "body": "watch nowThe U.S. and Taiwan have reached a trade agreement to build chips and chip factories on American soil, the Department of Commerce announced Thursday.As part of the agreement, Taiwanese chip and technology companies will invest at least $250 billion in production capacity in the U.S., and the Taiwanese government will guarantee $250 billion in credit for these companies. In exchange, the U.S. will limit \"reciprocal\" tariffs on Taiwan to 15%, down from 20%, and commit to zero reciprocal tariffs on generic pharmaceuticals, their ingredients, aircraft components and some natural resources.Taiwan Semiconductor Manufacturing Co. has bought land and could expand in Arizona as part of this deal, Commerce Secretary Howard Lutnick told CNBC's Brian Sullivan in an interview Thursday. \"They just bought hundreds of acres adjacent to their property,\" Lutnick said. \"I'll let them go through with their board and give them time.\"\"Regarding TSMC's plans, the market demand for our advanced technology is very strong, we continue to invest in Taiwan and expand overseas, all the investment decisions are based on market conditions and customer demands,\" a TSMC spokesperson told CNBC. The announcement added that future tariffs under the Section 232 framework will have some exceptions for companies that are building chips in the U.S. Taiwanese companies constructing new U.S. chip fabs — such as TSMC — will be able to import up to 2.5 times the amount of capacity they are building while the factories are under construction, without paying tariffs under the framework.  Taiwanese auto parts, lumber and related products will also avoid tariffs over 15% under Section 232, the announcement said. Read more CNBC tech newsMeta's VR layoffs, studio closures underscore Zuckerberg's massive pivot to AIBig Tech is looking to energy talent to fuel its AI ambitionsPalantir is trying to 'destroy' Percepta through legal action, startup's execs say in filingMicrosoft says communities won't see energy price hikes near data centers as utility costs riseWhen the factories are completed, companies will be able to import 1.5 times their U.S. production capacity, Commerce said.The agreement provides clarity to chip companies and technology firms that have grappled with uncertainty during the past year over the Trump administration's approach to tariffs in the semiconductor industry.It also incentivizes TSMC, the world's leading fab company, to continue to build more factories on U.S. soil, while making it clear that it can continue to manufacture chips for U.S. companies in Taiwan. \"As a semiconductor foundry serving customers worldwide, we welcome the prospect of robust trade agreements between the United States and Taiwan,\" a TSMC representative said in a statement. watch nowLutnick said during the interview that Taiwan-based chip companies that don't build in the U.S are likely to face a 100% tariff. He said that the government's objective was to bring 40% of Taiwan's semiconductor supply chain to the U.S.\"That's what they get if they don't build in America, the tariff's likely to be 100%,\" Lutnick said. TSMC has already built fabs in Arizona, investing as much as $40 billion to produce chips for companies like Apple and Nvidia, using previous grants of U.S. government money under the CHIPS Act.The U.S. government has prioritized American production of leading-edge chips as the struggle for access to artificial intelligence semiconductors has become a key geopolitical matter. U.S. officials have also said that there is substantial risk to the U.S. economy if China invades Taiwan and reduces access to TSMC chips. \"We're going to bring it all over so we become self-sufficient in the capacity of building semiconductors,\" Lutnick said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taiwan will invest $250 billion in U.S. chipmaking under new trade deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108240992-1768509472874-108240992-17654969442025-12-11t234501z_1287636350_rc2neia7vqwp_rtrmadp_0_usa-trump.jpeg?v=1768509490&w=1920&h=1080"
      ],
      "datePublished": "2026-01-15T21:54:35.000Z",
      "dateModified": "2026-01-15T21:54:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]