[
  {
    "title": "Trump plans huge oil drilling expansion off California and Alaska coasts",
    "url": "https://www.cnbc.com/2025/11/20/trump-offshore-oil-alaska-pacific-california-gulf-mexico.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229518-1763674963295-gettyimages-2245510909-ALASKA_PERMAFROST.jpeg?v=1763675001&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-20T21:53:21.000Z",
    "description": "Oil drilling rigs and support equipment stand on the tundra in Deadhorse, Alaska, on Friday, Sept. 5, 2025. Nathaniel Wilder | Bloomberg | Getty Image",
    "body": "Oil drilling rigs and support equipment stand on the tundra in Deadhorse, Alaska, on Friday, Sept. 5, 2025. Nathaniel Wilder | Bloomberg | Getty ImagesThe Trump administration unveiled plans Thursday for a huge oil drilling expansion off the coasts of Alaska, California and in the Gulf of Mexico. The Department of Interior proposed 34 lease sales to drill in those waters through 2031, a big expansion compared to the Biden administration program that allowed just three lease sales and only in the Gulf. The Trump program would include lease sales in 21 areas off Alaska's coast, six off the Pacific coast and seven in the Gulf of Mexico. It would mark the first time since 1984 that Interior has allowed a new lease in the Pacific, according to the Congressional Research Service.  Interior's proposal is not a final program. It still must undergo further review. Interior Secretary Doug Burgum accused the Biden administration \"crippling the long-term pipeline of America’s offshore production\" by slamming the brakes on oil and gas leasing. More than 100 Democratic lawmakers expressed their opposition to the plan in an Oct. 30 letter addressed to President Donald Trump and Burgum. \"Expanded oil and gas leasing poses risks to the health and livelihoods of our constituents, jeopardizes our tourism, fishing, and recreation economies, and threatens the marine life that inhabits our coastlines,\" the lawmakers wrote. The Natural Resources Defense Council condemned the Trump plan as egregious and reckless in a post Thursday. \"The proposal would open up untouched waters of Alaska to drilling, attempt to resurrect the offshore oil and gas industry in California, and offer up waters off the coast of Florida that haven't been put up for leasing in decades — in addition to adding even more leasing in the Gulf of Mexico,\" the NRDC said. \"This plan would damage these places, and the people who rely on them, for generations,\" the environmental group said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump plans huge oil drilling expansion off California and Alaska coasts",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229518-1763674963295-gettyimages-2245510909-ALASKA_PERMAFROST.jpeg?v=1763675001&w=1920&h=1080"
      ],
      "datePublished": "2025-11-20T21:53:21.000Z",
      "dateModified": "2025-11-20T21:53:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan's core inflation in October rises to a 3-month high, supporting the case for rate hikes ",
    "url": "https://www.cnbc.com/2025/11/21/japans-inflation-cpi-october-takaichi-boj-monetary-plans.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108162965-1750743093357-gettyimages-2220269086-AFP_633Y39D.jpeg?v=1750822861&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T03:44:52.000Z",
    "description": "Customers check out vegetables and other groceries at a supermarket in Tokyo on June 20, 2025.Kazuhiro Nogi | Afp | Getty ImagesJapan's core inflation",
    "body": "Customers check out vegetables and other groceries at a supermarket in Tokyo on June 20, 2025.Kazuhiro Nogi | Afp | Getty ImagesJapan's core inflation in October rose at its sharpest rate since July, in line with market estimates on Friday, supporting the case for interest rate hikes by the Bank of Japan.Core inflation, which strips out prices of fresh food, came in at 3% as expected by economists polled by Reuters. The headline inflation rate rose to 3%, staying above the BOJ's 2% target for 43 straight months.  The so-called \"core-core\" inflation rate, which strips out prices of fresh food and energy, crept up to at 3.1%, compared to 3% in September. Rice inflation continued to ease for a fifth month in a row, dipping to 40.2% from 49.2% in the previous month. Japan's Nikkei 225 was 1.58% lower, while the yen strengthened 0.1% to trade at 157.5 against the dollar as senior Japanese officials voiced concerns on yen moves.BOJ Governor Kazuo Ueda told the country's parliament on Friday that the central bank should be mindful that a weak yen could affect underlying inflation by pushing up import costs and broader prices.Signaling urgency over yen weakness, Japan's Finance Minister Satsuki Katayama reportedly hinted at a possible intervention in the market, saying that she was \"alarmed by recent one-sided, sharp moves in the currency market,\" Reuters reported.According to LSEG data, the dollar has appreciated 2.19% against the yen over the course of November so far, while over the last six months, it has gained 9.52%.Stock Chart IconStock chart iconUeda also had his first bilateral meeting with newly elected Prime Minister Sanae Takaichi earlier this week.During the meeting, Ueda told Takaichi the central bank was \"gradually raising interest rates to guide inflation smoothly towards its 2% target and ensure the economy achieves sustainable growth,\" Reuters reported. Takaichi has been an advocate of a loose monetary policy, and earlier this month told the country's parliament that she hoped that the BOJ \"conducts policy appropriately\" so that the 2% inflation target is achieved by wage gains instead of cost-push factors.\"The type of inflation we're seeing now is not good,\" Takaichi reportedly said. The BOJ governor also said that Takaichi did not make any request related to monetary policy.The central bank is currently caught between a rock and a hard place, with inflation running above target and GDP growth figures weakening as Japan takes a hit from U.S. tariffs.Japan's GDP in the three months to September contracted for the first time in six quarters, falling 0.4% sequentially, and dipping 1.8% on an annualized basis.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan's core inflation in October rises to a 3-month high, supporting the case for rate hikes ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108162965-1750743093357-gettyimages-2220269086-AFP_633Y39D.jpeg?v=1750822861&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T03:44:52.000Z",
      "dateModified": "2025-11-21T03:44:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hyundai showcases off-road ambitions with new rugged concept SUV",
    "url": "https://www.cnbc.com/2025/11/20/hyundai-crater-suv-concept.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229346-1763661835298-IMG_9912_1.jpg?v=1763661926&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-20T18:05:24.000Z",
    "description": "The Hyundai Crater concept SUV was revealed at the LA Auto Show on Thursday, Nov. 20, 2025.Michael Wayland / CNBCLOS ANGELES — Hyundai Motor has ambit",
    "body": "The Hyundai Crater concept SUV was revealed at the LA Auto Show on Thursday, Nov. 20, 2025.Michael Wayland / CNBCLOS ANGELES — Hyundai Motor has ambitions to increase the rugged, off-road capabilities of its vehicles in the U.S., based on a new \"Crater\" concept SUV revealed Thursday.The rugged compact vehicle mixes Hyundai design characteristics with off-road capabilities reminiscent of American SUVs such as the Jeep Wrangler, Ford Bronco and GMC Hummer.\"Crater began with a question: 'What does freedom look like?' This vehicle stands as our answer,\" SangYup Lee, head of Hyundai global design, said in a release. \"It is a vision shaped by our unending drive to explore — to inspire our customers to explore deeper and embrace the impact of adventure.\"Hyundai Crater SUV concept vehicleHyundai Hyundai said the concept vehicle, which made its global debut Thursday at the LA Auto Show, is meant to showcase the automaker's \"commitment to designing even more versatility and emotion\" with future Xtreme Rugged Terrain vehicles.Hyundai declined to discuss the potential of producing a vehicle like the Crater, calling it a \"design exploration.\" Automakers routinely use concept vehicles to gauge customer interest, showcase future technologies and signal the direction of a vehicle or brand.Hyundai currently offers XRT versions of its Ioniq 5 EV, Tucson compact crossover, Santa Cruz compact pickup and Palisade crossover SUV.Hyundai Crater SUV concept vehicleHyundai The Crater concept was conceived at Hyundai's America Technical Center in Irvine, California, the company said.Automakers have ramped up their offerings of vehicles that can go off road or are inspired by them as a way to attract new buyers and boost profits. It's relatively easy for companies to make those models by adding more capable parts and features to current vehicles.\"Crater Concept explores the next evolution of Hyundai's rugged XRT design with even more toughness and capability to reflect U.S. customer desires,\" Hyundai said in the release.Hyundai Crater SUV concept vehicleHyundaiHyundai has been aggressively growing its U.S. vehicle lineup and sales in recent years. The automaker is on pace through the third quarter of 2025 for its fifth consecutive year of record retail sales.From 2019 to 2024, the Hyundai brand's sales increased 21.5% to more than 836,800 units last year. Including its Genesis luxury brand and Kia, which operates separately in the U.S., Hyundai's domestic sales are up 29% during that time to more than 1.7 million vehicles.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hyundai showcases off-road ambitions with new rugged concept SUV",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229346-1763661835298-IMG_9912_1.jpg?v=1763661926&w=1920&h=1080"
      ],
      "datePublished": "2025-11-20T18:05:24.000Z",
      "dateModified": "2025-11-20T18:05:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan October exports massively beat estimates on robust growth in shipments to Asia and Europe ",
    "url": "https://www.cnbc.com/2025/11/21/japan-october-exports-massively-beat-estimates-on-robust-growth-in-shipments-to-asia-and-europe-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108160754-1750204881326-gettyimages-2214757832-SK_14052025_IMG_1012.jpeg?v=1763685392&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T07:05:08.000Z",
    "description": "Shipping container loads dock at Tokyo Bay.Sopa Images | Lightrocket | Getty ImagesJapan's exports in October massively beat expectations, government ",
    "body": "Shipping container loads dock at Tokyo Bay.Sopa Images | Lightrocket | Getty ImagesJapan's exports in October massively beat expectations, government data on Friday showed, as shipments to Europe and Asia saw robust growth. Exports rose 3.6% year on year compared with Reuters-polled economists' estimates of a 1.1% growth. But it was lower than the 4.2% gain seen in September. Shipments to Asia and Western Europe climbed 4.2% and 8.8% year on year, respectively, helping offset the 2.7% decline in exports to North America as goods shipped to the U.S. fell 3.1%.Automobile shipments, the largest Japanese exports to the U.S. by value, fell 7.5% from a year earlier, but it was much softer drop than the 24.2% decline seen in the prior month. Norihiro Yamaguchi, lead economist at Oxford Economics, said that October data \"paints a mixed picture of current export momentum.\"Yamaguchi noted that while capital goods exports remained sluggish due to subdued machinery investment momentum globally, the worst time for auto exports seems to be behind, and semiconductor exports have improved. Overall, Japan's auto exports rose 0.4% in October, while semiconductor shipments climbed 15.8% year on year.\"While we continue to believe that the lagged impact of higher global tariffs will drag on exports in the near term, recent upgrades to our global outlook point to a more modest adjustment than we had previously expected,\" Yamaguchi said.Diplomatic frictionThe data comes at a time when Japan is locked in a diplomatic spat with its largest trading partner, China, over Prime Minister Sanae Takaichi's comments related to Taiwan. The impact on trade from this spat could show up in next month's data. The Asia Group said in a note on Wednesday that mainland China had suspended imports of seafood from Japan. It also pointed to Chinese social media showing some Japanese brand stores in Shanghai and Beijing \"voluntarily\" closing for several days citing \"reasons that everyone know.\"Meanwhile, imports to the world's fourth largest economy unexpectedly rose 0.7%, defying expectations of a 0.7% fall from the Reuters poll. Stronger-than-expected exports data would come as a welcome relief for Japan's economy that struggled in the third quarter. The country's GDP contracted 0.4% quarter on quarter, with net exports dragging the quarterly figure down by 0.2 percentage point. Japan also released its consumer inflation data on Friday, with headline inflation now running above the Bank of Japan's 2% target for 43 months in a row. The Nikkei 225 was 2.38% down after the data release, while the Japanese yen rose marginally to trade at 157.39 against the dollar. Japan's Finance Minister Satsuki Katayama signaled the possibility of intervening in the market, saying that she was \"alarmed by recent one-sided, sharp moves in the currency market,\" Reuters reported.According to LSEG data, the dollar has appreciated 2.19% against the yen over the course of November so far, while over the last six months, it has gained 9.52%.Stock Chart IconStock chart iconMitul Kotecha, head of FX & EM macro strategy for Asia at Barclays, however, told CNBC's \"Squawk Box Asia\" that intervention does not seem to be imminent. \"The problem that the Japanese officials face is that we're still in a broadly positive dollar environment. And as we know, intervention does not work as well when you have the broader market move going against you. It works much better when the move is going with you,\" Kotecha said. He did not entirely disregard chances of an intervention though: \"There's going to be focus on volatility that's going to be important. We hear that from Japanese officials. So may not just be levels, it could also be the pace of the move that could trigger intervention.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan October exports massively beat estimates on robust growth in shipments to Asia and Europe ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108160754-1750204881326-gettyimages-2214757832-SK_14052025_IMG_1012.jpeg?v=1763685392&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T07:05:08.000Z",
      "dateModified": "2025-11-21T07:05:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Singapore raises annual growth forecast as third-quarter GDP tops expectations ",
    "url": "https://www.cnbc.com/2025/11/21/singapore-q3-gdp-forecast-mti-enterprise-exports-pharmaceuticals-drugs-tariffs-trade-mas.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108204778-1758954374692-gettyimages-2221543329-AFP_63YW82Q.jpeg?v=1763687869&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T04:08:34.000Z",
    "description": "People cycle along a track backdropped with the city skyline in Singapore on June 27, 2025.         Roslan Rahman | Afp | Getty ImagesSingapore raised",
    "body": "People cycle along a track backdropped with the city skyline in Singapore on June 27, 2025.         Roslan Rahman | Afp | Getty ImagesSingapore raised its 2025 economic outlook Friday after stronger growth in the third quarter, but warned that expansion is likely to cool in 2026 as the U.S. tariffs weigh on global demand.   The Ministry of Trade and Industry upgraded Singapore's 2025 GDP forecast to around 4%, up from an earlier range of 1.5% to 2.5%, largely thanks to the better-than-expected economic growth in the third quarter.  \"Global economic conditions have turned out to be more resilient than expected,\" the MTI said in a statement, citing stronger demand from key trading partners, stronger demand for semiconductor exports tied to the artificial-intelligence boom and the de-escalation in U.S.-China trade tensions.The economy grew 4.2% in the July-to-September period from a year earlier, extending the second quarter's 4.7% increase, government data showed. The third-quarter growth rate also exceeded the official advance estimate of 2.9% compiled in October and economists' forecast of 4.0% in a Reuters poll, despite elevated trade headwinds during the three months. For 2026, the authorities expected Singapore's economy to grow at a range of 1% to 3%.On a quarter-on-quarter, seasonally adjusted basis, GDP expanded 2.4%, up from 1.7% in the second quarter. The third-quarter growth was mainly driven by manufacturing and export demand, the government said, noting that electronics manufacturing expanded by 6.1%, buoyed by higher demand for AI-related semiconductors and servers.    \"For the rest of the year, demand for AI-related electronics should continue to support our manufacturing and wholesale trade sectors,\" the ministry said.For the first nine months of 2025, the economy grew 4.3% from a year earlier.Although Singapore's economy is expected to hold up relatively well this year, officials cautioned that the growth outlook remains clouded for 2026.  \"GDP growth for most of Singapore's key trading partners is likely to be lower than that in 2025 as the impact of the US' tariffs is expected to be more pronounced,\" the MTI said, cautioning that global economic uncertainty remains elevated. Trade headwinds Singapore's exports to the U.S. are subject to a 10% baseline tariff, relatively low compared with the rates imposed on its Southeast Asian neighbors. But sectoral levies, including a 100% tariff on branded drugs that has been put on hold, remain a key source of worry for Singapore's economy. \"For now, there's still not a lot of clarity around how America intends to apply these sectoral tariffs – for example, where pharmaceuticals are concerned,\" Prime Minister Lawrence Wong said last month, noting that Singapore's trade talks with Washington were at \"a very early stage.\" The implementation of this tariff has been delayed to allow pharmaceutical companies time to negotiate exemptions with the U.S. administration. In the third quarter, non-oil domestic exports (NODX) slipped 3.3% after a 7% rise in the April-to-June period, weighed down by weaker pharmaceutical and petrochemical exports. Shipments to the U.S. fell 30.7% over the same period. But in October, NODX rebounded, surging 22.2% from a year earlier, driven by exports of non-monetary gold and electronic products. Shipments to the U.S. declined 12.5% in October from a year earlier. The Monetary Authority of Singapore is expected to keep its monetary policy stance unchanged in its next meeting in January, as the growth momentum remains largely intact, Lloyd Chan, a strategist at MUFG Bank, said in a note Friday. The central bank left the policy unchanged at its final review of the year in October, citing stable economic performance and subdued inflation.    Singapore's consumer price inflation rose 0.7% in September from a year earlier, in line with the central bank's estimate of 0.5% to 1% this year. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Singapore raises annual growth forecast as third-quarter GDP tops expectations ",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108204778-1758954374692-gettyimages-2221543329-AFP_63YW82Q.jpeg?v=1763687869&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T04:08:34.000Z",
      "dateModified": "2025-11-21T04:08:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fed likely to not cut rates in December following delayed September data, according to market odds",
    "url": "https://www.cnbc.com/2025/11/20/fed-likely-to-not-cut-rates-in-december-following-delayed-september-data-according-to-market-odds.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108218884-1763654000994-108218884-1761764478215-gettyimages-2243490783-POWELL_FOMC.jpg?v=1763654013&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-20T14:36:31.000Z",
    "description": "Jerome Powell, chairman of the US Federal Reserve, during a news conference following a Federal Open Market Committee (FOMC) meeting in Washington, DC",
    "body": "Jerome Powell, chairman of the US Federal Reserve, during a news conference following a Federal Open Market Committee (FOMC) meeting in Washington, DC, US, on Wednesday, Oct. 29, 2025.Al Drago | Bloomberg | Getty ImagesOdds of a December rate cut remained low following the release of delayed jobs data. Markets were last pricing about a 35% chance of a quarter-point cut from the Federal Reserve next month, according to the CME FedWatch Tool. That is higher than the 30% likelihood priced in during the prior session, but remains weak. The tool used fed funds futures trading to calculate the odds.The target rate is currently at 3.75% to 4.00%.   Those expectations held steady after the release of the September jobs data, the first nonfarm payrolls report investors have seen since the government shutdown. The  report gave an uneven picture of the U.S. labor market. The U.S. economy added 119,000 jobs in September, a headline number that blew away expectations for 50,000 jobs added, according to economists polled by Dow Jones. However, the unemployment rate showed unexpected weakness, rising to 4.4% from 4.3%. The new level is the highest level it's been since October 2021. \"All those numbers suggest an economy that's still hanging in there. Not a dramatic move one way or the other,\" Former Federal Reserve Vice Chairman Roger Ferguson told CNBC's \"Squawk Box\" on Thursday. \"People should take note of the slight uptick in the unemployment rate, but labor force participation still looks pretty strong, average hourly earnings certainly looks strong, or strong enough. And so, I don't think this sort of tilts the cut decision much one way or the other.\" To be sure, some investors are hopeful that weakness in the unemployment rate means a December rate cut remains on the table. The level is closely watched by Fed policymakers, more so than the headline number, and is additionally troubling given that a shrinking labor pool, given the rise in immigration crackdowns, theoretically would keep the job market tight. \"A December cut remains possible given continued labor market softness as expressed by the unemployment rate,\" wrote Kay Haigh, global co-head of fixed income and liquidity solutions at Goldman Sachs Asset Management. \"Weak hard data and close-to-target inflation look set to drive policy going forward, despite recent hawkish noises.\" \"The setup is in place for Powell to continue his risk-management approach to the labor market before his term as Chair expires in May,\" Haigh continued. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fed likely to not cut rates in December following delayed September data, according to market odds",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108218884-1763654000994-108218884-1761764478215-gettyimages-2243490783-POWELL_FOMC.jpg?v=1763654013&w=1920&h=1080"
      ],
      "datePublished": "2025-11-20T14:36:31.000Z",
      "dateModified": "2025-11-20T14:36:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan announces $135 billion stimulus, NHK reports, in bid to support economy and consumers",
    "url": "https://www.cnbc.com/2025/11/21/japans-cabinet-announces-135-billion-stimulus-package-nhk.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229676-1763699575670-gettyimages-2245723236-AFP_83QL4G3.jpeg?v=1763699583&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T07:42:55.000Z",
    "description": "Japan's Prime Minister Sanae Takaichi (C) answers a question during a session of the House of Councillors Budget Committee at the National Diet in Tok",
    "body": "Japan's Prime Minister Sanae Takaichi (C) answers a question during a session of the House of Councillors Budget Committee at the National Diet in Tokyo on November 12, 2025. (Photo by Kazuhiro NOGI / AFP) (Photo by KAZUHIRO NOGI/AFP via Getty Images)          Kazuhiro Nogi | Afp | Getty ImagesJapan's cabinet approved a stimulus package totaling 21.3 trillion yen ($135.5 billion) on Friday, as Prime Minister Sanae Takaichi seeks to boost the country's slowing economy and offer support to inflation-hit consumers. Public broadcaster NHK reported that the package was based on three pillars: addressing rising prices, achieving a strong economy, and strengthening defense and diplomatic capabilities, according to a Google translation. This stimulus package is the largest since the Covid-19 pandemic, according to local media. The cabinet also said it would expand local government grants, as well as provide subsidies for electricity and gas bills. The support measures will kick in January, amounting to about 7,000 yen for a standard household over a three-month period, according to the NHK report. Taxes on gasoline will be eliminated. Japan also plans to establish a 10-year fund to enhance its shipbuilding capabilities, and enact measures to raise defense spending to 2% of its gross domestic product by fiscal year 2027.The government said it will \"swiftly compile\" a supplementary budget bill to fund these measures, and plans to pass it by year-end with help from opposition parties. The ruling Liberal Democratic Party currently is a minority government, but is now allied with the Japan Innovation Party. Together they hold 231 seats, two short of a majority in Japan's 465-seat Lower House. Takaichi told reporters that the government will use its revenue to fund the package, and any shortfall would be covered via issuing government bonds.She said that the amount of government bonds would likely be lower than last year's 42.1 trillion yen issued after the supplementary budget, emphasizing that full consideration had been given to fiscal sustainability.Jesper Koll, expert director at Tokyo-based financial services firm Monex Group, told CNBC that Takaichi's move will spook Japanese government bond markets.Japanese bonds have been seeing a sell-off, with yield on the benchmark 10-year JGBs hitting its highest since 2008 on Thursday, at 1.817%. It was down 3 basis points at 1.785% on Friday.   Stock Chart IconStock chart iconKoll said while Takaichi had delivered on her election promise with a larger-than-expected budget, the focus seems to be on short-term and one-off populism, rather than on incentives for positive structural change.Economic worriesThe stimulus package from Takaichi's government comes as Japan has seen inflation consistently run above the central bank's target, with statements from senior officials on price growth stoking fresh worries.  \"Income and price-support measures offer a one-off short term boost to the purchasing power of the people, but will do nothing to solve the fundamental inflation pressures,\" Koll said, adding that to overcome inflation, the economy needs supply-side reform, not demand-side stimulus.  The headline inflation figure for October rose to 3% from 2.9%, staying above the Bank of Japan's 2% target for 43 straight months, while core inflation, which strips out prices of fresh food, came in at 3%.BOJ Governor Kazuo Ueda told the country's parliament on Friday that the central bank should be mindful that a weak yen could affect underlying inflation by pushing up import costs and broader prices.Japan's Finance Minister Satsuki Katayama also warned of yen volatility and reportedly hinted at a possible intervention in the market, saying that she was \"alarmed by recent one-sided, sharp moves in the currency market,\" Reuters reported.Inflation worries have been compounded by Japan's weakening economic growth, with GDP in the three months to September contracting for the first time in six quarters. The economy shrank 0.4% compared with the prior quarter, while it contracted 1.8% on an annualized basis, government data released Monday showed.October trade data, released Friday, however, offered some welcome relief to the country, with exports rising 3.6% year on year and beating expectations as shipments to Asia and Europe offset declines in goods sent to the U.S.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan announces $135 billion stimulus, NHK reports, in bid to support economy and consumers",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229676-1763699575670-gettyimages-2245723236-AFP_83QL4G3.jpeg?v=1763699583&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T07:42:55.000Z",
      "dateModified": "2025-11-21T07:42:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SoftBank sinks over 10% as Nvidia-fueled rout sweeps Asian chip shares",
    "url": "https://www.cnbc.com/2025/11/21/softbank-plunges-nvidia-rout-asian-chip-sk-hynix-tsmc-hon-hai-foxconn-samsung.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108090443-1737552664782-gettyimages-2194606307-AFP_36V94PR.jpeg?v=1763688678&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T08:47:48.000Z",
    "description": "The logo of Japanese company SoftBank Group is seen outside the company's headquarters in Tokyo on January 22, 2025. Kazuhiro Nogi | Afp | Getty Image",
    "body": "The logo of Japanese company SoftBank Group is seen outside the company's headquarters in Tokyo on January 22, 2025. Kazuhiro Nogi | Afp | Getty ImagesA sector-wide pullback hit Asian chip stocks Friday, led by a steep decline in SoftBank, after Nvidia's sharp drop overnight defied its stronger-than-expected earnings and bullish outlook.SoftBank plunged more than 10% in Tokyo. The Japanese tech conglomerate recently offloaded its Nvidia shares but still controls British semiconductor company Arm, which supplies Nvidia with chip architecture and designs.SoftBank is also involved in a number of AI ventures that use Nvidia's technology, including the $500 billion Stargate project for data centers in the U.S.Stock Chart IconStock chart iconSouth Korea's SK Hynix fell 8.76%. The memory chip maker is Nvidia's top supplier of high-bandwidth memory used in AI applications. Samsung Electronics, a rival that also supplies Nvidia with memory, fell 5.77%. Taiwan Semiconductor Manufacturing Company, the world's largest contract chipmaker and manufacturer of Nvidia's chip designs, ended the trading session 4.81% lower.Taiwan's Hon Hai Precision Industry, also known as Foxconn, which manufactures server racks designed for AI workloads, dipped 4.86%.The retreat in major Asian semiconductor giants comes after Nvidia fell over 3% in the U.S. on Thursday, despite beating Wall Street expectations in its third-quarter earnings the night before. The company also provided stronger-than-expected fourth-quarter sales guidance, which analysts said could lift earnings expectations across the sector. Billy Toh, regional head of retail research at CGS International Securities Singapore, said Nvidia was a victim of a combination of a Bitcoin selloff, the possibility of a delayed Fed rate cut and generally tighter financial conditions.\"Add in the ongoing talk of an AI bubble, which triggers a broader risk-off rotation, and naturally Nvidia becomes one of the first pressure points,\" he told CNBC. Smaller chip players in Asia were not spared either. In Tokyo, Renesas Electronics, a key Nvidia supplier, fell 2.65%. Tokyo Electron, which provides essential chipmaking equipment to foundries that manufacture Nvidia's chips, was down 7.14%. Another Japanese chip equipment maker, Lasertec, was down 5.15%, while Advantest stumbled 12.1%.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SoftBank sinks over 10% as Nvidia-fueled rout sweeps Asian chip shares",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108090443-1737552664782-gettyimages-2194606307-AFP_36V94PR.jpeg?v=1763688678&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T08:47:48.000Z",
      "dateModified": "2025-11-21T08:47:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "White House crafting executive order to thwart state AI laws",
    "url": "https://www.cnbc.com/2025/11/20/trump-ai-executive-order-state-funding.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108176051-17533064162025-07-23t213306z_1902303318_rc2lsfa7lvhd_rtrmadp_0_usa-trump-ai.jpeg?v=1753357814&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-20T18:55:19.000Z",
    "description": "U.S. President Donald Trump delivers remarks on artificial intelligence at the \"Winning the AI Race\" Summit in Washington D.C., U.S., July 23, 2025. K",
    "body": "U.S. President Donald Trump delivers remarks on artificial intelligence at the \"Winning the AI Race\" Summit in Washington D.C., U.S., July 23, 2025. Kent Nishimura | ReutersAn executive order that could soon be signed by President Donald Trump would thwart states' artificial intelligence laws by launching legal challenges and withholding federal funding, according to a draft of the order obtained by CNBC on Wednesday.The draft surfaced shortly after Trump publicly called for a single federal standard on AI \"instead of a patchwork of 50 State Regulatory Regimes.\"The draft order would give Attorney General Pam Bondi 30 days to establish an \"AI Litigation Task Force\" whose sole task is to challenge state AI laws.Those challenges would be issued \"on grounds that such laws unconstitutionally regulate interstate commerce, are preempted by existing Federal regulations, or are otherwise unlawful in the Attorney General's judgment,\" the draft says.The order also directs Commerce Secretary Howard Lutnick to notify states with contested AI laws that they are ineligible for funds under the federal Broadband Equity Access and Deployment program. BEAD is a more than $42 billion program that has allocated funding to all U.S. states and territories.The order, which was first reported by The Information, is not yet finalized. A White House official told CNBC that any discussion around it is just speculation until it is officially announced.As written, the EO would be a major win for the burgeoning AI industry, whose leaders — including Sam Altman's OpenAI, venture capital firm Andreessen Horowitz and other Silicon Valley titans — oppose an inconsistent state-by-state policy approach.It would be just as big a blow to state lawmakers across the country who have sought to pass bills that would place guardrails on the nascent technology.New York State Assemblymember Alex Bores, who co-sponsored a state AI safety bill, in a statement to CNBC called the draft EO \"a blank check to Donald Trump's tech billionaire backers who've already made a fortune on — and now stand to profit exponentially more from — allowing unconstrained AI to wipe out jobs, destroy our kids' brains, and drive electricity bills through the roof.\"Bores, a Democrat who is running for Congress, this week became the first target of a well-funded super PAC backed by AI industry leaders.GOP mulls AI moratorium The White House is also working with a group of Republican lawmakers to see if a moratorium on certain state AI laws could be included in one of the major must-pass bills that Congress is working on. That language is still being drafted, but it would likely block states' abilities to regulate on issues like how AI is developed, according to four sources familiar with the discussions. States would likely still be able to craft policy on other AI-related matters such as fraud, consumer protections and images depicting the sexual abuse of children, the sources said.A proposed 10-year ban on states regulating AI was initially included in Republicans' \"big, beautiful bill,\" but cut out before Trump signed it in July.The current draft proposal could have no expiration date, including to one source familiar with the discussions. \"You're seeing China move very aggressively,\" House Majority Leader Steve Scalise, R-La., told CNBC on Tuesday. \"AI is the wave of the future, but we want America to be dominant in it and we want our policies to reflect that.\"There is bipartisan support for new federal AI policy — even from those supporting state-level action.\"Let's be clear: we need a federal solution. But we need one that's crafted by experts and doesn't sell you out to the highest bidder. Until then, states must act,\" Bores said in an X post Thursday.But there is also bipartisan opposition to boxing out the states.\"There should not be a moratorium on states rights for AI,\" Rep. Marjorie Taylor Green, R-Ga., wrote on X. \"States must retain the right to regulate and make laws on AI and anything else for the benefit of their state.\"House Minority Leader Hakeem Jeffries, D-N.Y., also shot down the idea of a state-level AI moratorium. \"That provision doesn't appear to have a lot of support amongst Democrats and Republicans in the Congress,\" he told CNBC in a brief hallway interview. \"So I don't know why Donald Trump is bringing it back up at this time.\"Sen. Mark Warner, D-Va., told CNBC's \"Squawk Box\" on Thursday morning that he is open to a single national pre-emption.  but it would be a mistake to block states for acting until one is ready. \"If we take away the pressure from the states, Congress will never act,\" Warner said. \"Let's look at the fact we never did anything on social media. If we make that same response on AI and don't put guardrails, I think we'll come [to] rue it.\"— CNBC's Kevin Breuninger contributed to this report. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White House crafting executive order to thwart state AI laws",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108176051-17533064162025-07-23t213306z_1902303318_rc2lsfa7lvhd_rtrmadp_0_usa-trump-ai.jpeg?v=1753357814&w=1920&h=1080"
      ],
      "datePublished": "2025-11-20T18:55:19.000Z",
      "dateModified": "2025-11-20T18:55:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gap comparable sales surge after viral 'Milkshake' denim ad with Katseye",
    "url": "https://www.cnbc.com/2025/11/20/gap-q3-2025-earnings.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108228531-1763578666817-gettyimages-2244757053-dsc_0809_vz2rmztg.jpeg?v=1763578708&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-20T21:23:11.000Z",
    "description": "Shoppers walk past a GAP fashion retail store on Oxford Street on October 30, 2025 in  London, United Kingdom.  John Keeble | Getty Images News | Gett",
    "body": "Shoppers walk past a GAP fashion retail store on Oxford Street on October 30, 2025 in  London, United Kingdom.  John Keeble | Getty Images News | Getty ImagesApparel retailer Gap said Thursday its comparable sales rose 5% during the fiscal third quarter, driven by strong revenue at its namesake brand after its viral \"Better in Denim\" campaign with girl group Katseye. Putting aside pandemic-related spikes, the rise in comparable sales is the strongest growth for Gap since its fiscal 2017 holiday quarter and is well ahead of Wall Street expectations of 3.1%, according to StreetAccount. In an interview with CNBC, CEO Richard Dickson said the company hasn't needed to discount as often to sell products, it's winning customers from all income cohorts and it's seeing a \"great start\" to the holiday shopping season. \"While external data points to macro pressure, particularly on the low-income consumer, our customers are finding our price value, [and] our styles are breaking through the competitive landscape,\" said Dickson. \"Our product is resonating. So we're very confident as we head into the holiday season.\" Shares of Gap rose 5% in extended trading Thursday. Here's how the largest specialty apparel company in the U.S. performed during the quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:Earnings per share: 62 cents vs. 59 cents expectedRevenue: $3.94 billion vs. $3.91 billion expectedThe company's net income during the three months ended Nov. 1 declined nearly 14% to $236 million, or 62 cents per share, compared with $274 million, or 72 cents per share, a year earlier. Sales rose to $3.94 billion, up 3% from $3.83 billion a year earlier. For Gap's fiscal year, which is slated to end around early February, the company is now guiding to the high end of its previously released sales forecast, expecting sales to rise between 1.7% and 2%, in line with analyst expectations. It previously expected sales to rise between 1% and 2%.The company is now expecting its full-year operating margin to be around 7.2%, compared to its previous range of between 6.7% and 7%. The forecast includes the impact of tariffs, estimated to be between 1 and 1.1 percentage points. Comparable sales across Gap, which owns its namesake banner, Old Navy, Athleta and Banana Republic, have been positive now for seven straight quarters. Under Dickson, the company has been as focused on boosting profitability and fixing operations as it has been on reigniting cultural relevance, which has led to sustained sales growth across the portfolio. Gap's profitability had been growing, too, as a result, but now that it's facing tariffs, the retailer's gross margin and net income are both taking a hit. During the quarter, Gap's gross margin fell 0.3 percentage points to 42.4% but still came in higher than expectations of 41.2%, according to StreetAccount. The 14% decline in Gap's net income was primarily related to tariffs, finance chief Katrina O'Connell said in an interview. Gap's better-than-expected results come as apparel sales remain generally soft across the industry and consumers pull back on nice-to-have items like new clothes in favor of necessities. Aside from clear value players like Walmart and TJX Companies, earnings so far this season have been muted, with some companies blaming macroeconomic conditions and expressing caution about the holiday season. Dickson said Gap's varied portfolio gives it a hedge in uncertain economic times because it can capture shoppers in a variety of different places. \"Our portfolio appeals to a wide range of consumers, which is giving us great flexibility in today's environment,\" said Dickson. Here's a closer look at how each of the company's brands performed: Gap Gap's namesake brand has been the focus of Dickson's turnaround strategy since he took the helm as CEO just over two years ago. During the quarter, comparable sales rose a staggering 7% – more than double the 3.2% gain analysts had expected, according to StreetAccount. Revenue rose 6% to $951 million. During the quarter, Gap released its viral \"Milkshake\" campaign, featuring the early-aughts Kelis song and members of the Katseye pop group. The campaign helped sales, but Dickson said Gap brand's growth is \"a story about consistency\" and a mix of better product, marketing and partnerships. Old Navy Sales at Old Navy, Gap's largest brand by revenue, rose 5% to $2.3 billion with comparable sales up 6%, far better than the 3.8% that analysts surveyed by StreetAccount expected. The company said it saw growth in key categories like denim, activewear, kids and baby. Banana Republic The elevated, work-friendly brand is still in turnaround mode but saw sales grow 1% to $464 million during the quarter with comparable sales up 4%, better than the 3.2% gain analysts had expected, according to StreetAccount. This was the second quarter in a row Banana reported positive comparable sales, which the company attributed to better marketing and product. Athleta Both revenue and comparable sales at Athleta were down a whopping 11% to $257 million, an eyesore on Gap's otherwise better-than-expected results. Dickson has repeatedly said Athleta is in a reset year, but how long that reset will take remains unclear. \"We have been disappointed in the trend. We understand there's a lot of work to do, but I really do believe in the brand,\" said Dickson. \"I believe in the leadership and we will continue to build this brand for the long term. It does deserve it.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gap comparable sales surge after viral 'Milkshake' denim ad with Katseye",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108228531-1763578666817-gettyimages-2244757053-dsc_0809_vz2rmztg.jpeg?v=1763578708&w=1920&h=1080"
      ],
      "datePublished": "2025-11-20T21:23:11.000Z",
      "dateModified": "2025-11-20T21:23:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Foxconn highlights growing AI ambitions at 'Tech Day' as it grows beyond iPhone assembler identity",
    "url": "https://www.cnbc.com/2025/11/21/foxconn-hon-hai-ai-openai-apple-iphone-assembler-chatgpt-openai-nvidia-sam-altman-young-liu.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225612-1763059582598-B76A3253MOV15_30_29_21Still001.jpg?v=1763059771&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T08:34:08.000Z",
    "description": "The entrance to a Foxconn construction site in Mount Pleasant, Wisconsin, in May 2019.Katie Tarasov | CNBCFoxconn showcased its push into artificial i",
    "body": "The entrance to a Foxconn construction site in Mount Pleasant, Wisconsin, in May 2019.Katie Tarasov | CNBCFoxconn showcased its push into artificial intelligence at its annual 'Hon Hai Tech Day' in Taiwan on Friday, underscoring  the world's largest contract manufacturer's efforts to evolve beyond its role as the biggest assembler of Apple's iPhones. The company, officially known as Hon Hai Precision Industry Co., has also become a major player in the AI hardware space, with its event taking place the same day it announced a partnership with ChatGPT maker OpenAI. OpenAI CEO Sam Altman, in a video statement streamed at the event, said that the two firms would \"share insight into emerging hardware needs across the AI industry.\" He added that Foxconn would use those insights to design and prototype new equipment that could be manufactured in the United States.The partnership will center on Foxconn's server business, which earlier this year became its largest revenue driver and helped drive record profit in the September quarter. Describing Foxconn and OpenAI as \"natural partners,\" Kirk Yang, an adjunct finance professor at National Taiwan University, told CNBC, \"OpenAI needs strong partners, not only to manufacture products, but to quickly introduce all the products to the market.\"\"So I think it makes perfect sense for OpenAI  to work with Foxconn. And Foxconn is probably the strongest partner that open AI can find,\" he added.watch nowFoxconn also announced a partnership with Intrinsic, a unit of Alphabet to build so-called \"artificial intelligence factories.\" The Taiwanese manufacturer highlighted deeper work with Nvidia as well, showcasing its compute trays for the chip designer's cutting-edge Blackwell chips.Speaking at the Friday event, Alexis Bjorlin, vice president and general manager of Nvidia's DGX Cloud unit, said the partners would work on deploying advanced AI infrastructure much faster to meet customer demand.AI hardware orders have surged this year, with Nvidia beating third-quarter expectations on Wednesday and providing a strong forecast for the current quarter.Despite Nvidia's results showing that demand for AI hardware remains strong, concerns persist in the market about a potential AI bubble and the sustainability of heavy AI spending. Speaking to CNBC's Emily Chan on the sidelines of Hon Hai Tech Day, Foxconn Chairman Young Liu expressed confidence that the company would be protected from a potential AI bubble.\"No matter what [AI] models or [AI] model players will win, they all need hardware, and no matter what GPU player will win, they all need system and component suppliers to support them,\" he said.— CNBC's Emily Chan contributed to this report",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Foxconn highlights growing AI ambitions at 'Tech Day' as it grows beyond iPhone assembler identity",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225612-1763059582598-B76A3253MOV15_30_29_21Still001.jpg?v=1763059771&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T08:34:08.000Z",
      "dateModified": "2025-11-21T08:34:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Feds charge 4 in plot to export restricted Nvidia chips to China, Hong Kong",
    "url": "https://www.cnbc.com/2025/11/20/nvidia-ai-chips-china-gpu.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229164-17636513282025-11-05t081214z_2091479820_rc2nfgakvd7y_rtrmadp_0_china-chips.jpeg?v=1763651345&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-20T22:02:15.000Z",
    "description": "Four men have been indicted on federal criminal charges related to a plot to export Nvidia chips worth millions of dollars to China and Hong Kong in v",
    "body": "Four men have been indicted on federal criminal charges related to a plot to export Nvidia chips worth millions of dollars to China and Hong Kong in violation of tight U.S. restrictions, court documents show.The chips are highly restricted from exports because of their use in artificial intelligence and supercomputing applications, according to the indictment unsealed Thursday in U.S. District Court in Tampa, Florida.One of the defendants, Brian Curtis Raymond, a 46-year-old resident of Huntsville, Alabama, was identified last week as the chief technology officer of an artificial intelligence cloud company in Virginia that announced plans for a merger that would allow its stock to be publicly traded. That company is not implicated in the case, and told CNBC that his job offer has been rescinded.Raymond and the other three defendants, all of whom were born in China or Hong Kong, are charged with conspiracy to violate the Export Control Reform Act of 2018 in connection with the export and attempted export of the Nvidia chips to end users in China and Hong Kong, after first shipping the chips to Malaysia and Thailand. The defendants had not obtained a license or authorization for such exports from the Commerce Department, according to the indictment.The indictment was first reported by CourtWatch, the court document aggregation news site founded by counterrorism researcher Seamus Hughes.The U.S. Attorney's Office for the Middle District of Florida, which is prosecuting the case, said that 400 Nvidia A100 chips were exported to China as part of the scheme from October 2024 and January in two separate shipments. \"The third and fourth exports to [China] were disrupted by law enforcement and therefore not completed,\" the office said. \"These attempted exports related to ten Hewlett Packard Enterprises supercomputers containing NVIDIA H100 GPUs and 50 separate NVIDIA H200 GPUs.\"The indictment notes that China \"is rapidly developing exascale supercomputing capabilities and has announced its intent to be the world leader in AI by 2030.\"\"These capabilities are being used by the PRC [People's Republic of China] for its military modernization efforts and in connection with the PRC's weapons design and testing, including for weapons or mass destruction,\" the indictment says.Raymond owned a technology products distributor company in Huntsville, which was \"licensed to sell Nvidia GPUs [graphics processing units], among other products,\" the indictment says. Raymond's LinkedIn page says his company, Bitworks, is or was a \"Nvidia Cloud Partner delivering H100, H200, and coming Blackwell / NVL72 clusters for customers.\"Raymond and another co-defendant in the case, Mathew Ho, would \"cause freight forwarded to chip Nvidia GPUs to third countries, knowing that the GPUs were ultimately destined for and would be transhipped to the\" People's Republic of China,  the indictment alleges. Ho, a 34-year-old who was born in Hong Kong, is a U.S. citizen who lives in Florida. He is also known as Hon Ning Ho.Ho was the registered agent of a company in Tampa called Janford Realtor, which, despite its name, was never involved in any real estate transactions, but instead \"served as an intermediary for several unlawful and unlicensed exports to\" China of the advanced and highly-controlled chips, the indictment says.As part of the alleged conspiracy, Ho and Raymond would submit documents related to the shipments that contained false information about the ultimate cosignors for the chips, the value of the chips and the licenses required for their export, the indictment says.Raymond was arrested on Wednesday and later appeared in U.S. District Court for the Northern District of Alabama. His wife declined to comment.Raymond's lawyer, Tae Lee, declined to comment on the charges.On Nov. 10, three days before the indictment was filed in Tampa, Raymond was identified in a press release issued by Corvex, an Arlington, Virginia-based AI cloud company, as its chief technology officer.The press release said Corvex and Movano Health, a publicly traded company that sells medical wearables, had agreed to a merger that would enable Corvex to become publicly traded. A Corvex spokesperson, in a statement to CNBC after being asked about Raymond, said, \"Corvex had no part in the activities cited in the Department of Justice's indictment.\"\"The person in question is not an employee of Corvex. Previously a consultant to the company, he was transitioning into an employee role but that offer has been rescinded,\" the spokesperson saidIn addition to the top count of conspiracy, Raymond is charged with two counts of violations of the Export Control Reform Act in connection with an attempt to export 50 Nvidia H200 GPUs to China through Thailand earlier this year, and the attempted export of about 10 HP supercomputers containing Nvidia H100 GPUs to China through Thailand earlier this year. He is also charged with one count of smuggling goods from the United States related to the attempted export of the 50 Nvidia H200 chips.Raymond is also charged with seven counts of money laundering related to wire transfers totaling more than $3.4 million from a bank account for a company in China to a bank account belonging to Raymond's company in Huntsville, and to Janford Realtor.Ho and the two other defendants in the case, Jing Chen and Cham Li, were all arrested in recent days, according to court documents.Those three men, as part of the alleged conspiracy, would identify customers in China who wanted to buy the Nvidia chips, the indictment says.Ho and Chen, a 45-year-old also known as Harry Chen, were arrested in Tampa. They are being held without bail. In addition to the conspiracy count, Ho is charged with nine money laundering counts in connection with $4 million in wire transfers from the bank account for the Chinese company to Janford Realtor and to Raymond's company. He is also charged with four counts of violating the Export Control Reform Act, and three counts of smuggling.Ho's lawyer, Samuel Williams, declined to comment on the case.Chen is a Chinese national who entered the U.S. on a student visa and who resides in Tampa.He is charged with conspiracy, one count of violating the ECRA, and one count of smuggling.Information about Chen's lawyer was not publicly available.Li, a 38-year-old also known as Tony Li, was arrested in California and was due to appear in Oakland federal court on Thursday. Information about Li's lawyer was not available. A Chinese national who lives in California, Li was identified as a manager of Janford Realtor, according to the indictment.He is charged with a single count each of conspiracy, violating the ECRA and smuggling.All four defendants face a possible maximum sentence if convicted of 20 years in prison.— CNBC's Samantha Subin contributed to this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Feds charge 4 in plot to export restricted Nvidia chips to China, Hong Kong",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229164-17636513282025-11-05t081214z_2091479820_rc2nfgakvd7y_rtrmadp_0_china-chips.jpeg?v=1763651345&w=1920&h=1080"
      ],
      "datePublished": "2025-11-20T22:02:15.000Z",
      "dateModified": "2025-11-20T22:02:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oil prices and energy stocks fall sharply on Trump’s new Ukraine peace plan",
    "url": "https://www.cnbc.com/2025/11/21/oil-prices-energy-stocks-in-focus-amid-trumps-new-ukraine-peace-plan.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108229773-1763727501260-108229773-1763719482645-gettyimages-2238142618-AFP_77E24D2.jpg?v=1763727510&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T12:06:24.000Z",
    "description": "This aerial picture shows the oil tanker Boracay anchored off the Atlantic Coast off Saint-Nazaire, western France on October 1st, 2025. French author",
    "body": "This aerial picture shows the oil tanker Boracay anchored off the Atlantic Coast off Saint-Nazaire, western France on October 1st, 2025. French authorities said Wednesday they were investigating the oil tanker Boracay anchored off the Atlantic Coast and suspected of being part of Russia's clandestine \"shadow fleet\".Damien Meyer | Afp | Getty ImagesOil prices extended declines and energy stocks fell sharply on Friday morning as U.S. President Donald Trump pushed for a peace deal to end the long-running Russia-Ukraine war. International benchmark Brent crude futures with January expiry slipped 1.6% to $62.38 per barrel at 11:47 a.m. London time (6:47 a.m. ET), after dipping 0.2% in the previous session. The contract is down more 16% so far this year. U.S. West Texas Intermediate futures with January expiry were last seen 2% lower at $57.85, after closing Thursday off 0.5%.  Europe's Stoxx Oil and Gas index, meanwhile, led losses during morning deals, down more than 2.4%. Britain's Shell and BP were both trading around 1.6% lower. Norway's Equinor fell 2.7%, while Germany's Siemens Energy plunged 8%. U.S. oil giants Exxon Mobil and Chevron were seen marginally lower during premarket trade.The bearish market sentiment comes as investors pore over the details of the Trump administration's push to secure a peace deal between Russia and Ukraine. The U.S., under a widely leaked plan, has reportedly proposed that Ukraine cede land including Crimea, Luhansk and Donetsk, and pledge never to join the NATO military alliance.  The plan also says Kyiv will receive \"reliable\" security guarantees, while the size of the Ukrainian Armed Forces will be limited to 600,000 personnel, according to The Associated Press, which obtained a copy of the draft proposal. CNBC has not been able to independently verify the report.Analysts were doubtful that the peace plan, which is thought to be favorable toward Russia, would be backed by Ukraine. Read moreGuntram Wolff, senior fellow at Bruegel, a Brussels-based think tank, was among those skeptical about whether the proposed peace plan could lead to a deal.\"I think it's always good to talk each other so in that sense it's a good development but I have to say when I saw the details of this supposed peace plan, I really don't think it can fly,\" Wolff told CNBC's \"Europe Early Edition\" on Friday. \"Because at the core, what it says is that Ukraine should give up significant parts of its military personnel, meaning the military personnel would decrease by something like a third from 900,000 to 600,000,\" he added. A general view of a PJSC Lukoil Oil Company storage tank at an oil terminal located on the Chaussee de Vilvorde on October 30, 2025 in Brussels, Belgium.Thierry Monasse | Getty Images News | Getty ImagesStrategists at Saxo Bank said in a research note that oil prices had come under pressure on Friday as the U.S. steps up its push for Ukraine \"to accept the terms of a draft plan to end the war it has pieced together with Russia, even as sanctions are set to hit Russian crude from largest producers Rosneft and Lukoil.\"They observed that Brent prices were trading near the range low of $62.34, with the next support near the $60 area.Alongside the peace plan noise, energy market participants closely monitored the potential impact of U.S. sanctions against Russian oil producers Rosneft and Lukoil, with the measures taking effect from Friday, a stronger U.S. dollar and expectations for the Federal Reserve's upcoming interest rate decision.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oil prices and energy stocks fall sharply on Trump’s new Ukraine peace plan",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108229773-1763727501260-108229773-1763719482645-gettyimages-2238142618-AFP_77E24D2.jpg?v=1763727510&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T12:06:24.000Z",
      "dateModified": "2025-11-21T12:06:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joby lawsuit accuses air taxi rival Archer of using stolen information to 'one-up' deal",
    "url": "https://www.cnbc.com/2025/11/20/joby-archer-air-taxi-lawsuit.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107333466-1754314199266-107333466-16999728042023-11-13t203401z_795537875_rc2xb4azleza_rtrmadp_0_usa-aviation-new-york-joby.jpg?v=1754314209&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-21T03:26:47.000Z",
    "description": "An electric air taxi by Joby Aviation flies near the Downtown Manhattan Heliport in Manhattan, New York City, U.S., November 12, 2023.Roselle Chen | R",
    "body": "An electric air taxi by Joby Aviation flies near the Downtown Manhattan Heliport in Manhattan, New York City, U.S., November 12, 2023.Roselle Chen | ReutersAir taxi maker Joby Aviation in a new lawsuit accused competitor Archer Aviation of using stolen information by a former employee to \"one-up\" a partnership deal with a real estate developer.\"This is corporate espionage, planned and premeditated,\" Joby said in the lawsuit filed Wednesday in a  California Superior Court in Santa Cruz, where the company is based.The lawsuit alleges that Joby's then-U.S. state and local policy lead, George Kivork, downloaded dozens of files and sent some content to his personal email two days before he resigned in July to take a job at Archer, which had recruited him. By August, Joby said a partner that worked with Kivork said it had been approached by Archer with a \"more lucrative deal.\" Joby alleges that the eVTOL rival's understanding of \"highly confidential\" details helped it leverage negotiations. Joby also said the developer attempted to terminate the agreement, citing a breach of confidentiality.Archer called the suit \"baseless litigation\" meant to slow its leading competitor in a statement to CNBC.\"Joby's case is entirely without merit,\" said Eric Lentell, Archer's chief legal & strategy officer. \"The complaint, regarding a non-technical employee who recently joined Archer in a business development role, does not identify a single specific trade secret let alone any evidence of misappropriation.\"Archer said it has rigorous employee onboarding procedures that are meant to prevent the kinds of actions Joby has accused it of.Read more CNBC tech newsNvidia earnings takeaways: Bubble talk, 'half a trillion' forecast and China ordersNvidia says there's 'no assurance' of final agreement with OpenAI despite $100 billion pactMeta chief AI scientist Yann LeCun is leaving to create his own startupBlock's stock pops 9% on gross profit forecast, 3-year financial outlookA hearing is scheduled for March 20, 2026. Joby said Kivork refused to return the files when approached by the company after an investigation, according to the suit. The company also claims Archer denied wrongdoing, and would not disclose how it learned about the terms of the agreement or provide results from an internal investigation it allegedly undertook.Prior to joining Joby, Kivork worked as senior public policy manager at Lyft. He also served as an attorney within the U.S. Commerce Department's Office of the General Counsel. In that role, Kivork worked on rules to \"protect U.S. manufacturers and exporters against unfair trade practices,\" according to his LinkedIn.The lawsuit comes during a busy period for electric vertical takeoff and landing (eVTOL) technology as companies race to gain Federal Aviation Administration certification to start flying commercially. 'The sector has also benefitted from President Donald Trump's newly minted eVTOL pilot program.Joby argued in the complaint that it's \"imperative\" to protect Joby's work \"from this type of espionage\" to promote the sector's success and ensure fair competition.Last week, Joby said it completed its first test flight for a hybrid aircraft it's working on with defense contractor L3Harris. This month, Amazon-backed Beta Technologies, another electric flight company, also went public on the New York Stock Exchange.Joby shares have more than doubled over the last year, while Archer is up about 36%.In August 2023, Archer settled a previous legal dispute with Boeing-owned Wisk Aero over the alleged theft of trade secrets. As part of the deal, Archer agreed to use Wisk as its autonomous tech partner.Stock Chart IconStock chart iconJoby and Archer year-to-date stock chart.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joby lawsuit accuses air taxi rival Archer of using stolen information to 'one-up' deal",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/107333466-1754314199266-107333466-16999728042023-11-13t203401z_795537875_rc2xb4azleza_rtrmadp_0_usa-aviation-new-york-joby.jpg?v=1754314209&w=1920&h=1080"
      ],
      "datePublished": "2025-11-21T03:26:47.000Z",
      "dateModified": "2025-11-21T03:26:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Existing home sales see small October gain, but supply is now dropping",
    "url": "https://www.cnbc.com/2025/11/20/october-existing-home-sales-supply.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108219034-1761773825504-gettyimages-2244041610-300150final.jpeg?v=1762792923&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-11-20T15:45:26.000Z",
    "description": "watch nowImprovement in mortgage rates at the end of the summer boosted home sales, but that gain may be short-lived.Sales of previously owned homes i",
    "body": "watch nowImprovement in mortgage rates at the end of the summer boosted home sales, but that gain may be short-lived.Sales of previously owned homes in October rose 1.2% from September to 4.1 million units on a seasonally adjusted, annualized basis, according to the National Association of Realtors. Sales were up 1.7% year over year. This count is based on home closings, so contracts likely signed in August and September. While contract signings would not be impacted by the government shutdown that started in October, closings, especially those requiring flood insurance or government-backed rural home loans, could be.During that contract-signing period, the average rate on the 30-year fixed mortgage came down for a bit but then moved up again. The popular 30-year rate started August at 6.63%, fell steadily to 6.13% by mid-September, and then came back up to 6.37% by the end of the month, according to Mortgage News Daily. It now stands at 6.36%.The inventory of homes for sale has also come down. After gaining for much of this year, supply fell to 1.52 million units, down 0.7% from September, although still nearly 11% higher than a year earlier. At the current sales pace, there is a 4.4-month supply, still considered lean.Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.And that's why prices are still gaining. The median price of a home sold in October was $415,200, an increase of 2.1% from October 2024 and the 28th consecutive month of annual gains. \"Looking ahead, home shoppers in today's market face some advantages from falling mortgage rates and seasonally slower competition,\" said Danielle Hale, chief economist at Realtor.com, in a release. \"At the same time, a lack of housing affordability continues to be a challenge keeping home sales in their historically low level.\"Homes are staying on the market longer, at an average of 34 days last month compared with 29 days last October. First-time buyers made a comeback in the market, representing 32% of sales, up from 27% a year ago — but not all regions are equal. \"First-time homebuyers are facing headwinds in the Northeast due to a lack of supply and in the West because of high home prices,\" said Lawrence Yun, chief economist for the Realtors. \"First-time buyers fared better in the Midwest because of the plentiful supply of affordable houses and in the South because there is sufficient inventory.\"Sales growth continues to be strongest on the high end of the market. Homes priced above $1 million saw sales up more than 16% from a year ago, and those priced between $750,000 and $1 million saw a gain of 10%. Meanwhile sales of homes priced between $100,000 and $250,000 were up just about 1%, and homes priced below $100,000 saw a drop in sales of nearly 3%. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Existing home sales see small October gain, but supply is now dropping",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108219034-1761773825504-gettyimages-2244041610-300150final.jpeg?v=1762792923&w=1920&h=1080"
      ],
      "datePublished": "2025-11-20T15:45:26.000Z",
      "dateModified": "2025-11-20T15:45:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]