[
  {
    "title": "The ultimate guide to teaching your children the money skills they’ll need for life",
    "url": "https://www.cnbc.com/2025/12/08/how-to-teach-your-children-money-skills-saving-budgeting-investing.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108237419-1764955324309-GettyImages-2151820656.jpg?v=1764971385&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T16:03:10.000Z",
    "description": "We teach our kids to read, write and ride a bike. But we often skip one essential life skill: money management.Learn how to start the money conversati",
    "body": "We teach our kids to read, write and ride a bike. But we often skip one essential life skill: money management.Learn how to start the money conversation with your kids in our latest course, How To Raise Financially Smart Kids. The course provides step-by-step guidance for instilling healthy financial habits early, teaching kids to save and spend wisely, and talking with them about big purchases like buying a car or house.Whether you're hoping to teach the basics of money, prevent raising spoiled kids or instill entrepreneurial values, this course will help you give your kids the financial foundation they deserve. We'll share actionable tips for establishing a healthy money mindset, strategies to enforce healthy regular saving and child-friendly investment basics.This course is designed for parents of kids aged zero to 18 who want their children to grow up confident, independent, and ready for the real world. Led by three seasoned experts, it'll guide you in opening your child's first bank account and teaching them skills like zero-based budgeting.Our experts' practical strategies will help your children build financial habits that stick for life, from toddlers learning the value of a dollar to teens earning their first paycheck.What you'll get: 85-plus minutes of instructional video content, broken into digestible lessons A workbook with additional exercises and examples Instant access to watch and read at your own pace This course can help you: Learn psychological techniques to help your children build better financial habits and develop healthy relationships with money Discover practical exercises you can implement at home to lay a strong foundation for financial literacyBuild long-term savings and prepare your child for major financial milestones like buying their first car, paying for college and beyond Meet the experts:Jonathan Sanchez is a personal finance author and co-founder of Parent Portfolio, a financial coaching business that aims to help families escape from debt and build generational wealth. He and his wife offer money tips, live workshops and share their personal stories through their blog and YouTube channel to inspire parents to create financial freedom for the next generation.Brad Klontz, Psy.D is a financial psychologist, professor and certified financial planner who has studied the psychology of money for more than 15 years. He helps clients understand and overcome the subconscious beliefs and patterns that affect their financial behaviors and decisions. Klontz is a member of the CNBC Digital Financial Advisor Council, and was also featured as an expert in Smarter by CNBC Make It's \"Master Your Money: Practical Strategies to Grow Your Wealth\" course.Rianka Dorsainvil, CFP, is the founder and senior wealth advisor of YGC Wealth, a wealth management firm. She has been named a top financial advisor by Investopedia and a Black financial influencer to follow by NerdWallet, and serves on CNBC's Digital Financial Advisor Council. As a mother of two, she brings both professional expertise and personal perspective to helping families transform financial wellbeing into a cornerstone of lasting achievement.Sign up today for How To Raise Financially Smart Kids and use the coupon code EARLYBIRD for an introductory discount of 30% off the regular course price of $127 (plus tax). Offer valid from 12:00 a.m. Eastern Time (\"ET\") on Dec. 8, 2025, through 11:59 p.m. ET on Dec. 22, 2025. Terms apply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The ultimate guide to teaching your children the money skills they’ll need for life",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108237419-1764955324309-GettyImages-2151820656.jpg?v=1764971385&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T16:03:10.000Z",
      "dateModified": "2025-12-08T16:03:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NextEra to build 15 gigawatts of power for data centers by 2035",
    "url": "https://www.cnbc.com/2025/12/08/nextera-to-build-15-gigawatts-power-data-centers-google.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108113700-17416439742025-03-10t182017z_2067722756_rc2eada1y2mg_rtrmadp_0_ceraweek-energy-nextera.jpeg?v=1741644042&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T15:23:41.000Z",
    "description": "NextEra Energy Chairman, President and CEO John Ketchum participates in a panel during CERAWeek in Houston, Texas, U.S., March 10, 2025. Kaylee Greenl",
    "body": "NextEra Energy Chairman, President and CEO John Ketchum participates in a panel during CERAWeek in Houston, Texas, U.S., March 10, 2025. Kaylee Greenlee | ReutersNextEra Energy plans to build 15 gigawatts of new power generation for data center hubs by 2035, CEO John Ketchum told investors on Monday. NextEra is the largest renewable energy developer in the U.S. through NextEra Energy Resources, and also owns Florida Power & Light. The utility also operates a fleet of nuclear- and natural gas-powered plants. NextEra also announced a partnership with Alphabet's Google unit on Monday to develop three gigawatt scale data center campuses in the U.S. with plans to expand to additional locations. A gigawatt is roughly equivalent to more than 800,000 homes based on average household electricity consumption in 2024, according to the Energy Information Administration. Ketchum said the 15 gigawatts of power for data center hubs is a \"fairly conservative\" target. \"Quite frankly, based on what we're seeing today, we'll be disappointed if we don't do more,\" Ketchum said at NextEra's investor conference. There is potential upside to build 30 gigawatts of new generation by 2035, he said. The data center hubs will use all forms of energy, Ketchum said. NextEra announced a deal with Google in October to restart the Duane Arnold nuclear plant in Iowa through a power purchase agreement. The data center hubs will help NextEra meet its target of building four to eight gigawatts of new gas generation by 2032 and considerably more by 2035, Ketchum said. NextEra is developing a pipeline of 20 gigawats of gas generation. Ketchum acknowledged that the huge power demand from AI data centers is raising affordability concerns. He said the solution is for the big tech companies to bring their own power generation with them when they commit to build a data center. \"Hyperscalers can solve that problem by bringing and paying for their own power generation and infrastructure,\" the CEO said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NextEra to build 15 gigawatts of power for data centers by 2035",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108113700-17416439742025-03-10t182017z_2067722756_rc2eada1y2mg_rtrmadp_0_ceraweek-energy-nextera.jpeg?v=1741644042&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T15:23:41.000Z",
      "dateModified": "2025-12-08T15:23:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Supreme Court to hear case on Trump birthright citizenship order",
    "url": "https://www.cnbc.com/2025/12/05/trump-birthright-citizenship-supreme-court.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108146014-1747314907763-gettyimages-2214578465-AFP_46U47VL.jpeg?v=1759526256&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-05T20:28:26.000Z",
    "description": "People hold a sign as they participate in a protest outside the U.S. Supreme Court over President Donald Trump's move to end birthright citizenship as",
    "body": "People hold a sign as they participate in a protest outside the U.S. Supreme Court over President Donald Trump's move to end birthright citizenship as the court hears arguments over the order in Washington, May 15, 2025.Drew Angerer | Afp | Getty ImagesThe Supreme Court on Friday said it will hear arguments in a case that will determine if President Donald Trump can undo automatic citizenship for people born in the United States.Trump, on his first day back in the White House on Jan. 20, issued an executive order that said babies born in the U.S. more than 30 days after that order were not entitled to be issued citizenship documents if their parents were temporary visitors or illegal immigrants.Before Trump's order, there was little dispute that the U.S. Constitution's 14th Amendment, with rare exceptions, meant that children born in the country were automatically U.S. citizens, regardless of their parents' status.The Citizenship Clause in that amendment says, \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States.\" The Supreme Court, which is expected to rule next year, will determine if Trump's executive order complies with that amendment.The order told federal agencies to refuse to recognize the citizenship of children born in the U.S. if their mother \"was unlawfully present in the United States and the person's father was not a United States citizen or lawful permanent resident at the time of said person's birth,\" or when the baby's \"mother's presence in the United States was lawful but temporary, and the person's father was not a United States citizen or lawful permanent resident at the time.\"Several federal district court judges have found that Trump's order violated the Constitution, and two federal circuit courts of appeals upheld injunctions blocking the order from taking effect.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Supreme Court to hear case on Trump birthright citizenship order",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108146014-1747314907763-gettyimages-2214578465-AFP_46U47VL.jpeg?v=1759526256&w=1920&h=1080"
      ],
      "datePublished": "2025-12-05T20:28:26.000Z",
      "dateModified": "2025-12-05T20:28:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The operator of India's largest airline sees shares tumble after thousands of cancelations",
    "url": "https://www.cnbc.com/2025/12/08/indigo-operator-interglobe-aviation-shares-fall-after-cancelations.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108237369-1764951861409-gettyimages-2249259905-20251204_dli-sv-mn_indigot1-012.jpeg?v=1764951954&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T11:46:12.000Z",
    "description": "Passengers seen in heavy rush and chaos at the IndiGo counter at Indira Gandhi International Airport Terminal 1 after a technical glitch at IndiGo cau",
    "body": "Passengers seen in heavy rush and chaos at the IndiGo counter at Indira Gandhi International Airport Terminal 1 after a technical glitch at IndiGo caused delays and cancellations of multiple flights on Dec. 4, 2025 in New Delhi, India. Hindustan Times | Hindustan Times | Getty ImagesShares of Interglobe Aviation, operator of India's largest airline Indigo, fell more than 8% Monday as the carrier grapples with multiple flight cancellations.Indigo, which operates more than 2,300 flights daily, could only fly 706 flights on Friday following a change in rules about pilots' rest time for pilots, leading to massive disruptions.On Sunday, the company said in a release that it operated 1,650 flights and it expects \"stabilization of the network\" by Wednesday. India's civil aviation minister Ram Mohan Naidu said on Monday that the government has ordered an investigation into the disruptions of Indigo's flight services.\"We will take strict action,\" the minister said, warning the airline of consequences for \"non-compliance.\"Passenger woesChirag Shah, an EY consultant who was travelling from Abu Dhabi to Mumbai with his family, faced an 11-hour delay.He said travellers, especially those with a single-entry visa, were left stranded.That 11-hour delay exposed \"a worrying lack of passenger support,\" Shah told CNBC, adding that a few passengers were re-seated on a different Indigo flight \"after hours of follow-ups with the airport authorities.\"Indigo has not said whether it has issued all refunds for cancelled and severely delayed flights, after a government directive gave it until Sunday, 8 PM India time to do so. Indigo had processed 6.10 billion rupees (USD 67.6 million) as of 5 pm that day.Shah said that the only conciliatory offer he had had was a McDonalds' free meal coupon.Indigo Airlines and the Civil Aviation Ministry had not responded to requests for comment from CNBC when this article went live.The rule changeOn Thursday, the airline told the ministry that cancellations were due to \"challenges in crew planning and implementation of the revised Flight Duty Time Limitations (FDTL) norms.\"Under the rules, announced in January 2024 and in effect since Nov. 1, pilots are expected to fly fewer late-night flights and rest time for crew has been increased from 36 hours to 48 hours.On Friday, after disruptions due to flight cancellations by Indigo peaked, the government temporarily suspended its implementation of Flight Duty Time Limitations rules.Indigo's CEO, Pieter Elbers, was ordered by India's aviation watchdog to explain the disruption and has been granted an extension for sending his responses, according to local media reports.There were 1.3 million scheduled flights in India in 2024, of which 1.1 million were domestic flights, per the International Air Transport Association.Indigo dominates Indian air transport in terms of scheduled seat capacity with a market share of around 53.4%, up from 23% in 2016.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The operator of India's largest airline sees shares tumble after thousands of cancelations",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108237369-1764951861409-gettyimages-2249259905-20251204_dli-sv-mn_indigot1-012.jpeg?v=1764951954&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T11:46:12.000Z",
      "dateModified": "2025-12-08T11:46:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "McDonald's will assess if franchisees are providing value under new standards",
    "url": "https://www.cnbc.com/2025/12/08/mcdonalds-value-franchising-standards.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108237516-1764962468458-gettyimages-2193051107-boza-mcdonald250112_nps5s.jpeg?v=1764962497&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T15:00:01.000Z",
    "description": "In Lisbon, Portugal, on January 12, 2025, people sit by a McDonald's storefront. McDonald's rolls out new value deals, like the McValue Menu, to comba",
    "body": "In Lisbon, Portugal, on January 12, 2025, people sit by a McDonald's storefront. McDonald's rolls out new value deals, like the McValue Menu, to combat economic challenges and attract budget-conscious customers, as global sales face pressure amid shifting consumer trends. Luis Boza | Nurphoto | Getty ImagesMcDonald's will soon assess its franchisees on how their prices deliver value as the company updates its franchising standards as part of a larger bid to win over cash-strapped diners.\"Effective January 1, 2026, we are enhancing our global franchising standards across all Segments to reinforce accountability for value leadership,\" Andrew Gregory, McDonald's senior vice president of global franchising, development and delivery, wrote in a memo issued Monday and obtained by CNBC. \"With enhanced standards, we aim to provide greater clarity to the System to ensure every restaurant delivers consistent, reliable value across the full customer experience.\"Franchising standards are the policies that define how McDonald's operators should run their restaurants. Continued noncompliance with those standards could result in penalties, like not being permitted to open another restaurant, or even the termination of the franchise. Franchisees run about 95% of McDonald's restaurants worldwide and set their restaurants' prices, with input from third-party pricing advisors. Under the new standard, the company will \"holistically assess\" pricing decisions for how well they offer value, Gregory wrote in the memo.\"This approach enables franchisees to bring local insight to how value is delivered in their restaurants,\" he said.The change comes after McDonald's U.S. President Joe Erlinger told owners last month that they needed to keep their foot on the gas and stay the course on promoting the chain's value offerings.Across the restaurant industry, eateries have been leaning into value, betting that deals will attract cash-strapped customers. But discounts that are too steep can cut into profits, and operators have to strike a delicate balance to preserve both traffic and long-term profitability.For more than a year, McDonald's has reported that low-income consumers have been spending less money and visiting less frequently. To bring diners back to its restaurants, it has rolled out value menus in the U.S. and other key markets like France and Germany. The efforts have so far paid off, as the company has reversed same-store sales declines and attracted more high-income diners who are trading down to fast food.Still, McDonald's CEO Chris Kempczinski said he expects that the pressure on the consumer isn't going away anytime soon.\"We continue to remain cautious about the health of the consumer in the U.S. and our top international markets and believe the pressures will continue well into 2026,\" Kempczinski said on the company's earnings conference call last month. The company's change in standards is likely to rile some McDonald's U.S. franchisees who already have a contentious relationship with their franchisor. An independent advocacy group of McDonald's operators has pushed for the company to contribute financially to make discounts more sustainable for franchisees in the long run. Several years ago, a new grading system for franchisees drew the ire of some operators, who said at the time that it would alienate workers in a tight labor environment.In addition to updating the franchising standards, McDonald's has also invested in tools to help franchisees determine how to address value in their local markets.\"While Owner/Operators continue to set their own prices and make decisions that reflect local market nuances, we've now strengthened individual accountability for value leadership – equipping you with approved pricing consultants, tools, and other levels that support informed choices and elevate the overall guest experience across all order points,\" McDonald's USA Chief Restaurant Officer Mason Smoot wrote in a separate memo sent to U.S. franchisees Monday and obtained by CNBC.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "McDonald's will assess if franchisees are providing value under new standards",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108237516-1764962468458-gettyimages-2193051107-boza-mcdonald250112_nps5s.jpeg?v=1764962497&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T15:00:01.000Z",
      "dateModified": "2025-12-08T15:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Ellison's hunt for WBD made David Zaslav richer — and it may not be over",
    "url": "https://www.cnbc.com/2025/12/05/paramount-david-ellison-wbd-bidding-war-hostile-bid.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108206700-1759347471990-gettyimages-2224157338-_d1_9231_87oc9cej.jpeg?v=1765079346&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-07T03:49:11.000Z",
    "description": "Paramount Skydance CEO David Ellison speaks during the Bloomberg Screentime conference in Los Angeles on October 9, 2025.Patrick T. Fallon | Afp | Get",
    "body": "Paramount Skydance CEO David Ellison speaks during the Bloomberg Screentime conference in Los Angeles on October 9, 2025.Patrick T. Fallon | Afp | Getty ImagesThis isn't exactly what David Ellison had planned in September. Just a few months ago, the Paramount Skydance CEO sent a letter to the Warner Bros. Discovery board of directors arguing a combination of the two media and entertainment companies made sense. That letter was the first of several that offered increasingly higher prices to acquire the company along with arguments of why the assets were better together.Paramount's interest spurred a formal sale process — bringing Comcast and Netflix into the mix — which ultimately doubled the value of Warner Bros. Discovery shares and culminated, at least for the moment, in Paramount losing out in the bidding war it started.  On Friday, Netflix announced a deal to acquire HBO Max and the famed Warner Bros. film studio for $27.75 per share, or an equity value of $72 billion. WBD will move forward with a plan to separate out its pay-TV networks, such as CNN and TNT Sports, before the deal closes. Instead of supercharging Paramount, just months after gaining control of the company through a merger with Skydance, Ellison effectively handed a prized jewel of the media and entertainment industry to its most dominant player, strengthening Netflix's reach and stripping Paramount and Comcast's NBCUniversal of an obvious merger target. \"It wasn't for sale before, and they certainly hadn't cleaned up the assets or separated the assets in the way they have right now,\" said Netflix co-CEO Ted Sarandos in a conference call Friday morning after announcing the deal. \"I think that kind of goes to the 'why now.'\"Ellison jump-started a process that has made a lot of money for Warner Bros. Discovery CEO David Zaslav, WBD's executive team and its shareholders. Zaslav's shareZaslav currently owns more than 4.2 million shares of Warner Bros. Discovery, with another 6.2 million shares that would be delivered to him in the future via previously granted stock awards, according to Equilar. Zaslav also has a grant of almost 20.9 million options with an exercise price of $10.16, Equilar found.Based on the Netflix-WBD transaction price of $27.75 per share, all of that adds up to more than $554 million for the WBD CEO. Factoring in another 4 million shares that Zaslav is set to receive in January, according to a person close to the situation who declined to be named speaking about the executive's holdings, the true total is closer to $660 million.For shareholders, the sale process has brought a similar windfall. Warner Bros. Discovery stock closed at $12.54 on Sept. 10, the day before The Wall Street Journal reported Paramount was preparing a bid for the company. On Friday morning, Warner Bros. Discovery shares were up almost 3% to more than $25 apiece. That's more than double Warner Bros. Discovery's unaffected sale process price and a return to 2022 levels when WarnerMedia and Discovery first merged. That's vindication for Zaslav, who has spent nearly four years coming under fire from Hollywood and investors for failing to deliver for shareholders. With Friday's announcement, he's effectively pulled victory from the jaws of defeat. And still, Paramount is likely not done with its pursuit of buying all of Warner Bros. Discovery.Paramount's hostile playEllison has wasted no time at the helm of Paramount Skydance, transforming the company through deals and acquisitions.Since the merger closed in August, Paramount has brought on C-suite executives and high-profile Hollywood talent such as the Duffer Brothers. It secured the rights to develop a live-action feature film based on Activision's Call of Duty video game franchise and struck a $7.7 billion deal for UFC rights. Ellison's hunt for Warner Bros. Discovery was his biggest endeavor since taking control of the company.Paramount's lawyers sent a letter to Warner Bros. Discovery this week, first reported by CNBC, claiming the sale process had been rigged in Netflix's direction. Paramount has accused Warner Bros. Discovery of failing to properly consider its offer of $30, all-cash, and instead selling to Netflix as a predetermined outcome. Netflix made an initial bid for WBD's studio and streaming assets of $27 a share, according to a person familiar with the matter. That trumped Paramount's offer at the time and turned the trajectory of the sales talks in Netflix's direction, said the person, who asked not to be named because the discussions were private.Paramount was the only bidder interested in acquiring all of WBD's assets — the film studio, streaming service and TV networks. It has maintained that its offer is superior. Paramount's executives and advisors valued the Discovery Global networks portfolio at close to $2 a share, based on its predicted trading multiple and estimated leverage ratio, according to people familiar with the matter, who asked not to be named because the discussions were private. Discovery Global would include the CNN, TNT Sports and Discovery channels.Warner Bros. Discovery believes Discovery Global could have a value of $3 per share or more if it trades well in the public markets, according to other people with direct knowledge of the matter.Paramount has also argued there are tax efficiencies for shareholders in acquiring the whole company rather than buying only a portion of it, and that Netflix's bid comes with steeper regulatory risk. The Trump administration's view of the proposed combination is one of \"heavy skepticism,\" CNBC reported Friday.Paramount offered a break-up fee of $5 billion if the proposed deal didn't get regulatory approval, according to the people familiar.  Netflix's bid included a $5.8 billion break-up fee in case the deal doesn't get regulatory approval, according to a Securities and Exchange Commission filing Friday. Paramount is now weighing its options about whether to go straight to shareholders with one more improved bid — perhaps even higher than the $30-per-share, all-cash offer it submitted to WBD this week. If it does, Netflix would have a chance to match that bid. The end result would mean even more money for WBD shareholders — and more money for Zaslav.— CNBC's Nick Wells contributed to this report. Disclosure: Comcast is the parent company of NBCUniversal, which owns CNBC. Versant would become the new parent company of CNBC upon Comcast’s planned spinoff of Versant.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Ellison's hunt for WBD made David Zaslav richer — and it may not be over",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108206700-1759347471990-gettyimages-2224157338-_d1_9231_87oc9cej.jpeg?v=1765079346&w=1920&h=1080"
      ],
      "datePublished": "2025-12-07T03:49:11.000Z",
      "dateModified": "2025-12-07T03:49:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration waives $11 million fine for Southwest Airlines' 2022 holiday meltdown",
    "url": "https://www.cnbc.com/2025/12/06/trump-administration-waives-11-million-southwest-fine.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106994117-1640697119885-gettyimages-1237439383-US_FLIGHT_CANCELLATIONS.jpeg?v=1683464341&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-06T21:10:59.000Z",
    "description": "A Southwest plane and baggage carts at Hartsfield-Jackson Atlanta International Airport (ATL) in Atlanta, Georgia, U.S., on Monday, Dec. 27, 2021.Elij",
    "body": "A Southwest plane and baggage carts at Hartsfield-Jackson Atlanta International Airport (ATL) in Atlanta, Georgia, U.S., on Monday, Dec. 27, 2021.Elijah Nouvelage | Bloomberg | Getty ImagesThe Trump administration said it will forgive the last $11 million of a civil fine against Southwest Airlines that stems from the carrier's 2022 holiday meltdown that stranded some 2 million passengers after nearly 17,000 flights were canceled.The Transportation Department under the Biden administration in late 2023 fined the Dallas-based airline $140 million, though the agency then credited the airline with all but $35 million of that amount because of its compensation to customers.In an order filed Friday, the Transportation Department cited Southwest's more than $1 billion investments in its technology and operation since the holiday meltdown as reason for the additional credit. Southwest was due to make the last payment next month.\"Southwest Airlines is grateful to [Transportation] Secretary [Sean] Duffy and the DOT Team for recognizing Southwest's significant investments in modernizing our operations,\" Southwest said Saturday. \"During the last two years, Southwest successfully completed an operational turnaround that directly benefits our Customers with industry leading on-time performance and percentage of completed flights without cancellations.\"Read more CNBC airline newsDelta says government shutdown cost it $200 million, but forecasts strong travel demand into 2026The government shutdown is over. The air traffic controller shortage is notBoeing stems cash burn for first time since 2023 but takes $4.9 billion charge on 777X delaysAmerican Airlines is late to the luxury travel boom. Can it catch up?",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration waives $11 million fine for Southwest Airlines' 2022 holiday meltdown",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106994117-1640697119885-gettyimages-1237439383-US_FLIGHT_CANCELLATIONS.jpeg?v=1683464341&w=1920&h=1080"
      ],
      "datePublished": "2025-12-06T21:10:59.000Z",
      "dateModified": "2025-12-06T21:10:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berkshire Hathaway's Todd Combs, investment lieutenant to Buffett and Geico CEO, is leaving for JPMorgan",
    "url": "https://www.cnbc.com/2025/12/08/berkshire-hathaways-todd-combs-investment-lieutenant-to-buffett-and-geico-ceo-is-leaving-for-jpmorgan.html",
    "image": "https://image.cnbcfm.com/api/v1/image/106310272-1765196105432-106310272-1577120686166gettyimages-1155309811.jpg?v=1765196122&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T13:11:09.000Z",
    "description": "Todd Combs, portfolio manager and investment officer of Berkshire Hathaway Inc., arrives for the morning session of the Allen & Co. Media and Technolo",
    "body": "Todd Combs, portfolio manager and investment officer of Berkshire Hathaway Inc., arrives for the morning session of the Allen & Co. Media and Technology Conference in Sun Valley, Idaho, U.S., on Friday, July 12, 2019.Patrick T. Fallon / Bloomberg / Getty ImagesWarren Buffett's Berkshire Hathaway announced a number of structural changes before the legendary CEO steps aside at the end of this year, among them the departure of Todd Combs, investment manager and Geico CEO.Combs, 54, will be joining JPMorgan Chase as head of the bank's new Security and Resiliency Initiative, to find direct equity investments in the defense, aerospace, health care and energy industries.Combs \"has resigned to accept an interesting and important job at JPMorgan,\" said Buffett, 95, in a press release from Berkshire. \"Todd made many great hires at Geico and broadened its horizons. JPMorgan, as usually is the case, has made a good decision.\"Combs joined Berkshire in 2010 from his hedge fund Castle Point and was brought in, along with Ted Weschler, to help manage Berkshire's portfolio of investments. Buffett is handing over the CEO reins to Greg Abel in 2026 and Combs' departure leaves some questions as to how the sizable equity holdings of Berkshire, which include Apple, Bank of America and Coca-Cola, will continue to be managed when he steps down. Among some of the other notable changes at Berkshire are the retirement effective in June 2027 of Chief Financial Officer Marc Hamburg, who served under Buffett for 40 years. Charles Chang, current CFO of Berkshire Hathaway Energy will succeed him. Nancy Pierce, chief operating officer of Geico, will replace Combs as CEO of Geico. The conglomerate also said the CEO of its NetJets unit, Adam Johnson, will serve in a new role as president of Berkshire's consumer products, service and retailing businesses. Abel will directly oversee the remaining noninsurance businesses, Berkshire said.$1.5 trillion JPMorgan initiativeCombs, who was a member of JPMorgan's board of directors, will also become a special advisor to CEO Jamie Dimon. Combs is giving up his board seat as he moves into the new role.\"Todd Combs is one of the greatest investors and leaders I've known, having successfully managed investments alongside the most respected and successful long-term investor of our time, Warren Buffett,\" said Dimon in a release. \"Having served nine years on our Board, he truly understands all aspects of our company, and he supports the role we play helping make the world better and safer for all its citizens.\"Combs will have $10 billion to deploy to start with for JPMorgan's new initiative, which the bank said will ultimately commit $1.5 trillion to spur economic growth and \"to make the world more secure.\"The Security and Resiliency Initiative will have an outside council to guide its strategy which includes, Amazon's Jeff Bezos, Dell Chairman Michael Dell, former Secretary of Defense Robert Gates and former Secretary of State Condoleezza Rice.Despite his advanced age, Buffett surprised shareholders at the conglomerate's annual meeting in May when he said he would be stepping aside for Abel, who is 63 and current vice chairman of noninsurance operations. The stock has underperformed this year in part because of angst over what Berkshire will look like after Buffett, who took over the textiles manufacturer in 1965 and turned it into an investment holding company that went on to post an unprecedented long-term track record. Berkshire shares are up 11% this year, below the 17% return of the S&P 500. Buffett, who will remain chairman, noted in a Thanksgiving message that he still feels good, however he is moving slowly and reading with \"increasing difficulty.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berkshire Hathaway's Todd Combs, investment lieutenant to Buffett and Geico CEO, is leaving for JPMorgan",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/106310272-1765196105432-106310272-1577120686166gettyimages-1155309811.jpg?v=1765196122&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T13:11:09.000Z",
      "dateModified": "2025-12-08T13:11:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says Zelenskyy 'hasn't read U.S. peace proposal' as tensions mount",
    "url": "https://www.cnbc.com/2025/12/08/trump-says-zelenskyy-hasnt-read-us-peace-proposal-talks-move-to-london.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108187624-1755543557261-gettyimages-2230147430-AFP_69V36W9.jpeg?v=1755543688&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T11:11:21.000Z",
    "description": "(L/R) Ukrainian President Volodymyr Zelenskyy and US President Donald Trump stand for a family photo with other European leaders in the Cross Hall of ",
    "body": "(L/R) Ukrainian President Volodymyr Zelenskyy and US President Donald Trump stand for a family photo with other European leaders in the Cross Hall of the White House in Washington, DC, on August 18, 2025. Andrew Caballero-Reynolds | AFP | Getty ImagesTensions are mounting once again between U.S. President Donald Trump and President Volodymyr Zelenskyy after the White House leader accused Ukraine's head of state of not even reading the U.S.' peace proposals yet.\"I'm a little bit disappointed that President Zelenskyy hasn't yet read the proposal, that was as of a few hours ago,\" Trump told reporters on Sunday night.  \"His people love it, but he hasn't [read it],\" Trump added.\"Russia, I guess, would rather have the whole country when you think of it, but Russia is, I believe, fine with it, but I'm not sure that Zelenskyy is fine with it,\" Trump said.It's uncertain which version of the U.S.-backed peace plan for Ukraine Trump was referring to but the president's comments came a day after talks between U.S. and Ukrainian officials ended in Miami without an apparent agreement over the latest version of a draft peace plan.There have been several versions of the purported peace plan as Russia and Ukraine have haggled — via their American intermediaries — over key details within the deal, particularly when it comes to demands for territorial concessions by Russia and security guarantees for Ukraine. Trump's outgoing Ukraine envoy Keith Kellogg remarked Sunday that a deal to end the war was \"really close\" and that it depended on resolving two main outstanding issues: the future of Ukraine's Donbas eastern region, which is broadly occupied by Russian forces, and the Russian-occupied Zaporizhzhia nuclear power plant in southern Ukraine.Ukraine has given a more cautious appraisal of the talks' progress with Zelenskyy saying in his nightly address Sunday that the Miami talks — held between his new chief negotiator Rustem Umerov and Ukraine's military chief of general staff, General Andriy Hnatov, and Trump's special envoy Steve Witkoff and son-in-law Jared Kushner — were \"constructive, though not easy.\" Zelenskyy said he would have a detailed debrief with his negotiating team in person rather than over the phone, noting, somewhat pointedly, that \"some matters can only be discussed in person.\"Talks move to LondonZelenskyy is travelling to London for talks on Monday as Kyiv and its European allies scramble to ensure that Ukraine's territorial integrity and future security (as well as Europe's) are not compromised in the face of growing U.S. pressure to agree to peace proposals initially seen as heavily favorable to Russia.Zelenskyy is due to meet U.K. Prime Minister Keir Starmer, French President Emmanuel Macron and German Chancellor Friedrich Merz for talks \"which will focus on the ongoing peace negotiations and next steps,\" Downing Street said Sunday. Zelenskyy will also travel to Brussels and Rome for further talks this week.Britain's Prime Minister Keir Starmer talks to French President Emmanuel Macron during a meeting with U.S. President Donald Trump, Ukrainian President Volodymyr Zelenskyy and other European leaders amid negotiations to end the Russian war in Ukraine, at the White House in Washington, D.C., U.S., August 18, 2025. Alexander Drago | ReutersUkraine's European allies are anxious to be seen and heard as peace proposals are discussed without their involvement, particularly given the security ramifications any deal will have for the wider continent.The U.K. and France have been leading proponents of a \"Coalition of the Willing,\" a group of countries that could be part of a \"reassurance force\" in a post-war Ukraine that helps to guarantee its security. Russia vehemently opposes the idea of foreign troops being deployed in Ukraine however, with Russian President Vladimir Putin saying they would be \"legitimate targets.\"European leaders will be feeling more nervous about the U.S.' potential for accommodating Russian demands after the release of Trump's latest national security strategy last Friday, which said Europe risked \"civilisational erasure\" and that it was \"far from obvious\" whether European countries can \"remain reliable allies.\" The document also stated that Washington should reestablish strategic stability with Russia.The Kremlin on Sunday praised the new strategy, saying it largely accorded with Russia's \"vision.\"While both the U.S. and Russia share a mutual desire for a future rapprochement, some distance remains when it comes to an immediate peace agreement over Ukraine. Talks between Witkoff, Kushner and Russian officials held in Moscow last week also concluded without a breakthrough, with Russian presidential aide Yuri Ushakov telling reporters that the discussions were \"very useful, constructive, and highly informative\" but that there was more work to be done.Russian President Vladimir Putin, presidential envoy Kirill Dmitriev and foreign policy aide Yuri Ushakov attend a meeting with U.S. President Donald Trump's special envoy Steve Witkoff and son-in-law Jared Kushner at the Kremlin in Moscow, Russia, Dec. 2, 2025.Alexander Kazakov | Via ReutersThe Kremlin also commented on Trump's criticism of Zelenskyy, with Putin's Press Secretary Dmitry Peskov telling reporters Monday:\"We don't know exactly what disagreements there are. What matters to us is this: A thorough amount of work was done in Moscow during Putin's meeting with Witkoff and Kushner and afterward, Witkoff and Kushner continued working with the delegation of Ukrainian negotiators led by Umerov on the basis of the results achieved in Moscow,\" he said, in comments translated by NBC News.\"Now it's important for us to understand what the outcome of that work is. It's clear that both sides now understand that such work needs to be done in silence. This kind of work cannot be conducted entirely in public. It's counterproductive. Most importantly, it prevents results from being achieved. So we expect to receive this information. Once we do, things will become clear,\" he stated.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says Zelenskyy 'hasn't read U.S. peace proposal' as tensions mount",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108187624-1755543557261-gettyimages-2230147430-AFP_69V36W9.jpeg?v=1755543688&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T11:11:21.000Z",
      "dateModified": "2025-12-08T11:11:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bessent says U.S. will finish the year with 3% GDP growth, sees 'very strong' holiday season",
    "url": "https://www.cnbc.com/2025/12/07/bessent-gdp-growth.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108235921-1764773195448-gettyimages-2249744365-a9i03957_kydygn2a.jpeg?v=1764773221&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-07T20:22:42.000Z",
    "description": "U.S. Treasury Secretary Scott Bessent speaks onstage during The New York Times DealBook Summit 2025 at Jazz at Lincoln Center on December 03, 2025 in ",
    "body": "U.S. Treasury Secretary Scott Bessent speaks onstage during The New York Times DealBook Summit 2025 at Jazz at Lincoln Center on December 03, 2025 in New York City.  David Dee Delgado | Getty Images Entertainment | Getty ImagesThe latest report on inflation, delayed by the government shutdown, showed consumer prices rising 3% year-over-year in September, including a 3.1% uptick in cost for food at home. As rising prices continue to affect consumers, President Donald Trump has pushed back on the idea that Americans are struggling financially. \"The word 'affordability' is a con job by the Democrats,\" Trump said during a cabinet meeting on Tuesday. \"The word 'affordability' is a Democrat scam.\"Lately, voters have expressed frustration with Trump's handling of the economy. Around two-thirds of registered voters say the Trump administration has fallen short on the economy and the cost of living, according to a recent poll from NBC News.When asked about Trump's comments on Sunday, Bessent said that the administration was dealing with inflation issues leftover from the Biden administration and pointed to media coverage as a source of Americans' view of the economy.  \"The American people don't know how good they have it,\" he said. \"Now, Democrats created scarcity, whether it was in energy or over-regulation, that we are now seeing this affordability problem, and I think next year we're going to move on to prosperity.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bessent says U.S. will finish the year with 3% GDP growth, sees 'very strong' holiday season",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108235921-1764773195448-gettyimages-2249744365-a9i03957_kydygn2a.jpeg?v=1764773221&w=1920&h=1080"
      ],
      "datePublished": "2025-12-07T20:22:42.000Z",
      "dateModified": "2025-12-07T20:22:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "From the California gold rush to Sydney Sweeney: How denim became the most enduring garment in American fashion",
    "url": "https://www.cnbc.com/2025/12/06/the-history-of-denim-and-how-jeans-were-created.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108237244-1764940371507-gettyimages-75453173-A045888006.jpeg?v=1764940412&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-06T13:00:01.000Z",
    "description": "Jodie Foster, Billie Perkins, and Robert De Niro perform a scene in Taxi Driver directed by Martin Scorsese in 1976 in New York, New York.  Michael Oc",
    "body": "Jodie Foster, Billie Perkins, and Robert De Niro perform a scene in Taxi Driver directed by Martin Scorsese in 1976 in New York, New York.  Michael Ochs Archives | Moviepix | Getty ImagesIn the dwindling days of the California gold rush, the wife of a local miner faced a problem. Her husband's denim work pants kept ripping, so her tailor, Jacob Davis, had the idea to add copper rivets to key points of strain, like the pocket corners and the base of the button fly, to keep them from tearing. Davis' \"riveted pants\" soon became a roaring success and, unbeknownst to him at the time, marked the official birth of the blue jean, a garment that would transform fashion and come to represent the United States around the globe. \"It really has democratized American fashion and it also is the greatest export that we have sent to the world, because people identify jeans specifically with American Western culture,\" said Shawn Grain Carter, a fashion professor at the Fashion Institute of Technology in New York. \"It doesn't matter your economic or social class. It doesn't matter what your views are in terms of the political spectrum. Everybody wears denim.\" Jacob DavisCourtesy: Levi Strauss & Co.These days, denim is a major sales driver for retailers big and small, as the global denim market reached $101 billion this year, up 28% from 2020, according to data from market research company Euromonitor International. Major apparel companies from American Eagle to Levi Strauss are in a race to corner that market, leaning on A-list celebrities like Sydney Sweeney and Beyonce to win over shoppers and drive sales in an unsteady economy.But if it weren't for Levi Strauss, founder of the eponymous blue jeans company, Davis' invention may not have gone far beyond the railroad town where it was created in the early 1870s. How Levi's created blue jeansSoon after Davis created his riveted pants, called \"waist overalls\" or \"overalls\" at the time, they began selling like \"hot cakes\" and he needed a business partner to secure a patent, said Tracey Panek, Levi's in-house historian. So he wrote to Strauss, a Bavarian-born immigrant who was running a successful wholesale business in San Francisco and had supplied Davis the denim he used to create his riveted pants. \"The secret of them Pents is the Rivits that I put in those Pockets and I found the demand so large that I cannot make them up fast enough,\" Davis wrote Strauss in a letter, according to PBS. Levi StraussCourtesy: Levi Strauss & Co.Strauss, an \"astute\" businessman, recognized the opportunity and agreed to partner with Davis, said Panek. \"This would have been the first time that Levi was actually\" manufacturing his own products, said Panek. \"He was no longer just importing and selling other people's goods. He was manufacturing himself and selling to retailers.\"On May 20, 1873, the two men secured a patent for the riveted pants and eventually opened a factory on Fremont Street, close to the modern-day Salesforce tower in San Francisco's financial district. They promised to offer workers the most durable jeans on the market and soon, business was booming. Dude ranch duds and the American worker Through Strauss' connections as a wholesaler, the company's riveted overalls soon spread across the U.S., becoming the garment of choice for working men everywhere: miners, cowboys, farmers – any role that required durable clothing. Jeans were exclusively reserved for work settings at the time, but as emerging denim manufacturers vied for a similar customer base, they looked to expand their assortment to drive sales. \"Slowly and steadily into the 20th century, you start to see some of these manufacturers making variations,\" said Sonya Abrego, a New York City-based fashion historian. \"There was this one design called spring bottom pants that was kind of a more form fitted, a more dressed up, a slightly flared, maybe what the factory foreman would be wearing, right? As opposed to just the guy on the shop floor.\"In 1934, Levi created the first ever line of jeans for women. Around that time, denim started to become more popular in settings outside of work, primarily for activities like dude ranch vacations, camping and horseback riding. \"So they were kind of taking on a cowboy's garment or a worker's garment but wearing it in a … resort setting,\" said Abrego. Courtesy: Levi Strauss & Co. Dude ranch vacations had become popular because there were finally highways connecting different parts of the country, and few were willing to venture to Europe during a war. Companies like Levi began releasing advertisements highlighting their denim as \"dude ranch duds\" and \"authentic western riding wear\" to capture shoppers looking for jeans to bring with them on vacation, according to archival advertisements from the time. These cultural moments helped to expand denim beyond workers, but jeans didn't become widespread casual attire until after World War II, when American fashion overall started to shift. The rise of the backyard BBQ By the time World War II ended, the mighty American consumer was beginning to emerge. For years, Americans had been forced to ration common goods like rubber, sugar and meat while simultaneously being encouraged to save their money by buying war bonds and socking away spare cash.When the country shifted from wartime to peacetime, Americans were ready to splurge and soon began spending big on new cars, appliances and clothes. \"With a little bit more money to spend, you start seeing a bigger push for leisure clothes and fun clothes and play clothes, clothes to wear to backyard barbecues,\" said Abrego. \"Clothes that we would consider today as just like casual style.\" Courtesy: Levi Strauss & Co.Slowly and surely, it became more and more acceptable for both men and women to wear jeans outside of work settings. Then, denim manufacturers made a push to allow jeans in schools. \"They wanted to sell to as many people as they possibly could,\" said Abrego. \"The idea that jeans are good for school means that they're good for every day.\"By the time the 1960s hit, denim manufacturers had expanded their products and were selling a wide variety of colors, fits and styles. It became a symbol of the hippie movement and a mainstay on Hollywood sets. Soon, denim was everywhere, and the 1970s brought the iconic bell bottom pants and the first iteration of the \"designer jean\" — denim pants being produced by labels and brands whose designs had nothing to do with work wear or western wear, like Calvin Klein and Gloria Vanderbilt. Since then, denim has remained a constant in global fashion. While silhouettes, washes and fits have changed over time, jeans never really go out of style, which is what makes them so enduring, said Abrego. \"This is a design from 1873 … do we see anything else from 1873 on the street? It's kind of wild if you think about it that way,\" said Abrego. \"We can talk about all the details, all the changes in manufacturing and all the different fits and finishes but it's a recognizable thing, it's still a pair of jeans. For me as a historian, that continuity is so compelling because I can't really name anything else that has stayed the same to this degree.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "From the California gold rush to Sydney Sweeney: How denim became the most enduring garment in American fashion",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108237244-1764940371507-gettyimages-75453173-A045888006.jpeg?v=1764940412&w=1920&h=1080"
      ],
      "datePublished": "2025-12-06T13:00:01.000Z",
      "dateModified": "2025-12-06T13:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge finalizes remedies in Google antitrust case",
    "url": "https://www.cnbc.com/2025/12/05/judge-finalize-remedies-in-google-antitrust-case.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108230973-17639991772025-11-24t154318z_1737158446_rc2lwq9j2uvq_rtrmadp_0_google-stocks.jpeg?v=1763999195&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-06T00:53:56.000Z",
    "description": "The logo for Google LLC is seen at the Google Store Chelsea in Manhattan, New York City, U.S., November 17, 2021. Andrew Kelly | ReutersA U.S. judge o",
    "body": "The logo for Google LLC is seen at the Google Store Chelsea in Manhattan, New York City, U.S., November 17, 2021. Andrew Kelly | ReutersA U.S. judge on Friday added new details to the remedies resulting from Google's antitrust case, finalizing the consequences the company faces after its defeat last year.In mid-2024, Google was found to hold an illegal monopoly in its core market of internet search, and in September of this year, U.S. District Judge Amit Mehta ruled against the most severe consequences that were proposed by the Department of Justice, including a forced sale of Google's Chrome browser.Google was, however, ordered to loosen its hold on search data.Mehta on Friday issued additional details for his ruling. \"The age-old saying 'the devil is in the details' may not have been devised with the drafting of an antitrust remedies judgment in mind, but it sure does fit,\" Mehta wrote in one of the Friday filings. Mehta wrote that Google can't enter into any deal like the one it's had with Apple \"unless the agreement terminates no more than one year after the date it is entered.\" Google pays billions of dollars per year to Apple to be the default search engine on the Safari browser on iPhones, Macs and iPads.The judge's ruling includes deals involving generative artificial intelligence products, and any \"application, software, service, feature, tool, functionality, or product\" that involve or use genAI or large language models.GenAI \"plays a significant role in these remedies,\" Mehta wrote.Mehta on Friday also included requirements on the makeup of a technical committee that will determine with whom Google must share its data. Committee \"members shall be experts in some combination of software engineering, information retrieval, artificial intelligence, economics, behavioral science, and data privacy and data security,\" the filing says.The judge went on to say that no committee member can have a conflict of interest, such as having worked for Google or any of its competitors in the six months prior to or one year after serving in the role.Mehta said the committee must \"have access to Google's source code and algorithms, subject to a confidentiality agreement,\" and reiterated the web index data it will require Google to share with certain competitors. Google has to share some of the raw search interaction data it uses to train its ranking and AI systems, but not the actual algorithms. In September, Mehta said those data sets represent a \"small fraction\" of Google's overall traffic, but argued the company's models are trained on data that contributed to Google's edge over competitors.In August 2024, Mehta ruled that Google violated Section 2 of the Sherman Act and held a monopoly in search and related advertising. The antitrust trial started in September 2023.Google did not immediately respond to a request for comment. The company has previously said it will appeal the judge's monopoly ruling.WATCH: Judge Issues final remedies in Google antitrust casewatch now",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge finalizes remedies in Google antitrust case",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108230973-17639991772025-11-24t154318z_1737158446_rc2lwq9j2uvq_rtrmadp_0_google-stocks.jpeg?v=1763999195&w=1920&h=1080"
      ],
      "datePublished": "2025-12-06T00:53:56.000Z",
      "dateModified": "2025-12-06T00:53:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Home sellers are giving up at 'unusually high rate,' says new Realtor report",
    "url": "https://www.cnbc.com/2025/12/08/home-sellers-delisting-high-rate-realtor.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108225446-1763044516213-gettyimages-2245906783-MORTGAGE_APPLICATION_FIGURES.jpeg?v=1765142012&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T16:06:04.000Z",
    "description": "watch nowLate fall tends to be the time when the most homes come off the market, as so-far unsuccessful sellers would rather not sit through the slowe",
    "body": "watch nowLate fall tends to be the time when the most homes come off the market, as so-far unsuccessful sellers would rather not sit through the slowest winter months. In October, however, delistings, which are reported with a one-month lag, were up 45.5% year to date and rose nearly 38% from October 2024, according to a new report from Realtor.com. The report calls it an \"unusually high rate,\" as this is now the highest delisting year since Realtor.com began tracking in 2022. Delistings started to rise in June and have remained elevated for five straight months. About 6% of active listings are coming off the market each month, which is typically only seen in the dead of winter. In addition, more potential buyers are heading to what Realtor.com calls \"refuge markets.\" These are areas where home prices are much more affordable and didn't see the run-up in prices during the first years of the pandemic. \"Rising delistings and the growth of refuge markets capture the push and pull defining today's housing market,\" said Danielle Hale, chief economist at Realtor.com, in a release. \"These dynamics reflect how higher rates and years of rapid price growth have rewritten the rules of engagement for both buyers and sellers.\"  Hale does forecast a gradual improvement next year, with potentially lower mortgage rates and more consistent supply creating an increasingly balanced market between buyer and seller.Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.Some of the cities that saw the most price growth over the past five years are now seeing the largest share of frustrated sellers. Miami, Denver and Houston saw the highest ratio of homes delisted compared with newly listed.The median list price in November nationally was 0.4% lower than November 2024, according to Realtor.com. It was still, however, 36% higher than November 2019, pre-pandemic. New listings were up just 1.7% from a year ago.Price gains are much stronger in refuge markets, like Grand Rapids, Michigan, where they're up 5.5% year over year and St. Louis where they're up 5%. Cleveland, Milwaukee and Pittsburgh round out the top-performing refuge markets, according to the report. Prices in these markets are still 20%-30% lower than the national median. Another troubling trend this fall -- canceled contracts. Roughly 15% of home purchase agreements were canceled in October, up from 14% the year before, according to Redfin. Cancellations are now well above pre-pandemic levels. Regionally, San Antonio saw the most canceled deals, with more than 1 in 5 (21%) pending home sales falling through in October. It was followed by Fort Lauderdale, Florida (20%), Fort Worth, Texas (19.7%), Las Vegas (19.2%) and Jacksonville, Florida (19.2%). The report cited high housing costs as well as economic uncertainty. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Home sellers are giving up at 'unusually high rate,' says new Realtor report",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108225446-1763044516213-gettyimages-2245906783-MORTGAGE_APPLICATION_FIGURES.jpeg?v=1765142012&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T16:06:04.000Z",
      "dateModified": "2025-12-08T16:06:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China's trade surplus tops $1 trillion despite Trump's attempt to contain it. Here's what that means",
    "url": "https://www.cnbc.com/2025/12/08/china-export-imports-trade-november-us-tariff-truce-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108237999-1765151887110-gettyimages-2249229993-cfoto-qingdaop251204_npZyJ.jpeg?v=1765151899&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T14:18:32.000Z",
    "description": "A cargo ship loaded with containers departs from Qingdao Port in Qingdao City, Shandong Province, China, on December 4, 2025. Costfoto | Nurphoto | Ge",
    "body": "A cargo ship loaded with containers departs from Qingdao Port in Qingdao City, Shandong Province, China, on December 4, 2025. Costfoto | Nurphoto | Getty Images  China's trade surplus roared above $1 trillion in November for the first time ever, despite the ongoing global trade war that has resulted in a steep drop in exports to the U.S.In the first 11 months this year, China's overall exports grew 5.4% compared to the same period in 2024 while imports fell 0.6%, taking its trade surplus to $1.076 trillion this year as of November, up 21.6% year on year. The move come even as China's U.S.-bound goods fell for an eighth straight month despite a recent trade deal between the two economies, even as overall exports surpassed market expectations in November as manufacturers loaded up shipments to other markets.   \"China continues to rely less on selling stuff to the US,\" wrote Peter Boockvar, chief investment officer at One Point BFG Wealth Partners. \"China has a massive pool of domestic savings and China will again try to encourage consumers to unleash more of it to lessen their dependency on manufacturing and exports.\"Outbound shipments surged 5.9% last month in U.S. dollar terms from a year earlier, China's customs data showed Monday, topping economists' forecast for a 3.8% growth in a Reuters poll. That growth marked a rebound from an unexpected 1.1% drop in October — the first contraction since March 2024.     Imports rose 1.9% last month, missing expectations for a 3% rise, as a protracted housing downturn and rising job insecurity continued to be drag on domestic consumption. Growth was higher compared to 1% in October. Chinese officials have renewed pledges to expand imports and work toward balancing trade amid widespread criticism against its aggressive exports.  The trade data, though, bodes well for the nation's growth prospects, according to Citigroup.\"We were one of the first to lift the full-year GDP forecast to 5% for 2025E in June ... and the solid trade prints since have made us more confident of our forecast,\" Xiangrong Yu, Citi's chief China economist, said in a note. \"We believe exports will remain a key driver for GDP growth next year amid the US-China tariff truce and China's industrial competitiveness.\" Tensions with the U.S. have resulted in a sharp rollback of exports, though China still is able to indirectly get its goods to American ports through other nations such as Vietnam. Recent talks have helped ease some of the acrimony.Exports to the U.S. plunged 28.6% in November, marking the eighth straight month of double-digit declines in shipments to the world's largest consumer market, even after President Xi Jinping and his U.S. counterpart Donald Trump reached a deal in South Korea in late October. Imports from America shrank 19% from a year earlier. While China's trade surplus has surged, the U.S. trade imbalance has contracted sharply.The U.S. trade deficit contracted fell to $59.6 billion in August, down from $78.2 billion in July and $71.2 billion from the same month in 2024. Exports were a record $62.4 billion, while imports also set a new standard at $13.6 billion. The year-to-date deficit which China stood at $185.2 billion, down about 21% from 2024.\"Despite the trade truce, the U.S. still imposes higher tariffs on China than on [many] other countries,\" said Gary Ng, senior economist at Natixis, adding that Chinese exporters have likely continued to utilize their facilities in third markets to export to the U.S. \"It can become a future norm,\" Ng noted.  Levies on Chinese goods remain at around 47.5% according to Peterson Institute for International Economics. Beijing's tariffs on imports from the U.S. stand at around 32%. So far this year, China's exports to the U.S. have declined 18.9% year on year, while imports have dropped 13.2%. Shrinking U.S. exports in November were more than offset by surging shipments to other markets, particularly China's two largest trading blocs, the European Union and the Association of Southeast Asian Nations.  China's exports to ASEAN and the EU rose over over 8% and nearly 15%, respectively.  However, challenges lie ahead.\"Policymakers are likely to stay mindful of potential trade conflicts despite the tariff truce with the US, in our view,\" wrote Yu, the Citi economist. \"Our base case is that the US-China truce will be sustained through 2026 despite being seemingly fragile, but there could be trade tensions with other partners – such as France ... as China's trade surplus rose to above [$1 trillion]. We believe China might adopt additional voluntary trade restrictions to mitigate the trade imbalance.\"Sluggish start under trade pactFollowing the trade truce struck in October, Beijing and Washington agreed to roll back steep tariffs on each other's goods, export controls for critical minerals and advanced technology, with China committing to buying more American soybeans and working with Washington to crack down on fentanyl flows. China's exports of rare earths accelerated in November, as it shipped out 5,494 tons of the critical minerals, up 24% from a year earlier and compared with 4,343.5 tons in October. The Ministry of Commerce has reportedly been designing a new rare earth licensing regime that could expedite shipments.   The country's overall soybean imports grew 13% from a year earlier to 8.1 million metric tons in November, although down from the October level, signaling a slow start to fulfilling its promise of purchasing 12 million metric tons of U.S. soybeans by year-end.  \"Looking into 2026, we expect export growth to remain resilient,\" Jing Wang, China economist at Nomura, said in a note. \"However, a moderation of export growth is likely, in our view. Export growth may revert to the long-term mean, despite China's solid advancements in manufacturing, especially as more countries impose trade barriers.\"Wang added that the truce with the U.S. may not lost and \"we see a second China shock fast approaching, and it might compel Europe to impose more restrictive measures to protect its manufacturing sector.\"Upcoming policy meetingChinese policymakers are expected to meet later this month for the annual Central Economic Work Conference, to discuss economic growth target, budget and policy priorities for next year. The specific targets will not be officially announced until the \"Two Sessions\" meeting in March next year. The rebound of export growth would help mitigate the drag from weak domestic demand, putting the economy on track to deliver the \"around 5%\" growth target this year, said Zhiwei Zhang, president and chief economist at Pinpoint Asset Management.  Beijing is expected to keep the 2026 growth target unchanged at \"around 5%,\" according to Goldman Sachs, which would require incremental policy easing early next year to ensure a growth acceleration from a likely lackluster reading in the fourth quarter of 2025. China's factory activity shrank for an eighth month in November, an official manufacturing survey showed, with new orders staying in contraction. A private survey focused on exporters showed manufacturing activity unexpectedly fell into contraction.   The Wall Street bank expects Chinese authorities to lift the augmented fiscal deficit ceiling by 1 percentage point of GDP, cut policy rates by a total of 20 basis points and step up stimulus measures to rein in the housing slump. \n\t\t\n\t\t\n\t\t\n\t\t\tWeekly analysis and insights from Asia's largest economy in your inbox\n\t\t\tSubscribe now\n\t\t\n\tThe strengthening yuan in recent weeks has not appeared to stem the flow of China's exports. The offshore yuan has strengthened nearly 5% since April to 7.0669 per dollar at market open on Monday, according to LSEG data.Despite a steady 5% annual GDP growth since 2023, China \"urgently needs to curb its export dependence and pivot towards domestic consumption to ensure sustainable expansion,\" Weijian Shan, chief executive of private equity firm PAG, said in an opinion piece last month.  A stronger yuan could boost consumption's contribution to economic growth to the 2023 level of 86% from currently 53%, as it would lower costs of imports and enhance household purchasing power, Shan added.  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China's trade surplus tops $1 trillion despite Trump's attempt to contain it. Here's what that means",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108237999-1765151887110-gettyimages-2249229993-cfoto-qingdaop251204_npZyJ.jpeg?v=1765151899&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T14:18:32.000Z",
      "dateModified": "2025-12-08T14:18:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ray Dalio says Middle East is becoming a 'Silicon Valley of capitalists’",
    "url": "https://www.cnbc.com/2025/12/08/ray-dalio-middle-east-silicon-valley-ai-bubble.html",
    "image": "https://image.cnbcfm.com/api/v1/image/108217912-1761667354340-Dalio1.jpg?v=1761667468&w=1920&h=1080",
    "tag": "Finance",
    "date": "2025-12-08T09:58:57.000Z",
    "description": "Ray Dalio, founder of Bridgewater, speaking to CNBC at the Future Investment Institute 2025 summit in Riyadh on Oct. 28th, 2025.CNBCThe Middle East is",
    "body": "Ray Dalio, founder of Bridgewater, speaking to CNBC at the Future Investment Institute 2025 summit in Riyadh on Oct. 28th, 2025.CNBCThe Middle East is fast emerging as one of the world's most powerful AI hubs, Bridgewater Associates' founder Ray Dalio said Monday, comparing the region's rise to Silicon Valley's pull for all things tech. Speaking to CNBC, Dalio said the United Arab Emirates and its neighbors have combined vast pools of capital with an influx of global talent, creating a magnet for investment managers and AI innovators alike.The UAE and Saudi Arabia have this year launched multibillion-dollar initiatives to build cloud, data centers and other AI infrastructure, underpinned by sovereign-wealth capital and global tech partnerships. A $10 billion agreement between Google Cloud and Saudi Arabia's Public Investment Fund announced this year aims to create a \"global AI hub\" in the country, as part of a broader push to host data-centers and AI workloads locally.Earlier this year, technology giants OpenAI, Oracle, Nvidia and Cisco combined forces to build a major Stargate artificial intelligence campus in the United Arab Emirates.When asked if he thinks that the UAE, Saudi Arabia and Qatar can be leaders in the AI race, Dalio said, \"What they've done is to create talented people. So this [region] is kind of becoming a Silicon Valley of capitalists ... So now people are coming in … money is coming in, talent is coming in.\"watch nowDalio, who has been visiting Abu Dhabi for more than three decades, said the Gulf's transformation is the result of deliberate statecraft and long-term planning. He described the UAE as \"a paradise in a world that's troubled,\" citing its leadership, stability, quality of life and ambition to build a globally competitive financial ecosystem.\"There's a buzz here, the way there's a buzz in San Francisco, places like that, about AI or technology. It's very similar to that,\" Dalio said.'Precarious' next two yearsThe Bridgewater founder warned that the global economy was headed toward an uncertain future in the near term due to a confluence of multiple forces, reiterating his concerns about markets being in bubble.  \"The next year or two in the future is going to be more precarious,\" he said, pointing to the convergence of what he calls the three dominant cycles: debt, U.S. political conflict and geopolitics.The global debt overhang is already forcing stress into pockets of the market.\"We're seeing cracks in the markets in a number of ways, private equity, venture capital, debt that's being refinanced, and all of those. So we are in a bubble, I believe, by almost all of those measures,\" Dalio said, highlighting similarities with the 2000 bubble but not the one in 1929.He also expects U.S. politics to become more disruptive heading into 2026. \"As we go into the 2026 elections … you will see a lot more conflict in different ways,\" Dalio said, adding that elevated interest rates and concentrated market leadership compound the vulnerability.\"Every country … cannot continue to accumulate the debt they have, yet politically they can't raise taxes and they can't cut benefits. So they're stuck.\" That fiscal bind feeds into a broader rise in domestic polarization: \"We now have populism of the left and populism of the right … which means irreconcilable differences.\"Dalio reiterated his view that the AI rally is in bubble territory, but advised investors not to rush for exits just because valuations are stretched.Concerns about an AI bubble have been swirling in recent months, with notable voices such as OpenAI CEO Sam Altman suggesting that the AI market was in a bubble. Investor Michael Burry, who called the 2008 subprime mortgage crash, has forecast the artificial intelligence market bubble could collapse in the next two years. \"All the bubbles took place in times of great technological change,\" Dalio said. \"You don't want to get out of it just because of the bubble. You want to look for the pricking of the bubble.\"The catalyst for that \"pricking,\" he said, usually comes from a tightening of money or a forced need to sell wealth to meet obligations. He also warned of stress in venture capital, private equity and commercial real estate, sectors where cheap debt is now rolling over at higher rates. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ray Dalio says Middle East is becoming a 'Silicon Valley of capitalists’",
      "image": [
        "https://image.cnbcfm.com/api/v1/image/108217912-1761667354340-Dalio1.jpg?v=1761667468&w=1920&h=1080"
      ],
      "datePublished": "2025-12-08T09:58:57.000Z",
      "dateModified": "2025-12-08T09:58:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]