[
  {
    "title": "All Mech Part Locations In Metroid Prime 4: Beyond",
    "url": "https://www.gamespot.com/gallery/metroid-prime-4-beyond-mech-part-locations-guide/2900-7336/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1816/18167535/4620412-metroid-prime-4-mech-parts-guide-.jpg",
    "tag": "Gaming",
    "date": "2025-12-11T22:13:00.000Z",
    "description": "By     Jason Rodriguez   on December 11, 2025 at 2:13PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Jason Rodriguez\n   on December 11, 2025 at 2:13PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Are you eager to collect all the Mech Parts in Metroid Prime 4: Beyond? This is a late-game objective, one of the requirements for you to finally lets you reenter the Chrono Tower to conclude the campaign.Here's what you need to do to unlock this task:Complete the main objectives in the Great Mines.Travel across Sol Valley all the way to the outskirts of Flare Pool.You should see smoke in the distance. Get close enough and you'll meet Tokabi at his campsite.Tokabi will hand over the Teleporter Chip. Bring this to Mackenzie at the Fury Green base camp so he can configure the Teleporter Patches.The device allows you to interact with any Mech Parts that you stumble upon, automatically transporting them back to your base camp. You need to find six Mech Parts in total.Flare Pool - Mech Part locationThe vast majority of Metroid Prime 4 Mech Parts are in the Sol Valley open-world region. However, there's one in Flare Pool:At the Lava Lake Bridge, use your Super Missile to destroy the large stone slab.Enter the cave and pick up the Psychic Power Bomb Expansion along the way.When you arrive at the cavernous area, you'll fight the Behemoth boss. It mostly spews fire projectiles that can be easily avoided.Keep shooting the Behemoth's glowing eyes until it dies. You should then be able to interact with the Mech Part.Sol Valley - Mech Part locations mapThere are five Mech Parts in Sol Valley, and most of them are in places known as G.F. Debris. You can pick them up in any order, though we've numbered them from northwest to east.Note that these locations also have other goodies, including Shot Expansions and Missile Expansions. Likewise, we recommend activating the Scout Bot so you can see other rewards on the map.Sol Valley - Mech Part location #1Found at the entrance to the Ice Belt. Enter the Ice Belt and, instead of riding the lift to the underground area, use your Psychic Grapple to hop across the gap. This leads you to the other side of the facility's exterior, whereupon you'll find a container with a Mech Part.Sol Valley - Mech Part location #2Found at the G.F. Debris at the northern part of Sol Valley. Use your Thunder Shot to shoot the giant robotic arm, then interact with it when you're prompted.Note that you can pick up a Missile Expansion in this area. Moreover, Tokabi will appear at this location and give you a Shot Expansion once you've met him in two other campsites.Sol Valley - Mech Part location #3This Metroid Prime 4 Mech Part is in the G.F. facility just outside Fury Green. You'll see a vehicle that's crashed into a wall. Use your Psychic Lasso to pull it toward you.Sol Valley - Mech Part location #4This Mech Part is on the roof of a G.F. facility in the southern part of Sol Valley. Look for crates that you can hop on to reach it.Sol Valley - Mech Part location #5There's one more Metroid Prime 4 Mech Part near the G.F. Debris at the eastern edge of the map. As soon as you approach it, a boss fight against a creature known as Varmis will ensue:To beat Varmis, you need to mount up on your Vi-O-La cycle, then lock-on while targeting its tail.Your Vi-O-La missiles temporarily slow down the boss, allowing you to catch up.When you're close enough, do a Vi-O-La boost to ram into its tail. You have to do this approximately 10 times to defeat this sand beast.Once the boss is dead, switch to your Morph Ball form and roll straight into its belly. Then, plop down a Psychic Power Bomb to blow it up.That does it for our guide on where to find all Mech Parts in Metroid Prime 4: Beyond. When you're done, return to Mackenzie at the Fury Green base camp so he can fully repair the robotic assistant. Now, all that's left is to collect more Green Crystals so you can enter the Chrono Tower. Don't forget to gather more rewards, such as Energy Tanks, while you're at it.Venture forth across the endless dunes of Viewros and delve deeper into long-forgotten alien facilities. If ever you need help with various facets, you can always visit our Metroid Prime 4: Beyond guides hub.    \n  \n                      "
  },
  {
    "title": "All Psychic Power Bomb Expansions In Metroid Prime 4: Beyond",
    "url": "https://www.gamespot.com/gallery/metroid-prime-4-beyond-psychic-power-bomb-expansion-locations-guide/2900-7335/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1816/18167535/4620377-metroid-prime-4-psychic-power-bomb-expansion-guide-.jpg",
    "tag": "Gaming",
    "date": "2025-12-11T22:13:00.000Z",
    "description": "By     Jason Rodriguez   on December 11, 2025 at 2:13PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Jason Rodriguez\n   on December 11, 2025 at 2:13PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Are you looking to unlock all the Psychic Power Bomb expansions in Metroid Prime 4: Beyond? The ability itself is acquired fairly late in the campaign, but it's quite useful to have. With it, you can blow up obstacles and barriers that are otherwise impenetrable.Note that the Psychic Power Bomb is a Power Suit ability that comes from the Great Mines region. You need to defeat the Omega Griever boss to claim it as your reward. By default, you only have three charges, which can be replenished if you find pick-ups or rest at save points. But, with the help of our guide, you can obtain five additional upgrades so you can roll around while making everything go kablooey.Great Mines - Psychic Power Bomb ExpansionSub-zone: Level 3 - Lower PitLocation: This ought to be the first Metroid Prime 4 Psychic Power Bomb Expansion that you obtain. Immediately after clearing the Great Mines, you'll be able to delve back into the depths with your newfound abilities. Upon reaching Level 3, look behind you and burn the gunk with your Fire Shot. Then, roll along the tunnel and blow up the blockage with your beefed up bomb.Fury Green - Psychic Power Bomb ExpansionSub-zone: Quiet ClearingLocation: This item can be found in the very first area of the campaign proper. There's a Lamorn statue leaning on a large tree. Destroy it using a Psychic Power Bomb.Flare Pool - Psychic Power Bomb ExpansionSub-zone: Lava Lake BridgeLocation: You've likely spotted a gargantuan slab of rock at the Lava Lake when you first ventured into Flare Pool. Once you have the Super Missile from Great Mines, return to this area and destroy the obstacle. Roll through the ducts in your Morph Ball form while avoiding the lava. Then, upon reaching the opposite side, swing across using your Psychic Grapple. There's a device that shuts down the lava flow in the ducts, allowing you to grab the upgrade.Sol Valley - Psychic Power Bomb Expansions mapThere are a couple of Metroid Prime 4 Psychic Power Bomb Expansions in the Sol Valley, the game's semi-open world area. Don't forget to tag the Scout Bot so you can see other shrines and rewards in this zone.Sol Valley Psychic Power Bomb Expansion #1Sub-zone: G.F. DebrisLocation: Found atop the G.F. structure at the eastern side of the map. Reach it by using your Psychic Grapple, then blow up the container with your Power Bomb. Note that the Varmis boss is nearby. You need to defeat it to receive a Mech Part.Sol Valley Psychic Power Bomb Expansion #2Sub-zone: Tokabi CampsiteLocation: This is given to you by Tokabi at his campsite, which is just outside Fury Green. However, you need to encounter him thrice in other locations in Sol Valley before he shows up in this area:  First encounter - Just outside Flare Pool.Second encounter - North of Volt Forge.Third encounter - At the G.F. Debris in the northern part of the map.Note that Tokabi might not show up until you (a) progress further into the campaign or (b) relaunch the game.That does it for our guide on where to find all Psychic Power Bomb Expansions in Metroid Prime 4: Beyond. If you're looking for other power-ups, you can check our Missile Expansions guide and Shot Expansions guide.Venture forth across the endless dunes of Viewros and delve deeper into long-forgotten alien facilities. If ever you need help with various facets, you can always visit our Metroid Prime 4: Beyond guides hub.    \n  \n                      "
  },
  {
    "title": "Pulled Fallout Season 1 Recap Video Was AI That Couldn't Even Get Basic Facts Right",
    "url": "https://www.gamespot.com/articles/pulled-fallout-season-1-recap-video-was-ai-that-couldnt-even-get-basic-facts-right/1100-6536897/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4621409-falloutlucyseason1.jpg",
    "tag": "Gaming",
    "date": "2025-12-12T00:35:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Time Magazine named AI's...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Time Magazine named AI's architects as Person of the Year for 2025, but if these \"thinking computers\" are exemplified by the artificial intelligence used by Amazon Prime Video, then they aren't really thinking at all. Prime Video posted an AI recap video for Fallout Season 1 that's so egregious and wrong that it almost played like a parody--at least until it was pulled.Until earlier today, Prime Video subscribers were able to witness it for themselves by visiting Fallout Season 2's page and clicking on Fallout - Season 1 recap. However, the video has since been pulled. The AI tones of the narrator's voice were a dead giveaway about the video's origin. But it soon became clear that the video wasn't even proofed by anyone connected to the show. The most glaring example of that was the video's description of the flashback scenes, which it states are the 1950s instead of the retro future of 2077.The video was also cut and edited in a haphazard way that almost seemed random. Near the end of the video, the narration even implied that the Ghoul threatened to kill Lucy to coerce her to go to New Vegas with him. This video has trouble getting even the basic facts correct, and it could almost be believable as a brilliant joke if the show had more in-universe AI-related material to work with.Fallout executive producer Jonathan Nolan recently revealed that there are plans to shoot Season 3 this summer in order to get it back on Prime Video ASAP. Anyone who needs to catch up on the show or watch it for the first time can use Samsung TV Plus to stream Fallout Season 1 for free on Samsung TV Plus. In other Fallout news, game director Todd Howard will be in attendance during The Game Awards tonight, where he will present an award.Prime Video will debut Fallout Season 2 on December 17. The remaining episodes of Season 2 will be dropped weekly.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]