[
  {
    "title": "Luigi's Mansion Is Coming To Nintendo Switch 2 In Time For Halloween",
    "url": "https://www.gamespot.com/articles/luigis-mansion-is-coming-to-nintendo-switch-2-in-time-for-halloween/1100-6535610/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1578/15787979/4589132-3241432542-.png",
    "tag": "Gaming",
    "date": "2025-10-22T02:15:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Nintendo is bringing another...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Nintendo is bringing another beloved GameCube title to the Switch Online + Expansion Pack service next week. The original Luigi's Mansion is joining the classic games lineup on October 30.Originally released alongside the GameCube in November 2001, Luigi's Mansion sees Mario's cowardly brother exploring a haunted mansion he won in a contest he never entered. With the help of Professor E. Gadd and his vacuum-like Poltergust 3000, Luigi must work his way through the mansion's many rooms and capture all the ghosts that lurk within.          Luigi's Mansion marks the sixth title to arrive on Switch Online's GameCube collection. The library launched alongside the Switch 2 with three games--The Legend of Zelda: The Wind Waker, F-Zero GX, and SoulCalibur II--while Super Mario Strikers and Chibi-Robo were added to the lineup in July and August, respectively.Nintendo will be bringing more GameCube games to the service in the future. The company has already confirmed that additional classics like Super Mario Sunshine, Pokemon Colosseum, and Fire Emblem: Path of Radiance are on the way, although it hasn't yet announced when those games will be added.The GameCube collection is one of a few Switch 2-exclusive perks available to Switch Online + Expansion Pack subscribers. Members can also download the Switch 2 upgrade packs for both The Legend of Zelda: Breath of the Wild and The Legend of Zelda: Tears of the Kingdom for free.An individual subscription for the base Nintendo Switch Online service runs for $20 a year, while the Expansion Pack plan costs $50 a year. Nintendo also offers an annual family plan for $80 that covers up to eight Nintendo Accounts across multiple systems.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "CoD: Black Ops 7 Dev Reveals Highly Requested Changes To Aim Assist, Perks, And Movement",
    "url": "https://www.gamespot.com/articles/cod-black-ops-7-dev-reveals-highly-requested-changes-to-aim-assist-perks-and-movement/1100-6535601/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1639/16394540/4588790-bo7_reveal_cp_04branded.jpg",
    "tag": "Gaming",
    "date": "2025-10-21T17:48:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Call of Duty: Black Ops 7...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Call of Duty: Black Ops 7 releases on November 14, and Treyarch's latest Dev Talk video revealed plenty of new changes for the game's multiplayer. This includes one of the most requested changes from the beta, which makes adjustments to the game's movement and the Dexterity perk.The latest Dev Talk video featured Treyarch associate design director Matt Scronce, who discussed the community complaints about the Dexterity perk. Black Ops 7 initially removed the ability to aim down sights with weapons while diving and sliding, and players needed to equip the Dexterity perk to get the same fluid movement offered in Black Ops 6. Scronce announced that player feedback was considered, and Dexterity will no longer be needed to ADS while sliding or diving. Players can still equip the perk to speed up those specific actions, but it's no longer required to perform the movement.We've got some BIG updates to MP coming out of the #BlackOps7 Beta in our latest Dev Talk:✅ ADS & Dexterity changes✅ Aim assist adjustments✅ Louder footsteps✅ New slide tuning✅ Perk distribution updates✅ New Perk combinations✅ Faster mantle speeds➕ more to come! pic.twitter.com/2BVcHUXnu0  — Treyarch (@Treyarch) October 21, 2025              Adjustments are also made to the game's sliding and the mantling movements. The slide speed is lowered and distance has been reduced.\"It still feels great. It still feels fluid,\" Scronce said when discussing the slide tuning. \"But we want to make sure that's not the only way you can enter an engagement.\"For mantling, the developer agreed with feedback that some of the mantling speeds felt too slow. Scrone said the team is going through every mantle in the game to make sure they all have consistent speed and everything feels fast and fluid.Perk changes were also announced. Some perks were moved to different categories, and unpopular perks were combined to make more powerful options. One complaint from the beta was that so many powerful perks were stacked in the slot 1 category, so some of the perks are now shifted around to allow players to choose better perk combinations. This includes Tac Mask being moved from slot 1 to slot 2, Tac Sprinter from slot 3 to slot 1, and Cold-Blooded from slot 1 to slot 3.As for combined perks, Black Ops 7's Shadow perk is being combined with the Engineer perk. This will allow players to not only see enemy traps but also move past them without triggering any effects. For melee players, Bruiser is now combined with the Close Shave perk. This will allow increased health regen and score for melee kills.Aim-assist changes are also confirmed. The developer revealed that data collected from the beta revealed controller players were winning close-range fights, while mouse-and-keyboard players were winning longer-range fights. Because of this, Treyarch is making changes to rotational aim assist, including requiring the right thumbstick to be moving in the direction of a target for aim assist to start.Black Ops 7 has received a few other major changes since its initial reveal. Catering to community feedback, Activision revealed that Call of Duty's Carry Forward program was canceled. Black Ops 6 weapons, operators skins, and cosmetic items will no longer transfer over to Black Ops 7, with the only exception being some Zombies-related content.The publisher also revealed that Black Ops 7 would launch with little or no SBMM, making the game's matchmaking feel more like the classic system used in older Call of Duty games. This matchmaking change is something a portion of the community has been requesting for years.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Payday 2 Is Getting New Updates From Partner Studio",
    "url": "https://www.gamespot.com/articles/payday-2-is-getting-new-updates-from-partner-studio/1100-6535609/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4589050-payday2.jpg",
    "tag": "Gaming",
    "date": "2025-10-21T22:55:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Payday 2 may predate Payday 3...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Payday 2 may predate Payday 3 by a decade, but the former still remains popular while the latter has struggled. Now, publisher Starbreeze has lined up Sidetrack Games to work on Payday 2 updates on PC and keep those players satisfied.Sidetrack was previously known as the M.U.G. Team in the Payday modding community, and the studio also worked on updates for RAID: World War 2 after that game's lifecycle came to an end. According to Starbreeze, Sidetrack's first Payday 2 update will go live on October 23, with a focus \"on the stability of the game and improving the overall player experience.\" Future updates are planned for \"quality-of-life improvements and general game fixes.\"Starbreeze will host a livestream on October 23 that lays out the details of the patch and invites the player community to \"help shape future improvements.\" With Payday 2 now in the hands of Sidetrack going forward, Starbreeze will primarily be working on updates for Payday 3. Payday 2 still has has tens of thousands of players at any given time, according to SteamDB. However, Payday 3 has trouble cracking 1,000 concurrent players.Earlier this month, Starbreeze canceled its Dungeons & Dragons game and laid off workers in a renewed push towards the Payday franchise and other heist games. The company also added a Payday 2 subscription service that gives players access to the DLC for a monthly charge. Starbreeze went on to apologize for raising the Payday 2 DLC bundle to $170 and subsequently reverted the price back to $118.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]