[
  {
    "title": "Fortnite Battle Pass For Simpsons Season: All Skins And Other Rewards",
    "url": "https://www.gamespot.com/gallery/fortnite-battle-pass-for-simpsons-season-all-skins-and-other-rewards/2900-7205/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4594640-simpsonsbattlepass.jpg",
    "tag": "Gaming",
    "date": "2025-11-01T17:07:00.000Z",
    "description": "By     Phil Owen   on November 1, 2025 at 10:08AM PDT                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Phil Owen\n   on November 1, 2025 at 10:08AM PDT    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Fortnite's Simpsons takeover is now underway, and so for the next month or so, we'll be duking it out in Springfield and making use of a number of new Simpsons-themed items to help survive against our foes. But no collab takeover is truly complete without cosmetics, and Fortnite is adding tons of Simpsons skins and accessories both in the item shop and via the new Simpsons battle pass.The Simpsons pass is a relatively short one, with about 70 tiers of rewards vs the usual 200 in the linear part of the pass--as has been the case with all previous mini-seasons. The Simpsons pass includes five skins--Homer, Marge, Ned Flanders, Blinky Fishstick, and Springfielder Peely--each of which has substantial style options, along with accompanying sets of pickaxes, gliders, emotes, and so on. The new Peely is the bonus skin that'll become available starting November 11, though he's not just a Simpsons-looking Fortnite guy--it appears as though he'll have a Professor Frink alternate style as well.Befitting a season based on a sitcom, the accessories in the pass are full of mundane items, like a vacuum cleaner pickaxe and a shopping cart glider that has baby Maggie riding in it. And while the pass includes Homer, Marge, and Ned's classic looks, they also have really distinctive alternate styles, like Homer in a Devil costume, Marge in witch form, and Ned Flanders in his stupid, sexy ski outfit.Marge is the skin on Page 1, but in an extremely unusual move, buying this battle pass does not instantly unlock her. Instead, the instant unlock for this pass is the banana dog Peels, the first of the new Sidekicks. Sidekicks, which are being introduced for the first time this season, are little companions that will follow you around in Battle Royale and celebrate your victories. Most of these guys will be sold in the item shop, but Peels is the cheap first hit to get you hooked. Or at least that's the idea. Marge, meanwhile, can be unlocked once you've gotten everything else on Page 1.Despite being a short one, the Simpsons pass costs the usual 1,000 V-Bucks and is included with a month of Fortnite Crew. To see every new skin, style, and accessory included in Fortnite's new Simpsons battle pass, scroll on.Homer is the final skin on the linear part of the battle pass, and the banana version of Professor Frink is expected to be the alternate style for bonus skin Springfielder Peely.Marge and Peels are both unlocked on the first page of the Springfield battle pass. Yes, you can pet the dog. Springfielder Peely's default style is a little disturbing, but in a good way.Ned Flander will be on the pass, too. A mashup of Blinky and Fishstick is also included in the pass.Beyond the battle pass, several Simpsons characters will be sold in the item shop, including Bart in a mech suit.We'll also see Krusty the Clown, Moe, and Lisa in a mech suit in the item shop during the season.    \n  \n                      "
  },
  {
    "title": "Fortnite - New Weapons In The Simpsons Season",
    "url": "https://www.gamespot.com/gallery/fortnite-new-weapons-in-simpsons-season/2900-7206/",
    "image": "https://www.gamespot.com/a/uploads/original/1757/17577455/4594663-simspsonslootpool.jpg",
    "tag": "Gaming",
    "date": "2025-11-01T18:29:00.000Z",
    "description": "By     Phil Owen   on November 1, 2025 at 12:55PM PDT                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Phil Owen\n   on November 1, 2025 at 12:55PM PDT    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                A new season of Fortnite means it's time to refresh the loot pool, and the fact that this new season is Simpsons-flavored means we're getting more of an overhaul than usual. It's similar to the situation back in May when Star Wars season replaced all the Fortnite guns with Star Wars blasters, but since The Simpsons is a sitcom and not a movie franchise about wars, Epic is going about things a little differently, by replacing most of the health and shield items with Simpsons food and drinks, while unvaulting a bunch of Fortnite weapons that have not been in the Battle Royale loot pool in a while.But there are at least a couple of Simpsons-themed weapons, even so. To start the season, we'll have the Mr. Blasty revolver, with an exotic variant that drops from the roaming Krusty the Clown boss NPC. Later on, we're expecting to see some other wacky Simpsons weapons, including Moe's absurd combo gun, the Deodorant Applicator, and the Makeup Gun, though none of those are confirmed yet.As I previously teased, The Simpsons season also includes a number of health and shield consumables that are based on stuff from the Simpsons, like Super Squishees and Krusty Burgers. Scroll on to learn more about the new items in the Simpsons season loot pool, as well as a rundown on the Fortnite guns you'll have at your disposal this season.Super SquisheeThis frosty beverage increases your health and/or shields and gives you an improved Slap effect, which makes you run fast, gives you unlimited sprint, and makes you glow.Blinky FishThe Blinky Fish provides health and grants a dash ability for a short period of time after you eat one.Mr. BlastyWe'll start the season with the highly accurate Mr. Blasty revolver, which has impressive range for a snub-nosed pistol. There's also an exotic version, which attaches balloons to the people you shoot with it, that drops from the Krusty the Clown boss.Jebediah's Protective HelmYou can steal this item--which grants complete protection from a single headshot, after which it falls off your head--from the statue of Springfield's founder, Jebediah Springfield, which is found in the Springfield Town Square.Krusty BurgerThe most unhealthy burger in the world grants, ironically, both health and shield regeneration when eaten.Returning weaponsThe returning arsenal of Fortnite weapons is relatively small, with two assault rifles (including a modless version of the well-liked Striker AR from Chapter 5, pictured) three shotguns, two SMGs/auto pistols, and one scopeless sniper. Epic referred to this as a \"back-to-basics\" loot pool, which sounds about right. Though, of course, the loot pool will get a lot more complicated as they add goofy Simpsons weapons over the course of the season. Meanwhile, Shockwave Grenades will once again be this season's staple movement item. You can check out the rest of the existing Fortnite guns in the new loot pool below.Suppressed Assault RifleCompact SMGTactical ShotgunThunder ShotgunRanger ShotgunInfantry RifleSuppressed Pistol    \n  \n                      "
  },
  {
    "title": "Fortnite Simpsons Map: Full Springfield Map And All Named Locations",
    "url": "https://www.gamespot.com/gallery/fortnite-simpsons-map-full-springfield-map-and-all-named-locations/2900-7204/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4594636-screenshot18.jpg",
    "tag": "Gaming",
    "date": "2025-11-01T15:15:00.000Z",
    "description": "By     Phil Owen   on November 1, 2025 at 8:16AM PDT                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Phil Owen\n   on November 1, 2025 at 8:16AM PDT    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Fortnite's Simpsons season is finally here after many months of rumors, and in some ways, it's a lot more involved than previous mini-seasons. That's because it's the first of them to take place on a completely new and original island. While the other November mini-seasons took place on updated versions of old maps, and Star Wars season just added Star Wars places to the Battle Royale map, Simpsons season is introducing a totally new, cel-shaded island based on Springfield and various iconic locations from the series for us to fight over in November.At least one sacrifice was made to make this map happen. This island is a little bit smaller than the current Battle Royale map, and as a result, it uses a smaller player cap than usual at 80 players instead of 100. But that's not necessarily the worst thing, as the smaller island should mean faster and more exciting rounds, and also they might be able to keep it around as a Reload map after the season ends, which would make all this effort a little more worthwhile.The new island includes nine major, named locations, like the Springfield Nuclear Power Plant, and it's filled with gimmicks, like how each round will have one randomly activated event that players can race to complete for great loot. These are the new map spots:Springfield Nuclear Power PlantCletus' Corn HoleKamp KrustyBurns ManorSpringfield Town SquareMayor's MunchiesDonut DistrictEvergreen TerraceSpringfield SlurpworksAs you can see, Epic essentially broke Springfield up into several smaller pieces and spread them around. I shudder to think of how many Easter Eggs this map must be filled with. Scroll on for closer looks at some of the major locations and landmarks you'll find around the map. And before you ask--yes, these are all actual Fortnite screenshots.    \n  \n                      "
  }
]