[
  {
    "title": "All Rift Anomaly Locations And Rewards In The Outer Worlds 2",
    "url": "https://www.gamespot.com/gallery/outer-worlds-2-rift-anomaly-locations-rewards-guide/2900-7203/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1816/18167535/4594574-outer-worlds-2-rift-anomaly-locations-rewards-.jpg",
    "tag": "Gaming",
    "date": "2025-11-03T22:43:00.000Z",
    "description": "By     Jason Rodriguez   on November 3, 2025 at 2:43PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Jason Rodriguez\n   on November 3, 2025 at 2:43PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Are you excited to find all Rift Anomalies in The Outer Worlds 2? In all likelihood, you're going to stumble upon twisted and displaced pockets of reality as you trek across inhospitable zones. If you attempt to approach these areas, your character will instantly perish. However, once you obtain a nifty gadget, you'll soon be able to interact with these strange phenomena.How to get and use the Rift Anomaly Modulator or Prototype Rift DeviceThe Prototype Rift Device, also known as the Prototype Rift Device, is just one of several gadgets/tools in the game. It comes from a main quest called \"An Instrument to Unfold Space and Time,\" which takes place on the planet of Praetor. Here's a quick summary of what you can expect:Praetor, along with other planets/locations, are part of the mid-game stage of the campaign. Once you arrive, find a way to reach the western part of the region so you can enter the Interstitial Reconfiguration Center.There are lots of Protectorate enemies in the region, but you can also help out an NPC named Lead Researcher Hurley. As for the gadget, it's in the level 4 section of the facility.Once the device is in your possession, just walk up to a Rift Anomaly and press the interaction button. Doing so will reveal the contorted/hidden pocket of reality that was absorbed by the rift.The objects that appear include ledges/platforms that you can climb on, invisible/hidden gear pieces, various containers, and so on. You can also pick up Rift Residue materials for crafting purposes.Note that Rift Anomalies will revert back to their distorted forms after a few seconds, but you can still interact with them with the gadget. Do not accidentally walk into them or your character will die.Note: Rift Anomalies in The Outer Worlds 2 contain awesome rewards, including gear pieces. That said, we list the equipment that come from other sources/methods in the following guides: Unique weapons, unique armors/outfits, unique helmets, and High Security Lockboxes.Eden: Paradise Island - Rift Anomaly locations mapThe map above shows The Outer Worlds 2 Rift Anomaly locations in Paradise Island. Note that any Rift Anomaly you discover will also be permanently marked on your map.Paradise Island Rift Anomaly location #1Location: There are a couple of rifts in Crabble Spawning Grounds:  The first one just creates platforms that you can use to cross the gap, though you're better off with just the double jump ability.The second rift creates the ledges and pipes that allow you to reach the top of the structure.Reward: Shrink RayType: Weapon (non-legendary)Mods: Shrinkify - Reduce foes down to boot-stomping size. Powerful enemies will resist the effect until they're weakened. They'll instead take damage and be briefly stunned.Paradise Island Rift Anomaly location #2Location: Halfway between Fairfield and the Bridge of the Reverent, you'll see a couple of soldiers who've gotten curious about a rift. One of them approaches it, only to get gobbled up. Once you have the Rift Anomaly Modulator, interact with the wormhole for a surprising moment.Reward 1: GARYType: Light armor (non-legendary)Stats: +20% evasion chance and +50% combat sprint speedMods: Periodically lashes out with tendrils to thrash enemies. The damage increases with your Medical and Science skill. As an aside, Gary also screeches at your character, making this fleshy sentient armor one of the coolest items in the game.Reward 2: Matthew Singh collectible card - You can learn more about the other items in our collectible cards guide.Effect: +1% damageParadise Island Rift Anomaly location #3Location: Found due east of the Bridge of the Reverent or north of the Excogitation Chapel. It's by the cliff's edge near a tower. It's also where you tackle Aza's \"Dawn of a Glorious Betrayal\" personal quest to obtain her first mod kit.Reward: The GoomerangType: WeaponMods: Bio-Barrage - Fires a barrage of bouncy goo blobs. Aiming with the weapon allows it to lock-on and home toward enemies.Free Market Station - Rift Anomaly locationLocation: You'll come across another Rift Anomaly in The Outer Worlds 2 if you head to Free Market Station. Exit your ship and pass below the archway. You should see a junkyard at the left-hand side.Reward: Vending machine that sells the Bred KnifeType: WeaponMods: Plasma Toaster - Applies a large amount of burn and unlocks a recipe for making delicious toasted bread.Dorado: Golden Ridge - Rift Anomaly locations mapOnce you travel to the Golden Ridge region, you'll be able to check out additional Rift Anomalies. There are three locations, though one of them has several that are clustered together.Golden Ridge Rift Anomaly location #1Location: You'll see this wormhole at the Alexandra Station landing site. Interacting with it allows you to cross the huge gap between the mountains.Reward: Feedback CannonType: WeaponMods: Sonic Hertz - Taking damage supercharges this rifle's power. Dealing damage expends part of this charge.Golden Ridge Rift Anomaly location #2Location: You can find another Rift Anomaly in The Outer Worlds 2 if you go east of Scrappers' Den. Follow the trenches and jump over the mines while you're at it. Eventually, you'll see a portal inside a fenced off area. The rift creates bars that prevent you from passing through, so it's better to be inside the fenced off area before you interact with it.Reward: 3x Advanced Decryption KeysNote: There's a small building here that has a jammed door. Open it using the Brawny trait or a high level of Engineering so you can grab a collectible card.Golden Ridge Rift Anomaly location #3Location: Make your way to the west of the Decommissioned Autonomous Extractorium until you spot a ravine that's crawling with dozens of Verachnids. There are actually three rifts in this area, and you have to interact with them to create ledges. Once you reach the very end, you'll be able to pick up your prize.Reward: MinigunType: WeaponMods: Spin Up - Uses ammo from your inventory and doesn't need to be reloaded. The weapon must be spun to reach its maximum rate-of-fire.That does it for our guide on the rewards of Rift Anomalies in The Outer Worlds 2. We'll keep you posted once we discover additional phenomena like these, so stay tuned. For now, though, we encourage you to acquire goodies that we've mentioned in our other articles, such as unique weapons, unique armors, unique helmets, and High Security Lockboxes.Black market smugglers? Autocratic regimes? Rampaging Raptidons? Invisible cultists that can only be seen if you wear special goggles? These shenanigans need not cause any alarm because we've got you covered in our The Outer Worlds 2 guides hub.    \n  \n                      "
  },
  {
    "title": "Pillars of Eternity Turn-Based Mode Beta Coming This Week",
    "url": "https://www.gamespot.com/articles/pillars-of-eternity-turn-based-mode-beta-coming-this-week/1100-6535900/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4595786-pillarsofeternityturnbasedmode.jpg",
    "tag": "Gaming",
    "date": "2025-11-04T00:36:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          In 2015, Obsidian Entertainment...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                In 2015, Obsidian Entertainment launched Pillars of Eternity, a party-based real-time tactical RPG. Now Obsidian is making one of the most significant changes to the game in the last 10 years by introducing a turn-based mode. And Pillars of Eternity players will be able to get their hands on it this week.On the game's official site, Obsidian announced that the public beta for Pillars of Eternity's turn-based mode will go live on November 5. The real-time combat was inspired by the system used by the game's sequel, Pillars of Eternity 2: Deadfire. The studio also released an announcement trailer for the new mode to demonstrate it in action.          According to Obsidian, the following real-time improvements were made after taking fan feedback from Deadfire.Unbound Turns: All turns are now influenced by a character’s overall speed, improving the value of Real-Time with Pause attributes and mechanics.Smarter Free Actions: Actions like swapping weapons, drinking potions, or enabling modals are now free actions. Each free action is limited to one per turn per type for balance.Faster Pacing: Combat lethality has been significantly increased for both enemies and players to keep battles tense and impactful.Mode Flexibility: You can choose Turn-Based Mode alongside difficulty when starting a new game — or swap freely between Real-Time with Pause and Turn-Based Mode in the game options. We’re also investigating a direct HUD toggle for even more convenience.As noted above, players can choose whether or not to embrace turn-based combat, or switch between real-time and turn-based at their desire. The beta test doesn't currently have an end date, but Obsidian notes that it will release future updates in support of this before adding turn-based mode to the game as a permanent feature.Josh Sawyer--who directed both Pillars of Eternity games--has suggested that if Pillars of Eternity 3 ever goes forward, it will embrace the influence of Baldur's Gate 3 and switch from an isometric perspective to a 3D-style game.Earlier this year, Obsidian released Avowed, an action-RPG that takes place in the same universe as the Pillars of Eternity games.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "SouljaBoy's New Game Console Is A Rebranded Retroid Being Sold \"Without Permission\"",
    "url": "https://www.gamespot.com/articles/souljaboys-new-game-console-is-a-rebranded-retroid-being-sold-without-permission/1100-6535896/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1647/16470614/4595601-souljagameflipisretroidpocketflip2.jpg",
    "tag": "Gaming",
    "date": "2025-11-03T19:50:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Rapper Soulja Boy is once again...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Rapper Soulja Boy is once again trying to sell a game console, this time selling what looks to be a rebranded Retroid Pocket Flip 2 under the name SouljaGame Flip.In a post on Instagram (spotted by Retro Dodo), the artist known for his 2007 hit song \"Crank That (Soulja Boy)\" can be seen showing off what appears to be a Retroid Pocket Flip 2. He said the device is actually a new SouljaGame Flip console that is \"out right now\" and can be bought from his website. He said it has \"all the games you need,\" a \"fast processor,\" and \"good graphics.\"Soulja Boy was originally selling \"his\" console for $436, over twice the $209 price the Retroid Pocket Flip 2 currently goes for on Retroid's official website. But since news began to circulate about the rebranded device and its hefty price tag, the price seems to have been slashed to $200, actually making it cheaper than buying the device directly from Retroid.The website where the SouljaGame Flip can be ordered shows images that look to be taken straight from Retroid's own website, only with some additional images showing white packaging that say SouljaGame. Even the names of the different console colors on the Soulja Boy website are the same as that of the Retroid Pocket Flip 2, including the GameCube-inspired GC color scheme. The console's store page description states the SouljaGame Flip is \"the ultimate handheld gaming console endorsed by Soulja Boy.\"Retro Dodo reached out to Retroid about the whole affair, and received an official statement that made clear Soulja Boy selling repackaged Retroid Pocket Flip 2s is not any kind of official partnership.\"This is not any kind of official licensing deal,\" Retroid said. \"He does not have permission to rebrand our products and sell them as his own. The Retroid Pocket Flip 2 is patented in the US by ourselves.\"It's currently unclear if Retroid will pursue legal action, but it's not the first time Soulja Boy has tried to sell game consoles. In 2018, the rapper sold Chinese emulators under his own label, and again in 2021 with a rebranded Game Boy-inspired handheld called the TRDR Pocket.The handheld gaming market is currently booming, with a growing retro emulation device market and the release of the Nintendo Switch 2 and Xbox-branded ROG Ally.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]