[
  {
    "title": "GameStop's \"Trade Anything Day\" Included Dead Animals And Can Of Whoop-Ass",
    "url": "https://www.gamespot.com/articles/gamestops-trade-anything-day-included-dead-animals-and-can-of-whoop-ass/1100-6536757/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4618359-screenshot2025-12-08at8.56.38%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-12-08T13:43:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          GameStop's \"Trade Anything Day\"...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                GameStop's \"Trade Anything Day\" took place on December 6 and, as expected, people brought in all manner of items to get some cash. GameStop said in a news release that it took in more than 80,000 trades across the US on December 6 alone, and people brought in lots of unexpected and usual items, including a taxidermied bobcat and goose, a speed limit sign, a Wii Netflix disc, a bowling ball, a tiny Jesus, and \"a literal can of whoop-ass.\"This was all done as a marketing campaign to raise awareness for GameStop's trade-in program. The retailer also noted that people brought in \"a significant number\" of canned food goods to support food banks and pet shelters.One person attempted to trade in their dog (presumably as a joke, we hope!) but was rejected. Another person tried to trade in their Social Security card but GameStop said no. Someone else brought in a copy of the Declaration of Independence, and GameStop seemingly accepted it.The fine print of the Trade Anything promotion mentioned that people would be limited to one trade and a value of $5. It's not immediately clear what GameStop is doing with all the items people brought.The Deptford, New Jersey GameStop location took in the most trades, at more than 250.Here are some of the notable traded items, as shared by GameStop.A bobcatA gooseA tiny JesusA full creepy doll collectionAir JordansA speed limit signComplete Friends season VHS tapesBowling ballA “happy heater”A framed dog portraitA literal can of whoop-assA Wii Netflix discNon-alcoholic cider donated to store employeesIn other news, GameStop is among the numerous retailers that are not raising Xbox Game Pass prices, so you can still buy one month of Game Pass Ultimate for $20 there. GameStop specifically has pledged that it will not raise prices, at least not yet.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Final Fantasy 7 Remake Part 3 Title Narrowed Down To Two Candidates",
    "url": "https://www.gamespot.com/articles/final-fantasy-7-remake-part-3-title-narrowed-down-to-two-candidates/1100-6536762/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4618379-ff7-revengeance.jpg",
    "tag": "Gaming",
    "date": "2025-12-08T15:34:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          What's in a name? If you're...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                What's in a name? If you're Square Enix, a lot, as the studio has yet to reveal the full title of Final Fantasy 7 Remake. That reveal could be soon, as Final Fantasy Remake Trilogy developers Naoki Hamaguchi and Tetsuya Nomura have revealed that the name for the threequel has been narrowed down to two options, with a decision expected by the end of the year.\"Me and Tetsuya Nomura have already narrowed it down to two, within the year we will decide on which one. Within this year, it will be set,\" Hamaguchi said in an interview with Julien Chièze (via a translation by Genki_JPN).          So far, the first two games in the Final Fantasy Remake trilogy have followed a similar naming convention. Remake got the ball rolling with its title, while Final Fantasy 7 Rebirth's title emphasized a new beginning for the franchise. So what could Part 3's name be if it follows this trend?Reunion might be off the table considering that it was used for Crisis Core: Final Fantasy 7 Reunion in 2022, but other names that could thematically work with the story of Final Fantasy 7 Remake Part 3 could be Reset, Reboot, Renew, Rebuild, Redo, Rewrite, Reshape, or Revival, amongst many others. Hamaguchi added that one of the keywords for development was \"Highwind\" (via Aitaikimochi), and the team is in the actual development phase of the game.Before Final Fantasy 7 Remake Part 3 lands on PC and console, Switch 2 and Xbox Series X|S owners can catch up on the saga when Final Fantasy Remake launches for both consoles on January 22, 2026. Switch 2 owners will need a lot of free space to install it, and it'll feature a new progression boost that makes the game ridiculously easy to play.Hamaguchi also recently responded to criticism about the pacing of the first two games in the trilogy, suggesting that Part 3 will be more concise with its storytelling.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Netflix Considered Buying EA - Report",
    "url": "https://www.gamespot.com/articles/netflix-considered-buying-ea-report/1100-6536751/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4618292-netflixlogo.jpg",
    "tag": "Gaming",
    "date": "2025-12-08T10:45:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          As 2025 winds down, the new...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                As 2025 winds down, the new biggest potential acquisitions of the year appear to be the $55 billion deal for EA by Saudi Arabia's Public Investment Fund and other investors and the more recent proposed $82 billion agreement for Netflix to buy Warner Bros. Studios. Now, a new report suggests that Netflix once considered buying EA and two other movie studios before the Warner Bros. negotiations came together.According to Bloomberg, Netflix executives previously debated whether the streamer should place bids for EA, Fox, and Disney. However, the management team reportedly couldn't agree on a deal and feared that its interest in those companies would hurt its standing with investors.The report doesn't include the details about when Netflix considered these acquisitions, especially since Disney is usually the company that buys other studios including Pixar, Marvel, and Lucasfilm. Disney purchased Fox's entertainment assets in 2019 following an extended approval process from government agencies around the world.Neither the Warner Bros. nor the EA deals are guaranteed to go forward, since both of them have to win regulatory approval after facing heavy scrutiny. Both, however, have major implications for the video game industry. If the EA deal is completed, Saudi Arabia's PIF will reportedly gain majority control of the company. Senators Richard Blumenthal and Elizabeth Warren have raised their concerns about \"foreign influence\" on EA. In a regulatory filling last month, EA claimed it would retain creative control of the company.As for Netflix and Warner Bros., the deal would leave the former in charge of the Mortal Kombat, Batman, and Harry Potter video game franchises. The streamer demonstrated greater ambition for the gaming industry until 2024, when it shut down a AAA multiplayer shooter from a team that included Halo and Destiny veteran Joe Staten. In October, Boss Fight--the studio behind Netflix's Squid Game: Unleashed mobile game--was closed by the streamer.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]