[
  {
    "title": "See How The Street Fighter Movie Is Embracing Its Ridiculousness In These 40 Images",
    "url": "https://www.gamespot.com/gallery/street-fighter-movie-images/2900-7343/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1597/15976769/4621980-vegahed.jpg",
    "tag": "Gaming",
    "date": "2025-12-12T19:01:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                The Street Fighter movie teaser premiered during The Game...",
    "body": "\n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                The Street Fighter movie teaser premiered during The Game Awards, and it looks like the film leans into the series' blend of flashy martial-arts action and larger-than-life characters. Even in quick cuts, the teaser gives fans their first look at familiar faces: Andrew Koji's intense Ryu, Noah Centineo's Ken, and Callina Liang's Chun-Li. There's even Cody Rhodes as Guile doing his trademark somersault flash kick.Alongside the heroes, there are also brief looks at David Dastmalchian's M. Bison being theatrical with a cape flick, Curtis \"50 Cent\" Jackson's beefy Balrog, and Joe \"Roman Reigns\" Anoa'i as the terrifying Akuma, looking like he's powering up. There's also Eric Andre as announcer Don Sauvage and professional fighter Alexander Volkanovski as Joe, from the original Street Fighter game.Here, we've created a gallery to give fans a good look at the cast's costumes, but we're still unclear about the movie's plot, so enjoy these spoiler-free images.Street Fighter is scheduled for release on October 16, 2026."
  },
  {
    "title": "Tomb Raider TV Show Will Feature Avatar's Sigourney Weaver, Role Revealed",
    "url": "https://www.gamespot.com/articles/tomb-raider-tv-show-will-feature-avatars-sigourney-weaver-role-revealed/1100-6536945/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4621991-screenshot2025-12-12at12.51.36%E2%80%AFpm.png",
    "tag": "Gaming",
    "date": "2025-12-12T17:23:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Oscar-nominated actor Sigourney...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Oscar-nominated actor Sigourney Weaver has confirmed the reports that she will appear in the upcoming live-action Tomb Raider series on Prime Video.Speaking to Deadline, Weaver said she is \"very excited\" to join the cast and work with writer-producer Phoebe Waller-Bridge on the project. \"The scripts are incredible and very funny, very charming, very witty, as we've come to expect from Ms. Waller-Bridge,\" she said. \"I've always been a huge fan of hers. So I am delighted.\"Also in the interview, Weaver revealed that she's playing a character named Wallace. It appears this may be a new character created for the show.Weaver is the third actor set to appear on the Tomb Raider show, following Sophie Turner as Lara Croft and British actor Martin Bobb-Semple in an unspecified series regular role.The Tomb Raider TV show is set to begin filming in January 2026, so it's possible we will soon learn more about the series and its cast. As for Weaver, she'll be seen next in James Cameron's Avatar: Fire and Ash, which comes to theaters on December 19.As for the game series, The Game Awards brought news of two new Tomb Raider games, including a remake of the 1996 game called Tomb Raider: Legacy of Atlantis coming in 2026 and a new game called Tomb Raider: Catalyst in 2027.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "The Last of Us' Bruce Straley Shares More Details About Why He Left Naughty Dog",
    "url": "https://www.gamespot.com/articles/the-last-of-us-bruce-straley-shares-more-details-about-why-he-left-naughty-dog/1100-6536947/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4621994-thelastofusending.jpg",
    "tag": "Gaming",
    "date": "2025-12-12T19:13:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          From 1999 to 2017, Bruce...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                From 1999 to 2017, Bruce Straley was one of the key players at Naughty Dog, and the co-director of two its best-selling games, The Last of Us and Uncharted 4. However, Straley essentially left the game industry for several years despite that impressive track record. Now, Straley is sharing more details regarding his departure, following up on comments he made years ago.\"I had been there 18 years. That's a long time for anybody to be anywhere,\" Straley told Polygon. \"I need new problems to solve, I need new creative outlets. I'm not saying there wouldn't be opportunities there, but couple that feeling with the idea that I was working really, really hard at something that wasn’t mine.\"Straley went on to explain that he didn't jump to another AAA studio because he felt Naughty Dog was the \"pinnacle\" of developers that made the games he was interested in. And he didn't want to deal with \"a whole different bureaucratic or cultural system.\"\"It really comes down to: Do you want to continue working for someone else and put in all the effort to build an IP, to build characters, to build things that a franchise could be built out of? I got paid very well there,\" added Straley. \"I got some appreciation there, but it felt like it was time to break out and try it on my own. It felt like it was time to evolve my concepts and build a new team. It might fail miserably, but I thought that it was at least my failure based on my choice.\"During The Game Awards, Straley's new team at Wildflower Interactive debuted their inaugural title, Coven of the Chicken Foot. It's a wordless single-player adventure that's completely unlike the games Straley made at Naughty Dog. Players assume control of a witch named Gertie and her creature companion as they try to fulfill her oath. The game doesn't currently have a release date.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]