[
  {
    "title": "Arc Raiders And More Dominated Steam's Holiday Sales Chart",
    "url": "https://www.gamespot.com/gallery/arc-raiders-and-more-dominated-steams-holiday-sales-chart/2900-7387/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4630771-arcraidersduos.jpg",
    "tag": "Gaming",
    "date": "2026-01-06T22:43:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                December 2025 was a record-breaking month for Steam, with...",
    "body": "\n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                December 2025 was a record-breaking month for Steam, with approximately $1.6 billion in gross revenue during the holiday season. While that success is shared among several games, the big winner of the holidays was Arc Raiders.Alinea Analytics has shared its estimated Steam sales figures for the holiday period beginning on December 21 and ending on January 5. During that time, the company estimates Arc Raiders sold 1.2 million copies on Steam, bringing its total on the platform to 7 million and 12 million across all platforms.The report attributes the continued domination of Arc Raiders to the holiday season and the 20% discount that came with it. Discounts also powered a few other surprising titles on the list. Detroit: Become Human landed at No. 2 over the holidays with 993,000 because its price dropped to only $4, which was down 90% from the game's normal $40 price tag.Even Battlefield 6--one of this year's top-selling games across all platforms--benefited from a timely holiday discount of 30%. That allowed it to place at No. 4 with 706,000 copies on Steam during the holidays.Alina's complete breakdown of the best-selling games on Steam during the 2025 holiday season is included below. Some of the games are still on sale at Steam and Fanatical.GameSpot and Fanatical are both owned by Fandom."
  },
  {
    "title": "Brandon Sanderson Teases Potential \"AAA\" Mistborn Video Game",
    "url": "https://www.gamespot.com/articles/brandon-sanderson-teases-potential-aaa-mistborn-video-game/1100-6537216/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1690/16904437/4630685-1975301208-45183.png",
    "tag": "Gaming",
    "date": "2026-01-06T19:18:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Mistborn fans may be able to...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Mistborn fans may be able to take to the virtual streets of Luthadel eventually, but not for a while. As part of the yearly \"State of the Sanderson\" blog post, author Brandon Sanderson shared that he has been in conversations with multiple AAA developers about a potential Mistborn project. If the project does come to fruition, it will be years away.Sanderson seems to be optimistic about the project's chances. He wrote, \"I feel I’m finally getting established enough that we can make a Mistborn game happen. ... This is at Step One only, but it’s an encouraging One.\" Though he doesn't name any names, he does claim that he has been chatting with big players in the industry, including ones he is a fan of himself. Sanderson is also seeking maintain his rights to video game adaptations of Mistborn.It appears that these discussions are in the earliest possible stage. \"These rights were tied up with the film rights for the last... oh, six-seven years,\" Sanderson wrote, \"so I didn’t get to test the market on them until recently.\" Sanderson concluded that any studio or publisher interested in developing a Mistborn or Stormlight project should get in touch with his representatives.Mistborn is one part of Brandon Sanderson's sprawling Cosmere setting, which also encompasses the Stormlight Archive series. Multiple tabletop games based on Sanderson's work have emerged in recent years, including Cosmere tabletop RPGs and a Mistborn deckbuilder.Sanderson himself has some professional experience related to video games. He designed the world and created characters for the tactics game Moonbreaker. Should this project release, it would not be Mistborn's first foray into video games. A project called \"Mistborn: Birthright\" was in development for a few years before being canceled. Protagonist Kelsier was a guest character in Fortnite, owing to Sanderson's long-standing relationship with Epic.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Animal Crossing Island Transfer Tool: How To Move Your New Horizons Saves To Switch 2",
    "url": "https://www.gamespot.com/articles/animal-crossing-island-transfer-tool-how-to-move-your-new-horizons-saves-to-switch-2/1100-6537193/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/679/6794662/4629795-screenshot2026-01-05161038.png",
    "tag": "Gaming",
    "date": "2026-01-06T19:15:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Animal Crossing: New Horizons...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Animal Crossing: New Horizons made a huge impact on the world of cozy gaming back in 2020, and it's about to make a big resurgence. With the game now available on both the original Switch and the Switch 2 (with an even more upgraded Switch 2 Edition landing January 15), Nintendo's flagship cozy game is back. Whether you've been playing consistently since launch, or want to dive back in and see what your villagers have been up to over the past few years, you may be looking to make your grand entrance on a shiny new Switch 2. Doing so, though, will require you to first move your island to Nintendo's newest console. Here's how to do so using the Animal Crossing island transfer tool.How to transfer your Animal Crossing: New Horizons island to Switch 2When setting up your Switch 2 for the first time, you can use the onboard system transfer to move most of your save files to your new console, but New Horizons is an exception that requires a special process. For New Horizons, you'll need the island transfer tool, which is a free download in the Nintendo eShop. You'll also need the Switch console that your island save data was previously on.The Island Transfer Tool is required to move your save file to a Switch 2.To get started transferring your Animal Crossing: New Horizons island, you'll have to head to the eShop and download the Animal Crossing Island Transfer Tool on your Switch and Switch 2. When the transfer tool has been downloaded on both consoles, you'll be able to begin.Note the information below before proceeding:This process moves your save file, not copies it. This means your island will not be available to visit on the original system once the transfer is complete.You will need to download the Happy Home Paradise DLC on the new system to access any content related to this expansion.Airplane Mode must be turned off on both consoles to begin the transfer.The game must be updated to the newest software version on both consoles.With all of that out of the way, you can begin the transfer process following the steps below:Load the Island Transfer Tool on both systems.Select Continue and Let’s Begin on both systems.Select Source on the source (original) system, then Yes when the name of your island or console is displayed.Select Target on the Switch 2.Select Continue on the source system.Select Proceed on the Switch 2.Select Transfer Data on the source system.Select Proceed on the Switch 2 to begin the transfer.Follow the instructions to move your save file to a Switch 2.When the transfer is finished, you'll find that the save data will no longer be available on the source system, but you will be ready to begin playing New Horizons on your Switch 2. That being said, the save data can be transferred back to the source system and removed from the Switch 2 if you ever have a need to do so.Animal Crossing: New Horizons is available now on Nintendo Switch and Nintendo Switch 2.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]