[
  {
    "title": "Arc Raiders Introduces Hilarious New Fix For Locked Room Exploits: Burn Everything",
    "url": "https://www.gamespot.com/articles/arc-raiders-introduces-hilarious-new-fix-for-locked-room-exploits-burn-everything/1100-6536614/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4614149-arc-raiders-flames.jpg",
    "tag": "Gaming",
    "date": "2025-12-01T17:27:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Arc Raiders players recently...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Arc Raiders players recently discovered an exploit that allowed them to loot locked rooms without needing a keycard. Naturally, the exploit quickly became popular--and frustrating for players who didn't use it--leading Embark Studios to apply a \"hot\" fix to this part of the game. If you now decide to cheese your way into one of these treasure rooms, you can now expect a toasty reception inside.Using a keycard to access one of these rooms ties into the high-risk, high-reward nature of Arc Raiders, but the exploit essentially bypasses it. Players managed to break into the room, grab valuable gear without worrying about being ambushed, and pick the location clean. This meant that players who unlocked the room properly would find it stripped bare, leading to frustration within the Arc Raiders community.To remedy this, Embark Studios made it so that the rooms automatically activate flamethrowers when you glitch into them. Players quickly found out that they would be caught inside this deathtrap, while other players with keycards would discover a room full of loot and a freshly cremated adventurer.Arc Raiders has been a big hit since launch, selling millions of copies and hitting a peak player count of 481,966 raiders on Steam. Embark Studios has regularly updated Arc Raiders, fine-tuning the gameplay and nerfing overpowered perks.\"Arc Raiders is an extraction shooter unlike any other, a totally unpredictable, immersive, thrilling story generator directed by the community,\" Mark Delaney wrote in GameSpot's Arc Raiders review.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "See The New Black Ops 7 Maps For Call Of Duty Season 1",
    "url": "https://www.gamespot.com/articles/see-the-new-black-ops-7-maps-for-call-of-duty-season-1/1100-6536612/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1639/16394540/4614146-bo7season1sticksandstones.jpeg",
    "tag": "Gaming",
    "date": "2025-12-01T17:10:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Season 1 arrives to Call of...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Season 1 arrives to Call of Duty: Black Ops 7 and Warzone this week, and the first season of content adds plenty of new multiplayer maps. Activision has released a new Black Ops 7 video to showcase the four maps arriving with the launch of Season 1, including three brand-new maps and one remastered.          There are seven maps total for Season 1 of Black Ops 7. Four maps arrive with the season's launch on December 4, and three additional maps are included for a midseason update. As shown in the trailer above, Activision gives a flyover of each map, highlighting main points-of-interests for Fate, Utopia, Odysseus, and Black Ops 7's remaster of Standoff from Black Ops 2.Utopia is a brand-new map set at a futuristic Guild research facility based in Australia. This is a medium-sized map for standard 6v6 modes.Fate is a brand-new map inspired by the game's campaign mission called Time and Fate, which leans into the story's mind-bending visuals with the fractured and floating building pieces from a city in Nicaragua. This is a small map designed for standard 6v6 modes.Odysseus is another new multiplayer map inspired by the campaign. This map takes the fight into the interior of the aircraft carrier featured during Mike Harper's hallucination in the campaign mission called Fractured. Odysseus is a small map designed for standard 6v6 modes and 2v2 Gunfight.Lastly, the popular Standoff map returns to Call of Duty. The map looks mostly faithful to the original with updated graphics, and this is a medium-sized map for standard 6v6 modes.Call of Duty Season 1 brings the first battle pass to Black Ops 7, seven DLC weapons to unlock, and a new Zombies map. The big update also includes Black Ops 7's integration into Warzone, and it adds the Haven's Hollow Resurgence map.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Bayonetta 3 Actor Says She Was \"Thrown Under The Bus\" After Recasting",
    "url": "https://www.gamespot.com/articles/bayonetta-3-actor-says-she-was-thrown-under-the-bus-after-recasting/1100-6536607/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4614079-bayonetta3.jpg",
    "tag": "Gaming",
    "date": "2025-12-01T16:43:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          In 2022, Jennifer Hale was...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                In 2022, Jennifer Hale was confirmed as the new voice of Bayonetta in Bayonetta 3, following the departure of the character's original voice actress, Hellena Taylor. The recasting of Taylor and the subsequent controversy dogged Hale during the production of that game, and it's an experience she didn't enjoy despite her love for the character. During an interview with GAMINGbible, Hale indicated that she would \"love to play Bayonetta again,\" but she wasn't happy about the situation she found herself in.\"I definitely got thrown under the bus by that whole thing, and I was unable to speak on my own behalf because I was under not one but two NDAs,\" recalled Hale. \"Eventually, I was allowed to make a statement, which I appreciated, and I was able to present the facts.PlatinumGames made the call to replace Taylor, who responded by telling fans to boycott Bayonetta 3. Taylor also contended that she had only been offered $4,000 to reprise the role she originated. At the time, Hale noted that she was under an NDA and unable to properly respond. In a subsequent statement, Taylor acknowledged that she was offered $15,000 to record her role over multiple recording sessions, but she asked for $250,000 and was turned down. Taylor added that the $4,000 offer for a single session came in after her $15,000 offer. \"There were some things said [that were] presented as facts, but were false,\" Hale told GAMINGbible. \"I would have never taken a role otherwise. Before I accepted the audition, I checked everything thoroughly, and I trust the director. Thankfully, playing Bayonetta was so much fun, and the community was so welcoming to me, especially after the fiasco had passed and the facts came out. But it was not fun getting thrown under the bus like I had, but I was happy to come out on the other side.\"During the same interview, Hale noted that she has no idea what's happening with the remake of Star Wars: Knights of the Old Republic. Hale voiced Bastila Shan in the first two games. Hale also starred in the Mass Effect trilogy as FemShep, the female incarnation of Commander Sheppard depending on player choices. She is currently voicing Jean Grey in X-Men '97 on Disney+. That series was recently renewed for Season 3, and X-Men '97 Season 2 will premiere in Summer 2026.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]