[
  {
    "title": "These Were The Top 15 Most Popular Games Last Week In The US",
    "url": "https://www.gamespot.com/gallery/these-were-the-top-15-most-popular-games-last-week-in-the-us/2900-7295/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4627192-screenshot2025-12-22at11.15.26%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-12-29T17:11:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                The numbers are inEach week, Circana analyst Mat Piscatella...",
    "body": "\n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                The numbers are inEach week, Circana analyst Mat Piscatella shares data that reveals the top 15 titles in the US ranked by total weekly active users across PS5, Xbox Series X|S, and Steam. The lists come from Circana's Player Engagement Tracker, and to be sure, this tracks weekly active users, not concurrent users.Which games were the most popular for the week that ended December 12? Fortnite ranked No. 1 on PlayStation and Xbox, while Arc Raiders was the most popular game on Steam. Those are the same results for last week, so nothing changed up top.One of the big movers week-over-week was Clair Obscur: Expedition 33. On Steam, the game returned to the top 15, landing at No. 13 (up from No. 20 last week), while the game ranked No. 39 on Xbox for the past week (up from No. 60) and No. 53 on PS5 (up from No. 68). - Clair Obscur: Expedition 33 returned to the top 15 on Steam US & CAN. - CO:E33 ranked 39th on US XBX (up from 60th the week prior) and 53rd on US PS5 (up from 68).Read on to see all the most popular games below for the week that ended December 20, as shared by Piscatella."
  },
  {
    "title": "Games Want You To Play Forever, But Dispatch Tells You When To Stop",
    "url": "https://www.gamespot.com/articles/games-want-you-to-play-forever-but-dispatch-tells-you-when-to-stop/1100-6537045/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4625575-dispatch-4.jpg",
    "tag": "Gaming",
    "date": "2025-12-27T21:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.  As live-service games go on and on into eternity, the episodic game...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \nAs live-service games go on and on into eternity, the episodic game structure is the perfect way to know just when to put down the controller.By \n    Matt Kim\n   on December 27, 2025 at 1:00PM PST\n              \n                Is there a more infamous monkey-paw wish than the collective dream that all our favorite games could last forever? Well, the finger curled, because it seems like all major game publishers in the world only want to make games that go on to infinity.With the rise of live-service games, it's been a struggle to know when to put the controller down, especially when games like Fortnite release seasonal content like The Simpsons season pass that ask you to play long enough to unlock stupid sexy Flanders. Luckily, for us, episodic games, perfectly portioned into bite-sized morsels, have come back to rescue us from the endless grind.In this case, I am talking specifically about Dispatch, the new episodic superhero game from AdHoc Studio. If the name is unfamiliar to you, AdHoc is a new game company founded by former members of Ubisoft, Night School, and perhaps most notably, Telltale Games, who blew up the episodic gaming scene with 2012's The Walking Dead. The studio would later close due to a variety of factors internal and external, some of which I covered previously as a reporter. But by then, the episodic-games formula was starting to feel a bit played out, and the mood appeared to be shifting towards either more complete single-player experiences, or the early live-service games we know today.But nowadays, the people yearn for games that deliver the sense of accomplishment when hitting credits, but also don't require the kind of time investment most games demand. Dispatch perfectly models itself after the cable TV shows of old, with each episode adhering to a winning formula that never overstays its welcome.Set in a modern-day Los Angeles — except in this version of the city, there are actual superheroes working together at a private security firm — Dispatch is best understood as a workplace comedy. Think The Office crossed over with The Boys. Players are asked to make both small and large choices as the hero, Robert Robertson III, which will not only determine his personality, but have big ramifications for how the story plays out. A short intro sets the stage for the episode's plot, while in the middle is an interactive dispatching sim, followed by a big finale, a needle drop, and roll credits. A little formulaic, but so was television during the pre-prestige TV era.Furthering the TV connection, Dispatch's fully voiced storyline has a wonderful cast of TV alumni including Breaking Bad's Aaron Paul, Westworld's Jeffrey Wright, and thanks to a partnership with Critical Role, fan-favorite voice actors like Laura Bailey and Matt Mercer.For the past week, playing Dispatch became a nightly ritual where after dinner, I'd retreat into the office for a single episode's worth of Dispatch before returning to the living room to do something else for the evening. Just like a TV season, Dispatch is broken up into eight episodes, each about an hour, not including end credits. While there is always the urge to keep pushing forward and play right into the next episode, each section felt so perfectly calibrated for a single session of gaming that I could leave the next episode for the next night and not feel a pang of anxiety or FOMO. If anything, I could take the time to think over the choices I made in the previous episode, many of which feel weighty and substantial.I don't want to give the wrong impression about Dispatch by constantly comparing it to TV. Dispatch is first and foremost a game, and a damn good one too. The hero-dispatching sim alone is worthy of praise, and, ironically, something I could play endlessly. But there's a confidence in direction that oozes from Dispatch. They know just when to hit you with the credits, knowing full well you will feel satisfied leaving the game until the next week when new episodes are set to drop.The combination of talent, writing, and production in Dispatch all come together into a potent mix--a truly satisfying one too, which is not a description I've used for many games this year. You should read GameSpot's positive review of course, but Dispatch has seemingly hit the perfect chord with players to the tune of 2 million copies sold. A major success for a new IP from a brand-new studio, and while I could go on about all the ways Dispatch has become a surprise hit of the year for me, the best thing about my time with it has been, well, that I spent a pretty short amount of time with it. Or rather, I spent the perfect length of time with it.\n                                                              \n              \n  Got a news tip or want to contact us directly? Email news@gamespot.com\n    \n    "
  },
  {
    "title": "Arc Raiders Battle Pass 2 - All Goalie Raider Deck Rewards",
    "url": "https://www.gamespot.com/gallery/arc-raiders-battle-pass-2-all-goalie-raider-deck-rewards/2900-7345/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/679/6794662/4622067-eyeqw-sr.jpeg",
    "tag": "Gaming",
    "date": "2025-12-26T18:21:00.000Z",
    "description": "By     Billy Givens   on December 26, 2025 at 10:21AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Billy Givens\n   on December 26, 2025 at 10:21AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Arc Raiders has already seen quite a few updates since its launch at the end of October, but developer Embark Studios is closing the year out big. The Cold Snap update brings multiple seasonal events, a new Snowfall map condition, and plenty more for fans to sink their teeth into. Among the fresh additions is the Goalie Raider Deck--the game's second battle pass--which contains a smorgasbord of cosmetics, gear, items, and even Raider Tokens that can be used toward premium purchases in the shop.The Goalie Deck is free for all players, so you won't need to purchase access to these rewards with premium currency. Instead, you'll simply need to work toward completing daily Feats that provide you with Creds, then use those to unlock your preferred items from the deck. This should prove fairly easy to do for most players, as you can complete up to three Feats per match, and you'll even get additional bonus Creds for the first five Feats you finish in a day.Perhaps the best news about the Goalie Deck, however, is that it's a permanent reward track. Unlike battle passes in other games, this deck will stick around forever, meaning you can unlock what you want from it whenever you'd like. With this in mind, you can skip any rewards that just don't matter much to you right now--though it's worth pointing out you will still need to purchase a certain number of items from the deck to unlock subsequent pages.If you're excited to dive into the Goalie Deck and start reaping its rewards--including the new hockey-themed outfit, which is pretty rad--we've got you covered ahead of time. Keep scrolling below for every reward from the Goalie Deck in Arc Raiders.    \n  \n                      "
  }
]