[
  {
    "title": "Animal Crossing: New Horizons - Everything New In Update 3.0",
    "url": "https://www.gamespot.com/gallery/animal-crossing-new-horizons-everything-new-in-update-3-0/2900-7399/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1639/16394540/4633949-acnhscreenshot3.jpg",
    "tag": "Gaming",
    "date": "2026-01-12T20:04:00.000Z",
    "description": "By     S.E. Doster   on January 12, 2026 at 12:04PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    S.E. Doster\n   on January 12, 2026 at 12:04PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Animal Crossing: New Horizons is getting new content for the big 3.0 update arriving on January 15. This is a free update that brings new activities to the island and offers more ways to play with friends. There are even major collaborations with Lego, Splatoon, and The Legend of Zelda. In this guide we'll highlight everything you need to know about Animal Crossing: New Horizons 3.0 update, including details about the new Resort Hotel and customizable islands for multiplayer.If you are a new player or someone returning after a long hiatus, make sure you check out our complete guide hub for Animal Crossing: New Horizons. This offers starter tips, help with various features, and information on how to upgrade locations.Slumber IslandsWhen your Villager goes to sleep, they can now choose the option \"slumber time\" to go to a new dream world introduced in the 3.0 update.Luna's Dream World lets you fully customize a brand-new island with items you've previously obtained in game. You can build up to three Slumber Islands and choose from three different island sizes.With Slumber Islands, you'll be able to exercise more creative freedom than ever before. You can alter the terrain to remove cliffs and widen rivers to your liking. You'll also have the option to place inclines and bridges. You're not tied to real-world time and weather in Slumber Islands, either. Instead, you can customize these details to create the look you want for your island.One of the biggest highlights of Slumber Island is that you can invite or join friends to customize islands together. It's worth noting that you will need a Nintendo Switch Online subscription for online play.The Resort Hotel facilityAnother big feature for 3.0 is the Resort Hotel. This new building is located at the end of the pier of your standard island and gives you a variety of guest rooms to decorate.This waterfront hotel is run by Kapp'n and his family, and they want you to help decorate rooms to entice guests to stay. You'll earn Hotel Tickets for each room you decorate, a brand-new currency that is used to buy exclusive items added with the big update.Fashion opportunitiesIf you're a fashionista, you can also plan and suggest outfits for the hotel guests to wear during their stay. You can style and place outfits on hotel mannequins that will then be available for both you and your guests to wear.Hotel promotionAs always, Tom Nook finds a new opportunity to make some Bells in the 3.0 update. He sees potential in the new Resort Hotel, but he wants your help to promote it. Craft special DIY items for him, and he'll reward you with more Hotel Tickets.Increased home storageThe game's previous storage limit was 5,000, but the 3.0 update will expand storage with two additional upgrades for a maximum of 9,000 items. You'll also be able to store trees, flowers, and shrubs.The prices haven't been revealed yet, but if they're similar to the 2.0 update, you can expect to spend around 900,000 Bells and 1,200,000 Bells per upgrade.Resetti's Reset ServiceIt's finally time for easier island clean up. This update introduces Resetti's Reset Service, a new feature that gives you the ability to clear out flowers, furniture, and more in bulk.This new cleaning service lets you pick a specific area for Resetti to clean, though you can also ask him to clean the entire island or limit it to just the beach area. You can also ask him to place items in storage after he cleans up. This means if you have a messy flower bed, but don't want to lose all your flowers, he can both remove and save them for you.Nintendo itemsAs you help the Resort Hotel, the building's souvenir shop will eventually start selling Nintendo items. You can purchase these exclusive items with the Hotel Tickets you earn.These items include retro Nintendo consoles to decorate your home. If you have a Nintendo Switch Online subscription, you can even play a retro game on each of the consoles you buy. This includes playing classics such as Dr. Mario and Ice Climber.Lego collabIn addition to Nintendo items at the souvenir shop, you can also purchase Lego-themed items from the Nook Shopping app. This will let you decorate your home with Lego brick furniture, such as a sofa, bed, or fireplace. There is also Lego wallpaper and a t-shirt. These items all come in a variety of colors, so you can find something brick-themed to match your style.Legend of Zelda and Splatoon crossoversYou'll be able to add four Nintendo characters with Update 3.0, if you have their amiibo cards: Mineru and Tulin from The Legend of Zelda: Tears of the Kingdom, and Cece and Viché, who are inspired by Callie and Marie from Splatoon.Tapping their amiibo cards will let you invite them to your island, and it will also unlock unique items in Nook Shopping.    \n  \n                      "
  },
  {
    "title": "Speedrun Charity Awesome Games Done Quick 2026 Raised Over $2.4 Million For Cancer Research",
    "url": "https://www.gamespot.com/articles/speedrun-charity-awesome-games-done-quick-2026-raised-over-2-4-million-for-cancer-research/1100-6537336/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/313/3136061/4634124-agdq.jfif.jpg",
    "tag": "Gaming",
    "date": "2026-01-12T23:54:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                              Every January since 2010,...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                Every January since 2010, Games Done Quick has raised money for charity through their speedrunning marathon event Awesome Games Done Quick (AGDQ). Their 2026 marathon, held at the Wyndham Grand in Pittsburgh, Pennsylvania, has just wrapped up, and has raised a huge sum of money.In a post on the Reddit, one of the event's organizers has revealed that Awesome Games Done Quick 2026 has raised $2,443,414 for the Prevent Cancer Foundation, which focuses on early detection and prevention of cancer. In total, Games Done Quick has now donated over $28 million to the Foundation of the $59 million in total the streams have raised for charity.Some highlights of this year's schedule of speedruns included some incredible performance in Mario Kart World's Free Roam mode, as well as a relay run of Super Mario 64 where 70 players collected one star each. There's also an incredibly fast run of Hollow Knight: Silksong, a five minute Chrono Trigger run, and a particularly epic speedrun of Pokemon Emerald that is worth a watch.          You can check out the entire collection of runs on Reddit if you want to see some extremely impressive performances.The next major charity stream from Games Done Quick will be Summer Games Done Quick, which will be held July 5-11. Awesome Games Done Quick has also been confirmed for 2027, and will be held in Atlanta from January 3-9.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n\n            \n    "
  },
  {
    "title": "Arc Raiders Prescriptions Of The Past Quest Guide",
    "url": "https://www.gamespot.com/articles/arc-raiders-prescriptions-of-the-past-quest-guide/1100-6537310/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/679/6794662/4633293-share_20260110_0326021.jpeg",
    "tag": "Gaming",
    "date": "2026-01-12T19:50:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          If you've been working through...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                If you've been working through Lance's quests in Arc Raiders, you've probably come across Prescriptions of the Past, wherein this quirky trader sends you off to round up anything useful in the Medical Exam Room of the Departure Building. And with that, you'll be off to Spaceport.Extracting isn't a requirement for completing Prescriptions of the Past, but it is a high-traffic area. If you're a pretty peaceful player, you may want to bring in a free loadout so you don't sacrifice good loot if someone picks a fight you're not interested in entertaining. Alternatively, if you're feeling froggy, bring some good guns and plenty of ammo to introduce to any PVPers in the vicinity.Either way, when you're ready to wrap up Prescriptions of the Past, follow the guide below.Visit the Departure Building in SpaceportThe Departure Building is located on the west side of Spaceport. This POI is known to contain a lot of searchable drawers and containers, making it a popular destination for raiders seeking a high chance at good loot. With that in mind, keep your eyes peeled for any shady characters looming about with their guns out.Departure BuildingFor the most straightforward approach, head into the Departure Building from the north through the main entrance.Enter the building from the north.When you enter the building, you should receive an updated objective asking you to find the Medical Exam Room.Find the Medical Exam Room inside the Departure BuildingOnce you're inside the Departure Building, head up the stairs to the right. Take the stairs up and around to the next floor.Follow this staircase to the right to reach the next floor.Take a left at the top of the stairs.At the top of the stairs, break left immediately, then enter the nearby door on the left. This is the Medical Exam Room.You should now be prompted to search for some records.Search for the recordsOnce you're in the Medical Exam Room, walk forward past the examination tables until you reach a desk containing some papers.Interact with the records to finish the quest.Interact with these papers to knock out the last part of the quest. With that done, you're now free to extract. However, since the Departure Building is such a high-quality spot for loot, we'd recommend you stick around and sift through all the drawers and such across both floors of the building--provided another raider hasn't already beat you to it.For more, check out our full Arc Raiders quest list, or take a look over the comprehensive Arc Raiders guides hub.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]