[
  {
    "title": "Phasmophiobia's New Haunted Diner Map Arrives In November",
    "url": "https://www.gamespot.com/articles/phasmophiobias-new-haunted-diner-map-arrives-in-november/1100-6535531/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4586747-phasmophobia.jpg",
    "tag": "Gaming",
    "date": "2025-10-18T22:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Phasmophobia developer Kinetic...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Phasmophobia developer Kinetic Games has revealed a new map for the game, set inside an abandoned restaurant. The location--Neil's Diner--was unveiled during a TwitchCon panel that celebrated the recent fifth anniversary of the co-op horror game, and players can explore it starting November 11.Kinetic Games described Neil's Diner as a \"run-down, retro restaurant\" that's been long-abandoned by staff and diners alike. While this is one of the smaller maps in Phasmophobia, it's still full of authentic details and phantoms hungry for thrills.\"We always thought a diner would fit perfectly, so Nell's was born, and it's been such a fun challenge bringing it to life,\" lead developer Daniel Knight said in a press release. \"Alongside the farmhouse reworks from this year, Nell's is an example of how we want all the maps in Phasmophobia to feel going forward. It's unique, and has been meticulously designed to tell more of a story to our players--beyond the immediate ghost they’re hunting.\"Phasmophobia will be releasing into version 1.0 next year, but this is just the start of Kinetic's big plans for its hit game. An upcoming overhaul--dubbed Horror 2.0--will release alongside the 1.0 launch, and the studio says that the update will make Phasmaphobia feel like a new game. Hollywood is also calling, as production company Blumhouse--Five Nights at Freddy's, Paranormal Activity, The Purge, and Insidious--is adapting the game for the big screen.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Lego Technic McLaren F1 Race Car Retires Soon, Save $72 At Amazon Before It's Gone",
    "url": "https://www.gamespot.com/articles/lego-technic-formula-1-mclaren-retiring-soon-amazon-and-target-deal/1100-6520600/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4250974-lego-mclaren.jpg",
    "tag": "Gaming",
    "date": "2025-10-20T05:21:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               If you like Lego Technic and Formula 1, you'll want to check out the incredible deal on the popular McLaren race car model kit this week. The 1,432-piece Lego Technic McLaren Formula 1 Race Car is discounted to only $128 (was $200) at Amazon and Target. The $72 discount is technically available through Saturday, October 25, but we'd expect both retailers to sell out before then. During Walmart's July deals event, the retailer had this same set for $125, and it didn't stick around for more than a day or two.This could very well be your last opportunity to buy the Lego Technic McLaren for a low price, too. The set is marked as \"retiring soon\" on the Lego Store--it's full price directly from Lego--which means when Amazon and Target sell out, they may never restock the McLaren again. In the coming weeks or months, the McLaren will only be available from third-party resellers. If you miss out on the McLaren deal or are interested in picking up smaller F1 Lego sets, all 10 Lego Speed Champions Formula 1 Race Cars are on sale for new low prices at Amazon.Both retailers have great deals on two other large Lego Technic building sets that are retiring soon. The 1,478-piece Yamaha MT-10 Motorcycle is $192 (was $240), and the 1,913-piece NASA Apollo Lunar Roving Vehicle LRV is down to $176 (was $220).                                 Lego Technic McLaren Formula 1 Race Car (1,432 Pieces)                                                                $128 (was $200)                                                                                                                                                                                    Based on the 2022 McLaren F1 Race Car with an orange and blue color scheme, Lego's replica model was created in partnership with McLaren Racing. The real car was designed at the same time as the model. The Lego version authentically recreates the V6 cylinder engine and has movable parts, including the pistons, steering wheel, wheels, and suspension. Lego even ensured the McLaren's open differential system for moving around corners was implemented in the model.The completed model is 5 x 25.5 x 10.5 inches, so make sure you have open shelf space before you piece it together.Lego Technic models designed for adults and collectors are generally more complex and nuanced builds than the typical Lego set for adults. The McLaren is one of the most advanced Formula 1 models in Lego's lineup. It launched back in 2022, long before Lego and Formula 1 teamed up to create the expansive series of F1 models and playsets. The McLaren has remained popular since its debut, which explains why it had remained in print for 3.5 years.                       Lego Technic McLaren F1 Race CarLego greatly expanded its partnership with Formula 1 earlier this year with 10 Speed Champions F1 race cars and several playsets in the Lego City series. Amazon recently restocked its exclusive Ultimate Formula 1 Collector's Pack, which comes with all 10 Speed Champions F1 cars. The Amazon-exclusive bundle is available for $264.20 (was $270) and comes with an exclusive poster. That said, you'd actually pay less buying each Speed Champions vehicle separately right now, because all 10 cars are discounted by around five bucks.Lego Speed Champions: F1 Race Car DealsOracle Red Bull Racing RB20 (251 pieces) -- $22.56 ($27)Ferrari SF-24 (275 pieces) -- $22.56 ($27)Mercedes-AMG F1 W15 (267 pieces) -- $21.55 ($27)Kick Sauber F1 Team C44 (259 pieces) -- $21.59 ($27)McLaren F1 Team MCL38 (269 pieces) -- $22.56 ($27)Aston Martin Aramco F1 AMR24 (269 pieces) -- $21.55 ($27)BWT Alpine F1 Team A524 (258 pieces) -- $21.55 ($27)Williams Racing FW46 (263 pieces) -- $21.59 ($27)Visa Cash App RB VCARB 01 (248 pieces) -- $21.59 ($27)MoneyGram Haas F1 Team VF-24 (242 pieces) -- $22.56 ($27)Lego also launched the F1 equivalent of a minifigure collection. The Lego F1 Mini Race Car series includes 12 officially licensed vehicles. You can buy a mystery box with six F1 Mini Race Cars for only $20 (was $30).                                                                                                                                                                               Lego Technic McLaren F1 Race Car Retires Soon, Save $72 At Amazon Before It's Gone                         Pokemon TCG Amazon-Exclusive Holiday Premium Collection Is Back In Stock                         Get 10 Shudder Original Horror Movies On Blu-Ray For Only $51                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 ROG Xbox Ally X In Stock At Best Buy On Launch Day, Ships Immediately                         Pokemon Nintendo Switch 2 Console Bundle Restocked At Amazon On Launch Day                         Lego Transformers Bumblebee Gets First Solid Price Cut At Amazon                         Two Xenoblade Chronicles Games Get Rare Discounts At Amazon                         Magic: The Gathering Spider-Man Booster Box Is Only $140 At Amazon    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n\n            \n    "
  },
  {
    "title": "ROG Xbox Ally X Is Good, But Has Issues",
    "url": "https://www.gamespot.com/videos/rog-xbox-ally-x-is-good-but-has-issues/2300-6466457/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1862/18620770/4587217-review_rogxboxallyx_v1.jpg",
    "tag": "Gaming",
    "date": "2025-10-18T18:00:00.000Z",
    "description": "Click To Unmute        We Don't Know what Pokemon Look Like | Kurt and Lucy Gotcha CoveredPokemon Legends: Z-A - 19 Things I Wish I Knew Before StartingVampire: The Masquerade - Bloodlines 2 - ReviewKeeper...",
    "body": "          Click To Unmute\n        We Don't Know what Pokemon Look Like | Kurt and Lucy Gotcha CoveredPokemon Legends: Z-A - 19 Things I Wish I Knew Before StartingVampire: The Masquerade - Bloodlines 2 - ReviewKeeper ReviewGhost of Yotei Ending Explained With Creative Director and Co-DirectorSuper Meat Boy 3D. Its good... BUT | Hands-On PreviewBattlefield 6 Good Company - Full ReviewPokemon Legends: Z-A Review - A Battle RevolutionTwo Point Museum x Vampire Survivors Trailer | Free Update OUT NOW!Escape From Duckov - Official Launch TrailerVampire: The Masquerade - Bloodlines 2 Everything To KnowNinja Gaiden 4 Everything To Know\n        Want us to remember this setting for all your devices?\n      Sign up or Sign in now!\n      \n      Please use a html5 video capable browser to watch videos.\n    \n      This video has an invalid file format.\n    00:00:00Sorry, but you can't access this content!Please enter your date of birth to view this video\n        By clicking 'enter', you agree to GameSpot's\n                        Terms of Use and\n        Privacy Policy"
  }
]