[
  {
    "title": "Digimon Adventure Original Series Gets Rare Price Cut For Black Friday",
    "url": "https://www.gamespot.com/articles/digimon-adventure-original-series-gets-rare-price-cut-for-black-friday/1100-6532173/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4507925-digimonadventure.jpg",
    "tag": "Gaming",
    "date": "2025-11-26T04:48:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                                                                                                                                                               Digimon fans can save big on the original Digimon Adventure TV series in Amazon's Black Friday sale. The English-dubbed Blu-ray edition of Digimon Adventure: Season 1 is on sale for $48 (was $80). Deals on Digimon Adventure tend to sell out fast, and the English dub version typically sells for anywhere from $64 to full price. Season 1 hasn't been priced this low in nearly six months.The perfect deal to pair Season 1 with is Digimon The Movies 1-3 Collection, a prequel to the TV series featuring newly restored, uncut versions of the first three Digimon films. Digimon The Movies 1-3 Collection is on sale for an all-time low price of $18 (was $30). Amazon's Black Friday sale also includes Digimon Adventure 02: The Beginning on Blu-ray for $14.49 (was $27).                                 Digimon Adventure: Season 1 (English Dub) (Blu-ray)                                                                $48 (was $80)                                                                                                                                                                                    Digimon Adventure: Season 1 collects all 54 episodes from the original 1999 TV series across four Blu-ray discs. The total runtime is over 18 hours. Like many Discotek Media's Blu-ray releases, Digimon Adventure was restored with a high-definition upgrade. The show is still presented in its original 1.33:1 aspect ratio, otherwise known as 4:3, just with a 1080p makeover.The much-improved picture is complemented by the crisp DTS-HD MA 2.0 audio track. It's the same highly rated English dub that aired on the now-defunct Fox Kids channel, which means there are just as many bizarre and hilarious jokes as you remember. Optional English closed captioning is available for all episodes.Bonus features include the usual clean openings/endings, alternate versions of episode previews, episode ending cards, trailers and commercials, and a gallery with hundreds of behind-the-scenes production art.Discotek Media released the Blu-ray restoration of Digimon Adventure: Season 1 in December 2022 and followed it up with the original Japanese version on Blu-ray in July 2023. The Japanese version retails for $70--10 bucks less than English dub at full price--but it's currently sold out. As mentioned, it's common for Discotek's Digimon Adventure Blu-rays to be out of stock at Amazon and other major retailers.                      Digimon Adventure Blu-ray DealsThe English dub of Digimon Adventure 02 released on Blu-ray last year. Prices for follow-up series are similarly unpredictable. Earlier this month, Digimon Adventure 02 was $49 at Amazon, but at the time of writing it'll set you back $65 (was $80). The original Japanese version of Digimon Adventure 02 released earlier this year and is on sale for only $42 (was $70), which is its lowest price yet.Digimon Adventure: Season 1 (English Dub) -- $48 ($80)Digimon Adventure 02: Season 2 (English Dub) -- $65 ($80)Digimon Adventure: Season 1 (Japanese Dub) -- $70 | Sold outDigimon Adventure 02: Season 2 (Japanese Dub) -- $42 ($70) Digimon Movies on Blu-rayDigimon The Movies Collections | Digimon Adventure 02: The BeginningDigimon The Movies 1-3 Collection -- $18 ($30)Digimon The Movies 4-6 Collection -- $24 ($30) | December 30Digimon Adventure 02: The Beginning -- $14.49 ($27)Digimon Adventure: Last Evolution Kizuna -- $18 ($23)Digimon Adventure Tri: The Complete 6-Film Collection -- $50 ($70) | B2G1 FreeIncludes all six movies below:Reunion -- $11Determination -- Sold outConfession -- $9Loss -- $9Coexistence -- $7Future -- $10Digimon Adventure is also the title of the first Digimon movie. Like the series, it released in Japan in 1999. It was followed up by Our War Game and Hurricane Touchdown in 2000. The first Digimon movie that released in the US, simply titled Digimon: The Movie, was an adaptation of those three films. Discotek's restoration brought the uncut editions to the US with Digimon The Movies 1-3 Collection. Released last December, The Movies 1-3 Collection also includes the original English version of Digimon: The Movie. Fans can also preorder Digimon The Movies 4-6 Collection for $24 (was $30) ahead of its December 30 release.The most recent movie in the series is 2023's Digimon Adventure 02: The Beginning. If you don't yet own a copy, you can add the Blu-ray and DVD combo pack to your collection for cheap. You can also get Digimon Adventure Tri: The Complete 6-Film Collection for $50 (was $70). As an added bonus, this box set is eligible for Amazon's Buy Two, Get One Free Blu-ray promotion.Digimon fans should also check out Black Friday deals on Digimon Story: Time Stranger, the recently released RPG that earned rave reviews from critics and fans. Time Stranger is on sale for $50 (was $70) for PS5 and Xbox.                                                                                                                                                                               The First PS5 Pro Deal In Six Months Is Up For Grabs For A Limited Time                         Ghost Of Yotei PS5 Slim Bundles And Collector's Edition Get Huge Discounts                         Save Big On 8BitDo's Stellar Ultimate 2 Controllers In Amazon's Black Friday Sale                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Evercade Retro Handhelds & Cartridges Get Rare Price Cuts In Amazon's Black Friday Sale                         Kirby Air Riders Buying Guide: Release-Day Delivery Still Available At Amazon                         Meta Quest 3S Black Friday Deal - Save Up To $70 And Get $50 Amazon Credit                         Grab A Wireless GameCube-Style Controller For Switch 1/2 & PC For Only $40                         Amazon-Exclusive Lunar Remastered Collection Gets First Price Cut    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Snag An Apple Watch At Walmart For As Low As $129",
    "url": "https://www.gamespot.com/articles/apple-watch-se-2nd-gen-walmart-deal-bf2025/1100-6536491/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4611861-apple-watch-se2.jpg",
    "tag": "Gaming",
    "date": "2025-11-26T02:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   What time is it? It's time to check out these Black Friday deals on Apple Watches at Walmart. While multiple models are seeing discounts, one of the best budget-friendly options on sale right now is the Apple Watch SE second-generation line. You can buy a GPS-enabled 40mm version for $129 (was $279), a 44mm SE2 model for $159 (was $279), or grab the cellular version of both models for the same price.                                                                                                      Apple Watch SE 40mm (Second Generation)                                                                $129                                                                                                                                                                                    Not just useful for checking the time at the flick of a wrist, the Apple Watch SE2 is an affordable option for tracking your health and fitness. These are designed to seamlessly connect with your Apple devices, are water-resistant to 50 meters, and can be easily customized with a range of optional watch bands and watch faces sold separately. Anyone looking to track their activity can explore various metrics that the watch tracks, making this a solid option for first-time users.Other features include Fall Detection, Crash Detection, and Emergency SOS. The watch also offers three months of Apple Fitness+ for free with the Workout app. This deal applies to all GPS and GPS + Cellular models in any available color while stock lasts.                                                                                                                            Apple Watch SE 44mm (Second Generation)                                                                $159                                                                                                                                                                                    If your wrist is on the larger side, you'll want to grab the 44mm Apple Watch as these have wider bands. Like the 40mm version above, this deal applies to all GPS and GPS + Cellular models in any available color.                         The Apple Watch SE2 earned positive reviews after it launch in 2022, with critics noting that it offered users a sharp Retina display, powerful processor, and versatile health-monitoring tools. Considering that these watches still command a high price tag--and newer models cost even more--we're not expecting Walmart's SE2 stock to last long.Anyone looking for a fashion statement can also check out these deals on watches inspired by classic video games and consoles. The officially licensed Atari 2600, Space Invaders, and Tetris watches aren't just colorful tributes to video game history; they're interactive devices preloaded with video and arcade games that you can play on them.Retro Gaming Smart Watch Deals                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   For more deals on everything from tech and Blu-rays to video games and board games, click through to GameSpot's Black Friday Deals Hub.See More Early Black Friday DealsPS5 Game DealsNintendo Switch & Switch 2 Game DealsXbox Series X Game DealsBlu-ray DealsBoard GamesBook DealsTabletop Gaming BooksComics & Graphic NovelsToys and GamesLego Set DealsApple Deals                                                                                                                                               Sign up for GameSpot's Weekly Deals Newsletter:                                The First PS5 Pro Deal In Six Months Is Up For Grabs For A Limited Time                         Ghost Of Yotei PS5 Slim Bundles And Collector's Edition Get Huge Discounts                         Save Big On 8BitDo's Stellar Ultimate 2 Controllers In Amazon's Black Friday Sale                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Evercade Retro Handhelds & Cartridges Get Rare Price Cuts In Amazon's Black Friday Sale                         Kirby Air Riders Buying Guide: Release-Day Delivery Still Available At Amazon                         Meta Quest 3S Black Friday Deal - Save Up To $70 And Get $50 Amazon Credit                         Grab A Wireless GameCube-Style Controller For Switch 1/2 & PC For Only $40                         Amazon-Exclusive Lunar Remastered Collection Gets First Price Cut    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n\n            \n    "
  },
  {
    "title": "How To Get A Free Kill Bill Fortnite Skin",
    "url": "https://www.gamespot.com/articles/how-to-get-a-free-kill-bill-fortnite-skin/1100-6536515/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4612294-fortniteyuki.jpg",
    "tag": "Gaming",
    "date": "2025-11-25T21:51:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          After giving everyone a free...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                After giving everyone a free Juice WRLD skin a year ago, Fortnite is once again offering a free licensed skin to mark the start of a new chapter. Anyone who logs into Fortnite between November 27 at 6 AM PT and December 1 at 6 AM PT will receive a skin based on Yuki Yubari, a character from Quentin Tarantino's Kill Bill who didn't make the final cut of the movie when it was originally released.This Yuki Yubari skin is free to anyone who logs into Fortnite between November 27 and December 1.Back when Tarantino wrote his massive two-part epic Kill Bill, it included an additional sequence that was cut before filming, in which Yuki seeks revenge for the death of her sister Gogo, whom The Bride had killed during the battle at the House of Blue Leaves. Yuki finally sees the light of day in Fortnite Chapter 7, apparently.The Yuki Yubari skin is not actually in the Fortnite game files yet, so you won't be granted the skin until after Chapter 7 begins on November 29. Yuki is one of at least three Kill Bill-related skins coming to Fortnite in Chapter 7. The Bride herself will be included in the Chapter 7 Season 1 battle pass, and a skin based on Gogo Yubari will be sold in the item shop--and you can also earn it by purchasing a ticket in advance for a showing of Kill Bill: The Whole Bloody Affair during its opening weekend.With Chapter 7 arriving imminently, that means it's almost time for the Chapter 6 finale live event--which will go down on Saturday, November 29 at 11 AM PT / 2 PM ET.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]