[
  {
    "title": "Fortnite Stranger Things Map: All Locations And Sights To See",
    "url": "https://www.gamespot.com/gallery/fortnite-stranger-things-map-all-locations-and-sights-to-see/2900-7276/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4608925-fortniteblitzstrangerthings.jpg",
    "tag": "Gaming",
    "date": "2025-11-21T20:55:00.000Z",
    "description": "By     Phil Owen   on November 21, 2025 at 3:10PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Phil Owen\n   on November 21, 2025 at 3:10PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Fortnite's collaboration with the Netflix series Stranger Things gets its biggest drop yet this weekend with five new skins in the item shop and a branded takeover of the Blitz Royale mode.Blitz Royale, which has quick, five-minute rounds of battle royale on a tiny island, got an entirely new map on November 21. The new island features four named locations based on the town of Hawkins, Indiana, as well as a border right down the middle separating the normal world from locations that have been corrupted by the Upside Down--essentially giving the map a pair of distinct biomes, something that Blitz hasn't done before since its map is already so little.The map and the new item shop skins based on Vecna and the original four boys are the entirety of this takeover--there aren't any new Stranger Things weapons added to the loot pool or anything like that. That's fine, because between the ongoing Simpsons season and the imminent launch of Chapter 7, we've already got plenty of new mechanics to worry about.Scroll on for looks at the full new map and each of the named locations.As you can see, the island is split in half between the regular part in the west and the Upside Down part in the east, with each half getting two of the major locations. While the Upside Down half is always dark and spooky, the normal half of the island has the usual day/night cycle.Gnarly FarmsStranger SuburbsLibrary LandingHawkins HeightsHawkins Heights includes this movie theater sign and marquee teasing the Chapter 6 finale event that's taking place on Saturday, November 29. Fun fact: Despite the sign indicating otherwise, there's no movie theater on this map.    \n  \n                      "
  },
  {
    "title": "A Really Good Multiplayer Game Is Free On Steam For A Limited Time",
    "url": "https://www.gamespot.com/articles/a-really-good-multiplayer-game-is-free-on-steam-for-a-limited-time/1100-6536443/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1850/18504982/4608846-vermintide2.jpg",
    "tag": "Gaming",
    "date": "2025-11-21T19:57:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Steam users can pick up the...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Steam users can pick up the beloved Warhammer: Vermintide 2 at no cost this weekend, as part of a celebration thrown by developer Fatshark.From now until November 23 at 9:59 PM ET / 6:59 PM PT, you can go to the game's Steam page and add Vermintide 2 to your library.The title usually costs $30, but Fatshark is offering the game for free to mark 10 years of \"Tide\" games from the studio, beginning with Warhammer: End Times - Vermintide in 2015. The event also includes new content for both Vermintide 2 and its spiritual successor, Warhammer 40K: Darktide.The 10 years of Tide celebration is far from over!Seize the opportunity to get new friends into the rat-slaying hobby.That's right, anyone who downloads Vermintide 2 on Steam this weekend gets to keep it forever, in perpetuity, until the end times! pic.twitter.com/JUyMzaEsA4  — Warhammer Vermintide (@VermintideGame) November 21, 2025              For the uninitiated, Vermintide 2 is a cooperative multiplayer game in which teams of four players clash against the Chaos army and hordes of rat men called Skaven. Think of it as a Left 4 Dead-like experience, but you bash giant rats with melee weapons instead of mowing down zombies with assault rifles.Releasing in 2018, Vermintide 2 still enjoys plenty of new content and support from Fatshark, receiving a new Versus mode last year and getting tons of quality-of-life updates and free DLC over the years. Just this week, Vermintide 2 added the Return to the Reik level, which recreates a fan-favorite location from Vermintide 1.This actually isn't the first time Vermintide 2 has been temporarily offered for free on Steam--Fatshark made the same move in 2022. The game is also available for full price on PlayStation 4, Xbox One, and Xbox Series X|S, though it's part of the Xbox Game Pass Ultimate and Standard libraries and the PlayStation Plus Extra catalog.There are plenty of fun games that will always remain free-to-play on Steam, but nabbing Vermintide 2 this coming weekend would be an absolute steal.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Ubisoft Shows Off Generative AI Game Demo Called Teammates",
    "url": "https://www.gamespot.com/articles/ubisoft-shows-off-generative-ai-game-demo-called-teammates/1100-6536444/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4608845-teammatessofiaandpablo.jpg",
    "tag": "Gaming",
    "date": "2025-11-21T20:37:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          During an investor presentation...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                During an investor presentation earlier today, Ubisoft showed off Teammates, a new R&D game experience that utilizes generative AI. Ubisoft CEO Yves Guillemot also described the advent of generative AI in games as \"a revolution.\"\"Generative AI is as big a revolution for games as the shift to 3D,\" said Guillemot (via Game File). \"We are making great strides in applying Gen AI to high-value use cases that bring tangible benefits to our players and teams... It's as big [of] a revolution for our industry as the shift to 3D. And we have everything to lead on this front.\"Teammates was developed by the team behind Neo NPC. The company also said that the demo is meant to prove that \"generative AI-driven gameplay can shape a new generation of more interactive and engaging games.\"A screencap from Teammates.The game's prototype is currently being tested by a small number of players. Teammates is a first-person shooter, but its AI tools will supposedly let it adapt to voice commands from the player, allowing NPCs to dynamically respond in real-time.\"It's really about experimenting with entirely new ways of creating interactive stories,\" said the game's narrative director, Virginie Mosser. \"Our role is to give AI meaning, to narrativize it, ensuring logic doesn’t replace soul. We designed Teammates to leave space for player creativity, finding that balance between emotion and unpredictability.\"Teammates includes a companion character called Jaspar who is said to be able to help the player overcome obstacles and provide hints or strategies. In concept, that's not very different from other NPCs in numerous games. What supposedly makes Jaspar stand out is his ability to interact and respond directly to the player.The Teammates devs note that it has a specially made Application Programming Interface (API) that can utilize guardrails that shield players from AI-powered hallucinations and \"helps control its power to put it at the service of human creativity and play.\" The company also characterized Teammates as an experiment that \"serves both as a playable prototype and a testbed for the underlying technology.\"Ubisoft has stated that its new \"Creative Houses\" operating model will be unveiled in January 2026. Earlier this week, Ubisoft apologized to players for including AI artwork in Anno 117: Pax Romana. The replacement image looks like the AI version, minus a few people with extra fingers or distorted faces.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]