[
  {
    "title": "It's Time For Smash Bros. Ultimate's Switch 2 Upgrade",
    "url": "https://www.gamespot.com/gallery/its-time-for-smash-bros-ultimates-switch-2-upgrade/2900-7197/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/3/37852/4594000-header.jpg",
    "tag": "Gaming",
    "date": "2025-10-30T17:25:00.000Z",
    "description": "By     Jason Fanelli   on October 30, 2025 at 10:33AM PDT                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Jason Fanelli\n   on October 30, 2025 at 10:33AM PDT    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                The potential future of SmashNintendo shocked its fans with the announcement of two major Animal Crossing: New Horizons updates--a Nintendo Switch 2 Edition and a free Version 3.0 update. With the news, nine of the top 10 best-selling games on the original Nintendo Switch have received either a direct sequel, a Nintendo Switch 2 Edition, or an officially recognized free update for the new console.The only remaining top seller to upgrade is a big one: Super Smash Bros. Ultimate, the third best-selling game on the console. Some sort of update seems inevitable, and if it were me, I'd go the Nintendo Switch 2 Edition route.This method actually answers a major post-Ultimate question: How would a sequel to Smash follow it up? With a Nintendo Switch 2 Edition making smaller adjustments, Nintendo can push back the clock on that question until Sakurai--or perhaps an unnamed successor--can figure it out.Here's what a Super Smash Bros. Ultimate: Nintendo Switch 2 Edition could look like.An Ultimate online updateFirst and foremost, online play has to be improved. Delay-based netcode in fighting games has been rendered obsolete, with virtually every major fighting franchise turning instead to rollback netcode, with incredible results.As impractical as it sounds, a full overhaul of Smash Bros. Ultimate's online environment, and a switch from delay-based netcode to rollback netcode, would need to be included in a Switch 2 Edition. We've seen other games do it--Dragon Ball FighterZ, which launched the same year as Smash Ultimate, has made the switch, and Bandai Namco co-developed SSBU with Nintendo. The relationship is there.Online play in Ultimate is the best the Smash Bros. franchise has ever seen, but the bar there is set so low you could trip on it. This Switch 2 Edition could finally fix that.Visual and technical improvementsLet's quickly acknowledge that Smash Bros. Ultimate is slightly improved when playing on the Switch 2. However, those improvements are mostly with loading times--single-player menus and matches load faster, but the visuals remain at 1080p when docked and 720p when in handheld mode.Increasing those visuals to 4K when docked and 1440p in handheld would be a worthwhile improvement, provided the game continues to move at 60 frames per second. However, if there has to be a choice between 4K visuals and a consistent 60fps, then 1440p docked would suffice. Nicer visuals would be a major selling point for those looking to upgrade.A few new facesIt's hard to say a character roster with 82 characters needs an \"upgrade,\" especially an all-star cast like the one Smash Bros. Ultimate features. That being said, if Nintendo is going to go ahead with this Nintendo Switch 2 Edition, the Smash community would expect a few new fighters to come with it.Let's say, for this hypothetical, Super Smash Bros. Ultimate: Nintendo Switch 2 Edition brings with it another six-character Fighters Pass. These are my selections:Waluigi (Super Mario)Easily the most-requested character for Smash. Make him the first new character in the Pass, and make him available day and date with the Switch 2 Edition.Zagreus/Melinoe (Hades)Both Hades and Hades 2 have now made their console debuts on Nintendo hardware. Having the two of them take up a slot--four costumes for Zagreus, four for Melinoe--makes sense to me.Crash BandicootNot only would this fulfill many an older fan's dream, but it would also give Microsoft a rep in all three Fighter Passes thanks to its ownership of Activision.Urshifu (Pokemon)While Pokemon has a lot of representation on the Smash roster, we've now had two generations of Pokemon since Smash Ultimate launched. Of those new Pokemon, Urshifu seems like a prime fit thanks to multiple fighting stances and plenty of powerful moves.The Tarnished (Elden Ring)One of the most successful games in the modern era, with a port coming to Switch 2 in the near future, and published by the company that helps Nintendo develop Smash Bros. Arise, Tarnished, you're a natural fit.Geno (Super Mario RPG)A pure vanity pick from the author here, but the living top from Super Mario RPG is also highly requested, and he would also represent Square Enix's running partnership with the game.    \n  \n                      "
  },
  {
    "title": "Here's This Week's Free Game From The Epic Games Store On Mobile",
    "url": "https://www.gamespot.com/articles/free-games-epic-games-store-mobile/1100-6530257/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4462498-egs-mobile.jpg",
    "tag": "Gaming",
    "date": "2025-10-30T16:29:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          For the last couple of years,...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                For the last couple of years, the Epic Games Store has given away free games every week through its PC storefront. With the company having launched its own mobile store, it has also started a second free games program on iOS and Android devices, kicking things off with a curated library of titles and weekly freebies. The app also features mobile versions of Fortnite, Fall Guys, and Rocket League Sideswipe.To access these games you will need to create a free Epic account and install the free Epic Games Store mobile app and log in with your account, but once you do, you can start claiming your free games every Thursday through it. One other thing to note is that Android users can access the app via Android-based emulation devices like Retroid Pocket, as they aren't limited to just smartphone and tablets.For now, only iOS users in the European Union can install the app, but the app is available worldwide to Android device users and they have a wider selection of games to choose from in comparison. Like its PC counterpart, you'll have one week to grab each game that's offered. Here's a closer look at what you can grab this week, and what the current mobile games library has to offer. You can also explore what the free PC games are this week on the Epic Games Store.Current free game on the Epic Games Store Mobile AppBendy and the Ink MachineThis week, you can get Bendy and the Ink Machine for free. While it might look like a cute tribute to classic cartoons from the 1930s, the game is actually a BioShock-inspired action-puzzle adventure set in a world of horrifying 'toons that have run amok.Epic Games Store Mobile LibraryCurrently, there's a solid selection of games that require quick reflexes and a knack for solving puzzles. Bridge Constructor: The Walking Dead combines the spatial problem-solving appeal of the Bridge Constructor series with zombies, Chicken Police: Paint the Town Red is a wonderfully weird noir-detective story featuring anthropomorphic animals, and Endling: Extinction is Forever is a heartbreaking tale about surviving the end of the world.Here's the full list of what you can access right now from this library:iOS and AndroidSuper Space ClubLoop HeroChuchelMr Racer: PremiumThe Forest QuartetThe WereCleanerAndroidBowling ClashEndling: Extinction is ForeverChicken Police: Paint it RedOne Hand ClappingNeighbours Back From HellThis is The PoliceThis is The Police 2This Is The PresidentThrough the Darkest of Times\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Call Of Duty Movie Adds A Major Name",
    "url": "https://www.gamespot.com/articles/call-of-duty-movie-adds-a-major-name/1100-6535832/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4594046-callofdutyadvancedwarfare.jpg",
    "tag": "Gaming",
    "date": "2025-10-30T18:52:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          In September, Paramount...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                In September, Paramount announced a deal with Activision to bring a Call of Duty movie to the big screen. Less than two months later, Paramount has lined up its A-list writing team for the script, including Yellowstone creator Taylor Sheridan.According to Variety, Sheridan will co-write the script for Call of Duty with the film's director, Peter Berg. The news was somewhat surprising since Sheridan recently made a new deal to leave Paramount behind and join NBCUniversal when his current contract expires in 2028. In the meantime, Paramount doesn't seem to be holding a grudge against Sheridan for his impending departure.Sheridan is an Oscar-nominated screenwriter for Hell or High Water, and he's also scripted the films Wind River, Sicario, and Sicario: Day of the Soldado. On television and streaming, Sheridan's been even more successful with multiple Yellowstone prequels, as well as several Paramount+ original series including Mayor of Kingstown, Tulsa King, and Lioness.As a director, Berg's previous credits include The Rundown, Friday Night Lights, The Kingdom, Hancock, Battleship, Deepwater Horizon, and Lone Survivor.Last month, Activision sent out a survey to Call of Duty fans that asked them what the movie should adapt. The military shooter has featured games in multiple eras since the franchise launched in 2003. There have been several previous attempts to make a Call of Duty movie, and Steven Spielberg reportedly wanted to make the film before Activision passed on his demands.Paramount's deal with Activision also leaves the door open for a Call of Duty TV series, but there's been no word about that going forward just yet. The next game in the series, Call of Duty: Black Ops 7, will be released on November 14 for Xbox Series X|S, PlayStation 5, and PC.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]