[
  {
    "title": "All Battlefield 6 Free Skins And Campaign Rewards",
    "url": "https://www.gamespot.com/gallery/all-battlefield-6-free-skins-and-campaign-rewards/2900-7127/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1639/16394540/4583328-bf6screen%235.jpg",
    "tag": "Gaming",
    "date": "2025-10-10T21:33:00.000Z",
    "description": "By     S.E. Doster   on October 10, 2025 at 2:55PM PDT                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                                      \n                            \nBy \n    S.E. Doster\n   on October 10, 2025 at 2:55PM PDT    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Battlefield 6 includes a full campaign with 30 collectible dog tags to find. There are 10 rewards you can earn just by collecting these mission collectibles. In this guide, we'll show you all the rewards you can earn and how to unlock them for yourself.If you need help finding the dog tags for each mission, we have a full Battlefield campaign collectibles guide to walk you through each one. This list also included a bonus collectible needed for getting the \"End of an Era\" achievement/trophy in Battlefield 6.Make sure to check out our Battlefield 6 guide hub for tips and tricks on playing, including the best settings, recommended loadouts, and a full overview of the Battlefield 6 class system.Dead Center - Dog tagThis dog tag can be unlocked by picking up all three collectibles in the first campaign mission called Always Faithful.Danger Ahead - Player card backgroundThis background can be unlocked by collecting all three dog tags in the second mission called The Rock.Elite Raider - Player card iconThis icon can be unlocked by picking up all three dog tags in the third campaign mission called Operation Gladius.Urban Sprawl - Character skin (Recon)This Urban Spawl character skin is unlocked for the Recon class by picking up all four dog tags in the fourth campaign mission called Night Raid.Gridlock - Character skin (Support)A Gridlock character skin is unlocked for the Support class by picking up all three dog tags in the fifth campaign mission called No Sleep.Career XP boosterLevel up faster using this career XP boost for double XP. This can be earned by picking up all the dog tags in the sixth campaign mission called Moving Mountains. This double XP reward doesn't say how long it lasts.Canopy Drop - Vehicle camoThis green vehicle camo can be unlocked by picking up all two dog tags in the seventh campaign mission titled Nile Guard.Gridlock - Character skin (Assault)A Gridlock character skin for the Assault class can be unlocked by finding all four dog tags in the eighth campaign mission called Operation Ember Strike.Urban Spawl - character skin (Engineer)An Urban Spawl character skin for the Engineer class can be unlocked during the final campaign mission called Always Forward.Winner Take All - Dog tagRetrieving all 30 dog tags will unlock this dog tag as a tenth and final reward for the Battlefield campaign collectibles.    \n  \n                      \n    "
  },
  {
    "title": "Best Battlefield 6 Keybinds - Keyboard And Mouse Settings",
    "url": "https://www.gamespot.com/articles/best-battlefield-6-keybinds-keyboard-and-mouse-settings/1100-6535380/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1745/17457013/4583317-battlefield-6-multiplayer-reveal.jpg",
    "tag": "Gaming",
    "date": "2025-10-10T19:58:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Keyboard and mouse are...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Keyboard and mouse are extremely popular inputs for Battlefield 6 players. While most players still play the game on a controller, thanks to the console versions, many fans have swapped to a keyboard and mouse due to how difficult it can be to nail down the best controller settings in Battlefield 6.If you've made the switch to keyboard and mouse (KBM) or have been using KBM for ages, you'll need the best settings for your devices. Getting your keybinds, sensitivities, and other settings tuned just right can lead to a more enjoyable gameplay experience and often makes the difference between life and death on the battlefield.Below, you'll find the optimal setting for every keyboard and mouse menu option in Battlefield 6.Table of Contents [hide]Best settings for keyboard and mouse in Battlefield 6Infantry Control SettingsInfantry KeybindsVehiclesVehicles Control SettingsBest settings for keyboard and mouse in Battlefield 6First off, you can find your keyboard and mouse settings by pressing the cog icon at the top-right of the Battlefield 6 main menu. Here, navigate to the tab labeled \"Mouse & Keyboard\" and select it to find all sorts of different options to view and change.The keyboard and mouse settings in Battlefield 6 are split up into multiple sections and menus, and it can be difficult to go through every available setting. Fortunately, all you have to do is read below to find the section you want to change and all of the settings that go with that section in Battlefield 6.Infantry Control SettingsAimInfantry Mouse Aim Sensitivity: 40-50Uniform Infantry Aiming: OnZoom Sensitivity Coefficient: 178Infantry Zoom Aim Sensitivity: 80-90Vertical Mouse Aim Ratio: 100Invert Vertical Look - Infantry: OffField of View: 105The Mouse and Keyboard settings menu in Battlefield 6MovementInfantry Sprint: ClickDouble Tap Forward Sprint: OffSprint: Left ShiftCrouch Toggle Sprint: StandVault Over Sprint: OnSlide: N/ACrouch Slide: AllDouble Tap Crouch For Sprint Slide: OffLanding Roll: OnZoomInfantry Weapon Zoom: HoldZoom: Right Mouse ButtonSteady Scope: HoldSteady Scope: Left ShirtInfantry Zoom Aim Sensitivity: 80-90Vertical Mouse Aim Ratio: 100OtherParachute Auto Deploy: Insertions OnlyInteract & Reload: Prioritize ReloadSkip Revive: HoldRequest Revive: ToggleInvert Demolition Charge: OffMount Breakout: InstantMount Presets: ComboPeek Type: Side and UpMount Type: Side and UpInteracts: OffInfantry KeybindsThe Infantry Keybinds menu in Battlefield 6GeneralInteract: EEnter / Exit Vehicle: EBig Map: MQuick Loadout Customization: YToggle Inventory/Scoreboard: TabChange Seat in Vehicle: FSkip to Deploy: SpacePing / CommoRose (Hold) / Call-in Gadget Half Combo: Left AltMovement & AimingWalk Forward: WWalk Backward: SStrafe Right: DStrafe Left: ALook Up: Mouse ForwardLook Down: Mouse BackwardLook Right: Mouse RightLook Left: Mouse LeftJump: SpaceVault: SpaceSprint: Left ShiftCrouch (Hold): CCrouch (Toggle): Left CtrlProne: ZParachute Deploy: SpaceSlide: N/ALean/Peek: N/AWeapons & EquipmentFire: Left Mouse ButtonZoom: Right Mouse ButtonReload: RMelee/Takedown: FPrimary Weapon: 1Secondary Weapon: 2Gadget One: 3Gadget Two: 4Weapon Inspect: ISquad Progression/Class Gadget: XGrenade: GContextual Action: 5Toggle Laser And/or Flashlight: TFire Mode/Zeroing /Ranger Finder Zeroing: BSteady Scope: Left ShiftToggle Scope: VCycle Primary Weapon: Mouse Wheel UpCycle Secondary Weapon: Mouse Wheel DownDeploy Bipod/Mount: FVehiclesVehicle Mouse Aim Sensitivity: 40Vehicles Control SettingsInvert Vertical Flight - Aircraft - OffInvert Vertical Look - Aircraft: OffAir Control Sensitivity: 40-50Helicopter Control Sensitivity: 40-50Helicopter Control Assists: OffThird Person Aircraft Camera Roll: OnVehicle Boost: ToggleVehicle Weapon Zoom: HoldAnd that takes care of every pertinent keyboard and mouse setting you'll need in Battlefield 6. We ommitted some of the non-important settings and all of the UI keybinds, as those are generally left perfectly fine on their default options. However, you can always head back into the settings if you find you want to change something on that front. We also recommend to try our settings and then tinker with them yourself to find the best values for you and your preferences.For more Battlefield 6 guides, make sure to check out our full guides hub for the game, which includes everything you need to know about EA's new hit shooter.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Best PC Graphics Settings In Battlefield 6",
    "url": "https://www.gamespot.com/articles/best-pc-graphics-settings-in-battlefield-6/1100-6533746/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1745/17457013/4544973-zot5qz5gcuefn3mnhhrk9b.jpg",
    "tag": "Gaming",
    "date": "2025-10-10T19:54:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          The Battlefield franchise has...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                The Battlefield franchise has always been known for its high-quality graphics, and Battlefield 6 is no different. At the launch of Battlefield 6, the game is fairly well-optimized, but it also features plenty of intense graphics that can make a high frame rate difficult to achieve. You'll have to use the absolute best graphics settings if you want to maintain your target frames per second and have a smooth experience. Fortunately, that's where we come in. We'll be listing off every single one of the PC graphics settings in Battlefield 6 and letting you know what you should set each one to. This will not only give you a great-looking game, but it will also allow you to play at a high FPS and get the most out of your PC.Best graphics settings in Battlefield 6To get started with your graphics settings, go to the main menu screen in Battlefield 6 and click on the cog icon at the top of the screen. From here, click the \"Graphics\" section on the left side of the screen.Here, you'll be able to change around all of the general graphics settings, including choosing what resolution you play at and which monitor Battlefield 6 appears on. These settings are going to be more personal for every player, but you can find a list of our best settings for the general graphics menu below:GraphicsGraphics Quality: CustomBrightness: 50-60Sharpness: 75CameraField of View: 110-115Vehicle 3rd Person Field of View: 83Weapon Field of View: WideWorld Motion Blur: 0Weapon Motion Blur: 0Camera Shake Amount: 20Chromatic Aberration: OffVignette: OffFilm Grain: OffDisplayFullscreen Mode: Borderless or FullscreenFullscreen Device: Your preferred monitorFullscreen Resolution: Your preferred resolution from the monitor you're usingAspect Ratio: AutoRefresh Rate: Maximum Hz of your monitorVertical Sync: OffThe main graphics settings menu in Battlefield 6There are other sections further down in the graphics menu, but they only relate to your HUD. Change them as you see fit, but they can be left alone for the most part.Moving on, if you scroll back up to the Graphics section of the menu, you can click on \"GRAPHICS\" to modify each individual setting. This allows you to raise or lower the graphical fidelity of Battlefield 6 by changing settings that have a high or low impact on your PC's performance.You can see a full list of these settings and what they should be set to below:Graphic Settings Texture Quality: HighTexture Filtering: HighMesh Quality: LowTerrain Quality: LowUndergrowth Quality: LowEffects Quality: LowVolumetric Quality: LowLighting Quality: LowLocal Light & Shadow Quality: LowSun Shadow Quality: LowShadow Filtering: PCFReflection Quality: LowScreen Space Reflections: OffPost Processing Quality: LowScreen Space AO & GI: OffHigh Fidelity Objects Amount: MediumCustomizing the individual graphics settingsNaturally, if you want the most frames per second possible, then just set every single setting to its lowest value. Our settings will still give you a decent frame rate, but they also keep your game's graphical fidelity high so you can see objects and enemies more clearly.Finally, back out of the \"GRAPHICS\" settings and look right below the \"Brightness\" and \"Sharpness\" settings in the graphics menu. Here, you'll see an option called \"ADVANCED.\" Click on it and you'll be brought to a new menu where you can change your upscaling and other performance options. Look below for the optimal settings in this menu:Advanced SettingsFixed Resolution Scale: 100Frame Rate Limiter: On and set to your maximum refresh rate (160,144, 240, etc.)Nvidia Reflex Low Latency: Enabled or Enabled + Boost  Use Enabled if your GPU is better than your CPU and use Enabled + Boost if your CPU is better than your GPUUpscaling Technique: DLSS for Nvidia users / FSR for AMD usersUpscaling Quality: Quality for better visuals, Performance/Ultra Performance for the highest FPSNvidia Frame Generation: Off (adds too much input lag)Future Frame Rendering: OffPerformance Overlay: OffGoing through the upscaling options in Battlefield 6Your choice of upscaling depends on your graphics card's brand and whether you want to run Battlefield 6 at a native resolution. You can also run Nvidia Frame Generation if you have a capable RTX GPU, but the added input lag is noticeable, so you'll have to decide if the extra frames are worth it.With that, we've covered every available graphics setting. If you want to keep customizing your settings, make sure to check out our guide on the best controller settings in Battlefield 6.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]