[
  {
    "title": "Steam Replay 2025 Is Now Live, Letting Players Look Back At Their Gaming Year",
    "url": "https://www.gamespot.com/articles/steam-replay-2025-is-now-live-letting-players-look-back-at-their-gaming-year/1100-6537030/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1597/15976769/4624298-reposc.jpg",
    "tag": "Gaming",
    "date": "2025-12-16T21:04:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                              Steam Replay for 2025 is...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                Steam Replay for 2025 is now available, giving players a fun way to look back at their year in gaming. It shows what games you played, how much time you spent playing, and other simple stats from the year. Many platforms now do yearly summaries like this, with Spotify Wrapped starting the trend, and services like YouTube and Twitch followed by showing users what they watched and enjoyed in 2025.Valve's Steam Replay covers your playtime from January 1, 2025, through the end of December 14, 2025. This gives players a clear picture of most of their gaming year, and also focuses on their habits--such as how many games they played games with either a keyboard or controller--and highlights their most-played games. This year, I finally really got into games on Steam with Peak and Repo, and I'm still dabbling with Lethal Company.It's the most wonderful time of the year - Steam Replay 2025 is now available!Take a trip down memory lane and see how many games you played, how much you played per month, and many more fun stats for the year.Check out yours (login required): https://t.co/Zq9vxaFit4… pic.twitter.com/SrVS9oNdIP  — Steam (@Steam) December 16, 2025              Other gaming platforms have also released their yearly summaries, as PlayStation posted its yearly wrap-up last week. To see your Steam Replay, you can visit Valve's website or click the Steam Replay banner in the Steam app's store page. It'll be interesting to see how the Steam Machine will affect players next year for those who prefer a more traditional console setup.There are a few limits to keep in mind: Steam Replay does not count time played while offline or disconnected from the internet. It also leaves out unreleased games, preloads, prerelease versions, and disabled games.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n\n            \n    "
  },
  {
    "title": "Diablo 4's Goblin Greedings Lets You Beat Up Goblins For More Loot",
    "url": "https://www.gamespot.com/articles/diablo-4s-goblin-greedings-lets-you-beat-up-goblins-for-more-loot/1100-6537036/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4624348-diablo4goblinholiday.jpg",
    "tag": "Gaming",
    "date": "2025-12-17T02:15:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          It's not an easy life for...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                It's not an easy life for Sanctuary's citizens in Diablo 4, but players can make things a little brighter in the upcoming holiday event Goblin Greedings. Starting on December 18, players will be to put presents under their tree--so to speak--by clobbering creatures for loot and bringing a little hope back to Estuar.To claim their prizes, players will have to face hordes of Treasure Goblins and earn their place on the March of the Goblins reputation board. There are multiple tiers to unlock, and players can claim their prizes between each one by visiting the Goblin Square in Kyovashad. Once players complete the final tier, they will be given a Resplendent Spark. That final tier is repeatable, and the quality of the loot dropped by enemies will increase with each tier. However, players will only have until January 6, 2026 to work their way through and claim as much treasure as they can.Returning Grim Favors during Goblin Greedings will also give players an additional cache for Gift of the Tree. All they need to do to claim it is to select a cache, which will reveal the treasure they've been given by the Gift of the Tree.Additionally, a handful of free holiday items will appear at the in-game store on specific dates:December 18: Tackle of the First Snows (Mount Trophy)December 19: Fallow-ward (Mount Trophy)December 20: Crook of First Snow (Mount Armor)As with the rest of treasures, those items will disappear after January 6.Outside of the game, the prequel to next year's Lord of Hatred expansion, Diablo 4: The Lost Horadrim, is available for preorder now. Preordering the expansion itself grants players early access to Paladins, one of the latest classes added to the game. The expansion is also bringing back the fan-favorite villain, Lilith.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Arc Raiders Deciphering The Data Quest Guide",
    "url": "https://www.gamespot.com/articles/arc-raiders-deciphering-the-data-quest-guide/1100-6537034/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/679/6794662/4624307-share_20251216_0957581.jpeg",
    "tag": "Gaming",
    "date": "2025-12-16T22:44:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          The Deciphering the Data quest...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                The Deciphering the Data quest in Arc Raiders sends you to Spaceport to check out some Magnetic Decryptors, and finding exactly where they're located can be a bit of a challenge. However, you've come to the right place, as we'll tell you exactly where you can find both locations you need to interact with to complete this quest from Shani.You won't need to extract to complete Deciphering the Data--but we recommend you run a free kit either way, as you may come across other raiders working on the quest, too, and you wouldn't want to risk losing your gear if a fight breaks out while you're busy exploring.When you're ready to take on Deciphering the Data, follow the steps below.How to complete Deciphering the Data in Arc RaidersThe first step of Deciphering the Data sends you to the Fuel Control building, which is located on the northeastern portion of the Spaceport map. This building is very dark inside, so don't be afraid to turn on your flashlight if needed.Fuel Control building locationIn the main (very dark) room, you'll find a ton of computer terminals. Along the southeast wall is a different kind of machine that you can interact with to use the Magnetic Decryptor. This will provide you with a new objective, tasking you with visiting the Arrival Building.Decypher the data at this machine.The Arrival Building is located on the northwestern side of the map, so you'll have to cross some open space to reach it efficiently. Be careful doing so, as some raiders like to try to snipe folks running out that way.Arrival Building locationWhen you arrive at the Arrival Building, head upstairs to the top level. Here, against the north by northwest wall will be another set of machines. These look a bit different than the one you toyed with back at the Fuel Control building, but they'll get the job done just the same.Decypher the data at these machines.Now that the quest is complete, you can leave via any of the elevators that are still functioning. They're all equally prone to have extraction campers, especially if you did this quest at night, but you should be fine as long as you find a safe spot to wait things out and keep your eyes and ears peeled. Don't forget to turn the quest in when you get back to Speranza.For more on Arc Raiders, check out our comprehensive guides hub.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]