[
  {
    "title": "Rockstar Accused Of Firing Grand Theft Auto Devs Over Union Organization",
    "url": "https://www.gamespot.com/articles/rockstar-accused-of-firing-grand-theft-auto-devs-over-union-organization/1100-6535862/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4594507-grandtheftautov2.jpg",
    "tag": "Gaming",
    "date": "2025-10-31T22:50:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Grand Theft Auto 6 is just over...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Grand Theft Auto 6 is just over six months away, but there's something brewing at the game's developer, Rockstar Games. The studio fired between 30 and 40 staff members from offices in the United Kingdom and Canada earlier this week. The terminated employees were reportedly attempting to unionize when they were let go.Bloomberg broke the story, and added that all of the fired employees were part of a private trade union chat group on Discord. According to a spokesperson for the Independent Workers' Union of Great Britain, the group was a mix of members who had already joined the union and others who were trying to organize a union at Rockstar.\"Rockstar has just carried out one of the most blatant and ruthless acts of union busting in the history of the games industry,\" said IWGB president Alex Marshall in a statement. \"This flagrant contempt for the law and for the lives of the workers who bring in their billions is an insult to their fans and the global industry.\"A spokesperson from Rockstar's parent company, Take-Two Interactive, said that it supported Rockstar's decision and alleged that the employees were terminated \"for gross misconduct, and for no other reason.\"This seems like the kind of dispute that may ultimately be settled inside of a courtroom, depending on what the British and Canadian courts have to say about it. This may take a long time for this to play out.Rockstar Games recently shared a job listing which predicted that GTA 6 will have the biggest launch in video game history. That seems very likely considering that Grand Theft Auto 5 passed 215 million in sales earlier this year, and GTA Online continues to be a cash cow for the company.Take-Two CEO Strauss Zelnick also noted that he isn't worried about AI competing with GTA, and he's been pretty consistent in his assessment of the technology. GTA 6 will hit PlayStation 5 and Xbox Series X|S on May 26, 2026.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Arc Raiders Roadmap Reveals New Map In November, Quests, And More In The Months Ahead",
    "url": "https://www.gamespot.com/articles/arc-raiders-roadmap-reveals-new-map-in-november-quests-and-more-in-the-months-ahead/1100-6535859/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1748/17481584/4594477-arcraiders.jpg",
    "tag": "Gaming",
    "date": "2025-10-31T18:11:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Embark Studios is clearly keen...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Embark Studios is clearly keen to keep building on the success of its latest game, Arc Raiders. The extraction shooter, which just launched to the biggest player numbers on Steam for the niche genre, is already growing and now there's a roadmap outlining its trajectory.Arc Raiders' roadmap provides a glimpse at the months ahead for the fresh third-person shooter on the market. As is typically the case, the live-service game will be receiving frequent updates fine-tuning the experience, ironing out any kinks, and steadily rolling out new cosmetics, feats and trials, as well as map conditions that should liven the playing field.Arc Raiders roadmap for the next several months.The most exciting news though has to do with two updates coming in November and December, respectively. The first is dubbed North Line, and it will feature an entirely new map called Stella Montis, bringing Arc Raiders' map count to five. North Line will also introduce a new community unlock event--these are typically goals and challenges for the entire game's community to work towards in order to unlock a reward--as well as equipment and quests. There will even be two new Arcs, the game's robotic enemies which tower over players, called the Matriarch and Shredder.Just a month later in December, another update called Cold Snap will be dropping just in time for the brisk winter holidays. As the name suggests, a new arctic map condition will arrive in the game as well as a complementary event called Flickering Flames. I reckon players should start preparing to fight one another in order to stay warm come December.Both updates will also let players rediscover \"what was lost in expanded Quests,\" according to Embark's announcement post. Only the Cold Snap update in December will pack in a Raider Deck though, Arc Raiders' rendition of a battle pass.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Why This Silly Duck Game Sold 2 Million Copies",
    "url": "https://www.gamespot.com/videos/why-this-silly-duck-game-sold-2-million-copies/2300-6466504/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1862/18620770/4594515-duckov_v1.jpg",
    "tag": "Gaming",
    "date": "2025-10-31T23:15:00.000Z",
    "description": "Click To Unmute        Arc Raiders 12 Tips We Wish We Knew Before playingWhy This Silly Duck Game Sold 2 Million CopiesVirtua Fighter 5 R.E.V.O. World Stage | Launch TrailerPoppy Playtime Chapter 5 -...",
    "body": "          Click To Unmute\n        Arc Raiders 12 Tips We Wish We Knew Before playingWhy This Silly Duck Game Sold 2 Million CopiesVirtua Fighter 5 R.E.V.O. World Stage | Launch TrailerPoppy Playtime Chapter 5 - Official Teaser TrailerTotal Chaos - \"Catharsis\" by Akira Yamaoka | Exclusive Music Preview TrailerMetal Gear Solid Delta: Snake Eater - FOX HUNT Launch TrailerPEAK - Roots Biome Update Teaser TrailerCall of Duty: Black Ops 7 - Everything To KnowAnimal Crossing: New Horizons – 3.0 Update and Switch 2 Edition Overview TrailerThe Outer Worlds 2: 5 Tips You Need To KnowArc Raiders Made Me Feel Like The Main Character | Final PreviewNBA The Run - Official Teaser Trailer\n        Want us to remember this setting for all your devices?\n      Sign up or Sign in now!\n      \n      Please use a html5 video capable browser to watch videos.\n    \n      This video has an invalid file format.\n    00:00:00Sorry, but you can't access this content!Please enter your date of birth to view this video\n        By clicking 'enter', you agree to GameSpot's\n                        Terms of Use and\n        Privacy Policy"
  }
]