[
  {
    "title": "Valve Tries Explaining Why This Game Was Banned From Steam Before It's Even Released",
    "url": "https://www.gamespot.com/articles/this-indie-game-has-been-banned-on-steam-before-its-even-released/1100-6536488/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4611791-horses.jpg",
    "tag": "Gaming",
    "date": "2025-11-26T15:47:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Update: Valve has now commented...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Update: Valve has now commented on this unusual situation, saying it requested to play Horses in 2023 due to \"content in the store page.\" That led to it sharing feedback and a subsequent decision to prevent the game from releasing on Steam.In a statement shared with Game Developer, Valve explained that the step to play the game was not unprecedented. \"This happens sometimes if content on the store page causes concern that the game itself might not fall within our guidelines,\" a spokesperson said. \"After our team played through the build and reviewed the content, we gave the developer feedback about why we couldn't ship the game on Steam, consistent with our onboarding rules and guidelines. A short while later the developer asked us to reconsider the review, and our internal content review team discussed that extensively and communicated to the developer our final decision that we were not going to ship the game on Steam.\"There's no further explanation regarding why this situation played out as it did, or whether the developer did make adjustments based on Valve's request. The original story follows.Earlier this year, Valve changed its rules to prevent adult games from having early-access releases on Steam. That came in the aftermath of a broader push against adult titles on Steam and Itch.io, largely at the behest of banks and payment processors. The upcoming indie horror game Horses is rated M for Mature, but it's not an adult title. Regardless, Steam informed the developer, Santa Ragione, that Horses was banned from the platform in 2023. The developer claims Valve has never explained its reasons for the ban in the two years since the ruling.Horses is a first-person title that casts players as a ranch hand who spends two weeks at an increasingly bizarre and unsettling farm. The horses in this game aren't horses at all. They're naked humans wearing horse masks who are forced to act like beasts of burden.          Santa Ragione insists that Horses is not pornographic, and the publisher jokingly added that it apologizes if it \"got your hopes up for horse porn.\" Instead, Santa Ragione says it's using \"challenging, unconventional material to encourage discussion. It invites players to examine why something feels the way it does, what it says about the characters and systems at work, and where their limits lie. It is about tension, not erotic content.\"According to the publisher, Valve never offered any guidance about what it found objectionable or what could have been changed to avoid a ban. Santa Ragione did share its belief that the ban may have been triggered by a scene in the game that originally featured a young girl riding on the shoulders of a naked adult woman in a horse mask. However, the publisher added that the scene in question has since replaced the girl with \"a twenty-something woman\" because the dialogue and the dynamic of that sequence was better served by using an older character.Without a Steam release, Santa Ragione admits that the studio may be at risk of shutting down. To recoup at least some of the $100,000 spent on development, Horses will get a PC release on Epic Games Store, Humble Store, GOG, and Itch.io on December 4. It will be priced at $5.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "World's Most Expensive Copy Of Fortnite Just Sold For An Eye-Popping Sum",
    "url": "https://www.gamespot.com/articles/worlds-most-expensive-copy-of-fortnite-just-sold-for-an-eye-popping-sum/1100-6536525/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4612479-screenshot2025-11-26at10.55.20%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-11-26T15:36:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          A rare physical copy of...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                A rare physical copy of Fortnite has sold at auction for $42,500. What made this copy so rare and valuable? The listing on the Heritage Auctions website said the sealed copy of the Xbox One version of the game with the Storm Master Weapon Pack was rated Wata 10 A++, and that's the highest grade possible.This physical version of the game, which was published by Gearbox, came out in 2017 before Fortnite blossomed to become the massively popular game it is today thanks to its battle royale mode. Some may recall that when Cliff Bleszinski revealed Fortnite to the world in 2011, it was a scavenging and survival game. Now, it's a cultural behemoth and the dominant player in the battle royale space with crossovers and collaborations galore, including numerous more to come in the new Chapter 7 update. The rare copy of Fortnite that was sold at auction on November 21 originally retailed for $60, so someone is probably making a nice return on this. Someone else on eBay is trying to sell a sealed copy of Fortnite on Xbox One for $7,000 right now. Another listing is asking $2,800.Fornite's current Simpsons season is wrapping up, with Chapter 7 set to begin on November 29. Players can expect Kill Bill and Back to the Future crossovers in the new season, among many others. For more, check out GameSpot's rundown of everything we know about Fortnite Chapter 7.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Battletoads Arrives On Nintendo Switch Online Alongside Three Other Classic Games",
    "url": "https://www.gamespot.com/articles/battletoads-arrives-on-nintendo-switch-online-alongside-three-other-classic-games/1100-6536516/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1597/15975876/4612385-battletoads.jpg",
    "tag": "Gaming",
    "date": "2025-11-26T14:15:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          While Nintendo usually limits...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                While Nintendo usually limits its Nintendo Switch Online drops to one platform at a time, today it is adding two new games each from two different classic platforms: Battletoads and Ninja Gaiden II: The Dark Sword Of Chaos for NES, and Kid Icarus: Of Myths and Monsters and Bionic Commando for Game Boy.Of the new additions, Rare's 1991 NES beat-em-up Battletoads is remembered by gamers for being one of the most difficult games of the era, with many planning a rematch as the game comes to Switch for the first time.The new drop of games also includes two sequels to games that are already part of the Nintendo Switch Online library. Tecmo's Ninja Gaiden II: The Dark Sword Of Chaos is the second game in the franchise's NES trilogy, following on from the original Ninja Gaiden, which is already on Nintendo Switch Online. Game Boy title Kid Icarus: Of Myths And Monsters is also a sequel to the original Kid Icarus, which is also available in the Nintendo Switch Online's NES library.The Game Boy version of Bionic Commando is the last classic game added today, and the first appearance of the franchise on Nintendo Switch Online. The Capcom platformer originated as an arcade game, which was adapted for NES, and then the NES version was adapted for Game Boy--swapping out its present-day setting for a futuristic one in the process.The base level of the Nintendo Switch Online subscription provides access to a number of classic games from the NES, SNES, and Game Boy, with new games regularly drip fed to the library. Subscribers on the Expansion Pack tier also get access to Nintendo 64, Game Boy Advance, and Sega Genesis games, while GameCube classics are exclusive to Expansion Pack members with a Nintendo Switch 2.Nintendo is adding a new platform to Expansion Pass early next year despite it being one of the company's biggest flops: Virtual Boy. Players will need to purchase a separate Virtual Boy accessory to play with this functionality, with a full plastic replica or a more budget-friendly cardboard version on offer.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]