[
  {
    "title": "Report Says Ubisoft Canceled A Splinter Cell Game That Became XDefiant, Director Speaks Out -- \"That Is Not True\"",
    "url": "https://www.gamespot.com/articles/ubisoft-canceled-a-splinter-cell-game-and-it-morphed-into-the-ill-fated-xdefiant-report/1100-6536236/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4602638-screenshot2025-11-14at2.41.01%E2%80%AFpm.png",
    "tag": "Gaming",
    "date": "2025-11-15T11:50:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Ubisoft was working on a new...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Ubisoft was working on a new Splinter Cell game that was going to embrace games-as-a-service before it shifted to become XDefiant, a game that the publisher shut down not long after release. This is according to Nick Herman, a developer who worked on the game before leaving to start AdHoc Studios, the team that just launched the episodic game Dispatch to great success. Following the publication of this report, XDefiant director Mark Rubin spoke out to react to the report and share his side of the story.\"I was so excited to be a part of this and help revitalize it, because it's been dormant for a while,\" Herman said told Bloomberg. \"And we thought we could tell a great story and do something the fans would love.\"The game was in development \"for a few months,\" Bloomberg reported, and Herman confirmed that Ubisoft wanted to have it feature games-as-a-service elements.\"We tried,\" Herman said. \"Let's make a narrative GAAS game. We were trying to make that make sense, and a lot of cool prototypes were made.\"The report said \"Ubisoft had lost interest\" in this Splinter Cell game and shifted to pursue a project that could attempt to compete with Call of Duty. This became XDefiant, a game directed by former Call of Duty boss Mark Rubin. The game shut down after a year and developers were laid off. \"We thought we were going to be able to make something really great,\" Herman said. \"And then you realize that all of the things you care about, they don't anymore. It's a common thing in games.\"Rubin, who directed XDefiant and is no longer with Ubisoft, shared his side of the story. He said it is \"not true\" that Ubisoft was working on a Splinter Cell game before switching to XDefiant. \"When I got to Ubisoft they had been working on a game for a year that was very ambitious but was struggling to find the fun. And it was NOT a Splinter Cell game. I then canceled that one and let the team pitch any game ideas they wanted,\" he said. \"There were some cool ones but I felt the scope/difficulty was too hard on some ideas so we stuck with an arena shooter and we found the fun quickly. So no we didn't pivot off Splinter Cell to make XDefiant. Now maybe they were thinking about working on Splinter Cell before I got there but it was never a thing while I was there. My experience with Ubisoft was they are very open to whatever the studio wants to do which is great but I do wish we could have used external engines.\"Saw the rumor from Bloomberg that we were working on Splinter Cell game before switching to Xdefiant. I can say that is not true. When I got to Ubisoft they had been working on a game for a year that was very ambitious but was struggling to find the fun. And it was NOT a Splinter…  — Mark Rubin (@PixelsofMark) November 15, 2025\n  While that Splinter Cell game is not coming to market, a Splinter Cell remake is now in the works. Outside of games, the Splinter Cell TV show Deathwatch debuted in October on Netflix and has already been renewed for a second season. A live-action movie was in the works, but apparently no longer is.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Arc Raiders Unexpected Initiative Quest Guide",
    "url": "https://www.gamespot.com/articles/arc-raiders-unexpected-initiative-quest-guide/1100-6536243/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/679/6794662/4602668-share_20251114_0831133-copy.jpeg",
    "tag": "Gaming",
    "date": "2025-11-14T20:32:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          The Unexpected Initiative quest...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                The Unexpected Initiative quest in Arc Raiders sends you to the Buried City map in search of Fertilizer and a Water Pump. You'll need to visit two separate--though thankfully close by--locations to interact with and loot these items, so you may be here wanting to know precisely where. You're in luck because we're going to fill you in.Note that the game will provide both Fertilizer and a Water Pump to you as part of this quest, but you can also find these in other places and turn them in from your own stash if you prefer. However, since the quest has to be done in a single Buried City raid to count, you do still have to visit both locations and loot them to check off the objectives either way. Either way, it's a good idea to bring in an augment with two safe pockets so that you keep both the Fertilizer and Water Pump you find, even if you don't manage to extract safely.Let's dive into where to find the Fertilizer and Water Pump for the Unexpected Initiatives quest.Where to find Fertilizer at the Grandioso ApartmentsThe Grandioso Apartments are located on the western side of the Buried City map. This is a large residential POI that is commonly visited by other raiders for its above-average loot. Keep an eye out for suspicious folks and be ready for a fight if absolutely necessary.Grandioso Apartments locationWhen you arrive, take the inner zipline up to the top floor, then take the nearby stairs up to the roof.Fertilizer locationHere, you'll find Fertilizer in some orange planting pots. Toss it in a safe pocket, then head to the Piazza Roma region for the next step.Where to find a Water Pump at the broken rooftop gardens at Piazza RomaPiazza Roma is just northeast of the Grandioso Apartments, making it only a short trek there after grabbing the Fertilizer. There are multiple buildings in this area, but you're headed for the building circled in the photo below. It's not a high-traffic POI, so there's a reasonable chance you won't run into anyone else here unless they're also doing the quest.Piazza Roma building locationWhen you arrive, walk between this building and the one below it to find a yellow ladder that will take you all the way to the roof. You can also work your way through the building normally if you prefer, but this is by far the most efficient route to the top.Take the yellow ladder to reach the roof efficiently.On the roof, check the water pump in the corner next to all of the large planters. Loot the Water Pump and stow it away in a safe pocket.Water Pump locationWith the Fertilizer and Water Pump collected, head to whichever metro station is still active closest to you and extract back to Speranza safely to complete the quest and move along to the next.For more, check out our full Arc Raiders quest list.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Arc Raiders After Rain Comes Quest Guide",
    "url": "https://www.gamespot.com/articles/arc-raiders-after-rain-comes-quest-guide/1100-6536245/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/679/6794662/4602760-share_20251114_0916501.jpeg",
    "tag": "Gaming",
    "date": "2025-11-14T21:03:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Arc Raiders occasionally sends...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Arc Raiders occasionally sends you topside to fix something and expects you to bring your own items to do so. One such quest is After Rain Comes, which tasks you with repairing some solar panels in Buried City. The last thing you'll want to do is show up to fix them and not have what you need, so we're here to help.You will need 2 Batteries and 5 Wires to complete After Rain Comes. You'll want to place these items in safe pockets if at all possible, as you wouldn't want to lose them due to a misstep, ARC battle, or non-friendly raider while making your way to the solar panels.When you're ready to hop in and fix those solar panels, here's what you need to know.Where to find Batteries and WiresBatteries and Wires can be just about anywhere, but they are very common drops found in any Technological or Electrical POI on any map. Unless you've been selling all of your items throughout the game thus far, you're likely to have some in your stash already, as they're quite plentiful. You can also recycle other electrical items like a Power Cable to get Wires, or recycle an Industrial Battery to get Batteries.However, if you're lacking in enough Batteries or Wires, the most efficient way to get and complete this quest is to simply buy them from Celeste in Speranza. This trader lets you purchase up to 10 Batteries and 10 Wires per day.That was easy. Let's go fix some stuff, raider.Where to find and repair the solar panels in Buried CityThe solar panels you need to repair for After Rain Comes can be located outside of the Grandioso Apartments on the west side of the map. This is a fairly high traffic area due to the apartments having pretty good loot, so keep an eye out for raiders who may be above you, as you'll need to do your work on the ground below.Find the solar panels here.When you arrive, you'll need to find a yellow box under one of the solar panels here. Interact with this and use the Batteries and Wires you brought in to repair it. This simple task will get things up and running again and finish the quest.Use the Batteries and Wires to repair this box.Now that you've completed the quest, you're free to head out at your own convenience. You don't need to extract, but it's obviously preferable if you do, so we'd recommend heading over to the Western Station slightly northeast of the solar panels to get out of dodge.For more, check out our full Arc Raiders quest list.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]