[
  {
    "title": "Finally, You Can Have A Little Friend In A Jar",
    "url": "https://www.gamespot.com/videos/finally-you-can-have-a-little-friend-in-a-jar/2300-6466639/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1862/18620770/4633243-gc_ces.jpg",
    "tag": "Gaming",
    "date": "2026-01-11T17:00:00.000Z",
    "description": "CES is a time for lots of new gaming tech. Like Razer's Project Ava, the little AI friend in a jar who hangs out on your desk. Or Project Motoko, a pair of headphones with cameras built into them so it can watch you play games and give you tips. It's weird. So Kurt and Lucy talk about it in this segment of Kurt & Lucy Gotcha Covered.",
    "body": "\n\n      Please use a html5 video capable browser to watch videos.\n    \n      This video has an invalid file format.\n    00:00:00Sorry, but you can't access this content!              \n        \nCES is a time for lots of new gaming tech. Like Razer's Project Ava, the little AI friend in a jar who hangs out on your desk. Or Project Motoko, a pair of headphones with cameras built into them so it can watch you play games and give you tips. It's weird. So Kurt and Lucy talk about it in this segment of Kurt & Lucy Gotcha Covered.By \n    Lucy James\n  , \n    Kurt Indovina\n  , and \n    Jean-Luc Seipke\n   on January 11, 2026 at 9:00AM PST          \n                              \n      \n                        "
  },
  {
    "title": "Disney Pixar Luxo Jr. Lego Set On Sale For The First Time At Amazon",
    "url": "https://www.gamespot.com/articles/disney-pixar-luxo-jr-lego-ideas-building-set-best-deal-all-easter-eggs/1100-6537316/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4633548-luxojrlegoset.png",
    "tag": "Gaming",
    "date": "2026-01-12T07:41:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               Pixar fans can save 10% on Lego's 613-piece model of Luxo Jr. and the Pixar Ball. Normally $70, Lego Ideas: Disney Pixar Luxo Jr. is on sale for $63. Lego's recreation of the iconic Pixar mascot launched last June and has rarely budged from its MSRP. The current discount is the best we've seen for the set, but it's not marked as an official deal. Over the past few weeks, Luxo Jr.'s price on Amazon has sometimes changed multiple times in a single day, so we wouldn't be surprised if the the price has changed again by the time you read this story.                                 Lego Ideas: Disney Pixar Luxo Jr. (613 Pieces)                                                                $63 (was $70)                                                                                                                                                                                    The 613-piece replica of Luxo Jr. measures 5.5 x 4 x 11 inches--though Luxo Jr.'s height varies based on how you pose it. Luxo Jr. can stand next to the buildable Pixar Ball or balance on top of it by making a couple of simple adjustments.Lego designed Luxo Jr. as a fully articulated model capable of being displayed in poses from the iconic Pixar production logo and short film starring the semi-anthropomorphic lamp. The light bulb doesn't actually work, but Lego did a good job of making it look realistic.As a Lego model, Luxo Jr. is quite different than the vast majority of Disney Pixar building sets. Designed for experienced builders and collectors, the model has an interesting build process thanks to its multi-hinged arm, modifiable base, and the many Easter Eggs Lego worked into the authentic recreation.There are dozens of references to Pixar movies hidden throughout the Luxo Jr. and Pixar Ball builds. For instance, the Pizza Planet truck from the first Toy Story movie is included inside the light bulb. The lamp's base has a miniature build referencing Marlin & Dory from Finding Nemo as well as clever allusions to Inside Out, Cars, Coco, WALL-E, A Bug's Life--and possibly others that we missed.The instruction booklet calls out the Finding Nemo character builds as well as the mini-builds found in the Pixar Ball. The interior of the colorful ball features multiple characters from five different Pixar movies:Toy Story - Woody & BuzzUp - Carl & RussellMonsters, Inc. - Mike & SullyThe Incredibles familyRatatouille - Linguini & RemyAs mentioned, one of the display modes is Luxo Jr. \"deflating\" the toy ball, just like in the production logo's animation sequence. Once you remove two of the rounded plates from the ball, Luxo Jr. can connect to the top. It's a quick and easy modification. The Pixar Ball has its own buildable stand, so the model still feels stable with Luxo Jr. on the ball.                      Lego Ideas: Disney Pixar Luxo Jr. (21357)Luxo Jr. was the star of Pixar's first short film in 1986. It was nominated for the Academy Award for Best Animated Short, but most Pixar fans were introduced to the character when it hopped across the screen to complete the Pixar logo at the beginning of Toy Story in 1995. The short film originally only played at film festivals and conventions, but it eventually played in theaters worldwide before screenings of Toy Story 2 in 1999.  Luxo Jr. the building set is a member of the Lego Ideas collection. The original pitch was submitted by a fan back in 2022 and was approved by Lego about two years later in November 2024. As always, the retail edition looks different than the concept images, but the hinges on Luxo Jr.'s arm look quite similar overall.                                                                                                                                               Lego launched a bunch of new Disney building sets on January 1, including a very popular Speed Champions Lightning McQueen race car that has been difficult to find in stock. At the time of writing, the 270-piece set is in stock at Target and Walmart for $28. Fans of Pixar's Cars franchise can also place an order from the Lego Store, but new orders aren't estimated to ship for 60 days.If you love Disney's Pirates of the Caribbean franchise, Lego's 2,862-piece recreation of Captain Jack Sparrow's Ship is now available at Amazon for $380. The highly detailed model originally launched as a Lego Store exclusive last September, but now you can find it at major retailers. The model measures 25 x 9 x 25 inches and comes with nine Lego minifigures.                                                                                                                                               Sign up for GameSpot's Weekly Deals Newsletter:                                Lego Lord Of The Rings Book Nook Gets First Discount At Amazon                         Save 50% On New Limited-Edition 4K Blu-Rays At Amazon                         Recently Released 4K Blu-Rays Are 3 For $33 At Amazon                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 TMNT Magic: The Gathering Booster Box Preorders Steeply Discounted                         Budget-Friendly Sonic Racing: CrossWorlds Lego Sets Are Available Now                         Lego Harry Potter 25th Anniversary Sets Have Arrived, Including A New Collector's Edition                         New Lego Star Wars BB-8 Droid Building Set Is Available Now                         Double Nintendo Switch 2 Console Storage For Only $33 With Samsung MicroSD Express Deal    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n"
  },
  {
    "title": "RAM Shortages May Lead To More Expensive TVs And Devices, Warns Samsung",
    "url": "https://www.gamespot.com/articles/ram-shortages-may-lead-to-more-expensive-tvs-and-devices-warns-samsung/1100-6537306/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4633166-samsungtv.jpg",
    "tag": "Gaming",
    "date": "2026-01-09T20:45:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          The increasing demand for AI...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                The increasing demand for AI among tech companies is one of the reasons why the global shortage of memory chips remains an ongoing issue. And while it's expected to adversely affect the production of smartphones, Samsung Electronics co-CEO T M Roh has warned that TVs and home appliances may also be hit by shortages and increased prices.\"As this situation is unprecedented, no company is immune to its impact,\" said Roh via Reuters. According to the report, Roh noted that TVs and home appliances will also feel the pinch from the shortages and he didn't rule out price hikes to compensate for them. Samsung is the biggest manufacturer of TVs in the world, and Roh said it the impact of the RAM shortages will be \"inevitable.\"The rise in consumer-electronic prices would also throw a large wrench in Microsoft's ongoing \"This Is an Xbox\" strategy, as smart TVs, including those made by Samsung, are among the growing list of platforms capable of playing Game Pass titles.The lone bright spot from Roh's comments is that he mentioned that Samsung is working with its production partners on strategies to minimize the impact of the memory shortages.A recent report suggests that Nvidia may take a different approach to the increasingly high GPU prices by resurrecting its previously discontinued GeForce RTX 3060 GPUs. That has yet to be confirmed by Nvidia, which phased out the GeForce RTX 3060 GPUs in favor of the 40 and 50 series GPUs, both of which were more expensive and more advanced.As for Samsung, the company touted its plans to use Google's Gemini AI in 800 million units this year, which will continue the need for RAM across its family of products.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]