[
  {
    "title": "Game Pass Dumps These Six Games Very Soon",
    "url": "https://www.gamespot.com/gallery/game-pass-dumps-these-games-very-soon/2900-7161/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4589242-xgp.jpg",
    "tag": "Gaming",
    "date": "2025-11-04T14:11:00.000Z",
    "description": "By     Eddie Makuch   on November 4, 2025 at 6:11AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Eddie Makuch\n   on November 4, 2025 at 6:11AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                See yaSeveral games are leaving the Xbox Game Pass library this month, as a frigid strategy game, a zen-like simulator, and a trek into the Exclusion Zone of Chornobyl won't be around for much longer. If you're looking to own any of these games, you can get a 20% discount on them through your Game Pass subscription.Five games will be making their exit in November, and this will be the first wave of departures for the month. On the positive side, November will see several new additions to the Game Pass library, headlined by Call of Duty: Black Ops 7 for Xbox Game Pass Ultimate subscribers.Other games being added to the service include the horror game Dead Static Drive, the charming winter survival game Winter Burrow, and the egg-citing Egging On. The yolks write themselves with this one.As a reminder, the 50% price hike on Xbox Game Pass Ultimate goes into effect this month.Blacksmith MasterBlacksmith Master leaves Game Pass for cloud, console, and PC on November 15.Football Manager 2024Football Manager 2024 leaves Game Pass for PC on November 15. Football Manager 2024: Console EditionFootball Manager 2024: Console Edition leaves Xbox Game Pass on November 15. FrostpunkFrostpunk leaves Game Pass for cloud, console, and PC on November 15. SpiritteaSpirritea leaves Game Pass for cloud, console, and PC on November 15. Stalker 2: Heart of ChernobylStalker 2: Heart of Chernobyl leaves Game Pass for cloud, console, and PC on November 15.     \n  \n                      "
  },
  {
    "title": "Top 10 Best-Selling Nintendo Switch Games Of All Time",
    "url": "https://www.gamespot.com/gallery/best-selling-nintendo-switch-games-of-all-time/2900-5070/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4255601-screenshot2024-02-06at8.44.46am.png",
    "tag": "Gaming",
    "date": "2025-11-04T13:28:00.000Z",
    "description": "By     Eddie Makuch   on November 4, 2025 at 5:28AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Eddie Makuch\n   on November 4, 2025 at 5:28AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Best-sellersAs it does every three months when it releases a quarterly sales report, Nintendo has provided new sales numbers for the best-selling Switch games of all time. There are pretty much no surprises on the list.At the top of the charts is Mario Kart 8 Deluxe, which has sold an astonishing 69.56 million copies as of September 30 30, 2025. The figure includes copies sold in hardware bundles, but it's an impressive number all the same. For comparison, Red Dead Redemption II and The Witcher 3: Wild Hunt have sold 50 million copies each.The rest of the top five best-selling Switch games include Animal Crossing: New Horizons (48.62 million copies), Super Smash Bros. Ultimate (36.93 million copies), The Legend of Zelda: Breath of the Wild (33.34 million copies), and Super Mario Odyssey (29.84 million copies).Click through the gallery to see all the best-selling Switch games and their lifetime sales figures, as shared by Nintendo.The figures shared in this gallery cover worldwide sales, spanning both physical and digital units.The Switch, meanwhile, has now sold more than 150 million units.#10: New Super Mario Bros. U Deluxe -- 18.53 million#9: Super Mario Party -- 21.23 million#8: The Legend of Zelda: Tears of the Kingdom -- 22.15 million#7: Pokemon Sword/ Pokemon Shield -- 26.96 million#6: Pokemon Scarlet/ Pokemon Violet -- 27.61 million#5: Super Mario Odyssey -- 29.84 million#4: The Legend of Zelda: Breath of the Wild -- 33.34 million#3: Super Smash Bros. Ultimate -- 36.93 million#2: Animal Crossing: New Horizons -- 48.62 million#1: Mario Kart 8 Deluxe -- 69.56    \n  \n                      "
  },
  {
    "title": "Game Pass Adds Black Ops 7 And Five More Day-One New Releases In A Big Month For The Service",
    "url": "https://www.gamespot.com/gallery/game-pass-adds-black-ops-7-and-five-more-day-one-new-releases-this-month/2900-7210/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4596208-screenshot2025-11-04at9.31.39%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-11-04T14:36:00.000Z",
    "description": "By     Eddie Makuch   on November 4, 2025 at 6:36AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Eddie Makuch\n   on November 4, 2025 at 6:36AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Lots of new gamesIt's a big month for Xbox Game Pass, as Microsoft is releasing a whopping six day-one new releases into the catalog in the first half of the month alone. Among the brand-new releases that are debuting into the catalog is Call of Duty: Black Ops 7 on November 14, and it's arguably Microsoft's biggest release of the whole year.Other day-one new releases for Game Pass for the first half of November 2025 include Dead Static Drive, Egging On, Whiskerwood, Pigeon Simulator, and Winter Burrow.Microsoft is expected to announce a second wave of titles for Game Pass later this month, so check back later for that.In terms of removals, Microsoft is dumping six titles on November 15, including Stalker 2, which launched in 2024 as a console exclusive for Xbox.Microsoft recently announced a huge price hike for Xbox Game Pass Ultimate, raising the monthly cost from $20 to $30. Most major retailers have not adopted the price hike, though, as Game Pass Ultimate remains $20 at GameStop, Amazon, Best Buy, and others.Call of Duty: Black Ops 7 Call of Duty: Black Ops 7 comes to Game Pass Ultimate and PC Game Pass on November 14 for cloud, console, and PC. This is a day-one new release.Dead Static Drive Dead Static Drive comes to Game Pass Ultimate and PC Game Pass on November 5 for cloud, console, and PC. This is a day-one new release.Sniper Elite: Resistance Sniper Elite: Resistance comes to Game Pass Premium on November 5 for cloud, console, and PC. Egging On Egging On comes to Game Pass Ultimate and PC Game Pass on November 6 for cloud, PC, and Xbox Series X|S. This is a day-one new release.Whiskerwood Whiskerwood comes to Game Pass Ultimate and PC Game Pass on November 6. This is a day-one new release.Voidtrain Voidtrain comes to Game Pass Ultimate, PC Game Pass, and Game Pass Premium on November 7 for cloud, PC, and Xbox Series X|S.Great God Grove Great God Grove comes to Game Pass Ultimate, PC Game Pass, and Game Pass Premium on November 11 for cloud, PC, and Xbox Series X|S.Lara Croft and the Temple of Osiris Lara Croft and the Temple of Osiris comes to Game Pass Ultimate, PC Game Pass, and Game Pass Pass Premium on November 11 for cloud, console, and PC.Pigeon Simulator Pigeon Simulator comes to Game Pass Ultimate and PC Game Pass on November 11 for cloud, PC, and Xbox Series X|S. This is a day-one new release.Relic Hunters Legend Relic Hunters Legend comes to Game Pass Ultimate, PC Game Pass, and Game Pass Premium on November 12 for cloud, console, and PC.Winter Burrow Winter Burrow comes to Game Pass Ultimate and PC Game Pass on November 12 for cloud, console, and PC. This is a day-one new release.    \n  \n                      "
  }
]