[
  {
    "title": "Capcom Fighting Collection 2 Is 40% Off In Amazon's Black Friday Sale",
    "url": "https://www.gamespot.com/articles/capcom-fighting-collection-2-black-friday-deal/1100-6535985/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1701/17013431/4599867-capcol2bf.jpg",
    "tag": "Gaming",
    "date": "2025-11-20T08:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               Thanks to Amazon's early Black Friday price cuts, you can take a trip back to the arcade golden age with a big discount on the Capcom Fighting Collection 2. The Nintendo Switch and PS4 versions are on sale for just $25--that's nearly 40% off their usual $40 price. Both of these games are backward compatible, meaning you can play the Switch version on Switch 2 and the PS4 version on PS5.                                 Capcom Fighting Collection 2                                                                $25 (was $40)                                                                                                                                                                                    Capcom Fighting Collection 2 is the latest multi-game compilation from the storied Japanese video game publisher Capcom. This collection includes eight games from the company's legacy catalog, most of which launched on PlayStation, Sega Dreamcast, and arcades in the late 1990s and early 2000s. The headliner inclusions are Capcom vs. SNK and Capcom vs. SNK 2, which are landmark crossover fighters featuring a mixed roster of characters from Capcom series like Street Fighter, alongside characters from SNK-made games like King of Fighters. Capcom and SNK are two of the biggest fighting game developers, and back in the '90s and 2000s, were engaged in a friendly rivalry that culminated in several crossover games, including the Capcom-made Capcom vs SNK games and the SNK-developed SNK vs Capcom duology.Other notable inclusions in the collection are both Power Stone games, which were popular 3D arena fighters that originally launched on the Sega Dreamcast. There are also some lesser-known gems like Project Justice and Plasma Sword. Here is the full list of included games:Capcom Fighting EvolutionCapcom vs. SNK: Millennium Fight 2000 ProCapcom vs. SNK 2: Mark of the Millennium 2001Plasma Sword: Nightmare of BilsteinProject JusticePower StonePower Stone 2Street Fighter Alpha 3 UPPEREach game in Capcom Fighting Collection 2 features online matchmaking with rollback netcode and new quality-of-life options, including a training mode, mid-match saves (for offline single-player modes), and one-button special attacks. The collection also includes an extensive gallery of concept and promotional art for each game.                      The Black Friday deal only applies to physical Switch and PS4 editions of Capcom Fighting Collection 2, but the game is also available digitally on both consoles and on PC.While this collection only includes Capcom's half of the crossover fighters it made in collaboration with SNK, fans who want to revisit SNK's contributions can pick up SNK vs. Capcom: SVC Chaos, which got a new standalone remaster for Switch, PS4, and PC in 2024. Like the games in the Capcom Collection, the enhanced port of SVC Chaos features online matchmaking with rollback netcode and upscaled visuals.For more crossover fighting games, be sure to check out the Marvel vs. Capcom Fighting Collection, which launched for Switch, PlayStation, Xbox, and PC in 2024, and includes seven Capcom-made fighting games and beat-em-ups featuring Marvel characters. The publisher also released the Capcom Fighting Collection and Street Fighter 30th Anniversary Collection a few years ago. Physical copies for all three games are available at Amazon, and you can also grab digital editions on PC and console. In fact, the PC versions often go on sale at Fanatical.Disclosure: GameSpot and Fanatical are both owned by Fandom.More Early Black Friday Deals at AmazonVideo Game DealsPS5 Game DealsNintendo Switch Game DealsXbox Series X Game DealsVideo Game Accessory DealsPS5 Accessory DealsSwitch Accessory DealsXbox Accessory DealsController DealsSwitch 1/2 Controller DealsPS5 Controller DealsXbox Controller DealsPC Controller Deals                                                                                                                                               Sign up for GameSpot's Weekly Deals Newsletter:                                Evercade Retro Handhelds & Cartridges Get Rare Price Cuts In Amazon's Black Friday Sale                         Kirby Air Riders Buying Guide: Release-Day Delivery Still Available At Amazon                         Meta Quest 3S Black Friday Deal - Save Up To $70 And Get $50 Amazon Credit                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Grab A Wireless GameCube-Style Controller For Switch 1/2 & PC For Only $40                         Amazon-Exclusive Lunar Remastered Collection Gets First Price Cut                         Final Fantasy Magic: The Gathering Deal - Save $45 On Play Booster Box                         Sunrise On The Reaping New Collector's Gift Edition Is Already Discounted At Amazon                         Lego DC Batman Figure & Bat-Pod Is Over 50% Off At Amazon, Sold Out Everywhere Else    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n        \n\t\n\t\tLatest in\n\t\tCapcom Fighting Collection 2\n\t\n\n\n            \n    "
  },
  {
    "title": "Hell is Us Is $10 Off In Amazon's Early Black Friday Sale",
    "url": "https://www.gamespot.com/articles/hell-is-us-is-black-friday-deals/1100-6536104/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1701/17013431/4601492-hellisusbf25.jpg",
    "tag": "Gaming",
    "date": "2025-11-20T08:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               New-in-box copies of Hell is Us are discounted on Amazon as part of their Black Friday deals. You can get the PlayStation 5 or Xbox Series X versions for $40 (was $60). The semi-open world action RPG launched just a few weeks in September, so this discounted price is a good time to jump in if you've been curious about the game.                                 Hell is Us                                                                $40 (was $60)                                                                                                                                                                                    The standard physical edition of Hell Is Us comes in a standard box and includes the full game on your platform of choice. There is no extra content like the Deluxe Edition. It's not a short adventure by any means, so even the base game offers plenty of content to keep you engaged in its world and combat for hours to come. The game is also identical across PS5 and Xbox, though technical performance is a smidge smoother on Xbox, in case you happen to own both systems.                      Hell is Us is a dark and dreary open-world action game that refuses to hold your hand. Compared to other similar games, there are no overwhelming map markers, excessive side quests, points of interest, and so on. Instead, the game encourages you to find your own way through its world without giving you so much as a hint. For some gamers, this may be a hindrance, but seasoned veterans of the genre may appreciate the change. Despite this, the world is much more forgiving than you'd think, and doesn't aim to make exploration too complicated, at least according to our 7/10 review by Alessandro Barbosa.For more Black Friday deals, check out GameSpot's hub for all the latest discounts on video games, Blu-rays, anime, and much more.More Early Black Friday Deals at AmazonVideo Game DealsPS5 Game DealsNintendo Switch Game DealsXbox Series X Game DealsVideo Game Accessory DealsPS5 Accessory DealsSwitch Accessory DealsXbox Accessory DealsController DealsSwitch 1/2 Controller DealsPS5 Controller DealsXbox Controller DealsPC Controller Deals                                                                                                                                               Sign up for GameSpot's Weekly Deals Newsletter:                                Evercade Retro Handhelds & Cartridges Get Rare Price Cuts In Amazon's Black Friday Sale                         Kirby Air Riders Buying Guide: Release-Day Delivery Still Available At Amazon                         Meta Quest 3S Black Friday Deal - Save Up To $70 And Get $50 Amazon Credit                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Grab A Wireless GameCube-Style Controller For Switch 1/2 & PC For Only $40                         Amazon-Exclusive Lunar Remastered Collection Gets First Price Cut                         Final Fantasy Magic: The Gathering Deal - Save $45 On Play Booster Box                         Sunrise On The Reaping New Collector's Gift Edition Is Already Discounted At Amazon                         Lego DC Batman Figure & Bat-Pod Is Over 50% Off At Amazon, Sold Out Everywhere Else    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n        \n\t\n\t\tLatest in\n\t\tHell is Us\n\t\n\n"
  },
  {
    "title": "Save 25% On The Wireless SteelSeries Arctis GameBuds",
    "url": "https://www.gamespot.com/articles/steelseries-arctis-gamebuds-deals-bf2025/1100-6536234/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1701/17013431/4607319-steelseriesbf.jpg",
    "tag": "Gaming",
    "date": "2025-11-20T08:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               The premium SteelSeries Arctis GameBuds are discounted to $150 (was $200) in Amazon's next round of early Black Friday deals. The wireless earbuds support everything from PS5 and mobile to Xbox and PC, making them a sleek, portable alternative to standard gaming headsets. And while they might be small, they're still packed with useful features for gaming--including a four-microphone array for noise cancellation and hundreds of audio presets for different games.                                 SteelSeries Arctis GameBuds                                                                $150 (was $200)                                                                                                                                                                                    The GameBuds are available in two formats, one for PS5 and one for Xbox. The Xbox format is likely the best choice for most shoppers, as it's compatible with Xbox, Switch, PC, mobile, and PS5, while the PS5 format drops support for Xbox. Aside from that difference, the specs are identical, including support for 2.4Ghz and Bluetooth wireless connections, a four-microphone array for noise cancellation, transparency mode, 360-degree spatial audio, a 10-hour battery life (up to 40 with the included case), and presets for various games accessible via the SteelSeries companion mobile app.                       As usual, a variety of eartip sizes are included with the bundle, ensuring you find a comfortable fit. And if you decide to take them on the road with you, you'll be glad to know they're IP55-rated for dust and splash resistance. These would be an ideal fit for someone who is constantly on the road, as transporting the earbuds is much easier than a bulky headset. In other words, you could easily pack these away for a holiday vacation--ensuring you have premium sound for all your games regardless of location.Amazon is discounting a bunch of other SteelSeries headsets for Black Friday. This includes everything from the affordable Arctis Nova 3P and 3X to the ultra-premium Arctis Nova Pro Wireless. Some of these are seeing up to $100 price cuts, making it a great time to upgrade your audio. Be sure to give them all a look, especially if you're looking to get an edge in multiplayer games like Call of Duty: Black Ops 7 or Battlefield 6, which seriously benefit from clear audio and the ability to hear nearby enemies. We've listed all the early Black Friday SteelSeries headset deals below, and you'll find even more discounts on video games, hardware, and accessories at GameSpot's Black Friday Deals Hub.More SteelSeries Arctis Black Friday 2025 DealsSteelSeries Arctis GameBuds (PS5, PC, Switch, Mobile) -- $150 ($200)SteelSeries Arctis GameBuds (Xbox, PS5, PC, Switch, Mobile) -- $150 ($200)SteelSeries Arctis Nova 3P Wireless Headset (PS5, PC, Switch, Mobile) -- $90 ($110)SteelSeries Arctis Nova 3X Wireless Headset (Xbox, PS5, PC, Switch, Mobile) -- $90 ($110)SteelSeries Arctis Nova 5 Wireless Headset (PS5, PC, Switch, Mobile) -- $105 ($150)SteelSeries Arctis Nova 5P Wireless Headset (PS5, PC, Switch, Mobile) -- $105 ($150)SteelSeries Arctis Nova 5X Wireless Headset (Xbox, PS5, PC, Switch, Mobile) -- $105 ($150)SteelSeries Arctis Nova 7P Wireless Headset (PS5, PC, Switch, Mobile) -- $120 ($200)SteelSeries Arctis Nova Wired Headset (Xbox, PC, Switch) -- $150 ($250)SteelSeries Arctis Nova Pro Wireless (PS5, PC, Switch, Mobile) -- $290 ($380)SteelSeries Arctis Nova Pro Wireless (Xbox, PS5, PC, Switch, Mobile) -- $290 ($380)                                                                                                                                               Sign up for GameSpot's Weekly Deals Newsletter:                                Evercade Retro Handhelds & Cartridges Get Rare Price Cuts In Amazon's Black Friday Sale                         Kirby Air Riders Buying Guide: Release-Day Delivery Still Available At Amazon                         Meta Quest 3S Black Friday Deal - Save Up To $70 And Get $50 Amazon Credit                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Grab A Wireless GameCube-Style Controller For Switch 1/2 & PC For Only $40                         Amazon-Exclusive Lunar Remastered Collection Gets First Price Cut                         Final Fantasy Magic: The Gathering Deal - Save $45 On Play Booster Box                         Sunrise On The Reaping New Collector's Gift Edition Is Already Discounted At Amazon                         Lego DC Batman Figure & Bat-Pod Is Over 50% Off At Amazon, Sold Out Everywhere Else    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n"
  }
]