[
  {
    "title": "Want A Bunch Of Free eShop Games This Holiday Season? Here's How",
    "url": "https://www.gamespot.com/articles/want-a-bunch-of-free-eshop-games-this-holiday-season-heres-how/1100-6536951/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4622063-bullets%26brains.jpg",
    "tag": "Gaming",
    "date": "2025-12-12T21:06:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          If you want to get your hands...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                If you want to get your hands on nearly a dozen free Switch games this holiday season, now's your chance. Starting today, No Gravity Games is giving away one Switch title per day through December 19, on which day there will be three free games. However, there is a catch that works out in your favor.          To claim a free game on Switch, players need to have claimed the previous day's title and maintained it in their library. You must also have at least one No Gravity title prior to claiming the first freebie, but there's a trick you can use to get that for free, too. Just visit No Gravity Games' official site and sign up for the newsletter, and you'll receive a free game. If you do this first, it will count as a \"purchased\" game from No Gravity and you're able to then claim the other games for free.If players do miss a day, they can rejoin the giveaway chain by purchasing the previous day's game, which will be available at a greatly reduced price. Each title becomes available for free at midnight PT and they will be available to claim on Nintendo's eShop until 11:59pm PT on the same day.While most of the free games are currently unrevealed, the first one is Bullets & Brains, a top-down arcade-style 3D shooter that pits players against an endless army of the living dead. Wreckin' Ball Adventure, Creepy Tale, Alder's Blood, and Destropolis are all glimpsed in the Switchmas Giveaway trailer above, but not yet confirmed as titles for this year's giveaway.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "The Best Nintendo Switch And Switch 2 Exclusives Of 2025",
    "url": "https://www.gamespot.com/gallery/the-best-nintendo-switch-and-switch-2-exclusives-of-2025/2900-7323/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4619788-bestswitchlarge.jpeg",
    "tag": "Gaming",
    "date": "2025-12-13T17:00:00.000Z",
    "description": "By     Chris Pereira  ,     Steve Watts  , and     Jessica Cogswell   on December 13, 2025 at 9:00AM PST                                GameSpot may receive revenue from affiliate and advertising...",
    "body": "\n                            \nBy \n    Chris Pereira\n  , \n    Steve Watts\n  , and \n    Jessica Cogswell\n   on December 13, 2025 at 9:00AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                It's always a big year when a new console launches, and 2025 saw a much-anticipated one: Nintendo Switch 2. After bouncing around between radically different concept launches through its last few generations, Nintendo delivered a more iterative follow-up with the Switch 2, but that's because it had a formula that worked.Many of 2025's best Switch games are available on both Switch and Switch 2, so in choosing the year's best exclusives for the platforms, we considered games from both generations. What you'll find below are the five best games released in 2025 that aren't currently available on any other console (PC is okay). That resulted in several games produced by Nintendo itself, along with a pair that were not: one a phenomenal sequel to a brilliant game, and the other a bold experiment that is well worth your time.Be sure to also check out our choices for the 10 best games of 2025, and if you're interested in more recommendations, you can check out our running lists of the best Switch games and best Switch 2 games to play right now.Metroid Prime 4: BeyondAvailable on Nintendo Switch, Nintendo Switch 2The return of Metroid Prime with a long-anticipated fourth installment was a highlight of this year's Nintendo lineup and put a bow on the first calendar year of the Nintendo Switch 2. The return of Samus is a beautiful exploration adventure that captures what makes the series so special, and why fans have been on the edge of their seats since it was first teased almost a decade ago.This latest adventure strands Samus on Viewros, a dead planet in the furthest reaches of space, once occupied by psychic beings, the Lamorn. In their desperate final days, the Lamorn went searching for a savior, and the echoes of their extinct civilization found Samus--their final hope to preserve their knowledge and culture. As Samus treks across Viewros looking for lost artifacts that will help her teleport off-planet, she discovers she isn't alone. The quest becomes a rescue mission for stranded Federation officers, watched by the shadow of the villainous Sylux.Though Prime 4 has more characters than some past games, it still excels at delivering moody, isolated moments of exploration as you get lost in the cavernous recesses of Viewros. Meanwhile the combat has never been sharper, thanks to a wide variety of control options. It's been a long wait for Metroid Prime 4: Beyond, but for Metroid fans, the wait has been worth it. -- Steve WattsMetroid Prime 4: Beyond reviewMario Kart WorldAvailable on Nintendo Switch 2Given that Mario Kart 8 Deluxe has ruled the Switch for years after its release, it only made sense that Mario Kart World would headline the launch of the Switch 2. Kart racing fans were treated to a great sequel with playful additions and fantastic new modes, along with a completely reimagined approach toward track design.In Mario Kart World the star of the show is the world itself, connecting tons of familiar Mushroom Kingdom mainstays into one contiguous map that can be driven from one end to the other. You can roam around freely with your friends, but the more important application of this is the design that seamlessly transitions from one track to another as you make your way through the various cups. It's a real treat for Mario Kart fans to see how the world has been reimagined as a single physical space. The new Knockout Tour mode makes great use of the open-world space by turning the race into a tense marathon where players are progressively eliminated after every milestone.Meanwhile, a smaller roster has been given a full makeover with cartoonish features and a wide variety of outfits, and rounded out with oddball selections like Cow. And Rainbow Road, always the highlight of a new Mario Kart, wows with its impressive scope and variety.If there's one fault with Mario Kart World, it's that it can't quite replace the fit and finish that has slowly accumulated on Mario Kart 8 Deluxe over the years. Kart racing fans will likely keep playing both for some time to come, but it's hard to complain about an embarrassment of riches. -- Steve WattsMario Kart World reviewThe Hundred Line: Last Defense AcademyAvailable on Nintendo Switch, Nintendo Switch 2Switch and Switch 2 are ideal platforms for visual novels and games you keep coming back to--and The Hundred Line, once it gets its hooks into you, is exactly the sort of game you'll be returning to for a long time to come. It starts out as an enjoyable blend of visual novels and tactics games, taking you on a 30-to-40-hour adventure that's sure to appeal to Danganronpa fans. The Hundred Line sees a group of kids taken away to a secret school they must defend from waves of monsters, all under the pretense of defending humanity--though you're initially left without a clear explanation for why this is happening.That is all a very good experience, but it's only once you reach the \"end\" of the story that you're introduced to what's the real meat of the experience. The specifics are best left for you to discover yourself, but suffice it to say that ending is only the beginning of a much longer tale: one that causes you to completely rethink the entire experience. It's a bold, big swing from its developer, and one that is truly remarkable--there aren't many other games with a twist that leads you to a far more substantial, interesting game than you thought you were playing.The visual novel and turn-based nature of the game lends itself well to being played on a handheld, letting you easily chip away at a bit of progress at a time, but don't be surprised if you find yourself glued to your screen until late in the night as you seek to piece together just what's going on. -- Chris PereiraHades 2Available on PC, Nintendo Switch, and Nintendo Switch 2Though Hades II might have first launched in early access on PC, its full release saw it make the jump to just one other system: the Nintendo Switch. Yet even if Hades II were available on PlayStation and Xbox as well, let's be honest, it just feels right on the pick-up-and-go console. A large part of this is due to Hades II's roguelike nature, which lends itself well to shorter bursts of play and makes it a great choice for commuters or those on the go. That said, I can personally attest to it being a fantastic binge-in-bed game as well.To be clear, though, Hades II is a fantastic game wherever you play it. The follow-up to 2019's Hades, Hades II marks the next entry in Supergiant Games' epic reconstruction of Greek mythology. Whereas its predecessor followed Zagreus--son of Hades and Persephone and prince of the Underworld--Hades II follows his younger sister, Melinoe, a young witch who was tragically torn apart from her family as a baby. Following extensive training under Hecate's watchful eyes, Melinoe embarks on a journey to defeat the titan Chronos, reunite with the family she's never known, and restore peace to both the Underworld and Mt. Olympus.Along the way, Greek gods and mythological figures alike will opt to either help or hunt Melinoe, who remains relentless and steadfast in her quest regardless of many, many, many times she will ultimately be forced to return to the Crossroads and restart her mission. All of this--accompanied by stylish visuals, spectacular music, plenty of charming and well-acted characters, and compulsive gameplay--make Hades II a must-play title. -- Jessica CogswellHades II reviewDonkey Kong Bananza Available on Nintendo Switch 2If I had to choose one word that best encapsulates Nintendo's Switch era, it would be \"reconstructive.\" Since the original Switch's launch in 2017, Nintendo has seemingly invested in not just making new entries in its biggest series, but redefining what these series are. Donkey Kong is the latest of these properties to receive a dramatic makeover, and the end result is utterly explosive fun.In Donkey Kong Bananza, Nintendo trades in the series' signature 2D-platformer fun for a large-scale, 3D adventure, one in which your main way of interacting with the world is through destroying it. It's endlessly fun, tearing through layer after layer of earth and finding roundabout solutions to the game's various challenges as you do. Chaos, creativity, and an absolutely massive DK pave the way forward in this game, while joyous musical numbers and the delightful Pauline add plenty of charm and tenderness.Naturally, this Nintendo title is only available on the company's newest console, the Switch 2. And considering the Switch 2's library is fairly limited right now, Donkey Kong Bananza feels like an easy recommendation for those trying to make the most of their shiny new console. However, I have little doubt that it will remain a beloved title throughout the system's life cycle. -- Jessica CogswellDonkey Kong Bananza review    \n  \n                      "
  },
  {
    "title": "Nioh 3: The Devs Answer Our Burning Question",
    "url": "https://www.gamespot.com/videos/nioh-3-we-sat-down-w-the-devs-of-nioh-3/2300-6466593/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1823/18237460/4622150-screenshot2025-12-12at3.25.08%E2%80%AFpm.png",
    "tag": "Gaming",
    "date": "2025-12-12T23:24:00.000Z",
    "description": "Click To Unmute        Let's Talk Tomb Raider Legacy of Atlantis & Tomb Raider Catalyst | The Game Awards 2025Highguard | Official Reveal TrailerThe Best Game Awards 2025 TrailersTotal War WARHAMMER...",
    "body": "          Click To Unmute\n        Let's Talk Tomb Raider Legacy of Atlantis & Tomb Raider Catalyst | The Game Awards 2025Highguard | Official Reveal TrailerThe Best Game Awards 2025 TrailersTotal War WARHAMMER 40,000 - Announce TrailerTomb Raider: Legacy of Atlantis Announcement Trailer | The Game Awards 2025Nioh 3 - The Game Awards 2025 TrailerACE COMBAT 8: WINGS OF THEVE Announcement TrailerStar Wars Galactic Racer™ - Official Reveal TrailerPlayStation: It Really Happens - Full TrailerTomb Raider: Catalyst Teaser TrailerLEGO® Batman™: Legacy of the Dark Knight - Official Heroes & Villains TrailerControl Resonant - Announcement Trailer | PS5 Games\n        Want us to remember this setting for all your devices?\n      Sign up or Sign in now!\n      \n      Please use a html5 video capable browser to watch videos.\n    \n      This video has an invalid file format.\n    00:00:00Sorry, but you can't access this content!Please enter your date of birth to view this video\n        By clicking 'enter', you agree to GameSpot's\n                        Terms of Use and\n        Privacy Policy"
  }
]