[
  {
    "title": "The Best Inez Grafts To Choose In The Outer Worlds 2",
    "url": "https://www.gamespot.com/gallery/outer-worlds-2-inez-graft-most-extraordinary-specimen-better-than-nature/2900-7239/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1816/18167535/4597345-outer-worlds-2-inez-grafts-most-extraordinary-specimen-better-than-nature-.jpg",
    "tag": "Gaming",
    "date": "2025-11-06T21:46:00.000Z",
    "description": "By     Jason Rodriguez   on November 6, 2025 at 1:47PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Jason Rodriguez\n   on November 6, 2025 at 1:47PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Are you still thinking of the best Inez grafts in The Outer Worlds 2? This soldier for Auntie's Choice has a plethora of abilities at her disposal, thanks to various biomechanical implements that you can choose for her. That said, these choices are permanent, so you have to be mindful of how you tackle her missions. We've got all the details for you in our guide since we also discuss Inez's arc, which includes quests like \"Better Than Nature\" and \"A Most Extraordinary Specimen.\"Inez's recruitment and quests: Better Than Nature and A Most Extraordinary SpecimenInez Silang tends to be unique among all the recruitable companions in the game. It's not just because she's Filipino. It's also due to how you recruit her and how you finalize her build as you progress through the story. Here's a quick summary:You meet Inez in the Ministry of Accuracy in Paradise Island. You visit the location while doing tasks for Milverstreet or Kaur, the two leaders of Fairfield who are at odds with each other. (We've also heard of issues where Inez simply won't appear in Fairfield after you meet her, which locks you out of the recruitment dialogue.)Likewise, near the tail end of a main quest called \"The Saboteur of Paradise,\" you have to make a pivotal decision regarding the Vox Relay. One such option could prevent you from recruiting Inez if you haven't done so already.Inez's personal quests--i.e. \"Better Than Nature\" and \"A Most Extraordinary Specimen\"--present you with choices on which graft gets implanted in her harm. These implants alter her abilities and the perks that are related to those abilities. This mechanic is quite different from just picking up companion mod kits.The final quest that you receive might be different based on the choices you've picked beforehand.Better Than Nature: Skeleton Crabble Graft or Raptidon Matriarch GraftThe first time you have to pick an Inez graft in The Outer Worlds 2 is during \"Better Than Nature.\" You should automatically receive this quest upon recruiting Inez as a companion. Initially, you just need to visit Ethel Tinsley's lab, which is in the northern part of Fairfield. She'll then tell you to acquire grafts from powerful creatures in the region:The Skeleton Crabble is located in the Mysterious Cave in the southwestern part of the zone. There's also a unique helmet in that area. The Raptidon Matriarch, meanwhile, is in the Raptidon Den further to the north. You'll also find several collectible cards inside or near that lair.You can kill just one or both of the creatures to obtain the graft that you need. That said, when you return to Ethel Tinsley's lab, you can only pick one implant.Skeleton Crabble Graft - Inez's Magic Bullet ability grants armor-piercing to her shots, making her more viable in an offensive role.Raptidon Matriarch Graft - Inez's Magic Bullet ability lets her cloak and throw a healing mist canister that restores HP while you stand in it.Our pick: We suggest getting the Raptidon Matriarch Graft at this stage. There are already several companions that focus on dealing damage, whereas Valerie is the only one that has a pure support role. The Raptidon Matriarch Graft ensures that Inez can be a combat medic for your squad.A Most Ordinary Specimen: Ursopod Grafting Part, Mantiqueen Grafting Part, or Mechanical AugmentationThe next Inez graft in The Outer Worlds 2 comes from a quest called \"A Most Extraordinary Specimen.\" Starting it isn't as obvious at first, and you're going to see multiple options at the end:You must progress the main story until you have access to the ACS Undisputed Claim. Ride the tram to the Value-Added Esplanade and, once you alight, talk to the courier NPC standing off to the side to receive a recording.Go back to your ship and play the recording via the central terminal. The \"A Most Extraordinary Specimen\" quest should appear in your journal.Travel to the frozen moon of Cloister and trek all the way to the northeastern part of the zone. Just past the Frozen Maw, you'll see a lift. Inez will activate it so you can enter the Algid Menagerie.Inside the Algid Menagerie, you'll have to deal will rabid creatures that have gotten loose. You can try to soothe these creatures or take them out as you see fit. There's also a unique weapon in this facility.Then, just before you enter the control room where an NPC named Giles Rasmussen can be found, be sure to create a backup save. You have the option to kill Rasmussen, which is what Inez prefers. Alternatively, you can spare him, much to Inez's chagrin:To spare Rasmussen, you must choose the following responses when prompted:  \"Do you have a graft that could help Inez?\"\"This could be your way to prove yourself. Let's at least hear him out.\"\"His research could help so many others. The good might just outweigh the bad.\"\"Salvaging the program is a pragmatic choice, but may not work out as you're hoping.\"If you spare Rasmussen, he'll interact with the console. This allows you to pick up both the Ursopod Grafting Part and Mantiqueen Grafting Part from the display cases. Note that there's a bug where Rasmussen won't interact with the device at all. Just reload your save if this occurs during your playthrough.To kill Rasmussen, just pick any of the more hostile responses or have Inez make the decision to finish him off. While there's no way to access the display cases, you can still loot the Mechanical Augmentation from his corpse.Note that killing Rasmussen after sparing him breaks the quest. Inez will just tell you to head back to the ship.Resolve this matter as you see fit and return to Ethel Tinsley's lab in Fairfield to implant another biomechanical device into Inez's arm:Ursopod Hive Graft - Using Inez's ability grants a bonus to her defenses and armor, improving survivability in battle.Mantiswarm Hive Graft - Using Inez's ability also releases a Mantiswarm in the area, which frightens affected enemies.Mechanical Augmentation - Grants the Graft Stabilization Matrix perk, which gives Inez two ability charges.Our pick: Bar none, the Mechanical Augmentation is the best Inez graft in The Outer Worlds 2. Having two ability charges tends to be greatly useful given Inez's knack at healing and buffing your team. However, killing Rasmussen might lock you into one particular quest at the end, as we detail below. If you opt to spare Rasmussen, then the Mantiswarm Hive Graft tends to be the more viable option.Inez's final quest: Half-Truths in Advertising or Full MeasuresIt's not just Inez's grafts that you need to consider, but also how your choices impact the conclusion of her story. Basically, once you obtain your second implant from Tinsley's lab, you'll unlock another quest based on the earlier decisions that you've made.Tinsley will give you the calling card of Willard Konnen, a vice president of Auntie's Choice. This lets you access the third floor of the Head Office Tower in the ACS Undisputed Claim. We've got additional details based on what we've experienced in our playthrough.Half-Truths in AdvertisingIf you spare Rasmussen and Inez has a more positive opinion on the grafting experiments, you'll get \"Half-Truths in Advertising.\"Konnen will tell you to travel to Praetor's blockade, the high wall that separates the eastern and western sectors.Eliminate the Protectorate soldiers and lower the wall to finish the task.Full MeasuresIf you kill Rasmussen and Inez has a more negative opinion on the grafting experiments, you'll get \"Full Measures.\"Konnen will give you a keycard that grants access to the ACS tram's Back Deck Steerage area. After surviving the ambush, you can either spare Konnen or end him as well.From there, you have to help Inez dig up dirt on Konnen by rechecking his office and the adjacent lab connected via a ventilation shaft. Then, Inez will broadcast Konnen's crimes to ruin him for good.That does it for our guide on the best Inez grafts in The Outer Worlds 2. To learn about your other squadmates, you can head over to our companion perks and mods guide. Likewise, since we've mentioned Inez's faction a few times, you might want to learn about the decision to side with Auntie's Choice or the Order of the Ascendant.Black market smugglers? Autocratic regimes? Rampaging Raptidons? Invisible cultists that can only be seen if you wear special goggles? These shenanigans need not cause any alarm because we've got you covered in our The Outer Worlds 2 guides hub.    \n  \n                      "
  },
  {
    "title": "New Official Dragon Quest Apparel Now Available At Amazon",
    "url": "https://www.gamespot.com/gallery/official-dragon-quest-apparel-at-amazon/2900-7233/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4596789-dq-clothing.jpg",
    "tag": "Gaming",
    "date": "2025-11-07T02:20:00.000Z",
    "description": "By     Darryn Bonthuys   on November 6, 2025 at 6:20PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Darryn Bonthuys\n   on November 6, 2025 at 6:20PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                With the festive season almost here, one of the easiest gift options for video game fan is a brand-new T-shirt featuring a colorful logo or some key from their favorite games. Whether you're shopping for the RPG fan in your life or for yourself, you can grab a selection of new, official Dragon Quest and Final Fantasy Tactics apparel via Square Enix's Amazon Store.For Dragon Quest fans, there are t-shirts, sweaters, and hoodies featuring pixel-art sprites of the classic Dragon Quest and Dragon Quest II party members, Akira Toriyama's original monster illustrations, and more. Final Fantasy Tactics fans can choose from T-shirts, sweaters, and hoodies featuring the game's key art and main characters, sourced from official artwork for the remake. Each garment is available in multiple sizes and color options. Color options differ between each piece of merch, but in general, there are at least a couple to choose from. You'll find links to all the new Square Enix apparel below.If you're looking to get the games that inspired the new apparel, you can pick up Dragon Quest I & II HD-2D Remake and Final Fantasy Tactics: The Ivalice Chronicles now on PC and console. Physical editions of both games are available through Amazon, and both include a few bonuses items. The Dragon Quest I & II HD-2D Remake features the Trouble-Free Travel Kit preorder bonus, which gives players a toolkit full of stat-boosting items, while grabbing Final Fantasy Tactics: The Ivalice Chronicles at Amazon gets you an exclusive fold-out poster featuring illustrations of the game's many job classes.Dragon Quest I & II HD-2D RemakeSwitch 2 -- $60Switch -- $60PS5 -- $60Xbox Series X|S -- $60Final Fantasy Tactics: The Ivalice ChroniclesSwitch -- $50PS5 -- $50Xbox Series X|S (Digital code) -- $50Dragon Quest I & II HD-2D Remake Pixel Heroes T-Shirt$24Dragon Quest I & II HD-2D Remake Hero and Princess T-Shirt$24Dragon Quest I & II HD-2D Remake Boss Monsters T-Shirt$24Dragon Quest I & II HD-2D Remake Key Art T-Shirt$24Dragon Quest I & II HD-2D Remake Erdrick Trilogy T-shirt$24Dragon Quest I & II HD-2D Remake Heroes T-Shirt$20Dragon Quest I & II HD-2D Remake Logo T-Shirt$20Dragon Quest I & II HD-2D Remake Pixel Heroes Longsleeve T-Shirt$30Dragon Quest I & II HD-2D Remake Pixel Heroes Sweater$38Dragon Quest I & II HD-2D Remake Pixel Heroes Hoodie$40Dragon Quest I & II HD-2D Remake Hero and Princess Longsleeve T-Shirt$30Dragon Quest I & II HD-2D Remake Hero and Princess Sweater$38Dragon Quest I & II HD-2D Remake Boss Monsters Longsleeve T-Shirt$30Dragon Quest I & II HD-2D Remake Boss Monsters Sweater$38Dragon Quest I & II HD-2D Remake Boss Monsters Hoodie$40Dragon Quest I & II HD-2D Remake Key Art Longsleeve T-Shirt$30Dragon Quest I & II HD-2D Remake Key Art Sweater$38Dragon Quest I & II HD-2D Remake Logo Hoodie$36Dragon Quest I & II HD-2D Remake Erdrick Trilogy Sweater$38Dragon Quest I & II HD-2D Remake Heroes Sweatshirt$34Dragon Quest I & II HD-2D Remake Erdrick Trilogy Hoodie$40Final Fantasy Tactics: The Ivalice Chronicles Delita and Ramza T-Shirt$17 ($20)Final Fantasy Tactics: The Ivalice Chronicles Key Art T-Shirt$17 ($20)Final Fantasy Tactics: The Ivalice Chronicles Delita and Ramza Longsleeve T-Shirt$21.24 ($25)Final Fantasy Tactics: The Ivalice Chronicles Key Art Longsleeve T-Shirt$21.24 ($25)    \n  \n                      "
  },
  {
    "title": "Take-Two Boss: \"We're Not Using\" AI As An \"Excuse\" To Reduce Headcount",
    "url": "https://www.gamespot.com/articles/take-two-boss-were-not-using-ai-as-an-excuse-to-reduce-headcount/1100-6536019/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1581/15811374/4598237-gta6.jpg",
    "tag": "Gaming",
    "date": "2025-11-06T23:55:00.000Z",
    "description": "Take-Two Interactive CEO Strauss Zelnick said on an earnings call that while the company is using AI tools in non-creative areas, it isn't looking to cut staff in favor of automation.",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Take-Two Interactive is using some AI tools in areas of its business that aren't creative, but the company is not looking to use those tools to replace any staff, CEO Strauss Zelnick said during Take-Two's November earnings call.\"I think there are plenty of areas of business where the tools we have rolled out at the enterprise are helping us. We are not either using this as an excuse to, or frankly seeing the opportunity to, reduce headcount,\" Zelnick said on the call, answering a question about how Take-Two has rolled out AI tools in the non-creative areas of its business. \"We are seeing this as an opportunity to take our very talented people and release them from more mundane tasks so they can do more creative and more interesting tasks and we can work better as an organization. But if you said, 'Can you cut your cost profile by 5% tomorrow by using all things AI?' The answer is no.\"Zelnick has previously said in interviews that he thinks the capabilities of generative AI tools are overstated, and that AI can't replace games made by humans like Grand Theft Auto 6. During the earnings call, he clarified those comments somewhat, but he also reiterated that he thinks AI can potentially be a useful tool in game development in the future, if \"properly deployed.\"\"To be clear, I didn't say that I don't see it as a positive,\" Zelnick said. \"What I said was that AI is based on backward-looking data sets meeting compute, meeting LLMs, and none of that replaces forward-looking genius. That's not an opinion, that's factual. I defy anyone to controvert those facts.\"Of course, technology drives a lot of what we do here. Now, creativity is our lifeblood, but how do we express our creativity? We do so with computers, with technical tools. We always have. So as toolsets improve, we can become more efficient, we can become more effective. And our creative people, therefore, are freed up to be more creative. So AI, depending on how you define it, and properly deployed, of course is positive for creativity, and therefore is, of course, positive for game creation.\"Zelnick's comments that AI won't lead to layoffs at Take-Two come in contrast to other executives. Electronic Arts CEO Andrew Wilson and Microsoft's Brad Smith have both said that AI advancements will lead to job losses in the short term, though they claim AI will eventually lead to higher employment rates.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]