[
  {
    "title": "Helldivers 2's Next Warbond Has A Flame-Spewing Drone",
    "url": "https://www.gamespot.com/gallery/helldivers-2-python-commandos-warbond-all-skins-guns-and-rewards/2900-7282/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4611886-helldivers-2.jpg",
    "tag": "Gaming",
    "date": "2025-11-25T14:59:00.000Z",
    "description": "By     Darryn Bonthuys   on November 25, 2025 at 7:06AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Darryn Bonthuys\n   on November 25, 2025 at 7:06AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                A new Premium Warbond for Helldivers 2 will go live starting December 2, and this time, players can expect three brand-new stratagems and weapons. Featuring a jungle theme, the Python Commandos Premium Warbond is headlined by a weapon that will make fans of '80s action movies happy: the M-1000 Maxigun, a belt-fed machine gun with big \"if it bleeds, we can kill it\" energy.To help you in your off-planet deforestation, you can also call in the AX/FLAM-75 \"Guard Dog\" Hot Dog to provide mobile support. This drone is equipped with a flamethrower and periodically returns to your backpack to refuel. The new RS-20 Constrictor melee weapon adds some Warhammer 40K flavor to the game, as this is a chainsaw sword that can be used to trim bushes, trees, and the limbs of any Terminids that try to pick a fight with you.The new primary weapon introduced in the Warbond is the AR/GL-21 One-Two, a versatile combination assault rifle and grenade launcher for jungle warfare. The Helldivers arsenal isn't the only thing being updated, as players can also purchase two armor sets. The RS-20 Constrictor light armor set lets Helldivers show off their guns--including the ones attached to their torsos--and the RS-40 Best of Prey is heavy armor inspired by Ronald Mambo, a legendary soldier.Finally, players can also unlock new emotes and the Chameleon Camo pattern for your FRV, Exosuit, Hellpod, and Shuttle. If you haven't tried it out yet, Helldivers 2 is currently on sale for Black Friday, and you can bring Managed Democracy to alien hordes for just $30.As a reminder, the warbond can be purchased for 1,000 Super Credits--the premium currency that you can find in small caches in each level--or if you're in a rush, you can spend $10 to buy a stack and dive right into the new gear.Stratagem: M-1000 MaxigunStratagem: AX/Flam-75 \"Guard Dog\" Hot DogStratagem: CQC-9 Defoliation ToolPrimary Weapon: AR-GL 21 One-TwoHeavy Armor: RS-40 Beast of PreyLight Armor: RS-20 ConstrictorPython Commandos Premium Warbond    \n  \n                      "
  },
  {
    "title": "Nintendo Switch 2 Firmware Update Includes Fix For One Of Generation's Best Games",
    "url": "https://www.gamespot.com/articles/nintendo-switch-2-firmware-update-includes-fix-for-one-of-generations-best-games/1100-6536493/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1850/18504982/4611869-4512811-nintendoswitch2_hw_08.png",
    "tag": "Gaming",
    "date": "2025-11-25T13:29:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          A new Nintendo Switch 2...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                A new Nintendo Switch 2 software patch is out, and besides the usual stability improvements, it addresses some small but noteworthy problems.Nintendo says that the version 21.0.1 update fixes two error codes that occur on a Nintendo Switch 1 when attempting a system transfer to a Nintendo Switch 2 through local communication. The more prevalent note is a fix for when \"wireless controllers or Bluetooth audio devices were unable to connect\" after waking a Switch 2 up from Sleep mode or turning off Airplane mode.While the Bluetooth wireless connectivity problem was not widely reported, several users on Reddit shared that they experienced issues with their Bluetooth headsets and expressed joy over the patch. Switch 2 owners also pointed out that after the 21.0.1 patch, the Switch 1 version of the fan-favorite Nier: Automata now functions properly on Switch 2 after having compatibility issues.Backward compatibility fixes for Switch 1 games have coincided with Switch 2 firmware upgrades in the past, with the hefty 21.0.0 update earlier this month including fixes for Batman: Arkham Knight, Hitman 3 Cloud Version, and Windjammers. There are still a handful of Switch 1 games that remain broken on Switch 2, with Borderlands 3 the most prolific title out of those.The new patch doesn't address the reported problems with third-party dock compatibility, an issue that arose after the version 21.0.0 patch, though manufacturers of these unofficial docks have already begun deploying their own fixes.Switch 2 owners should have plenty to play during this upcoming holiday season, with Hyrule Warriors: Age of Imprisonment and Kirby Air Riders releasing earlier this month. The highly anticipated Metroid Prime 4: Beyond caps off Nintendo's first-party offerings for this year.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Call Of Duty Hasn't Been Outsold By Another Shooter In The US Since 2006",
    "url": "https://www.gamespot.com/articles/call-of-duty-hasnt-been-outsold-by-another-shooter-in-the-us-since-2006/1100-6536492/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4611868-screenshot2025-11-25at8.28.19%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-11-25T13:09:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          One of the biggest year-end...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                One of the biggest year-end questions people have about the gaming industry this year is whether or not Battlefield 6 will outsell Call of Duty: Black Ops 7, a feat that would end a 20-year run of Call of Duty's dominance. It remains to be seen if that will happen, and while we wait for the data to come in, Circana's Mat Piscatella has shared some data points about the shooter category in the US.To begin with, Piscatella pointed out that the last shooter game to outsell a Call of Duty title in the US over a full year was Gears of War in 2006. The last FPS to beat Call of Duty was Star Wars: Battlefront II in 2005.Call of Duty has reigned supreme in the US not just in the shooter and FPS categories, but generally as well. A Call of Duty game has finished the year as the best-selling title for 13 of the past 16 years, the exceptions being 2013 (GTA 5), 2018 (Red Dead Redemption II), and 2023 (Hogwarts Legacy).\"Still have some big weeks of potential sales to come, but this part of the market hasn't been this competitive in 20 years,\" Piscatella said of the shooter and FPS categories of the gaming market.He added that comparing titles over such a long time horizon is imperfect because the gaming market today is much more \"dynamic,\" especially with things like subscription services and free games like Fortnite. This means \"sales alone don't tell the whole story.\"Battlefield 6 is already performing better than Call of Duty's latest releases in the US. First-month sales of Battlefield 6 were higher than any other game's first-month sales going back to 2022, meaning Battlefield 6 sold better out of the gate than 2024's Black Ops 6 and 2023's Modern Warfare 3. Battlefield 6 needed just 22 days to eclipse the entire lifetime sales of Battlefield 1 in the US.It was reported earlier this year that Microsoft missed out on $300 million+ in revenue for Call of Duty: Black Ops 6 because it was on Xbox Game Pass. That doesn't tell the whole story, though, as the Black Ops 6 release no doubt incentivized people to sign up for Game Pass.People will want to compare Battlefield 6 and Black Ops 7, but no comparison between the two would be complete or necessarily fair for a variety of reasons. One is that Black Ops 7 is available on Xbox Game Pass and PC Game Pass. Another is that Black Ops 7 is releasing on more platforms than Battlefield 6, as Activision's game is supporting last-gen platforms and EA's is not. Yet another element to consider is that Battlefield 6 sales are reportedly skewed toward PC.Black Ops 7 launched on November 14, and in a break from tradition, Activision's celebratory first-weekend post did not include any data about how the game is performing compared to past games. Before this, Activision acknowledged \"fatigue\" around the Black Ops brand given the back-to-back releases of Black Ops 7 in 2024 and Black Ops 7 in 2025.Prior to Black Ops 7's release, industry experts said Battlefield 6 didn't have a real chance at beating Black Ops 7, in part because of the size, scale, and momentum of the Call of Duty series. One analyst said people buy Call of Duty every year with \"autopilot purchasing,\" even if they complain about a lack of new features or innovation.Circana's report for US sales in November will be released on December 17, so keep checking back with GameSpot to see how Battlefield 6 and Black Ops 7 sales compare.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]