[
  {
    "title": "Nex Playground Boss Says The Console Solves The Wii \"Problem\"",
    "url": "https://www.gamespot.com/articles/nex-playground-boss-says-the-console-solves-the-wii-problem/1100-6537124/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4626328-nex.jpg",
    "tag": "Gaming",
    "date": "2025-12-20T02:05:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          While Sony and Nintendo have...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                While Sony and Nintendo have expanded their lead over Xbox, a dark horse console had a very strong showing in third place in November. The Nex Playground has emerged as a breakout hit, and CEO David Lee believes that one of the reasons why its been so successful is because the console has solved the Wii \"problem.\"Nearly two decades ago, the Wii powered Nintendo's post-GameCube comeback with its motion controls and unique games. Lee argues that the scope of Wii's success made it difficult to sustain in the long term. Instead of trying to sell games like Wii, Nex Playground is offering its titles as part of a subscription service.\"One of the most important things we should do is learn from history and try not to commit the same limitations, and that's why we have a subscription model,\" Lee told The Game Business. \"Nintendo expanded the audience with Wii. When you expand the audience, and they want different things, and they only buy Wii Fit, Wii Sports and not many others … that's a bit of a problem.\"Lee was very complementary toward Nintendo in his follow-up remarks, but he added that the Wii's model of selling only a few games to certain members of its install base was \"not sustainable.\"\"It's very important that we set ourselves up to serve our customer continuously with new innovations,\" added Lee. \"That is how the whole system can sustain. But it started with Wii. We are standing on a giant’s shoulder.\"Nex Playground reportedly accounted for 14% of all console sales on Black Friday, finishing ahead of the Xbox family of systems.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "This Magnetic Puzzle Is A Perfect Last-Minute Stocking Stuffer",
    "url": "https://www.gamespot.com/articles/tosy-magnetic-pyramid-toy-stocking-stuffer-on-sale-for-a-limited-time/1100-6537057/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1864/18647298/4624936-screenshot2025-12-17132740.png",
    "tag": "Gaming",
    "date": "2025-12-19T23:47:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               It's down to the wire, and if you're looking to do some last-minute holiday shopping, we've got a great option for you. For a limited time, TOSY's wildly popular Magnet Pyramid Stone is on sale for just $22.76 (was $30) on Amazon, and is a perfect stocking stuffer to pick up if you're cutting it close with your gift-getting this year. You can create a seemingly endless number of shapes with it (the brand claims \"one billion\" of them), making it an effective and creative fidget toy for both kids and adults. But if you plan to pick one up, do it soon--these are popular on Amazon even at full price, and we expect this limited-time discount will only make them more in-demand.                                 TOSY Magnet Pyramid Stone                                                                $22.76 (was $30)                                                                                                                                                                                    The TOSY Magnet Pyramid Stone is a unique STEM and fidget toy that allows you to let your creativity run wild. With it, you can create a vast number of shapes, all while stimulating your brain and calming your anxieties. The Pyramid Stone even comes with a spinning base so you can show off your favorite creations. The toy is extremely popular on Amazon, and it's currently sitting at a limited-time discount of just $22.76 (down from $30). It's the perfect size (and price) for a stocking stuffer gift, so get one on sale while you still can.                      TOSY also makes a bunch of other great stocking-stuffer-type gifts, from fidget spinners to magnetic puzzle cubes. If the pyramid isn't doing it for you (or you just want more than one gift), maybe one of these other options will. Don't worry, they're also on sale--but only for a limited time:TOSY Magnet Fidget Spinner Glow -- $19 ($24)TOSY Magnet Cube (2x2) -- $8.49 ($10)TOSY Magnet Cube (3x3) -- $29 ($37)TOSY Magnet Cube (4x4) -- $58 ($73)And if you're looking for even more ideas, you should check out Shashibo, another popular brand on Amazon that sells puzzles and fidget toys. The brand's Shape Shifting Box is on a limited-time sale for just $18.19 (was $28), and comes in a bunch of fun themes like SpongeBob, Hello Kitty, Avatar, and more. We have even more in-depth coverage of those Shashibo puzzle boxes here.Sign up for GameSpot's Weekly Deals Newsletter:                                Arcade1Up Classic Special Edition Mortal Kombat Cabinet Gets First Discount                         Nintendo Switch 2 Samsung 256GB MicroSD Express Card On Sale For Only $33                         Target's Best Exclusive Lego Sets Get Rare Holiday Discounts                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Xbox Elite Series 2 Controllers On Sale For Even Better Prices Than Black Friday Deals                         Final Fantasy I-VI Pixel Remaster Collection Is Back On Sale For Black Friday Price                         Nintendo Switch 2 Racing Wheel Set Drops To $20 For A Limited Time                         ROG Xbox Ally Gaming Handheld Is On Sale For Only $489 For A Limited Time                         Super Mario Galaxy: Rosalina's Storybook Gets 30% Price Cut At Amazon    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n\n            \n    "
  },
  {
    "title": "The Best Switch Games Of 2025 According To Metacritic",
    "url": "https://www.gamespot.com/gallery/the-best-switch-games-of-2025-according-to-metacritic/2900-7357/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4624572-mc-switch-main.jpg",
    "tag": "Gaming",
    "date": "2025-12-21T17:00:00.000Z",
    "description": "By     Jordan Ramée  ,     Gabe Gurwin  , and     Darryn Bonthuys   on December 21, 2025 at 9:00AM PST                                GameSpot may receive revenue from affiliate and advertising...",
    "body": "\n                            \nBy \n    Jordan Ramée\n  , \n    Gabe Gurwin\n  , and \n    Darryn Bonthuys\n   on December 21, 2025 at 9:00AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Between the launch of a new console and multiple first-party releases, 2025 was a pretty big year for Nintendo. The Switch 2 got off to a roaring start, but the original Switch family of consoles wasn't forgotten about this year, as Nintendo ensured several of its biggest releases were also playable on it. Metroid Prime 4: Beyond and Pokemon Legends: Z-A were playable on the older hardware, while other legacy games like The Legend of Zelda: Breath of the Wild and Tears of the Kingdom were upgraded for the Switch 2.Between those new releases and expanded versions of old favorites, we also saw third-party games launch for the Switch 2. Developers like Ubisoft and CD Projekt Red delivered high-quality versions of Star Wars Outlaws and Cyberpunk 2077 to the hybrid console, while indie studios focused on gameplay over raw visual horsepower to stand out from the pack. More of a transitional year than a revolutionary one when compared to the launch of Nintendo consoles like the Wii, Wii U, and the original Switch, 2025 saw the company play it safe as it built on the successes of the previous console generation.To see which of the hundreds of Switch and Switch 2 games made it to the top, you can check the list below. Our sister site Metacritic has crunched all the numbers below, and the final list at the time of writing is an impressively varied selection of games. For more of these features, you can check out our galleries focused on the best RPGs, co-op games, and shooters of the year. We also have our own curated list of the best Switch-exclusive games of 2025, as well as the best Switch and Switch 2 games to play right now.More Best Of 2025:Best of 2025 hubWhy Clair Obscur: Expedition 33 Is GameSpot's GOTY 2025GameSpot's 10 Best Games of 2025The Best PS5-Exclusive Games Of 2025The Best Nintendo Switch And Switch 2 Exclusives Of 2025The Best-Reviewed Games Of 20252025's Biggest Gaming News: Banned Games, GTA 6 Delayed, Price HikesThe Legend of Zelda: Tears of the Kingdom Switch 2 EditionVisually, The Legend of Zelda: Tears of the Kingdom is a marked improvement on the Switch 2 thanks to an increased resolution and HDR support. But it's the thoughtful upgrades that complement the core gameplay that go a long way toward making a great game even better.Metascore: 95The Legend of Zelda: Breath of the Wild Switch 2 EditionJust like Tears of the Kingdom, Breath of the Wild looks and plays significantly better on the Switch 2. It's the definitive version of one of the greatest Legend of Zelda games of all time, and an almost mandatory upgrade for anyone who already owns the Nintendo masterpiece.Metascore: 95Hades 2Supergiant Games has built a reputation for developing high-quality games consistently, but now the studio can add another feather to its hat: It knows how to make a damn good sequel. Hades 2 isn't just a sequel that's bigger and better than its predecessor; it's a game full of twists and surprises, redefining what a roguelite can be with its refined combat and innovative buildcrafting.Metascore: 95 | Read our Hades 2 reviewDonkey Kong BananzaWell over 20 years since his last venture into the third dimension, Donkey Kong made a very impressive return. Donkey Kong Bananza is a delightful and destructive take on 3D platforming with secrets and little nuggets of joy around every corner--or buried deep beneath the surface for you to uncover through pure brawn and willpower.Metascore: 91 | Read our Donkey Kong Bananza review.Hollow Knight: SilksongThe wait was long, but well worth it--Hollow Knight: Silksong takes the formula established in Team Cherry's 2017 metroidvania and pushes it even further. This time, you play as Hornet, the deuteragonist of the first game, as you climb to the top of a kingdom largely defined by music and song and seemingly infected with mind-controlling silk. The journey is one full of hardship, tests of faith, and one warrior princess' exploration of her heritage, and it's one of our favorite stories and experiences of 2025.Metascore: 90 | Read our Hollow Knight: Silksong reviewTrails in the Sky 1st ChapterThe Trails series is a must-play for any fan of RPGs, but with decades of games in this series, where does one even start? Right at the beginning, thanks to this well-polished remake of the very first game. It's Trails at its best, as the game's classic story about headstrong heroes on a quest to save the day benefits tremendously from upgraded visuals and gameplay.Metascore: 90 | Read our Trails in the Sky 1st Chapter reviewAbsolumBlending old-school brawling with swords-and-sorcery flair, Absolum is a satisfying mix of traditional brawling and roguelike progression. The fantasy-themed brawler leans fully into both genres, making each run in its visually striking world compelling and easy to lose track of time.Metascore: 89 | Read our Absolum reviewBall x PitArkanoid-inspired block-breaking with the satisfying investment of roguelite growth, Ball x Pit is literally the best balls-to-the-wall game of 2025. The pinball-esque combat is engrossing, the character variety makes each run feel different, and the interconnected base-building system adds another layer of gratification.Metascore: 89 | Read our Ball x Pit reviewSplit FictionThere's a highlight reel of moments that consistently make Split Fiction stand out from the pack, as the game is brimming with creative energy. Constantly reinventing itself and breaking its own rules, there's never a dull moment with this co-op adventure.Metascore: 89 | Read our Split Fiction reviewPipistrello and the Cursed YoyoWho says a Zelda-like game has to take place in a fantasy setting? Pipistrello and the Cursed Yoyo is an exception to that rule, and while it looks like your typical adventure game with Game Boy Advance-inspired visuals, the yo-yo gameplay, inventive challenges, and superb level design combine to create one of the best games of the year.Metascore: 88Street Fighter 6Street Fighter 6 is the gold standard for modern fighting games, combining a wild art direction with gameplay welcoming to players of any skill level. There's nothing better than going a few rounds with friends in this fisticuffs masterclass, and on Switch 2, Capcom's decision to optimize performance makes for a buttery-smooth experience.Metascore: 87Super Mario Galaxy 1 + 2Whether you've toured the cosmos before or you're taking your first leap off of a planet, it simply doesn't get any better than the Mario Galaxy games. Still considered to be two of the mustachioed plumber's most incredible adventures, Mario Galaxy 1 and 2 made a big return to Switch consoles in 2025, giving fans an out-of-this-world package of masterfully crafted 3D platformers.Metascore: 87Atelier Ryza Secret Trilogy Deluxe PackThe Ryza era of the long-running Atelier series has been a consistent highlight, and this trilogy of games featuring the plucky protagonist proved to be the definitive entry point to this sub-series. Packed with new content and previously released DLC, it's hard to say no to three beloved JRPGs bundled into one convenient package.Metascore: 87Ninja Gaiden: RageboundBetween a sharp remaster of a Ninja Gaiden classic and a brand-new game in the mainline series, you'd be forgiven for thinking that a retro-inspired spin-off would be overshadowed. That's where you'll find yourself pleasantly surprised, as this return to the 2D roots of Ninja Gaiden is a treat for the senses and a challenge for your thumbs, thanks to combat that is both challenging and satisfying to master.Metascore: 87 | Read our Ninja Gaiden: Ragebound reviewFinal Fantasy Tactics: The Ivalice ChroniclesVideo games have changed a lot in the decades since Final Fantasy Tactics, but its political-thriller storyline, enduring tactical turn-based gameplay, and innovative Jobs system still feel relevant in the modern age. A timeless game with a fantastic tale of intrigue, the smart enhancements in this new version of the classic make it easy to recommend to series veterans and newcomers alike.Metascore: 87 | Read our Final Fantasy Tactics: The Ivalice Chronicles reviewXenoblade Chronicles X: Definitive EditionOpen-world games are commonplace these days, but back in 2015, Xenoblade Chronicles X showed just how deep the genre could be with its breathtaking world design. Xenoblade Chronicles X: Definitive Edition is a reminder of how the original game prioritized a sense of freedom in exploring the planet of Mira, while much-needed quality-of-life enhancements improve its already-stellar combat and performance.Metascore: 87Mario Kart WorldAt long last, the confines of the racetrack do not define Mario Kart. Mario Kart World takes the series' classic kart racing and puts it in a fully explorable open world, adding a nice dose of discovery and charm without sacrificing the excellent core racing experience from the series' past. It's one of the strongest launch titles in Nintendo's history and an absolute joy to play.Metascore: 86 | Read our Mario Kart World reviewHeretic + HexenNightdive Studios continues to be the go-to developer for retro revivals, and it didn't disappoint in 2025 with its resurrection of Raven Software's '90s shooters. Heretic and Hexen got all the improvements you'd expect from Nightdive, but thoughtful tweaks to the gameplay, a remixed soundtrack, and bonus material made this another gratifying revamp.Metascore: 86Fantasy Life i: The Girl Who Steals TimeA wholesome escape to the countryside, Fantasy Life i: The Girl Who Steals Time let's you experience the dungeons and farmlands of Ginormosia at your own pace. Whether you're exploring tombs for treasure or building a local community, the choice is up to you on how to spend your hours in this easygoing RPG.Metascore: 86Shotgun Cop ManA perfect game for anyone who's strapped for time, Shotgun Cop Man is an action-platformer that never outstays its welcome. It's full of surprises across the 10 worlds you'll explore via projectile-based movement, constantly reinventing the wheel as you chase down the devil and high scores.Metascore: 86Mario Kart WorldWith the release of the third and fourth chapters, Deltarune from Undertale creator Toby Fox feels like it's shifting into high gear as it reaches the halfway mark. It's an RPG that's absurd and wild in the best ways, subverting expectations and weaving a campaign full of insightful questions and unsettling themes.Metascore: 86Dragon Quest 1 & 2 HD-2D RemakeA lavish remake of the classic Dragon Quest games using Square Enix's signature 2D-sprite-on-3D-background aesthetic, Dragon Quest 1 & 2 HD-2D Remake is a thorough modernization of two influential JRPGs. At the same time, the updates go far beyond mere mechanical polish, with thoughtful touches across the board that create a richer, nostalgic experience.Metascore: 85 | Read our Dragon Quest 1 & 2 HD Remake reviewYakuza 0: Director's CutThe Yakuza franchise is as hard to keep down as the Dragon of Dojima in a street fight, and Yakuza 0: Director's Cut brought one of the best games in the series to Switch 2. Outside of a new multiplayer game mode and some extra story content, it's Yakuza 0 as you remember it: an intense and nail-biting gangland drama starring two iconic gangsters during their formative years.Metascore: 85Cyberpunk 2077: Ultimate EditionIt took quite a long time for the game to be worth playing on other platforms, but Cyberpunk 2077: Ultimate Edition delivered a fantastic Switch 2 experience from launch day. The game and its excellent Phantom Liberty expansion are excellent on Switch 2, and the additional control options and portability make it arguably the best place to experience it all.Metascore: 85Ender Magnolia: Bloom in the MistEnder Magnolia: Bloom in the Mist doesn't revolutionize the metroidvania genre, but it does combine its rock-solid gameplay with elegant visuals and a stirring soundscape. It makes a strong case for why games can be artistic triumphs in this confident follow-up from developer Live Wire.Metascore: 85Shinobi: Art of VengeanceReturning after such a long time away--14 years in this case--can be tricky for any game series, but Shinobi: Art of Vengeance might as well be an instruction manual for doing it well. The action-platformer balances difficulty with approachability to tremendous effect, and the stylized 2D art is a perfect fit for the series.Metascore: 85 | Read our Shinobi: Art of Vengeance review.Tony Hawk's Pro Skater 3 + 4Following up one of the best remakes ever … remade … is never an easy task, especially when the original studio is no longer involved. Iron Galaxy was certainly up to the challenge with Tony Hawk's Pro Skater 3 + 4, taking over from Vicarious Visions and delivering two excellent (if occasionally unfaithful) remakes of classic skateboarding games. And these ones are great without even having \"Superman\" on the soundtrack!Metascore: 85 | Read our Tony Hawk's Pro Skater 3 + 4 review.The Hundred Line: Last Defense AcademyIn a year dominated by games like Clair Obscur: Expedition 33 and Hollow Knight: Silksong, it's downright criminal how The Hundred Line: Last Defense Academy has been overlooked in GOTY discussions. A wild mix of Danganronpa-inspired storytelling and deep tactical-RPG gameplay, the game is a timesink of impressive scale and ambitious design.Metascore: 85Bravely Default: Flying Fairy HD RemasterInitially released for the 3DS in 2012, turn-based RPG Bravely Default got a fresh lease on life this year as a Switch 2 launch game. It's everything you'd expect from a modern-day remaster--better visuals and quality-of-life updates--and its deep combat system has stood the test of time. Throw in its quirky cast of characters, fine-tuned characters, and Switch 2-exclusive features, and you've got a charming JRPG to play on the go.Metascore: 84    \n  \n                      "
  }
]