[
  {
    "title": "Pillars of Eternity Turn-Based Mode Beta Coming This Week",
    "url": "https://www.gamespot.com/articles/pillars-of-eternity-turn-based-mode-beta-coming-this-week/1100-6535900/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4595786-pillarsofeternityturnbasedmode.jpg",
    "tag": "Gaming",
    "date": "2025-11-04T00:36:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          In 2015, Obsidian Entertainment...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                In 2015, Obsidian Entertainment launched Pillars of Eternity, a party-based real-time tactical RPG. Now Obsidian is making one of the most significant changes to the game in the last 10 years by introducing a turn-based mode. And Pillars of Eternity players will be able to get their hands on it this week.On the game's official site, Obsidian announced that the public beta for Pillars of Eternity's turn-based mode will go live on November 5. The real-time combat was inspired by the system used by the game's sequel, Pillars of Eternity 2: Deadfire. The studio also released an announcement trailer for the new mode to demonstrate it in action.          According to Obsidian, the following real-time improvements were made after taking fan feedback from Deadfire.Unbound Turns: All turns are now influenced by a character’s overall speed, improving the value of Real-Time with Pause attributes and mechanics.Smarter Free Actions: Actions like swapping weapons, drinking potions, or enabling modals are now free actions. Each free action is limited to one per turn per type for balance.Faster Pacing: Combat lethality has been significantly increased for both enemies and players to keep battles tense and impactful.Mode Flexibility: You can choose Turn-Based Mode alongside difficulty when starting a new game — or swap freely between Real-Time with Pause and Turn-Based Mode in the game options. We’re also investigating a direct HUD toggle for even more convenience.As noted above, players can choose whether or not to embrace turn-based combat, or switch between real-time and turn-based at their desire. The beta test doesn't currently have an end date, but Obsidian notes that it will release future updates in support of this before adding turn-based mode to the game as a permanent feature.Josh Sawyer--who directed both Pillars of Eternity games--has suggested that if Pillars of Eternity 3 ever goes forward, it will embrace the influence of Baldur's Gate 3 and switch from an isometric perspective to a 3D-style game.Earlier this year, Obsidian released Avowed, an action-RPG that takes place in the same universe as the Pillars of Eternity games.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "UK Government Cites Concord During Debate About Consumer Protections For Gamers",
    "url": "https://www.gamespot.com/articles/uk-government-cites-concord-during-debate-about-consumer-protections-for-gamers/1100-6535897/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4595623-concord2.jpg",
    "tag": "Gaming",
    "date": "2025-11-03T20:49:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Just over a year ago, Sony took...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Just over a year ago, Sony took the drastic step of shutting down Concord and issuing refunds two weeks after its release because the game failed to find an audience. Now, Concord's demise is being used as an example of why gamers need more consumer protections during a debate in the United Kingdom's House of Lords.As reported by Eurogamer, one MP specifically cited Concord's quick demise while arguing in favor of the Digital Markets, Competition and Consumers Act 2024.\"I know the honorable members will agree that where publishers fail to make the life span of a game clear at the point of sale, they must be held accountable. That's why I welcome the strengthened consumer protections, including the Digital Markets, Competition and Consumers Act 2024, which came into force earlier this year. This legislation rightly requires traders to provide clear, timely, and accurate information to consumers, including the longevity and functionality of digital products.\"When Ubisoft announced that The Crew was being taken offline, it led to the rise of the Stop Killing Games movement, as well as a lawsuit from angry fans. MP Ben Goldsborough addressed some of the Stop Killing Games movement's goals while leading the debate on the issue.\"Gamers still feel the deep sense of personal possession, because they invest more than money,\" said Goldsborough. \"They invest time, effort, imagination, and friendship. When a game shuts down without notice, that investment is lost ... This is about fairness, responsibility, creativity, and protecting a cultural legacy ... of which the United Kingdom should be proud.\"The House of Commons has posted its research briefing on the issue, but in a discouraging note, the briefing ends with a note that there are \"no plans to amend existing consumer law on disabling video games.\" Instead, it cites established consumer laws including the Consumer Rights Act 2015 and Digital Markets Competition and Consumers Act 2024 as the existing protections for gamers.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Free Fortnite Glider: How To Unlock The Simpsons DLC Right Now Before It Costs Money",
    "url": "https://www.gamespot.com/articles/free-fortnite-glider-how-to-unlock-the-simpsons-dlc-right-now-before-it-costs-money/1100-6535889/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4595519-screenshot2025-11-03at1.51.54%E2%80%AFpm.png",
    "tag": "Gaming",
    "date": "2025-11-03T20:02:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Fortnite's big crossover with...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Fortnite's big crossover with The Simpsons is now live, and it brings with it a host of content themed around the longrunning animated series. Players can purchase the battle pass to unlock Homer and Stupid Sexy Flanders skins (among other cosmetics and items), but you don't have to spend anything extra to unlock a free glider based on Springfield's most famous aliens if you meet a few requirements.As part of the collaboration, Epic and Disney are offering up the Kang and Kodos glider for people who link their MyDisney and Epic accounts by the end of February 2026. If you have Disney+, that will be the same MyDisney account for most cases. Here's how it works:How to link MyDisney and Epic Games accounts:Go to your Epic Games accountClick \"Linked Accounts\"Click the link under \"MyDisney\"Follow the prompts to link your MyDisney and Epic Games accountsThe Kang and Kodos glider. In a FAQ, Epic explained that account-linking is not supported in all regions, so it simply might not be possible where you live, unfortunately. Another thing to note is that only one MyDisney account can be linked to an Epic Games account.Epic Games also clarified that, although the only way to get the Kang and Kodos glider right now is by linking accounts, the developer may offer it for real-money purchase starting in March 2026 at the earliest.The Simpsons are taking over Fortnite for a month, and right now you can dive into a new map with various Springfield landmarks, including Moe's Tavern and the nuclear power plant where Homer works.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]