[
  {
    "title": "Skin Deep Is 2025's Best Cat Game",
    "url": "https://www.gamespot.com/articles/skin-deep-is-2025s-best-cat-game/1100-6536978/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4625579-skin-deep.jpg",
    "tag": "Gaming",
    "date": "2025-12-31T17:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          My favorite moment in Skin...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                My favorite moment in Skin Deep, an immersive sim and stealth game about rescuing cats and fighting your evil clone in deep space, was always the one immediately after a thoroughly developed plan inevitably went sideways. The skittish way that I was forced to sprint and crawl under a table or into a vent. The manner in which my strategy devolved into simply batting things off of shelves in order to incapacitate a roaming guard or noisily distract them from looking in my direction. The way that I leapt onto a guard's back, dug my claws in, and careened them into surfaces in order to knock them out. If you were to close your eyes, I'd argue you could almost hear that distinctive, feline yowl mid-action.In short, I think Skin Deep best captures the experience of being a cat, even if Nina Pasadena, the game's protagonist, is decidedly not one. And for this tremendous feat, I am rewarding it with the honor of being the best cat game of 2025. Long live Skin Deep.In a typical Skin Deep mission, I often tried to keep to the shadows, as is the norm for a game in its genre. I would relegate myself to the ventilation, the pipework surrounding it, and the undersides of tables. Like Batman, I skulked around the perimeter looking for a precise opening that'd enable me to punch a hole in the level's defenses while keeping my cover. Of course, in Skin Deep, it almost never worked out in my favor. Because I am not, in fact, Batman. I'm just a (cat) girl.Eventually, I'd be made in the silliest way possible. I'd linger in the dust-covered vents a little too long and let out the world's loudest sneeze, alerting the guards to my exact location. I'd throw down a bar of soap on one end of the room, be discovered while pickpocketing a guard on the other, and slip on my own trap as I ran back the way I came. Or, as is most often the case, I crouch-walked through a door or vent without first peeking into the room, jumpscared the first guard I saw, and threw the apple core I was holding in my hand at them. When you're crouched like I often was, the camera's perspective is so low to the ground, I almost always felt like a kitten traipsing through the halls and vents of a home I didn't belong in. And just like a flustered orange tabby, my priority became to zoom to safety at the risk of endangering everything and everyone in my warpath the second I was found out.          I could sooner count the number of times a plan has gone right than wrong in Skin Deep, primarily because the former is a far lower number. Most of my successes stem from slapdash plans developed on the fly and from the wreckage of another plan. And yet, despite the failures, it has been more fun to improvise in Blendo Games' deliberately slapstick sandbox and cosplay some kind of fumbling cat lady than come across as some calm and collected black-ops agent. To that end, I found I enjoyed leaning into the bit.I much preferred stalking high and narrow walkways with a charming assortment of irreverent items (a bolt, some ground pepper, a banana, etc.) to looting a weapon. And when I was looting, I, like many cat owners can likely attest to, loved to snatch something I was really not supposed to have--in this case a walkie-talkie or key card--before scurrying back into the shadow and making off as if I got one out from right under those guards' dumb noses.Of course, when I was found by the guards for sticking my nose a little too close to the sun, I did combat like a cat too. Even in the most harried of situations, ones where I was backed into a corner and forced to face off against Skin Deep's roving guards--an intergalactic goon squad straight out of pulpy sci-fi novel called the Numb Bunch--I still felt like a lithe and frenzied cat warrior rather than another human combatant. Melees were won not by hard blows but by swift strikes. A quick flick of the wrist launched one of my collected throwables at a guard. Disoriented, I climbed on their backs and sent them smashing into sinks, toilets, screens, pipes, etc. Anything that carried a high risk of causing CTE, really. Once they were conked out, I hurriedly popped their heads off (since these could fly towards respawn stations and revive a guard) and, like a cat secreting its stolen goods, I hid or threw them down a toilet or garbage chute, permanently incapacitating my foe.Fights in Skin Deep were rarely decided, you see, by sheer willpower and force. It was always about thinking on your feet paws. It was about pulling a fast one on your unsuspecting combatants. It was about being a cat in a world filled with boorish humans and their brute dogs.I found Skin Deep's interpretation of cat-like design immediately refreshing. The industry is no stranger to cat games, many of which are charming in their own ways. However, I typically found that when I engaged with them, they were more preoccupied with the aesthetics of cats than the ways in which their mechanics could convey the feeling of being one.In Stray, I performed and looked like a cat, but never quite felt like one. In Skin Deep, the inverse is true. It is as if, untethered by the expectations of having to make an aesthetically pleasing feline protagonist, Skin Deep was more free to recreate environments a cat would thrive and play in and design systems that rewarded that fantasy. By my estimate, it nailed it. Across its frenetic combat, slapstick stealth, and skittish movement, Skin Deep more wholly realizes the idea of being a cat than any other game I've played. For sticking that landing, it deserves 10/10 toe beans. Or y'know, however many cats have.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Best Of 2025: Avowed's Most Controversial Feature Is Also One Of Its Best",
    "url": "https://www.gamespot.com/articles/best-of-2025-avoweds-most-controversial-feature-is-also-one-of-its-best/1100-6536983/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4625581-avowed-1.jpg",
    "tag": "Gaming",
    "date": "2026-01-01T14:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.  Avowed doesn't allow slain enemies to respawn and is all the better for...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \nAvowed doesn't allow slain enemies to respawn and is all the better for it.By \n    Kenneth Seward Jr.\n   on January 1, 2026 at 6:00AM PST\n              \n                Obsidian's Avowed is one of the better action-RPGs released in 2025. While it doesn't reinvent any particular wheel, it benefits from an engaging campaign, fun combat systems, and charming characters. Aside from the occasional bug--a common element of Obsidian's open-world games--and an overabundance of homicidal bears, I liked nearly everything about the game. That includes Avowed's most controversial game mechanic: enemy respawns, or the lack thereof.When it comes to RPGs, players often think of a few key elements. Some sort of leveling system, quest-granting NPCs, obtainable loot that bolsters certain \"builds\" or playstyles--you know, the basics. One feature that's common but maybe not as notable, considering its use in other genres, is respawning enemies. Players often expect areas to repopulate with baddies whenever they return to a given location. Avowed isn't about that life though--at least, not entirely.Avowed is designed to respond to your actions in meaningful ways, and not just during key moments, where certain decisions can change the direction of the game's story. This also applies to Avowed's enemies. Essentially, most of the outlaws, walking mushrooms, and crazed bears you'll run into during your journey, won't return after being killed. Laid waste to a group of Xaurips while wandering through the forest? Don't worry. They'll still be dead on return trips. Slain a few dozen Spiderlings in an underground lair? They won't be resurrected anytime soon, either. Rinse and repeat--or rather, don't repeat.Of course, this aspect of Avowed's gameplay didn't sit well with everyone. Some didn't like how empty areas felt after a while. Others hated that they couldn't farm enemies for experience points or random loot--a shortcoming that exacerbated the irritating grind of upgrading gear before Avowed's day-one patch. In most cases, the complaints about this feature are reasonable. That said, I liked the idea of never having to face the same enemy twice. Not having to worry about battling the same group of skeletons on return trips to their camp was great, especially during those times when I needed to collect something I missed; returning for a chest that could only be opened with a specific key (or several lock picks) was a breeze.AvowedI also liked how my actions had consequences. If I made a place relatively safe for travelers to explore, it stayed that way. And conversations with NPCs would reflect how I was able to put down a group of bandits that threatened their town. Again, this sort of thing is common when dealing with story-based missions or important side quests. It's easier to role-play when everything you do matters, though. Even on a small scale, it's nice to feel like you're a meaningful part of Avowed's world.The most notable reason this novel feature is a good thing has to do with farmable enemies. There aren't any, which in turn means that grinding for XP isn't a thing. Obsidian has created multiple combat systems that, when combined, offset the need to constantly hit certain levels. Yeah, there are places that are initially off-limits to new players. And seeing multiple enemies with skulls over their heads (indicating their threat level) could mean trouble. But thanks to the ability to upgrade weapons/gear, flexible build-crafting, competent AI companions, and a generous helping of XP whenever a quest is completed, I never felt under-leveled when trying to complete a story-based mission.I've played enough video games over the years to know that grinding, while being a respected method of controlling the pace of certain activities, isn't always needed. I've also gotten to a point where I can better appreciate a developer's efforts to respect my time as a player; this is less \"old person yelling at the clouds\" and more \"I no longer have all of the time in the world to play games.\" That's not to say that I didn't partake in side quests, bounties, and more--just that I was never made to feel like I had to do those things to progress.Avowed offered me a balanced experience throughout my entire playthrough. And part of that appeal came from Obsidian's deliberate efforts to allow players to play at their own pace. You could go through the game clearing all the camps, caves, and abandoned mines in hopes of min/maxing your character. You can also, for the most part, just stick to the main questline and still have a good time. Creating a game that doesn't allow for enemy respawns--which requires changes to the normal RPG grind-fest formula--works in Avowed's favor.\n                                                              \n              \n  Got a news tip or want to contact us directly? Email news@gamespot.com\n    \n    "
  },
  {
    "title": "The Hundred Line: Last Defense Academy Is The Ultimate \"What If\" Game",
    "url": "https://www.gamespot.com/articles/the-hundred-line-last-defense-academy-is-the-ultimate-what-if-game/1100-6537033/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4625576-hundred-line.jpg",
    "tag": "Gaming",
    "date": "2026-01-01T21:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.  We often only see one finalized version of a video game story. What if...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \nWe often only see one finalized version of a video game story. What if you could see 100 permutations of it?By \n    Diego Nicolás Argüello\n   on January 1, 2026 at 1:00PM PST\n              \n                At the beginning of 2025, I fully believed I had grown tired of stories about multiple timelines. During the past decade, the Marvel Cinematic Universe pushed the classic comic book narrative device into the mainstream, fueling a film conglomerate with legally approved cameos, flashy visuals on the silver screen, and loose plots that, eventually, came together for one final pay-off.While the concept of the multiverse has been explored in film and TV even before Marvel's takeover, it quickly became the narrative foundation of choice. When done right, the potential is undeniable--works like Spider-Man: Into the Spider-Verse and Everything, Everywhere, All at Once are heartwrenching displays of interpersonal relationships, making characters face the reality of what-if scenarios, reconciling with their choices and what could have been if they had turned the other way instead. But you can only hear the same tune so many times before it starts to lose its original impact.It wasn't until The Hundred Line: Last Defense Academy that my interest was reanimated. The visual novel and strategy-RPG hybrid presents itself as deceivingly linear, only to push you into a completely different story structure at the very end. It makes for a sprawling web of outcomes based on your choices, all while showcasing different perspectives on events and characters that weave absurdity and sentimentality in equal measure in a showcase of creative prowess from the development team.It all started after an eShop sale in July encouraged me to finally catch up with the Danganronpa and AI: Somnium Files series. It was the perfect motivation to prepare myself for this behemoth of a game, in which the lead developers of both series got together for a joint project that features 100 endings.The concept sounded exhausting--as someone who's constantly playing games for work, I figured I'd never be able to justify the time for it, especially since I wanted to at least play the most prominent modern works from the developers first. To my surprise, I ended up adoring the messiness of Danganronpa's cruel killing games. But it was AI: Somnium Files and its sequel, Nirvana Initiative, that led me to begin to understand The Hundred Line's potential.Both games kick off from linear storylines that set up a detective-style mystery. Eventually, the plot begins to branch out--depending on key decisions you make, you end up pursuing different timelines, all represented in a flow chart that you can use to jump back and forth between them, especially when routes get locked until you've made progress on a different timeline. There's a true ending that, on paper, symbolizes the intended culmination of events. Yet, the process of witnessing what could have happened if I had made a different decision, experiencing the ramifications on characters and their fates and getting alternative endings, was immediately arresting.In a way, playing through The Hundred Line is similar to the experience of getting through both of these franchises as I did. You play as Takumi Sumino, one of 15 high school students who are sent to the mysterious Last Defense Academy to protect humanity from invaders. The story is structured in 100 days, which is exactly the period of time that the students have been commanded to endure. While none of them have as many in-game days, all mainline Danganronpa games share this structure, splitting the visual novel aspect of the story with exploration and trials--in The Hundred Line, the latter takes the shape of strategy RPG battles, as well as free time to increase bonds with characters.But getting to the final day doesn't mean reaching the end. While there's little reason to believe that day 100 isn't basically the story's culmination, it only signifies the end of a prologue. Once you get to the tantalizing date, the game radically changes and becomes similar to AI: The Somnium Files (as well as previous games led by lead developer Kotaro Uchikoshi, such as Zero Escape: Virtue's Last Reward and Zero Time Dilemma). Your task, then, is to explore different timelines and dive into their own what-if scenarios, making decisions that lead to the aforementioned 100 endings.As per usual, there's no shortage of meta text.Speaking to Bloomberg, Danganronpa lead designer Kazutaka Kodaka said that writers were given the freedom to take characters in wild directions, from a comedy route to one where they all turn into zombies. The further you plunge into the flow chart, the more this becomes apparent, with characters adopting different personalities, or the game itself changing drastically in comparison to the calendar schedule of the original 100 days.Normally, choice-driven stories fix you to certain paths depending on what you pick, and they have you carrying those choices from that moment on. Games like this year's Dispatch, for example, brought back the Telltale Games formula into the zeitgeist, as former developers of the studio led the project. There are plenty of \"this character will remember that\" messages on screen, and while some of your decisions do carry some weight toward the end, the main story is structured largely the same. Despite the player's input, the bigger outcomes have already been decided.In The Hundred Line, experiencing different outcomes is akin to opening a treasure trove that will seemingly never run out of surprises. It embodies the curiosity of a whiteboard filled with ideas that the developers had, and the rare chance of actually being able to see them manifested. What would have happened if this character hadn't died? What ramifications could a seemingly small decision have in the lives of your fellow students? The answers to these questions are all laid bare for you to pick and experience for yourself. There is a true ending that you can pursue to uncover the overarching mysteries introduced during the prologue. But there's also the precious opportunity of witnessing completely different stories.At its core, The Hundred Line makes a singular case of how the interactive nature of video games fits stories about multiple timelines like a glove. It's not often that we're able to witness the developers' creativity on such a big scale, either. Yet, it was that exact display that gave me a reappreciation of this narrative device, and left me ruminating about my own choices in life. 2025 marked the tenth anniversary of my first published article. It was the result of responding to a call for writers from someone in a Facebook group I barely knew who was starting her own blog. Had I done differently, that day would have been as any other. I would have continued studying graphic design, perhaps. I would have met completely different people in the years that followed, while video games would have been nothing but a mere hobby. It was only a short message that, at the time, seemed innocuous. I had no idea how much it'd completely change my life.The more end-of-the-year discussions I get to be a part of, the more I realize I'll simply not be able to get to everything I want to see, do, and play in this lifetime. The time commitment of a story with 100 endings is daunting, to put it mildly. But I don't regret spending months preparing for it, as well as the dozens of ongoing hours dissecting its every route. It's a bold showcase of ambition and years of accumulated knowledge paying off, time and time again, in a way that only video games can muster. And it's also a constant showcase of how much our lives can change on a whim without us realizing.\n                                                              \n              \n  Got a news tip or want to contact us directly? Email news@gamespot.com\n    \n    "
  }
]