[
  {
    "title": "Everything New In Fortnite OG Season 7",
    "url": "https://www.gamespot.com/gallery/everything-new-in-fortnite-og-season-7/2900-7332/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4620049-icekingstorm.jpg",
    "tag": "Gaming",
    "date": "2025-12-11T02:35:00.000Z",
    "description": "By     Phil Owen   on December 10, 2025 at 6:36PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Phil Owen\n   on December 10, 2025 at 6:36PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Fortnite OG Season 7, which starts December 11, is reviving many of the best parts of Chapter 1. While Season 1 did include a small celebration of the holidays, it wasn't until Season 7 that Fortnite held a major event with holiday-themed gameplay changes, daily challenges, and lots of free cosmetics.Season 7 was an eventful one from the very start, as the Battle Royale island expanded with the addition of a new snow biome in the southwest corner of the map after a massive iceberg crashed into the island. It also introduced airplanes, added possibly the most infamous weapon in Fortnite history, and held one of Fortnite's most memorable live events. Scroll on to see everything you can expect from Fortnite OG Season 7.Fortnite OG Pass Season 7The Season 7 OG pass includes new versions of three skins from the original Season 7 battle pass: Sgt. Winter, Lynx, and Onesie. Onesie seems to be particularly interesting, since the teaser image we have for it shows the new version with a pattern that uses one of Fortnite's emoticons. The new Onesie may be customizable with any emoticon you have.It's interesting that the pass did not include a new version of the Ice King, despite the fact that he's the season's main character. Because of that, he's a great candidate to receive a new skin in the item shop.The OG pass also includes style options for each skin, along with back blings, pickaxes, wraps, and emotes for each of them. The pass costs 1,000 V-Bucks, and it's included with Fortnite Crew.Fortnite OG Season 7 weapons and lootWhen the original Season 7 began, several items were removed from the loot pool, but nothing was added. Over the course of the season, though, a number of new guns and other weapons and items were added, and some existing guns were unvaulted. And one of the most notorious weapons in Fortnite history, the Infinity Blade, was added a week after launch. But more on that a bit further down.Here are the weapons that will make up the Fortnite OG loot pool in Season 7:Assault RifleScoped Assault RifleThermal Assault RifleSuppressed Assault RifleHeavy Assault RifleInfantry RifleMinigunTactical ShotgunPump ShotgunCompact SMGSuppressed SMGPistolSuppressed PistolDual PistolsHand CannonScoped RevolverHeavy SniperSuppressed SniperHunting RifleGrenade LauncherRocket LauncherBottle RocketsCluster ClingersDynamiteThe Infinity BladeThis weapon, which comes from Epic's mobile game of the same name, is an utterly unique weapon that takes up your entire inventory and gives bonus health and shields when you pick it up, gives siphon on kills, and makes you move faster. The Infinity Blade was so absurdly overpowered that it was vaulted after three days and never returned. Until now.AirplanesThe two biggest things added to Battle Royale when Season 7 began were airplanes and ziplines. The Fortnite airplane is the X-4 Stormwing, an old-style biplane with a machine gun on the front. The X-4 only has one seat, but passengers can ride on the wings. Be warned that you will take fall damage if you fall out of one of these.Fortnite OG Season 7 live eventsFortnite had one major live event midway through Season 7, and then was rocked by a series of earthquakes during the final stretch of the season--a trick Epic has used many other times since then.The mid-season Ice Storm event, which went down on January 19, 2019, was relatively short but extremely memorable, as it involved the spirit of the Ice King standing over the island and conjuring a blizzard that covered the entire island with snow. When the match began only one corner of the island had snow, and when it ended the snow was everywhere. And it stayed that way for weeks.Fortnite OG Season 7 map changesThe southwestern corner of the island got a dramatic makeover and expansion for the start of Season 7 with the addition of a large iceberg and a layer of snow cover. The iceberg destroyed the beloved Greasy Grove and Flush Factory, but it added three new named locations with Polar Peak, Frosty Flights, and Happy Hamlet. Season 7 also saw the introduction of The Block in the northwest corner of the island later in the season.The Block was a big empty space where Epic would showcase places created using Fortnite Creative tools, which were introduced for the first time at the beginning of Season 7--these user-created spots would rotate regularly. We don't know what, if anything, Epic will do with The Block in Fortnite OG    \n  \n                      "
  },
  {
    "title": "Oscar-Winning Director Guillermo del Toro Reveals His Favorite Games, Including A \"Masterpiece\"",
    "url": "https://www.gamespot.com/articles/oscar-winning-director-guillermo-del-toro-reveals-his-favorite-games-including-a-masterpiece/1100-6536847/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4620768-screenshot2025-12-10at3.44.03%E2%80%AFpm.png",
    "tag": "Gaming",
    "date": "2025-12-10T20:10:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Three-time Oscar-winning...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Three-time Oscar-winning director Guillermo del Toro has revealed some of his favorite video games, including BioShock, Death Stranding, Red Dead Redemption, and God of War, among others.Appearing on the Happy Sad Confused podcast, del Toro said Sony's God of War series had some of the \"best cinematic experiences\" he's ever witnessed.\"When [Kratos] fights Odin [in God of War Ragnarok] and Odin keeps coming back and he looks like a Peaky Blinders brawler. He beats the crap out of Kratos. What a great video game. And the way they use the budget of data on the console to create atmospheric dispersion and light. That is lit like a film,\" he said.The filmmaker went on to say BioShock is the \"most immersive\" game he's played, while he singled out Death Stranding (a game he is featured in) as another one of his faves. The game with the best universe is Metal Gear Solid, he added.Some of his other favorite games include Left 4 Dead and \"big sandbox games\" like Red Dead Redemption. He also called out Shadow of the Colossus and labeled it a \"masterpiece\" that is \"poetic and tragic.\"Del Toro himself was for a period of time working on a game called Insane that he was making alongside Saints Row studio Volition until THQ canceled the project. He aimed for it to become a trilogy, and after it was canceled, the director said he was not giving up on it and looking to find another way to bring it to market. That never happened, however.At The Game Awards in 2021, del Toro seemingly hinted at a Silent Hill project, but he later clarified that he was only trying to \"tickle the ribs of Konami\" after the publisher shut down his Silent Hills project. AKA P.T.Following the cancellations of Insane and Silent Hills, del Toro said he gave up on trying to make a video game. \"I have proven to be the albatross of video games,\" he said.\"I have decided, in order not to destroy anyone else's life, I will never again get involved in video games. Otherwise, I'll join someone and his house will explode, or something,\" the filmmaker explained.Del Toro is known for making scary and unsettling films, including Pan's Labyrinth, Hellboy, and Nightmare Alley. He won two Oscars for The Shape of Water and one of Pinocchio. His newest movie, Frankenstein: The Anatomy Lesson, stars Oscar Isaac, Jacob Elordi, and Mia Goth, and is streaming now on Netflix and playing in select theaters.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "These Magnetic 3D Puzzles Inspired By Avatar, SpongeBob, & More Are Perfect Stocking Stuffers",
    "url": "https://www.gamespot.com/articles/shashibo-magnetic-puzzle-cube-deal-stocking-stuffer-idea/1100-6536841/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1702/17023653/4620547-mixcollage-10-dec-2025-10-23-am-8500.jpg",
    "tag": "Gaming",
    "date": "2025-12-11T00:51:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                              If you're seeking a fun...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                If you're seeking a fun and affordable stocking stuffer this holiday season, it's hard to pass up Shashibo Magnetic Puzzle Cube. They're something between a fidget cube and a Rubik's Cube. The shape-shifting puzzle cube is wildly popular, and comes in dozens of designs based on pop culture properties like Avatar: The Last Airbender, Teenage Mutant Ninja Turtles, SpongeBob, and more. Even better, many models are on sale at Amazon, with some as much as 30% off.Most Shashibo products can be rearranged into more than 50 shapes, giving you plenty of reasons to keep coming back and tinkering with their sides. The sides are magnetic, too, so when you find a new position for it, they lock into place with a satisfying snap. Shashibo Shape Shifting Puzzle CubesGallery                                                                                                                                      If none of the themed versions catch your eye, you can also stick with one of the traditional designs like the Shashibo Spaced Out, which is on sale for just $18.19 (was $28). There's also a funky White & Black design available for the same price. Or for something a bit more complex, there's the Shashibo Octa that's on sale for $15 (was $20). There are several designs available, so check the list below for all the options on Amazon. Keep in mind that these are popular sellers and many of the discounts are limited-time deals, so expect prices and availability to change in the coming days.Shashibo Magnetic Puzzle Bos DealsAvatar: The Last Airbender -- $19.89 ($28)AirEarthFireWaterGrateful Dead -- $17.49 ($28)Dancing BearsHaight AshburyHello Kitty -- $19.89 ($28)Garden DoodleKawaiiRainbowMeow Wolf -- $18.89 ($28)Dryer PortalGlowquariumQdot MapSpongeBob SquarePants -- $19.89 ($28)Beach BuddiesKrusty KrabTMNT -- $19.89 ($28)DonnieDonnie (Variant 2)LeoMikeyMikey (Variant 2)RaphaelRaphael (Variant 2)Traditional -- $18.19 ($28)Spaced OutUnderseaWhite & BlackWingsShashibo Octa -- $15 ($20)Shashibo Squared -- $26.748 ($36)Sign up for GameSpot's Weekly Deals Newsletter:                                Official Nintendo Switch 2 Wheel Set For Mario Kart Gets First Discount At Amazon                         Asus ROG Xbox Ally Gets $110 Discount At Amazon                         Super Mario Galaxy Storybook Hardcover Edition Restocked With 15% Discount At Amazon                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (3)                 PSVR 2 Horizon Call Of The Mountain Bundle Is Still On Sale For All-Time Best Price                         New Lord Of The Rings & The Hobbit Illustrated Box Set Is Back In Stock With $72 Discount                         Walmart-Exclusive DualSense Icon Blue Controller Is Back In Stock For $64    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n\n            \n    "
  }
]