[
  {
    "title": "Best Arc Raiders Weapons For PvE And PvP",
    "url": "https://www.gamespot.com/gallery/best-arc-raiders-weapons-for-pve-and-pvp/2900-7245/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1639/16394540/4599932-arcraidersdam1cropped.jpg",
    "tag": "Gaming",
    "date": "2025-11-10T19:35:00.000Z",
    "description": "By     S.E. Doster   on November 10, 2025 at 11:35AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    S.E. Doster\n   on November 10, 2025 at 11:35AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Arc Raiders provides dangerous environments for you to explore, loot, and hopefully survive. It's important to know what guns to use and which situations they work well in. Here we highlight the best weapons to equip in Arc Raiders so you can protect yourself and all your valuable loot. This list includes some powerful high-tier options as well as guns you can craft and use early in your game.The weapons you choose for each raid will depend on your goal for the match. Weapons with heavy ammo are usually better picks for tackling fights with ARCenemies, while medium or light ammo is often enough to down raiders in PvP engagements.Additionally, these guns can be upgraded to become even more powerful to use, and we have a full guide for upgrading weapons and workbenches in Arc Raiders. For more, check out our Arc Raiders quest list and starter tips.FerroThe Ferro is one of the best starter weapons in Arc Raiders. This single-shot battle rifle is a gun of common rarity that you can easily craft or find as loot when you're just getting started with the game. The Ferro makes up for its slow firing and reload speeds with accuracy, long-range damage, and its ability to deal high penetration to ARC armor. This gun is a smart pick for fights against robot and human threats alike, so long as you can hit your shots.Ferro weapon details:Ammo Type: Heavy ammoFiring Mode: Break-ActionARC Armor Penetration: StrongThe weapon allows for mods, and the suppressor can be a handy pick for taking long-range fights without giving away your position.RattlerThe Rattler assault rifle is another great starter weapon in Arc Raiders. This common rarity weapon pairs well with the Ferro battle rifle mentioned above, as this is a full-auto gun that gives you a nice balance for combat. The Rattler is pretty well-rounded in terms of damage, range, and handling. Its high fire rate and moderate armor penetration make it decent for Arc enemies, but even better for PvP encounters.Rattler weapon details:Ammo Type: MediumFiring Mode: Fully-AutomaticARC Armor Penetration: ModerateThe magazine capacity is low for a fully automatic gun, though. Tapping the trigger in bursts instead of spraying a ton of ammo will help you further improve your accuracy as well as conserve your bullets with this gun. Leveling up the Rattler will also increase the ammo capacity of the weapon.AnvilThe Anvil pistol is a weapon of uncommon (blue) rarity. This is a powerful hand cannon, and it works well for most engagements. It doesn't have the same long-range capabilities of the Ferro, but this is another single-shot powerhouse that works great in fights against ARC enemies or raiders. The Anvil being of uncommon rarity means it's not too difficult to loot, craft, or purchase, and you get a lot of bang for your buck.Anvil weapon details:Ammo Type: HeavyFiring Mode: Single-ActionARC Armor Penetration: StrongThe Anvil also has its own unique mod called the Anvil Splitter. This attachment is of legendary rarity, and it allows you to fire three separate projectiles per shot. This mod can make the Anvil feel more like a sawed-off shotgun with a tight pellet spread, but it can reduce your accuracy at longer ranges.BettinaThe Bettina is a weapon of epic rarity. This assault rifle packs a deadly punch, and its strong armor penetration makes it best used against Arc enemies. It does suffer from moderate recoil, but burst firing this gun can allow you to tackle fights against robots at a good range.It's worth noting that the Bettina's weapon durability degrades fast, and it requires valuable resources to repair. However, this is still a fun and powerful gun to use.Bettina weapon details:Ammo Type: HeavyFiring Mode: Fully-AutomaticARC Armor Penetration: StrongYou can also further increase this weapon's power with the gun's unique legendary Kinetic Converter mod, as this will boost the gun's fire rate by 15%. However, this attachment does add more kick with a 20% increase to both horizontal and vertical recoil.TempestThe Tempest is a weapon of epic rarity. This is an assault rifle that is really strong against raiders and decent when fighting Arc enemy types. It's fully automatic and does have some recoil, but the gun's kick is very manageable.Tempest weapon details:Ammo Type: MediumFiring Mode: Fully-AutomaticARC Armor Penetration: ModerateThe mod slots for the Tempest are just the standard variety, but it's worth considering at least throwing on a suppressor to help keep you from drawing too much attention.VulcanoThe Vulcano is a weapon of epic rarity. This is a beefy, semi-automatic shotgun meant for close-range engagements. This is best for when you're clearing buildings and taking out any raiders or small Arc enemies that cause you trouble. Its armor penetration is weak, so it's not the strongest choice for larger Arc robots.Vulcano weapon details:Ammo Type: Shotgun ammoFiring Mode: Pump-ActionARC Armor Penetration: WeakThe Vulcano also lets you equip a suppressor mod, so as always in Arc Raiders, it could be worth adding the attachment to remain stealthy on the map.HullcrackerThe Hullcracker is a special epic-rarity weapon. This is essentially a grenade launcher designed to take down ARC enemies. The Hullcracker doesn't damage raiders, so you'll want a secondary weapon meant for PvP fights, but this launcher's explosive rounds deal massive damage to ARC enemies. It's especially great for bigger threats like the Leaper and Bastion.Hullcracker weapon details:Ammo Type: Launcher ammoFiring Mode: Pump-ActionARC Armor Penetration: Very Strong    \n  \n                      "
  },
  {
    "title": "Diablo 4 Season 11 Will Finally Unlock Waypoints From The Start",
    "url": "https://www.gamespot.com/articles/diablo-4-season-11-will-finally-unlock-waypoints-from-the-start/1100-6536097/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1647/16470614/4599769-diablo4season11waypointchange.jpg",
    "tag": "Gaming",
    "date": "2025-11-10T17:38:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Diablo 4 Season 11 is bringing...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Diablo 4 Season 11 is bringing huge changes to Blizzard's ARPG, among them a major departure for how the game's map and Waypoints work.Since launch, players of Diablo 4 every season have had to unlock most fast-travel Waypoints at the beginning of each new season. This was because discovering Waypoints and uncovering fog of war from the map was tied to Diablo 4's zone-based Renown system, which partially reset each season.          Come Season 11, that will no longer be the case. In an interview with Diablo content creator DuQ, lead live game designer Colin Finer said players who skip the campaign at the start of a new season will have all Waypoints unlocked. Skipping the campaign requires players to have completed it once before.It's a big change that will make the start of each new season go significantly faster, as players will no longer need to mount up and manually travel to various locations, unlocking Waypoints along the way. Instead, Waypoints will be available from the start, letting players quickly and easily travel to wherever they need to go, which should substaintially speed up the start of each season.The change goes hand-in-hand with one of Diablo 4's other big Season 11 changes, as the game will be removing the current Renown system that Waypoints are tied to in favor of a new Season Rank system. Many of the most important rewards from Renown, like additional skill and Paragon points, will instead be tied to completing seasonal objectives as part of Season Rank. Altars of Lilith, another aging piece of Diablo 4 that saw players exploring the map and was tied to the Renown system, are also seeing a big change. They are being reworked to no longer grant permanent stat boosts and will instead grant experience and other minor rewards when discovered.Other huge system reworks coming in Season 11 include significant changes to how Masterworking and Tempering gear works, adjustments to defense and healing, updates to make monsters smarter and more deadly, and the reintroduction of leaderboards in the form of a new challenge dungeon called The Tower.Diablo 4 Season 11 is set to begin on December 9. Blizzard has not yet officially announced Diablo 4's second expansion, but it's expected to arrive in 2026, and just might introduce the Paladin class.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Warhammer 40K MMO Canceled By Marvel Rivals Publisher",
    "url": "https://www.gamespot.com/articles/warhammer-40k-mmo-canceled-by-marvel-rivals-publisher/1100-6536090/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4599604-warhammer4000spacemarine2.jpg",
    "tag": "Gaming",
    "date": "2025-11-10T17:01:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Near the beginning of November,...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Near the beginning of November, word broke that Marvel Rivals publisher NetEase had shut down Fantastic Pixel Castle, the studio founded by former World of Warcraft lead system designer Greg Street that was working on an MMORPG project called Ghost. Now, NetEase has shut down another developer and ended work on a Warhammer 40K MMO as well.As reported by Massively Overpowered, Jackalyptic Games--NetEase's first-party studio behind the Warhammer 40K MMO--is being closed and its game has been cancelled. The news was confirmed in a statement by studio head Jack Emmert.\"I'm here to share a note that after nearly three and a half years working with NetEase Games as a first party studio, our partnership will be coming to an end,\" wrote Emmert in a statement. \"As we navigate this transition, our talented team members will be exploring new opportunities. If you're looking for passionate, creative professionals who bring excellence and collaboration to everything they do, please don't hesitate to reach out.\"NetEase previously laid off Marvel Rivals US-based development team despite the game's continued success since its launch in 2024. A report at the time called the move a \"recalibration of [NetEase's] global strategy\" due to \"geopolitical risks.\" The Witcher 3 director Konrad Tomaszkiewicz's upcoming vampire game, The Blood of Dawnwalker, won't be affected by NetEase's cutbacks according to the game's studio, Rebel Wolves.A separate Warhammer 40K RPG was cancelled by Games Workshop and Nexon in early January 2025. But that franchise is far from finished. Amazon is still producing a live-action Warhammer 40K series for Prime Video, but the show may still be years away. A new game, Warhammer Survivors, was announced earlier this month.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]