[
  {
    "title": "The Next Xbox Will Be \"High-End\" With A \"Curated Experience,\" Xbox President Says",
    "url": "https://www.gamespot.com/articles/the-next-xbox-will-be-high-end-with-a-curated-experience-xbox-president-says/1100-6535604/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1850/18504982/4588906-new-xbox-series-x_s-console-options-family_notext-65586e62c31bf0eee51f.jpg",
    "tag": "Gaming",
    "date": "2025-10-21T18:51:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Despite what you might hear...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Despite what you might hear online, Microsoft is indeed working on a next-generation Xbox. While it's far too early for the Xbox team to share anything concrete about this upcoming machine, Xbox President Sarah Bond teased some vague details about what to expect.Speaking to Mashable in a video interview, Bond addressed rumors that the next Xbox will function similarly to a gaming PC, saying that \"the next-gen console is gonna be a very premium, very high-end curated experience.\"Bond added that with the recently released handheld ROG Xbox Ally, we're \"starting to see some of the thinking that [the Xbox team has], but I don't want to give it all away.\"          Even with Xbox Series X|S struggling in sales numbers compared to PlayStation 5, it would be shocking if the next console from Microsoft were anything but a \"premium\" and \"high-end\" device. But Bond's comment about a \"curated experience\" should inspire speculation, as she didn't directly address murmurs of the next Xbox being PC-like.Executives on the Xbox team have previously stated that the company is focused on building dedicated devices with optimized gaming experiences, with the ROG Xbox Ally being a big part of that initiative. The new handheld emphasizes the Xbox full-screen-experience UI, which also allows users to access games from other PC storefronts, such as Steam. Bringing this interface and functionality to a console would mark a wholly different approach from the competition.Of course, based on what we've seen of the Xbox full-screen experience, the software needs a lot more work. GameSpot's impressions of the ROG Xbox Ally described the operating system as \"undoubtedly frustrating\" to use.No matter how flexible or functional the next Xbox console might be, Xbox still needs to win back some goodwill from consumers after price hikes for the Xbox Series X|S consoles and Xbox Game Pass.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Mortal Kombat 2 Release Date Moved Up, But Not By Much",
    "url": "https://www.gamespot.com/articles/mortal-kombat-2-release-date-moved-up-but-not-by-much/1100-6535603/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4588886-mkmovie2.jpg",
    "tag": "Gaming",
    "date": "2025-10-21T19:35:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          The Mortal Kombat movie sequel...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                The Mortal Kombat movie sequel has a new release date, and it's a week earlier. New Line and Warner Bros. have announced that Mortal Kombat 2 is now releasing on May 8, 2026, according to Deadline, and that's a week prior to its previously announced release date of May 15, 2026.In shifting a week earlier, Mortal Kombat 2 now opens on Mother's Day weekend in the US. It's also now set to release the same day as Sheep Detectives from Amazon MGM Studios.The new date for Mortal Kombat 2 is slightly sooner, but it's still much later than expected. New Line originally had the movie set for release on October 24, 2025 before delaying it more than seven months to May 2026.New Line and Warner Bros. have had success in May, with Final Destination: Bloodlines setting a franchise record when it opened in May this year. Deadline reported that \"research screenings\" for Mortal Kombat 2 have been \"strong, with New Line and Warner Bros. shifting the date to help it reach the widest possible audience and make the most possible money.Director Simon McQuoid said the delay was due to the film being \"a victim of our own success.\"\"Every time people have seen this movie, it's gained momentum,\" the director said, according to The Hollywood Reporter. \"We've created a massive summer blockbuster, so I think we should all be proud of the fact that Mortal Kombat 2 and the franchise itself is going to kick off next year. Yes, we have to wait, but it's going to feel massive when it comes out.\"The Boys' Karl Urban is the most prominent addition to the cast of Mortal Kombat 2 as the fan-favorite Hollywood actor Johnny Cage. The cast also includes Jessica McNamee as Sonya Blade, Ludi Lin as Liu Kang, Adeline Rudolph as Kitana, and Tati Gabrielle as Jade.At New York Comic-Con this month, Warner Bros. announced that it had greenlit Mortal Kombat 3.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Luigi's Mansion Is Coming To Nintendo Switch 2 In Time For Halloween",
    "url": "https://www.gamespot.com/articles/luigis-mansion-is-coming-to-nintendo-switch-2-in-time-for-halloween/1100-6535610/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1578/15787979/4589132-3241432542-.png",
    "tag": "Gaming",
    "date": "2025-10-22T02:15:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Nintendo is bringing another...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Nintendo is bringing another beloved GameCube title to the Switch Online + Expansion Pack service next week. The original Luigi's Mansion is joining the classic games lineup on October 30.Originally released alongside the GameCube in November 2001, Luigi's Mansion sees Mario's cowardly brother exploring a haunted mansion he won in a contest he never entered. With the help of Professor E. Gadd and his vacuum-like Poltergust 3000, Luigi must work his way through the mansion's many rooms and capture all the ghosts that lurk within.          Luigi's Mansion marks the sixth title to arrive on Switch Online's GameCube collection. The library launched alongside the Switch 2 with three games--The Legend of Zelda: The Wind Waker, F-Zero GX, and SoulCalibur II--while Super Mario Strikers and Chibi-Robo were added to the lineup in July and August, respectively.Nintendo will be bringing more GameCube games to the service in the future. The company has already confirmed that additional classics like Super Mario Sunshine, Pokemon Colosseum, and Fire Emblem: Path of Radiance are on the way, although it hasn't yet announced when those games will be added.The GameCube collection is one of a few Switch 2-exclusive perks available to Switch Online + Expansion Pack subscribers. Members can also download the Switch 2 upgrade packs for both The Legend of Zelda: Breath of the Wild and The Legend of Zelda: Tears of the Kingdom for free.An individual subscription for the base Nintendo Switch Online service runs for $20 a year, while the Expansion Pack plan costs $50 a year. Nintendo also offers an annual family plan for $80 that covers up to eight Nintendo Accounts across multiple systems.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]