[
  {
    "title": "All The Game Awards Game Of The Year Winners To Date",
    "url": "https://www.gamespot.com/gallery/all-the-game-awards-game-of-the-year-winners-to-date/2900-7352/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4623035-clairobscurexpedition33.jpg",
    "tag": "Gaming",
    "date": "2025-12-15T20:01:00.000Z",
    "description": "By     Blair Marnell   on December 15, 2025 at 12:01PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                                      \n                            \nBy \n    Blair Marnell\n   on December 15, 2025 at 12:01PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                At The Game Awards last week, Clair Obscur: Expedition 33 became the 12th title to win Game of the Year. Since the awards' inception in 2014, the top prize has rarely gone to an independent studio. But that doesn't mean that the biggest publishers always win either.To date, the publisher with the most Game of the Year Awards is Sony, which emerged victorious last year with Astro Bot, The Last of Us Part 2 in 2020, and God of War in 2018.Surprisingly, Nintendo has only won the award once, for The Legend of Zelda: Breath of the Wild in 2017. Microsoft has yet to win any, although it now owns Activision, which took home the award in 2019 for Sekiro: Shadows Die Twice.Although the onslaught of trailers tends to overshadow The Game Awards themselves, receiving that honor can be a game-changer. CD Projekt's 2015 win for The Witcher 3: The Wild Hunt cemented its status as one of the top independent publishers in the industry. That title has also become one of the best-selling games in history.While there have been winners across multiple game types, RPGs have taken six out of the 12 Game of the Year Awards, and Expedition 33's win is the latest victory for that genre.The complete list of every Game of the Year Award winner from The Game Awards is reproduced below.Game of the Year 2014 -- Dragon Age: InquisitionDeveloper: BioWarePublisher: Electronic ArtsRunners-up:Bayonetta 2Dark Souls IIHearthstoneMiddle-earth: Shadow of MordorGame of the Year 2015 -- The Witcher 3: Wild HuntDeveloper: CD Projekt RedPublisher: CD ProjektRunners-up:Bloodborne Fallout 4Metal Gear Solid V: The Phantom PainSuper Mario MakerGame of the Year 2016 -- OverwatchDeveloper: Blizzard EntertainmentPublisher: Blizzard EntertainmentRunners-up:DoomInsideTitanfall 2Uncharted 4: A Thief's EndGame of the Year 2017 -- The Legend of Zelda: Breath of the WildDeveloper: Nintendo EPDPublisher: NintendoRunners-up:Horizon Zero DawnPersona 5PlayerUnknown's BattlegroundsSuper Mario OdysseyGame of the Year 2018 -- God of WarDeveloper: Santa Monica StudioPublisher: Sony Interactive EntertainmentRunners-up:Assassin's Creed OdysseyCelesteMarvel's Spider-ManMonster Hunter: WorldRed Dead Redemption 2Game of the Year 2019 -- Sekiro: Shadows Die TwiceDeveloper: From SoftwarePublisher: ActivisionRunners-up:ControlDeath StrandingResident Evil 2Super Smash Bros. UltimateThe Outer WorldsGame of the Year 2020 -- The Last of Us Part 2Developer: Naughty DogPublisher: Sony Interactive EntertainmentRunners-up:Animal Crossing: New HorizonsDoom EternalFinal Fantasy VII RemakeGhost of TsushimaHadesGame of the Year 2021 -- It Takes TwoDeveloper: Hazelight StudiosPublisher: Electronic ArtsRunners-up:DeathloopMetroid DreadPsychonauts 2Ratchet & Clank: Rift ApartResident Evil VillageGame of the Year 2022 -- Elden RingDeveloper: From SoftwarePublisher: Bandai Namco EntertainmentRunners-up:A Plague Tale: RequiemGod of War RagnarökHorizon Forbidden WestStrayXenoblade Chronicles 3Game of the Year 2023 -- Baldur's Gate 3Developer: Larian StudiosPublisher: Larian StudiosRunners-up:Alan Wake 2The Legend of Zelda: Tears of the KingdomMarvel's Spider-Man 2Resident Evil 4Super Mario Bros. WonderGame of the Year 2024 -- Astro BotDeveloper: Team AsobiPublisher: Sony Interactive EntertainmentRunners-up:BalatroBlack Myth: WukongElden Ring: Shadow of the ErdtreeFinal Fantasy VII RebirthMetaphor: ReFantazioGame of the Year 2025 -- Clair Obscur: Expedition 33Developer: Sandfall InteractivePublisher: Kepler InteractiveRunners-up:Death Stranding 2: On the BeachDonkey Kong BananzaHades IIHollow Knight: SilksongKingdom Come: Deliverance 2    \n  \n                      \n    "
  },
  {
    "title": "Best Sonic Lego Deals - Dr. Eggman's Drillster Gets Big Price Cut",
    "url": "https://www.gamespot.com/articles/lego-sonic-the-hedgehog-building-playset-best-deals-holiday-2025/1100-6536549/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4623801-legosonicdrillsterthumbnail.png",
    "tag": "Gaming",
    "date": "2025-12-16T08:03:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                                                                                                                                                               A handful of Lego Sonic the Hedgehog sets are discounted for a limited time at Amazon, and since most of the best deals are on building sets Lego is retiring soon, this may be your last chance to secure deals from a major retailer. The best deal is on the current priciest set in the collection. The 540-piece Super Sonic vs. Egg Drillster is up for grabs for $64 (was $80) at Amazon and the Lego Store.Five other Sonic the Hedgehog Lego sets will be disappearing from major retailers soon, including the only Sonic the Hedgehog Lego set designed for adults and experienced builders. If you want to display Shadow the Hedgehog's head on your shelf, the 740-piece model is on sale for $56 (was $70) at Target. Shadow the Hedgehog is exclusive to Target and the Lego Store--it's still priced at $70 directly from Lego--so deals on this set are even less common than on the Lego Sonic products with wider availability. We've rounded up more Lego Sonic the Hedgehog deals at the bottom of this story.                                 Lego Sonic: Super Sonic vs. Egg Drillster (590 Pieces)                                                                $64 (was $80) | Retiring Soon                                                                                                                                                                                    Super Sonic vs. Egg Drillster is one of the coolest playsets in Lego's Sonic the Hedgehog lineup. The 590-piece building set has a bunch of interactive components and features seven characters, including three minifigures: Super Sonic, Shadow, and Dr. Eggman. Two of the characters--Pocky and Pecky--are minifigure accessories for Shadow and Super Sonic to hold. The remaining two characters are small buildable figures of Egg Pawn Badnik and reprogrammed Gun Wing.Dr. Eggman's Egg Drillster vehicle is the largest portion of the build. The movable vehicle measures 9.5 x 5 x 3 inches and has a rotating drill as well as a dock for Gun Wing. The set also has a small laboratory build with a desk, minifigure chair, and a destructible wall. You can knock down the wall with the vehicle's spinning drill or by using the buildable speed sphere launcher piloted by Super Sonic or Shadow.                       Lego Sonic the Hedgehog DealsSonic the Hedgehog Lego Deals                                                                                                                                               Other notable Sonic the Hedgehog Lego deals include three other sets scheduled to retire soon. The aforementioned 720-piece Shadow the Hedgehog display model is $56 (was $70); the 393-piece Tails' Adventure Boat is $41.24 (was $55); and the 325-piece Knuckles and the Master Emerald Shrine playset is down to $26.24 (was $35). The Shadow the Hedgehog head sculpt model is basically the Sonic version of Lego's Star Wars helmets and Marvel masks. It measures 8.5 x 7 x 8 inches with the included display stand and has a few hidden components that fans would appreciate. To reiterate, though, the Shadow the Hedgehog build is, by a considerable margin, a more complicated build than the other Sonic Lego sets.Amazon also has deals on a few Sonic sets that aren't retiring soon, including Knuckles vs. Dr. Eggman Egg Crusher Mech for $36 (was $45) and Super Shadow vs. Biolizard for $39 (was $45). Check out all of the Sonic Lego deals below. All of deals are available at Amazon with the exception of the retailer-exclusive Shadow the Hedgehog.Super Sonic vs. Egg Drillster (590 pieces) -- $64 ($80) | Retiring soonShadow the Hedgehog Model (720 pieces) -- $56 ($70) | Retiring soonTails' Adventure Boat (393 pieces) -- $41.24 ($55) | Retiring soonKnuckles and the Master Emerald Shrine (325 pieces) -- $26.24 ($35) | Retiring soonKnuckles vs. Dr. Eggman Egg Crusher Mech (350 pieces) -- $36 ($45)Super Shadow vs. Biolizard (419 pieces) -- $39 ($45)Team Sonic Command Truck (747 pieces) -- $64 ($70)Sonic's Campfire Clash (177 pieces) -- $16 ($20)Cyclone vs. Metal Sonic (290 pieces) -- $28.49 ($30)Knuckles' Guardian Mech (276 pieces) -- $35 | Retiring soonShadow's Escape (196 pieces) -- $20 | Retiring soon                                                                                                                                               Lego is adding two new Sonic the Hedgehog sets to the lineup on January 1. The new sets are themed are Sonic Racing: CrossWorlds, so soon your Mario Kart Lego characters can race against Sonic, Knuckles, and Silver. Sonic: Speedster Lightning is a 126-piece set for $10, and Silver's Car vs. Knuckles' Monster Truck is a 378-piece set for $40.The Shadow the Hedgehog display model is one of over a dozen Target-exclusive Lego sets on sale this week. The list of deals includes Lego Mario Kart: Piranha Plant Power-Up Pursuit and several display models that launched with the past few months. Check out our Target Lego deals roundup for more details.                                                                                                                                                                               Nintendo Switch 2 Samsung 256GB MicroSD Express Card On Sale For Only $33                         Target's Best Exclusive Lego Sets Get Rare Holiday Discounts                         Xbox Elite Series 2 Controllers On Sale For Even Better Prices Than Black Friday Deals                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Final Fantasy I-VI Pixel Remaster Collection Is Back On Sale For Black Friday Price                         Nintendo Switch 2 Racing Wheel Set Drops To $20 For A Limited Time                         Asus ROG Xbox Ally Gets $110 Discount At Amazon                         Super Mario Galaxy: Rosalina's Storybook Gets 30% Price Cut At Amazon                         PSVR 2 Horizon Call Of The Mountain Bundle Is Still On Sale For All-Time Best Price    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "The Game Awards Gave Clair Obscur: Expedition 33 A Massive Boost",
    "url": "https://www.gamespot.com/articles/the-game-awards-gave-clair-obscur-expedition-33-a-massive-boost/1100-6536980/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4623278-clairobscurexpedition33assemble.jpg",
    "tag": "Gaming",
    "date": "2025-12-16T05:59:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Sandfall Interactive's Clair...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Sandfall Interactive's Clair Obscur: Expedition 33 is having a remarkable second run this month after winning Game of the Year at The Game Awards. It was already one of the top hits of the year, but that added exposure has pushed Expedition 33 even higher than before.According to Alinea Analytics, sales of Expedition 33 jumped 21% on PlayStation 5 and 76% on Steam. The bump was a considerably smaller 3% on Xbox, likely because Expedition 33 is on Game Pass. Regardless, the combined sales across PC and consoles post-The Game Awards is estimated to be over 200,000 additional copies.Sandfall deftly timed new DLC for Expedition 33 to drop almost as soon as it won its final award at The Game Awards. That likely helped fuel the rush of new and returning players that pushed it to 56,993 concurrent players over the weekend, via SteamDB. That's the game's highest count since June.Circana senior director Mat Piscatella also noted on Bluesky that \"the percent of US active PS, XBX and US Steam players engaging with the game more than tripled by Dec 13th when compared to Dec 10th. US Steam showed the largest lift.\" For December 13th, Circana notes that daily active users reached 13th on Steam, 30th on PlayStation, and 33rd on Xbox, all in the US. For added context, Piscatella told GameSpot that, \"In this example, engagement means anyone that started the game. If someone just looked at the menu or played for 24 hours straight it counts. Active player means the percentage of all people who played any game that day on PS, XBX or Steam.\"Expedition 33 made history at The Game Awards, by winning nine out of the 13 categories it was nominated in. French President Emmanuel Macron even offered his congratulations to the devs at Sandfall for their accomplishments. GameSpot also named it our pick for Game of the Year for 2025.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]