[
  {
    "title": "Everything New In Peak The Roots Update - Full Patch Notes",
    "url": "https://www.gamespot.com/gallery/everything-new-in-peak-the-roots-update-full-patch-notes/2900-7238/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1814/18142392/4597279-peakrootsupdate.png",
    "tag": "Gaming",
    "date": "2025-11-05T20:56:00.000Z",
    "description": "By     Diego Nicolás Argüello   on November 5, 2025 at 2:02PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Diego Nicolás Argüello\n   on November 5, 2025 at 2:02PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Discord servers rejoice: Peak has just gotten a new major update called The Roots. The multiplayer climbing game from Aggro Crab and Landfall is introducing another biome into the existing roster, and its theme is quite terrifying.Available today, The Roots might seem similar to Tropics at first glance, but it's got a totally different vibe. Think of it more like a forest than a jungle, packed with its own enemies, traps, and weather hazards. In addition, you can also expect an assortment of fresh items to play with and totally not ruin your current run with friends.From new edible mushrooms with mysterious properties to scary bugs and occult items, there's a lot to unpack. Before you schedule a time and date with the group chat, make sure to check out what's new in Peak with The Roots update below, including the full patch notes at the bottom.If you're looking for some guidance returning to the game, we have guides covering how to get the 24 Karat badge, where to find the secret entrance, how to do the Scout Cannon glitch, where to find the Scoutmaster, and a list with all items available and what they do. In addition, we've also listed the 10 best Peak mods available.New biome enters the rotationThe Roots joins the official Peak lineup of biomes. As of launch, The Roots is replacing Tropics and will be present in every run until November 17. After this date, future maps will rotate randomly between the two. As a summary, Roots is a redwood forest filled with mushrooms--some of which have mysterious properties--as well as some rather obscure creature sightings. If you're not a fan of spiders, make sure to activate the Bug-Phobia mode in the options menu. You've been warned.New enemies to contend withThe Roots introduces a new assortment of enemies that will shake up your expeditions. This includes spiders that can hang from branches and grab you before letting go and potentially ruining a climb, as well as giant beetles. Oh, and there are zombies as well. The update might not have been launched right on time for Halloween, but it definitely carries the spirit.There's a bunch of new itemsExpeditions live and die by the items you find, and there'll be plenty of new strategies to consider with the new update. In terms of Roots-specific items, you'll find the Cloud Fungus, Bounce Fungus, and Fortified Milk. There are also Shroomberries, which have a random effect that cycles out every day alongside the map. The developers mentioned that there are more items, but they are leaving it up to players to discover them.There are also new items that you can find in every biome, including the Rescue Claw, Checkpoint Flag, and Book of Bones, the latest being a new mystical item. Curioser and curioser.Cooking has been overhauledThe cooking mechanic in Peak has undergone some significant changes. Now, a lot more non-food items will have an effect when cooked. Cooked usable but non-food items, such as bandages, for example, will no longer grant additional stamina. Lastly, cooked poisonous berries will now be safe to eat. That being said, you still can't cook the poison out of mushrooms. Try not to burn anything during your experiments.New badges and emotesThe Roots is a massive update, and it's one that also focuses on the smaller, yet important elements that make Peak so fun to play and revisit. Mainly, there are eight new emotes available, plus a total of 11 new badges related to the latest biome. We have the full list here, but be wary that it might spoil a few surprises.Full Peak The Roots Update Patch NotesMAJOR FEATURES Added a new biome: the ROOTS.11 new badges to earn, each with associated cosmetics to unlock as rewards!New Roots-specific Items:  Shroomberries: Each color of Shroomberry gives a random effect, which cycles out every day alongside the map. The best way to find out what they do is to try one! (Or feed one to an unsuspecting friend)Fortified MilkCloud FungusBounce Fungus...And some more we won't tell you about!New items that can spawn in every biome:  Rescue ClawCheckpoint FlagBook of Bones (new mystical item!!)Cooking Overhaul8 NEW EMOTES!!!MINOR FEATURES Players can now join a game or be invited without first having the game open, provided Steam is open.The divorce court has allowed Bing Bong to visit his kids on weekends.BUG FIXES Players can no longer point at stuff (ping) while unconsciousFixed an issue where status over time (hunger, poison, etc) could result in the stamina bar being visually full of status, but the player would not pass out.Extra stamina will now reset to 0 when a scout is killed.Fixed an issue where a reconnecting player could spawn with a different player's statuses/inventory.The game will end properly if all living players disconnect, leaving only dead ones behind.Fixed an issue causing items with limited uses to spontaneously regain all their uses sometimes.Improved the interaction highlight on several items where it was missing or partially missing.Updated a number of badge illustrations lightly for readability.The Napberry Plant spawns again in the Alpine!Please make sure to restart Steam and verify the integrity of the game files to download the new update.    \n  \n                      "
  },
  {
    "title": "Terminator 2D: No Fate Has Been Delayed Yet Again",
    "url": "https://www.gamespot.com/articles/terminator-2d-no-fate-has-been-delayed-yet-again/1100-6535978/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4597337-terminator2nofate.jpg",
    "tag": "Gaming",
    "date": "2025-11-05T23:58:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Bitmap Bureau and Reef...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Bitmap Bureau and Reef Entertainment's throwback side-scrolling game, Terminator 2D: No Fate, has had some trouble getting out of the gate. Earlier this year, No Fate was pushed back to a Halloween release date. Then in September, the game was delayed to late November because of tariffs, according to the publisher. Now, Terminator 2D has been pushed back again, hopefully for the last time.In a post on Steam, Reef Entertainment set a new launch date, December 12, for both the physical and digital versions. The company adds that it has the discs in hand, but it needs extra time to put together the physical editions.\"We are sincerely sorry for the repeated delays,\" reads the statement. \"We don't take your patience for granted, and we never want to disappoint our community. Our goal has always been to deliver the game that you deserve, and we're almost there. Thank you again for standing by us. We're incredibly grateful, and we can't wait for you to finally experience Terminator 2D: No Fate soon.\"The game is a loose adaptation of Terminator 2: Judgment Day that lets players control Sarah Connor and the heroic T-800 as they try to protect John Connor from the T-1000. If they live long enough, they may even prevent Skynet and its machines from nearly exterminating the human race. Players will also be able to control the adult John Connor during levels set in the future war against Skynet.Terminator 2D: No Fate will have two physical editions. The standard edition will go for $60, while a collector's edition has been priced at $120. The latter includes a reversible box art sleeve, a cloth poster, a 25mm collectible metal arcade coin featuring the game's logo, a full-color manual, and a collector’s box.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Overcooked Reality Competition Show Coming To Netflix - Report",
    "url": "https://www.gamespot.com/articles/overcooked-reality-competition-show-coming-to-netflix-report/1100-6535969/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4597154-screenshot2025-11-05at2.56.56%E2%80%AFpm.png",
    "tag": "Gaming",
    "date": "2025-11-05T21:19:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          The cooking game Overcooked is...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                The cooking game Overcooked is getting adapted into a competition reality series for Netflix, according to a new report. The production company A24 has bought the rights to the game and is working with Netflix on an unscripted show, Deadline reported.The show is said to be similar to other Netflix competition series such as Nailed It and Floor Is Lava. \"Overcooked aims to serve up high-stakes kitchen challenges and the signature chaos that made the video game a hit with fans,\" the report said.The series is said to be in the \"early stages\" of development, with multiple developers from Ghost Town Games signed on to be executive producers.Overcooked launched in 2016 and was a big success thanks to its local co-op gameplay where people play as chefs in a kitchen. Players must cook meals, serve them, and clean up against the clock, and the action can get heated very quickly. It's not hard to imagine the appeal as a reality TV series. A sequel, Overcooked 2, came out in 2018, which was followed by Overcooked: All You Can Eat in 2020.The Overcooked reality series is just the latest video game project coming to Netflix. A BioShock movie is also in the works for Netflix, as is a new Assassin's Creed TV show.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]