[
  {
    "title": "All the New Peak Badges In The Roots Biome",
    "url": "https://www.gamespot.com/articles/all-the-new-peak-badges-in-the-roots-biome/1100-6535966/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15957481/4597146-peakrootsrevealtrailer-ign-blogroll-1761840530594.jpg",
    "tag": "Gaming",
    "date": "2025-11-05T19:31:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                              Peak's newest biome is...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                Peak's newest biome is finally here. A flurry of new badges is also available, greatly expanding the number of cosmetics you can use to decorate your scout. The Roots update adds 11 new badges to the hiking hit.The badges include climbing through the new biome, eating new types of consumables, and using new items to help save your friends’ fragile lives. The list of new accolade challenges includes:Climb past the RootsClimb past the Roots without ever having more than 25% sporesEscape a spider's web and surviveCure yourself from a zombie biteTry all 5 types of Shroomberry in a single expeditionPull an unconscious friend 30m with the Rescue ClawBlock 100 total damage with the Fortified MilkEat 3 hot dogs in 5 seconds or lessResurrect friend using unholy meansBounce up to 40m off a mushroomCook and eat a MandrakeAs you can see, the new update brings plenty more to do while climbing. Achievement hunters who previously collected all badges will now have even more challenges with the Roots update.This new update has players flocking back to Peak. Landfall's breakout cooperative multiplayer game currently has more than 50,000 players trying to climb through the new Roots biome. While that’s not quite close to its 170,000-player peak, it’s still a hefty number of players.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n        \n\t\n\t\tLatest in\n\t\tPEAK\n\t\n\n\n            \n    "
  },
  {
    "title": "Original Switch Will Not Be Removed From Sale, But Nintendo Will Focus On Switch 2 Going Forward",
    "url": "https://www.gamespot.com/articles/original-switch-will-not-be-removed-from-sale-but-nintendo-will-focus-on-switch-2-going-forward/1100-6535968/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4597148-ogswitch.jpg",
    "tag": "Gaming",
    "date": "2025-11-05T19:14:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          As part of Nintendo's latest...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                As part of Nintendo's latest earnings report, the company disclosed plans for the original Switch now that the Switch 2 is in the market and putting up big sales numbers. The original Switch will continue to be sold, Nintendo confirmed, but the company will focus on the Switch 2 going ahead.\"While our business focus will shift to Nintendo Switch 2, Nintendo Switch has maintained a steady sales pace even after the June launch of its successor. While taking consumer demand and the business environment into consideration, we will continue sales of Nintendo Switch hardware,\" Nintendo said.In total, Nintendo has sold 154.01 million Switch consoles worldwide through September 30, and that's just 10,000 units short of passing the DS to become Nintendo's best-selling platform of all time.The Switch is still millions of units short of catching up to the PS2, which is the best-selling console of all time with an estimated 160 million units sold. At least one expert believes the Switch will not catch the PS2.Earlier this year, Nintendo raised prices on the original Switch and a variety of accessories due in part to the impact of tariffs.Looking ahead, Nintendo is predicting to sell fewer Switch consoles than before. For the current fiscal year, Nintendo is now expecting to sell 4 million units, down from a previous prediction of 4.5 million. However, Nintendo is revising Switch game sales up from 105 million to 125 million.For the Switch 2, meanwhile, Nintendo is raising projections from 15 million to 19 million for the current fiscal year. The Switch 2 has sold more than 10 million units worldwide, making it the fastest-selling Nintendo platform ever over its first four months.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Dante's Inferno Sequel Would Have Taken Its Hero Through A War In Purgatory",
    "url": "https://www.gamespot.com/articles/dantes-inferno-sequel-would-have-taken-its-hero-through-a-war-in-purgatory/1100-6535967/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4597058-dante%27sinferno.jpg",
    "tag": "Gaming",
    "date": "2025-11-05T19:28:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          In 2010, Visceral Games and...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                In 2010, Visceral Games and Electronic Arts unleashed Dante's Inferno, an action-adventure game that was their answer to God of War. The story was very loosely inspired by Dante Alighieri's classic text, The Divine Comedy, as Dante sought to retrieve the soul of his wife, Beatrice, from Hell while facing Lucifer and the forces of evil. Now, 15 years after the game's release, new details have emerged about the canceled sequel, Dante's Inferno 2: Purgatorio.IGN has an extensive report about Purgatorio, which includes a comprehensive breakdown of the story. The follow-up was envisioned as the inverse of the first game, as Dante was meant to scale Mount Purgatory to reunite with Beatrice and reach the Garden of Eden on top. However, each layer of the mountain represented one of the Seven Deadly Sins, and Dante had to both purge himself of those sins and defeat the embodiment of each one.Dante also would have found himself in the middle of a war between Heaven and Hell, which he inadvertently set off by allowing Lucifer to escape Hell and invade Purgatory. St. Lucia--Dante's guardian angel from the first game's DLC--and the poet Virgil would have returned to guide Dante on his journey. To reach his goal, Dante would have to defeat some lethal archangels who considered him to be their enemy.Along the way, Dante would have reunited and reconciled with Beatrice and banished her evil side from her. Or at least that's what he thought he did. In the game's closing moments, Dante and Beatrice made it all the way to Heaven, just for the former to discover that Lucifer had tricked him again. Through Beatrice, Lucifer murders Dante and casts him all the way back down to Hell. The only hope that ending offered is the spirit of St. Lucia, who assures Dante that even his death was part of God's plan.The proposed third game, Dante’s Inferno 3: Paradiso, would have brought the war between Heaven and Hell to Earth and introduced Dante and Beatrice's daughter, who would be among the mortal warriors who fight alongside angels to reclaim Heaven from Lucifer and save Beatrice. God's plan would have been revealed as a plot to tear down the unforgiving ritual of sending souls to Heaven or Hell and replace it with something more compassionate.Unfortunately, these ideas will likely never see the light of day as a game. But it's an intriguing look at what could have been.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]