[
  {
    "title": "CoD: Black Ops 7 Zombies Wonder Weapon - How To Get The Necrofluid Gauntlet In Ashes Of The Damned",
    "url": "https://www.gamespot.com/gallery/cod-black-ops-7-zombies-wonder-weapon-how-to-get-the-necrofluid-gauntlet-in-ashes-of-the-damned/2900-7261/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1639/16394540/4603962-bo7-zombies-intel-blast-013.jpg",
    "tag": "Gaming",
    "date": "2025-11-17T19:17:00.000Z",
    "description": "By     S.E. Doster   on November 17, 2025 at 11:18AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    S.E. Doster\n   on November 17, 2025 at 11:18AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Zombies mode returns in Call of Duty: Black Ops 7 with the brand-new Ashes of the Damned map. This map's specific Wonder Weapon is the Necrofluid Gauntlet, which is a powerful claw-like glove that lets you deal damage and siphon health. In this guide, we'll walk you through how to get the Necrofluid Gauntlet for your next match of Zombies on Ashes of the Damned.If you want to listen to the map's secret song, we have a guide on how to unlock the Easter egg song on Ashes of the Damned.Tip before starting: You or someone in your co-op session should equip stun grenades before starting the match. This will save you time and salvage later.Activate power for the mapThere are three power generators you'll need to activate to get started with this Wonder Weapon quest.The order doesn't matter, so follow the initial quest markers provided for upgrading Ol' Tessie. You can choose to go to Blackwater or Vandorn Farm. Power up the generator at your first stop, and then you'll go to Ashwood. Power up the generator at Ashwood, and then you can loop back to whichever location you haven't completed yet.Takedown Uber KlausAfter the map is powered up, head back to the spawn location (Janus Towers) and spawn an Uber Klaus. This is the same mini-boss from Black Ops 6's the Reckoning map, and he's not easy to beat, especially in the early rounds. Make sure you have basic perks and an upgraded weapon before tackling this fight.Uber Klaus is spawned by walking away from Janus Towers and heading toward the crashed and fiery shipping container on the right side of the road. This can happen as early as rounds 8 through 11.You need to eliminate the Uber Klaus. Pick up the Stabilizer Chip he drops.Release OG KlausIt seems the original Klaus from Black Ops Cold War has been trapped in the Dark Aether since the end of the game. Now, you're freeing him in Ashes of the Damned. You'll need to take the Stabilizer Chip to Ashwood and open the door that leads to the jail. The jail is a small building near the Vulture Aid perk.Klaus is locked in a jail cell, and you'll need to wake him up. You need to toss four stun grenades at Klaus to wake him.If you didn't bring stuns into your match as part of your loadout, you can make them at crafting benches for 200 salvage or find them randomly dropped by zombies.Command Klaus and complete scanOnce Klaus is awake and flies out of his jail cell, you need to quickly drive Ol' Tessie to Zarya Cosmodrome.Drive straight in and exit to the right, and you'll see a ramp that leads down to a large door that must be opened. Open it to gain access to the Support Systems area of the map, and command Klaus to stand at the broken terminal in the wall.You command Klaus by hitting your left bumper (LB/L1). If you take too long, Klaus will go dormant, and you'll need to wait until his cooldown ends to try again.He will punch the terminal, and then you need to interact with it. Stand in the red-highlighted spot that appears on the ground. You need to remain there while the system scans you, but you'll also need to defend yourself from zombies. Make sure you turn and face the scanner where the light is coming from at least once, but you don't have to stare at it the whole time.Charge the canisterOnce the scan is complete, you'll be able to pick up the canister in the wall. You need to take this to all three power generators you charged on the map. This is done one by one, but you're under a time limit, so you want to be as efficient as possible.It's fastest to go to Ashwood first. Place the canister inside the generator, and you need to survive while a meter fills for \"refined energy extraction.\"Grab the canister when complete and rush to Blackwater to complete the same process. Once you grab it from the generator, you'll only have 1:45 minutes to get it installed in the next one.Lastly, do this step at Vandorn Farm. Once the extraction process is complete at the farm, you then want to rush the canister to the underground cellar area beneath the barn.Interact with the strange cube on the pedestal in the cellar, and it will take the charged canister from you.Get the symbolsDrive Ol' Tessie back to the spawn and use the launch pad there to go back to Vandorn Farm. This is because you need to be airborne and looking for three glowing symbols on the rooftops. The symbols are red and found on top of the barn, farmhouse, and silo, as shown in the image above.You'll want to remember these, and they will be different in every match.Input the symbolsGo back to the cube under the barn. Three sides of the cube have glowing markers on them, and one side has an eyeball. Don't use the side with the eyeball, but interact with the other three, and cycle through symbols on them until you have all three rooftop symbols input into the cube.Claim the Necrofluid GauntletYou can now grab the Necrofluid Gauntlet by interacting with the cube's eyeball, but you'll need to complete a lockdown and survival step before you can walk away with the Wonder Weapon.This requires you to kill zombies and shoot green blobs on the wall with the Necrofluid Gauntlet. The floor is glowing green during this step, and you'll know it's complete when the glow disappears.    \n  \n                      "
  },
  {
    "title": "All Black Ops 7 Campaign Intel And How To Find Them",
    "url": "https://www.gamespot.com/gallery/all-black-ops-7-campaign-intel-and-how-to-find-them/2900-7259/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1639/16394540/4603908-bo7-pc-005.jpg",
    "tag": "Gaming",
    "date": "2025-11-17T18:48:00.000Z",
    "description": "By     S.E. Doster   on November 17, 2025 at 10:50AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    S.E. Doster\n   on November 17, 2025 at 10:50AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Call of Duty: Black Ops 7 is live with a brand-new cooperative campaign. There are 11 missions total, and each mission has one piece of hidden campaign intel to collect. In this guide, we'll show you all 11 pieces of intel and where to collect them in the Black Ops 7 campaign.If you're looking for how long the story will take to complete, we break down all the Black Ops 7 campaign missions and details for you. Our full Black Ops 7 review can be found here.ExposureOnce your mission takes you to Nicaragua, you'll find this piece of intel after the first giant machete tries to hit you. The intel is a machete sitting on the well.InsideWhen you first meet Karma by the docks. This piece of intel is on the ground by the body bag behind her.DistortionThis one is tricky. When your objective becomes \"Rescue Woods\" and you need to open the container, do not open the container right away. Enter the mausoleum on the floating island below the platform with the container. This is hard to see, but go behind the container, look down, grapple to the lower island, and then turn around to see a hidden mausoleum room. The intel is dog tags hanging from a knife.EscalationNear the end of the mission. When you reach the server room you need to hack, don't start hacking right away. Instead, go inside and look for the smaller room with laptops on a desk. The intel is a USB flash drive in the laptop.DisruptionEventually, you're tasked with jumping down through a skylight into a Guild building. Do this, but search the building before entering the restricted area for your mission. There is a small staircase leading to an office. This intel looks like a hard drive sitting on a table.CollapseExit the colosseum and head toward the SAM site you need to secure. Turn left and look around the broken walls and pillars for the intel. It's a head from a statue.FractureThis one is early in the mission. You'll warp through a red portal and the highway becomes distorted. Fight through the enemies and run along the middle of the warped highway until you see a red semi-truck. Drop inside the cargo area of the truck and look near the back to find an American Flag pin as intel.QuarantineAt the start of the mission, you're tasked with breaching a tower and zipping up to a top floor. You'll force open elevator doors, and your mission asks you to \"search the office.\" You'll want to ignore the office and take an immediate right after exiting the elevator. There's a set of stairs here. Go up the stairs and enter the large conference room on the right. The intel is a canister on the large table.SuppressionYou'll need to fight through the prison segment of the mission. Afterwards, you'll reach the cabin that was David Mason's childhood home. Go inside and up the stairs to the room on the right. Turn right again as soon as you walk inside. There is a fishing pole in the corner, and this is your intel.BreakpointAfter leaving the safe house, you are tasked with disabling Cradle shipments. Your objective mark leads you to Avalon's stadium. Don't complete the objectives once you get there. Instead, drop down to the section of the road close to the bridge. There's a shipping line of Guild cargo containers. One near the bridge is open, and you can get an intel item called Trigger Finger.ContainmentThe last piece of mission intel is found during the G-X Strider boss fight, and it's in a sneaky location. Look for the control room window above you, and you'll see a cluster of white shipping containers. You want to mantle up to the top of the containers and turn right. There is another container you can run along the top of, and you're wanting to get on top of it, look down, and find the open container you can get inside of. This final piece of intel is a canister.Collecting this intel will earn you XP, a Calling Card reward, and it also works toward the completion of the Loremaster trophy/achievement for Black Ops 7.    \n  \n                      "
  },
  {
    "title": "Alan Wake 2 Deluxe Edition IS $20 Off Ahead Of Black Friday",
    "url": "https://www.gamespot.com/articles/alan-wake-2-deluxe-editions-are-20-off-for-black-friday/1100-6536295/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1701/17013431/4605021-alanwakeii.jpg",
    "tag": "Gaming",
    "date": "2025-11-17T20:33:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               The physical versions of Alan Wake 2 Deluxe Edition are discounted during Amazon's early Black Friday offerings. You can pick up either the PlayStation 5 or Xbox Series X versions for $40, saving you $20 off the original price of $60. This version includes the base game, all the post-launch story DLC expansions, and a selection of bonus digital content.                                 Alan Wake 2 Deluxe Edition                                                                $40 (was $60)                                                                                                                                                                                    Alan Wake II first launched in 2023 as a digital-only title, but finally received an official physical release in Fall 2024 with this Deluxe Edition on PS5 and Xbox Series X. Along with the physical box and game on disc, you also receive a selection of bonus content, including The Lake House and Night Springs story expansion DLC packs. Here's everything included in the Alan Wake 2 Deluxe Edition:Alan Wake Remastered Digital Edition Download CodeNight Springs DLCThe Lake House DLCCrimson Windbreaker Saga Anderson SkinCelebrity Suit Alan Wake SkinParliament Shotgun SkinNordic Shotgun SkinLantern Charm                      Alan Wake 2 was the sequel over 10 years in the making. When it finally released in 2023, it was one of the year's best games, earning a coveted 10 out of 10 from GameSpot's Mark Delaney in his review. In it, players once again assume the role of titular troubled writer Alan Wake, who has been trapped in the Dark Place since the end of the first game. This time, however, you also play as FBI Agent Saga Anderson, who's been sent to Bright Falls, Washington to investigate mysterious and gruesome ritualistic murders. The game features stunning visuals, immersive gameplay, great writing, and plenty of jump scares, perfect for fans of the survival horror genre.If you're looking for something less spooky, there are still plenty of other games getting early Black Friday price cuts. The Final Fantasy I-VI Pixel Remasters Collection is at its lowest price ever, going for $40 (was $75), and the recently released Borderlands 4 is at a steep discount by new game standards. Whatever the genre, there are great video game deals to take advantage of this Black Friday. Check the links below for a few more noteworthy early price cuts, and be sure to check out GameSpot's Black Friday deals hub throughout the month for the latest holiday shopping discounts.More Video Game Black Friday DealsBorderlands 4 (PS5, Xbox Series X, Switch 2) -- $48 ($70)Final Fantasy I-VI Pixel Remaster Collection (Switch, PS4) -- $40 ($75)Hello Kitty Island Adventure (Switch, PS5) -- $25 ($40)Legacy of Kain: Soul Reaver 1 & 2 Remastered (Switch) -- $35 ($50)The Plucky Squire (Switch) -- $15 ($40)Tomb Raider IV-VI Remastered Deluxe Edition (Switch, PS5) -- $30 ($50)Wuchang: Fallen Feathers (PS5, Xbox) -- $40 ($50)                                                                                                                                               Sign up for GameSpot's Weekly Deals Newsletter:                                Meta Quest 3S VR Headset Black Friday Deals Are Live At Amazon                         Grab A Wireless GameCube-Style Controller For Switch 1/2 & PC For Only $40                         Amazon-Exclusive Lunar Remastered Collection Gets First Price Cut                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (4)                 Final Fantasy Magic: The Gathering Deal - Save $45 On Play Booster Box                         Sunrise On The Reaping New Collector's Gift Edition Is Already Discounted At Amazon                         Lego DC Batman Figure & Bat-Pod Is Over 50% Off At Amazon, Sold Out Everywhere Else                         Honkai: Star Rail 8BitDo Ultimate 2 Collector's Bundle Gets First Discount    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n        \n\t\n\t\tLatest in\n\t\tAlan Wake II\n\t\n\n\n            \n    "
  }
]