[
  {
    "title": "As PS5 Turns 5, Here Are Its Top 10 Best-Selling Games Ever In The US",
    "url": "https://www.gamespot.com/gallery/top-10-best-selling-ps5-games/2900-7249/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4601049-screenshot2025-11-12at10.41.40%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-11-12T15:25:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                Happy birthday, PS5The PlayStation 5 launched on November...",
    "body": "\n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Happy birthday, PS5The PlayStation 5 launched on November 12, 2020, meaning the console has just celebrated its fifth anniversary.To mark the occasion, Circana's Mat Piscatella published a rundown of the console's top 10 best-selling games overall in the US.Activision's Call of Duty: Black Ops 6 is the PS5's best-selling game overall, with Marvel's Spider-Man 2 ranking second. Call of Duty: Modern Warfare 2 (2022), EA Sports College Football 25, and Call of Duty: Modern Warfare III (2023) round out the top five.Read on to see the full list of best-selling PS5 games since launch. Of note, the list is ranked by dollar sales, not unit sales. Additionally, the list counts only full-game sales, excluding revenue from DLC and microtransactions."
  },
  {
    "title": "Why Hasn't Xbox Brought More Games To Switch 2? Former Nintendo Exec Wonders",
    "url": "https://www.gamespot.com/articles/why-hasnt-xbox-brought-more-games-to-switch-2-former-nintendo-exec-wonders/1100-6536136/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4600988-screenshot2025-11-12at8.52.33%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-11-12T13:34:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Former Nintendo of America...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Former Nintendo of America president Reggie Fils-Aime has gone on record to say he is surprised that Microsoft has not yet \"fully embraced\" the Switch 2 when it comes to releasing games for it.Speaking to The Game Business, Fils-Aime said, \"Certainly some games could easily be ported over to Switch 2. And I'm surprised that we haven't seen more of that.\"He added: \"I thought there would be much more, especially during this timeframe leading into the holiday.\"Fils-Aime went on to say he has been expecting some kind of \"dedicated announcement\" from Microsoft about the games it will bring to Switch 2. \"I'm surprised it hasn't happened,\" he said.In 2026, Microsoft will bring Indiana Jones and the Great Circle to Switch 2. Additionally, Microsoft-published titles like Minecraft and Tony Hawk's Pro Skater 3+4 are already playable on Switch 2. There are also rumors of Halo coming to Switch 2, though the console was not mentioned when Microsoft announced Halo: Campaign Evolved recently. Phil Spencer has said he wants to support NintendoEarlier this year, Microsoft Gaming CEO Phil Spencer said he was \"really looking forward to\" supporting Nintendo in the future with its own Xbox games.\"I just think they're such an important part of this industry,\" Spencer said of Nintendo. \"Who would ever bet against the success of that team? I mean they are just masterful in what they do--Switch is a massive success--and I think Switch 2 will be as well.\"Microsoft has also said time and again that it wants to bring Call of Duty to the Switch family, but as of yet, it hasn't happened, and this week's new release, Black Ops 7, is not confirmed for Switch 2.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "PokePark Kanto Gets Grand Opening Date, And It's Not Far Away",
    "url": "https://www.gamespot.com/articles/pokepark-kanto-gets-grand-opening-date-and-its-not-far-away/1100-6536139/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1813/18138562/4600994-pokeparkkanto.jpg",
    "tag": "Gaming",
    "date": "2025-11-12T14:19:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          In just a few months, seeing a...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                In just a few months, seeing a Pikachu sitting between trees in the Pokemon Forest will become a reality with the opening of PokePark Kanto. The Tokyo-based attraction is set to welcome its first visitors on February 5.The Pokemon Company has stated that tickets will go on sale November 21 at 1 AM PT / 4 AM ET. PokePark Kanto \"will be the first-ever permanent outdoor Pokemon attraction,\" situated on 26,000 square meters of land at Yomiuriland. The Pokemon theme park is basically split up between two areas: Pokemon Forest and Sedge Town.          The Pokemon Forest offers an opportunity to see the pocket monsters out in nature. A PokePark Kanto trailer--seen above--showcases a group of Eevees running through the grass, while a Charizard stands sentinel on the pathway. Meanwhile, Sedge Town showcases Pokemon and people living together. Visitors can apparently catch a show at the Pokemon Gym there and even run around a Battle Court.The early 2026 opening window for PokePark Kanto was first revealed at a Pokemon Presents in July. The theme park was originally announced in late 2023. Kanto is the setting of the first games in the franchise, Pokemon Red and Blue. As such, PokePark Kanto will serve as a 30th-anniversary celebration for the series.Pokemon Legends: Z-A, the latest game in the franchise, released last month for Switch and Switch 2. The RPG quickly sold 5.8 million copies, and overall, Pokemon video games have sold roughly half a billion copies.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]