[
  {
    "title": "Everything New In Fortnite OG Season 7",
    "url": "https://www.gamespot.com/gallery/everything-new-in-fortnite-og-season-7/2900-7332/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4620049-icekingstorm.jpg",
    "tag": "Gaming",
    "date": "2025-12-11T02:35:00.000Z",
    "description": "By     Phil Owen   on December 10, 2025 at 6:36PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Phil Owen\n   on December 10, 2025 at 6:36PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Fortnite OG Season 7, which starts December 11, is reviving many of the best parts of Chapter 1. While Season 1 did include a small celebration of the holidays, it wasn't until Season 7 that Fortnite held a major event with holiday-themed gameplay changes, daily challenges, and lots of free cosmetics.Season 7 was an eventful one from the very start, as the Battle Royale island expanded with the addition of a new snow biome in the southwest corner of the map after a massive iceberg crashed into the island. It also introduced airplanes, added possibly the most infamous weapon in Fortnite history, and held one of Fortnite's most memorable live events. Scroll on to see everything you can expect from Fortnite OG Season 7.Fortnite OG Pass Season 7The Season 7 OG pass includes new versions of three skins from the original Season 7 battle pass: Sgt. Winter, Lynx, and Onesie. Onesie seems to be particularly interesting, since the teaser image we have for it shows the new version with a pattern that uses one of Fortnite's emoticons. The new Onesie may be customizable with any emoticon you have.It's interesting that the pass did not include a new version of the Ice King, despite the fact that he's the season's main character. Because of that, he's a great candidate to receive a new skin in the item shop.The OG pass also includes style options for each skin, along with back blings, pickaxes, wraps, and emotes for each of them. The pass costs 1,000 V-Bucks, and it's included with Fortnite Crew.Fortnite OG Season 7 weapons and lootWhen the original Season 7 began, several items were removed from the loot pool, but nothing was added. Over the course of the season, though, a number of new guns and other weapons and items were added, and some existing guns were unvaulted. And one of the most notorious weapons in Fortnite history, the Infinity Blade, was added a week after launch. But more on that a bit further down.Here are the weapons that will make up the Fortnite OG loot pool in Season 7:Assault RifleScoped Assault RifleThermal Assault RifleSuppressed Assault RifleHeavy Assault RifleInfantry RifleMinigunTactical ShotgunPump ShotgunCompact SMGSuppressed SMGPistolSuppressed PistolDual PistolsHand CannonScoped RevolverHeavy SniperSuppressed SniperHunting RifleGrenade LauncherRocket LauncherBottle RocketsCluster ClingersDynamiteThe Infinity BladeThis weapon, which comes from Epic's mobile game of the same name, is an utterly unique weapon that takes up your entire inventory and gives bonus health and shields when you pick it up, gives siphon on kills, and makes you move faster. The Infinity Blade was so absurdly overpowered that it was vaulted after three days and never returned. Until now.AirplanesThe two biggest things added to Battle Royale when Season 7 began were airplanes and ziplines. The Fortnite airplane is the X-4 Stormwing, an old-style biplane with a machine gun on the front. The X-4 only has one seat, but passengers can ride on the wings. Be warned that you will take fall damage if you fall out of one of these.Fortnite OG Season 7 live eventsFortnite had one major live event midway through Season 7, and then was rocked by a series of earthquakes during the final stretch of the season--a trick Epic has used many other times since then.The mid-season Ice Storm event, which went down on January 19, 2019, was relatively short but extremely memorable, as it involved the spirit of the Ice King standing over the island and conjuring a blizzard that covered the entire island with snow. When the match began only one corner of the island had snow, and when it ended the snow was everywhere. And it stayed that way for weeks.Fortnite OG Season 7 map changesThe southwestern corner of the island got a dramatic makeover and expansion for the start of Season 7 with the addition of a large iceberg and a layer of snow cover. The iceberg destroyed the beloved Greasy Grove and Flush Factory, but it added three new named locations with Polar Peak, Frosty Flights, and Happy Hamlet. Season 7 also saw the introduction of The Block in the northwest corner of the island later in the season.The Block was a big empty space where Epic would showcase places created using Fortnite Creative tools, which were introduced for the first time at the beginning of Season 7--these user-created spots would rotate regularly. We don't know what, if anything, Epic will do with The Block in Fortnite OG    \n  \n                      "
  },
  {
    "title": "PlayStation Plus Extra/Premium Games For December 2025 Include Assassins And Skateboarders",
    "url": "https://www.gamespot.com/gallery/playstation-plus-extra-premium-games-for-december-2025-include-assassins-and-skateboarders/2900-7333/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4620537-psplusgamecatalogdecember2025.jpg",
    "tag": "Gaming",
    "date": "2025-12-10T17:35:00.000Z",
    "description": "By     Darryn Bonthuys   on December 10, 2025 at 9:35AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Darryn Bonthuys\n   on December 10, 2025 at 9:35AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                With the festive season in full swing and many people planning to take a well-deserved break, grabbing a few downloads from the PlayStation Plus Game Catalog sounds like a grand idea. For December, the subscription service is adding 10 more games to its library, including the day-one release of Skate Story, Assassin's Creed action with an old-school flavor, and a colorful RPG adventure in the skies.Aside from Skate Story, these will all be available starting December 16. See the full list below. In case you missed it, the December free games for PS Plus subscribers--Lego Horizon Adventures, Killing Floor 3, The Outlast Trials, Synduality Echo of Ada, and Neon White--are also available to claim, so make certain to do so before January 5, 2026.If you're curious to see just how much time you spent playing games this year, you can also check out the 2025 PlayStation Wrap-Up for a breakdown on which games you were focused on.Assassin's Creed Mirage (PS5, PS4)First released in 2023, Assassin's Creed Mirage was billed as a return to the stealth-focused roots of the series. Set in ancient Baghdad, the game follows Basim Ibn Ishaq after he is recruited into the Hidden Ones and joins the fight against the Order of the Ancients.Wo Long: Fallen Dynasty (PS5, PS4)Developed by Team Ninja--the studio behind the Nioh games and co-developer of Ninja Gaiden 4--Wo-Long: Fallen Dynasty is a fast-paced action game with parry-based combat that'll appeal to Sekiro: Shadows Die Twice fans. Set during China's Three Kingdoms period of history, the game puts a dark fantasy and souls-like spin on this era of Chinese history. Skate Story (PS5)A day-one release, Skate Story puts you in control of a demon who makes a deal with the devil to swallow the moon. As if that didn't sound challenging enough, your demonic avatar also happens to be constructed from glass and pain, so any fumble is going to hurt really badly. Not only do you have to master your skateboard, but you also have to use it to overcome other demons, save tormented souls with your sick tricks, and discover the secrets of hell without taking a tumble. Granblue Fantasy: Relink (PS5, PS4)As the captain of a skyfaring crew, you've got free rein to explore the floating archipelago of the Sky Realm in Granblue Fantasy: Relink and find the legendary island of Estalucia. That's easier said than done, as between enemy gangs and a growing plot in the background that threatens the entire Sky Realm, you'll have your work cut out for you in this fantasy game.Planet Coaster 2 (PS5)Looking to become a theme park master? Then you'll want to grab a download of Planet Coaster 2 and start building some attention-grabbing rides. Building on the foundation set by its predecessor, Planet Coaster 2 offers more tools and resources to not only construct exciting water rides and coasters, but also the facilities to keep your park guests happy when they've got their feet firmly planted on the ground. Cat Quest 3 (PS5, PS4)The Cat Quest games are delightful adventures full of terrific puns, and Cat Quest 3 doesn't disappoint. An open-world action-RPG set in a fantastical pirate-themed world known as the Purribean, the threequel sees players search for a long-lost mythical treasure and battle Pi-rats on the high seas. The game is also playable in solo or co-op modes.Lego Horizon Adventures (PS5)We've seen Aloy's debut adventure on PS4 and remastered for PS5, but the Lego version puts a lighthearted spin on a familiar tale. Set in a world where humanity is no longer at the top of the food chain following a robot uprising, Lego Horizon Adventures follows Aloy as she sets out to prove herself and discover the lost secrets of the planet. You can hunt machines as Aloy, or you can play as her allies Varl, Teersa, and Erend in this colorful Lego game. Paw Patrol: Grand Prix (PS5, PS4)For the younger members of the family, you can boot up not one but two Paw Patrol games for them. The first one is a kart-racer featuring the gang, as they compete to win the Pup Cup. Paw Patrol World (PS5, PS4)The second Paw Patrol game is an action-adventure where you can play as the pups. Just like the animated series, you can drive their signature vehicles, engage in rescue missions, and explore Adventure Bay to help out citizens in need. Soulcalibur 3 (PS5, PS4)PlayStation Plus Premium subscription requiredThe timeless tale of swords and souls is back, as Soulcalibur 3 joins the classics library this month. Originally released in 2005 for PS2, Soulcalibur 3 on PS5 and PS4 has been upgraded with enhanced visuals, quick-save and rewind functionality, and custom video filters.     \n  \n                      "
  },
  {
    "title": "Fallout Gets You In The Festive Spirit Before Season 2 Drops Next Week",
    "url": "https://www.gamespot.com/articles/fallout-gets-you-in-the-festive-spirit-before-season-2-drops-next-week/1100-6536843/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1813/18138562/4620614-fallouts2.jpg",
    "tag": "Gaming",
    "date": "2025-12-10T18:05:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Come gather around The Ghoul...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Come gather around The Ghoul Log, a festive video that the Fallout TV show has created in the lead-up to Season 2. Starting with The Ghoul (Walton Goggins), this holiday special features Dogmeat and shows a human arm--\"specifically, a fat man's\"--burning in a fireplace for roughly an hour and a half.On YouTube, Prime Video released the officially titled Fallout: The Ghoul Log, which can be seen below. The Ghoul makes a couple of revelations about the wasteland early on. First up, he says, \"Well, this ain't no Whoville,\" implying The Grinch is part of that universe. Funnily enough, Goggins portrays The Grinch in a Walmart ad campaign this holiday season. And sadly, The Ghoul notes that Santa Claus doesn't exist in the wasteland.          Regardless, the video can help fill in the time until Fallout Season 2 premieres next week on December 18. Prime Video will drop episodes weekly through February--a major shift for Fallout. The first season saw all episodes arrive at once on the streaming platform. Speaking of that, you can watch Season 1 for free on Samsung TV PlusLooking ahead, Lucy (Ella Purnell) will continue to have her poop finger in Fallout Season 2. In addition, the creative team behind the TV series are planning to start shooting Fallout Season 3 in Summer 2026. The hope is to get the show back on the air as quickly as possible.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]