[
  {
    "title": "Here's This Week's Free Game From The Epic Games Store On Mobile",
    "url": "https://www.gamespot.com/articles/free-games-epic-games-store-mobile/1100-6530257/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4462498-egs-mobile.jpg",
    "tag": "Gaming",
    "date": "2025-11-27T16:47:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          For the last couple of years,...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                For the last couple of years, the Epic Games Store has given away free games every week through its PC storefront. With the company having launched its own mobile store, it has also started a second free games program on iOS and Android devices, kicking things off with a curated library of titles and weekly freebies. The app also features mobile versions of Fortnite, Fall Guys, and Rocket League Sideswipe.To access these games you will need to create a free Epic account and install the free Epic Games Store mobile app and log in with your account, but once you do, you can start claiming your free games every Thursday through it. One other thing to note is that Android users can access the app via Android-based emulation devices like Retroid Pocket, as they aren't limited to just smartphone and tablets.For now, only iOS users in the European Union can install the app, but the app is available worldwide to Android device users and they have a wider selection of games to choose from in comparison. Like its PC counterpart, you'll have one week to grab each game that's offered. Here's a closer look at what you can grab this week, and what the current mobile games library has to offer. You can also explore what the free PC games are this week on the Epic Games Store.Current free game on the Epic Games Store Mobile AppUniverse For SaleThis week, you can get Universe For Sale, a narrative adventure game revolving around a woman who can craft entire universes within the palms of her hands. Set on an outer space colony, you'll get to explore odd shops and meet weird inhabitants as you work toward uncovering a mystery that lies at the heart of this game.Epic Games Store Mobile LibraryCurrently, there's a solid selection of games that require quick reflexes and a knack for solving puzzles. Bridge Constructor: The Walking Dead combines the spatial problem-solving appeal of the Bridge Constructor series with zombies, Chicken Police: Paint the Town Red is a wonderfully weird noir-detective story featuring anthropomorphic animals, and Endling: Extinction is Forever is a heartbreaking tale about surviving the end of the world.Here's the full list of what you can access right now from this library:iOS and AndroidSuper Space ClubLoop HeroChuchelMr Racer: PremiumThe Forest QuartetThe WereCleanerAndroidBowling ClashEndling: Extinction is ForeverChicken Police: Paint it RedOne Hand ClappingNeighbours Back From HellThis is The PoliceThis is The Police 2This Is The PresidentThrough the Darkest of Times\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "How To Make Grow A Garden Salad",
    "url": "https://www.gamespot.com/articles/grow-a-garden-salad/1100-6536152/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1861/18616975/4601154-grow-a-garden-salad.jpg",
    "tag": "Gaming",
    "date": "2025-11-27T14:06:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          The Grow A Garden cooking event...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                The Grow A Garden cooking event has long since passed, and as such, it’s actually quite difficult to work out what the proper recipe is to make a salad. That is because some unexplained mechanics may be the cause of your culinary endeavors going awry. If you’ve come across recipes recently to make salads and not had any success, then fear not, as we’ll explain what’s going on here.Of course, to make these salads, you’re going to need to cultivate specific Grow A Garden seeds and harvest their fruit. These food items, as explained in our Grow A Garden Beginner’s Guide, are handy for leveling up your friendship with the shopkeepers, getting exclusive items in return. You’ll want to exploit Grow A Garden mutations to get the most friendship points possible from your creations. Below is everything you need to know about getting a cooking pot and making a salad in Grow A Garden.You can make recipes with Cooking Pots to make food that you can give to pets or NPCs.How to get a cooking pot in Grow A GardenThere are two ways to get a cooking pot in Grow A Garden. The easiest way is to save up 1,000,000 Sheckles and buy it from the Cosmetics shop when available. However, there’s a far cheaper way to get this item by completing all the Common Achievements track in the guidebook. This requires you to complete five tasks:Shovel 100 plantsHarvest 200 carrotsGift 1 carrotSell 500 strawberriesGift 5 strawberriesNone of these are difficult to finish, as the gifting tasks need you to hold the item and interact with a player to gift the plant to them. As for the shoveling plants, just buy 100 carrots as they’re the cheapest plant. Selling 500 strawberries might take a while, but it’s easily doable if you have a bunch of plants growing this common fruit at once.Recipes are displayed in the Guide Book with a Grow A Garden salad recipesA lot of changes have happened since the cooking-based Grow A Garden event a few months ago, and this includes many of the old recipes from those weeks no longer working. Instead, the salad recipe comprises a handful of components that you need to fill with each fruit. Those components can’t be the same for both sides, so two tomatoes will not make a salad; they instead make a smoothie. The recipe that worked for us was taking a Bamboo and a Pepper and putting them in the cooking pot to make a salad.The other thing is that, once you discover the recipe, it’ll appear in your in-game guidebook. However, the ingredients it lists will be ones you’ve got in your garden or have grown in the past. That means that there are likely plenty more out there not on this list. The recipes in the book are also guidelines rather than actual recipes, as combining Bamboo and Corn also makes a Smoothie in our time of testing. This is possibly because Corn counts as a fruit. Our suggestion is to add the components in the order displayed (Leafy, then Vegetable).Here are all the Grow A Garden salad ingredients we know of so far:LeafyVegetableTomatoBambooPineappleGreat PumpkinEvo Beetroot IIIRomanescoMandrakePumpkinPepperBroccoliEvo Pumpkin IIICornEvo Beetroot IIEvo Pumpkin IEvo Pumpkin IIBeanstalkJack O LanternEmerald BudParsleyTurnipEvo Beetroot IVCarnival PumpkinTomatoCarrotEvo Beetroot I\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Sonic Racing: CrossWorlds Steeply Discounted, Comes With $10 Amazon Credit",
    "url": "https://www.gamespot.com/articles/sonic-racing-crossworlds-steeply-discounted-comes-with-10-amazon-credit/1100-6536095/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1701/17013431/4610862-soniccrossworlds.jpg",
    "tag": "Gaming",
    "date": "2025-11-28T03:26:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               Amazon's Black Friday deal on Sonic Racing: CrossWorlds is even better now than earlier in the week. The Amazon Exclusive Edition, which includes a free double-sided poster inside the box, is on sale for $40 on Switch, PS5, and Xbox Series X. Amazon's original deal discounted the new Segao arcade racer to $45, but the new offer has an additional bonus: a free $10 Amazon Credit. Just head to this page and add a physical edition to your cart to activate the promotion. Alternatively, you can click the promotion on the game's store page or enter promo code SONIC10 at checkout.Amazon Exclusive Edition + $10 Credit:PS5 -- $40 ($70)Xbox -- $40 ($70)Switch -- $40 ($60)Amazon's offer is likely in response to Walmart's Black Friday deal, which drops the price of Sonic Racing: CrossWorlds to only $30 for any platform. If you'd rather get the outright discount $30-$40 discount, you should hurry, as Walmart is running low on copies.Standard Edition Deal at Walmart:PS5 -- $30 ($70)Xbox -- $30 ($70)Switch -- $30 ($60)                                 Sonic Racing: CrossWorlds - Amazon Exclusive Edition                                                                $40 (was $70) | Free $10 Amazon Credit                                                                                                                                                                                    Sonic Racing: CrossWorlds features 24 tracks, 23 playable characters, and 45 customizable vehicles to try out. The roster features familiar faces from previous Sonic the Hedgehog games, as well as guest racers from other franchises like Mega Man, SpongeBob, Like A Dragon, Persona, Minecraft, and more. The game features full single-player modes, local split-screen support, and online modes for up to 12 players.The Sonic Racing: CrossWorld Amazon Exclusive Edition includes the full base game on your platform of choice, plus an exclusive fold-out poster featuring Sonic, Tails, Shadow, Knuckles, and other familiar faces as they cruise through a variety of worlds.Amazon Exclusive Edition + $10 Credit:PS5 -- $40 ($70)Xbox -- $40 ($70)Switch -- $40 ($60)Standard Edition Deal at Walmart:PS5 -- $30 ($70)Xbox -- $30 ($70)Switch -- $30 ($60)                      Sonic Racing: CrossWorlds Amazon Exclusive EditionSonic the Hedgehog Nintendo Switch DealsCheck out the list below for more Sonic deals, including Sonic X Generations for only $15 on Switch, PS5, and Xbox at Walmart. Nintendo Switch 2 users can grab Sonic X Generations for $25 at Amazon. You can also pick up the old Sonic Racing game in a bundle with Sonic Mania for only $20.Sonic X Shadow Generations -- $15 ($50)Sonic X Shadow Generations (Switch 2) -- $25 ($50)Sonic Mania + Team Sonic Racing Double Pack -- $20 ($40)Sonic Forces -- $14 ($20)Sonic Frontiers -- $20 ($40)Sonic Origins Plus -- $20 ($40)Sonic Superstars -- $20 ($30)Sonic Racing: CrossWorlds -- $30 ($60)Sonic Racing: CrossWorlds (Amazon Exclusive) -- $40 ($60)  With Free $10 Amazon CreditFor the latest Black Friday deals, be sure to check GameSpot's Black Friday Deals Hub.                                                                                                                                               Sign up for GameSpot's Weekly Deals Newsletter:                                Lexar Play Pro 1TB MicroSD Express For Switch 2 Gets Black Friday Discount                         DualSense Limited Edition PS5 Controllers On Sale For Black Friday                         Check Out Over 200 Nintendo Switch Game Deals For Black Friday                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Eight Nintendo Switch Exclusives Are 50% Off In Walmart's Black Friday Sale                         The First PS5 Pro Deal In Six Months Is Up For Grabs For A Limited Time                         Ghost Of Yotei PS5 Slim Bundles And Collector's Edition Get Huge Discounts                         Save Big On 8BitDo's Stellar Ultimate 2 Controllers In Amazon's Black Friday Sale                         Evercade Retro Handhelds & Cartridges Get Rare Price Cuts In Amazon's Black Friday Sale    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n        \n\t\n\t\tLatest in\n\t\tSonic Racing: CrossWorlds\n\t\n\n\n            \n    "
  }
]