[
  {
    "title": "Nex Playground Boss Says The Console Solves The Wii \"Problem\"",
    "url": "https://www.gamespot.com/articles/nex-playground-boss-says-the-console-solves-the-wii-problem/1100-6537124/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4626328-nex.jpg",
    "tag": "Gaming",
    "date": "2025-12-20T02:05:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          While Sony and Nintendo have...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                While Sony and Nintendo have expanded their lead over Xbox, a dark horse console had a very strong showing in third place in November. The Nex Playground has emerged as a breakout hit, and CEO David Lee believes that one of the reasons why its been so successful is because the console has solved the Wii \"problem.\"Nearly two decades ago, the Wii powered Nintendo's post-GameCube comeback with its motion controls and unique games. Lee argues that the scope of Wii's success made it difficult to sustain in the long term. Instead of trying to sell games like Wii, Nex Playground is offering its titles as part of a subscription service.\"One of the most important things we should do is learn from history and try not to commit the same limitations, and that's why we have a subscription model,\" Lee told The Game Business. \"Nintendo expanded the audience with Wii. When you expand the audience, and they want different things, and they only buy Wii Fit, Wii Sports and not many others … that's a bit of a problem.\"Lee was very complementary toward Nintendo in his follow-up remarks, but he added that the Wii's model of selling only a few games to certain members of its install base was \"not sustainable.\"\"It's very important that we set ourselves up to serve our customer continuously with new innovations,\" added Lee. \"That is how the whole system can sustain. But it started with Wii. We are standing on a giant’s shoulder.\"Nex Playground reportedly accounted for 14% of all console sales on Black Friday, finishing ahead of the Xbox family of systems.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "This Magnetic Puzzle Is A Perfect Last-Minute Stocking Stuffer",
    "url": "https://www.gamespot.com/articles/tosy-magnetic-pyramid-toy-stocking-stuffer-on-sale-for-a-limited-time/1100-6537057/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1864/18647298/4624936-screenshot2025-12-17132740.png",
    "tag": "Gaming",
    "date": "2025-12-19T23:47:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               It's down to the wire, and if you're looking to do some last-minute holiday shopping, we've got a great option for you. For a limited time, TOSY's wildly popular Magnet Pyramid Stone is on sale for just $22.76 (was $30) on Amazon, and is a perfect stocking stuffer to pick up if you're cutting it close with your gift-getting this year. You can create a seemingly endless number of shapes with it (the brand claims \"one billion\" of them), making it an effective and creative fidget toy for both kids and adults. But if you plan to pick one up, do it soon--these are popular on Amazon even at full price, and we expect this limited-time discount will only make them more in-demand.                                 TOSY Magnet Pyramid Stone                                                                $22.76 (was $30)                                                                                                                                                                                    The TOSY Magnet Pyramid Stone is a unique STEM and fidget toy that allows you to let your creativity run wild. With it, you can create a vast number of shapes, all while stimulating your brain and calming your anxieties. The Pyramid Stone even comes with a spinning base so you can show off your favorite creations. The toy is extremely popular on Amazon, and it's currently sitting at a limited-time discount of just $22.76 (down from $30). It's the perfect size (and price) for a stocking stuffer gift, so get one on sale while you still can.                      TOSY also makes a bunch of other great stocking-stuffer-type gifts, from fidget spinners to magnetic puzzle cubes. If the pyramid isn't doing it for you (or you just want more than one gift), maybe one of these other options will. Don't worry, they're also on sale--but only for a limited time:TOSY Magnet Fidget Spinner Glow -- $19 ($24)TOSY Magnet Cube (2x2) -- $8.49 ($10)TOSY Magnet Cube (3x3) -- $29 ($37)TOSY Magnet Cube (4x4) -- $58 ($73)And if you're looking for even more ideas, you should check out Shashibo, another popular brand on Amazon that sells puzzles and fidget toys. The brand's Shape Shifting Box is on a limited-time sale for just $18.19 (was $28), and comes in a bunch of fun themes like SpongeBob, Hello Kitty, Avatar, and more. We have even more in-depth coverage of those Shashibo puzzle boxes here.Sign up for GameSpot's Weekly Deals Newsletter:                                Arcade1Up Classic Special Edition Mortal Kombat Cabinet Gets First Discount                         Nintendo Switch 2 Samsung 256GB MicroSD Express Card On Sale For Only $33                         Target's Best Exclusive Lego Sets Get Rare Holiday Discounts                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Xbox Elite Series 2 Controllers On Sale For Even Better Prices Than Black Friday Deals                         Final Fantasy I-VI Pixel Remaster Collection Is Back On Sale For Black Friday Price                         Nintendo Switch 2 Racing Wheel Set Drops To $20 For A Limited Time                         ROG Xbox Ally Gaming Handheld Is On Sale For Only $489 For A Limited Time                         Super Mario Galaxy: Rosalina's Storybook Gets 30% Price Cut At Amazon    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n\n            \n    "
  },
  {
    "title": "All The Stranger Things Tabletop Games And Jigsaw Puzzles Available Ahead Of The Series Finale",
    "url": "https://www.gamespot.com/gallery/stranger-things-board-card-game-puzzle-roundup-gallery/2900-7351/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1702/17023653/4622946-image%2817%29-overlay.jpg",
    "tag": "Gaming",
    "date": "2025-12-19T22:58:00.000Z",
    "description": "By     Brendan Hesse   and     Jon Bitner   on December 19, 2025 at 2:58PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this...",
    "body": "\n                            \nBy \n    Brendan Hesse\n   and \n    Jon Bitner\n   on December 19, 2025 at 2:58PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Stranger Things is wrapping up later this year, but you can keep the mystery alive with a bunch of cool tabletop games and puzzles based on Netflix's hit series. This includes everything from standard jigsaw puzzles and playing card sets to tabletop games like the Stranger Things X Dungeons & Dragons: Welcome To Hellfire Club set and the Upside Down Board Game. The most recent release is the new Stranger Things: The Shadows of Hawkins Edition of the popular Profiler detective board game. There are quite a few options out there, so to make it easier to find them all, we've compiled all the Stranger Things board games, card games, and puzzles into the gallery below. As you'd expect, some of these are proving to be quite popular ahead of Season Five's conclusion. We've seen several of the games and puzzles linked below go in and out of stock--so if one of your favorites is gone, be sure to check back for restocks. Stranger Things Season Five's second batch of episodes hit Netflix on December 25, followed by the series finale on December 31.Profiler: Stranger Things - The Shadows of Hawkins$25Up to six players can enjoy this cooperative game, as they comb through dozens of documents and investigate the bizarre happenings around the town of Hawkins. You'll need internet access for some of its puzzles--allowing you to access various files and even an old Walkman--though even folks unfamiliar with the series can help unravel this strange mystery.Stranger Things Playing Cards Gift Set (Collectible Tin Box)$9Your standard deck of cards gets a Stranger Things makeover with this fun set. The officially licensed set also comes with a collectible store tin, giving you a cool place to stash your cards when they're not in use.Stranger Things Premium Playing Cards$13Another set of playing cards, this time with a higher quality finish and more premium materials. Featuring holographic red and silver foils, these high-end cards are a nice alternative to the gift set above.Top Trumps: Stranger Things$10Top Trumps is a simple card game that has you battling to collect all the cards in the deck. This rendition gets you cards featuring iconic characters from the show, including Eleven, Hopper, Mike, and even the Mind Flayer.Top Trumps: Stranger Things Quiz$10.88 (was $15)Think you're a Stranger Things expert? Test yourself with this quiz, featuring 500 questions and a nifty storage container.Top Trumps: Stranger Things Collector's Tin$19Pick up some Top Trumps cards along with a unique collector's tin. The tin is the big selling point here--featuring a Hawkins High School design, it's a cool bit of memorabilia for your home theater.Stranger Things: Upside Down Board Game$50Save Hawkins from a series of supernatural threats in this cooperative board game. It features events from the first two seasons, comes with 11 miniatures (including the Demogorgon and Eleven), and each match runs for about an hour.Stranger Things: Attack of the Mind Flayer$25The Mind Flayer is taking over Hawkins, and it's unclear who is under its control. This bluffing game sees \"Sane\" characters battling against \"Possessed\" characters, but the other players don't know which team you belong to. That means you'll have to bluff your way to success, while trying to determine who you can trust along the way.Stranger Things: Welcome to The Hellfire Club - D&D Adventure$43 (was $50)Play through the last campaign of Eddie Munson. You'll get to go on four adventures that have you fighting Demogorgons and Demodogs, and the set includes everything you need to get started--such as retro cards, character sheets, dice, and a DM's screen.Demogorgon Jigsaw Puzzle (200 pieces)$13Put together a stylized image of a Demogorgon tangled in festive holiday lights. The finished puzzle is 21.25 x 15 inches, and you'll get a full-color poster as a bonus.The Nina Project Jigsaw Puzzle (1,000 pieces)$16Looking for a big project to work on? Check out this colorful 1,000-piece jigsaw puzzle, which features Eleven as part of the Nina Project. The completed puzzle is 26.75 x 19.75 inches, and you'll get a reference poster to help you along the way.Missing Friends Jigsaw Puzzle (1,000 pieces)$16Put together an iconic scene of the Stranger Things kids as they bike through the eerie streets of Hawkins. It's a big undertaking at 1,000 pieces, though no doubt it's one of the coolest designs up for grabs. Includes a reference poster and the finished project clocks in at 26.75 x 19.75 inches.See You On The Other Side (1,000 pieces)$27.24 (was $30)Put together a cool panorama of various Stranger Things scenes. The main cast is shown off across the seasons here, making it a fun way to commemorate the finale on New Year's Eve.Stranger Things Jigsaw Puzzle (1,000 pieces)$22.46 (was $25)Featuring a unique black, white, and red design, this 1,000-piece puzzle looks much different than the ones above. It adapts the artwork from the premium playing cards into a puzzle, though it keeps some of the holographic elements for a truly eye-catching design.Lite Brite: Stranger Things Edition$17.49 (was $20)We're not sure if it'll allow you to communicate with the Upside Down, but you can definitely use it to build some cool, colorful designs. This version includes templates inspired by the show, such as the Hellfire Club Demon, Demodog, and Eddie's Guitar.    \n  \n                      "
  }
]