[
  {
    "title": "Why Halo 1 Remake Has No Multiplayer",
    "url": "https://www.gamespot.com/articles/why-halo-1-remake-has-no-multiplayer/1100-6535707/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4590559-screenshot2025-10-24at4.35.05%E2%80%AFpm.png",
    "tag": "Gaming",
    "date": "2025-10-27T11:57:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          The newly announced Halo 1...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                The newly announced Halo 1 remake that brings the series to PlayStation for the first time has no multiplayer support. It is a campaign-only experience. Why is that?Executive producer Damon Conn addressed this in a post on Xbox Wire. \"Focusing on the campaign experience means we can concentrate fully on really capturing the atmosphere, tone--the emotional impact of what made the first campaign so special and iconic,\" Conn said.While there is no multiplayer in the new Halo: Campaign Evolved, the game delivers some extras that weren't in the original 2001 release, including three new prequel missions and the ability to sprint. The game was made in Unreal Engine 5 and is likely to be followed by a brand-new Halo live-service game.           \"We wanted to start where it all began, with the original campaign that defined Halo,\" Conn said. \"Starting here means people that have never played the game before will be able to understand the story from the very beginning, and that can help us chart a course forward with new Halo stories.\"Conn elaborated further in an roundtable interview attended by Windows Central. Conn said it was never the goal to \"replace what is a masterpiece in the original.\" \"We're trying to basically make something that stands kind of shoulder to shoulder with it, using new tools, new energy, to get a little bit of a fresh take on some things, but honoring the legacy,\" Conn explained. \"So, yes, it's a campaign experience, but it's not only a single-player experience. And Halo has been always about reconnecting, a strong sense of community, and then also telling those stories and sharing those experiences together. And we believe that is where, you know, we're really going to be able to bring people together with this new release.\"For more, be sure to watch the trailer above to see the new Halo: Campaign Evolved in action. The game launches in 2026 for PS5, Xbox Series X|S, and PC. Pricing has not been announced, nor has a specific release date.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "New C64 Mini Limited Edition Includes 25 Modern Commodore Games",
    "url": "https://www.gamespot.com/articles/the-c64-mini-black-edition-retro-computer-system-amazon-exclusive/1100-6535708/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4590575-commodore64minithumbnail.png",
    "tag": "Gaming",
    "date": "2025-10-25T04:15:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               Retro Games Limited just launched a new version of its miniature Commodore 64 home computer. The C64 Mini - Black Edition is a limited release that celebrates the talented developers who create modern Commodore games. The Black Edition comes preloaded with The C64 Mini's original 64-game lineup and 25 modern titles, including all-time C64 greats like Sam's Journey and A Pig Quest.The C64 Mini - Black Edition retails for $120 and is exclusive to Amazon in the United States. Amazon is \"temporarily out of stock\" on launch day (October 24), but you can still place an order. The original C64 Mini launched in 2018 with a $70 MSRP--you can grab one today from Amazon for only $51. The substantial price hike is probably partially tied to economic changes and tariffs, but the inclusion of the modern games likely played a much larger role.The vast majority of the new games--19 to be exact--are sold on itch.io by big Commodore 64 publishers, including Psytronik and Protovision. Psytronik's games are usually five bucks or less, but titles published by Protovision tend to carry higher price tags. There are four preloaded Protovision games that would normally cost around $55 combined: Sam's Journey ($24), A Pig Quest ($11.61), MW Ultra ($11), and Yeti Mountain ($9). These are among the most ambitious C64 games around. For instance, developer Knights of Bytes created over 2,000 screens for Sam's Journey's 30 extremely long levels. It's one of the best retro platformers I've ever played (it's also available on NES). In short: The $50 price increase seems more than reasonable.                                 The C64 Mini - Black Edition (89 Games)                                                                $120 | Available Now                                                                                                                                                                                    The Black Edition comes with the same items as the original: The C64 Mini computer, a classic USB joystick, USB power cable, HDMI cable, and instruction manual. Like numerous other mini consoles, it doesn't come with an AC adapter, but basically any USB brick will work. Or you can just power it through one of the USB ports on your TV.The C64 Mini is approximately half the size of the original Commodore 64 computer. The \"keyboard\" is decorative--none of the mini home computers have functioning keyboards. But if you want to use the BASIC interpreter to write your own programs and/or boot games you add to The C64 Mini via USB stick, you can plug just about any keyboard into the second USB port. You can also connect a second joystick for multiplayer. A solid, budget-friendly option is the Hyperkin Trooper for around $18.The C64 Mini displays games in 720p resolution in pixel perfect or original 4:3 aspect ratios. You can add scanlines (CRT filter) if you want to replicate the classic look. All preloaded games have four save slots, and you can save your progress at any point.Here's the full list of modern Commodore 64 games included on The C64 Mini - Black Edition out of the box. The prices next to each title are what you'd pay on itch.io. Games without prices are available to download for free. As a reminder, these are just the new games; the Black Edition still comes with the original 64 games. 25 New Games:A Pig Quest ($11.61)Caren and the Tangled Tentacles (~$80, Physical)Galencia ($5)Good Kniight ($4)Grid Pix ($2)Guns 'N' Ghosts ($3)Hessian ($2)Hunter's Moon Remastered ($5)It's Magic 2 ($2.22)Joe Gunn: Gold EditionMetal Warrior Ultra ($11)Millie & Molly ($2)Nixy and the Seeds of DoomOoze: The Escapep0 SnakePains 'N' Aches ($5)Planet Golf (~$43, Physical)Rocky Memphis: The Legend of Atlantis ($5)Runn 'N' Gunn ($2)Sam's Journey ($24)Shadow SwitcherSpinning ImageSteel Ranger ($5)Yeti Mountain ($9)You can find plenty of other modern C64 homebrew on itch.io. If you buy a ROM from itch.io or another site, you can load it on The C64 Mini via USB.Check out the original C64 Mini below to see the list of classic '80s games.                                                       The C64 Mini - Original Edition (64 Games)                                                                $51 (was $70)                                                                                                                                                                                    The C64 Mini and The C64 Mini - Black Edition have the following preloaded games from the '80s.AlleykatAnarchyArmalyte - Competition EditionAvengerBattle ValleyBoulder DashBounderCalifornia GamesChip's ChallengeConfusionCosmic CausewayCreaturesCyberdyne WarriorCybernoid: The Fighting MachineCybernoid II: The RevengeDeflektorEveryone's a WallyFirelordGribbly's Day OutHawkeyeHeartlandHerobotixHighway EncounterHunter's MoonHysteriaImpossible MissionImpossible Mission IIIOJumpmanMega ApocalypseMission A.D.Monty MoleMonty on the RunNebulusNetherworldNobby the AardvarkNodes of YesodParadroidPitstop IIRanaramaRobin of the WoodRubiconSkate CrazySkool DazeSnareSpeedballSpeedball 2 - Brutal DeluxeSpindizzyStar PawsSteelStreet Sports BaseballSummer Games IISuper CycleTemple of Apshai TriologyThe Arc of YesodThing Bounces BackThing on a SpringTrailblazerUchi MataUridiumWho Dares Wins IIWinter GamesWorld GamesZynaps                                                       8BitDo Retro Mechanical Keyboard: C64 Edition                                                                $93.49 (was $110)                                                                                                                                                                                    As mentioned, any USB keyboard should work with The C64 Mini, but it's worth shouting out the awesome 8BitDo Retro Mechanical Keyboard: C64 Edition. The Commodore-inspired keyboard comes with detachable Super Buttons and a detachable arcade stick. This is a wireless keyboard with 2.4GHz and Bluetooth support for PC, Mac, SteamOS, Android, and iOS. That said, you can use it as a wired keyboard by connecting the included USB cable.The C64 Edition 8BitDo Keyboard is discounted to $93.49 (was $110). If this deal disappears, there's another listing for $95.8BitDo also makes keyboards themed around other classic gaming platforms, including NES, Famicom, and the original Xbox. The transparent green Xbox-inspired model is officially licensed by Microsoft and is on sale for $92.40 (was $120) at Amazon. The NES-inspired edition is only $80 (was $100). Check out the list below for more deals:8BitDo Xbox Edition TKL -- $92.40 ($120)  $65 at Woot8BitDo N Edition TKL -- $80 ($100)8BitDo N Edition Full-Size -- $92 ($120)8BitDo Fami Edition Full-Size -- $108 ($120)8BitDo C64 Edition TKL -- $93.49 ($110)8BitDo M Edition TKL -- $85 ($100)8BitDo N Edition TKL + Super Stick -- $80 ($100)8BitDo Mecha Break TKL -- $79.19 ($120)                                                       The Atari 400 Mini                                                                $120                                                                                                                                                                                    Retro Games Limited has manufactured numerous mini retro computers in addition to The C64 Mini. The other one that you can buy in the United States for its MSRP is The 400 Mini. It plays all Atari 8-bit games, including titles for the 400, 130XE, 800XL, and other home computers. It also plays Atari 5200 console games.                      Sign up for GameSpot's Weekly Deals Newsletter:                                Adorable New Astro Bot Collectibles Are Waiting To Be Rescued By You                         Amazon Has Tons Of Horror Movie Box Sets For Low Prices In Halloween Sale                         Lego's New Spider-Man And Iron Man Busts Get Limited-Timed Discounts                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Joe Hill's Massive New Horror-Fantasy Novel Arrives Just In Time For Halloween                         Icon Blue Limited Edition DualSense PS5 Controller Is Available Now                         Lego Technic McLaren F1 Race Car Retires Soon, Save $72 At Amazon Before It's Gone                         Pokemon TCG Amazon-Exclusive Holiday Premium Collection Is Back In Stock                         Get 10 Shudder Original Horror Movies On Blu-Ray For Only $51    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n\n            \n    "
  },
  {
    "title": "The H.P. Lovecraft Experience Deluxe Box Set Gets 33% Discount Ahead Of Halloween",
    "url": "https://www.gamespot.com/articles/best-hp-lovecraft-collector-book-box-set-2025-amazon-deal/1100-6533598/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4590992-hplovecraftdeluxeexperienceboxset.png",
    "tag": "Gaming",
    "date": "2025-10-26T22:43:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               The H.P. Lovecraft Experience Deluxe Box Set is on sale for its best price yet at Amazon ahead of Halloween. Released in August with a $100 MSRP, this stunning collector's edition of Lovecraft's complete writings is up for grabs for only $66.74. What sets this two-volume collection apart from the many other editions of Lovecraft's stories is the presentation and the team behind it. The experts at The H.P. Lovecraft Historical Society worked with publisher Weldon Owen--an imprint of Insight Editions--to craft the comprehensive Lovecraft reading experience. The H.P. Lovecraft Experience Deluxe Box SetGallery                                                                                                In addition to all of Lovecraft's fiction, poetry, and other writings, The H.P. Lovecraft Experience comes with a new reader's guide and a bunch of collectibles that big fans are sure to enjoy. It would make for a wonderful gift this holiday season for the book collector and horror fan in your life. But if you still don't want to spend quite this much on a Lovecraft collection, check out this custom Amazon store hub we created with roughly a dozen Lovecraft box sets and collector's editions.                                 The H.P. Lovecraft Experience Deluxe Box Set (Hardcover)                                                                $66.74 (was $100)                                                                                                                                                                                    This is almost certainly the most stunning Lovecraft collection you can find at a major retailer or bookstore.The 1,188-page collection is spread across two striking, dark green volumes hardbound in leatherette to resemble high-quality books from Lovecraft's time. The cover and spines have foil-stamped insignias and lettering.The H.P. Lovecraft Experience includes all of the author's work, so this is a one-stop shop for his novels, novellas, short stories, and other writings.The two books and related collectibles are packaged inside a sculpted display case featuring a new 3D depiction of Cthulhu. When we say 3D, we mean that Cthulhu rises from the surface of the case, which makes the cosmic entity more terrifying than it already is.The H.P. Lovecraft Historical Society created a brand-new Reader's Guide that examines 10 of Lovecraft's short stories. The guidebook was written by Sean Branney and Andrew Leman, the co-founders of the Lovecraft Historical Society, and should be an interesting read for newcomers and experienced readers alike. The Reader's Guide matches the look of the two main volumes, but it's sized like notebook. This format aligns with the overarching theme of the collectibles you'll find in box.All of the supplements are tied to Miskatonic University, a fictional Massachusetts college that plays a major role in many of Lovecraft's stories, including all of his work related to the Cthulhu.Big Lovecraft fans will probably want to frame their diploma from Miskatonic University that's included here--but only after you follow The Undergraduate Course Book, presented as a small booklet. Other Miskatonic-themed collectibles you'll find in the box include a bookmark, a library card, a patch, and a decal.The H.P. Lovecraft Experience is also available as a Kindle ebook for $20. Obviously, you'll miss out on the collectibles and premium presentation, but you'll still get both volumes and the Reader's Guide. Note: The \"paperback edition\" on Amazon's store page is not the real H.P. Lovecraft Experience. It was self-published by someone who wanted to game the system. Don't buy it.                      More Lovecraft Box Sets & CollectionsSince most of Lovecraft's work is in the public domain, you can read many of his horror stories for free online. You'll also find a dizzying number of Lovecraft collections on Amazon. But keep in mind that Lovecraft being in the public domain means that there's a near-endless supply of terribly designed editions created by random people with no publishing experience. It's even worse these days, because Amazon is flooded with AI-generated books \"created\" by scammers.The H.P. Lovecraft Experience is one of the rare physical editions of the author's complete writings that actually looks nice. That said, there are some great, lower-priced Lovecraft collections that, while not comprehensive, come with his full catalog of short stories and/or his biggest hits.                                                                                                                                               A few of the best budget-friendly Lovecraft box sets and collector's editions are made by Arcturus Publishing. We've rounded up the highlights below.                                                                                                      The H.P. Lovecraft Collection: 6-Book Clothbound Box Set                                                                $35.45 (was $60)                                                                                                                                                                                    The H.P. Lovecraft Collection: 6-Book Deluxe Box Set includes clothbound, hardcover editions of six of the author's best-known works in a display box. The artwork and cover designs aren't super exciting, but the books themselves are well-made. It's on sale for $35.45 (was $60). Here's the list of books included in the box set:At the Mountains of MadnessThe Dunwich HorrorThe Call of CthulhuThe Shadow over InnsmouthPolarisThe Color Out of SpaceRats in the WallsArcturus also published The Necronomicon 5-Book Box Set. This paperback set isn't a collector's edition, but it's only $23 (was $40) and includes over 70 stories by Lovecraft and four other writers of cosmic horror set within the wider Cthulhu Mythos.                                                                                                                            The Classic H.P. Lovecraft Collection                                                                $25 | Collectible Hardcover Edition                                                                                                                                                                                    The Classic H.P. Lovecraft Collection is a new 928-page hardcover compiling 71 stories. Cthulhu is depicted on a cosmic-inspired cover. Along with eye-catching silver accents on the front and back covers, this collection has illustrated page edges and endpapers.Unlike The H.P. Lovecraft Experience, this isn't a complete collection, but it's only $25. The Classic H.P. Lovecraft Collection wasn't supposed to arrive in the United States until November 4, but Amazon's store page lists it as shipping now.Note: Canterbury Classics published a similar, 768-page Lovecraft collection in its Leatherbound Classics catalog in August. You can get H.P. Lovecraft Tales of Horror for $26.36 (was $30).                                                                                                                            The Call of Cthulhu & Other Tales of Cosmic Terror                                                                $23.24 (was $25) | Collectible Hardcover Edition                                                                                                                                                                                    The Call of Cthulhu joined the Arcturus Gilded Classics catalog last October. This is a smaller, 304-page hardcover--and there is some overlap with the new collection--but it's a beautiful and budget-friendly display piece for Lovecraft fans. It has stenciled edges and illustrated endpapers, both of which depict Cthulhu's many tentacles.In addition to The Call of Cthulhu, this collection comes with The Dunwich Horror, The Whisperer in Darkness, At the Mountains of Madness, The Shadow Over Innsmouth, and The Haunter of the Dark.                         We'd also recommend the Barnes & Noble Collectible Edition of Lovecraft's Complete Fiction for $27 (was $30). This beautiful hardcover edition has a bonded-leather binding, illustrated endpapers, and a ribbon bookmark. Barnes & Noble also has a Collectible Edition of The Complete Cthulhu Mythos Tales for $30.If you don't care about fancy design features, check out The Complete Fiction of H.P. Lovecraft for $14.17 or The Complete Tales of H.P. Lovecraft for $14.70. Both books are 1,112 pages and collect all of Lovecraft's fiction in a single hardcover.H.P. Lovecraft Manga AdaptationsH.P. Lovecraft manga adaptations by Gou Tanabe (Dark Horse Manga)Lovecraft fans and horror manga readers in general should definitely check out the manga adaptations of Lovecraft's work. Written and illustrated by Gou Tanabe and translated to English by Zack Davisson, the manga is hauntingly beautiful. You can probably already tell by the cover art above, but Tanabe's illustrations are simply incredible.Five Lovecraft manga adaptations have already been published in the US by Dark Horse Manga, including the 288-page adaptation of The Call of Cthulhu for $13.90 (was $20) and At the Mountains of Madness, which has a 626-page hardcover Deluxe Edition for $26.65 (was $50). The English translation of The Shadow Out of Time releases December 23 and is available to preorder for $22.At the Mountains of Madness Deluxe Edition (Hardcover) -- $26.65 ($50)The Shadow Out of Time (Paperback) -- $22 | Releases December 23The Colour Out of Space (Paperback) -- $12.74 ($15)The Call of Cthulhu (Paperback) -- $13.90 ($20)The Shadow Over Innsmouth (Paperback) -- $19.67 ($30)The Hound and Other Stories (Paperback) -- $13.94 ($15)At the Mountains of Madness Vol. 1 (Paperback) -- $16.12 ($20)At the Mountains of Madness Vol. 2 (Paperback) -- $15.40 ($20)                                                                                                                                                                               Adorable New Astro Bot Collectibles Are Waiting To Be Rescued By You                         Amazon Has Tons Of Horror Movie Box Sets For Low Prices In Halloween Sale                         Lego's New Spider-Man And Iron Man Busts Get Limited-Timed Discounts                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Joe Hill's Massive New Horror-Fantasy Novel Arrives Just In Time For Halloween                         Icon Blue Limited Edition DualSense PS5 Controller Is Available Now                         Lego Technic McLaren F1 Race Car Retires Soon, Save $72 At Amazon Before It's Gone                         Pokemon TCG Amazon-Exclusive Holiday Premium Collection Is Back In Stock                         Get 10 Shudder Original Horror Movies On Blu-Ray For Only $51    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n"
  }
]