[
  {
    "title": "Fortnite Chapter 7 Map For Season 1: All Map Changes",
    "url": "https://www.gamespot.com/gallery/fortnite-chapter-7-map-for-season-1-all-map-changes/2900-7288/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4612611-chaptersevenpacificbreakscreenshot_001.jpg",
    "tag": "Gaming",
    "date": "2025-11-29T21:52:00.000Z",
    "description": "By     Phil Owen   on November 29, 2025 at 1:52PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Phil Owen\n   on November 29, 2025 at 1:52PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                The last couple Fortnite Battle Royale islands have been based on real-life geography and ecosystems--Chapter 5 was Mediterranean Europe, and Chapter 6 was Japan. In Chapter 7, we've moved on to North America, and specifically the southwestern USA. The Chapter 7 map includes major locations based on Los Angeles, Las Vegas, San Francisco, and Area 51--in other words, it's Fortnite's San Andreas map.It all starts in Battlewood in the southwest portion of the new island, which has its own version of the iconic Hollywood sign and streets lined with palm trees. Nearby, you'll find the sound stages of Sus Studios, and you can take a ride up the freeway--yes, this map has Fortnite's first four-lane highway--to visit the casinos of the Sandy Strip. And smack in the middle of the map you won't find Tilted Towers or any other city. Instead, the heart of the island holds Innoloop Labs, an Area 51-esque spot where somebody is doing experiments on the Zero Point.But the highlight of the map is in the northeast, where you'll find a theme park called Wonkeeland, where you can ride a roller coaster--the first time Fortnite has had one of those since Chapter 3.There's no train on the Chapter 7 island, unfortunately, but there's something that might actually be better: hot air balloons. You can find several of these balloons floating around the island, and you can ride them to new places or use them as a sniper's nest.Fortnite's Chapter 7 map sure looks like a wild one. Scroll on for a better look at some of the key spots around the island.    \n  \n                      "
  },
  {
    "title": "Fortnite Battle Pass Chapter 7 Season 1: All Skins And Other Rewards",
    "url": "https://www.gamespot.com/gallery/fortnite-battle-pass-chapter-7-season-1-all-skins-and-other-rewards/2900-7292/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4613431-fortnitechaptersevenpacificbreakkeyart%281%29.jpg",
    "tag": "Gaming",
    "date": "2025-11-29T21:52:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                Epic Games seems to love saving its biggest collabs for the...",
    "body": "\n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Epic Games seems to love saving its biggest collabs for the first season of each new Fortnite chapter, and that certainly has not changed in Chapter 7 Season 1--which has a battle pass that includes two classic and beloved movie characters, Marty McFly from Back to the Future, and Beatrix \"The Bride\" Kiddo from Quentin Tarantino's Kill Bill.In terms of name recognition, that's a pretty major pairing with at least as much name recognition as Godzilla and Hatsune Miku, which Fortnite kicked off Chapter 6 with a year ago. But if those folks aren't your speed, fortunately, there are six other skins on the Season 1 battle pass that you can enjoy.Four of those skins are just regular humans, including a skater girl named Carina who has blue hair and a cast on her right wrist, who's sure to be an instant favorite. The pass rounds out with Kingston, a laid-back lion man, and a new version of the old Eternal Voyager skin who appears to be related to The Seven somehow.This battle pass will work differently from past ones. While The Bride is the skin you unlock instantly when you buy the pass, and Dark Voyager is the final skin, you can unlock the rest of the skins in whatever order you wantAs usual, the battle pass costs 1,000 V-Bucks to purchase, and it's included with a subscription to Fortnite Crew, whether you're subscribed to Crew on its own or through Xbox Game Pass Ultimate. The pass includes 1,500 V-Bucks you can unlock. Scroll on for a first look at the skins on the Fortnite Chapter 7 Season 1 battle pass, as shared here."
  },
  {
    "title": "Fortnite Is Down: When Will Fortnite Servers Be Back Up For Chapter 7?",
    "url": "https://www.gamespot.com/articles/fortnite-is-down-when-will-fortnite-servers-be-back-up-for-chapter-7/1100-6536575/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1632/16320660/4601178-image%2810%29.jpg",
    "tag": "Gaming",
    "date": "2025-11-29T19:15:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Fortnite's biggest day of the...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Fortnite's biggest day of the year started off with a massive live event that wrapped up Chapter 6, and if all goes well, Chapter 7 will begin very soon. In the meantime, though, Fortnite's servers are offline for maintenance and to deploy the Chapter 7 update. There's no bug here--Fortnite is offline on purpose. But it shouldn't be down for long.UPDATE: Servers are back online as of 4:30 PM PT. Chapter 7 has begun!When will Fortnite Chapter 7 start?In the past, the start of a new chapter came with longer periods of downtime--like a day or more--but these days Epic tends to treat new season and new chapter updates the same as it would a regular mid-month patch. That means you can expect Fortnite to be offline for between 4 and 7 hours, with Chapter 7 likely launching in the evening on Saturday, November 29, likely around 5 PM PT / 8 PM ET--primetime, in other words.We guarantee nothing, however, as these launches don't always go smoothly. Just a month ago, when the Simpsons season began, all seemed well when Fortnite returned from maintenance--but after an hour, the servers crashed and the game went back offline for a while. And there was another update earlier this year that ended up taking Fortnite offline for an entire additional day. But such incidents are rare, and most updates go off without major hitches.When Chapter 7 launches, it'll come with a pretty loaded battle pass, teased by Epic to feature Marty McFly from Back to the Future and Beatrix \"The Bride\" Kiddo from Kill Bill.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]