[
  {
    "title": "Xbox Teases \"A Lot Of Exciting Things\" To Be Announced In 2026",
    "url": "https://www.gamespot.com/articles/xbox-teases-a-lot-of-exciting-things-to-be-announced-in-2026/1100-6536794/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4619786-xbox.jpg",
    "tag": "Gaming",
    "date": "2025-12-09T17:49:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Xbox's Jason Ronald has teased...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Xbox's Jason Ronald has teased that Microsoft has \"a lot of exciting things to share\" in 2026 for the Xbox's 25th anniversary. Speaking to the BBC, Ronald was asked specifically if more Original Xbox games would be coming to Xbox Game Pass. Ronald didn't confirm anything outright but said fans have a lot to look forward to for the anniversary next year.\"I can't announce anything today, but 2026 is the 25th anniversary of Xbox. And we want to celebrate the great legacy and the history that we have at Xbox, as well as defining the future of where the Xbox ecosystem is going,\" he said. \"So, I can't confirm or deny what you are asking, but stay tuned. We have a lot of exciting things to share next year.\"          Also in the interview, Ronald said Xbox feels \"a need but also a responsibility\" to preserve games from the past and \"enable them to be played in entirely new ways.\"Beyond the possible addition of more Original Xbox games for Game Pass in 2026, Microsoft will release Halo: Campaign Evolved in 2026, not just for PC and Xbox, but also PlayStation 5. Additionally, it's been reported that a new live-service Halo game could be announced and released in 2026.Many are also wondering when Microsoft will formally unveil its next-generation console platform, which is said to be a \"high-end\" device that may embrace some PC gaming sensibilities.2025 was a challenging year for Xbox, as the company enacted dramatic measures such as mass layoffs, studio closures, and game cancellations against the backdrop of Microsoft's reported mandate to increase profits. Microsoft also raised the price of Xbox Game Pass significantly this year, leading some to wonder if the service is still worth it at the higher price.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Magic: The Gathering Marvel Super Heroes Card Reveal Includes A Very Powerful Hulk",
    "url": "https://www.gamespot.com/gallery/all-magic-the-gathering-marvel-super-heroes-cards/2900-7330/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/3/37852/4619856-marvel-super-heroes.jpg",
    "tag": "Gaming",
    "date": "2025-12-09T19:42:00.000Z",
    "description": "By     Jason Fanelli   on December 9, 2025 at 11:58AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Jason Fanelli\n   on December 9, 2025 at 11:58AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Marvel Super Heroes assemble!Wizards of the Coast has a full slate of expansions for Magic: The Gathering coming in 2026, starting with a return to a fan-favorite plane in January with Lorwyn: Eclipsed. June, however, will bring Marvel Super Heroes, a set themed around the many heroes and villains of the Marvel universe, and today, Wizards of the Coast previewed a few cards that will be appearing in that superhero set. Familiar faces like Captain America, The Incredible Hulk, and Doctor Doom were previewed during an hour-long livestream, along with the reveal of the Fantastic Four as the main focus of one of the expansion's preconstructed Commander decks. The stream also revealed multiple art variants, including Classic Comic alternates for Captain America, Doctor Doom, Hulk, and Namor; borderless comic panel alternates like those found in the recent Spider-Man set; and a new batch of Source Material bonus sheet cards, which include reprints of Dauthi Voidwalker, Massacre Girl, and more adorned with classic Marvel art. Magic: The Gathering's Marvel Super Hero set is due to launch June 2026 in both local game stores and big box retailers. The gallery below showcases all of the cards shown during the WOTC livestream today. Baron Helmut ZenoBruce Banner (double-faced card, front side)The Incredible Hulk (double-faced card, back side)Bruce Banner (Classic Comic variant, front side)The Incredible Hulk (Classic Comic variant, back side)Captain America, Super-SoldierCaptain America, Super-Soldier (Classic Comic variant)Doctor DoomDoctor Doom (Classic Comic variant)Doom Reigns SupremeMoon Girl and Devil DinosaurNamor the Sub-MarinerNamor the Sub-Mariner (Classic Comic variant)Quicksilver, Brash BlurSuper-SkrullThe Coming of GalactusThe Coming of Galactus (Borderless Panel variant)The Sentry, Golden GuardianThunderbolts ConspiracyWorld War HulkWorld War Hulk (Borderless Panel variant)Mister Fantastic (Commander precon face commander)Invisible Woman (Commander precon face commander)Human Torch (Commander precon face commander)The Thing (Commander precon face commander)Chaos Warp (Source Material bonus sheet reprint)Widow-Making Infiltrator (Source Material bonus sheet reprint of Dauthi Voidwalker)Dig Through Time (Source Material bonus sheet reprint)Ephemerate (Source Material bonus sheet reprint)Extinction Event (Source Material bonus sheet reprint)Harbinger of the Seas (Source Material bonus sheet reprint)Heroic Intervention (Source Material bonus sheet reprint)Heroic Intervention (Source Material bonus sheet reprint)Heroic Intervention (Source Material bonus sheet reprint)Lord of Atlantis (Source Material bonus sheet reprint)Elektra, Deadly Assassin (Source Material bonus sheet reprint of Massacre Girl)    \n  \n                      "
  },
  {
    "title": "Capcom Has Plans For More Mega Man, Devil May Cry, and Ace Attorney titles",
    "url": "https://www.gamespot.com/articles/capcom-has-plans-for-more-mega-man-devil-may-cry-and-ace-attorney-titles/1100-6536797/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4619756-megamanlegacycollection.jpg",
    "tag": "Gaming",
    "date": "2025-12-09T18:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          For the last few years, Capcom...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                For the last few years, Capcom has been laser-focused on its core franchises like Street Fighter, Resident Evil, and Monster Hunter. Now, Capcom's latest disclosure to investors indicates that the company wants to expand and revisit three of its other franchises: Mega Man, Devil May Cry, and Ace Attorney.Capcom's 2025 Integrated Report is online, and it notes that Mega Man, Devil May Cry, and Ace Attorney are the fourth-, fifth-, and seventh-highest-grossing franchises in Capcom's history. COO Haruhiro Tsujimoto mentioned those three games specifically as intellectual properties that the company wants to expand upon.\"We consistently release two to three major new titles each year, but recognize the need to grow our pipeline going forward,\" said Tsujimoto. \"Capcom owns a wealth of globally popular brands, such as Mega Man, Devil May Cry, and Ace Attorney. We aim to expand our user base and improve our performance through new releases, remakes, and ports of titles in these series to new hardware. By enhancing brand power and cultivating loyal fan bases, we will grow these into core IPs\"Tsujimoto went on to note that Capcom wants to expand its staff to have the manpower to work on additional games each year. He added that the company is adding to its Osaka development hub, which is scheduled to be finished in 2027.There hasn't been a brand-new Mega Man game since Mega Man 11 in 2018. However, a compilation for the Mega Man Star Force Legacy titles will be released in 2026. Devil May Cry has similarly been dormant since the fifth game in 2019. That franchise also has an animated series on Netflix, which will hopefully fuel a demand for a sequel.The Ace Attorney games have been re-released numerous times, most recently in 2024 when the Apollo Justice Trilogy and Investigations Collection compilations debuted.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]