[
  {
    "title": "Nintendo Wants To Be \"Even More Actively Involved\" In Moviemaking",
    "url": "https://www.gamespot.com/articles/nintendo-wants-to-be-even-more-actively-involved-in-moviemaking/1100-6536030/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4598574-screenshot2025-11-07at9.48.09%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-11-07T14:57:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Nintendo enjoyed enormous...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Nintendo enjoyed enormous success in the film department with The Super Mario Bros. Movie, which earned more than $1.3 billion worldwide. Now, Nintendo is gearing up to release The Super Mario Galaxy Movie in 2026, with a live-action The Legend of Zelda film to follow in 2027. More films based on Nintendo properties could come next, and Nintendo has now said moviemaking is something Nintendo wants to be \"even more actively involved in going forward.\"Nintendo president Shuntaro Furukawa said in Nintendo's latest earnings report that Nintendo is keen to pursue moviemaking because it believes films can become long-term assets for the company as it looks to the future beyond games.Nintendo has an internal unit called Nintendo Pictures, which is conducting experiments in the video space, including the recent Pikmin shorts. But Nintendo Pictures won't be the team that handles future feature films--that work is being done by established Hollywood studios like Universal and Illumination.\"For movies, there is an established business framework where the distribution companies manage movies. The past indicates that following that established structure and creating content with care and attention leads to profits,\" Furukawa said.Hollywood is an established machine with a \"proven business model,\" Furukawa said, but Nintendo Pictures is a new unit trying to \"take on various challenges in areas that have not yet clearly taken shape.\"\"The 'Close to You' Pikmin-themed short video that was released recently was created as an experiment based on this concept. We would like to continue providing this kind of content that generates enthusiasm around the world, and develop it into an important asset for Nintendo,\" Furukawa said.No more Nintendo movies beyond the live-action Zelda film have been announced, but there have been rumors of a Donkey Kong film.Nintendo also recently discussed its general philosophy for filmmaking recently. The company said it doesn't simply license its properties to film studios. Instead, Nintendo is involved in the financing and \"deeply involved\" in production. Shigeru Miyamoto, for example, produced The Super Mario Bros. Movie and will be a producer on The Super Mario Galaxy Movie and the Zelda movie, which just began filming in New Zealand. The Super Mario Bros. Movie made a gargantuan $1.36 billon at the global box office, ranking as the No. 2 highest-grossing movie of 2023, only behind Barbie ($1.44 billion). The Super Mario Bros. Movie ranks as the No. 18 highest-grossing movie in history.\"It was enjoyed by a vast audience, including those who had experienced Mario games, those less familiar with gaming, and people of all ages, from children to seniors,\" Nintendo said. \"What has pleased us most about this film, even more than the measurable results, are the warm comments we received from so many people.\"Nintendo's gaming business is booming at the moment, thanks in part to the recent launch of the Switch 2. It's sold more than 10 million units thus far, becoming Nintendo's fastest-selling platform ever. Nintendo is enthusiastic about its sales potential this holiday, recently boosting the console's sales projections from 15 million to 19 million for the fiscal year that ends in March 2026.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Son Of A Diddly, Ned Flanders Has Eliminated 33,000 Unneighborly Fortnite Players",
    "url": "https://www.gamespot.com/articles/son-of-a-diddly-ned-flanders-has-eliminated-33000-unneighborly-fortnite-players/1100-6536031/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1813/18138562/4598571-red-ned-redemption.jpg",
    "tag": "Gaming",
    "date": "2025-11-07T14:22:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          He might seem harmless, but Ned...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                He might seem harmless, but Ned Flanders won't deal with any unseemly Fortnite players. The NPC roaming around in the game's Simpsons collaboration has taken out 33,000 players and counting, according to the official Fortnite account on X.The Fortnite account shared the hilarious Flanders statistic with a repost of a video where Homer and Marge's neighbor eliminates players during a fight with a streamer. Like most NPCs in the battle-royale game, Flanders will retaliate when attacked.The Simpsons crossover event with Fortnite started last weekend, changing the game's island to a map of Springfield. There's a Simpsons-specific battle pass, including a skin of Stupid Sexy Flanders. The collaboration has gone both ways, too, as The Simpsons episode on November 2 kicked off with a Fortnite couch gag. Poor Peely didn't find the intro sequence funny, though.Developer Epic Games announced earlier this week that Fortnite's Simpsons event has led to a surge in players, seeing the most people in-game since last holiday season. Fortnite.gg reports that Fortnite has seen a peak of almost 2.7 million concurrent players for The Simpsons event. However, that comes nowhere close to roughly a year ago, when Fortnite saw more than 14 million players in-game at the same time.Looking ahead, a new leak points to a jam track of \"Golden\" from Kpop Demon Hunters being in the works for the game.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Pokemon's Two-Game Tradition Started As A Way To One-Up Mario",
    "url": "https://www.gamespot.com/articles/pokemon-two-game-tradition-started-as-a-way-to-one-up-mario/1100-6536032/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4598572-pokemon-red-blue.jpg",
    "tag": "Gaming",
    "date": "2025-11-07T14:52:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Whenever a new mainline Pokemon...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Whenever a new mainline Pokemon game rolls around, you can expect not one but two versions of the same game to hit the shelves. That's a sales decision that was made with a primary goal in mind--to give Nintendo's iconic plumber Mario a run for his money.During an investor Q&A this week, Nintendo veteran Shigeru Miyamoto spoke about a meeting he once had with Pokemon creator Satoshi Tajiri, who joked that the only way to beat Mario Kart in sales was to sell two copies of Pokemon to each consumer. Miyamoto says this was one of the reasons why the first Pokemon game was released as Pokemon Blue and Pokemon Red, which is a tradition that was continued since then with most mainline games.\"That is one reason why Pokémon started with both Pokémon Red and Pokémon Blue,\" Miyamoto said. \"I believe that new ideas are born precisely because of people like him, who challenge themselves to surpass what came before.\"These Pokemon games typically offer exclusive Pokemon for players to collect, and as of Pokemon Silver and Gold, two distinct legendary Pokemon that can only be found in their respective games. Of course, trading Pokemon is a big part of the experience as well, and recent games have made the process of completing your Pokedex easier thanks to advances in online connectivity. There are still fans who are completionists at heart and will buy both versions of a Pokemon game, with Nintendo even selling two-packs to cater to player demand.This year marked the 30th anniversary of Pokemon, and while a new Generation 10 game wasn't released, Pokemon Scarlet and Violet did get a Switch 2 upgrade that greatly improved the game on the new Nintendo hardware. Pokemon Legends: Z-A was also released, and it saw players return to Lumiose City for the first time since Pokemon X and Y on the Nintendo 3DS.In the business department, Nintendo has reported that it has sold 10.36 million Switch 2 units as of September 30, and Mario Kart World has sold 9.57 million units so far. The company also revealed that 84% of Switch 2 owners previously owned a Switch 1 console, and while it'll still sell the older console, Nintendo will focus on the Switch 2 going forward.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]