[
  {
    "title": "Everything New In Fortnite OG Season 7",
    "url": "https://www.gamespot.com/gallery/everything-new-in-fortnite-og-season-7/2900-7332/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4620049-icekingstorm.jpg",
    "tag": "Gaming",
    "date": "2025-12-11T02:35:00.000Z",
    "description": "By     Phil Owen   on December 11, 2025 at 4:16AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Phil Owen\n   on December 11, 2025 at 4:16AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Fortnite OG Season 7, which starts December 11, is reviving many of the best parts of Chapter 1. While Season 1 did include a small celebration of the holidays, it wasn't until Season 7 that Fortnite held a major event with holiday-themed gameplay changes, daily challenges, and lots of free cosmetics.Season 7 was an eventful one from the very start, as the Battle Royale island expanded with the addition of a new snow biome in the southwest corner of the map after a massive iceberg crashed into the island. It also introduced airplanes, added possibly the most infamous weapon in Fortnite history, and held one of Fortnite's most memorable live events. Scroll on to see everything you can expect from Fortnite OG Season 7.Fortnite OG Pass Season 7The Season 7 OG pass includes new versions of three skins from the original Season 7 battle pass: Sgt. Winter, Lynx, and Onesie. The new Wonder Onesie is particularly interesting, since it has a pattern that uses one of Fortnite's emoticons--though it turns out that it's actually a spray, since that emoticon is an old battle pass exclusive. So it turns out that Wonder Onesie is customizable with any spray you have.This pass is time-gated, however, as only three of the six pages are currently unlockable--we have no idea what's in the final three pages. But it's interesting that the pass did not include a new version of the Ice King, despite the fact that he's the season's main character. Because of that, he's a great candidate to pop up on one of these missing pages, which would make this the first OG pass to include four skins instead of three. If not, the Ice King may receive a new skin in the item shop.The Fortnite OG Season 7pass costs 1,000 V-Bucks, and it's included with Fortnite Crew.Fortnite OG Season 7 weapons and lootWhen the original Season 7 began, several items were removed from the loot pool, but nothing was added. Over the course of the season, though, a number of new guns and other weapons and items were added, and some existing guns were unvaulted. And one of the most notorious weapons in Fortnite history, the Infinity Blade, was added a week after launch. But more on that a bit further down.Here are the weapons that will make up the Fortnite OG loot pool in Season 7:Assault RifleScoped Assault RifleThermal Assault RifleSuppressed Assault RifleHeavy Assault RifleInfantry RifleMinigunTactical ShotgunPump ShotgunCompact SMGSuppressed SMGPistolSuppressed PistolDual PistolsHand CannonScoped RevolverHeavy SniperSuppressed SniperHunting RifleGrenade LauncherRocket LauncherBottle RocketsCluster ClingersDynamiteThe Infinity BladeThis weapon, which comes from Epic's mobile game of the same name, is an utterly unique weapon that takes up your entire inventory and gives bonus health and shields when you pick it up, gives siphon on kills, and makes you move faster. The Infinity Blade was so absurdly overpowered that it was vaulted after three days and never returned. Until now.AirplanesThe two biggest things added to Battle Royale when Season 7 began were airplanes and ziplines. The Fortnite airplane is the X-4 Stormwing, an old-style biplane with a machine gun on the front. The X-4 only has one seat, but passengers can ride on the wings. Be warned that you will take fall damage if you fall out of one of these.Fortnite OG Season 7 live eventsFortnite had one major live event midway through Season 7, and then was rocked by a series of earthquakes during the final stretch of the season--a trick Epic has used many other times since then.The mid-season Ice Storm event, which went down on January 19, 2019, was relatively short but extremely memorable, as it involved the spirit of the Ice King standing over the island and conjuring a blizzard that covered the entire island with snow. When the match began only one corner of the island had snow, and when it ended the snow was everywhere. And it stayed that way for weeks.Fortnite OG Season 7 map changesThe southwestern corner of the island got a dramatic makeover and expansion for the start of Season 7 with the addition of a large iceberg and a layer of snow cover. The iceberg destroyed the beloved Greasy Grove and Flush Factory, but it added three new named locations with Polar Peak, Frosty Flights, and Happy Hamlet. Season 7 also saw the introduction of The Block in the northwest corner of the island later in the season.The Block was a big empty space where Epic would showcase places created using Fortnite Creative tools, which were introduced for the first time at the beginning of Season 7--these user-created spots would rotate regularly. The Block is on the new version of the Season 7 map, but it's had an accident and has fallen off a cliff--so there's no reason to expect it'll be active this time.    \n  \n                      "
  },
  {
    "title": "Legendary Dev's Long-Lost NES Game Is Getting Its First-Ever Release",
    "url": "https://www.gamespot.com/articles/legendary-devs-long-lost-nes-game-is-getting-its-first-ever-release/1100-6536857/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4620937-xcavator.jpg",
    "tag": "Gaming",
    "date": "2025-12-11T10:27:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          In 2012, programmer Chris...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                In 2012, programmer Chris Oberth passed away after a career that spanned from the dawn of video games in the late '70s to the PlayStation 2 era. Now, one of Oberth's unfinished games, Xcavator 2025, has been completed and it's slated for a physical release on the console it was originally intended for: the NES.The Video Game History Foundation--with the permission and support of Oberth's family--found the source code for Xcavator 2025 in Oberth's development archives. It was originally developed by Incredible Technologies Inc., the company behind the Golden Tee Golf and Big Buck Hunter arcade games. However, it was rejected by publishers in 1991, and it was never seen again until now.To finish the game, the VGHF teamed up with Mega Cat Studios, which was guided by the remaining materials to recapture the spirit of Oberth's original vision. Towards that end, Mega Cat Studios' development team only used the tools and environments that would have been available at the time. A standalone trailer for Xcavator 2025 isn't available yet, but the first footage was screened during the Day of the Devs: The Game Awards Edition at the 1 hour 43:31 mark below.          The physical release of Xcavator 2025 on a working NES cartridge is being handled by iam8bit. Xcavator 2025 is available for preorder now, and it's going for $100. This game will include an \"authentically retro package,\" as well as a 14-page manual that includes background info on both Oberth and Xcavator 2025. All of the profits from this release will be donated to the Video Game History Foundation, which is an official non-profit organization dedicated to preserving gaming history.This isn't the first time that the VGHF has resurrected one of Oberth's lost titles. In 2020, the organization released a restored version of Oberth's Days of Thunder NES game, which was based on the 1990 feature film starring Tom Cruise. This was an alternate version that was separate from the Days of Thunder game that was released on the NES, PC, and Amiga. The limited run of Oberth's Days of Thunder sold out quickly, and we wouldn't be shocked if Xcavator 2025 has the same kind of success.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Kim Kardashian Is Coming To Fortnite This Week",
    "url": "https://www.gamespot.com/articles/kim-kardashian-is-coming-to-fortnite-this-week/1100-6536858/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4620938-fortnitekimkardashian.jpg",
    "tag": "Gaming",
    "date": "2025-12-11T10:28:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Fortnite has drawn upon some of...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Fortnite has drawn upon some of the most iconic characters from the world of fiction, which recently led to a massive crossover. Now, the game is apparently expanding its roster to reality TV stars, as Kim Kardashian is slated to make her Fortnite debut on December 13. The influencer, model, and part-time actress has had her own hit mobile game, but this is her first appearance in an existing game.          Kardashian's appearance in the game is also a collaboration with her clothing line SKIMS. So far, dataminers have determined that Kardashian will have at least three main skins, eight alternate outfits, and various hairstyles to choose from. Via Vice, the potential pricing for these items is reproduced below.Kim Kardashian (Fur Coat): 1,500 V-BucksKim Kardashian (SKIMS Suit): 1,500 V-BucksKim Kardashian (Leather Suit): 1,500 V-BucksKim Kardashian Purse (Pickaxe): 800 V-BucksEmote (Paper Magazine Pose): 500 V-BucksMakeup Backpack (Back Bling): 400 V-BucksRing Light and Phone (Back Bling): 400 V-BucksJet (Glider): 1,200 V-BucksThe pricing for the Kim Kardashian bundle and its full contents have yet to be shared. Additionally, there will be a Kim Kardashian Pickaxe that players can purchase in the Fortnite store and wield in battle.According to Epic Games, the launch of Fortnite Chapter 7 led to 3 million concurrent players. Meanwhile, Fortnite leakers are reporting that characters from Bleach are coming in 2026, and so is \"Restarter Island,\" a new feature that resembles the Gulag from the Call of Duty franchise. That will reportedly let eliminated players compete in a random 1v1 minigames, before letting the winner respawn in their battle royale match.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]