[
  {
    "title": "The Game Awards Gave Clair Obscur: Expedition 33 A Massive Boost",
    "url": "https://www.gamespot.com/articles/the-game-awards-gave-clair-obscur-expedition-33-a-massive-boost/1100-6536980/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4623278-clairobscurexpedition33assemble.jpg",
    "tag": "Gaming",
    "date": "2025-12-16T05:59:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Sandfall Interactive's Clair...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Sandfall Interactive's Clair Obscur: Expedition 33 is having a remarkable second run this month after winning Game of the Year at The Game Awards. It was already one of the top hits of the year, but that added exposure has pushed Expedition 33 even higher than before.According to Alinea Analytics, sales of Expedition 33 jumped 21% on PlayStation 5 and 76% on Steam. The bump was a considerably smaller 3% on Xbox, likely because Expedition 33 is on Game Pass. Regardless, the combined sales across PC and consoles post-The Game Awards is estimated to be over 200,000 additional copies.Sandfall deftly timed new DLC for Expedition 33 to drop almost as soon as it won its final award at The Game Awards. That likely helped fuel the rush of new and returning players that pushed it to 56,993 concurrent players over the weekend, via SteamDB. That's the game's highest count since June.Circana senior director Mat Piscatella also noted on Bluesky that \"the percent of US active PS, XBX and US Steam players engaging with the game more than tripled by Dec 13th when compared to Dec 10th. US Steam showed the largest lift.\" For December 13th, Circana notes that daily active users reached 13th on Steam, 30th on PlayStation, and 33rd on Xbox, all in the US. For added context, Piscatella told GameSpot that, \"In this example, engagement means anyone that started the game. If someone just looked at the menu or played for 24 hours straight it counts. Active player means the percentage of all people who played any game that day on PS, XBX or Steam.\"Expedition 33 made history at The Game Awards, by winning nine out of the 13 categories it was nominated in. French President Emmanuel Macron even offered his congratulations to the devs at Sandfall for their accomplishments. GameSpot also named it our pick for Game of the Year for 2025.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Fallout Season 2 Episode Release Date Schedule And Where To Watch",
    "url": "https://www.gamespot.com/articles/fallout-season-2-episode-release-date-schedule/1100-6536675/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4615831-screenshot2025-12-03at1.22.35%E2%80%AFpm.png",
    "tag": "Gaming",
    "date": "2025-12-15T21:12:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Fallout Season 2 premieres on...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Fallout Season 2 premieres on December 16, and in a big change from Season 1, episodes will be released weekly instead of all at once. Prime Video has now published the full release schedule for Fallout Season 2, so you can plan and prepare for all eight episodes.Episodes will be released weekly on Wednesdays at midnight PT, and the sophomore season will run through February 4, 2026. Fallout Season 1 also had eight episodes.The Season 2 schedule includes an update to the premiere, which is now coming on Tuesday, December 16, at 6 PM PT / 9 PM ET. It was previously expected to debut on December 17. Fallout Season 2 scheduleEpisode 1 - December 16 at 12 6 PM PT / 9 PM ETEpisode 2- December 24 at 12 AM PT / 3 AM ETEpisode 3 - December 31 at 12 AM PT / 3 AM ETEpisode 4 - January 7 at 12 AM PT / 3 AM ETEpisode 5 - January 14 at 12 AM PT / 3 AM ETEpisode 6 - January 21 at 12 AM PT / 3 AM ETEpisode 7 - January 28 at 12 AM PT / 3 AM ETEpisode 8 - February 4 at 12 AM PT / 3 AM ET          Where to watch Fallout Season 2Just like Season 1, Fallout Season 2 will stream on Prime Video. That means you need to have a subscription to the service to watch. It costs $15/month or $140 year to get the ad-supported version, or an extra $3/month more to remove the ads. This also gets you Prime perks, including free shipping on items purchased through Amazon.Big change from Season 1As mentioned, Season 2 does away with the binge format in favor of having new episodes release weekly. With Season 1, some people enjoyed having all episodes release at the same time so they could binge the series. Others said they wished it was released weekly to give them time to digest.Fallout Season 2 brings on new cast members, including Macaulay Culkin and Kumail Nanjiani, while the story heads to New Vegas.As for the game series, Fallout 76 just got its Burning Springs update that added The Ghoul, the character from the TV series played by Walton Goggins. Additionally, Bethesda is working on Fallout 5, but it's still very early days.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Preorder Digimon Movie Blu-Ray Collection For $20 Ahead Of December 30 Launch",
    "url": "https://www.gamespot.com/articles/digimon-the-movies-4-6-blu-ray-collection-up-for-preorder-at-amazon/1100-6535809/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4593609-digimonmovies.jpg",
    "tag": "Gaming",
    "date": "2025-12-16T06:35:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   Digimon fans don't have to wait much longer to watch the uncut versions of three early 2000s movies in English for the first time. Discotek Media's Digimon The Movies 4-6 Collection releases December 30. The preorder price has dropped for the second time at Amazon and Crunchyroll; the $30 Blu-ray collection is now available to preorder for only $20.The 4-6 Collection is a follow-up to Discotek Media's popular Digimon The Movies 1-3 Collection, which released last December. The first collection is currently out of stock everywhere, so if you're interested in watching the new collection at launch, it'd be wise to preorder.                                                                                                      Digimon The Movies 4-6 Collection (Blu-ray)                                                                $20 (was $30) | Releases December 30                                                                                                                                                                                    Digimon: The Movies 4-6 Collection includes the following movies with both English dubs and the original Japanese audio with subtitles:Revenge of the Diaboromon (2001)Battle of Adventurers (2001)Runaway Locomon (2002)Though referred to as \"movies,\" these aren't feature-length films. Revenge of the Diaboromon is 29 minutes and is set during the Digimon Adventure 02 timeline. Battle of Adventurers released the same year and has a 50-minute runtime. It was the first movie in the Digimon Tamers timeline, the third Digimon series, and revolves around a virus that causes Digimon to enter the Real World. Runaway Locomon, a 30-minute short film, released in 2002 and takes place after the Digimon Tamers season finale.The collection has a total runtime of 2 hours and 9 minutes. The runtime is 10 minutes longer than the originals because these are uncut versions that were restored with English dubs by Discotek. The runtimes listed above correspond with the original releases, not the uncut versions.                                                                                                                            Digimon The Movies 1-3 Collection (Blu-ray)                                                                $24 (was $30)                                                                                                                                                                                    Digimon: The Movies 1-3 Collection released on Blu-ray last December and was on sale for only $18 (was $30) for Black Friday. That deal caused it to sell out at all retailers. Crunchyroll is letting customers place orders for $24, but the Blu-ray is currently on backorder with an undetermined shipping date.Digimon Adventure (1999)Our War Game (2000)Hurricane Touchdown (2000)Parts of these three movies were spliced together to create Digimon: The Movie (2000), the first feature-length theatrical release for the franchise.Discotek restored the uncut versions of all three short films with a new English dub. The runtime for the collection is 2 hours and 9 minutes, more than 40 minutes longer than the 88-minute feature film.The Blu-ray collection also comes with Digimon: The Movie's original dubbed version, so fans can watch the story as they did in theaters as kids, too.                                                                                                                                                                        Digimon TV Series on Blu-rayDigimon Adventure: Season 1 & Digimon Adventure 02: Season 2Discotek Media has steadily brought classic Digimon anime to Blu-ray over the past few years. Digimon Adventure and Digimon Adventure 02 are both available on Blu-ray with versions with English dubs and the original Japanese with subtitles. Unlike the movie collections, though, there are separate English and Japanese editions. At the moment, all four are in stock at Amazon, though only Digimon Adventure 02 in Japanese is discounted below MSRP.Digimon Adventure: Series 1 (English Dub) -- $80Digimon Adventure 02: Series 2 (English Dub) -- $80Digimon Adventure: Series 1 (Japanese Dub) -- $70Digimon Adventure 02: Series 2 (Japanese Dub) -- $49 ($70)Digimon Movies on Blu-rayDigimon Adventure Tri / Last Evolution Kizuna / The Beginning (Shout Factory)Shout Factory has handled the Blu-ray releases for the six Digimon Tri movies, which were collected in a 6-Film Collection currently priced at $78--this is a high price; we wouldn't recommend buying it until the price comes down to around $50.Shout Factory also released Blu-ray versions for the last two movies, and both of these are far more reasonably priced right now. Digimon Adventure: Last Evolution Kizuna (2020) is available for $18, and Digimon Adventure 02: The Beginning (2023) is $16.90.Digimon Adventure: Last Evolution Kizuna -- $18 ($23)Digimon Adventure 02: The Beginning -- $16.90 ($27)Digimon Adventure Tri: The Complete 6-Film Collection -- $78Digimon The Movies 1-3 Collection -- Sold outDigimon The Movies 4-6 Collection -- $20 ($30) | December 30Digimon Adventure Tri Movies on Blu-ray:Reunion -- $10Determination -- $9Confession -- $9Loss -- $9Coexistence -- $7Future -- $10Digimon on DVDMany seasons of the Digimon TV series have yet to release on Blu-ray and are often difficult to find on DVD, too. You can find some Digimon seasons for reasonable prices from resellers, including Digimon Fusion and the first part of Digimon Tamers. There's also a DVD box set with Digimon Adventure, Digimon Adventure 02, Tamers, and Frontier, though it has mixed reviews.Digimon Seasons 1-4 (DVD) -- $67Digimon Tamers: Volume 1 (DVD) -- $20Digimon Fusion: Season 1 (DVD) -- $24Digimon: The Movie (DVD) -- $29Digimon fans can also save on the fantastic new RPG developed by Media Vision and published by Bandai Namco in October. Digimon Story Time Stranger is on sale for $50 for PS5 at Amazon. This deal matches the monster-taming adventure's Black Friday price. PC and Steam Deck players can get the standard edition as a Steam key from Fanatical for $49 (was $70). Fanatical also has 30% discounts on the Deluxe and Ultimate Editions.                                                                                                                                               Disclosure: GameSpot and Fanatical are both owned by Fandom.Sign up for GameSpot's Weekly Deals Newsletter:                                Nintendo Switch 2 Samsung 256GB MicroSD Express Card On Sale For Only $33                         Target's Best Exclusive Lego Sets Get Rare Holiday Discounts                         Xbox Elite Series 2 Controllers On Sale For Even Better Prices Than Black Friday Deals                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Final Fantasy I-VI Pixel Remaster Collection Is Back On Sale For Black Friday Price                         Nintendo Switch 2 Racing Wheel Set Drops To $20 For A Limited Time                         Asus ROG Xbox Ally Gets $110 Discount At Amazon                         Super Mario Galaxy: Rosalina's Storybook Gets 30% Price Cut At Amazon                         PSVR 2 Horizon Call Of The Mountain Bundle Is Still On Sale For All-Time Best Price    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]