[
  {
    "title": "Majority Control Of EA Could Shift To Saudi Arabia's Public Investment Fund - Report",
    "url": "https://www.gamespot.com/articles/majority-control-of-ea-could-shift-to-saudi-arabias-public-investment-fund-report/1100-6536660/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4615609-splitfiictionduo.jpg",
    "tag": "Gaming",
    "date": "2025-12-03T09:10:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          In September, Electronic Arts...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                In September, Electronic Arts revealed that there's a $55 billion deal in place to bring the company private under Jared Kushner's Affinity Partners, the private equity firm Silver Lake, and Saudi Arabia's Public Investment Fund. Now, a new report indicates that the PIF may be given near complete control of the company, because Saudi Arabia is putting up most of the money to complete the deal.According to The Wall Street Journal, EA's potential buyers have disclosed that PIF would be given 93.4% of EA in a document filed with Brazil's antitrust regulator. Silver Lake would only own 5.5% of the company, while Affinity would have a much smaller share: 1.1%. PIF is also a major investor in both Silver Lake and Affinity, which would leave it with more power over EA.WSJ notes that sovereign-wealth funds like the PIF normally make much smaller investments in buyouts like this one, while private-equity firms would take the lead as the primary owners and investors. Saudi Arabia has already invested in several video game companies, including Nintendo and Take-Two Interactive. In this year alone, Saudi Arabian-owned mobile developer Scopely purchased Niantic's video game division, the company behind Pokemon Go and other mobile titles.Senators Richard Blumenthal and Elizabeth Warren have raised their concerns about \"foreign influence\" on EA if the deal goes through. In a regulatory filing made in November, EA claimed it would retain creative control of the company following the conclusion of the sale.A subsequent report noted that PIF may be overextended and bleeding money from a number of questionable and pricey investments. Although that's not expected to scuttle the EA deal, the report indicated that even oil-rich Saudi Arabia may not be able to replenish the fund as fast as PIF is spending money. The PIF denied that report and stated that it still has $60 billion in cash and \"similar financial instruments.\"\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Judas Creator Sheds New Light On The Game's Main Character And Setting",
    "url": "https://www.gamespot.com/articles/judas-creator-sheds-new-light-on-the-games-main-character-and-setting/1100-6536652/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4615367-judas.jpg",
    "tag": "Gaming",
    "date": "2025-12-02T21:22:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Ken Levine's Judas has been in...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Ken Levine's Judas has been in development for a very long time, and it will be his first major project since BioShock Infinite's Burial At Sea DLC in 2014. A few of the gameplay elements we've seen from Judas greatly resemble BioShock's interface. But according to Levine, his team doesn't think of it as a first-person shooter. Instead, he called it a \"Judas simulator,\" since the main character's name is Judas.\"Judas ... understands machines in a way she can never understand people,\" wrote Levin in a developer's blog shared on PlayStation's official site. \"That became her greatest strength… and greatest weakness. We put her in a science fiction world, a colony ship filled with robots--a futuristic setting that makes someone like her extremely powerful. But it's also a world where personal success hinges on how well you can conform to the rules, because dissent would lead to the failure of the mission. That makes her an outlaw, a pariah--a Judas. That tension at the heart of the character came to inform everything about the game, which we stopped thinking of as an FPS and started calling a 'Judas Simulator.' Everything comes back to that core idea of you interacting with the world as Judas.\"Levine noted that Judas isn't overly fond of other people, but the game's narrative forces her to pick between three different leaders on the colony space ship called The Mayflower. Players' choices as Judas will determine which of the three will call her an ally, while the others condemn her as an enemy.Judas has previously been described as a procedurally generated roguelite set in a dynamically shifting open world. That open world is The Mayflower, and Levine noted that it is also dynamic in the game and design elements will be put in place based on choices made by the player.\"When assembling the layouts in game, the system has to understand the various buckets of puzzle pieces and the hierarchy of the content so it can stitch it together in a meaningful way that supports the storytelling,\" wrote lead artist Karen Segars, \"More exclusive and fancier places can have high ceilings, giant windows, and grand lobbies. But the Violator space is in the lower, grungy, underbelly of the ship and you have to take what we call the 'Stairway to Hell' to get to them--separating these spaces both visually and physically.\"Levine has stated that Judas will buck modern gaming trends by excluding live-service elements from the game. He also demonstrated how players will make friends and enemies among the three major characters.Judas doesn't currently have a release date.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Ball X Pit Hits 1 Million Copies Sold And Will Roll Out Three Free Updates Next Year",
    "url": "https://www.gamespot.com/articles/ball-x-pit-hits-1-million-copies-sold-and-will-roll-out-three-free-updates-next-year/1100-6536655/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1813/18138562/4615492-ballxpit.jpg",
    "tag": "Gaming",
    "date": "2025-12-02T22:48:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Devolver Digital wants to talk...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Devolver Digital wants to talk about balls. For starters, Ball X Pit just reached a new sales milestone, selling 1 million copies. But that's not all: Developer Kenny Sun is working on brand-new balls for the action-roguelite game, with three free updates on the way next year.The first new content planned for Ball X Pit is set to release in January with the Regal Update. The Shadow Update is scheduled to follow in April, with the Naturalist Update on the way in July. Devolver Digital says that each free major patch will include new balls, evolutions, and characters. A new trailer for the game--seen below--teases the upcoming updates.          In late October, Ball X Pit had sold 400,000 copies, meaning the game has more than doubled its sales over the past six weeks. The sales numbers come from copies sold on Nintendo Switch, Switch 2, PC, PlayStation 5, and Xbox Series X|S. Ball X Pit is also available on Xbox Game Pass, but the subscription service doesn't count toward traditional sales numbers.Ball X Pit sees players utilizing and fusing over 60 balls to defeat enemies in autoscrolling levels. Think of it as a spin on classic brick-bricking games, with an infusion of Vampire Survivors and Loop Hero. Additionally, when not rolling over baddies with balls, players will work on reconstructing  a town called New Ballbylon.For more, check out GameSpot's Ball X Pit review.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]