[
  {
    "title": "The Legend Of Zelda Live-Action Movie: Release Date, Cast, And Everything We Know About The Nintendo-Sony Movie",
    "url": "https://www.gamespot.com/gallery/the-legend-of-zelda-movie-release-date-trailer-story/2900-6252/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4603726-screenshot2025-11-17at10.15.12%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-11-17T15:17:00.000Z",
    "description": "By     Eddie Makuch   on November 17, 2025 at 7:17AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Eddie Makuch\n   on November 17, 2025 at 7:17AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Zelda heads to the big screenFollowing the massive success of Nintendo's The Super Mario Bros. Movie, which made more than $1.3 billion at the box office, Nintendo is returning with another animated Mario movie as well as a live-action The Legend of Zelda movie. The company is leaning into non-gaming projects like this as part of a planned effort to reach people in new ways outside of games.The Zelda movie is filming now in New Zealand, and it is a co-production between Nintendo and Sony Pictures, with Zelda creator Shigeru Miyamoto producing. Marvel veteran Avi Arad is another producer on the movie.Nintendo and Sony Pictures are co-financing the movie, with Nintendo's financial stake standing at more than 50%. Sony Pictures will distribute the film globally.In this post, we're rounding up everything we know about the Zelda movie.What is the Zelda movie about?Neither Nintendo nor production partner Sony Pictures have released the official plot synopsis for the Zelda movie. But it's a safe bet to guess that the movie will feature popular characters from the renowned RPG series, including Zelda and Link, as well as Ganondorf. The Zelda series is full of fantastical characters and environments, and it'll be interesting to see what kind of story Nintendo decides to tell, or if the film could be an adaptation of a specific game.A key difference between the Zelda movie and The Super Mario Bros. Movie (and its sequel) is that the Zelda movie is a live-action production as opposed to an animated feature film.When is the Zelda movie coming out?The Zelda movie was originally set for its premiere in March 2027, but Nintendo later delayed it to May 2027.That's about one year after The Super Mario Galaxy Movie comes out in April 2026, meaning there will be major Nintendo movies in theaters at least two years in a row. Nintendo has said it wants to ramp up its moviemaking efforts so it has a steady cadence of releases going forward. Who's going to be in the Zelda movie?In mid-July 2025, Nintendo confirmed the main actors for the Zelda movie. Zelda will be played by Bo Bragason, and Link will be portrayed by Benjamin Evan Ainsworth.\"I am pleased to announce that for the live-action film of The Legend of Zelda, Zelda will be played by Bo Bragason, and Link by Benjamin Evan Ainsworth. I am very much looking forward to seeing both of them on the big screen,\" veteran Nintendo developer Shigeru Miyamoto wrote in a social media post.An English actress, Bragason's first major role was in the 2017 television series Three Girls, and she also appeared in the 2021 horror film Censor. Since then, she has had several more roles in TV series and films. Interestingly, she also voiced a young version of the character Luna in Kingsglaive: Final Fantasy, a 2021 CG-animated film that tied in to Final Fantasy 15.Ainsworth is also an English actor, and his previous acting credits include The Haunting of Bly Manor, Flora & Ulysses, and Pinocchio.While not confirmed, it's rumored that Severance actor Dichen Lachman will appear in the movie as Impa.Is there a trailer for the Zelda movie?There is no trailer for the Zelda movie yet, and there likely won't be one soon. Rest assured, though, whenever a trailer is released, it'll be a big deal that gets the internet talking.Who's directing the Zelda movie?The live-action Zelda movie will be directed by Wes Ball, who is known for his work on the Maze Runner series and Kingdom of the Planet of the Apes. The filmmaker wants to swing for live-action Hayao Miyazaki aesthetics with The Legend of Zelda movie, as well as for it to \"feel like something real. It remains to be seen exactly what that means, however.Ball, the director, previously teased his vision for the Zelda movie. \"I have this awesome idea,\" he said. \"I've been thinking about it for a long freakin' time, of how cool a Zelda movie would be... I want to fulfill people's greatest desires. I know it's important, this [Zelda] franchise, to people and I want it to be a serious movie. A real movie that can give people an escape.\"What about that Zelda TV show?Years ago, it was reported that Nintendo and Netflix were in discussions for a live-action Zelda TV series. It was reported that the TV show was aiming to be \"Game of Thrones for a family audience.\" Nintendo responded to the report, but never flat-out denied it. In any event, though, a live-action Zelda TV show is not happening anytime soon.Leaks from set Filming for the Zelda movie began in November 2025 in New Zealand. Someone appeared to have gotten close enough to the set to film some video, providing a first glimpse at the production.Nintendo releases the first official imagesFollowing the leaks, Nintendo officially announced the start of production in an update to the Nintendo Today app on November 17. Nintendo also released the first production stills, and they are quite spectacular.    \n  \n                      "
  },
  {
    "title": "Asus To Ramp Up Rog Xbox Ally Production After Initial Sales Exceed Expectations",
    "url": "https://www.gamespot.com/articles/asus-to-ramp-up-rog-xbox-ally-production-after-initial-sales-exceed-expectations/1100-6536270/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4603720-xbox.jpg",
    "tag": "Gaming",
    "date": "2025-11-17T14:29:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          The new line of Rog Ally...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                The new line of Rog Ally devices made by Asus in partnership with Microsoft and Xbox have exceeded expectations, and Asus is now undertaking efforts to ramp up production to meet demand.Asus management said during the company's latest earnings briefing that the new Xbox-branded devices have seen an \"extremely positive\" response from the market, \"exceeding expectations.\"Some balked at the $600 and $1,000 price-points for the Rog Xbox Ally and Rog Xbox Ally X devices, but Asus said the market has spoken and there is demand for \"premium, higher-end models\" of the Rog Ally.\"These high-ended variants are currently in short supply. We are working closely with key component suppliers to ramp up production and fill the demand gap that exists. Our goal with the Rog Ally is for it to remain a core pillar within the Asus gaming portfolio,\" the company said, as reported by Windows Central.GameSpot's Rog Xbox Ally review said the system is good hardware let down by annoying software. Reviewer Tamoor Hussain wrote, \"Where the Steam Deck feels like it can be a dedicated, primary, and only gaming platform that you'll have a seamless and slick experience akin to a console, the Xbox Ally very much feels like it functions best as an extension of PC ecosystems, whether that's Steam, Xbox, or any other.\"\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Gabe Newell Gets New 363-Foot Superyacht With Hospital And 15 Gaming PCs On Board",
    "url": "https://www.gamespot.com/articles/gabe-newell-gets-new-363-foot-superyacht-with-hospital-and-15-gaming-pcs-on-board/1100-6536271/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1813/18138562/4603718-gabenewell.jpg",
    "tag": "Gaming",
    "date": "2025-11-17T14:44:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          It's not every day that a...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                It's not every day that a billionaire gets a new superyacht and the chance to unveil a new video game console. But Valve co-founder Gabe Newell experienced just that last week. On November 12, Newell received his new luxury boat--a diesel-electric yacht that's over 360 feet long--from Oceanco. It's named Leviathan and was delivered the same day that the Steam Machine was revealed.The Leviathan has a hospital, science lab, dive center, hot tub, basketball court, and 15 \"gaming stations.\" That's not all for video games, either, as there are two racing simulators to take for a spin on the superyacht. It's unknown if a Steam Machine is on board--or even some form of Half-Life 3.\"Yachts have great potential to serve as platforms for scientific research,\" said Newell. \"It's about recognizing that you're part of a broader community and ensuring the yacht's presence adds value to the communities around it.\"Valve cofounder took delivery of this superyacht named Leviathan last week. Photo courtesy of Oceanco For those unaware, Newell spends most of his time living on a yacht. Earlier this year, Newell discussed his daily routine, which included up to two daily sessions of scuba diving. Forbes estimates that he's worth up to $11 billion, and the Leviathan isn't his only yacht. In August, Newell actually bought Oceanco.When asked about all of his success, Newell has pointed to luck and \"being surrounded by really great people.\" Last week, Valve announced more than just the Steam Machine. The company also pulled back the curtain on the new Steam Controller and Steam Frame, a VR headset. It's unknown how much the Steam Machine will cost when it arrives early next year.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]