[
  {
    "title": "The Best Shooter Games Of 2025 According To Metacritic",
    "url": "https://www.gamespot.com/gallery/the-best-shooter-games-of-2025-according-to-metacritic/2900-7350/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4623852-mc-shooter-games-main.jpg",
    "tag": "Gaming",
    "date": "2025-12-20T17:00:00.000Z",
    "description": "By     Darryn Bonthuys   on December 20, 2025 at 9:00AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Darryn Bonthuys\n   on December 20, 2025 at 9:00AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Times and trends may change, but if there's one constant in the gaming industry, it's that shooters are popular. It's an evergreen draw for many players, but these days, shooter games are becoming more experimental as they mingle with other game genres.According to our sister-site Metacritic, several wildly different games were built around a core shooter gameplay component, as we saw guns used for both offense and momentum in Shotgun Cop Man, used them to solve puzzles in games like Revenge of the Savage Planet, and watched adorable ducks go to war. This year also saw several remasters and reborn arcade classics rise to the top, and you can see the complete list below for yourself.You can also check out the Metacritic rankings for the best co-op games and the best RPG games of 2025, as well as several more of GameSpot's best-of lists. For more on this genre, check out our running list of the best shooters and best first-person shooters to play right now.More Best Of 2025:Best of 2025 hubWhy Clair Obscur: Expedition 33 Is GameSpot's GOTY 2025GameSpot's 10 Best Games of 2025The Best PS5-Exclusive Games Of 2025The Best Nintendo Switch And Switch 2 Exclusives Of 2025The Best-Reviewed Games Of 20252025's Biggest Gaming News: Banned Games, GTA 6 Delayed, Price HikesDeep Rock Galactic: SurvivorWatch out, Vampire Survivors: a new challenger has emerged in the bullet-heaven genre. Deep Rock Galactic: Survivor has used its time in early access well, fleshing out its Survivors-like systems of auto-firing weapons and upgrades to sing with precision destruction, but it's the procedurally generated stages where players can make use of cunning tactics to triumph that helps seal the deal on this fun DRG spin-off.Metascore: 86Heretic + HexenBoomer-shooters have become a popular genre over the last few years, but the original '90s games they're inspired by still have plenty of magic. That's an apt description for Heretic + Hexen, as Nightdive Studios' polished remaster of these classic games is full of thoughtful tweaks, visual upgrades that preserve the retro look, and new content for good measure.Metascore: 86Arc RaidersArc Raiders arrived near the end of 2025 after a busy year and launched into a busy genre already dominated by some titans, and it took over the conversation. With incredibly smart AI enemies, reliable, satisfying third-person gunplay, and a collection of expansive maps that lend themselves to remarkable surprises in every round, it'll be remembered as one of the games that made 2025 what it was.Metascore: 86 | Read our Arc Raiders reviewEarthionFew things in video games are quite as retro as the old-school horizontal shoot-'em-up. Earthion pays tribute to the shmups of yesteryear with its arcade-inspired design, while also adding in a few clever ideas of its own that other games in the genre could learn from. The upgrade system keeps things interesting in each run, boss fights will make you sweat, and each stage has enough variety to keep you on your toes.Metascore: 85System Shock 2: 25th Anniversary RemasterIt might have taken a while to see the light of day, but the 25th-anniversary remaster of System Shock 2 was worth the wait. Another win for Nightdive Studios, the developer makes only a few gameplay changes and adds a light touch to the graphics, but this less-is-more mentality helps highlight just how far ahead of the curve System Shock 2 was all the way back in 1999.Metascore: 84Gradius OriginsAnother charming shmup for fans, Gradius Origins is aimed squarely at those who grew up with these 2D shooters. It's a lovingly crafted tribute to old-school Gradius and its spin-offs, enhanced by a suite of customization options and game prototypes thought to be lost to time.Metascore: 84Battlefield 6It took a few tries, with some relative highs and lows in between, but Battlefield 6 feels like it's the series' return to form. With its huge maps, compelling class-based roles and warfare, and a free-to-play battle royale bringing in new players all the time, Battlefield 6 is Battlefield operating at peak performance.Metascore: 84 | Read our Battlefield 6 reviewDoom: The Dark AgesAs a prequel, Doom: The Dark Ages not only sent the infamous Doom Slayer back in time to slaughter endless hordes of demons, but also radically altered the core gameplay loop id Software's series had used since 2016. It was a bold decision that could have been disastrous, but the new focus on parrying attacks and battling enemies with your boots (mostly) on the ground gives The Dark Ages a unique flavor--and the executions are still violent enough to make Mortal Kombat's developers wince.Metascore: 83 | Read our Doom: The Dark Ages review.The Outer Worlds 2The Outer Worlds 2 checks many boxes for a sequel: It's a bigger and bolder version of the first game, but under the hood, combat has been meaningfully improved, and missions give plenty of excuses to let the lasers fly. Obsidian Entertainment's return to a galaxy on the precipice of ruin thanks to out-of-control corporations feels sharper than ever thanks to its polished design and fine-tuned RPG systems.Metascore: 83 | Read our The Outer Worlds 2 reviewPowerWash Simulator 2Why shoot bullets when you can cathartically blast your troubles away with some high-pressure water instead? PowerWash Simulator 2 is essentially more of the same grime-fighting, but some serious improvements have been made, and it's still a chill experience that's in a class of its own thanks to its fluid gameplay.Metascore: 82 | Read our PowerWash Simulator 2 reviewBorderlands 4While a smidge of an overcorrection to Borderlands 3's formula, Borderlands 4 is altogether an entertaining first-person shooter where you chase loot, craft rewarding builds, and unleash colorful mayhem for hours and hours. The game sees you play as one of four Vault Hunters who are trying to free a planet from the tyrannical rule of The Timekeeper in hopes of finding and looting the treasure-filled Vault that he's guarding.Metascore: 81 | Read our Borderlands 4 reviewReady or NotReleasing in its 1.0 state helped elevate Ready or Not from a sleeper hit on Steam to a mainstream success. In this extremely realistic first-person SWAT sim, you'll be called to active crime scenes and have to put all of your extensive training to the test, minimizing casualties both to your squadmates and innocent bystanders. Each level is incredibly tense, so check those corners.Metascore: 80Metroid Prime 4: BeyondMetroid Prime fans have been waiting a long time for a new entry in the series, and Metroid Prime 4: Beyond doesn't disappoint. While there are a few archaic elements to grapple with, Samus Aran's new adventure still sticks the landing with its exciting gunplay, stunning level design, and a soundtrack that pulses with each arm-cannon blast.Metascore: 80 | Read our Metroid Prime 4: Beyond reviewShotgun Cop ManFew things in life are better than a power-fantasy game that tasks you with delivering ballistic kisses to evildoers, and Shotgun Cop Man excels at making you feel you're dual-wielding weaponized fun. It's a short and goofy game where you're asked to chase down the devil, but innovative level design and unique projectile-based movement make it an instant classic.Metascore: 80Neon InfernoNostalgia continues to be one of the most powerful forces of attraction that science can't explain, and with Neon Inferno, you've got a '90s-inspired game that looks and plays like something that would be right at home on an SNES console. A stylish cyberpunk game with a strong blend of 2D shooting and platforming, it's a retro romp that oozes style.Metascore: 80Rainbow Six Siege XTen years later, Rainbow Six Siege is still the gold standard for tactical team-based shooters. This year's big update and the move to a free-to-play model made it the perfect time to jump into Ubisoft's popular shooter, thanks to better onboarding systems, the delightfully engaging Dual Front mode, and polished gunplay honed from a decade of play.Metascore: 79Gears of War: ReloadedJust how good was the original Gears of War? Good enough to still be a blast of cover-based shooting fun 20 years later and with two remasters under its belt. While Gears of War: Reloaded is essentially a marginal improvement over 2015's Gears of War: Ultimate Edition, the few improvements added to this edition still make the classic third-person-action game a slick and smooth experience that'll make you think you've been transported back in time to 2006. Nice.Metascore: 79Dune: AwakeningDune: Awakening isn't the kind of game that encourages you to go in guns blazing when you spot a giant sandworm, but it's still a key component in the grand scheme of things. Existing harmoniously with other aspects of the game, Dune: Awakening is a faithful adaptation of the original Frank Herbert novels and one of this year's best survival-MMO games.Metascore: 78 | Read our Dune: Awakening review Days Gone RemasteredIf Days Gone didn't win you over the first time, it's unlikely that this remastered version will convince you to stick with it. An interesting but flawed exclusive from the PlayStation vault, Days Gone Remastered adds several welcome tweaks, with the big draw being the Horde Assault mode--a wave-based run-and-gun diversion that'll make you spend and sweat bullets.Metascore: 78Escape From DuckovOn the opposite side of the Escape from Tarkov spectrum, there's the delightfully named Escape from Duckov. You'd be forgiven for thinking that it's a quick attempt to cash in on the popularity of Escape From Tarkov, but at its core, Escape from Duckov is a genuinely fun parody of extraction shooters. Its core gameplay loop of raiding and extracting loot is a solid, refined package, adding several ideas of its own to the mix.Metascore: 77R-Type Delta: HD BoostedShoot-'em-up fans have been waiting a long time for R-Type Delta to make a return, as the PS1 classic has been left to gather dust since its last port back in 2009 for the PS3. R-Type Delta: HD Boosted brings the classic roaring back to life on modern consoles and PC, mixing exciting action with a tight gameplay loop, a killer soundtrack, and plenty of ship variety.Metascore: 77BladechimeraBladechimera doesn't rewrite the metroidvania playbook, but this satisfying blast of bullets and Castlevania: Symphony of the Night-inspired action excels at being a rock-solid action game. It's predictable but fun, digital comfort food that features cool cyberpunk themes, nostalgic pixel art, and robust gameplay.Metascore: 77Deadpool VRLast year saw Batman: Arkham Shadow pave the way for surprisingly great virtual-reality superhero games, and this year, Deadpool continued that trend. It's a surprisingly colorful dive into the headspace of Marvel's merc with a mouth--who is expertly brought to life by Doogie Howser himself, Neil Patrick Harris--and the gameplay does a solid job at making you feel like an almost-unkillable smartass armed to the teeth.Metascore: 76Revenge of the Savage PlanetBuilding on the foundation set by Journey to the Savage Planet, Revenge of the Savage Planet is a confident and creative follow-up to the 2019 game. While combat can become chaotic from time to time, it's the exploration, puzzle-solving, and cheeky satire all bundled up in a colorful space-adventure package that makes Revenge of the Savage Planet shine.Metascore: 76  | Read our Revenge of the Savage Planet reviewSniper Elite: ResistanceRebellion has made a name for itself mostly on its series of games that lets you explode the testicles and/or brains of Nazis, and Resistance doesn't stray far from that blueprint other than presenting players with a new playable character. Still, I guess there's something timeless about eradicating Nazis, isnt' there?Metascore: 75 | Read our Sniper Elite: Resistance reviewFragPunkIf Counter-Strike feels like it's passed you by, or maybe you're just looking for a new spin on the tense PvP formula it popularized, look no further than FragPunk. In this team-based PvP game, you'll navigate small, nerve-racking maps to plant or defuse bombs, but with an added twist of card-based modifiers, so no two rounds are ever the same.Metascore: 74Galactic GlitchTwin-stick shooters don't get enough love, but Galactic Glitch makes a strong case for the genre by adding some roguelike ingredients to the recipe. The result is an enjoyable sci-fi odyssey where you gradually increase your power and experiment with an impressive selection of tools.Metascore: 74Bounty StarIt's a scientific fact that mechs make everything better, and that's an idea that comes to life in Bounty Star. A game about catching crooks and tending to your crops, Bounty Star is a surprisingly meditative combination of combat and agriculture that's capped off by a touching story of hope and redemption.Metascore: 74AtomfallTo describe Atomfall as British Fallout would be a disservice to the game. Yes, it's clearly inspired by Bethesda's post-nuclear war series, but Atomfall goes above and beyond to offer a sense of freedom to players who find themselves caught inside a quarantine zone in an alternate-reality England that is still reeling from a mysterious nuclear accident. It rises above the Fallout comparisons with its gripping story, challenging action, and wonderfully weird mysteries.Metascore: 74 | Read our Atomfall review Mafia: The Old CountryThough its gameplay sections can feel a bit dated at times, this prequel set in the Mafia franchise ends up being a serviceable third-person shooter that more than makes up for that faint praise with a story that could stand up to anything else released this year. Marvelously written characters bring old-world Italy to life in this period-set mobster drama.Metascore: 73 | Read our Mafia: The Old Country reviewMetal EdenThe best boomer-shooters excel at making you feel like a one-man army: a sensation that Metal Eden excels at. Featuring some of the best gunplay of the year, the game's combat more than makes up for its shortcomings in the narrative department, making for a short and sweet romp.Metascore: 73WildgateSet in space and inspired by Sea of Thieves' PvP ship battles, Wildgate has you and a ragtag crew of space pirates chasing down rare artifacts and trying to escape with your life--and riches--before other crews can do you in. Wildgate may have been overshadowed by Arc Raiders when it comes to the year's biggest extraction shooters, but it's also quite different and is worth its own investment.Metascore: 72Escape From TarkovOn paper, Escape From Tarkov sounds like an anti-game. It's brutally unforgiving, and its online community won't hesitate to drop a magazine of digital bullets into your back. But that's what makes the game so exciting to begin with: Its survival gameplay and layered approach to preparing for the worst make each hard-earned victory feel that much more meaningful.Metascore: 72RoboCop: Rogue City - Unfinished BusinessRoboCop: Rogue City was an authentic adaptation of the classic action movies, but also a strangely paced adventure, with challenging levels bookended by boring downtime at the Metro West police precinct. Unfinished Business addresses Rogue City's creative flaws, as it throws players into a skyscraper populated with mercenaries, killer androids that RoboCop 3 fans will recognize, and several new toys with which to violently dispense justice.Metascore: 71AbyssusIn case you aren't tapped out from the roguelite genre, Abyssus is a fast and furious first-person dive into the genre. Set in an underwater kingdom, the game checks all the boxes for a roguelite game, mixing those mechanics with fast-paced gunplay that feels gratifying to unleash when you start to combo it with the right skills.Metascore: 71    \n  \n                      "
  },
  {
    "title": "The Best Switch Games Of 2025 According To Metacritic",
    "url": "https://www.gamespot.com/gallery/the-best-switch-games-of-2025-according-to-metacritic/2900-7357/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4624572-mc-switch-main.jpg",
    "tag": "Gaming",
    "date": "2025-12-21T17:00:00.000Z",
    "description": "By     Jordan Ramée  ,     Gabe Gurwin  , and     Darryn Bonthuys   on December 21, 2025 at 9:00AM PST                                GameSpot may receive revenue from affiliate and advertising...",
    "body": "\n                            \nBy \n    Jordan Ramée\n  , \n    Gabe Gurwin\n  , and \n    Darryn Bonthuys\n   on December 21, 2025 at 9:00AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Between the launch of a new console and multiple first-party releases, 2025 was a pretty big year for Nintendo. The Switch 2 got off to a roaring start, but the original Switch family of consoles wasn't forgotten about this year, as Nintendo ensured several of its biggest releases were also playable on it. Metroid Prime 4: Beyond and Pokemon Legends: Z-A were playable on the older hardware, while other legacy games like The Legend of Zelda: Breath of the Wild and Tears of the Kingdom were upgraded for the Switch 2.Between those new releases and expanded versions of old favorites, we also saw third-party games launch for the Switch 2. Developers like Ubisoft and CD Projekt Red delivered high-quality versions of Star Wars Outlaws and Cyberpunk 2077 to the hybrid console, while indie studios focused on gameplay over raw visual horsepower to stand out from the pack. More of a transitional year than a revolutionary one when compared to the launch of Nintendo consoles like the Wii, Wii U, and the original Switch, 2025 saw the company play it safe as it built on the successes of the previous console generation.To see which of the hundreds of Switch and Switch 2 games made it to the top, you can check the list below. Our sister site Metacritic has crunched all the numbers below, and the final list at the time of writing is an impressively varied selection of games. For more of these features, you can check out our galleries focused on the best RPGs, co-op games, and shooters of the year. We also have our own curated list of the best Switch-exclusive games of 2025, as well as the best Switch and Switch 2 games to play right now.More Best Of 2025:Best of 2025 hubWhy Clair Obscur: Expedition 33 Is GameSpot's GOTY 2025GameSpot's 10 Best Games of 2025The Best PS5-Exclusive Games Of 2025The Best Nintendo Switch And Switch 2 Exclusives Of 2025The Best-Reviewed Games Of 20252025's Biggest Gaming News: Banned Games, GTA 6 Delayed, Price HikesThe Legend of Zelda: Tears of the Kingdom Switch 2 EditionVisually, The Legend of Zelda: Tears of the Kingdom is a marked improvement on the Switch 2 thanks to an increased resolution and HDR support. But it's the thoughtful upgrades that complement the core gameplay that go a long way toward making a great game even better.Metascore: 95The Legend of Zelda: Breath of the Wild Switch 2 EditionJust like Tears of the Kingdom, Breath of the Wild looks and plays significantly better on the Switch 2. It's the definitive version of one of the greatest Legend of Zelda games of all time, and an almost mandatory upgrade for anyone who already owns the Nintendo masterpiece.Metascore: 95Hades 2Supergiant Games has built a reputation for developing high-quality games consistently, but now the studio can add another feather to its hat: It knows how to make a damn good sequel. Hades 2 isn't just a sequel that's bigger and better than its predecessor; it's a game full of twists and surprises, redefining what a roguelite can be with its refined combat and innovative buildcrafting.Metascore: 95 | Read our Hades 2 reviewDonkey Kong BananzaWell over 20 years since his last venture into the third dimension, Donkey Kong made a very impressive return. Donkey Kong Bananza is a delightful and destructive take on 3D platforming with secrets and little nuggets of joy around every corner--or buried deep beneath the surface for you to uncover through pure brawn and willpower.Metascore: 91 | Read our Donkey Kong Bananza review.Hollow Knight: SilksongThe wait was long, but well worth it--Hollow Knight: Silksong takes the formula established in Team Cherry's 2017 metroidvania and pushes it even further. This time, you play as Hornet, the deuteragonist of the first game, as you climb to the top of a kingdom largely defined by music and song and seemingly infected with mind-controlling silk. The journey is one full of hardship, tests of faith, and one warrior princess' exploration of her heritage, and it's one of our favorite stories and experiences of 2025.Metascore: 90 | Read our Hollow Knight: Silksong reviewTrails in the Sky 1st ChapterThe Trails series is a must-play for any fan of RPGs, but with decades of games in this series, where does one even start? Right at the beginning, thanks to this well-polished remake of the very first game. It's Trails at its best, as the game's classic story about headstrong heroes on a quest to save the day benefits tremendously from upgraded visuals and gameplay.Metascore: 90 | Read our Trails in the Sky 1st Chapter reviewAbsolumBlending old-school brawling with swords-and-sorcery flair, Absolum is a satisfying mix of traditional brawling and roguelike progression. The fantasy-themed brawler leans fully into both genres, making each run in its visually striking world compelling and easy to lose track of time.Metascore: 89 | Read our Absolum reviewBall x PitArkanoid-inspired block-breaking with the satisfying investment of roguelite growth, Ball x Pit is literally the best balls-to-the-wall game of 2025. The pinball-esque combat is engrossing, the character variety makes each run feel different, and the interconnected base-building system adds another layer of gratification.Metascore: 89 | Read our Ball x Pit reviewSplit FictionThere's a highlight reel of moments that consistently make Split Fiction stand out from the pack, as the game is brimming with creative energy. Constantly reinventing itself and breaking its own rules, there's never a dull moment with this co-op adventure.Metascore: 89 | Read our Split Fiction reviewPipistrello and the Cursed YoyoWho says a Zelda-like game has to take place in a fantasy setting? Pipistrello and the Cursed Yoyo is an exception to that rule, and while it looks like your typical adventure game with Game Boy Advance-inspired visuals, the yo-yo gameplay, inventive challenges, and superb level design combine to create one of the best games of the year.Metascore: 88Street Fighter 6Street Fighter 6 is the gold standard for modern fighting games, combining a wild art direction with gameplay welcoming to players of any skill level. There's nothing better than going a few rounds with friends in this fisticuffs masterclass, and on Switch 2, Capcom's decision to optimize performance makes for a buttery-smooth experience.Metascore: 87Super Mario Galaxy 1 + 2Whether you've toured the cosmos before or you're taking your first leap off of a planet, it simply doesn't get any better than the Mario Galaxy games. Still considered to be two of the mustachioed plumber's most incredible adventures, Mario Galaxy 1 and 2 made a big return to Switch consoles in 2025, giving fans an out-of-this-world package of masterfully crafted 3D platformers.Metascore: 87Atelier Ryza Secret Trilogy Deluxe PackThe Ryza era of the long-running Atelier series has been a consistent highlight, and this trilogy of games featuring the plucky protagonist proved to be the definitive entry point to this sub-series. Packed with new content and previously released DLC, it's hard to say no to three beloved JRPGs bundled into one convenient package.Metascore: 87Ninja Gaiden: RageboundBetween a sharp remaster of a Ninja Gaiden classic and a brand-new game in the mainline series, you'd be forgiven for thinking that a retro-inspired spin-off would be overshadowed. That's where you'll find yourself pleasantly surprised, as this return to the 2D roots of Ninja Gaiden is a treat for the senses and a challenge for your thumbs, thanks to combat that is both challenging and satisfying to master.Metascore: 87 | Read our Ninja Gaiden: Ragebound reviewFinal Fantasy Tactics: The Ivalice ChroniclesVideo games have changed a lot in the decades since Final Fantasy Tactics, but its political-thriller storyline, enduring tactical turn-based gameplay, and innovative Jobs system still feel relevant in the modern age. A timeless game with a fantastic tale of intrigue, the smart enhancements in this new version of the classic make it easy to recommend to series veterans and newcomers alike.Metascore: 87 | Read our Final Fantasy Tactics: The Ivalice Chronicles reviewXenoblade Chronicles X: Definitive EditionOpen-world games are commonplace these days, but back in 2015, Xenoblade Chronicles X showed just how deep the genre could be with its breathtaking world design. Xenoblade Chronicles X: Definitive Edition is a reminder of how the original game prioritized a sense of freedom in exploring the planet of Mira, while much-needed quality-of-life enhancements improve its already-stellar combat and performance.Metascore: 87Mario Kart WorldAt long last, the confines of the racetrack do not define Mario Kart. Mario Kart World takes the series' classic kart racing and puts it in a fully explorable open world, adding a nice dose of discovery and charm without sacrificing the excellent core racing experience from the series' past. It's one of the strongest launch titles in Nintendo's history and an absolute joy to play.Metascore: 86 | Read our Mario Kart World reviewHeretic + HexenNightdive Studios continues to be the go-to developer for retro revivals, and it didn't disappoint in 2025 with its resurrection of Raven Software's '90s shooters. Heretic and Hexen got all the improvements you'd expect from Nightdive, but thoughtful tweaks to the gameplay, a remixed soundtrack, and bonus material made this another gratifying revamp.Metascore: 86Fantasy Life i: The Girl Who Steals TimeA wholesome escape to the countryside, Fantasy Life i: The Girl Who Steals Time let's you experience the dungeons and farmlands of Ginormosia at your own pace. Whether you're exploring tombs for treasure or building a local community, the choice is up to you on how to spend your hours in this easygoing RPG.Metascore: 86Shotgun Cop ManA perfect game for anyone who's strapped for time, Shotgun Cop Man is an action-platformer that never outstays its welcome. It's full of surprises across the 10 worlds you'll explore via projectile-based movement, constantly reinventing the wheel as you chase down the devil and high scores.Metascore: 86Mario Kart WorldWith the release of the third and fourth chapters, Deltarune from Undertale creator Toby Fox feels like it's shifting into high gear as it reaches the halfway mark. It's an RPG that's absurd and wild in the best ways, subverting expectations and weaving a campaign full of insightful questions and unsettling themes.Metascore: 86Dragon Quest 1 & 2 HD-2D RemakeA lavish remake of the classic Dragon Quest games using Square Enix's signature 2D-sprite-on-3D-background aesthetic, Dragon Quest 1 & 2 HD-2D Remake is a thorough modernization of two influential JRPGs. At the same time, the updates go far beyond mere mechanical polish, with thoughtful touches across the board that create a richer, nostalgic experience.Metascore: 85 | Read our Dragon Quest 1 & 2 HD Remake reviewYakuza 0: Director's CutThe Yakuza franchise is as hard to keep down as the Dragon of Dojima in a street fight, and Yakuza 0: Director's Cut brought one of the best games in the series to Switch 2. Outside of a new multiplayer game mode and some extra story content, it's Yakuza 0 as you remember it: an intense and nail-biting gangland drama starring two iconic gangsters during their formative years.Metascore: 85Cyberpunk 2077: Ultimate EditionIt took quite a long time for the game to be worth playing on other platforms, but Cyberpunk 2077: Ultimate Edition delivered a fantastic Switch 2 experience from launch day. The game and its excellent Phantom Liberty expansion are excellent on Switch 2, and the additional control options and portability make it arguably the best place to experience it all.Metascore: 85Ender Magnolia: Bloom in the MistEnder Magnolia: Bloom in the Mist doesn't revolutionize the metroidvania genre, but it does combine its rock-solid gameplay with elegant visuals and a stirring soundscape. It makes a strong case for why games can be artistic triumphs in this confident follow-up from developer Live Wire.Metascore: 85Shinobi: Art of VengeanceReturning after such a long time away--14 years in this case--can be tricky for any game series, but Shinobi: Art of Vengeance might as well be an instruction manual for doing it well. The action-platformer balances difficulty with approachability to tremendous effect, and the stylized 2D art is a perfect fit for the series.Metascore: 85 | Read our Shinobi: Art of Vengeance review.Tony Hawk's Pro Skater 3 + 4Following up one of the best remakes ever … remade … is never an easy task, especially when the original studio is no longer involved. Iron Galaxy was certainly up to the challenge with Tony Hawk's Pro Skater 3 + 4, taking over from Vicarious Visions and delivering two excellent (if occasionally unfaithful) remakes of classic skateboarding games. And these ones are great without even having \"Superman\" on the soundtrack!Metascore: 85 | Read our Tony Hawk's Pro Skater 3 + 4 review.The Hundred Line: Last Defense AcademyIn a year dominated by games like Clair Obscur: Expedition 33 and Hollow Knight: Silksong, it's downright criminal how The Hundred Line: Last Defense Academy has been overlooked in GOTY discussions. A wild mix of Danganronpa-inspired storytelling and deep tactical-RPG gameplay, the game is a timesink of impressive scale and ambitious design.Metascore: 85Bravely Default: Flying Fairy HD RemasterInitially released for the 3DS in 2012, turn-based RPG Bravely Default got a fresh lease on life this year as a Switch 2 launch game. It's everything you'd expect from a modern-day remaster--better visuals and quality-of-life updates--and its deep combat system has stood the test of time. Throw in its quirky cast of characters, fine-tuned characters, and Switch 2-exclusive features, and you've got a charming JRPG to play on the go.Metascore: 84    \n  \n                      "
  },
  {
    "title": "NBA Jam Deluxe Arcade Cabinet On Sale For Lowest Price Ever At Amazon",
    "url": "https://www.gamespot.com/articles/nba-jam-arcade1up-deluxe-home-arcade-cabinet-best-deal/1100-6537125/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4626867-nbajamdeluxethumbnail.jpg",
    "tag": "Gaming",
    "date": "2025-12-21T08:43:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               Nostalgic NBA Jam fans can save big on Arcade1Up's home arcade machine featuring the classic 2v2 basketball game. The NBA Jam Deluxe Arcade Cabinet is on sale for an all-time low price of $400 (was $500) at Amazon and Best Buy. The $100 discount is one of several notable last-minute holiday deals on Arcade1Up machines. We've included a list of the other Arcade1Up deals at the bottom of this story.                                 Arcade1Up NBA Jam Deluxe Cabinet                                                                $400 (was $500)                                                                                                                                                                                    The NBA Jam Deluxe Cabinet is preloaded with three classic arcade basketball games developed by Midway from 1993-1996: NBA Jam, NBA Jam Tournament Edition, and NBA Hangtime.The control deck has two sets of inputs: one arcade stick and three buttons for each player. In addition to local multiplayer, you can play against users around the world over Wi-Fi. Like other Deluxe editions from Arcade1Up, it has a 17-inch HD display, light-up marquee, dual stereo speakers, and a faux coin door on the front.The cabinet is roughly 61.5 inches tall, just under 19 inches wide, and weighs approximately 62 pounds. If you want to sit while playing, Amazon has a limited-time deal on this popular adjustable bar stool with a backrest.Arcade1Up has manufactured several NBA Jam cabinets over the past five years, but the Deluxe Edition is the only model in stores today. Outside of Arcade1Up cabinets, NBA Jam has been dormant for nearly 15 years; the last home console entry, NBA Jam: On Fire Edition, released on PS3 and Xbox 360 in 2011. Thankfully, Arcade1Up's NBA Jam cabinet offers an authentic way to revisit the best entries in the series.                                                                                                                                                                      NBA Jam debuted exclusively in arcades in 1993 and was ported to consoles the following year. The Tournament Edition, which launched in 1994, is essentially an updated and expanded version of the original NBA Jam. As the name suggests, the main addition was Tournament mode. It's still 2v2 basketball, but Midway added a third player to each team, allowing you to make substitutions throughout each game. The Tournament Edition also expanded player stat categories.NBA Hangtime was developed by the same team at Midway, just with a different title because the NBA Jam moniker was sold to Acclaim Entertainment. Midway once again expanded the rosters to five players and introduced a custom player creator, but NBA Hangtime is still very much an NBA Jam game.Arcade1Up 2025 Holiday DealsArcade1Up Home Arcade CabinetsDeluxe Cabinet: Fast & the Furious (2 Games) -- $500 ($600)Deluxe Cabinet: Pac-Man (14 Games) -- $450 ($500)Deluxe Cabinet: NBA Jam (3 Games) -- $400 ($500)Classic SE Cabinet: Mortal Kombat II (13 Games) -- $284 ($334)Classic SE Cabinet: Pac-Man (13 Games) -- $284 ($334)Classic SE Cabinet: Ms. Pac-Man (13 Games) -- $284 ($334)Classic SE Cabinet Riser -- $39 ($60)Countercade: Ms. Pac-Man / Galaga (3 Games) -- $130 ($150)Countercade: Pac-Man (3 Games) -- $130 ($150)Full-Size Claw Machine (12 Capsules) -- $500 ($550)Two other Arcade1Up Deluxe Cabinets are on sale at Amazon and Best Buy. The Fast & the Furious is discounted to $500 (was $600); this home arcade cabinet has two games and traditional racing wheel/floor pedal controls. The Pac-Man Deluxe Cabinet is discounted to $450 (was $500) and features 14 arcade classics from Namco.You can also save $50 on all three Arcade1Up Classic Special Edition Cabinets, including Mortal Kombat II from Midway Games, the same studio behind NBA Jam. To make these cabinets as tall as the Deluxe models, you'll need to buy the official Riser, which is on sale for $39 (was $60). Check out our story on Arcade1Up's budget-friendly Classic Special Edition cabinets for more details.For an even more affordable option, take a look at the Pac-Man and Ms. Pac-Man / Galaga Countercades for $130 (was $150).Sign up for GameSpot's Weekly Deals Newsletter:                                Arcade1Up Classic Special Edition Mortal Kombat Cabinet Gets First Discount                         Nintendo Switch 2 Samsung 256GB MicroSD Express Card On Sale For Only $33                         Target's Best Exclusive Lego Sets Get Rare Holiday Discounts                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Xbox Elite Series 2 Controllers On Sale For Even Better Prices Than Black Friday Deals                         Final Fantasy I-VI Pixel Remaster Collection Is Back On Sale For Black Friday Price                         Nintendo Switch 2 Racing Wheel Set Drops To $20 For A Limited Time                         ROG Xbox Ally Gaming Handheld Is On Sale For Only $489 For A Limited Time                         Super Mario Galaxy: Rosalina's Storybook Gets 30% Price Cut At Amazon    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n        \n\t\n\t\tLatest in\n\t\tNBA Jam\n\t\n\n\n            \n    "
  }
]