[
  {
    "title": "When Does Pokemon Legends: Z-A Launch? Release Times Revealed For Switch 2",
    "url": "https://www.gamespot.com/articles/pokemon-legends-za-release-times/1100-6535439/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4585643-screenshot2025-10-15at8.20.36%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-10-15T12:11:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Pokemon Legends: Z-A is set for...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Pokemon Legends: Z-A is set for release on Thursday, October 16, but when exactly can you start playing? The global launch times for the upcoming Switch exclusive have now been posted.The game launches on October 16 at midnight Eastern, which works out to 9 PM PT and 11 PM CST on Wednesday, October 15. You can see the full release times below, as posted by IGN.Pokemon Legends: Z-A release times:Wednesday, October 15, 20259 PM PT11 PM CSTThursday, October 16, 202512 AM for everywhere else in the worldPreloading and preorder infoPreloading for Pokemon Legends: Z-A is now available for people who acquired a copy from the Nintendo eShop. According to Polygon, it requires 4GB of space on Switch 1 and 7.7GB of space on Switch 2. People who preorder also get some digital extras. Be sure to consult GameSpot's Pokemon Legends: Z-A preorder guide to see all the preorder perks and find out which version is right for you.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   What is Pokemon Legends: ZA?As we reported previously, Pokemon Legends: ZA is a sequel to Pokemon Legends: Arceus and takes players back to Kalos, the setting of Gen 6's Pokemon X and Y for 3DS. The bustling metropolitan setting of Lumiose City will offer a significant change of pace from rolling hills and wilderness in Pokemon Legends: Arceus. Your first partner Pokemon will be either Chikorita, Totodile, or Tepig. The streamlined catching system from Arceus will return, so you won't have to battle every wild Pokemon you encounter before lobbing a Poke Ball at them.Z-A will also be a major departure in another way: the battle system. The traditional turn-based combat from Arceus and the mainline series will be replaced by a strategic real-time system. You and your partner Pokemon can move during combat encounters--though you'll still be confined to a specific area. Positioning and timing will impact your success on the battlefield, both when attacking and defending incoming attacks by executing dodges.          Click To Unmute         Pokémon Legends Z-A Everything To Know         Want us to remember this setting for all your devices?       Sign up or Sign in now!              Please use a html5 video capable browser to watch videos.            This video has an invalid file format.     00:00:00Sorry, but you can't access this content!Along with the new and reworked elements, a familiar system will make its return after a long absence. Mega Evolutions, which last appeared in Pokemon: Let's Go, Pikachu and Eevee in 2018, will temporarily turn your partner Pokemon into a super powerful version of itself. Mega Evolutions also alter the appearance of your Pokemon, but only certain species have Mega Evolutions, and you'll need a Mega Ring and a Pokemon-specific Mega Stone to activate it.The game will get its first expansion, Mega Dimension, in February 2026.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Battlefield 6 Has CoD-Like Launch With 7 Million Copies Sold In First Five Days - Report",
    "url": "https://www.gamespot.com/articles/battlefield-6-has-almost-cod-like-launch-with-6-5-million-copies-sold-in-first-days-report/1100-6535428/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4585105-screenshot2025-10-14at3.19.42%E2%80%AFpm.png",
    "tag": "Gaming",
    "date": "2025-10-15T15:28:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Electronic Arts has not...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Electronic Arts has not announced any official sales data for Battlefield 6, but one report from an analyst claims the game may have approached a Call of Duty-sized launch with 6.5 million copies sold in its first few days. A day after publishing this story, the sales number was revised upwards to 7 million copies sold in the first five days.Rhys Elliott of Alinea Analytics wrote that the game reached those sales numbers across all platforms, citing its own internal estimates. This would work to more than $350 million in gross revenue, according to Elliott.\n  \n              Click To Unmute\n        \n        Want us to remember this setting for all your devices?\n      Sign up or Sign in now!\n      \n      Please use a html5 video capable browser to watch videos.\n    \n      This video has an invalid file format.\n    00:00:00Sorry, but you can't access this content!\n          Now Playing: Battlefield 6 Essential Starter Guide\n      \n\"It's closer to Call of Duty-tier numbers than any of EA's premium-shooter efforts so far. But the question now is whether or not EA can foster this successful launch into a platform that stands the test of time,\" Elliott said.The report also had a breakdown of sales by platform, with Steam accounting for 65.7% of sales, driving 3.5 million copies sold and more than $220 million in revenue. Next behind was PS5, which accounted for 1.5 million copies and made up 23.7% of total sales, the report said. Xbox Series X|S ranked third overall, with 1.2 million units sold and a 19.6% share.On Steam specifically, Battlefield 6 is putting up big numbers, reaching a peak concurrent player record of more than 747,000. That's the most concurrent players on Steam for any EA game, even eclipsing the free-to-play Apex Legends (624k).Battlefield 6 Season 1 launches on October 28, which is also the day the game's battle royale mode is rumored to launch. Season 1 will continue with Phase 2, Rogue Ops, on November 18, followed by Winter Offensive on December 9. These updates will add new maps, modes, guns.While Battlefield 6 may have had a hot start, it remains to be seen if it'll be able to, for the first time, outsell a Call of Duty game. Experts said prior to Battlefield 6's launch that they believe that will not happen and that Call of Duty: Black Ops 7 will outrank EA's game.For more, check out GameSpot's Battlefield 6 review and our Battlefield 6 guides hub.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Best Minecraft Tower Designs To Build In 2025",
    "url": "https://www.gamespot.com/gallery/best-minecraft-tower-designs/2900-7129/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1745/17457013/4585115-minecraft1-6-4-1920x1080-png2-1.jpg",
    "tag": "Gaming",
    "date": "2025-10-15T15:03:00.000Z",
    "description": "By     Joey Carr   on October 15, 2025 at 8:03AM PDT                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Joey Carr\n   on October 15, 2025 at 8:03AM PDT    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Towers are some of the most impressive structures you can build in Minecraft, but there are certainly some tower designs that stand out amongst the herd. The large buildings can have multiple purposes for your world or server in Minecraft, but at the end of the day, it's mostly about the thrill of the build. Constructing a 30-block high tower with lights, a decorative interior, and impressive exterior features is truly a feat of greatness, and we're here today to give you some inspiration for that journey.We have compiled a list of the eight best tower designs that we could find in Minecraft. There are reference videos or images for all of the designs on the list, which you can either copy or use as a foundation for your build. The tower designs are also varied enough that no two towers are too much alike.Clock TowerReference: YouTubeWhether you want to live inside it, place it inside the grounds of your base, or simply use it as a navigational beacon, a Clock Tower is one of the most practical towers you can build in Minecraft. While you won't be able to make the Clock Tower actually tell time (unless you use some sort of mod), you can still light up the sky with a large, Big Ben-like clock.The Clock Tower we've referenced doesn't feature too much on the inside, as it's just a tall structure that looks fantastic from the outside. However, you can absolutely expand your Clock Tower to make it livable inside or just add some space for extra storage. You're also able to change the colors and overall aesthetic of your Clock Tower depending on the materials you use, but the medieval look of the design we've referenced looks fantastic in-game.Eiffel TowerReference: YouTubeHow could we not include the most iconic tower in the world on this list? While you might not be able to build the Eiffel Tower to scale in Minecraft, you can get pretty close with the video we've referenced. The Eiffel Tower in that video is much smaller than the one in real life, but you can always extend the base or simply add more blocks to the middle of the tower to make it larger. Either way, having a replica of the Eiffel Tower in or around your base is a spectacle any way you slice it.Leaning Tower of PisaReference: YouTubeNext up, we have another famous real-life tower, and this time, it's the Leaning Tower of Pisa. As far as towers go, the Tower of Pisa in Italy is certainly unique, as it leans ever so slightly to the right and looks like it's about to fall over. You can recreate the tower to near-perfection in Minecraft by following the video we've referenced. The tower in the video is massive and can be seen from chunks away in Minecraft, especially when you light it up from all angles. The Tower of Pisa in the video even manages to capture its signature lean in Minecraft, giving you an authentic version of the tower wherever you want to build it.WatchtowerReference: YouTubeSometimes, you just want to build a tower for the views it can provide, and you won't find a tower with better viewing angles than a basic Watchtower. A Watchtower is great for taking in the scenery from the top of it, where you have an entire landing to stand on, but the tower is also large enough for multiple levels inside of it. You can make the Watchtower your base, a storage facility, or a mixture of the two if you're placing it between your larger bases.The Watchtower we've referenced goes for a basic theme, but you can design it in multiple different ways with the right materials. It also implements a staircase inside, which allows you to get from level to level and eventually make your way up to the top, where you can look out at the world around you.Wizard's TowerReference: YouTubeA Wizard's Tower is a classic addition to any large-scale Minecraft base or server. While these towers are always a marvel to look at from the outside, they can also serve a distinct purpose. You can place all of your bookshelves and enchanting tables inside to have a dedicated place to enchant your gear. Of course, you're free to use your Wizard's Tower in any way you see fit, and the one we've referenced is a work of art in and of itself.There are multiple turrets on the sides of the tower, a walkway near the top of the structure, and plenty of room inside for you to fill with all sorts of different items. It looks like something straight out of Harry Potter, and if you light the tower correctly, it's a true beacon in the night.Island TowerReference: RedditAn Island Tower is one of the more niche designs you can build for a tower in Minecraft. However, when done right, you can build something that stands out from anything else on your map or server. The general idea behind the Island Tower is to build a structure on an existing island on the water, or simply make your tower be the island. As you can see in the Reddit post we've referenced, the user decided to use a sandy island as their base and built the tower in the middle of it. However, with enough patience, you could make a tower that's totally surrounded by water without any land around it. The possibilities with this design concept are plentiful, so find a build that you're happy with and roll on from there.Floating TowerReference: RedditThere aren't many tower designs in Minecraft cooler than a Floating Tower. The idea of your structure just floating in place over a mountain gap or the water is highly intriguing, and you can bring the idea to life. In the Reddit post we've referenced, you can see the user uses a simple stair design that leads up to their tower that's sitting several blocks above the ground. However, in classic Minecraft fashion, you can also build a completely foundation-less design by just knocking out the underlying blocks after you're done building. This might take a lot of trips back and forth between the tower and your base, but the result is worth the effort.Beacon TowerReference: YouTube Some towers have specific functions in Minecraft while others are just for show. Well, how about building a tower that accomplishes both of those goals? The Beacon Tower is essentially a beam of light that echoes all throughout the night sky so you can easily find your way back to your base. The tower we've referenced can be seen from all over the map with how much light it utilizes, and it's a fairly large structure to boot. You can use this tower strictly as a lighthouse, but the tower is also large enough to make a base out of or to store various items.    \n  \n                      "
  }
]