[
  {
    "title": "Whoops, Pillsbury Just Gave Us A Look At Yoshi In The Super Mario Galaxy Movie",
    "url": "https://www.gamespot.com/articles/whoops-pillsbury-just-gave-us-a-look-at-yoshi-in-the-super-mario-galaxy-movie/1100-6536080/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1813/18138562/4599531-mariogalaxy2.jpg",
    "tag": "Gaming",
    "date": "2025-11-10T14:02:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          While we still await the first...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                While we still await the first trailer for The Super Mario Galaxy Movie, an unlikely source has provided a great look at Yoshi in the sequel. A Pillsbury box showcases the green dinosaur alongside Mario as part of a promotional collaboration for the film.Tops Friendly Markets, a supermarket chain in the northeastern US, listed the Pillsbury sugar cookies shaped like Yoshi eggs over the weekend. The cute character was teased at the end of The Super Mario Bros. Movie, but this retailer leak seemingly confirms Yoshi will play a role in The Super Mario Galaxy Movie.Not only that, but the back of the Pillsbury box heavily implies that Bowser Jr. will be a new addition to the movie's cast. There is a kid-friendly activity to trace a path for Mario and Yoshi across the galaxy on the packaging. Intriguingly, Bowser Jr.'s mark serves as a dead-end option.This year marks the 40th anniversary of the Super Mario Bros. franchise, which was celebrated at the Nintendo Direct in September. Nintendo also unveiled that the film sequel would be called The Super Mario Bros. Galaxy Movie at the same presentation. The movie is set to premiere in theaters on April 3.Last month, Nintendo released remasters of Super Mario Galaxy and Super Mario Galaxy 2, and they still represent peak 3D platforming. Looking ahead, the company wants Mario to live past 100 years old.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Even The Empire State Building Is Dunking On GTA 6's Delay",
    "url": "https://www.gamespot.com/articles/even-the-empire-state-building-is-dunking-on-gta-6s-delay/1100-6536082/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick_large/1850/18504982/4599541-vice_city_01.jpg",
    "tag": "Gaming",
    "date": "2025-11-10T14:32:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          It feels like everyone on the...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                It feels like everyone on the internet has piled up on Rockstar Games after it delayed Grand Theft Auto 6 yet again, and even the social media team for New York City's most famous skyscraper is joining in the mass display of scaudenfredue.Quoting Rockstar's news of the delay on X, the Empire State Building's account quipped in a post: \"It took one year to build me.\" On the surface level, it's funny seeing another mainstream brand chime in on a significant news story from the gaming industry, though building a 102-story tower is obviously a much different feat than developing a video game.Planning for the Empire State Building's construction began in 1929, with construction taking around 13 months from 1930 to 1931. The building's construction was a massive operation, with at least 3,400 workers at its peak.Safety standards and labor protections were lower at the time compared to today, with workers generally not wearing hard hats or harnesses. There are five recorded deaths involved with the construction of the Empire State Building, though other outlets have reported numbers as high as 14 or 42, albeit without verification. There are no recorded deaths associated with the development of Grand Theft Auto 6.Development for GTA 6 began \"in earnest\" in 2020, according to Rockstar Games parent company Take-Two. The LinkedIn page for Rockstar Games shows over 4,600 people who work for the company, with some reports claiming that over 6,000 people work at the company.While developing GTA 6 might not be a physically dangerous job like building a massive skyscraper, the labor practices of Rockstar Games have still been scrutinized. The company is accused of union-busting after dismissing 30 to 40 staff members last month, though Rockstar retorted that these developers were instead let go for \"distributing and discussing confidential information in a public form.\"\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Arc Raiders Is On An Upward Arc, Surpassing Helldivers 2 All-Time Peak Concurrent Players On Steam",
    "url": "https://www.gamespot.com/articles/arc-raiders-is-on-an-upward-arc-surpassing-helldivers-2-all-time-peak-concurrent-players-on-steam/1100-6536086/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1813/18138562/4599559-4594438-arcraiders.jpg",
    "tag": "Gaming",
    "date": "2025-11-10T15:29:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Like Huntr/x from KPop Demon...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Like Huntr/x from KPop Demon Hunters, Arc Raiders is going up, up, up when it comes to concurrent players on Steam. The extraction shooter set a new record for peak concurrent count with 462,488 people on November 9, according to SteamDB.That means Arc Raiders saw over 100,000 more players from the game's launch weekend peak concurrent count of roughly 354,000 people. After launching October 30, Arc Raiders immediately broke a Steam concurrent-players record for extraction shooters with PvP features. However, now there are no caveats for the milestone, since the game has toppled Helldivers 2's peak on Valve's storefront. Steam continues to show Arc Raiders as the No. 1 best-selling title as well as listed high up on most-played games.\n  \n              Click To Unmute\n        \n        Want us to remember this setting for all your devices?\n      Sign up or Sign in now!\n      \n      Please use a html5 video capable browser to watch videos.\n    \n      This video has an invalid file format.\n    00:00:00Sorry, but you can't access this content!\n          Now Playing: Arc Raiders Review\n      \nArc Raiders has seen strong player engagement from the jump. Developer Embark Studios offered in-game compensation to players who experienced server issues November 2. That came just days after the servers were slammed from player demand at launch. All of this data points to Embark making the right call to release Arc Raiders between Battlefield 6 and Call of Duty: Black Ops 7, two of the biggest game releases of the year. It's not, however, one of the top 20 most popular Steam games of all time--though it's not far off. Embark released a new update for Arc Raiders that added deadly weather and a night raid for the Blue Gate map over the weekend. There is also a mysterious bunker to discover in the game now. Last week, Alinea Analytics reported that Arc Raiders has sold 2.5 million copies, with the majority coming from Steam. Keep in mind the $40 game is also available on the Epic Games Store, PS5, and Xbox Series X|S.For more, check out GameSpot's Arc Raiders review.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]