[
  {
    "title": "PlayStation State Of Play November 2025: All The Biggest Announcements And Games",
    "url": "https://www.gamespot.com/gallery/playstation-state-of-play-november-2025-all-the-biggest-announcements-and-games/2900-7248/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/3/37852/4600747-state-of-play.jpg",
    "tag": "Gaming",
    "date": "2025-11-11T21:45:00.000Z",
    "description": "By     Jason Fanelli   on November 11, 2025 at 3:15PM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Jason Fanelli\n   on November 11, 2025 at 3:15PM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Just when many of us thought gaming news livestreams were done for the year, PlayStation surprised its fans with the announcement of State of Play Japan.The 40-minute presentation was \"packed with great games, interviews, and new looks at anticipated titles\" from \"beloved series to distinctive indie creations,\" according to Sony's official announcement. Games featured during the event included Elden Ring Nightreign, Marvel Tokon: Fighting Heroes, Fatal Frame II: Crimson Butterfly Remake, and Gran Turismo 7.Read below for all of the biggest announcements from the latest State of Play.Dragon Quest VII ReimaginedThe State of Play kicked off with a new look at Dragon Quest VII Reimagined, a full remake of the classic Square Enix RPG. The gameplay trailer showed off battle scenes, multiple characters, and revealed a February 5, 2026 release date.Inkonbini: One Store, Many StoriesNext came InKonbini: One Store, Many Stories, a cozy simulation game where players will run a Japanese corner store, or konbini. InKonbini is set to launch in April.Coffee Talk TokyoCoffee Talk Tokyo, the next installment in Toge Productions's Coffee Talk franchise, was revealed next. A brief glimpse at some of the patrons of this new coffee shop was coupled with a March 5 release date.Brokenlore Unfollow and AscendTwo entries in the Brokenlore horror franchise were shown next. Brokenlore Unfollow is set to launch in January, while Brokenlore Ascend is scheduled for Summer 2026.Fatal Frame: Crimson Butterfly 2 RemakeSticking with horror, Koei Tecmo Games presented a new look at the upcoming Fatal Frame 2: Crimson Butterfly remake. The game is set to launch on March 12.Gran Turismo 7Along with the SPEC III update announced earlier this year, the Gran Turismo 7 Power Pack will add even more content to the game this December, including a 24-hour race.No Sleep For Kaname Date - From AI: The Somnium FilesFollowing its launch on Nintendo Switch and PC earlier this year, No Sleep For Kaname Date, the latest in the AI: The Somnium Files series, will launch on PlayStation 4 and PlayStation 5 on February 26.Tokyo Xtreme RacerOn the same day, a new entry in the Tokyo Xtreme Racer racing series will arrive on PlayStation for the first time in 20 years.Bandai Namco DLCNever Grave: The Witch and the CurseNever Grave: The Witch and the Curse is a Metroidvania-style adventure game from Frontside 180 and Pocketpair Publishing. A long gameplay trailer was accompanied by an interview with development director Yasuomi Sakai.BlazBlue: Entropy Effect XNext up was Arc System Works and the debut of BlazBlue: Entropy Effect X. This sequel to 2023's Entropy Effect will once again feature characters from the BlazBlue fighting game franchise in a sprawling adventure when it launches on February 26.Octopath Traveler 0A new gameplay trailer for Octopath Traveler 0 aired next, showing off more of the game's HD-2D visuals and flashy battles. It included new characters Herminia, Tytos, and Auguste, as well as a village-building mechanic in which the player places houses, crops, and more. A demo containing the first three hours of the game is also available starting today.Marvel Tokon: Fighting SoulsNext up came Marvel Tokon: Fighting Souls, for which Arc System Works announced a second closed beta test during the first week of December. The beta will introduce Ghost Rider and Spider-Man to the playable roster, along with two new stages, X-Mansion and Savage Land.Elden Ring Nightreign: The Forsaken HollowsA trailer for a new downloadable update for Elden Ring Nightreign, The Forsaken Hollows, aired next, with multiple new enemies and areas featured. The update launches December 4.PlayStation Gaming MonitorThe final announcement of the event was the reveal of a new PlayStation-branded 27-inch gaming monitor, which features 240hz refresh rate and a built-in charging mount for DualSense controllers.      \n  \n                      "
  },
  {
    "title": "PlayStation 5 Sales Draw Even With PS4, And Ghost Of Yotei Has A Big Debut",
    "url": "https://www.gamespot.com/articles/playstation-5-sales-draw-even-with-ps4-and-ghost-of-yotei-has-a-big-debut/1100-6536128/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4600637-ghostofyotei2.jpg",
    "tag": "Gaming",
    "date": "2025-11-11T16:43:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Sony has shared its latest...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Sony has shared its latest update for investors, and it's largely good news for PlayStation 5. According to Sony, an additional 3.9 million PS5 consoles were sold in the last quarter, bringing its lifetime total to 84.2 million consoles sold since the system launched in 2020. That puts the PS5 into a virtual dead heat with its predecessor, PlayStation 4, at the same point in its life cycle.The complete breakdown of Sony's latest fiscal quarter is now online, and its sales chart shows the remarkably similar trajectory of the PS4 and PS5 sales. However, Sony noted that it only projects 15 million additional PS5 console sales during its current fiscal year, which runs through March 31, 2025. If so, that would potentially allow PS4 to retain its crown as Sony's second best-selling console, because it sold 17.8 million systems at that point in its life.Regardless, Sony CFO Lin Tao suggested that the PS5 may have a longer lifespan than the traditional seven-year cycle.Sony CFO Lin Tao says the PS5 is only in the middle of its lifecycle and they want to expand the lifecycle even further!\"Our view is that compared to conventional console lifecycles. Looking at the PS4 lifecycle it seems to be getting longer and longer. Especially the PS4,… pic.twitter.com/ecrsI3X9xV  — Genki✨ (@Genki_JPN) November 11, 2025              Kantan Games CEO Dr Serkan Toto told Video Games Chronicle that Sony's success is at least in part due to the struggles of Microsoft's gaming division and the migration of formerly Xbox-exclusive titles to PS5.\"Life is good if you have a competitor that is not really focusing on hardware anymore and has given up on exclusive games to start selling them on your platform,\" said Toto. \"Sony is now clearly dominating the high fidelity console gaming space, and just watch what happens to their numbers once GTA 6 is out.\"Sony's report also revealed that Ghost of Yotei has sold 3.3 million copies since its debut just over a month ago. Unfortunately, the latest word from Sony about Bungie and Destiny isn't as good. Sony is claiming a loss of $204 million because Destiny 2 didn't reach its sales goals. For now, Sony is hopeful that Destiny 2's next expansion, Renegades, may revive interest in the shooter when it launches on December 2.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Marvel Rivals Season 5 Finally Adds Rogue And Gambit",
    "url": "https://www.gamespot.com/articles/marvel-rivals-season-5-finally-adds-rogue-and-gambit/1100-6536130/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1639/16394540/4600716-marvelrivalss5loveisabattlefield.jpg",
    "tag": "Gaming",
    "date": "2025-11-11T18:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Marvel Rivals Season 5 is a...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Marvel Rivals Season 5 is a formal celebration with the wedding of one of Marvel's most iconic couples. The season adds X-Men's Gambit and Rogue, and developer NetEase has released a new cinematic trailer to tease the couple's big wedding as well as some new costumes players might expect in the Season 5 battle pass, some of which may be obtainable with Marvel Rivals codes.          Season 5: Love is a Battlefield arrives on November 14. As revealed in the trailer above, the season is themed around Gambit and Rogue's wedding, but the ceremony is interrupted by some sort of cosmic energy.Gambit is revealed to be the first of the two new characters arriving, and he'll be categorized as a Strategist who blends kinetic energy control with his iconic playing cards. This also means Rogue will likely make her appearance a few weeks after the season's launch.Later in the season, NetEase will introduce a new game mode. This is an 18v18 Conquest mode that will be played on the new Grand Garden map. There will also be a non-combat map added to Marvel Rivals. This new map is themed around New York City, and players will be able to go and hangout and emote in this dedicated space.Gameplay changes and big fixes are likely included as well. However, more Season 5 details and the full battle pass reveal should be coming soon.Most recently, Season 4's midseason update added Daredevil to the game's lineup of heroes. Last month, Marvel Rivals added the game's first-ever PvE mode, which was themed around Marvel Zombies.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]