[
  {
    "title": "Backbone’s New Death Stranding 2 Controller Looks Like It Came Straight From The Game's World",
    "url": "https://www.gamespot.com/articles/backbone-new-death-stranding-2-controller-looks-like-it-came-straight-from-the-games-world/1100-6535766/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4592526-death-stranding-2-backbone.jpg",
    "tag": "Gaming",
    "date": "2025-10-30T16:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Backbone has announced a new...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Backbone has announced a new limited-edition smartphone controller, inspired by Death Stranding 2: On the Beach. Developed in collaboration with Kojima Productions and PlayStation, the Backbone One: Death Stranding 2 Edition controller is priced at $160 and it'll be limited to 1,350 units. Preorders open on November 5 at Best Buy, the Kojima Productions Store, and Backbone's own site.Built on the same model as the PlayStation-inspired version of the Backbone One, this controller features design cues to make it look like it came straight out of Death Stranding 2 and it comes packaged inside of a collectible--and numbered--Pelican case. The controller draws from the colors of Sam Porter Bridges' world and Drawbridge, and it has transparent windows on the front so that you can see the inner workings of this device.Backbone One: Death Stranding 2 EditionGallery                                                                             Like other Backbone One controllers, the \"Gen 2\" version has a reshaped D-pad and magnetic adapters that allow you to fit it to your phone without needing to remove its protective cover if it's standard-sized. Applying one of these to an Android or iPhone essentially turns the device into a handheld gaming console, as they have all the inputs you'd expect from a modern controller, like analog sticks, face and shoulder buttons, triggers, and more. When not in use, the controller folds up to take less space.This isn't the first time that Backbone has released a Death Stranding controller, as last year it released one inspired by Death Stranding: Director's Cut. The controller was also infamous for its choice of color, with many people remarking that the transparent yellow plastic bore quite a resemblance to certain bodily fluids.The new Backbone controller will likely sell out fast, but you can pick up the current models through Amazon in the standard colors of black and white. The Backbone One with a USB-C connection is available for $100, and if you have an older iPhone, the Backbone One with a Lightning connection is available at the same price.You can also pick up a Backbone Pro--the company's premium smartphone controller--for $170, and this version features redesigned ergonomics and high-quality components like a textured finish, quieter face buttons, full-sized ALPS analog sticks, Hall Effect triggers, and two remappable back buttons.Death Stranding 2: on the Beach was released for PS5 earlier this year, and since then, Kojima Productions has continued work on expanding the IP. A trailer for the upcoming Death Stranding anime film was recently shown off, and the live-action movie from director Michael Sarnoski and A24 is in the early stages of development.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Nintendo Denied Japanese Patent For Pokemon-Like Capturing Mechanic",
    "url": "https://www.gamespot.com/articles/nintendo-denied-japanese-patent-for-pokemon-like-capturing-mechanic/1100-6535824/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4593951-pokemonlegendsz-a.jpg",
    "tag": "Gaming",
    "date": "2025-10-30T15:40:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          In September, Nintendo was...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                In September, Nintendo was granted a US patent for \"the fundamental gameplay mechanic of summoning a character and letting it fight another” within a video game. At the time, that was seen as an attempt to block any future Pokemon imitators like Palworld. Nintendo went out for another Pokemon-inspired patent in Japan, but the outcome wasn't in its favor this time.As reported by Video Games Chronicle, Nintendo filed a Japanese patent for a mechanic in a game that allows the player to throw an item that captures a character, like the Pokeballs in Pokemon. However, the application was denied because a third party submitted evidence from Ark, Craftopia, Monster Hunter 4 and more to prove that the mechanic isn't limited to Pokemon games and that it already exists.GamesFray first noticed the rejection, and added that it's plausible that the third party was Pocketpair, the developer behind Palworld. While that would make sense, it's conjecture for now. Pocketpair is still engaged in a legal battle with Nintendo over Palworld's alleged infringement on Nintendo's preexisting patents. That led Pocketpair to remove Pal Spheres and other features from Palworld that fell under the patents held by Nintendo.In the aftermath of Nintendo's American patent last month, Michael \"Cromwelp\" Douse, the publishing director of Baldur's Gate 3 developer Larian Studios, noted that, \"These types of patents are too often used in bad faith.\"Nintendo still has the option to appeal the Japanese Patent Office's ruling, but it's currently unknown if the company plans to do so. The most-recent Pokemon game, Pokemon Legendz Z-A, was released earlier this month on Switch and Switch 2.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Best Companion Perks And Mods In The Outer Worlds 2",
    "url": "https://www.gamespot.com/gallery/outer-worlds-2-best-companion-perks-mods-skills-build-guide/2900-7192/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1816/18167535/4593668-outer-worlds-2-companions-best-perks-mod-kits-abilities-guide-.jpg",
    "tag": "Gaming",
    "date": "2025-10-30T14:32:00.000Z",
    "description": "By     Jason Rodriguez   on October 30, 2025 at 7:32AM PDT                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Jason Rodriguez\n   on October 30, 2025 at 7:32AM PDT    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Are you being cautious when it comes to companion mod kits and companion perks in The Outer Worlds 2? There are certain restrictions, which you'll learn about soon enough, as you progress through the campaign. Naturally, you might think twice when you're trying to figure out various builds for your allies. We've got a bunch of suggestions in our article to help you out.How to unlock companion perks and mod kits in The Outer Worlds 2Before we continue, make sure you check our companion recruitment guide so you don't miss out on potential buddies. Now, it goes without saying that building your companions is different from building your character. You definitely don't need to worry about skills or traits, that's for sure. Here's a quick summary on what you can expect:Companions have abilities that must be fully charged before they can be cast. They also have two traits that are active whenever they're in your party.Your companions also gain XP just like your character. However, you can only select one of two perks every five levels--i.e. levels 5, 10, 15, 20, 25, and 30. The perk that you choose is permanent. It cannot be undone or reset.Companions will notify you if a personal quest is available. Once you've completed that mission, you'll receive their mod kit. Having a companion's mod kit lets you alter the option via a workbench's Party Upgrades menu. You won't be locked out permanently, so don't worry about this part.Ideally, you should figure out the roles of each companion within your party. From there, look for perks and mod kits that synergize with their abilities.Niles best perks and mod kitsNiles' ability allows him to taunt nearby enemies, while also dealing tremendous damage. He also focuses more on evasion to avoid enemy attacks. He has some of the best companion perks in The Outer Worlds 2 due to his penchant for striking/distracting enemies and mitigating their blows.Perks:Level 5:I Got 'Em - Enemies are more likely to target Niles. He will occasionally fire at enemies that are not targeting him to taunt them.I'm Taking 'Em Down - +25% armor penetration and additional focus on a target's weakpoints.Level 10:Scrap Engineering - While Niles is in the party, small caches have a chance to contain a bunch of Scrap Metal.Spotter - Niles periodically reveals enemies on the minimap. You also gain -20% NPC awareness detection rate.Level 15:Self-Repairing Armor - +9 armor rating for Niles. These armor plates are destroyed if he takes damage; automatically restored as long as Niles isn't taking damage.Ghost Array - Niles gains a camouflage when below 50% health; becomes invisible to enemies and deals bonus damage. This has a 30-second internal cooldown.Level 20:Self-Repairing Armor Mod - Gain a means of crafting Self-Repairing Armor mods via workbenches. These break after taking moderate damage, but are automatically restored after a period where you're not taking damage.Ghost Array Mod - Gain a means of crafting Ghost Array mods via workbenches. These grant the same camouflage effect when you drop below 50% health.Level 25:Dumb Aggression - Replaces taunt with goad, which reduces enemy attack speed and prevents them from stepping into/using cover.Full Cylinder - This doubles Niles' ability damage since he'll fire six shots instead of just three. Defeated enemies also explode and deal damage to nearby hostiles.Level 30:Force Emitter - Niles does a sonic shockwave when enemies get too close. This deals damage and knocks down foes in an area, while also granting him +10% damage resistance.Smokescreen Emitter - Niles creates a cloud of smoke that grants the party the camouflaged effect, while also increasing everyone's sneak attack damage.Our picks: I'm Taking 'Em Down, Spotter, Ghost Array, Self-Repairing Armor Mod, Full Cylinder, and Force Emitter.Mod kits:Tier 1 Weapon:Superheated Acceleration Barrel - Niles' weapon element changes to Plasma and it deals slightly more damage.Rail Revolver Barrel - Niles' weapon element changes to Shock and it deals significantly more damage.Tier 1 Armor:Rubberized Joint Seals - Niles gains immunity to Shock effects and the effectiveness of his armor is increased.Acid-Proof Joint Seals - Niles gains immunity to Corrosive effects and the effectiveness of his armor is increased.Tier 2 Weapon:Ricochet Shrapnel Shots - Niles' shots ricochet off targets and deal damage to nearby enemies; increases weapon damage.High-Density Shots - Niles' shots occasionally knock down targets; increases weapon damage.Tier 2 Armor:Reflex Amplifier Reflection Module - Reflects a portion of attacks back to hostiles; slightly increases the effectiveness of his armor.Reflex Amplifier Caster - Increases your evasion when you're standing near Niles; greatly increases the effectiveness of his armor.Our picks: Rail Revolver Barrel, Acid-Proof Joint Seals, High-Density Shots, and Reflex Amplifier Caster.Valerie best perks and mod kitsValerie is pretty much a pure support character, given that her ability grants a strong heal-over-time effect. Her perks and mod kits also amplify her restorative throughput depending on who gets hit by her syringe projectile. Lastly, note that Valerie's first mod kit comes from a High Security Lockbox that needs to be opened.Perks:Level 5:Armor Operation - +10 armor rating to party members affected by Valerie's Life Injection Module trait.Restoration Operation - All party members restore 20% health instantly whenever Valerie uses her Life Injection Module trait.Pick: Restoration OperationLevel 10:Integrated Mag-Pick Repair - Your Mag-picks have a chance to be preserved on use.Salvaging Tools - Gain a +20% chance to double the resources when breaking down items.Pick: Integrated Mag-Pick RepairLevel 15:Strength Supplement Module - Valerie will fire a syringe that grants the following effects when you're in melee range of an enemy: +20% melee damage and movement speed for eight seconds, as well as +10% instant heal.Fortitude Supplement Module - Valerie will fire a syringe if you're suffering from a negative affliction. It has the following effects: Clears all status ailments and +10% instant heal.Pick: Fortitude Supplement Module, unless you built your character to focus on Melee combat.Level 20:Enhanced Emergency Protocols - Become immune to all damage for a duration after being healed by Valerie.Preparation Protocols - Valerie's ability recharges faster when you're at full health.Pick: Enhanced Emergency ProtocolsLevel 25:Vitality Catalyst - All over-healing you receive, including those from Valerie, medical inhalers, and other sources, gets converted into bonus temporary health that degrades over time.Preservation Catalyst - The party automatically regenerates up to 50% of their max HP.Pick: Preservation CatalystLevel 30:Prolonged Defenses - Gain +20 armor rating when you get healed by Valerie's ability.Prolonged Restoration - Gain +1% health per second when you get healed by Valerie's ability.Pick: Prolonged DefensesOur picks: Restoration Operation, Integrated Mag-Pick Repair, Fortitude Supplement Module (or Strength Supplement Module if you're heavily focused on melee combat), Enhanced Emergency Protocols, Preservation Catalyst, and Prolonged Defenses.Mod kits:Tier 1 Weapon:Superheating Coils - Valerie's weapon applies more stacks of Burn and deals slightly increased damage.Supercooling Coils - Valerie's weapon now deals Frost damage and has significantly increased damage.Tier 1 Armor:Acid-Proof Plating - Grants immunity to Corrosive effects; increases the effectiveness of her armor.Static-Resistant Plating - Grants immunity to Shock effects; increases the effectiveness of her armor.Tier 2 Weapon:Burst Charger - Fire a short burst with an area-of-effect (AOE); shots have slightly increased damage.Energy Accelerator - Periodically fires a large beam that deals massive damage; shots have slightly increased damage.Tier 2 Armor:Enhanced Generator - Speeds up ability recharge and slightly increases armor.Self-Repairing Module - Grants Valerie constant health regeneration and slightly increases armor.Our picks: Superheating Coils, Static-Resistant Plating, Burst Charger, and Enhanced Generator.Inez best perks and mod kitsAmong all the party members in the game, Inez stands out due to several factors:She's highly missable due to the decisions you make when (a) dealing with Milverstreet and Kaur and (b) figuring out what to do with the Vox Relay.Inez's ability is altered depending on the creature that you choose to graft to her implants during the \"Better Than Nature\" personal quest. Naturally, the grafted option changes the boosts or interactions with her perks.We recommend choosing the Raptidon graft since it grants restorative effects. This means you can have two healer-type companions (Inez and Valerie), as everyone else tends to focus a lot on dealing damage already.Think of Inez as a hybrid ally who can deal damage, heal, and provide buffs. This ensures that she has some of the best companion perks in The Outer Worlds 2.Perks:Level 5:Surgical Strike - Inez's weapon has -50% spread and she also actively targets weakspots. Her shots periodically stun targets, too.Field Medicine - Occasionally tosses medicine packs that reduce your toxicity buildup and crash duration.Level 10:Experimental Drug Conversion - Eating food or drinking while Inez is in your party grants a small amount of inhaler charge.Experimental Biomass Conversion - Eating food or drinking while Inez is in your party has a chance to grant Crude Biomass for crafting.Level 15:Lethal Graft Research - Improves the lethality of the graft you selected:Raptidon graft - Healing mists increase accuracy and damage for party members.Crabble graft - Her first shot leaves a pool of plasma that damages hostiles in an area.Medical Graft Research - Improves the restorative abilities of the graft you selected:Raptidon graft - Healing mists cling onto friendlies, causing the effect to persist even if party members leave the area.Crabble graft - Drop a canister of healing mist at her position to heal friendlies.Level 20:Potent Biomass - Party-wide +20% Corrosion damage and +10% Vulnerable status applied when dealing Corrosion damage.Experimental Primer Research - Craft a custom primer for your inhaler. Kills caused by everyone in the party heal you for a small amount.Level 25:Extra Strength Injector - Allows the injector's effect to be applied for 100% duration.Self Betterment - Using the inhaler grants +25% more health; all party members become immune to damage for three seconds.Level 30:Drug Diffusion Modification - Inez's ability refreshes her drug bonuses, granting +25% rate-of-fire, +25% reload speed, and -50% ranged weapon spread.Emergency Procedures - Inez's ability immediately clears your toxicity and crash threshold; grants a party-wide +400 health over 10 seconds effect.Our picks: Surgical Strike, Experimental Drug Conversion, Medical Graft Research (with the Raptidon graft), Potent Biomass, Self Betterment, and Emergency Procedures.Mod kits:Tier 1 Weapon:Medical Bio-Barrel - Deal Corrosive damage and slightly increased damage.Silence Barrel - Reduces the chance that enemies will target Inez; significantly increased damage.Tier 1 Armor:Acid-Resistant Materials - Immunity to Corrosive side effects; increases effectiveness of armor.Stunning Mist Dispensers- Temporarily dazes enemies when she's struck in melee; slightly increases effectiveness of armor.Tier 2 Weapon:Medical Pack Dispensers - When Inez kills a human or creature, a medicine pack drops, which reduces your toxicity build-up and crash duration; increases Inez's weapon damage.Auto Loader - Inez's weapon automatically reloads, allowing her to continuously fire; slightly increases weapon damage.Tier 2 Armor:Durability Drug Enhancement - Combat drug injectors grant Inez temporary damage resistance; slightly increases effectiveness of armor.Accuracy Drug Enhancement - Combat drug injectors grant Inez temporary bonus damage; slightly increases effectiveness of armor.Our picks: Medical Bio-Barrel, Stunning Mist Dispensers, Medical Pack Dispensers (or Auto Loader depending on the role of the second party member), and Accuracy Drug Enhancement.Tristan best perks and mod kitsTristan is an absolute powerhouse. His primary role in your squad is to taunt enemies and soak damage, which he does exceptionally well. He has some of the best companion perks and mod kits in The Outer Worlds 2 all because the effects greatly bolster his tankiness.Perks:Level 5:Juggernaut - Enemies are more likely to target Tristan; -50% status effect duration.Explosive Strikes - Every three melee attacks activates Tristan's hammer grenade, dealing +45 physical damage in an area.Level 10:Shield of the Law - When starting a fight via dialogue, Tristan will automatically taunt enemies in addition to other Speech-related effects.Beg For Mercy - When starting a fight via dialogue, Tristan will always frighten enemies in addition to other Speech-related effects.Level 15:Zyranium Regeneration - While Tristan is exposed to Zyranium, he heals +2.5% health every 0.5 seconds.Zyranium Energy - While Tristan is in Zyranium, his abilities recharge faster.Level 20:Aggressive Challenge - Enemies taunted by Tristan's abilities are goaded instead. They take additional damage and do not hide behind cover.Frenzied Charge - After activating Tristan's ability, he becomes temporarily frenzied, gaining +25% melee weapon attack speed, +20% movement speed, and +25% damage.Level 25:Steel Wall - Tristan gains +100% of his health as temporary HP at the start of each combat encounter.Demoralizing Entry - After killing a target, Tristan frightens human and creature enemies for eight seconds.Level 30:Groundshaker - Instead of knocking the target down, Tristan's ability causes him to slam the ground. This move deals damage in a wider area and knocks down everyone around him.Propulsion Rocket - Tristan's ability deals more damage and knocks a target down for longer.Our picks: Juggernaut, Beg For Mercy, Zyranium Regeneration, Frenzied Charge, Demoralizing Entry, and Groundshaker.Mod kits:Tier 1 Weapon:Plasma Grenades - Tristan's weapon now deals Plasma damage; slightly increased damage.Shock Grenades - Tristan's weapon now deals Shock damage; significantly increased damage.Tier 1 Armor:Grounding Plates - Immunity to Shock effects; greatly increases armor effectiveness.Acid-Proof Plates - Immunity to Corrosive effects; greatly increases armor effectiveness.Tier 2 Weapon:Flamethrower Gauntlet - Causes continuous Plasma damage around him; significantly increased damage.Shock Emitter Gauntlet - Causes continuous Shock damage around him; increased damage.Tier 2 Armor:Powered Armor - Gain bonus damage based on his armor value; increases armor effectiveness.Shrapnel Resistor - Immunity to all area-of-effect (AoE) damage; greatly increases armor effectiveness.Our picks: Plasma Grenades, Grounding Plates, Flamethrower Gauntlet, and Shrapnel Resistor.Aza best perks and mod kitsThe best word to describe Aza is that she's \"chaotic.\" She regularly runs straight into the thick of the fray to slice and dice her foes. You can then follow this up with her ability, which is akin to a deadly shotgun blast. Unfortunately, she's not as tanky as Tristan, which means she has problems surviving unless you and another ally watch her back.Perks:Level 5:Relentless - Every third melee attack by Aza inflicts stagger and bonus damage.From the Shadows - Aza will flank weaker targets in combat.Level 10:Volatile Bombs - The explosion from Aza's ability has a larger blast radius.Strike from Smoke - After activating her ability, Aza deals +25% damage for 20 seconds.Level 15:Explosive Recycling - While Aza is in the party, disabling mines grants crafting materials.Assisted Takedowns - While Aza is in the party, gain +50% sneak attack damage.Level 20:Stunning Explosion - Aza's ability now inflicts stun instead of stagger.Shorten the Fuse - Aza automatically gains +1 charge of her ability at the start of combat.Level 25:Mine Layer - While Aza is in the party, mines and explosives deal +25% more damage; mines also knock down enemies when triggered.Flurry of Blades - Aza will occasionally perform a flurry that stuns the target and deals +400% melee damage.Level 30:Frost Charge - Aza's ability deals Frost damage and leaves an aura that Chills hostiles.N-Ray Charge - Aza's ability deals N-Ray effects and does significantly increased damage overall. Note that enemies instantly die when their N-Ray status stacks are full.Our picks: Relentless, Strike from Smoke, Assisted Takedowns, Stunning Explosion, Flurry of Blades, and N-Ray Charge.Mod kits:Tier 1 Weapon:Zap Coils - Aza's weapon now deals Shock damage; has significantly increased damage.Serrated Edge - Aza's weapon now inflicts Bleed; has slightly increased damage.Tier 1 Armor:Heat-Resistant Cloth - Immunity to Plasma effects; increases armor effectiveness.Shock-Resistant Cloth - Immunity to Shock effects; increases armor effectiveness.Tier 2 Weapon:Pommel Sap - Aza's weapon stuns enemies that aren't targeting her (can only occur once per enemy); increased damage.Vitals-Finding Design - Aza's weapon deals increased damage against enemies that aren't targeting her; significantly increased damage in general.Tier 2 Armor:Emergency Adrenaline Injector - Aza is healed to full the first time she's downed in a combat encounter; increases armor effectiveness.Shadow Melding Fabrics - When not attacking a target, Aza gains camouflage--i.e. invisible to enemies and bonus damage; increases armor effectiveness.Our picks: Serrated Edge, Heat-Resistant Cloth, Pommel Sap, and Emergency Adrenaline Injector.Marisol best perks and mod kitsWhile we're certainly discussing the ideal mods and perks for your party members, it still bears mentioning that Marisol tends to be one of the best companions in The Outer Worlds 2. This is primarily because of her ability, which stuns a target for several seconds, all while causing all your shots/strikes to become critical hits. This makes her your top choice when you want to bring down bosses and elite leaders.Perks:Level 5:Portable Capacitor Distributor - Marisol occasionally tosses canisters. Walking over them restores gadget energy, while shooting them deals Shock damage in an area.Combatant Analyzer - Marisol analyzes and marks an enemy in combat. Your attacks have a bonus effect depending on where you hit the target--i.e. knocked down for the legs, stunned for the head, and bleed for the torso and arms.Level 10:Recharge Paralysis - Attacking opponents affected by Marisol's ability restore 10% of your gadget energy per damage dealt.Dispersed Glare - Marisol's ability affects nearby hostiles around the initial target--i.e. multiple enemies are stunned and suffer from critical hits.Level 15:Elemental Weapon Specialist - Marisol recovers shock rods, plasma cells, and biomass ammo.Automech Scrapper - Automechanicals have a small chance of providing additional crafting materials.Level 20:Shield Generator Reflector - Marisol upgrades your Gas-Energy Deflection Apparatus gadget. A portion of the damage against the shield is reflected back to the attacker.N-Ray Scanner Analyzer - Marisol upgrades your N-Ray Scanner. While active, it has the same effects as her Combat Analyzer's body part targeting.Level 25:Linked Charge - Marisol's ability recharges a portion of your gadget energy.Chain Paralysis - If an enemy affected by Marisol's ability is killed, the effect jumps to other hostiles within moderate range. This effect can trigger multiple times in a single encounter.Level 30:Energy Relay - Marisol throws a gadget on the ground. Party members standing in its aura have their weapon damage converted to Shock, while also recharging your gadget energy.Mind Discombobulator - Marisol throws a gadget that confuses enemies, causing them to wander around aimlessly.Our picks: Combat Analyzer, Dispersed Glare, Elemental Weapon Specialist, N-Ray Scanner Analyzer, Chain Paralysis, and Energy Relay.Mod kits:Tier 1 Weapon:Blast Barrel - Marisol's pistol deals damage in an area; slightly increased damage.Superheating Barrel - Marisol's pistol applies Plasma more effectively; slightly increased damage.Tier 1 Armor:Plasma Absorber - Immunity to Plasma effects; slightly increased armor effectiveness.Shock Absorber - Immunity to Shock effects; slightly increased armor effectiveness.Tier 2 Weapon:Isomorphic Charger - Marisol's pistol shots also recharge her ability; slightly increased damage.Homotopic Extension Module - Marisol's pistol lengthens the duration of afflictions on a target; slightly increased damage.Tier 2 Armor:Shield Battery - Marisol gains a shield whenever you expend gadget energy; slightly increases armor effectiveness.Kinetic Charging Relay - Marisol gradually recharges her ability whenever she takes damage; slightly increases armor effectiveness.Our picks: Blast Barrel, Plasma Absorber, Isomorphic Charger, and Kinetic Charging Relay.That does it for our guide on the best companion mod kits and companion perks in The Outer Worlds 2. Now that we're finished discussing everything about your party member's abilities, perhaps you'd like to focus on how to build your character for the long road ahead. We've got numerous tips for you in our articles related to the best skills, best perks, best traits, and best flaws.Black market smugglers? Autocratic regimes? Rampaging Raptidons? Invisible cultists that can only be seen if you wear special goggles? These shenanigans need not cause any alarm because we've got you covered in our The Outer Worlds 2 guides hub.    \n  \n                      "
  }
]