[
  {
    "title": "New Lego Star Wars BB-8 Droid Building Set Is Available Now",
    "url": "https://www.gamespot.com/articles/lego-star-wars-bb-8-astromech-droid-75452-new-release-2026/1100-6537153/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4628449-legobb-8droid.png",
    "tag": "Gaming",
    "date": "2026-01-01T07:41:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                                                                                                                                                                              Lego has kicked off 2026 by adding several notable Star Wars models to its ever-expanding catalog. The lineup of January 2026 Lego Star Wars sets features notable starships and transport vehicles like the Venator-Class Attack Cruiser and AT-AT Walker as well as the return of the most popular droid from the recent Star Wars film trilogy. That's right, BB-8 has returned to the Star Wars Lego lineup following a lengthy hiatus. The 569-piece BB-8 Astromech Droid is available now for $90 at Amazon, the Lego Store, and other major retailers.See all new Lego sets at: Lego Store | Amazon | Best Buy | TargetLego Star Wars New Releases (January 2026)Here's a list of all eight brand-new Star Wars Lego sets as well as the massive UCS Death Star, which is no longer exclusive to the Lego Store. The AT-AT Walker and Venator-Class Attack Cruiser are part of the Lego Star Wars mid-scale display model series for adults.AT-AT Walker (525 pieces) -- $65BB-8 Astromech Droid (569 pieces) -- $90Venator-Class Attack Cruiser (643 pieces) -- $80UCS Death Star (9,023 pieces) -- $1,000Clone Shock Trooper Mech (151 pieces) -- $15Cobb Vanth's Speeder (207 pieces) -- $35Siege of Mandalore Battle Pack (116 pieces) -- $23The Mandalorian & Grogu's Speeder Bike (58 pieces) -- $10Grogu's Homestead (107 pieces) -- $20                                 Lego Star Wars: BB-8 Astromech Droid (569 Pieces)                                                                $90                                                                                                                                                                                    The 569-piece BB-8 buildable figure looks like a great recreation of the lovable Astromech Droid from the Star Wars Sequel Trilogy. The model comes with a display plaque and information card. A small BB-8 figure connects to the end of the stand.Interactive features include an openable front hatch with a burner arm in his chest cavity, just like in The Force Awakens, and a movable head that rotates in random directions when you slide BB-8 across a flat surface.Just be aware that this BB-8 model is much smaller than the one Lego released back in 2017. The new BB-8 (model No. 75452) is just over 3 inches tall, whereas the 1,106-piece build (model No. 75187) was over 10 inches tall.On the positive side, the smaller-sized BB-8 is a more detailed replica of the droid. Plus, there's a practical reason for this BB-8 to be smaller. Lego designed BB-8 to be accurate in terms of scale when compared to other buildable droids released over the past two years, including R2-D2, C-3PO, and Chopper.                                                                                                                                                                     Sign up for GameSpot's Weekly Deals Newsletter:                                New Lego Star Wars BB-8 Droid Building Set Is Available Now                         Double Nintendo Switch 2 Console Storage For Only $33 With Samsung MicroSD Express Deal                         New Tom And Jerry Blu-Ray Anthology Drops To Lowest Price Yet                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (3)                 Arcade1Up Classic Special Edition Mortal Kombat Cabinet Gets First Discount                         Lego Spider-Man: Across The Spider-Verse Minifigure Mystery Box Restocked At Amazon                         Arcade1Up Ms. Pac-Man And Galaga Countercade Is Back On Sale At Amazon    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n\n            \n    "
  },
  {
    "title": "Lego Spider-Man: Across The Spider-Verse Minifigure Mystery Box Restocked At Amazon",
    "url": "https://www.gamespot.com/articles/lego-minifigures-marvel-spider-man-spider-verse-collection-2025-buying-guide/1100-6533603/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4541486-spider-manminifigures.jpg",
    "tag": "Gaming",
    "date": "2025-12-31T22:36:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                               Spider-Man fans have another opportunity to pick up Lego Spider-Verse minifigure mystery boxes for retail price at Amazon. After selling out in the lead-up to Christmas, the Spider-Man: Across the Spider-Verse Minifigure 6-Pack is back in stock for $30 at Amazon. Resellers have been selling Spider-Verse mystery boxes for around $50, so Amazon will probably sell out again soon.If you're interested in collecting this Lego minifigure series, now's the time to grab a box or two. Spider-Verse minifigures are sold out at all other major retailers and the Lego Store. Most retailers sold out shortly after the collection launched in September and never restocked the mystery boxes or singles. And with the Lego Minifigure Animal Series 28 Collection launching this week, it's unlikely the Spider-Verse minifigures stick around for much longer.The Spider-Verse Lego minifigure collection includes 12 characters from the animated film series. Each minifigure comes with a stand and most also have an accessory.Lego Minifigures: Spider-Verse 6-PackAmazon - $30Target - Sold outWalmart - Sold outLego Store - Sold outLego Minifigures: Spider-Verse -- $5 eachLego Store - Sold outBest Buy - Sold outWalmart - Sold outTarget - Sold outArticle updated December 31.                                 Lego Minifigures - Spider-Man: Across the Spider-Verse 6-Pack                                                                $30 | Restocked December 31                                                                                                                                                                                    Since we're talking about Spider-Verse here, the set has a few of the zanier Spider-Men from the multiverse, including Werewolf Spider-Man., Spider-Punk, and Sun-Spider.Many of the Spider-Verse minifigures come with accessories. For instance, Spider-Punk has an electric guitar; Web-slinger, otherwise known as Patrick O'Hara, actually comes with a horse figure; and Pavitr Prabhakar's minifigure is accompanied by a cat figure that is reminiscent of Bodega Cat from Marvel's Spider-Man 2. Perhaps most notably, Peter B. Parker has a baby carrier that holds a mini-minifigure of his daughter Mayday.Here's the full list of minifigures in the Spider-Verse collection:Miles Morales (Spider-Man)Prowler (Miles G. Morales)Peter B. Parker (Old Spider-Man)Gwen Stacy (Ghost Spider)Spider-Punk (Hobart Brown)Sun-Spider (Charlotte Webber)Werewolf Spider-Man (Peter Parker)Spider-Byte (Margo Kess)Web-Slinger (Miguel O'Hara)Patrick O'Hara (Web-slinger)Cyborg Spider-Woman (Petra Parker)Pavitr Prabhakar (Spider-Man)It's not impossible to receive a duplicate in these minifigure mystery boxes, but it is unlikely. What is likely, however, is that you'll need to purchase more than two boxes to get all 12 characters in the Spider-Man: Across the Spider-Verse collection. Unless you're quite lucky.                      Spider-Man: Across the Spider-Verse Lego MinifiguresAmazon and other major retailers have deals on some pretty awesome Spider-Man Lego playsets and display models. One of the most notable deals is the 379-piece Iron Spider-Man Bust for $48 (was $60). You can also save on multiple buildable action figures and minifigure mechs. The 303-piece Iron Spider-Man Construction Figure is only $27 (was $30). If you want Iron Spider-Man to have a villain to fight, check out the 471-piece Green Goblin Construction Figure for $26 (was $35). Both of the Construction Figures are retiring soon, so snag these deals while you can.More Lego Marvel Spider-Man SetsIron Spider-Man Bust (379 pieces) -- $48 ($60)Iron Spider-Man Construction Figure (303 pieces) -- $27 ($30) | Retiring soonGreen Goblin Construction Figure (471 pieces) -- $26 ($35) | Retiring soonSpider-Man Mech vs. Anti-Venom (107 pieces) -- $13 ($15)Spider-Man Minifigures: Across the Spider-Verse 6-Pack -- $30Spider-Man vs. Doc Ock Subway Train Scene (393 pieces) -- $55Spider-Man vs. Venom Muscle Car (254 pieces) -- $30Spider-Verse Miles Morales vs. The Spot (375 pieces) -- $50Spidey: Spin & Electro Dinosaur Vehicle Chase (124 pieces) -- $20Venom Mech vs. Miles Morales (134 pieces) -- Sold out | Retiring soon                                                                                                                                               Iron Spider-Man and Green Goblin Construction Figures                                New Lego Star Wars BB-8 Droid Building Set Is Available Now                         Double Nintendo Switch 2 Console Storage For Only $33 With Samsung MicroSD Express Deal                         New Tom And Jerry Blu-Ray Anthology Drops To Lowest Price Yet                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (3)                 Arcade1Up Classic Special Edition Mortal Kombat Cabinet Gets First Discount                         Lego Spider-Man: Across The Spider-Verse Minifigure Mystery Box Restocked At Amazon                         Arcade1Up Ms. Pac-Man And Galaga Countercade Is Back On Sale At Amazon    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n\n            \n    "
  },
  {
    "title": "Pokemon Go January 2026 Events: Raid Bosses, Spotlight Hours, Community Day, And More",
    "url": "https://www.gamespot.com/articles/pokemon-go-events-raid-bosses-spotlight-hours-community-day/1100-6533384/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1578/15787979/4626293-4241267363-JvFmn36fH62yDIhVqUAfO8L7S_lco6KJ_q629XaWv1P9immIqBfWGrcXDpc8ffbj1WAC26U-i47z9NtaIzCA2oigE05H7okNjao%3De365-pa-nu-w1920.jpg",
    "tag": "Gaming",
    "date": "2025-12-31T20:30:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Pokemon Go's Precious Paths...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Pokemon Go's Precious Paths season rolls on with a variety of events in January. In addition to a new assortment of Raid bosses and Spotlight Hours, this month will see the arrival of a handful of new Pokemon, including the rock type Klawf and shiny Dhelmise.On top of that, the game will host two Community Days in January, and Unova's legendary dragons are returning to Gyms for a special Kyurem Fusion Day. The nefarious Team Go Rocket are also crashing the festivities later this month, culminating in another Shadow Raid Day event.There are plenty of other activities on the horizon beyond that. You can read more about the biggest Pokemon Go events happening in January below.Table of Contents [hide]January Raid ScheduleFive-Star RaidsMega RaidsShadow RaidsMax BattlesJanuary Spotlight HoursJanuary Community Day ClassicBonusesPinch PerfectFeatured PokemonBonusesKyurem Fusion DayBonusesHigh ZaptitudeJanuary Community DayBonusesPrecious PalsPrecious Pals: Taken OverShadow Raid DayInto The DepthsDynamax WeekendJanuary Raid ScheduleA handful of legendary Pokemon from the Unova region will make another appearance in five-star Raids this month, including Genesect, Thundurus, and Tornadus. Mega Raids, meanwhile, will see the return of Mega Blaziken, Mega Sceptile, and Mega Ampharos, and Shadow Cresselia will periodically appear as a special Shadow Raid boss throughout the month.You can see January's full Raid schedule below:Five-Star RaidsJanuary 5-16Genesect (Burn Drive)Genesect (Chill Drive)January 16-25Thundurus (Incarnate Forme)January 25-February 4Tornadus (Incarnate Forme)Mega RaidsJanuary 5-16Mega BlazikenJanuary 16-25Mega SceptileJanuary 25-February 4Mega AmpharosShadow RaidsWeekends in JanuaryShadow CresseliaMax BattlesDynamax Drampa (January 5-11)Dynamax Caterpie (January 12-18)Dynamax Beldum (January 19-25)Dynamax Roggenrola (January 26-February 1)January Spotlight HoursPokemon Go's weekly Spotlight Hour events return in January with a new batch of featured Pokemon and bonuses.Every Tuesday evening from 6-7 PM local time, a select Pokemon will appear in the wild more frequently than usual, making this a good opportunity to fill out your Pokedex and stock up on candy. In addition, you'll earn an extra bonus for participating during the event, such as double XP or Stardust for catching Pokemon.You can see January's full Spotlight Hour schedule below:January 6Featured Pokemon: BarboachBonus: 2x catch XPJanuary 13Featured Pokemon: MareepBonus: 2x evolution XPJanuary 20Featured Pokemon: HatennaBonus: 2x transfer candyJanuary 27Featured Pokemon: FoongusBonus: 2x catch StardustPokemon Go is kicking the new year off with a Community Day Classic event, which takes place on January 4 and gives you another chance to catch the penguin Pokemon Piplup.From 2-5 PM local time, Piplup will appear in the wild much more frequently, making this a great opportunity to catch some and stock up on Piplup candy. On top of that, you'll have increased odds of encountering a shiny Piplup.As before, Piplup's final form, Empoleon, can also learn an event-exclusive move if you evolve one within a certain time frame. Every Prinplup that you evolve into Empoleon by 9 PM local time on January 4 will automatically learn the water-type Charged Attack Hydro Cannon.Rounding out the event are a handful of bonuses. Any eggs that you place in Incubators during the event hours will hatch at a quarter of the distance they typically require. Incense and Lure Modules will also last longer than usual, and you may encounter a surprise when you take snapshots during the event.Bonuses1/4 egg hatch distanceIncense will last for three hours (excluding Daily Adventure Incense)Lure Modules will last for one hour and may attract the featured PokemonTake snapshots during Community Day for a surprisePinch PerfectPokemon Go's first major event of the month is called Pinch Perfect, and it runs from January 6-11.As part of the event, you'll have your first chance to catch the rock-type crab Pokemon Klawf. You'll be able to encounter one as a reward for completing Field and Timed Research tasks. Other crab Pokemon like Corphish, Dwebble, and Clauncher will also appear more frequently during the event, and shiny Dhelmise will be available for the first time.Along with the featured Pokemon, a few bonuses will be active throughout the event. You'll earn double XP every time you catch a Pokemon, and you'll have increased odds of encountering shiny versions of Corphish, Dwebble, and Clauncher.Featured PokemonWild EncountersCorphishDwebbleClauncherTirtougaArchenOne-Star RaidsCorphishDwebbleClauncherThree-Star RaidsDhelmiseDondozoBonuses2x XP for catching PokemonIncreased chance of encountering shiny versions of Corphish, Dwebble, and ClauncherKyurem Fusion DayUnova's three legendary dragons are returning to Raids for a Kyurem Fusion Day on January 10.From 2-5 PM local time, Reshiram, Zekrom, and both fused forms of Kyurem will rotate in and out of Raids. Not only will you have an increased chance of encountering shiny versions of the legendaries, but you'll also earn Fusion Energy for successfully clearing a Raid, which can be used to change your Kyurem's form.Along with the Raid bosses, a few bonuses will be active throughout the event. You can receive up to five additional Raid Passes for free when you spin the Photo Disc at Gyms, and the number of Remote Raid Passes you can hold will be increased temporarily to 20. The in-game shop will also offer an event ticket that grants you additional bonuses.BonusesReshiram, Zekrom, Black Kyurem, and White Kyurem will appear more frequently in RaidsReceive up to five additional free Raid Passes when spinning the Photo Disc at GymsIncreased chance of encountering shiny versions of Reshiram, Zekrom, and Kyurem in RaidsRemote Raid Pass limit will be increased to 20 from January 9-10High ZaptitudeElectric types are taking charge in a High Zaptitude event from January 13-18. More details about the event will be announced later this month.The grass-type chimp Grookey is the star of this month's Community Day, which takes place on January 18.From 2-5 PM local time, Grookey will appear more frequently than usual, and you'll have increased odds of encountering a shiny one.As with other Community Day Pokemon, Grookey's final form will also be able to learn a special move if you evolve one within a certain time frame. Each Thwackey that you evolve before 9 PM local time will automatically learn the grass-type Charged Attack Frenzy Plant upon evolving into Rillaboom.Finally, a variety of bonuses will be active during January's Community Day. You'll earn triple Stardust and double candy for catching Pokemon, and players level 31 and above will be twice as likely to get a candy XL. Additionally, any Incense and Lure Modules that you activate will last longer than usual, and trading Pokemon with other players will cost half as much Stardust.Bonuses3x Stardust for catching Pokemon2x candy for catching Pokemon2x chance to receive candy XL for catching Pokemon (players level 31 and above)Incense will last for three hours (excluding Daily Adventure Incense)Lure Modules will last for one hour and may attract the featured PokemonOne additional Special Trade can be madeTrades will require 50 percent less StardustTake snapshots during Community Day for a surprisePrecious PalsThe new year festivities continue with a Precious Pals event from January 20-25. More information will be shared closer to the event.Precious Pals: Taken OverTeam Go Rocket is emerging from the shadows once again to take over the Precious Pals event from January 23-25.Shadow Raid DayTeam Go Rocket's takeover will culminate with a Shadow Raid Day on January 24.Into The DepthsPokemon Go is closing out January with an event called Into the Depths, which runs from January 27-February 1. More details will be announced later this month.Dynamax WeekendTo cap off the Into the Depths event, Pokemon Go will hold a Dynamax Weekend from January 31-February 1.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]