[
  {
    "title": "Fortnite X South Park: All Skins And Free Event Pass Rewards",
    "url": "https://www.gamespot.com/gallery/fortnite-x-south-park-all-skins-and-free-event-pass-rewards/2900-7396/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1757/17577455/4632985-fortntiexsouthparkkeyart.jpg",
    "tag": "Gaming",
    "date": "2026-01-09T16:15:00.000Z",
    "description": "By     Phil Owen   on January 9, 2026 at 10:46AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    Phil Owen\n   on January 9, 2026 at 10:46AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Fortnite used to have event passes fairly regularly, but they fell by the wayside after Epic added the OG, Festival, and Lego passes to the Fortnite Crew subscription in 2024. Now, thanks to the new collaboration with South Park, Fortnite is trotting out its first event mini-pass since Chapter 5 Season 3. The Born in Chaos pass is completely free, and it requires completing quests in Battle Royale to make progress toward earning the rewards. To get through those quests a little faster, check out our Fortnite x South Park quest guide.The South Park event pass includes 12 tiers of rewards in the linear part of the pass--nine of which grant cosmetics, while the other three are level skips. You can make progress in the pass by completing Born in Chaos. Each of the Born in Chaos quests grant 400 CRED, and each tier of the pass requires 1,000 CRED to unlock. Currently, only the first of the six waves of quests is available, and it's only possible to unlock the first two tiers of the mini-pass until more quests become available next week.Beyond the linear pass, there's an additional reward, the Imaginationland Airship glider, which is unlocked by completing at least four of each batch of South Park quests. Obviously, that means you can't unlock it until every set of quests is available.The event pass does not include any skins, but the item shop has a bundle of five skins--Cartman, Kenny, Kyle, Stan, and Butters in mech suits--for 4,000 V-Bucks, as well as the Towelie sidekick, which is sold separately. The skins and the sidekick all cost 1,500 V-Bucks individually.Scroll on to see what exactly is on the Fortnite X South Park event mini-pass, as well as the cosmetics you can purchase in the item shop.Emoticon: Rest Well, KennyBanner IconBack Bling: Backpack of CREDSpray: Awesom-O AttackLoading Screen: Born in ChaosEmoticon: TowelieEmote: Cheesy Poofs RocketshipSpray: Awesom-O RevealPickaxe: Terrance and PhillipPickaxe: Terrance and PhillipItem Shop Skin: Eric CartmanItem Shop Skin: Kenny McCormickItem Shop Skin: Kyle BroflovskiItem Shop Skin: Stan MarshItem Shop Skin: Butters StotchItem Shop Sidekick: Towelie    \n  \n                      "
  },
  {
    "title": "Every GameCube Game Coming To Switch 2's Switch Online Library",
    "url": "https://www.gamespot.com/gallery/every-gamecube-game-coming-to-switch-2s-switch-online-library/2900-6400/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1597/15976769/4469385-switch-2-gamecube.jpg",
    "tag": "Gaming",
    "date": "2026-01-09T14:51:00.000Z",
    "description": "By     Lan Pitts   and     Darryn Bonthuys   on January 9, 2026 at 6:51AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this...",
    "body": "\n                            \nBy \n    Lan Pitts\n   and \n    Darryn Bonthuys\n   on January 9, 2026 at 6:51AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                After years of clamoring for the GameCube library to come to Nintendo Switch Online, the Nintendo Switch 2 adds the console and a few games to the Nintendo Classics collection. The GameCube library is now available as part of the Nintendo Switch 2 launch.The supported games feature a higher resolution than the original releases, and players can customize the controls as well. There is also a wireless controller designed after the original GameCube controller that offers a C button, and can also be used for non-GameCube games. There's a fun GameCube Easter egg when you start up the app that will be of interest to original GameCube owners.These GameCube games are only available to play for subscribers to the Switch Online + Expansion Pack tier. You can purchase that for $80 per year.Let's take a look at all of the games confirmed for Switch Online, including both those that are available now and those coming at some point in the future. As with Nintendo Switch Online’s other classic libraries, games will be added periodically and are subject to change.The Legend of Zelda: Wind WakerOut now? YesInitially released in 2002, Wind Waker's cartoonish style and gameplay won over fans and spawned sequels and spin-offs with 3DS titles like Phantom Hourglass and Spirit Tracks. F-Zero GXOut now? YesThe 2003 racing video game was a collaboration between Nintendo and Sega. It's the successor to F-Zero X, and continued the series' difficult, high-speed racing style, while keeping the basic gameplay and control system from the Nintendo 64 game.GX introduced a \"story mode\" element, a series first, where the player assumes the role of F-Zero pilot Captain Falcon through nine chapters while completing various missions. Players will be able to join three other friends in four-person races online or locally.Soulcalibur 2Out now? YesSoulcalibur II is considered to be one of the greatest fighting games ever made. It had improved graphics compared to its predecessor and introduced several new and guest characters, including Link (with four costumes) for the GameCube version.Super Mario StrikersOut now? YesFor some soccer fun, you can look forward to Super Mario Strikers on the Switch 2. First released for the GameCube in 2005--and the last Mario game published for that system--the game featured the plumber and his pals in five-a-side soccer matches.Each game could also become very unpredictable thanks to the power-ups on the field, making for some very exciting matches as the momentum shifted between teams. Two sequels would be developed over the years, starting with 2007's Mario Strikers Charged on the Wii and Mario Strikers Battle League for the Switch in 2022.Chibi-RoboOut now? No, but it will be available starting August 21Chibi-Robo follows a series of tiny robots, who are programmed to spread happiness. The game has the player cleaning Chibi-Robo's nearby environment, trying to collect \"Happy Points.\" All the while, making sure your battery doesn't die.The original game was released in 2005, with a sequel for the Nintendo 3DS entitled Chibi-Robo! Photo Finder. The original Chibi-Robo had a Japanese re-release in 2009 for the Wii and the final entry for the series, Chibi-Robo: Zip Lash, also for the 3DS released back in 2015.Super Mario SunshineOut now? NoTaking Mario on vacation to the tropical Isle Delfino, where he, Toadsworth, Princess Peach, and five Toads are trying to soak up some sun. Too bad a villain known as Shadow Mario is vandalizing the island with graffiti, with Mario getting wrongfully convicted for the mess.As punishment, Mario is ordered to clean up Isle Delfino, using a device called the Flash Liquidizer Ultra Dousing Device (F.L.U.D.D.), all the while saving Princess Peach from Shadow Mario. The game was re-released alongside Super Mario 64 and Super Mario Galaxy in the Super Mario 3D All-Stars collection on Nintendo Switch in September 2020.Fire Emblem: Path of RadianceOut now? YesFire Emblem: Path of Radiance is the ninth main installment in the Fire Emblem series, but the third to be released in the West in 2005. A direct sequel for the Wii, Fire Emblem: Radiant Dawn, was released in 2007 in North America and Japan, and later in 2008 for Europe and Australia.It was a rare example of cross-platform play, as players with save data from the Game Boy Advance Fire Emblem games were able to connect with Path of Radiance and access concept art and special maps revolving around characters from those games.Wario WorldOut now? YesWario's wonderfully weird 2003 game is now available to play. If you never jumped into the garlic-fueled oddity when it was first released, then you missed out on a fun adventure featuring Mario's bizarro counterpart as he faced off against a mysterious black jewel that had stolen his castle and loot.Luigi’s MansionOut now? YesMario's little brother's first solo outing broke away from the mold, and for the first time, a Nintendo console launched with a Luigi-centric title. Luigi's Mansion put the green-hat hero in the spotlight as he busted ghosts and solved puzzles to rescue his brother and friends.The game was re-released for the 3DS and had two sequels, the latest being a Nintendo Switch launch title back in 2019.Pokemon XD: Gale of DarknessOut now? NoPokemon XD was the successor to the GameCube title Pokemon Colosseum and also takes place in Orre, the setting of Colosseum's adventure mode.The game was first announced in March 2005 as a new GameCube game, but not as a sequel to Colosseum--later developments, as well as two promotional demo versions, confirmed the game would be very similar. Shadow Pokemon, first introduced in Colosseum, were a major gameplay element, with a Shadow Lugia being featured on the game's box art.While most of the gameplay recycled a lot of material from Colosseum, Pokemon XD became a fan favorite.Pokemon ColosseumOut now? NoThe GameCube Online library will also feature Pokemon XD's predecessor, Pokemon Colosseum. The game featured creature models ported from both Pokemon Stadium games. Pokemon Colosseum was a critical and commercial success, with lots of praise for its graphics and music.    \n  \n                      "
  },
  {
    "title": "Sims Team Says \"Values Are Unchanged\" Ahead Of Potential Saudi EA Deal",
    "url": "https://www.gamespot.com/articles/sims-team-says-values-are-unchanged-ahead-of-potential-saudi-ea-deal/1100-6537303/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4633137-thesims4statement.jpg",
    "tag": "Gaming",
    "date": "2026-01-09T19:11:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Electronic Arts' $55 billion...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Electronic Arts' $55 billion deal to sell itself to Saudi Arabia's Public Investment Fund, Jared Kushner's Affinity Partners, and the private equity firm Silver Lake still has to receive regulatory approval before it's finalized. However, some Sims fans and creators have been concerned about how Saudi Arabi's potential control over the company will affect the inclusive nature of the experience. To alleviate those concerns, the developers behind The Sims franchise wants players to know their core values haven't been changed by this deal.\"The values of The Sims are unchanged,\" reads the statement on the franchise's official page. \"Our Sims team's creative control, guided by our values of inclusivity, choice, creativity, community, and play, has not changed. These values inspire the decisions we make each and every day as we plan for today, tomorrow, and the future.\"Given Saudi Arabi's history of human rights abuses, the worried reactions from The Sims community appear to be understandable. Senators Richard Blumenthal and Elizabeth Warren have both raised their concerns about \"foreign influence\" on EA if the deal goes through. Subsequently, EA has asserted that it will retain creative control of the company following the sale.The Sims team's statement also reaffirmed its commitment \"to single-player life simulation experiences\" while teasing upcoming Sims experiences for PC, consoles, and mobile games. Playtesting for those experiences is expected to begin this year. The team also stated that, \"Project Rene has evolved into a social, collaborative, mobile-first life-sim game,\" and it's not intended to be a successor to The Sims 4. Instead, it's described as \"a new way to explore and play together within the growing Sims family of games, welcoming Simmers who want to connect directly with other players.\"Last year, EA said that it's sold too much DLC for The Sims 4 to even consider moving on to The Sims 5. The franchise also has a Sims movie in development, which is being produced by Margot Robbie's Lucky Chap production studio.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]