[
  {
    "title": "When Is The Next Steam Sale? Dates For 2026 Spring Sale And More Fests Revealed",
    "url": "https://www.gamespot.com/articles/when-is-the-next-steam-sale-date/1100-6532422/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4624627-steam-winter-sale-2025.jpg",
    "tag": "Gaming",
    "date": "2025-12-18T12:20:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                              While it's always a good...",
    "body": "\n                            \n          \n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                While it's always a good idea to save some cash toward the end of the month, Valve's quarterly Steam sales make it very tempting to dip into those rainy day funds. Fortunately, knowing when these sales will occur has gotten easier over time, as Valve no longer keeps people guessing about the dates.The company regularly posts the dates far in advance for its sales and promotional events, and for the upcoming Steam Winter Sale 2025, this will kick off on December 18 and runs through January 5, 2026.Beyond that, Valve has also dated several other events for the rest of the year, ranging from a fresh batch of demos being dropped in the February Next Fest to a spring sale starting in March. There'll also be promotions with specific focuses throughout the year, highlighting mystery, tower defense, and PvP games. Here's the full list of everything on the way.Steam Sales and Fests for 2026January 2026Detective Fest: January 12 - 19Board Game Fest: January 26 - February 2February 2026Typing Fest: February 5 - 9PvP Fest: February 9 - 16Horse Fest: February 19 - 23Steam Next Fest February 2026 Edition: February 23 - March 2March 2026Tower Defense Fest: March 9 - 16Steam Spring Sale 2026: March 19 - 26House & Home Fest: March 30 - April 6April 2026Hidden Object Fest: April 9 - 13Medieval Fest: April 20 - 27May 2026Deckbuilders Fest: May 4 - 11Ocean Fest: May 18 - 25Following the Summer Sale, the next big Steam event will be the Automation Fest in July, a showcase dedicated to games about factories, assembly lines, and making boardroom deals.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n\n            \n    "
  },
  {
    "title": "Sony’s Fight Against A Horizon Lookalike Has Come To An End",
    "url": "https://www.gamespot.com/articles/sony-fight-against-horizon-lookalike-has-come-to-an-end/1100-6537073/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4625513-light-of-motiram.jpg",
    "tag": "Gaming",
    "date": "2025-12-18T10:53:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Following its decision to sue...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Following its decision to sue Tencent for creating a \"slavish clone\" of its Horizon games, Light of Motiram, Sony has concluded its legal battle with the company. The game is no longer listed on Steam or the Epic Games Store, and the court case has been dismissed.That's according to new court documents filed earlier this week, and Tencent added that it has reached a \"confidential settlement\" with Sony Interactive Entertainment. \"SIE and Tencent are pleased to have reached a confidential resolution and will have no further public comment on this matter,\" head of communications for Tencent Americas, Sean Durkin, said to The Verge.Announced last year, Light of Motiram was quickly compared to Sony's Horizon series as it featured a very similar art direction and tone to the post-apocalyptic sci-fi series developed by Guerrilla Games. Both games featured vibrant environments and animal-like robots, and Sony was quick to file a lawsuit. Sony and Tencent eventually began discussions to resolve the dispute, with Sony demanding that Tencent pause all public promotion or testing for Light of Motiram.Tencent allegedly pitched Sony a Horizon game set in Asia, which was turned down, and the company later argued that Sony's lawsuit was an attempt to establish a monopoly on Horizon-like games. Sony, in turn, accused Tencent of playing a legal shell game to avoid facing the repercussions of allegedly infringing on its intellectual property.While it looks like Light of Motiram may be no more, a Horizon mobile game is currently in development. Recently, Sony and NCSoft announced a new MMORPG called Horizon Steel Frontiers for both mobile devices and PC.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Baldur's Gate 3 Actor Sounds Off On Using AI For Voice Roles: \"F**k AI In Performance\"",
    "url": "https://www.gamespot.com/articles/baldurs-gate-3-actor-sounds-off-on-using-ai-for-voice-roles-fk-ai-in-performance/1100-6537075/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4625546-screenshot2025-12-18at8.47.55%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-12-18T13:20:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Actor Neil Newbon, who voiced...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Actor Neil Newbon, who voiced Astarion in Baldur's Gate 3, has shared his thoughts on artificial intelligence in gaming, and he didn't mince words.\"Fuck AI in performance,\" Newbon told PCGamesN.He's talking about using artificial voice lines for games, like how Embark's The Finals and Arc Raiders do. For Arc Raiders, the studio hired human actors to record voice lines and then used AI systems to have their voices say lots of other things. Newbon pointed out that Arc Raiders has been a major commercial success, and he suggested that Embark bring back the actors to \"redo the lines.\"\"Maybe go back to those actors you paid however much money to clone their voices; maybe get them in the booth and re-record that stuff. Just saying. You've got the money now, spread the wealth,\" he said.\"I don't think there's a justification for taking people's jobs away,\" he added. \"I don't really think it's legitimate. If you're going to not record the lines in the first place and just use AI to take somebody's voice and manipulate it however the hell you want, that's a problem.\"\"Most actors, notoriously, are not rich. Most of us struggle [for] our entire career,\" he said.Embark has not disclosed the names of the voice performers in Arc Raiders, nor do we know their level of compensation. But Newbon said most actors are \"not rich\" and \"struggle for our entire career.\"Beyond all of this, Newbon said AI-created voice lines, as they exist today, simply sound \"boring.\"\"It's dull as hell. I don't believe it; it takes me out of the immersion. People are saying it helps the immersion because it's reactive. It takes me out of the experience because I just hear something that doesn't sound like a human being in jeopardy, or in combat, or excitement, or whatever emotion you're supposed to be aiming for,\" he said.Next up for Baldur's Gate 3 developer Larian is a new Divinity game. The company's CEO, Swen Vincke, recently discussed how the studio uses AI technologies in early-stage development efforts, but promised that nothing AI-created will appear in the final product. His comments caused a stir, prompting Vincke to respond, saying Larian is hiring more people, not fewer, and that AI is used to explore possibilities and not for actual production.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]