[
  {
    "title": "Best Loadouts In Warzone For BO7 Season 1",
    "url": "https://www.gamespot.com/gallery/best-loadouts-in-warzone-for-bo7/2900-7319/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1639/16394540/4618546-warzones101.jpeg",
    "tag": "Gaming",
    "date": "2025-12-08T19:11:00.000Z",
    "description": "By     S.E. Doster   on December 8, 2025 at 11:12AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases...",
    "body": "\n                            \nBy \n    S.E. Doster\n   on December 8, 2025 at 11:12AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Black Ops 7 has integrated with Call of Duty: Warzone for Season 1, adding the full BO7 weapon pool and attachments into the battle royale. While you can still use weapons from the last few years, the most powerful options are going to be the new Black Ops 7 guns. In this guide, we'll provide some recommended weapon builds for Warzone in Season 1 of Black Ops 7.Season 1 removes the Wildcard perks from Black Ops 6, and instead, you'll have Overkill by default. This means you can equip a second primary weapon without the need to select any specific perks to your loadouts. This also means there's no Gunfighter Wildcard, so you are limited to five attachments for each weapon build.The Gunsmith is mostly the same this year; however, one new addition is Black Ops 7's weapon build code feature. Weapon build codes are unique to each weapon and a specific set of attachments, making it easy to share and receive custom weapon builds.Simply hit L3 to view your options while you are in the Gunsmith. This will let you import a weapon build code to use. Additionally, any weapon builds you create in the Gunsmith will have a code generated at the bottom-left corner of your screen.We'll list the attachments for each build and include the unique weapon code so you can easily use it.Season 1 of Black Ops 7 overhauls Warzone's perk selection. Make sure to check out our guide for all Warzone perks for BO7, including some recommended perks to try for your loadouts.All our recommended Warzone loadouts can be viewed below, and we also have suggested multiplayer loadouts.MXR-17The MXR-17 is a powerful and easy-to-use assault rifle for long-range fights in Warzone. The recommended attachments will boost the gun's damage range, bullet velocity, and increase ammo count.The Greaves AccuSpot 3X is a great optic for most long-range builds, but if you're playing small map Resurgence and don't want the bigger scope, you can swap this out for something simple and clean like the Lethal Tools ELO.Recommended MXR-17 attachments:Optic: Greaves AccuSpot 3XMuzzle: Monolithic SuppressorBarrel: 17\" Greaves Scourge BarrelMagazine: Rhodes Drum MagStock: Winch StockBuild code: A03-26ERW-58T9U-11MK.78The MK.78 light machine gun is a heavy-hitting, long-range option for Warzone. The recommended attachments will help you reduce the gun's recoil, making this much more manageable to use at range.The recommended magazine is a Prestige attachment, so you might not have this unlocked yet, but it's a very impactful attachment for improving mobility and reducing recoil. You can substitute the Gravepack Extended Belt if needed to simply boost the ammo count until you unlock it.Recommended MK.78 attachments:Optic: Greaves AccuSpot 3XMuzzle: RL-7.62 CompensatorBarrel: 25\" EAM Heavy BarrelUnderbarrel: Bowen Sentry ForegripMagazine: MFS Heatshield Belt FedBuild code: L01-T49HC-5HZW-1X9 MaverickThe X9 Maverick is a three-round burst assault rifle with high damage, and it can be a powerful choice for long-range fights. The recommended attachments will greatly boost the gun's damage range and bullet velocity, as well as improve the aim-down-sight speed.Recommended X9 Maverick attachments:Optic: Greaves AccuSpot 3XMuzzle: Monolithic SuppressorBarrel: 16\" OS-Density BarrelRear Grip: Pillory GripFire Mods: 4.73 Caseless OverpressuredBuild code: A04-2JEC3-WMFDM-VJ11DS20 MirageThe DS20 Mirage assault rifle is another solid pick for assault rifles in Black Ops 7, but this gun also has a great build for a sniper support class. The recommended attachments will boost the ammo count, reduce recoil, and improve movement speed to make this gun work great for close to medium-range fights.Recommended DS20 Mirage attachments:Optic: Lethal Tools ELOMuzzle: Redwell 5.56 CompensatorMagazine: Andean Extended MagStock: Assault Division StockFire Mods: Recoil Sync UnitBuild code: A05-AUXZ3-94Q55-1MPC-25The MPC-25 submachine gun doesn't feel very powerful in multiplayer, but it's a powerful gun with a fast time-to-kill in battle royale. The recommended attachments will help reduce a lot of the weapon's recoil, and it will also boost the ammo count.This recommended build includes an optic for cleaner sights, but if you don't mind the iron sights, it's worth swapping the optic for the 14.5\" VAS Ashe Barrel for an increase to the damage range.Recommended MPC-25 attachments:Optic: Lethal Tools ELOMuzzle: K&S Brake-28Underbarrel: VAS Drift Lock ForegripMagazine: Sustain-25 Extended MagFire Mods: Recoil Sync UnitBuild code: S06-AV4J3-MWE75-1Kogot-7Season 1's new Kogot-7 submachine gun is another solid choice for close-range combat in battle royale. The Kogot-7 does have a bit of recoil, but the recommended attachments will work to reduce quite a bit of the gun's kick.Recommended Kogot-7 attachments:Muzzle: Hawker Series 45Barrel: 13.5\" Canis-05 BarrelUnderbarrel: Vas Drift Lock ForegripMagazine: Vex Expanse MagFire Mods: Buffer SpringsBuild code: S10-56XPL-8B31VS ReconThe VS Recon is a deadly bolt-action sniper rifle, and this is a popular choice for sniping in Season 1. The recommended attachments will increase the damage range and bullet velocity, and also reduce some of the weapon's kick.The recommended underbarrel attachment is a Prestige attachment, so you might not have unlocked this yet, and you can substitute it for the Stetig-C Handguard if needed.Recommended VS Recon attachments:Muzzle: Monolithic SuppressorBarrel: 23\" G-Force BarrelUnderbarrel: MFS R-Stop HandguardRear Grip: R-1 Shelf GripFire Mods: 7.62 NATO OverpressuredBuild code: R01-21WSG-L369K-P711    \n  \n                      "
  },
  {
    "title": "PS5 Was The No. 1 Best-Selling Console This Black Friday In The US",
    "url": "https://www.gamespot.com/articles/ps5-was-the-no-1-best-selling-console-this-black-friday-in-the-us/1100-6536765/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4618420-ps5.jpg",
    "tag": "Gaming",
    "date": "2025-12-08T18:13:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          The PlayStation 5 dominated...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                The PlayStation 5 dominated Black Friday sales in the US, according to new data shared by Circana, which tracks gaming sales in the US.Circana's Mat Piscatella said Sony's console made up 47% of total Black Friday week hardware unit sales, outpacing the Switch 2 (24%) and Nex Playground (14%). He didn't share any data about how Xbox performed.\"So, yeah, Black Friday week is extremely promotional for video games. Stuff that does not price promote (generally speaking, here) does not see much of a seasonal lift at all from the prior week (usually none). BF Week performance can correlate closely to what's being promoted and by how much,\" Piscatella said.He added: \"On the hardware side, PS5 saw the most extensive discounting. So, it got a big sales lift. Wouldn't take much more away from the week than that, tbh.\"Indeed, the PS5 was discounted substantially for Black Friday, with Sony selling the consoles for about $100 off. Retailers offered discounts on Xbox consoles and the Nex Playground as well. For anyone unaware, the Nex Playground is an AI-powered console similar to Kinect, featuring a camera to track bodies for interacting with games. The Nex Playground outsold every PS5 and Xbox model the previous week in the US.In the UK, the PS5 dominated as well, making up 62% of all console sales. By comparison, Switch 2 made up 23% of sales, with Xbox following with 10%. The PS5 Pro in particular was a big hit in the UK for Black Friday, recording its best week for sales since launch in November 2024.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "All Missile Expansion Locations In Metroid Prime 4: Beyond",
    "url": "https://www.gamespot.com/gallery/metroid-prime-4-beyond-missile-expansion-locations-guide/2900-7316/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1816/18167535/4616999-metroid-prime-4-missile-expansion-locations-guide-.jpg",
    "tag": "Gaming",
    "date": "2025-12-08T17:13:00.000Z",
    "description": "By     Jason Rodriguez   on December 8, 2025 at 9:13AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Jason Rodriguez\n   on December 8, 2025 at 9:13AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Are you hoping to acquire all Missile Expansions in Metroid Prime 4: Beyond? While you do obtain the Missile Launcher fairly early in the campaign, the ammo for your weapon is quite scarce. Thankfully, each Missile Expansion increases the maximum capacity by +5 rockets, allowing you to blast your foes with impunity. There are also larger variants that grant +10 ammo.Fury Green: Missile Expansions mapThe map above shows the locations of the Metroid Prime 4: Beyond Missile Expansions in the Fury Green region. This is the first major zone in the campaign proper, and you're bound to return to it to find various goodies.Fury Green Missile Expansion #1Sub-zone: Cargo LauncherLocation: Found in the zone's main entrance--i.e. where you see the device that launches you to Sol Valley. Return here after getting the Psychic Boots from the Volt Forge. Then, make the psi-platforms materialize so you can grab the item.Fury Green Missile Expansion #2Sub-zone: Broken HallLocation: After you beat the Carvex boss and obtain the Psychic Bomb ability, you'll go through a narrow passageway in your Morph Ball form. To your left, there's an object that you can blow up with your Psychic Bomb.Fury Green Missile Expansion #3Sub-zone: Reflection ChamberLocation: This Missile Expansion can be found in the room with the giant mech--i.e. the one near the base camp. That said, it'll probably be the last one that you obtain from this particular zone. That's because it's inside a heavy container that can only be destroyed once you have the Super Missile upgrade from the Great Mines area.Fury Green Missile Expansion #4Sub-zone: Cliffside GateLocation: Found in the same area that has an Energy Tank. Revisit this place once you have the Psychic Boots and hop on the ledges to grab your prize.Fury Green Missile Expansion #5Sub-zone: Grove of the Sacred TreeLocation: You'll stumble upon this Missile Expansion in Metroid Prime 4: Beyond quite early in the game. Basically, after you rescue Mackenzie, you'll see two resin-covered walls in the Grove of the Sacred Tree. One has a doorway that leads to the next area. The other, meanwhile, has a small nook that contains this item.Fury Green Missile Expansion #6Sub-zone: Resin CreekLocation: Resin Creek is part of the section with narrow passageways that are close to the first save point in the zone. Defeat the Carvex boss first to receive the Psychic Bomb. Then, return to this area and look for a large orange fruit. Transform into a Morph Ball, jump, and drop a bomb charge to destroy it.Volt Forge: Missile Expansions mapThe map above shows the locations of the Missile Expansions in Volt Forge. You can head to this zone after using the launcher in Fury Green. It's also where you acquire the Vi-O-La motorcycle, which makes exploration a breeze.Volt Forge Missile Expansion #1Sub-zone: Tower 1 - Facility ApproachLocation: Enter Volt Forge proper to trigger a cutscene. Then, check the back of a nearby metal container.Volt Forge Missile Expansion #2Sub-zone: Tower 1 - Loading AirlockLocation: Revisit this area once you have the Psychic Boost Ball upgrade. Use your Morph Ball boost repeatedly in the device until the metal container rams and dislodges the cargo.Volt Forge Missile Expansion #3Sub-zone: Tower 1 - Speed Tunnel CLocation: You can acquire this Metroid Prime 4 Missile Expansion by going to the track that connects Tower 1 to Tower 3. Look above you to spot an item, then walk to the edge of the track. Fire your Control Beam and guide the projectile to the interior of the shaft until it hits the glyph.Volt Forge Missile Expansion #4Sub-zone: Tower 1 - Irradiation FloorLocation: You can also get this upgrade once you have the Psychic Boost Ball. At the bottom of the Irradiation Floor, turn into the Morph Ball and keep using the boost on the half pipes.Volt Forge Missile Expansion #5Sub-zone: Tower 1 - ProcessingLocation: Transform into a Morph Ball and hop on top of the pedestal. Keep using the Psychic Boost Ball ability until the item is revealed.Volt Forge Missile Expansion #6Sub-zone: Tower 2 - Receiving LobbyLocation: Restore the electricity in Tower 2, then return to the topmost floor. Interact with the terminal and transform into a Morph Ball. Squeeze through the gap and roll all the way to the center to claim the item.Volt Forge Missile Expansion #7Sub-zone: Tower 3 - CertificationLocation: Just before the boss arena at the bottom of Tower 3, you should see a cave-in to your right. Fire a missile to destroy the rocks, then use your psychic powers to trace the pattern on the floating container.Volt Forge Missile Expansion #8Sub-zone: Tower 3 - CertificationLocation: There's a mechanism in the corner of the room just outside the save point. You need to pull the latch open with the Psychic Grapple. Then, blast the core several times with the Thunder Shot until the container opens.Ice Belt: Missile Expansions mapThere are several Metroid Prime 4 Missile Expansions in the Ice Belt zone. Some of these can be acquired during your first visit. The rest, however, require various Power Suit upgrades and abilities, including the Psychic Grapple and Psychic Spider Ball.Ice Belt Missile Expansion #1Sub-zone: Surface - Loading CraneLocation: Upon entering the Ice Belt zone, look for a device behind some crates. Turn into a Morph Ball and activate it with your Psychic Bomb.Ice Belt Missile Expansion #2Sub-zone: Surface - Ancient TempleLocation: You need the Psychic Grapple and Thunder Shot for this item. Both abilities allow you to reach the Ancient Temple sub-zone, which is also where you unlock the Psychic Spider Ball upgrade. Note that the Missile Expansion is off to the side of the steps leading to the chamber.Ice Belt Missile Expansion #3Sub-zone: Bio-Labs - Bio-Labs AccessLocation: Acquire the TK Codes and the Psychic Lasso ability on your first visit to Ice Belt. Then, pry open the door to the right of the purple glyph. Use the lasso to pull the debris away.Ice Belt Missile Expansion #4Sub-zone: Bio-Labs - Lobby CircuitLocation: You'll see this particular section as you're making your way back to the top of the facility after restoring power. However, you can only reach the very top in Morph Ball form once you have the Psychic Spider Ball ability. Tether onto the circular indentations, then use your Psychic Bomb to activate the two nodes at the top. You need to do this before the barricades blocking the item completely shut.Ice Belt Missile Expansion #5Sub-zone: Medical Bays - Surgery CorridorLocation: While exploring the back portion of the Medical Bays, you'll notice a grate that you can pull with the Psychic Lasso. Enter it via Morph Ball and blow up the obstacle that's blocking the path.Ice Belt Missile Expansion #6Sub-zone: Medical Bays - Staging CorridorLocation: You're likely to spot this particular Metroid Prime 4 Missile Expansion while exploring the Medical Bays. That said, you can only gain access to this room after fully restoring power to the facility. A Griever will emerge from one of the rooms when you return to this floor. Enter that room and go through the hole via Morph Ball.Ice Belt Missile Expansion #7Sub-zone: Medical Bays - Storage BayLocation: This item is in the chamber that has a frozen Griever specimen and thousands of experiment pods lining the walls.  Make sure you have the aforementioned Psychic Spider Ball ability first.Drop down to the lower area of this room and enter the hole via Morph Ball.Latch onto the railing and destroy the bot with your Psychic Bombs.Use your Psychic Bombs to jump and reach the Missile Expansion. This can be done by placing one bomb, and then waiting for a couple of seconds before placing the second bomb. Activate the third bomb immediately as soon as you get tossed in mid-air. With a bit of luck, your \"bomb jump\" should help you grab this item.Ice Belt Missile Expansion #8Sub-zone: Quarantine - Elevator LandingLocation: This Missile Expansion is in a locked room just before the boss' arena. You need the Thunder Shot to unlock the metal gate.Flare Pool Missile Expansion #1Sub-zone: Volcano EntranceLocation: In the first room in Flare Pool, use your psychic powers to make several platforms materialize. Then, hop on top of them with your Psychic Boots.These are the Metroid Prime 4: Beyond Missile Expansions that we've obtained so far. We'll let you know once we find several others, so stay tuned.Venture forth across the endless dunes of Viewros and delve deeper into long-forgotten alien facilities. If ever you need help with various facets, you can always visit our Metroid Prime 4: Beyond guides hub.    \n  \n                      "
  }
]