[
  {
    "title": "Elder Scrolls TV Series Is Possible, Says Todd Howard",
    "url": "https://www.gamespot.com/articles/elder-scrolls-tv-series-is-possible-says-todd-howard/1100-6536747/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4617616-elderscrollsonline.jpg",
    "tag": "Gaming",
    "date": "2025-12-07T17:58:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Later this month, Fallout will...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Later this month, Fallout will return for Season 2 on Prime Video. It's not the only Bethesda adaptation coming to Amazon's streaming service--a Wolfenstein show is coming as well--and some fans are hoping to see The Elder Scrolls game follow. Bethesda's Todd Howard--who has worked as a producer on Fallout and Elder Scrolls titles--won't rule out the possibility that it could happen. But don't expect an Elder Scrolls series anytime soon.While speaking with Eurogamer, Howard said that he \"can't rule in or rule out an Elder Scrolls thing in the future,\" before adding that he thought Fallout was more suitable as an adaptation because it had \"more to say in its genre.\"\"But you never know,\" added Howard. \"I think the impact of the show on Fallout as a franchise has been bigger than I expected, so it does make you think like, 'Hey, is there a path?' But nothing today… [and] I'm willing to say 'no' for a decade.\"Howard related that it took over a decade to bring Fallout to live-action, and \"people were asking to do a movie or show for Fallout\" since Fallout 3 was released in 2008. When asked about Bethesda's live-action Wolfenstein series on Prime Video, Howard said it wasn't his place to talk about it and added that any word will come from MachineGames, the Bethesda-owned developer behind the reboot of the Wolfenstein games.During another recent interview, Howard expressed regret that he announced The Elder Scrolls 6 in 2018. He also stated that the much-anticipated sequel is, \"still a long way off.\"\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "TGA 2025 Predictions: What's Going To Happen At The Game Awards?",
    "url": "https://www.gamespot.com/gallery/tga-2025-predictions-whats-going-to-happen-at-the-game-awards/2900-7307/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4616375-tga.jpg",
    "tag": "Gaming",
    "date": "2025-12-07T14:00:00.000Z",
    "description": "By     GameSpot Staff   on December 7, 2025 at 6:00AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    GameSpot Staff\n   on December 7, 2025 at 6:00AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                One of the biggest days of the year for video game news comes each December, when The Game Awards takes place. 2025 should be no different, and while we'll have to wait until December 11 to see just what Geoff Keighley and co. have in store, we already have some thoughts on what might show up.Whether it's the long-awaited Half-Life 3 announcement or more news on games we already know are coming, like Final Fantasy 7 Remake Part 3 and Silent Hill: Townfall, it could be a very exciting night of news if these predictions all come true. They probably won't, but hey, isn't that part of the fun?Half-Life 3 finally announcedPredicting Half-Life 3 will actually be announced--anywhere, at any time, not just at The Game Awards--feels like you're setting yourself up to look like a fool. And yet I do feel there's reason to believe it will finally happen. Valve may not release games as often as it once did, but it now has a specific, good reason to deliver such a marquee game: the Steam Machine.Setting aside the various rumors and claims we've heard about Half-Life 3 over the years--and even the datamining, which I do believe points to something stirring in the background--we now have a legitimate rationale for Valve to divert its attention from elsewhere to deliver one of the longest-awaited sequels ever. We already know the Steam Machine won't be priced especially aggressively to gain a foothold in the market, so what better way to help further justify that potentially higher-than-console pricing than by releasing a must-play game for it? -- Chris PereiraFinal Fantasy 7 Remake Part 3The Final Fantasy 7 Remake trilogy that began in 2020 is just a single game away from being complete, and it wouldn't be unusual to see Square Enix announce it at The Game Awards. There is precedence for this, as Final Fantasy 7 Rebirth was announced during Geoff Keighley's 2023 Summer Games Fest show, and Square Enix has confirmed that it knows exactly when it will formally reveal the threequel.Will it stick to the naming convention of the previous two games and be called Final Fantasy Reunion? Will we see even more yellow paint? And will the topsy-turvy story revolving around multiversal theories and destiny-defying battles finally make sense at the end of it all? These are all questions a teaser trailer could potentially answer. -- Darryn BonthuysThe Blood of DawnwalkerThe Witcher 4 isn't expected to be out until 2027 at the earliest--and it won't be at this year's The Game Awards either--but The Blood of Dawnwalker is shaping up to be a game that could scratch your itch for swords and sorcery. Developer Rebel Wolves has several Witcher veterans helping put together this third-person action game, which sees players explore 14th-century Europe and battle monsters on a quest to rescue their family. We've seen The Blood of Dawnwalker pop up throughout the year--with a big gameplay trailer dropping during the August Future Games Show--and a fresh look at the supernatural medieval adventure ahead of its 2026 release on PC and console would be welcome. -- Darryn BonthuysMax Payne 1 and 2 RemakesBorderlands 4 expansionThe best stories in Borderlands games don't come from the main campaigns, but rather, their expansions. Tiny Tina's Assault on Dungeonkeep, The Claptastic Voyage, and Moxxi's Heist of the Handsome Jackpot are just a few prime examples, which means that Borderlands 4 has some big post-launch boots to fill. We already know what the first expansion will be, as Mad Ellie and the Vault of the Damned has been described as a bloody, cosmic-horror-inspired tale. That sounds like a fun time when viewed through a Borderlands lens, and we'd love to see a teaser trailer for all the chaos that'll be unleashed when it arrives in 2026. -- Darryn BonthuysThe Next 3D Mario Gets A Teaser2025 marks the 40th anniversary of Super Mario Bros., and even though the character existed for years prior to this, it's understood as a significant milestone--just look at this year's Macy's Day Parade. Nintendo is obviously working on a 3D Mario game, seeing as it has been more than eight years since Super Mario Odyssey's release, but why wait until next summer's not-E3 festivities to give fans their first look? Hot off the success of Donkey Kong Bananza, Nintendo has the opportunity to show eager players just what the Switch 2's increased power could mean for the Mushroom Kingdom … or at least the Mushroom Kingdom when everyone's not driving a kart. I don't expect we'll see much, but The Game Awards would be the perfect time to tease what's next for everyone's favorite mustachioed plumber. -- Gabe GurwinMarvel's Wolverine TrailerInsomniac started rolling out the red carpet for its next big superhero game earlier this year, which makes now the perfect time to ramp up its hype cycle. We're bound to get a closer look at Wolverine this year, likely focusing on story details to give us a better idea of what villains Logan will be dealing with. We already know this one will be more adult than the sister Spider-Man series, since Wolvy's power lends itself to disemboweling, so we'll be curious to see who he's going to \"snikt\" his way through. -- Steve WattsPlayStation Cross-Buy AnnouncementPlayStation's biggest announcement may not be a game at all, but rather a competitive volley into Microsoft's turf. There have been rumors of a potential cross-buy scheme with PlayStation games now that the platform-holder has started regularly porting its biggest games to PC. Cross-buy for PlayStation games would potentially let you buy a game once and own it on both PlayStation and PC, a pro-consumer boon that would be especially welcome in the current gaming environment. Microsoft and Sony are both making pushes to remove the platform walls on their games, and this would be a big step in that direction. -- Steve WattsNew Mina the Hollower dateYacht Club Games recently announced a last-minute delay for Mina the Hollower, its anticipated follow-up to Shovel Knight and its first original franchise since that game launched more than a decade ago. It was posed as a fit-and-finish delay, but it was also indefinite. Now that a few weeks have passed, Yacht Club should be ready to give us a new and hopefully final release date, likely sometime early next year. This one could just be a brief trailer or part of the TGA pre-show, but the timing would make sense. -- Steve WattsState of Decay 3 arrives in 2026 It's been a while since we've heard much about State of Decay 3, the much-anticipated open-world zombie survival sequel from Undead Labs. I think it could be not just one of Xbox's biggest games in a long time, but that it'll become that starting next year. The time feels right for the team to announce a release date, though for now, I expect the trailer to end with a vague \"2026,\" and no other specifics. We've mostly seen cinematic trailers so far, so an exciting new trailer that gives us a helping of actual gameplay would be both exciting and, I think, right on time. -- Mark DelaneySilent Hill: Townfall re-emergesAmid the Silent Hill renaissance many have been enjoying these last few years, one previously announced game still eludes the public eye: No Code's Silent Hill: Townfall. The team behind indie horror standouts Observation and Stories Untold was one of several teams with a reveal to share back in 2022, but while Silent Hill 2 remake and Silent Hill f have since arrived to largely critical acclaim, Townfall is still shrouded in mystery. What kind of game will it even be? I expect the team's prior games--which were more akin to adventure games than a traditional Silent Hill experience--is what players should anticipate, and I think we'll have that confirmed at The Game Awards 2025. -- Mark DelaneyMore details on Disney's Fortnite projectDisney and Epic announced a $1.5 billion collaboration in February 2024 as part of which Disney said it would work with the Fortnite developer to create \"expansive and open games\" and a wider \"entertainment universe\" connected to Fortnite. As of yet, however, we haven't seen or learned much about what this means in practice. I am hoping Epic and Disney finally divulge more about this collaboration at The Game Awards and give fans a reason to get hyped. It wouldn't take all that much. After all, for a Disney superfan like me, the idea of a \"virtual Disney World\" is already highly compelling just for the sake of its existence.Disney has some of the best-known franchises and is known for the care and attention it applies to its creative storytelling, and I am keen to see how this translates into a Fortnite project. After all, Fortnite is not just a battle royale game--it's a platform, or a metaverse, for all kinds of connected experiences. I'm hoping Disney and Epic can deliver something magical with whatever the companies are cooking up together in the world of Fortnite. -- Eddie MakuchArkane Lyon's Blade Gets First Full-Length TrailerShortly after Arkane Lyon revealed Marvel's Blade at 2023's The Game Awards, the studio's creative director, Dinga Bakaba, told audiences not to expect additional announcements about the game anytime soon. It's been two years since Bakaba braced us for a long, quiet wait, and that seems like just about the right amount of time for a studio to hold off before offering a more substantial look at its next game. As such, I think we'll see our first full-length trailer for Marvel's Blade--one that will hopefully give us a bit of a deeper look at what its gameplay might look like, and how Arkane Lyon's previous work on Dishonored and Deathloop will help shape Blade's core experience. -- Jessica CogswellDiablo 4 Second Expansion Reveal Bloomberg reporter Jason Schreier may have said that Geoff Keighley's tease of a demonic statue in the desert isn't related to Diablo 4, but that doesn't mean Blizzard's ARPG won't make an appearance at the show. Blizzard has been hard at work on seasonal updates and major system reworks over the course of 2025, but has not yet released its plans for 2026. If Diablo 4 is still slated to receive its second expansion in 2026 as planned, The Game Awards would be the perfect place to debut a new, top-notch cinematic teasing what's next for the dark fantasy world of Sanctuary. The timing would also make sense given that BlizzCon 2026 isn't until September. What exactly Diablo 4's next expansion will entail is unknown, but it's likely to introduce a new region of the world to explore, more game mechanics, and an additional class. If rumors are to be believed, that new class might even be the fan-favorite Paladin, which would also make for a great TGA reveal. -- Cameron KochTekken 8 Season 3 DLC RevealTekken 8 is currently in a rough spot. The community spent much of Season 2--which began in March with Anna Williams and ended December 2 with new character Miary Zo--pushing back against the season’s biggest gameplay changes. The Game Awards, which played host to a landmark Tekken 8 announcement last year when Clive from Final Fantasy XVI joined the roster, comes at an opportune time, as a big Season 3 announcement could right the ship. I think it’s going to happen, and I also think the announcement will come paired with a guest character, which would be the first since Clive.As for who that guest will be, Tifa Lockhart is a heavily-requested choice, and with FF7 Remake Part 3 looming, the stars seem to be aligning for it to happen. Tekken can get weird with its guests though (hello Negan), so let’s throw an out-of-left-field name in the ring too: The Bride from Kill Bill. -- Jason FanelliNew characters for Marvel Tokon: Fighting SoulsMarvel Tokon: Fighting Souls shook the fighting game community to its core when it debuted in June. A tag-based fighting game, with Marvel characters, and a new four-on-four format, not made by Capcom?! Interest was piqued, but even after two closed beta sessions and a few more trailers, no additional characters have been revealed since that June debut. I think that changes at The Game Awards, and we get new characters for the playable Marvel Tokon roster.There are a few good candidates to choose from, and since the game is introducing four-on-four combat, I’m predicting we’ll get four more characters. Let’s go with Hulk as a big bruiser, Black Widow as a projectile-heavy zoner, Groot and Rocket Raccoon as a two-in-one, and Wolverine as a classic rushdown fighter. -- Jason FanelliResident Evil Requiem Introduces A Veteran RE CharacterEach trailer for Resident Evil Requiem has deepened the mystery of the franchise’s return to Raccoon City. However, while the location has been featured, none of the characters we grew to love while fighting through it have yet to surface. I think that changes at The Game Awards, and a new Requiem trailer will reintroduce a familiar face.Many fans expect Leon Kennedy to be the one to show up, and he does make sense. However, he’s not the only one with ties to Raccoon City. Although we saw Chris Redfield in RE Village, his sister Claire hasn’t been seen in quite some time. Then again, and perhaps more interestingly, neither has Chris’s original partner Jill Valentine. Either of those heroines from RE history would fit the bill for a support role in Requiem. -- Jason FanelliA Deeper Look At Persona 4 RevivalFollowing several rumors and leaks, the Persona 4 remake, Persona 4 Revival, was finally announced earlier this year. The game made its first appearance as part of Xbox's Summer Game Fest Showcase with an extremely brief trailer that essentially just confirmed its existence and showed off the game's silver-haired protagonist. Six months have passed since that first look, and I'm optimistic that a longer trailer--one showcasing the game's new voice cast, more gameplay, any changes or quality-of-life updates, and perhaps even its release date--will be featured as a part of The Game Awards. Considering the time between Persona 3 Reload's announcement and release date was roughly six months, this doesn't seem too far-fetched, but I'll cross all my fingers and put \"Heartbeat, Heartbreak\" on repeat just in case. -- Jessica CogswellFable Finally Gets A Release Date Despite everything, it still seems like Xbox is currently hard at work on the next Fable game. In the five years since the action-adventure title was first announced, we've seen two short trailers: one showcasing its endearingly cheeky British writing, and another that featured pre-alpha gameplay. Based on both of these, the upcoming reboot looks to be a polished return-to-form for the series, but we still haven't seen quite enough of the game to be sure. That said, I'm hoping for a lengthier trailer--one that hopefully includes a release date as well--to be shown at The Game Awards. -- Jessica Cogswell    \n  \n                      "
  },
  {
    "title": "Fallout's Ella Purnell Shoots Down Potential Romance For Lucy",
    "url": "https://www.gamespot.com/articles/fallouts-ella-purnell-shoots-down-potential-romance-for-lucy/1100-6536744/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4616828-falloutseason2ellapurnell.jpg",
    "tag": "Gaming",
    "date": "2025-12-06T01:20:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Fallout Season 2 is just around...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Fallout Season 2 is just around the corner, and Amazon Prime Video has largely kept this season's storyline a secret. But there's one thing we can be reasonably certain about: Ella Purnell's Lucy won't be having a romance with Walton Goggins' Ghoul now or ever.During an interview with Geek Culture, Purnell was with Goggins and Aaron Moten when she shot down the very idea of a love affair between Lucy and the Ghoul.\"Here's what I would say: you guys need therapy,\" said Purnell. \"You can't fix him. You can't save him. Let it go. Let it go, hon.\"Goggins expressed surprise at the fan-shipping between Lucy and the Ghoul, while Purnell said she's asked about it all of the time.Following the first season finale, the Ghoul and Lucy are heading for New Vegas. He's looking for the location of his wife and child, while Lucy is searching for her father.Purnell reiterated that Lucy and The Ghoul won't be romantic partners, but she did say that their bond is a \"really beautiful thing\" before adding, \"they're both looking for the people that they love. Let's leave it at that.\"Although Goggins recently lent his voice and likeness as the Ghoul to Fallout '76, he added that he has never played the Fallout video games and doesn't want to.Fallout Season 2 will premiere on December 17 on Prime Video, with new episodes released weekly through February 4, 2026.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]