[
  {
    "title": "If You Preordered Battlefield 6 Directly From EA, You've Been Compensated",
    "url": "https://www.gamespot.com/articles/if-you-preordered-battlefield-6-directly-from-ea-youve-been-compensated/1100-6535390/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1647/16470614/4583842-battlefield6launchweekendissues.jpg",
    "tag": "Gaming",
    "date": "2025-10-13T17:43:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Battlefield 6's rollout on...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Battlefield 6's rollout on publisher Electronic Arts' own PC app didn't go exactly smoothly, with players left unable to play on launch day. Since then, the issue has since been resolved, and EA is giving out free season passes and XP boosts for those who were impacted.The issue affected players who had pre-ordered Battlefield 6 via the EA App launcher on PC. An outage on the app left those players high and dry for a good chunk of launch day on October 10. To make things right, EA has issued 12 double hardware XP boosts and 12 double career XP boosts to players affected by the outage.\n  \n              Click To Unmute\n        \n        Want us to remember this setting for all your devices?\n      Sign up or Sign in now!\n      \n      Please use a html5 video capable browser to watch videos.\n    \n      This video has an invalid file format.\n    00:00:00Sorry, but you can't access this content!\n          Now Playing: Battlefield 6 Essential Starter Guide\n      \nIn addition, EA is throwing in a free premium battle pass for Battlefield 6's upcoming Season 1. Those who already own the premium Season 1 battle pass through the game's pricier Phantom Edition will instead receive the Season 2 battle pass for free.Despite the EA App hiccups, Battlefield 6's launch was surprisingly smooth across platforms, especially compared to previous launches for the franchise, many of which resulted in extended periods of server downtime.That said, some players did run into a few other issues players during the launch weekend. One bug, which saw jump momentum affected while using certain weapons, has already been fixed. A problem that still needs addressing allows players in multiplayer matches to get out of bounds and onto rooftops that aren't supposed to be accessible, creating problems for those in a match who aren't taking advantage of the exploit. It remains to be seen when a fix will be coming.Battlefield 6 saw a huge launch weekend, surpassing 747,000 concurrent players on Steam at its peak on launch day. Factor in those playing through the EA App or on consoles, and Battlefield 6 certainly looks to be off to a strong start overall. Battlefield 6 Season 1 will begin October 28, and will introduce multiple new maps, modes, weapons, and more to the game's all-out-warfare sandbox.In GameSpot's Battlefield 6 review, writer Richard Wakeling gave the latest installment of the franchise an 8 out of 10. He noted that while its campaign is dull and forgettable, there's nothing quite like the multipronged chaos of its excellent multiplayer package, even if Battlefield 6 doesn't feel particularly fresh or new.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "The Cast Of Baldur's Gate 3 Auditions For Each Other's Characters",
    "url": "https://www.gamespot.com/articles/the-cast-of-baldurs-gate-3-auditions-for-each-others-characters/1100-6535364/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1597/15971423/4583208-feature_bg3castswaproles.jpg",
    "tag": "Gaming",
    "date": "2025-10-13T15:00:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Baldur's Gate 3's cast has been...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Baldur's Gate 3's cast has been widely acclaimed since the game's release, from Neil Newbon's award-winning role as Astarion to Tim Downie (of Paddington fame) as Gale. But how would the characters--no, not the actors--do if they were auditioning for a different role in the game? We thought that sounded like a great idea, so we got some of the fan-favorite cast together and, potentially under duress, had them audition for new roles.\"I'm Gale of Waterdeep, and I am going to be reading for the role of Lae … of Lae'zel,\" Downie said. \"I smell their blood on you, still! I smell your sweat!\"Given that Gale is quite polite and a cat dad, it's tough to imagine him ever having Lae'zel's bloodlust, not to mention her sexual forwardness. That being said, we would very much like an entire game where that is exactly what we get.\n  \n              Click To Unmute\n        \n        Want us to remember this setting for all your devices?\n      Sign up or Sign in now!\n      \n      Please use a html5 video capable browser to watch videos.\n    \n      This video has an invalid file format.\n    00:00:00Sorry, but you can't access this content!\n          Now Playing: Astarion as Shadowheart? BG3 Cast Tries New Roles!\n      \nNeil Newbon's Astarion, meanwhile, read for the role of Shadowheart, with Jennifer English standing by his side and physically forcing him to kneel: Kneel Newbon. Astarion seemed less than thrilled with the situation.\"I am auditioning for the role of Shadowheart, under no duress … of my own free … free will,\" he said, while looking up at English to make sure he hadn't done something wrong.One of the best was Wyll actor Theo Solomon's turn as Minsc--a ranger who, if he were a cat, would definitely be orange.\"No, Boo! The druid did not beat Minsc at arm wrestling! It is not fair match!\" Solomon said. \"And he turned into an Owlbear midway through, and there was grease on the tree stump!\"Boo is, of course, Minsc's \"miniature giant space hamster\" who is definitely not just a regular hamster that gets swapped out every few years when the last one dies.Jennifer English's turn as Astarion and his meme-worthy \"full concentrated power of the sun\" line--which may have been a Megamind Easter egg--just might be our favorite line-reading. Shadowheart, who is not a vampire, also has much less to fear about the sun itself, so her recasting as Astarion might make the game a little easier!Baldur's Gate 3 was GameSpot's GOTY for 2023. Larian Studios has revealed it will not be making a sequel, but IP-owner Hasbro has big plans for future Dungeons & Dragons games.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Typos Will Kill You In This Upcoming Battle Royale",
    "url": "https://www.gamespot.com/articles/typos-will-kill-you-in-this-upcoming-battle-royale/1100-6535392/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15957481/4583909-ss_de700af3d234ba5f74ba4c791345628e59af30cf.600x338.jpg",
    "tag": "Gaming",
    "date": "2025-10-13T18:22:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Whenever you think the game...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Whenever you think the game industry has run out of ideas for weird battle royales, you're going to need to think again. Developer Button Mash is developing Final Sentence, a game about writing where mistakes can mean death.\"You’ve never played anything like this before,\" reads the game's Steam page. \"Type fast and type accurately--your life depends on it. There's a revolver pointed at your head... with one bullet in the chamber.\"A demo for Final Sentence is available until October 20 as part of the Steam Next Fest.Final Sentence is a Battle Royale typing game where players compete against each other, and one typo could be your last. Only the final writer survives. pic.twitter.com/beBvBMRrWh  — Games Showcase (@gwrldgames) October 11, 2025              Final Sentence supports public multiplayer lobbies of 40 to 100 players. Players can also host their own smaller, private lobbies with four or eight players.We've seen a steady trickle of new battle royales since the genre exploded in 2017. Minecraft, PUBG, and Fortnite were the heavy hitters with millions of players in their battle royale modes, but there have also been battle royales about Scrabble, turn-based combat, Tetris, Super Mario, and even game shows like Fall Guys. The genre is the gift that keeps on giving.Final Sentence doesn't have a release date yet, but its Steam page lists Q4 2025 as a potential release window.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]