[
  {
    "title": "Giant Gassy Mario Invades New York City Soon",
    "url": "https://www.gamespot.com/articles/giant-gassy-mario-invades-new-york-city-soon/1100-6535681/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4590331-screenshot2025-10-24at10.18.43%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-10-24T14:07:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Nintendo and Macy's have...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Nintendo and Macy's have announced that there will be a Mario helium balloon flying high above the streets of New York City this Thanksgiving for the 99th annual Macy's Thanksgiving Day Parade.Nintendo released a 3D model of what the balloon will look like, and yep, that's Mario. The real thing will be 51 feet long, 37 feet wide, and nearly 44 feet tall. He's wearing his iconic blue overalls and well-known red cap. His body is positioned in such a way to be a callback to Super Mario Galaxy.Nintendo is doing this in 2025 to celebrate the 40th anniversary of the original Super Mario Bros. game, which launched in Japan back in 1985.On Nov 27, Mario will take to the skies of New York City at the #MacysParade, in commemoration of the 40th anniversary of the original Super Mario Bros. game. Here’s a first look at the 3D model of the new Mario balloon! @Macys pic.twitter.com/bginx8jcFl  — Nintendo of America (@NintendoAmerica) October 24, 2025\n  This will not be Mario's first balloon at the iconic America parade, as he made his debut at the 60th Macy's Thanksgiving Day Parade back in 1986. Balloons for Nintendo-adjacent characters, like Pikachu, have appeared in the parade, too.The 99th Macy's Thanksgiving Day Parade takes place on Thursday, November 27, airing at 8:30 AM local time.As for the Mario game series, many are expecting Nintendo to release a new 3D Mario game for the Switch 2, but no announcements have been made thus far.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "New Black Ops 7 Trailer Makes Fun Of The Jeff Bezos Celebrity Space Flight",
    "url": "https://www.gamespot.com/articles/new-black-ops-7-trailer-makes-fun-of-the-jeff-bezos-celebrity-space-flight/1100-6535689/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4590355-screenshot2025-10-24at11.40.12%E2%80%AFam.png",
    "tag": "Gaming",
    "date": "2025-10-24T15:32:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Activision has released a new...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Activision has released a new trailer for Call of Duty: Black Ops 7 featuring Peter Stormare's fan-favorite fictional character, The Replacer. But the twist with this new ad is that The Replacer is busy on a space flight to Mars with celebrities, so he needs to call in \"Replacer replacers.\"Activision said in a news release that the video is a \"tongue-in-cheek play on the Blue Origin celebrity space adventure we saw unfold this year, but this time things go sideways…\"That's a reference to Jeff Bezos' space company, which sent celebrities like Katy Perry, Gayle King, and his now-wife, Lauren Sanchez, to low orbit. The mission was roundly mocked for being tone-deaf and cringey, and now Activision is joining in and making a lighthearted jab at it as well.The celebrities aboard this fictional flight for the Black Ops 7 ad include Jake Paul (\"first problem child on Mars\") and Love Island's Huda Mustafa (\"first baddie on Mars\"). With The Replacer flying to Mars with the celebrities, Terry Crews and Nikki Glaser from \"Replacer HQ\" get the call to step in to become the next Replacers. Here's the video:          The Replacer has been a Call of Duty fixture for years, and in Black Ops 6 he became a playable character for the first time.Black Ops 7 launches on November 14 for PS5, PS4, Xbox Series X|S, Xbox One, and PC. It'll be available at launch on Xbox Game Pass Ultimate, like all of Microsoft's other first-party games.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Japanese Students Are Learning English By Playing P.T.",
    "url": "https://www.gamespot.com/articles/japanese-students-are-learning-english-by-playing-pt/1100-6535687/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4590333-silenthillsnormanreedus.jpg",
    "tag": "Gaming",
    "date": "2025-10-24T15:05:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          There are few unmade video...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                There are few unmade video games more famous than Silent Hills and its beloved Playable Trailer. Although P.T. is now very hard to find since Konami took it offline, an instructor in Japan is using it as a tool to teach students how to speak English.Tsunan Secondary School in Niigata Prefecture shared a blog entry (via IGN) that demonstrated how an assistant language teacher utilized P.T. in class as a learning tool. Students were invited to play through P.T. in English, while other members of the class would get to weigh in on what the player should do next by using English phrases.The blog noted that alarmingly loud ringing telephone from P.T. startled the fifth-year students, who are roughly the same age as high school sophomores. But this is one of the most novel ways to learn another language. It's impressive they have the game at all considering that the only easy way to play it is with PlayStation 4 consoles that downloaded it before P.T. was taken down.Metal Gear Solid creator Hideo Kojima, director Guillermo del Toro, and actor Norman Reedus were lined up to collaborate on Silent Hills before Konami pulled the plug on the project. Kojima subsequently left the company and released Death Stranding, which featured Reedus in a leading role and del Toro in a cameo appearance. The sequel, Death Stranding 2: On the Beach, was released earlier this year.Kojima is currently working on OD, an upcoming horror game with director Jordan Peele. One of the first trailers for OD appeared to feature a Silent Hills callback. A more recent OD teaser trailer was also very reminiscent of P.T., and Kojima subsequently stated that he had to make sure that he hadn't captured a real ghost while he was visiting locations for the game. OD doesn't currently have a release date, but it's being produced by Xbox Game Studio in conjunction with Kojima Productions. Actors Sophia Lillis, Hunter Schafer, and Udo Kier are lending their likenesses and voices to the game.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]