[
  {
    "title": "Xbox Partner Preview Showcase: Every Game And Announcement",
    "url": "https://www.gamespot.com/gallery/xbox-partner-preview-showcase-every-game-and-announcement/2900-7271/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4607968-xbox-showcase.jpg",
    "tag": "Gaming",
    "date": "2025-11-20T18:36:00.000Z",
    "description": "By     Darryn Bonthuys   on November 20, 2025 at 10:36AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Darryn Bonthuys\n   on November 20, 2025 at 10:36AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                The Xbox Partner Preview has wrapped up, and like previous showcases, this was a livestream focused purely on announcements, DLC reveals, and world premieres from various third-party studios. The short broadcast was packed with games from a wide range of developers, including IO Interactive, Poncle, THQ Nordic, and Future Friends, and some of the highlights included a first look at Armatus, Vampire Survivors studio Poncle's new game Vampire Crawlers, and seeing that yet another celebrity is in the crosshairs of Agent 47.In case you missed it, we've rounded up all the announcements below that you can read through.ArmatusArmatus is a new third-person roguelite shooter from Godfall developer Counterplay Games, and the world-premiere trailer for it debuted during the Xbox Partner Preview. As a masked warrior with mysterious motivations, players will have to take on demonic horrors that have laid waste to Paris. Billed as a gothic-horror game, Armatus will launch in 2026 for PC and Xbox Series X|S. It'll also be a day-one release via Xbox Game Pass.The Mound: Omen of CthuluOut in Q2 2026 for Xbox Series X|S, The Mound: Omen of Cthulu follows a group of explorers who land on a mysterious coastline that is shrouded by dangerous jungles and supernatural forces. The new trailer showed off more of the co-op horror that players can expect and how they'll need to work together to survive the horrors and claim buried treasure.Dave the Diver + In The Jungle DLCDave the Diver has been a big hit on PC, PlayStation, and Switch, and it's finally available on Xbox Series X|S consoles. First released in 2023, the game sees the titular Dave explore the ocean depths during the day and operate a popular sushi restaurant at night. We also got a look at The Jungle expansion for the game ahead of its release in 2026, which sees Dave explore a tropical land and battle a cranky crocodile.CrowswornA stylish metroidvania set inside of a dark world inhabited by men and monsters, the new trailer for Crowsworn showed off more of the game in action. There was also a closer look at the secrets lurking within the shadows of Fearanndal, the advanced tactics players can use while in combat, and how loadouts can be enhanced. It doesn't have a firm release date yet, but Crowsworn will be day-one release through Xbox Game Pass Ultimate when it launches for PC and Xbox Series X|S.Echo Generation 2A sequel to Echo Generation has been announced, and like the first game, you can expect a combo of turn-based combat, supernatural environments, and cosmic horrors to take down. The game even includes a Gremlins-esque sidekick, and it'll launch for PC and Xbox Series X|S.Vampire CrawlersPoncle rose to fame with Vampire Survivors, and the studio has a new game on the way called Vampire Crawlers. It's a mash-up of several genres--\"first-person deckbuilding roguelike dungeon-crawler\" is a mouthful--and it builds on the \"just one more round\" energy of Vampire Survivors. This will be another Game Pass Ultimate release when it eventually launches for PC and Xbox Series X|S.007: First LightIt wouldn't be a James Bond adventure without some product placement, and for 007: First Light, IO Interactive is keeping that legacy intact with a new look at Bond's Aston Martin. The new trailer for the game showed off the Aston Martin Valhalla, which comes equipped with several modifications to help the 00 agent in the field. 007: First Light is scheduled to launch for PC, Xbox Series X|S, and PS5 on March 27, 2026.Roadside ResearchEver wanted to experience life as an alien working undercover at a rural gas station? Well you can do that oddly specific thing in Roadside Research, a co-op simulator where you have to observe humans and gather information on them. When you're not researching your customers, you'll be keeping your shop clean, restocking shelves, and avoiding arousing suspicion that could result in a visit from the government.Total ChaosTurbo Overkill creator Sam Prebble has a new game out today called Total Chaos. It's a first-person survival-horror adventure full of monsters for you to avoid, kill, or scream at, and the catch here is that players will have to scavenge for materials to craft makeshift weapons. You can grab it on Xbox Series X|S and PC, and it's also available through Xbox Game Pass Ultimate.ReanimalA co-op horror game from the creators of Little Nightmares, Reanimal will see you play as a brother and sister on a mission to rescue their missing friends and escape their nightmarish home. Out in February 2026, A demo for Reanimal is now available to play.ErosionThe new trailer for Erosion showed off an interesting gameplay mechanic for the isometric action game. Whenever you die within its Western-themed voxel world, you'll respawn 10 years later in a land that has changed with the passage of time. Other characters have gotten older as well, adding a sense of urgency to your mission. Erosion will launch for PC and Xbox Series X|S in Q1, via the Xbox Game Preview program.ZoopunkZoopunk is a new game from FIST: Forged In Shadow Torch developer TiGames. Set in the same universe as its previous game, players will take control of a ragtag group of sky-faring, weapon-wielding anthropomorphic animals as they hunt down the Spark, an enigmatic MacGuffin that a rival group has captured. Zoopunk will launch for PC and Xbox Series X|S in 2027.CloverPitCan the roguelite genre be successfully applied to slot machines? Hundreds of thousands of CloverPit's PC players would answer you with a resounding yes, and if you haven't checked the game out yet, you can grab it right now on Xbox Series X|S consoles. CloverPit is also now available through Xbox Game Pass Ultimate and Premium, and the game puts you in a high-risk situation where you're forced to gamble for your life from inside of a dingy cell.Hitman: World of AssassinationA new Elusive Target mission has been announced for Hitman, and this time, Agent 47 will be hunting down---Slim Shady? That's right: Agent 47 has been tasked by legendary rapper Eminem to hunt down his younger alter-ego, who has somehow become an entirely separate, violent entity. We promise we're not making this up, and the mission will go live next week.New Hitman Level Has Eminem Asking You To Kill EminemTides of AnnihilationIt has been a while since we last saw footage of the fantasy action-adventure Tides of Annihilation, but a new gameplay trailer showed off an entire boss fight from start to finish as protagonist Gwendolyn took on a giant winged monster. Inspired by Arthurian legends, Tides of Annihilation doesn't have a release date yet but it is coming to PC, Xbox Series X|S, and PS5.Raji: KaliyugaA brand-new sequel to Raji: An Ancient Epic was announced, and it'll be another day-one launch via Xbox Game Pass for PC and Xbox Series X|S. Set six years after the first game, Raji: Kaliyuga expands on the struggles between gods, asuras, and mystical forces. Players will take on the roles of Raji and her younger brother Darsh, with gameplay shifting from isometric adventure to a third-person action game for the sequel.    \n  \n                      "
  },
  {
    "title": "CoD: Black Ops 7 Aim-Assist Changes And Weapon Balancing Are Coming In Season 1 Update",
    "url": "https://www.gamespot.com/articles/cod-black-ops-7-aim-assist-changes-and-weapon-balancing-are-coming-in-season-1-update/1100-6536402/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1639/16394540/4608011-bo7-rfl-multiplayer-003.jpg",
    "tag": "Gaming",
    "date": "2025-11-20T19:46:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Treyarch has released its first...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Treyarch has released its first post-launch Dev Talk video to reveal some major changes the studio is preparing for the launch of Season 1 next month. This discusses the community feedback regarding Black Ops 7's aim-assist, weapon balancing, and more.Black Ops 7's assault rifles feel really powerful in multiplayer, while most of the guns in the submachine class have struggled to feel viable. Treyarch associate design director Matt Scronce confirms that a buff is coming across the entire submachine gun class. Scronce says no plans are made for adjustments to the marksman rifles or snipers, but the team is monitoring the data.\"The overall goal with those weapons in Black Ops 7 is that they are a bit more present without being too dominant,\" Scronce says.          The developer is also aware of the community debate around Black Ops 7's aim assist, which features reduced rotational aim-assist compared to recent Call of Duty games. \"We have been closely monitoring that conversation and looking at our internal data,\" Scronce says. The developer also reveals the studio is \"fairly happy\" with where the game's aim-assist is at, but there will be a slight increase to aim-assist strength at range. This change will arrive sometime ahead of the Season 1 update.Additionally, Treyarch's planned update includes spawn adjustments for Hardpoint, Free-For-All, and Team Deathmatch modes. A nerf is also coming for the game's overpowered Drone Pod field upgrade.The developer announced that Endgame mode, which players can unlock after completing the campaign, will be available to everyone starting on November 21. Players who unlocked Endgame naturally by beating the campaign will receive a variety of rewards, including XP tokens, GobbleGums, and more.For Zombies changes, Treyarch design director Kevin Drew discusses the difficulty level of the boss fight for Ashes of the Damned. The developer says it was designed to be challenging, but it is more difficult than intended. Adjustments will be made to the barnacle spawns needed to help Ol' Tessie, so players can spend less time repairing the Wonder Vehicle and more time driving. The developer says it's slowing down the speed boss's missile barrage attack.Nuketown arrived to Black Ops 7 today, and this is a new 2025 variant of Treyarch's classic map. Season 1 of Black Ops 7 begins in December, which will add the game's first battle pass, Warzone integration, additional maps, and more.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Arc Raiders A Lay Of The Land Quest Guide",
    "url": "https://www.gamespot.com/articles/arc-raiders-a-lay-of-the-land-quest-guide/1100-6536335/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/679/6794662/4606875-share_20251118_1026002.jpeg",
    "tag": "Gaming",
    "date": "2025-11-20T19:39:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          You'll need to take a trip to...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                You'll need to take a trip to the Spaceport map to complete the A Lay of the Land quest in Arc Raiders. This quest tasks you with finding multiple items in a single trip to the map, so you'll want to come prepared to make a long trek and survive for quite some time. Let's take a look at everything you'll need to do to get this quest wrapped up.Knowing that you'll have a lot of traveling and surviving to do on Spaceport for the A Lay of the Land quest, we'd recommend you bring guns you're comfortable with, as well as plenty of healing items. Additionally, it's a great idea to bring in an augment that has a safe pocket, as you'll need to extract with a specific item to complete the quest back in Speranza.When you're ready to head out and begin A Lay of the Land, follow the guide below.Where to find the shipping notes in the foreman's officeThe first objective requires you to collect some shipping notes in the foreman's office at the Jiangsu Warehouse. This POI is located on the northwestern side of the Spaceport map. It's not usually a very busy spot, but keep your eyes open for nearby raiders nonetheless.Jiangsu Warehouse locationOnce inside, you'll notice there's really not much to this warehouse. Simply head upstairs into the office to locate the shipping notes on a desk in plain sight.Look for the shipping notes on a desk upstairs.With that out of the way, you'll have a slightly more dangerous location to head to next, so get prepared and set off when you're ready.Locate the scanners on the upper floor of Control Tower A6The second objective requires you to seek out a LiDAR Scanner on the upper floor of Control Tower A6, which is located in the middle of the Spaceport map. This area is among the most contested locations on the map, meaning you'll want to approach it with the mindset that a fight could break out at any moment.Control Tower A6 locationThere are a few ways to enter the first room of the Control Tower A6, but for the sake of this guide, we need to enter from the front left side.Enter Control Tower A6 here.Once you enter the Control Tower A6 building, walk to the door straight ahead. Be mindful that there is sometimes a turret in here, so take it out if necessary. Open the door, then take the stairs all the way up to the next floor.Enter this door.When entering the next floor, take an immediate right.Head right when you reach the next floor.Take another right to wrap around to a cubicle.Let's take one more right.Here, you'll find the LiDAR Scanner. Interact with the objective to cause the scanner to fall out, then be sure to pick it up and add it to your inventory.Interact with this box to get the LiDAR Scanner.Lastly, you'll need to extract with the LiDAR Scanner and return it to Shani in Speranza to complete the quest. As such, you'll want to head to whichever extraction point is closest to your location and play things cautiously until you can get out. If you brought an augment with a safe pocket, make sure the LiDAR Scanner is placed in it in case you don't make it out. It's not that we don't believe in you; we're just looking out for you, raider.For more, check out our full Arc Raiders quest list.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]