[
  {
    "title": "Arc Raiders Staking Our Claim Event Guide And All Free Rewards",
    "url": "https://www.gamespot.com/gallery/arc-raiders-staking-our-claim-event-guide-and-all-free-rewards/2900-7257/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/679/6794662/4600514-screenshot2025-11-11013559.png",
    "tag": "Gaming",
    "date": "2025-11-14T19:52:00.000Z",
    "description": "By     Billy Givens   on November 14, 2025 at 11:53AM PST                                GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from...",
    "body": "\n                            \nBy \n    Billy Givens\n   on November 14, 2025 at 11:53AM PST    \n          \n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                Arc Raiders' first major post-launch update has brought with it a whole new map, two additional ARC enemies, and a variety of fresh items (guns, grenades, and more) for players to discover and use. However, it has also introduced the first event in the game, known as Breaking New Ground. While the first part of this event asked the community to come together and commit resources to unlocking the Stella Montis map, the second portion--Staking Our Claim--has a free mini-battle pass of sorts with plenty of rewards to earn by simply playing the game.To unlock rewards during the Staking Our Claim event, you'll need to earn XP in matches. For every 100 XP earned, you are granted 1 Merit. You'll need a total of 3,600 Merits to collect everything in the event--and though this may sound like a major undertaking, XP comes pretty quickly when looting and killing enemies in raids, so it's likely to take you less time than you think.Additionally, if you participated in the first half of the event by giving resources to the tunnel efforts, you'll have already reached up to 900 Merits toward the reward track right out of the gate. This will give you a considerable head start on getting every reward, so here's to hoping you contributed! Rewards are automatically unlocked and granted every 150 Merits, ensuring you're regularly getting something for your hard work while exploring topside.Below is every reward in the Staking Our Claim event and how many Merits you'll need to unlock them. All rewards are free, so there's nothing optional to purchase and you'll not miss out on anything by simply playing and earning XP. The event ends on December 7, so you have a little over three weeks from the start to earn all free rewards.Hiker Backpack150 MeritsRaider Tokens x100300 MeritsDoor Blocker x3450 MeritsCombat Mk. 2600 MeritsIl Toro750 MeritsStriker (Outfit)900 MeritsSeeker Grenade x31050 MeritsBag (Striker Variant)1200 MeritsTrailblazer x2 1350 MeritsBucket (Backpack Attachment)1500 MeritsDeadline1650 MeritsCan't Hear You (Emote)1800 MeritsRaider Tokens x1001950 MeritsDirt Full (Face Style)2100 MeritsExtended Barrel2250 MeritsOrange (Striker Color)2400 MeritsRaider Tokens x1002550 MeritsPadding (Striker Variant)2700 MeritsSnap Hook2850 MeritsRed (Striker Color)3000 MeritsRaider Tokens x1003150 MeritsHelmet (Striker Variant)3300 MeritsRaider Tokens x1003450 MeritsGas Mask (Striker Variant)3600 Merits    \n  \n                      "
  },
  {
    "title": "Concord Lives Again As Fan-Made Project Unveils Gameplay Test Videos",
    "url": "https://www.gamespot.com/articles/concord-lives-again-as-fan-made-project-unveils-gameplay-test-videos/1100-6536235/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4602601-concord2.jpg",
    "tag": "Gaming",
    "date": "2025-11-14T19:12:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          The story of Concord is a...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                The story of Concord is a cautionary tale in the age of live-service games. Years of development and millions of dollars went into the game, only for it to fail at launch and get canceled by Sony weeks later. However, Conord had some fans, and a trio of them worked very hard to bring the game back to life on a server.As reported by The Game Post, Concord's partial resurrection is due to reverse engineering by a user called Red, a rebuild of the game's backend API by open_wizard, and an additional assist from a programmer called gwog. The team shared a pair of a gameplay videos to demonstrate their achievement, but noted that Concord is still somewhat buggy.          The trio successfully tested their ability to load the game, pick their characters, and run a full Clash Point match.\"The project is still WIP, it's playable, but buggy,\" wrote Red. \"Once our servers are fully set up, we'll begin doing some private playtesting.\"          When Concord launched in 2024, it debuted to only 25,000 players. Sony subsequently shut down the game's developer, Firewalk Studios. In the aftermath, Sony recommitted to live-service games and shared some of the hard lessons it learned from the ordeal. Sony Interactive Entertainment chief executive of studio business Hermen Hulst attributed its failure to a lack of oversight.Concord's fate was recently cited in a debate in the United Kingdom's House of Commons about the preservation of video games. That session also addressed the Stop Killing Games movement, but lawmakers were unconvinced of the necessity to create laws that prevent games from being taken offline.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Arc Raiders After Rain Comes Quest Guide",
    "url": "https://www.gamespot.com/articles/arc-raiders-after-rain-comes-quest-guide/1100-6536245/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/679/6794662/4602760-share_20251114_0916501.jpeg",
    "tag": "Gaming",
    "date": "2025-11-14T21:03:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Arc Raiders occasionally sends...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Arc Raiders occasionally sends you topside to fix something and expects you to bring your own items to do so. One such quest is After Rain Comes, which tasks you with repairing some solar panels in Buried City. The last thing you'll want to do is show up to fix them and not have what you need, so we're here to help.You will need 2 Batteries and 5 Wires to complete After Rain Comes. You'll want to place these items in safe pockets if at all possible, as you wouldn't want to lose them due to a misstep, ARC battle, or non-friendly raider while making your way to the solar panels.When you're ready to hop in and fix those solar panels, here's what you need to know.Where to find Batteries and WiresBatteries and Wires can be just about anywhere, but they are very common drops found in any Technological or Electrical POI on any map. Unless you've been selling all of your items throughout the game thus far, you're likely to have some in your stash already, as they're quite plentiful. You can also recycle other electrical items like a Power Cable to get Wires, or recycle an Industrial Battery to get Batteries.However, if you're lacking in enough Batteries or Wires, the most efficient way to get and complete this quest is to simply buy them from Celeste in Speranza. This trader lets you purchase up to 10 Batteries and 10 Wires per day.That was easy. Let's go fix some stuff, raider.Where to find and repair the solar panels in Buried CityThe solar panels you need to repair for After Rain Comes can be located outside of the Grandioso Apartments on the west side of the map. This is a fairly high traffic area due to the apartments having pretty good loot, so keep an eye out for raiders who may be above you, as you'll need to do your work on the ground below.Find the solar panels here.When you arrive, you'll need to find a yellow box under one of the solar panels here. Interact with this and use the Batteries and Wires you brought in to repair it. This simple task will get things up and running again and finish the quest.Use the Batteries and Wires to repair this box.Now that you've completed the quest, you're free to head out at your own convenience. You don't need to extract, but it's obviously preferable if you do, so we'd recommend heading over to the Western Station slightly northeast of the solar panels to get out of dodge.For more, check out our full Arc Raiders quest list.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]