[
  {
    "title": "These Were The Top 10 Most Popular Games In The US Last Week",
    "url": "https://www.gamespot.com/gallery/these-were-the-top-15-most-popular-games-last-week-in-the-us/2900-7295/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4637048-screenshot2026-01-19at1.53.52%E2%80%AFpm.png",
    "tag": "Gaming",
    "date": "2026-01-19T18:54:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                The numbers are inEach week, Circana analyst Mat Piscatella...",
    "body": "\n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                The numbers are inEach week, Circana analyst Mat Piscatella shares data that reveals the top 10 titles in the US ranked by total weekly active users across PS5, Xbox Series X|S, and Steam. (Circana used to released the top 15 but it changed to the top 10 recently).The lists come from Circana's Player Engagement Tracker, and to be sure, this tracks weekly active users, not concurrent users.Which games were the most popular for the week that ended January 10? Fortnite ranked No. 1 on PlayStation and Xbox, with Arc Raiders securing the top spot on Steam. This is the same No. 1 rankings on each platform from last week.Read on to see all the most popular games below for the week that ended January 10, as shared by Piscatella."
  },
  {
    "title": "Marathon Launches On March 5, Will Cost $40",
    "url": "https://www.gamespot.com/articles/marathon-launches-on-march-5-will-cost-40/1100-6537486/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1585/15853545/4637035-8683060353-marat.jpg",
    "tag": "Gaming",
    "date": "2026-01-19T16:27:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Bungie's long in development...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Bungie's long in development extraction shooter, Marathon, will launch on March 5, a new gameplay trailer has revealed ahead of preorders opening. It will launch on PlayStation 5, Xbox Series X|S, and PC and cost $40.The trailer introduces players again to Tau Ceti IV, a colony that you, playing as runners, will infiltrate to dispatch armed forces and extract with valuable gear. You'll make use of a variety of Runner Shells that give you different abilities and perks, defining your role in a party or giving you a choice over how to build if you're planning to play solo. The art style remains as striking as ever, with Bungie's signature gunplay being showcased in the action below.          Marathon was initially scheduled to launch on September 23, 2025 before being indefinitely delayed following a series of public tests that drew criticisms over the game's mechanics. Bungie noted key areas that it planned to improve with more development time, namely the game's survival elements, its lore and world building, and better social experiences for solo and duos players.Sony, who will publish Marathon, assured fans that the game would release before the end of March 2026, with Bungie also confirming that a public beta will take place later in February ahead of launch. Development of Marathon has been rife with controversy, with Bungie eventually settling matters with an artist that accused it of stealing assets for the shooter without permission.Since its delay, Arc Raiders has taken the extraction shooter genre by storm, amassing hundreds of thousands of concurrent players and sustaining that in the months since release.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Satisfactory Multiplayer: The Basics For Peer-to-Peer And Dedicated Server Hosting",
    "url": "https://www.gamespot.com/articles/satisfactory-multiplayer-the-basics-for-peer-to-peer-and-dedicated-server-hosting/1100-6537149/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1603/16030002/4627915-satisfactory-multiplayer.jpg",
    "tag": "Gaming",
    "date": "2026-01-19T09:50:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Factory production lines in...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Factory production lines in Satisfactory will grow to immense sizes the longer you play, and it can be hard to manage. A good friend, though, will cut that work in half. Satisfactory offers both peer-to-peer multiplayer and server-based multiplayer, and each of them has their disadvantages. We'll talk about how to get each of them going here.There are three ways to host games in Satisfactory: Peer-to-peer games, self-hosted servers and rented servers. Peer-to-peer and self-hosted server options are both free, while a rented server option will have a monthly cost associated with it. Meanwhile, peer-to-peer is the easiest to set up, followed by rented servers, and finally self-hosted servers.Peer-to-peerA peer-to-peer session has to be initiated by whoever has the save game you're playing in. Sessions can be private, meaning that you'll need an in-game invite to join, or set to Friends Only, meaning that anyone on your friend list can hop in via Satisfactory's Join Game menu. Each game has a Session ID. If you share this with someone, they can join a Friends Only game regardless of whether they're on your friends list. Each time you initiate a session, though, the Session ID will be reset.This is, by far, the simplest option, and will be sufficient for most players, but it assumes your schedules will line up enough that the host can always be on when you feel like playing.Self-Hosted Dedicated ServerA self-hosted dedicated server is something you set up on a computer you have access to, and leave it to run indefinitely, allowing multiple users to join it whenever they wish. The software itself is free, and comes with the game. This is the most complex option in terms of setup and maintenance, and you'll want to refer to the Satisfactory wiki on Dedicated Servers for the details--it's more than we can reasonably go into here. Your ability to do this can also depend on hosting rules set by your internet service provider, meaning that depending on who supplies your internet connection, this may not even be an option at all.If you have the know-how or the patience, this option will give you the most freedom at the lowest price.Rented Dedicated ServerA rented dedicated server gives you all the freedom of a self-hosted server, but on someone else's hardware. Most people don't just have a computer that sits around left on and unused all the time that they can set a server up on, so this is going to be a better option for most than the self-hosted option. You have a lot of set-up options, so it will take some patience to set up, but if you have a few friends with different schedules who want to play together, this is a great option. Hosting starts at around $10 a month, though reliable and performant hosting will likely be closer to $15. The more people you intend to have playing, the more important that will be. We're not going to call out any specific providers here, but there are many, many options out there through your favorite search engine.This option is expensive, but is ideal for a group with multiple players who don't mind pitching in a few dollars to keep things going.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]