[
  {
    "title": "Netflix Closes Its Squid Game Studio",
    "url": "https://www.gamespot.com/articles/netflix-closes-its-squid-game-studio/1100-6535709/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4590607-squidgamemobilegame.jpg",
    "tag": "Gaming",
    "date": "2025-10-25T00:02:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          For years, Netflix has told...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                For years, Netflix has told investors that it's serious about investing in the video game industry. But the streamer's ambitions may need to be re-calibrated again. Boss Fight--the studio behind Netflix's Squid Game: Unleashed mobile game--has been shut down.David Rippy, the CEO and co-founder of Boss Fight, shared the news on his LinkedIn page, and shared his gratitude for the experience:\"Thanks, everyone who reached out today,\" wrote Rippy. \"Rough news, for sure, but I'm very grateful for the time we had at Netflix. We worked with some awesome people and made many games that I'm very proud of, including Squid Game Unleashed, which hit #1 in 26 countries. You'll see lots of Boss Fighters with similar posts. Please consider them if you have any open roles--they are outstanding people and true professionals through-and-through. As for Bill, Scott and me--we're going to take a little breather before tackling whatever is next. Love to hear from you if there's anything interesting going on, workwise or otherwise.\"Last summer, Netflix co-CEO, president, and director Greg Peter indicated that the streamer was going to \"ramp up\" its investment in gaming in part to explore new monetization options. Earlier this month, Netflix added five new games--Lego Party, Boggle Party, Pictionary: Game Night, Tetris Time Warp, and Party Crashers--that can be played on televisions with your phone as the controller.Previously, Netflix had even bigger plans for a AAA multiplayer shooter from a team that included Halo and Destiny veteran Joe Staten. However, that game and the studio behind it were closed in 2024. Netflix gaming executive Alain Tascan later told Bloomberg why the streamer pulled the plug on that project.\"I don't want this move to be seen as, 'We're not going to do big ambitious games,'\" said Tascan. \"It was just the genre of the game... I don't think was matching the platform. This team was really good at what they were doing, but we wouldn't have been the best partner for them to express their skills and their expertise.\"\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Pokemon Labyrinth Board Game Is Nearly 50% Off At Amazon Right Now",
    "url": "https://www.gamespot.com/articles/pokemon-super-mario-labyrinth-family-board-game-holiday-2025-deals/1100-6526286/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4590850-pokemonlabyrinththumbnail.png",
    "tag": "Gaming",
    "date": "2025-10-26T06:09:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through...",
    "body": "\n          \n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n    \n              \n          \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   The Nintendo-themed editions of Ravensburger's Labyrinth board game are discounted for a limited time at Amazon. The best deal is on Pokemon Labyrinth, which is up for grabs for only $17 (was $30). The Super Mario version of the fast-paced and highly replayable classic has also received a price cut to $24 (was $30).Check out both games below. We also rounded up deals on several other officially licensed board games themed around Pokemon and Super Mario. Pokemon has surprisingly few board games, but you can get Pokemon Monopoly and Pokemon TCG Battle Academy for great prices. Mario and his Mushroom Kingdom pals have starred in numerous classics as well as a bunch of original tabletop experiences that Amazon recently restocked.                                                                                                      Pokemon Labyrinth Board Game                                                                $17 (was $30)                                                                                                                                                                                    The Pokemon edition of Labyrinth originally released in 2021 and remains one of the the most popular classic board games themed around a video game franchise.Pokemon Labyrinth is for two to four players and challenges you to navigate your way through twisting mazes as you track down various Pokemon, including Snorlax, Eevee, Chimchar, Piplup, Turtwig, Grookey, and many more. Playing pieces are based on the original four starter Pokemon: Pikachu, Charmander, Bulbasaur, and Squirtle. Every round of Labyrinth is different due to the board's shifting design, and games only take around 20-30 minutes.A glow-in-the-dark version of Pokemon Labyrinth released last year, but it's selling for full price ($30).Pokemon fans can also save on the latest version of Pokemon Monopoly. Normally $25, Monopoly Pokemon Edition is only $19 at Amazon. The playing pieces are adorable miniature figures of Pikachu, Quaxly, Fuecoco, and Sprigatito. And if you want to learn how to play the Pokemon Trading Card Game, the Pokemon TCG Battle Academy board game is only $13.69 (was $25) at Amazon.                                                                                                                            Super Mario Labyrinth Board Game                                                                $24 (was $30)                                                                                                                                                                                    The Super Mario edition of Labyrinth also launched in 2021, just a few months prior to the Pokemon edition. The Mushroom Kingdom sets up well for a game like Labyrinth, because the 34 maze cards use the familiar brick blocks from the video games.Each player picks one of the wooden pawn playing pieces and sets out to find many different characters from the Mushroom Kingdom, including Mario, Luigi, Yoshi, Peach, Bowser, Wario, Toad, and Toadette. Mario and his friends even invited Donkey Kong to play.Like the Pokemon-themed version, Super Mario Labyrinth is recommended for players ages 7 and up.Mario fans can also get the Super Mario Jenga for $16.66 (was $22) thanks to a coupon deal at Amazon.There are plenty of other Super Mario-themed board games, including The The Super Mario Bros. Movie Monopoly, a Super Mario Checkers & Tic-Tac-Toe combo pack, and a wide selection of original titles from Epoch Games such as the newly released Super Mario Mushroom Mania Balancing Game ($13) and Super Mario Cap Tower Balancing Game ($20).Check out this Super Mario board games Amazon store page for more options.                         Sign up for GameSpot's Weekly Deals Newsletter:                                Adorable New Astro Bot Collectibles Are Waiting To Be Rescued By You                         Amazon Has Tons Of Horror Movie Box Sets For Low Prices In Halloween Sale                         Lego's New Spider-Man And Iron Man Busts Get Limited-Timed Discounts                                   + Show More More Gaming, Tech, and Entertainment Deals & Preorders Links (5)                 Joe Hill's Massive New Horror-Fantasy Novel Arrives Just In Time For Halloween                         Icon Blue Limited Edition DualSense PS5 Controller Is Available Now                         Lego Technic McLaren F1 Race Car Retires Soon, Save $72 At Amazon Before It's Gone                         Pokemon TCG Amazon-Exclusive Holiday Premium Collection Is Back In Stock                         Get 10 Shudder Original Horror Movies On Blu-Ray For Only $51    \n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    \n"
  },
  {
    "title": "Why Halo 1 Remake Has No Multiplayer",
    "url": "https://www.gamespot.com/articles/why-halo-1-remake-has-no-multiplayer/1100-6535707/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4590559-screenshot2025-10-24at4.35.05%E2%80%AFpm.png",
    "tag": "Gaming",
    "date": "2025-10-24T20:27:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          The newly announced Halo 1...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                The newly announced Halo 1 remake that brings the series to PlayStation for the first time has no multiplayer support. It is a campaign-only experience. Why is that?Executive producer Damon Conn addressed this in a post on Xbox Wire. \"Focusing on the campaign experience means we can concentrate fully on really capturing the atmosphere, tone--the emotional impact of what made the first campaign so special and iconic,\" Conn said.While there is no multiplayer in the new Halo: Campaign Evolved, the game delivers some extras that weren't in the original 2001 release, including three new prequel missions and the ability to sprint. The game was made in Unreal Engine 5 and is likely to be followed by a brand-new Halo live-service game.           \"We wanted to start where it all began, with the original campaign that defined Halo,\" Conn said. \"Starting here means people that have never played the game before will be able to understand the story from the very beginning, and that can help us chart a course forward with new Halo stories.\"For more, be sure to watch the trailer above to see the new Halo: Campaign Evolved in action. The game launches in 2026 for PS5, Xbox Series X|S, and PC. Pricing has not been announced, nor has a specific release date.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]