[
  {
    "title": "Arc Raiders And More Dominated Steam's Holiday Sales Chart",
    "url": "https://www.gamespot.com/gallery/arc-raiders-and-more-dominated-steams-holiday-sales-chart/2900-7387/",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4630771-arcraidersduos.jpg",
    "tag": "Gaming",
    "date": "2026-01-06T22:43:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                December 2025 was a record-breaking month for Steam, with...",
    "body": "\n                  GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n                December 2025 was a record-breaking month for Steam, with approximately $1.6 billion in gross revenue during the holiday season. While that success is shared among several games, the big winner of the holidays was Arc Raiders.Alinea Analytics has shared its estimated Steam sales figures for the holiday period beginning on December 21 and ending on January 5. During that time, the company estimates Arc Raiders sold 1.2 million copies on Steam, bringing its total on the platform to 7 million and 12 million across all platforms.The report attributes the continued domination of Arc Raiders to the holiday season and the 20% discount that came with it. Discounts also powered a few other surprising titles on the list. Detroit: Become Human landed at No. 2 over the holidays with 993,000 because its price dropped to only $4, which was down 90% from the game's normal $40 price tag.Even Battlefield 6--one of this year's top-selling games across all platforms--benefited from a timely holiday discount of 30%. That allowed it to place at No. 4 with 706,000 copies on Steam during the holidays.Alina's complete breakdown of the best-selling games on Steam during the 2025 holiday season is included below. Some of the games are still on sale at Steam and Fanatical.GameSpot and Fanatical are both owned by Fandom."
  },
  {
    "title": "Brandon Sanderson Teases Potential \"AAA\" Mistborn Video Game",
    "url": "https://www.gamespot.com/articles/brandon-sanderson-teases-potential-aaa-mistborn-video-game/1100-6537216/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1690/16904437/4630685-1975301208-45183.png",
    "tag": "Gaming",
    "date": "2026-01-06T19:18:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Mistborn fans may be able to...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Mistborn fans may be able to take to the virtual streets of Luthadel eventually, but not for a while. As part of the yearly \"State of the Sanderson\" blog post, author Brandon Sanderson shared that he has been in conversations with multiple AAA developers about a potential Mistborn project. If the project does come to fruition, it will be years away.Sanderson seems to be optimistic about the project's chances. He wrote, \"I feel I’m finally getting established enough that we can make a Mistborn game happen. ... This is at Step One only, but it’s an encouraging One.\" Though he doesn't name any names, he does claim that he has been chatting with big players in the industry, including ones he is a fan of himself. Sanderson is also seeking maintain his rights to video game adaptations of Mistborn.It appears that these discussions are in the earliest possible stage. \"These rights were tied up with the film rights for the last... oh, six-seven years,\" Sanderson wrote, \"so I didn’t get to test the market on them until recently.\" Sanderson concluded that any studio or publisher interested in developing a Mistborn or Stormlight project should get in touch with his representatives.Mistborn is one part of Brandon Sanderson's sprawling Cosmere setting, which also encompasses the Stormlight Archive series. Multiple tabletop games based on Sanderson's work have emerged in recent years, including Cosmere tabletop RPGs and a Mistborn deckbuilder.Sanderson himself has some professional experience related to video games. He designed the world and created characters for the tactics game Moonbreaker. Should this project release, it would not be Mistborn's first foray into video games. A project called \"Mistborn: Birthright\" was in development for a few years before being canceled. Protagonist Kelsier was a guest character in Fortnite, owing to Sanderson's long-standing relationship with Epic.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  },
  {
    "title": "Splitgate Studio Reacts To Player Numbers: \"Steam Charts Don't Measure Fun\"",
    "url": "https://www.gamespot.com/articles/splitgate-studio-reacts-to-player-numbers-steam-charts-dont-measure-fun/1100-6537218/?ftag=CAD-01-10abi2f",
    "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1179/11799911/4630775-screenshot2026-01-06at3.20.39%E2%80%AFpm.png",
    "tag": "Gaming",
    "date": "2026-01-06T20:44:00.000Z",
    "description": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.                                          Splitgate developer 1047 Games...",
    "body": "\n    GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n  \n              \n          \n                Splitgate developer 1047 Games has reacted to the online commentary regarding the recent re-launch of the shooter Splitgate: Arena Reloaded. The game arrived in mid-December 2025 and hasn't gotten close to the Steam numbers that Splitgate 2 or Splitgate 1 reached, prompting online commenters to wonder if the game will be able to stay online.The developer said in a statement, \"Steam charts don't measure fun,\" adding that Steam player numbers only show \"one number, on one platform, at one given moment.\" Steam numbers do no show the \"full picture or what it feels like to actually play, and they definitely don't capture the community that's actively helping shape what Arena Reloaded is becoming.\"1047 Games re-launched Splitgate 2 under the name Splitgate: Arena Reloaded on December 17, and Steam numbers spiked to about 2,300 concurrents at launch. In the past 24 hours, the game reached a peak of 952 players on Steam.For comparison, Splitgate 2 had its most-ever players (25,785 concurrents) in early June when the game's battle royale mode arrived. The original Splitgate, meanwhile, achieved a record of 67,724 peak concurrent players back in August 2021.          1047 Games is encouraging people to give Spligate: Arena Reloaded a shot. \"The gameplay's the best it's ever been, and we'd love for you to jump in and form your own opinion,\" the studio said.The game will get a big new mode in the future in the form of Arena Royale, which is a battle royale mode.Steam's player data is public, but the same cannot be said for PlayStation and Xbox, so we do not know how Arena Reloaded is performing on consoles. The game was always likely to face an uphill battle for marketshare, as data shows people may try new games but end up sticking with their established favorites. It's been a bumpy road for Splitgate in the past year. One of the bosses at 1047 Games wore a \"Make FPS Great Again\" hat at Summer Game Fest in 2025, which led to some controversy. Additionally, there were complaints about microtransaction prices. The studio would later lay off staff, while its founders stopped drawing a salary. Splitgate 2 took the unusual move of reverting back to beta in July 2025 before the re-launch in December.\n                                  \n  \n    Got a news tip or want to contact us directly? Email news@gamespot.com\n      \n      \n    "
  }
]