[
  {
    "title": "Check This iPhone Setting to Make Texting Better for Everyone",
    "url": "https://lifehacker.com/tech/check-this-iphone-setting-to-make-texting-better-for-everyone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEWDA68BYW5KT04J8C7XHEHA/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-13T21:00:28.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: enesdigital / Shutterstock.com\n                            \n    Table ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: enesdigital / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Hey, would you mind doing me a favor real quick? If you're on an iPhone, can you double check that you've got RCS chat enabled for me? Thanks, I appreciate it. See, as an Android user, I don't get to use all the fun iMessage features, but RCS lets us share some of them. The only problem is, iPhones seem to sometimes disable RCS for some chats after an update. Or for no reason at all.RCS has been around for a while, but since it needs to be supported on both the carrier and device level, it's taken some time to reach ubiquity. Understandably, you might have seen some chat conversations between iOS and Android users that still default to the older SMS-style texting, and just gone about your day. However, these days, if you're chatting with your Android friends and you don't see read receipts, or your pictures and videos are coming through in potato quality, there's probably an easy fix.To check if RCS is enabled on your phone:\nOpen the Settings app on your iOS device, then go to Apps.Go to Messages > RCS MessagingEnable the RCS Messaging toggle.And that's it! If you text your contacts from multiple devices, it's also worth checking for RCS support on each of them. It might be a little annoying, but trust me, your Android friends will thank you.\n            \n                What do you think so far?\n            \n        \nIf you're the one using an Android phone, it can also be worth double-checking that RCS support is enabled, although it's less likely to be a problem. While iOS devices support both iMessage and RCS as robust texting options, Android only has RCS. Both platforms can fall back to SMS, but your Android phone probably reaches for RCS as a default. Still, it can't hurt to check. The specific directions will differ based on manufacturer, but generally you can go to your default messaging app's settings and look for an \"RCS Chats\" section to make sure the protocol is enabled on your end as well.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Check This iPhone Setting to Make Texting Better for Everyone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEWDA68BYW5KT04J8C7XHEHA/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-13T21:00:28.000Z",
      "dateModified": "2026-01-13T21:00:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "We Now Know What Caused the Verizon Outage",
    "url": "https://lifehacker.com/tech/we-now-know-what-caused-the-verizon-outage?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF1RXB8A4970TPAPWE5MHCC1/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-15T21:55:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 15, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: RAMAN SHAUNIA/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Verizon has finally confirmed what caused yesterday's nationwide outage.\n                                            The company shared a statement with Mashable, confirming the outage stemmed from a software issue.\n                                            Verizon specified the outage was not caused by a cyberattack.\n                                    \n            \n    Table of Contents\n    \n        \n        By now, you've no doubt heard about (or experienced yourself) yesterday's massive Verizon outage. For nearly all of Wednesday, roughly two million Verizon customers could not connect to the network, and had to rely on wifi to use their smartphones, which were otherwise stuck in SOS mode. Sure, they could call 911, but they couldn't do much else. It was an ordeal, one Verizon is literally paying for: The company committed to issuing $20 account credits to affected customers. It might not be as much as some of us think the company should offer, but it's something. And if the $20 isn't a comfort, the fact that the outage is over should be—even if you needed to restart your phone this morning to implement the fix.The weirdest part of the whole affair was that Verizon didn't initially offer any details about what caused the outage. The company posted throughout yesterday, issuing updates and responding to angry customers, but never shedding light on why their network was down for so many customers. Finally, a day and a half after the outages kicked off, the company has an answer, albeit a partial one. \nA software issue caused the Verizon outage, not a cyber attackAccording to a statement Verizon sent to our sister site Mashable, the cause of the outage was simply a problem with the company's software. \"This was a software issue and we are conducting a full review of what happened,\" the company said. \"As of now, there is no indication that this was a cyber security issue.\" That last bit is important, as some customers took the outage as evidence of some type of cyber attack. While those worries seem to be unfounded, considering the current state of the world, I understand those fears. \n            \n                What do you think so far?\n            \n        \nStill, while it's nice to have some sort of explanation, I could do with more details. This wasn't a minor, temporary outage affecting only a limited number of users; customers across the country couldn't connect to Verizon for most of the day. Software issues happen, but they usually don't take down one of the three major carriers in the United States. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We Now Know What Caused the Verizon Outage",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF1RXB8A4970TPAPWE5MHCC1/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-15T21:55:00.000Z",
      "dateModified": "2026-01-15T21:55:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here's How to Fix Your Phone Now That Verizon Says the Outage Is Resolved",
    "url": "https://lifehacker.com/tech/heres-how-to-fix-your-phone-now-that-verizon-says-the-outage-is-resolved?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF111F6R0V07ET7MPW4WWMV1/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-15T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 15, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: MAYA LAB/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Verizon says it fixed yesterday's widespread outage, but your phone might still be stuck in SOS mode.\n                                            If so, there's a quick fix you can try right now to get your phone back up and running.\n                                            Verizon also says it will contact affected customers directly to issue account credits following the disruptions.\n                                    \n            \n    Table of Contents\n    \n        \n        If you have Verizon, yesterday might have been a bit chaotic. The wireless carrier's coverage was down for large swaths of the country for much of the day, leading to confusion, frustration, and, for some, conspiracy theories. I saw some users on X post cryptic messages like \"This is how it starts,\" and \"These are the end times.\" It's good to know in times of service disruption, we can all keep a level head. But despite claims to the contrary, the world didn't end yesterday, and Verizon fixed the issue. The company issued a statement at 10:20 p.m. ET, confirming the outage had been resolved, and that Verizon would contact affected customers directly to issue account credits. While that doesn't necessarily make up for a full day of network downtime, at least Verizon users can get back online and make calls when not connected to wifi.But some customers out there aren't back to normal. In fact, they're still seeing the same \"SOS\" alert on their phones they saw yesterday. For these users, the outage is very much still happening, as they cannot access the internet or communicate with others without either going through satellite connectivity, or finding a wifi connection. When you need to be out and about, especially on the road, that isn't an option. \nHow to get your Verizon phone out of SOS mode Luckily, there's a simple solution here, one that Verizon shared in its post about the outage's resolution: restart your phone. It doesn't matter if you already restarted your phone yesterday during the outage: In order to see results, you'll need to power off your phone and turn it back on after Verizon implemented its fix. \n            \n                What do you think so far?\n            \n        \nDifferent smartphones have different restart methods, but here are some tips for the most popular models:Restarting an iPhone: Press and hold one of the volume buttons together with the side (power) button, until you see the power-off slider. Slide to power off, then wait for the screen to go totally black. After about 30 seconds, you can press and hold the side button to power it back on. Note: If your iPhone has a Home button, you can simply press and hold the side button to pull up the power-off slider.  Restarting a Samsung Galaxy: Press and hold the volume down button and side button until you see power options appear. Here, choose \"Restart,\" then tap \"Restart\" again. Restarting a Pixel: If you have a Pixel 6 or newer, press and hold the volume up button and side button for a few seconds, then tap \"Restart\" when it appears. If you have a Pixel 5 or older, simply hold the side button until the phone restarts.If your phone model isn't listed here, you can search the internet for specific instructions on how to restart it. Typically, though, the process involves holding both the side button and one of the volume buttons.   \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's How to Fix Your Phone Now That Verizon Says the Outage Is Resolved",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF111F6R0V07ET7MPW4WWMV1/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-15T15:00:00.000Z",
      "dateModified": "2026-01-15T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Android 16 Makes Split Screen Easier on Smaller Screens",
    "url": "https://lifehacker.com/tech/androids-16-makes-split-screen-easier-on-smaller-screens?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF2T47H78X04P1P9DDKJEE9Z/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-16T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    \n        \n        Stock Android added the concept of App Pairs back in Android 15. You choose two apps to use in split screen mode, add a shortcut to the paired apps to the home screen, and it's now trivially easy to trigger split screen multitasking (instead of having to perform multiple tap and drag gestures).It sounds neat, but I never really used it, because on my small Pixel 9a, using apps in 50:50 split-screen mode is hardly user-friendly. There's just not enough room on the screen for each app to take up half of it and still be usable. But that changed with Android 16, thanks to a small update to how split screen works.In Android 16, the split screen ratios for app pairs are much more flexible. You can have two apps in 70:30, or even 90:10. And once you get used to the idea of 90:10 split screen multitasking, things really start to flow.\nFor example, I have an app pair for my Chrome and Gemini apps. Chrome for browsing, and Gemini for research. \n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nChrome is usually my maximized app, taking up 90% of my screen space, while Gemini is docked at the bottom, minimized. But with one tap, Gemini comes to the front and Chrome takes a back seat. And I can keep switching between the two just as easily. This is much faster than using Android's multitasking menu.\n            \n                What do you think so far?\n            \n        \nHow to set up App Pairs with 90:10 split screen multitaskingTo set up an App Pair and try this out for yourself, you'll first need to create a split screen pair. Open the two apps that you want to pair, and then go to the multitasking view (swipe up from the Home bar and hold for a second). Tap the name of the first app you want to open and choose the Split screen option. Then choose another app to pair it with. You'll now enter a 50:50 split screen view. Grab the handle in between the two apps and drag it all the way up or all the way down to trigger the 90:10 split. Alternatively, you can also set up a 70:30 split by leaving some extra space on your second app.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nNow, go back to the multitasking view, tap on one of the app names, and choose the Save app pair option.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nAfter that, you'll find the app pair as a shortcut on your home screen. Tap on it to launch your pre-configured app combo. And yes, it does remember your last used split screen ratio, saving you some valuable setup time. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Android 16 Makes Split Screen Easier on Smaller Screens",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF2T47H78X04P1P9DDKJEE9Z/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-16T15:00:00.000Z",
      "dateModified": "2026-01-16T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Samsung Ultra-Wide Curved Monitor Is 33% Off Right Now",
    "url": "https://lifehacker.com/tech/samsung-viewfinity-s95uc-monitor-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF404NFZ4JCFRKJNHKMYNM4W/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-16T19:07:15.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        If you’re dreaming of ditching a multi-monitor gaming setup without sacrificing too much screen space, the  Samsung 49-inch ViewFinity S95UC monitor delivers that idea in a single curved panel. A versatile option for both multi-tasking at work and casual gaming, it’s currently 33% off at $799 (originally $1,199).\nThis entry-level gaming monitor is ultra-wide (32:9) with a Dual QHD display (5,120 x 1,440) with HDR400 support, a height-adjustable stand, and built-in speakers, which maximize your desk space even more. While its giant display with tons of usable space is the main draw, its 120Hz refresh rate offers smooth visuals and fast reactions, but may not suffice for pro-gamers who need an ultra-fast 240Hz-plus performance for competitive play. VESA DisplayHDR 400 gives you solid color accuracy and brightness, though it can’t match the contrast of an OLED panel, and users may experience a slight gamma shift at the edges of this panel due to its width. USB-C with up to 90 W charging and a KVM Switch, which allows users to connect and control two sources to the display at the same time from a single keyboard and mouse, makes it an effective dock-style hub for laptops and desktops. \n            \n                What do you think so far?\n            \n        \nIf you’re looking more screen real estate in a single monitor, smoother visuals than a basic office monitor, and an option that you can toggle between both during work and after hours for your gaming needs, the Samsung 49-inch ViewFinity S95UC monitor may not be the fastest or HDR-impressive compared to higher-end OLED models. But at around $800, this ultra-wide display is a capable, all-in-one alternative to a dual-monitor setup that also helps you reclaim more desk space.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Samsung Ultra-Wide Curved Monitor Is 33% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF404NFZ4JCFRKJNHKMYNM4W/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-16T19:07:15.000Z",
      "dateModified": "2026-01-16T19:07:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spotify Is Raising Prices Yet Again",
    "url": "https://lifehacker.com/entertainment/spotify-is-raising-prices-again?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF1528KXYVYE2NFHBF575YW5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-15T16:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle Ehrhardt is Lifehacker's Associate Tech Editor. She has a bachelor's degree in history from Earlham College, where she also double majored in theatre. She also holds an MFA in game design from NYU. Michelle's career as a journalist began at Out Magazine, where she covered games, music, film, and politics with an eye towards the LGBT perspective.Michelle is a member of the New York Video Games Critics Circle, where she sits on the Game Journalism Award committee. She has participated in panels and workshops at New York's DreamYard Program and has hosted both the Tom's Hardware Show and the Gadgettes podcast.Her work has been featured in outlets including Paste, The Atlantic, Tom's Hardware, Gizmodo, and The Advocate. Some of her favorite pieces include her annual CES recaps, her video game reviews, and her interviews with hardware makers and independent video game developers.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 15, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Diego Thomazini/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Spotify is raising its U.S. subscription cost by $1 to $2, depending on your plan.\n                                            The price hike follows previous price increases in 2023 and 2024.\n                                            If you can find one near you, a Spotify gift card can help you snag a discounted annual rate.\n                                    \n            \n    Table of Contents\n    \n        \n        If you're subscribed to Spotify, start checking your inbox. The music streaming service is sending emails to customers letting them know about yet another price hike coming next month.To Spotify's credit, the price hike is pretty minor. But starting on whatever your February billing date is, individual premium plans will jump from $11.99/month to $12.99/month, while student plans will go from $5.99/month to $6.99/month. More extensive plans will see a slightly more costly jump. The Duo plan, which gives premium access to two people at the same address, is going from $16.99/month to $18.99/month. The Family plan, which gives premium access to up to six people at the same address, will also see a $2 increase, now costing $21.99/month rather than $19.99/month.\nThe price hikes are set to affect the U.S., Estonia, and Latvia, according to Spotify's announcement. The company's rationale for all this? According to the post, \"occasional updates to pricing across our markets reflect the value that Spotify delivers.\"Truthfully, $1 to $2 does seem like a pretty minor change, but the update follows another U.S. price hike in 2024, where Individual plans went up by $1, Duo plans went up by $2, and Family plans went up by $3. And that came after a price hike in 2023, where the Individual, Student, and Family plans went up by $1, while the Duo plan went up by $2. Certain subscribers outside of the U.S. also saw their own price increases in 2025. I can't help but feel like a frog in a slowly boiling pot.\n            \n                What do you think so far?\n            \n        \nThe continual barrage of price hikes is a bit of a disappointment for subscribers who had gotten used to a steady price for Spotify since its U.S. launch in 2011, as the service went for 12 years before its first price change. If all these price hikes are starting to get to you, you might be able to get around them. If you can find one at a store near you, you can pay upfront for a discounted annual subscription using a Spotify gift card, although it won't apply to Spotify's Family or Student plans. Unfortunately, Spotify does not have an annual subscription plan available on its website.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spotify Is Raising Prices Yet Again",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF1528KXYVYE2NFHBF575YW5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-15T16:30:00.000Z",
      "dateModified": "2026-01-15T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Protect Your Credit Cards From 'Web Skimming' Scams",
    "url": "https://lifehacker.com/money/how-to-protect-your-credit-cards-from-web-skimming-scams?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF1KKB3K7ZPSR71AE99FZV1F/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-16T15:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Table of Contents\n    \n        \n        You have probably heard of skimming, a type of fraud in which criminals install physical devices capable of capturing your payment card details on ATMs, gas pumps, and point-of-sale terminals. If you enter your debit or credit card into one of these fake card readers, your data is stored for later download or transmitted wirelessly in real time to a device controlled by scammers, who will use the information to steal from your accounts. Unfortunately, online shoppers aren't immune from this scheme. Web skimming is a type of cyberattack that uses malicious code to steal card data during checkout, and researchers have identified an ongoing campaign targeting major payment providers and, by extension, consumers. Online credit card skimmingWeb skimming attacks, broadly referred to as \"Magecart\" campaigns, are initiated when malicious JavaScript is injected into e-commerce websites and payment portals. When a checkout page loads, the skimmer replaces it with a spoofed form that collects card numbers, expiry dates, card verification codes, and billing or shipping addresses—everything threat actors need to turn around and use your card for fraudulent purchases. \nThe fake payment forms use legitimate-looking branding and styling to minimize suspicion. Once payment details are transmitted to the attacker, the user gets an error message and is redirected to the real checkout page, a flow designed to make you believe that you've simply entered your information incorrectly. Web skimmers are typically designed to avoid detection and may even self-destruct, making them difficult to identify even for site admins. They also utilize bulletproof hosting, which shields cyber actors from takedown requests and law enforcement action. \n            \n                What do you think so far?\n            \n        \nHow to protect your payment cardUnfortunately, consumers can't do much about the presence of web skimmers, but they can play defense against them. Red flags of an online shopping scam are also red flags for skimming—for example, deals and discounts that are too good to be true are indicators of a possible fraudulent vendor or malicious site, where you may be more likely to have your card details stolen. Shopping with reputable vendors will reduce (though not entirely eliminate) the risk. You should also be vigilant about any unusual steps during checkout, such as redirects or error messages, and abandon any suspicious transactions. If you suspect that your payment details may have been stolen, keep an eye on your bank and credit card statements for unauthorized activity, and enable transaction alerts for real-time updates. Remember that credit cards offer more security protections than debit cards. You could also use virtual cards for online purchases, which allows you to keep your actual card details private and protect you from further fraud. (Note, however, that virtual cards have some drawbacks. For example, you may lose some protections offered by your primary card provider and have a tougher time obtaining refunds.)\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Protect Your Credit Cards From 'Web Skimming' Scams",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF1KKB3K7ZPSR71AE99FZV1F/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-16T15:30:00.000Z",
      "dateModified": "2026-01-16T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'RageCheck' Points Out Manipulative Language in News Articles",
    "url": "https://lifehacker.com/tech/ragecheck-manipulative-language-news-articles?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF1W4B1JNSVX3RJ1FNN8CZW8/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-16T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        If you don't like how the internet makes you feel right now, you're not alone. The entire ecosystem seemingly exists to manipulate you, which can make finding clarity hard. I've written about how to avoid anxiety bait, which can be an important step toward healthy and productive engagement, but an important step is recognizing when you're being manipulated. RageCheck is a potentially useful tool here.Built using concepts from social science research, this website can analyze any link or screenshot. It points out examples of potentially manipulative language, from us-versus-them framing to emotionally loaded phrasing. \"The system analyzes text for linguistic patterns commonly associated with manipulative framing—language optimized to provoke high-arousal reactions over understanding,\" says the methodology page. \"It does not assess factual accuracy or political bias.\"Using the site is simple: just paste a link to an article and hit Enter. After a few moments, you'll see a statistical breakdown of the potentially manipulative language in the piece across five categories—emotional heat, us versus them, moral outrage, black-and-white thinking, and fight picking. The article is excerpted below, with examples of these tactics highlighted. In the left panel you'll see a \"Bait Score,\" which is an attempt to calculate how manipulative the article is being. Below that, you'll see a list of the potentially manipulative techniques employed in the article.\nNone of this is intended to be used as an alternative to fact checking or serve as some kind of truth-detecting machine. \"A high score means content uses manipulative framing—it doesn't mean the underlying claims are false,\" says the about page. \"Conversely, a low score doesn't mean content is true.\"\n            \n                What do you think so far?\n            \n        \nIt's worth pointing out that the techniques this tool detects also aren't necessarily bad. Some news stories really should inspire moral outrage, especially in the context of an opinion piece or editorial. Regardless, there's still value in identifying those techniques.Basically, this is a tool that can help you think critically about the media you're consuming, not do that critical thinking for you. Use it if you want to learn a little bit about the kinds of rhetorical tricks you might be vulnerable to.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'RageCheck' Points Out Manipulative Language in News Articles",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF1W4B1JNSVX3RJ1FNN8CZW8/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-16T14:00:00.000Z",
      "dateModified": "2026-01-16T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft Is Finally Working on a Worthy Answer to Apple's 'Handoff' Feature",
    "url": "https://lifehacker.com/tech/microsoft-finally-has-an-answer-to-apples-handoff-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KESTAKQ2JWRWQBA8J5GEV7TT/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-12T21:00:02.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Lucigerma/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Windows Resume might soon be a worthy alternative to Apple's Handoff feature.\n                                            Microsoft recently opened the feature up to more developers, which means new Android apps may support Resume.\n                                            If that happens, you'll be able to start using an app on your Android device, and pick up where you left off on your PC.\n                                    \n            \n    Table of Contents\n    \n        \n        Love it or hate it, the Apple ecosystem really does have its perks. Take \"Handoff,\" for example. With this feature, you can be working in one app on one of your devices, then continue on in the same app on one of your other devices. You can start an article in Safari on your iPhone, then finish it on your Mac, without needing to google the piece and scroll to find your spot. It isn't 100%, but when it works, it's pretty great. Microsoft actually offers a similar feature over on Windows, though it's so limited, you might not even know it exists. The feature is called Resume, and the idea is to allow you to pick up your place in an app from another device on your PC. For the most part, that means Android apps; so if you have a PC and an Android phone, Resume could offer the same benefits as someone with a Mac and an iPhone. However, so few apps actually work with Resume, that it's effectively useless. Microsoft's \"Handoff\" moment is coming   As spotted by Windows Latest, Microsoft is making some serious updates to Resume. The company recently updated the Resume support document, which confirms Microsoft is opening the feature up to more Android apps. \nThe support document doesn't specify what apps might be coming, but it doesn't necessarily have to for this news to be exciting; rather, the development alone implies that many more Android apps will likely be on the way—assuming their developers simply get on board. As Windows Latest explains, the reason Resume has been so limited is due to how restrictive Microsoft's API is. The only apps that can currently tap into Resume are ones that have access to the \"Link to Windows\" API. Many Android developers either don't know how to develop with this API, or simply can't, since their apps are not compatible. \n            \n                What do you think so far?\n            \n        \nThe latest update to Resume offers developers another option, however: Now, developers can use Windows Notification System (WNS), a built-in API that is far more common and supports far more apps. That said, developers can't just update their apps with the WNS and expect to be compatible with Resume. Microsoft tells Windows Latest that developers need to reach out to Microsoft directly for approval. That application needs to include the developer's WNS registration, the app's Package SID, a summary of what the app does, and screenshots of the app in action.  It's basically like signing up for TSA PreCheck: Most of us who apply will likely get approved, but they don't just let anyone decide to join. You need to provide proof you qualify and submit for screening before you get there. That will likely end up working well for anyone who's interested in using Resume: The apps that will be available will all be vetted by Microsoft, so there should only be legitimate and useful apps offering that linking capability. How to enable Resume on WindowsThese changes probably won't roll out for some time on Windows. However, you can set yourself up for success now by turning the feature on. To start, head to Settings > Apps, then scroll until you find \"Resume.\" Here, turn on the feature. Right now, you'll probably see the only app that is compatible is OneDrive. You can connect it if you wish, which will let you work on a document across both your Android device and your PC.  \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft Is Finally Working on a Worthy Answer to Apple's 'Handoff' Feature",
      "image": [
        "https://lifehacker.com/imagery/articles/01KESTAKQ2JWRWQBA8J5GEV7TT/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-12T21:00:02.000Z",
      "dateModified": "2026-01-12T21:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This App Updates All Your Mac Apps in One Place",
    "url": "https://lifehacker.com/tech/this-app-updates-all-your-mac-apps-in-one-place?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEWERQ8EQVDBH11T8C08850Q/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-14T13:00:36.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        Are you tired of every application you open offering to install an update before you can use it? Do you wish you could take care of all those updates at once? Updatest is an application made for exactly this.I've talked about Homebrew for Mac, which is a command line tool for installing and updating Mac software. Updatest scans all the software on your computer and updates it using Homebrew, even if you didn't initially install it that way. But there's more. Many applications use an open source tool called Sparkle to offer updates, and Updatest can find and update all of them. The application can also identify applications downloaded from GitHub that have newer releases, along with any application you downloaded from the Mac App Store.Basically, if an application has updates, Updatest can find them and install them for you. To get started, click the download button on the app's website (you can also install using Homebrew, if you've already set that up). The application will tell you a bit about how it works, ask you which categories of applications you want to update using the tool, and offer to install Homebrew if you haven't done that already.\nOnce you're done with all of that, you will see a list of all the applications on your system. You can filter to see only the apps that need updates, if you want.Click any application to learn more about the update. From here you can install the update. Alternatively, you can click the Bulk Update button below the search bar to update all of your outdated applications at once. You can watch the updates happen by clicking the Terminal button in the top-right corner, or you can let the application do its thing while you work on something else.\n            \n                What do you think so far?\n            \n        \nSome updates require passwords, in which case you'll be asked to run the update command in the Terminal.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nAnd in some cases, applications from the Mac App Store won't update—in my tests, this was mostly iPad apps I've installed. The application will instead give you a link to open the App Store and install the update.These minor annoyances are inevitable, and not too burdensome. And it's nice to be able to check all of my applications for updates in once place. If you're interested, there's a 15-day free trial, allowing you to get a feel for how the application works. After that you can buy a personal license, which works on up to three Macs, for $9.99; a household license, which works on up to 10 Macs, costs $19.99.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This App Updates All Your Mac Apps in One Place",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEWERQ8EQVDBH11T8C08850Q/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-14T13:00:36.000Z",
      "dateModified": "2026-01-14T13:00:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gmail Is Getting AI-Powered Search and Proofreading Features",
    "url": "https://lifehacker.com/tech/gmail-is-getting-personalized-ai-features?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEF67A86X7T9DJ2P23DNQG6F/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T17:30:55.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 8, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Ascannio / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Google is adding a slate of AI features to Gmail to make important information easier to find.\n                                            AI Inbox will show personalized to-dos and priorities.\n                                            Paid subscribers will also get AI-powered proofreading and AI overviews from search.\n                                    \n            \n    Table of Contents\n    \n        \n        Google is adding a slate of AI features to Gmail that could save some of the hassle of searching for important information buried in messages and threads. Many users will soon see a more personalized inbox with AI-powered suggestions, summaries, and proofreading support. Plus, some AI functionality that was previously available only to paid subscribers will be rolling out to all Gmail users, including Help Me Write, AI Overviews for threaded emails, and Suggested Replies. See personalized, AI-powered snapshots Gmail users will soon have an AI Inbox view with two sections. \"Suggested to-dos\" will show immediate action items found in your inbox, such as bills to be paid and appointments to be confirmed. The task will be bolded and followed by a summary and a link to the relevant email or thread. Below that, \"Topics to catch up on\" includes items that are less urgent (but still important), such as order status and event updates.AI Inbox is an optional toggle in the Gmail side panel. You won't see it immediately, though—the feature is being made available to those in Google's Trusted Tester program before launching for users more broadly \"in the coming months.\" \nGet AI Overviews via Gmail searchGoogle AI Pro and Ultra subscribers will also be able to get AI Overviews from natural language questions typed into the Gmail search bar (just like a Google search). Instead of a running standard keyword search and clicking through multiple message threads, you'll be able to ask things like “Who was the plumber that gave me a quote for the bathroom renovation last year?” and get a detailed summary of information pulled from emails in your inbox. The response will also provide citations to specific threads. \n            \n                What do you think so far?\n            \n        \nAI will proofread your emailsFinally, Gmail will have a built-in, AI-powered proofreading feature that will check grammar, tone, and style and analyze your emails for clarity and structure. Similar to third-party tools like Grammarly, you'll see one-click suggestions for fixing typos, simplifying sentence structure, selecting improving word choice, and making writing more concise. Like AI Overviews, Proofread will be limited to paid subscribers. Note that these AI features are optional and can be disabled, and Google says it does not use personal information or content to train its AI models. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gmail Is Getting AI-Powered Search and Proofreading Features",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEF67A86X7T9DJ2P23DNQG6F/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T17:30:55.000Z",
      "dateModified": "2026-01-08T17:30:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This App Brings Some of My Favorite Windows Features to Mac",
    "url": "https://lifehacker.com/tech/this-app-brings-some-of-my-favorite-windows-features-to-mac?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEXSRGN5TZ31YRPCRT6TZGJD/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-14T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: aileenchik via Shutterstock\n                            \n    Table of Contents\n    \n        \n        As someone who regularly switches between the Mac and PC, I really can't live without the PowerToys app on Windows. It adds little missing features that I really like on the Mac, like a Spotlight Search alternative, auto dark mode, screen awake, on-screen OCR (which lets you pull text from images), and more.But the reverse is also true. When I'm on MacOS, I start to miss the little features and commands that I've been used to Windows having for decades now (I started using Windows in school, but was only exposed to macOS when I was in college).It's the little things, like not being able to cut and paste files in Finder. And why must I accidentally open the Music app every time I press the play button? This is just the beginning.\nEnter Supercharge, a utility from prolific indie developer Sindre Sorhus. Think of it not as a single app, but as a Swiss army knife for your menu bar—a collection of micro-utilities designed to patch the specific usability holes that Apple has left open, many of which Microsoft has already plugged. The app offers an unlimited free trial (with a prompt to upgrade every 12 hours), or you can buy it outright for $18. It's also available as part of a Setapp subscription. \n    \n            \n            \n                                        Credit: Supercharge\n                    \n    \nThe best Supercharge tweaks that you should enableThe Supercharge app works in two ways. The first is by giving you a set-and-forget settings menu. Secondly, it adds a menu bar app where you can quickly access small features on the fly.The tweaks part, to me, is a lot more interesting. Once the app is installed, open the menu bar app and go to Settings. Go to the Tweaks tab and take some time to customize your Mac's behavior.Make Finder work more like Windows File Explorer\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThe Finder is where Supercharge shines, fixing legacy behaviors that have frustrated Windows switchers for years. The first thing I enabled was the \"Cut and Paste\" functionality. Finally, you can use Cmd+X to cut a file and Cmd+V to move it, eliminating the awkward Cmd+C followed by Cmd+Option+V dance required by default.Beyond moving files, the app allows you to enable the Option+N shortcut to instantly create a new text file in your current folder—another Windows muscle memory I've had for decades. Additional tweaks include toggling the Enter key to open a file instead of renaming it, and an option to show hidden files by default.Mission Control featuresApple's Mission Control provides a bird's-eye view of all your windows, but it's hardly interactive. Supercharge changes that by adding window management buttons directly to the overlay. You can now add dedicated Close, Minimize, and Quit buttons for every window inside Mission Control, helping you clear cluttered app windows in seconds, and in a fairly visual way.Dock enhancementsSupercharge also brings much-needed flexibility to the Dock, making it more like the taskbar on Windows or Linux. Enable the Click-to-Hide feature, and you can minimize or hide an app simply by clicking on the app icon. My favorite, though, is the option to open folders directly in the Finder from the Dock. You can also set Supercharge to add spacers to the Dock, and quit apps using the middle-click mouse button.\n            \n                What do you think so far?\n            \n        \nThe Apple Music app fixPerhaps the most useful fix in the entire suite is the ability to stop Apple Music from launching automatically. This feature stops the app from popping up when you press Play on your keyboard or Bluetooth headphones. If you are a dedicated Spotify user or simply dislike it when your headphones accidentally wake up Apple Music, this feature alone makes a Supercharge installation worth it.Other useful featuresThe Supercharge app includes several other quality-of-life improvements. The Notification Nuke feature allows you to set a global hotkey to instantly clear all notifications from Notification Center, acting as a panic button for focus. To prevent accidents, you can also enable Accidental Quit Prevention, which requires a double-press or a Shift + Cmd + Q combo to actually quit an application.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThe second part of the equation here is the menu bar app. Here, you can add small missing features that usually require downloading separate apps. There are more than two dozen options. Go to Settings > General > Show Menu Items to see the whole list.Here, you can add options to quickly capture and copy any text from an image (or translate it). There are one-click options for hiding all windows, showing the desktop, quitting all apps except the current one, clearing all notifications, and more. There's also a simple Keep Awake feature that will keep your Mac active even when the screen is off. And there's also a simple default browser switcher built-in, though I prefer using Sindre's dedicated Default Browser app.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This App Brings Some of My Favorite Windows Features to Mac",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEXSRGN5TZ31YRPCRT6TZGJD/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-14T15:00:00.000Z",
      "dateModified": "2026-01-14T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use RICE to Prioritize Your To-Dos",
    "url": "https://lifehacker.com/work/rice-productivity-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFJR3ZWQH0A6B699J70YS00/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T20:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Lindsey Ellefson\n                 ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Lindsey Ellefson\n                            \n        \n            Lindsey Ellefson\n                \n                                            Features Editor\n                                    \n            \n            \n        \n            ExperienceLindsey Ellefson is Lifehacker’s Features Editor. She currently covers study and productivity hacks, as well as household and digital decluttering, and oversees the freelancers on the sex and relationships beat. She spent most of her pre-Lifehacker career covering media and politics for outlets like Us Weekly, CNN, The Daily Dot, Mashable, Glamour, and InStyle. In recent years, her freelancing has focused on drug use and the overdose crisis, with pieces appearing in Vanity Fair, WIRED, The New Republic, The Daily Beast, and more. Her story for BuzzFeed News won the 2022 American Journalism Online award for Best Debunking of Fake News.In addition to her journalism, Lindsey recently graduated from the NYU School of Global Public Health with her Master of Public Health after conducting research on media bias in reporting on substance use with the Opioid Policy Institute’s Reporting on Addiction initiative. She is also a Schwinn-certified spin class teacher and won the 2023 Dunkin’ Donuts Butter PeContest that earned her a year of free coffee. Lindsey lives in New York, NY.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 8, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Kaspars Grinvalds / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Whenever you have a bunch of looming tasks—as many of us do at the start of the new year, when everyone actually \"circles back\" on the things we've been putting off—having a structured to-do list is an essential part of getting everything done. Determining what goes on that list and in what order, though, is a task all its own. I've covered a lot of ways to do that, but if you're stuck with a high volume of important responsibilities, you need an approach that matches the complexity of what you're trying to do—and that's where the RICE method comes into play.What is the RICE method of prioritization?RICE, as you probably guessed, is an acronym. Here's what it stands for: Reach: How many people or parts of your life or project this task will impactImpact: How meaningful that impact will be if and when it's done correctlyConfidence: How sure you are about your estimates of the other three factorsEffort: The time, energy, knowledge, and resources requiredA unique combination of those factors is going to give you guidance on which tasks are the most crucial to prioritize, which is helpful when you're overloaded by information and dread, unable to think about when or where to get started. \nHow and when to use RICEI won't lie to you: This method is more convoluted than some of the others I've covered in the past. I might even recommend trying a simpler prioritization technique, like the Eisenhower matrix, before you try this one and only whip this out if Eisenhower or its peers aren't given you solid results. RICE takes a little time—and that's because you need to do some math. Start by writing down all your tasks. Under each, you're assigning numbers. The Reach score will be the number of people or parts of your life or project that the task will impact and the Impact score is a 3 (massive impact), 2 (high), 1 (medium), .5 (low), or .25 (minimal impact). Confidence should be a 100, 80, or 50, to represent the percentage of confidence you feel in your estimates and abilities. You can use any number between 0 and 100, but falling back on those three just makes it easier. Most adherents of this method use a complicated math equation (determining \"person-months\") for Effort, but I'm going to simplify that for you. Score it the same way you scored Impact, with a 3 for multiple days or resources, 2 for a day, 1 for half a day, .5 for an hour, and .25 for a half an hour or less. You can also score Reach that way if you're working on a personal project and your results won't necessarily reach a big number of people. In that case, think about the different areas of your life or personal goals it will affect and use that 3-to-.25 scale. \n            \n                What do you think so far?\n            \n        \nThat part is all subjective, similar to using the ABCDE method to assign grades to your to-dos. It can't be avoided—you won't know the true resources required or reach of the project until it's done—but you can quantify it a bit. Next, you do math. It's R x I x C divided by E. You'll end up with a numerical score for each task. Rank the tasks in descending order, with the biggest numbers first. Obviously, you may find that some can't be completed until others are done, so use your discretion there, but for the most part, you've just created a clear outline of which things will have the biggest impact and reach and you can at least know where to start. Add each into your calendar using time boxing and time blocking, then get after it. Knowing you have a plan of attack is half the motivational battle.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use RICE to Prioritize Your To-Dos",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFJR3ZWQH0A6B699J70YS00/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T20:30:00.000Z",
      "dateModified": "2026-01-08T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft's Latest Patch Tuesday Fixes 114 Vulnerabilities",
    "url": "https://lifehacker.com/tech/microsoft-patch-tuesday-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEWSRKZ2BAFKD483MGAJ5048/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-14T13:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: ACHPF/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Microsoft's Patch Tuesday update for January addresses 114 vulnerabilities in total, including three zero-days.\n                                            Eight of the vulnerabilities are labeled as \"critical.\"\n                                            Ensure your Windows machine has updated and installed these security fixes.\n                                    \n            \n    Table of Contents\n    \n        \n        Microsoft has released its \"Patch Tuesday\" update for January, and you should ensure your computer receives these security fixes as soon as possible. This update addresses 114 vulnerabilities in total, including three zero-days (bugs that have been actively exploited or publicly disclosed before an official fix is available from the developer). As reported by BleepingComputer, security flaws were found across the following categories: 57 elevation-of-privilege vulnerabilities, three security feature bypass vulnerabilities, 22 remote code-execution vulnerabilities, 22 information disclosure vulnerabilities, two denial of service vulnerabilities, and five spoofing vulnerabilities. Six of the remote code execution vulnerabilities and two of the elevation of privilege vulnerabilities are considered \"critical.\" Your machine should receive security updates automatically when Patch Tuesday drops, which is around 10 am PT on the second Tuesday of the month. You can check to confirm by going to Start > Settings > Windows Update and selecting Check for Windows updates\nThree zero-days patched in JanuaryOne of the three zero-days fixed this month has been actively exploited in the wild. The flaw, labeled CVE-2026-20805, is an information disclosure vulnerability in the Desktop Windows Manager that allows attackers access to memory addresses from a remote ALPC port. Microsoft Threat Intelligence Center (MSTIC) & Microsoft Security Response Center (MSRC) have been credited with identifying this bug. \n            \n                What do you think so far?\n            \n        \nThe other two zero-days have been publicly disclosed. CVE-2026-21265 is a security bypass feature vulnerability that allows threat actors to bypass Secure Boot on systems that have not updated certificates issued in 2011 and nearing expiration. CVE-2023-31096 is an elevation of privilege vulnerability in third-party Agere Soft Modem drivers that ship with supported Windows operating systems installed. Microsoft has removed these drivers from Windows. Microsoft released other non-security updates today, as well as additional patches for Microsoft Edge and Mariner vulnerabilities earlier this month.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft's Latest Patch Tuesday Fixes 114 Vulnerabilities",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEWSRKZ2BAFKD483MGAJ5048/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-14T13:30:00.000Z",
      "dateModified": "2026-01-14T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Find Free Movies (Legally) With WikiFlix, a Database of Films in the Public Domain",
    "url": "https://lifehacker.com/tech/find-free-movies-legally-with-wikiflix-a-database-of-films-in-the-public?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEVNNV3VH06MZKWV4DHKQWP5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-13T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Lifehacker\n                            \n    Table of Contents\n    \n        \n        I love movies, and especially when I can watch them for free: And while streaming the latest Hollywood blockbusters might come at a price (at least for those wanting to stay on the right side of the law), there's an ever-growing collection of older films that you can get at online without paying a dime.The site WikiFlix (as spotted by the fine folks at Gizmodo) lists movies available to stream that are now in the public domain. The way that copyright works in the U.S. basically means that copyright expires on films after a period of 95 years—so with every year that passes, a batch of new flicks become available to view by anyone, free of charge.If you're looking for something classic for your next movie night, it's well worth a look. \n\n    \n            \n            There are plenty of categories to choose from.\n                                        Credit: Lifehacker\n                    \n    \nWikiFlix is straightforward to use, right from the homepage. It tracks films added to sites such as Wikimedia Commons, YouTube, and the Internet Archive, and whenever you click through on a movie, you can also see where it has come from. When you've made your pick, it streams right in your browser window.The home page is split up into categories that you can browse through—including female directions, animations, and biographical films, the last time I checked—and there's also a search button up in the top right corner if you know what you're looking for. Next to the search button is an account button, which enables you to sign up for a MediaWiki account if you want to be able to contribute to the site too.Hover over the main WikiFlix heading at the top of the page and a quick link to Movies by year pops up. This is a useful way of finding the most recent flicks added to WikiFlix, and digging back into the archive—not all of the movies here are in the public domain because their copyright has expired, and you will find more recent titles too.Click through on any thumbnail to get more information about each movie. You can typically get information on the director, cast, and running time, and a plot summary is included too. Some of the entries come with trailers (although you can also search for these separately on sites like YouTube).\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            Each movie comes with a cast list.\n                                        Credit: Lifehacker\n                    \n    \nStart streaming a movie, and the usual playback controls appear, though the interface does depend to some extent on the site that's hosting the movie. For films hosted on YouTube, for example, you can typically adjust the playback quality and speed. Some movies come with subtitles too.Obviously a site like this is going to skew towards older, classic movies, but there's plenty to explore here: Metropolis, It's a Wonderful Life, All Quiet on the Western Front, Nosferatu, Charlie Chaplin comedy The Gold Rush, and lots more.Free movie repositories aren't quite as rare online as you might think. We've written before about the best free and legal streaming services for movies and TV, featuring ad-supported streaming platforms such as Tubi and PlutoTV. Again, the emphasis is on older films, but there's a huge amount on offer at no charge.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Find Free Movies (Legally) With WikiFlix, a Database of Films in the Public Domain",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEVNNV3VH06MZKWV4DHKQWP5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-13T14:00:00.000Z",
      "dateModified": "2026-01-13T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]