[
  {
    "title": "CES 2026: This Accessory Can Turn Your MacBook’s Display Into a Touchscreen",
    "url": "https://lifehacker.com/tech/this-accessory-turns-your-macbook-display-into-a-touchscreen-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KECJZHYKZXDK8DSY00KQED53/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T16:30:07.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 7, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Intricuit\n                            \n    Table of Contents\n    \n        \n        Plenty of people have been asking for a MacBook with a touchscreen display, and now that is possible with the Intricuit Magic Screen, according to an announcement at CES 2026. It's a snap-on accessory that attaches to your MacBook's display, and uses one of the USB-C ports on the laptop for power. Once connected, you can touch the Magic Screen and your input will be registered on the Mac.The good news is that this product ships with a stylus, which will make it a lot easier to interact with different Mac apps. When you tap something on your iPhone or iPad, the UI takes into account the fact that your fingers are a lot thicker than a mouse pointer. On the Mac, the default input is the mouse cursor, so the Magic Screen's stylus is better suited to those interactions than using your fingers. Having said that, you can use your fingers with this touchscreen accessory too.Keep in mind that using a snap-on touchscreen accessory has a few caveats. The first is that you can't quickly close your MacBook's lid when the Magic Screen is attached. The company has added a thick piece of plastic to the base of the accessory. This part rests just above your MacBook's keyboard and it'll stop you from accidentally closing your laptop's lid with the Magic Screen attached. This ensures that you won't accidentally damage your laptop'd display by slamming the lid shut when the accessory is attached.\nIt also means that you'll always have to unplug the Magic Screen when you're not using the Mac, which can be a bit annoying. Intricuit says it also works in pen tablet mode, so you can place the Magic Screen on your desk and use your stylus to draw something or to control the Mac. This accessory's battery will last up to 100 hours on a single charge, the company claims.\n            \n                What do you think so far?\n            \n        \nIntricuit announced this product at CES 2026 and said the Magic Screen will be on Kickstarter soon at a launch price of $139. The company says it expects to start shipping the product in the first quarter of 2026. It currently supports the 16-inch M-series MacBook Pro, 14-inch M-series MacBook Pro, 15-inch M-series MacBook Air, and 13-inch M-series MacBook Air models. You'll just need to choose the correct variant for your laptop while placing the order.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: This Accessory Can Turn Your MacBook’s Display Into a Touchscreen",
      "image": [
        "https://lifehacker.com/imagery/articles/01KECJZHYKZXDK8DSY00KQED53/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T16:30:07.000Z",
      "dateModified": "2026-01-07T16:30:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: Pawport's Smart Dog Door Launched With One Big Upgrade",
    "url": "https://lifehacker.com/tech/ces-2026-pawports-smart-dog-door-launched-with-one-big-upgrade?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KE9XTR6W2SNRRY9F2NZYCEK5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-06T15:17:08.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 6, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Lifehacker\n                            \n            \n                Key Takeaways\n                                            Pawport finally launched its smart pet door last year, but the company added a new technology that offers a number of features to the mix.\n                                            Pawport now uses ultra-wideband (UWB) to communicate between the pet door and the smart tag.\n                                            UWB lets users control how close the dog needs to be from the door before it opens, and enables two-way encryption for added security.\n                                    \n            \n    Table of Contents\n    \n        \n        If you've been following smart pet tech closely over the last couple years, you might know Pawport. I saw the company's smart pet door at the last two CES's, and was my first introduction to this specific product category. At the time, Pawport hadn't yet launched; now they have. But there's one key difference between the pet door Pawport showed off at CES 2025, and the one that eventually launched late last year.In a lot of ways, Pawport's official pet door is the product I saw last year: Pawport is made of aluminum, and is reportedly bulletproof. (The company has a model riddled with bullet holes on display). This smart door is designed to fit over an existing pet door in your home. If you don't have one, the company also sells an insert to install into your wall. It's weatherproof, has deadbolts on the top and bottom for security, and connects to smart home and voice control assistants. It can even work on battery power, though you can also plug it into power. But Pawport tells me the big change between last year's prototype and its official launch model is the technology used in the smart tag that attached to your pet's collar. Now, Pawport uses a type of ultra-wideband (UWB) technology to communicate between the tag and the door. That gives the user more control over things like how far your pet has to be from the door before it opens: Maybe you prefer your dog to be two feet away inside before it opens, but five feet away when outside. Pawport says UWB also gives the door more security than before. Now, the tech enables end-to-end encryption between the dog collar and the door, so, according to the company, the door can't be hacked. It's a bold claim, but, if true, that should give pet owners some peace of mind.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n\n    \n            \n            Pawport's UWB smart tag attached to a dog collar.\n                                        Credit: Lifehacker\n                    \n    \nPawport now also gives pet owners control over whether pets can run outside in adverse weather conditions. If there's rain or lightning, users can configure the app to lock the door from the inside, so pets can't scurry off into an unsafe backyard. That only locks one way, as well, so if the pet is already outside when the weather lock takes effect, they can still get back inside.\n            \n                What do you think so far?\n            \n        \nIn addition, the company tells me that UWB has extended the battery life of the tag this go around. While the previous prototype was rated for around six months of battery life, the new model has an advertised battery life of one year, though users could see their batteries lasting up to 15 to 18 months. Pawport plans to eventually sell a dedicated outdoor pet door as well, but at the moment, it only sells the indoor unit. That starts at $599 for the company's six standard colors in their medium sized unit, and $849 for one of eight \"signature series\" designs, which adds a polished wood look to the door. You can upgrade to a large unit for another $50, or the extra large unit for an extra $100. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: Pawport's Smart Dog Door Launched With One Big Upgrade",
      "image": [
        "https://lifehacker.com/imagery/articles/01KE9XTR6W2SNRRY9F2NZYCEK5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-06T15:17:08.000Z",
      "dateModified": "2026-01-06T15:17:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "There's Actually a Way to Mix and Match Your Cordless Tool Batteries",
    "url": "https://lifehacker.com/home/cordless-power-tool-battery-adapters?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFAE6KAZYE3E4GC1YB3TFVX/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T18:00:00.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Jeff Somers\n                            \n  ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Jeff Somers\n                            \n        \n            Jeff Somers\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceJeff Somers is a freelancer who has been writing about writing, books, personal finance, and home maintenance since 2012.Jeff has published nine novels and more than 70 short stories; his story Ringing the Changes was selected for inclusion in The Best American Mystery Stories 2006. In 2018, Jeff published the book Writing Without Rules: How to Write & Sell a Novel Without Guidelines, Experts, or (Occasionally) Pants. He holds a bachelor’s degree in English and previously worked in medical publishing as a production editor. When not writing, Jeff spends his free time fixing up his old house. He has tackled a wide range of DIY projects, including remodeling a bathroom entirely on his own in two weeks, and building a roof deck that hasn't fallen down yet. You can find him on Bluesky.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 8, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: VVVproduct / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        When shopping for cordless power tools, you'd think you could simply purchase the best option of each to fit your needs. But there's a big problem that makes this a lot harder (and more expensive) than it should be: battery incompatibility. By design, you can’t simply pop a Ryobi battery into a DeWalt tool and expect it to work. Engineering decisions aside, using proprietary batteries allows companies to create a sort of obligatory brand loyalty, forcing you to stick with their line of tools unless you want to invest in a whole new set of batteries for every new tool you buy.If you've been building your cordless tool collection for some time, you may wind up with four or five different chargers and multiple batteries cluttering your workspace. And that clutter can be expensive, because you wind up buying more chargers and batteries than you might not need if batteries were interchangeable.But it turns out they are, sort of. You can actually swap batteries between brands—you just need the right adapters.\nAdapters let you swap tool batteries between brandsThere are two kinds of battery adapters to consider:Inter-brand adapters allow you to use one brand’s batteries in another brand’s tool (like DeWalt batteries in Milwaukee tools).Voltage adapters allow you to use a different voltage battery than the tool expects (say, a 20-volt battery in a 18-volt tool).These adapters are a fairly simple solution to the problem of incompatible battery systems. If you have a lot of DeWalt tools, for example, you can purchase a Milwaukee tool without a battery (which will be cheaper) and just use an adapter to plug in one of the DeWalt batteries you already have.\n            Never miss a story\n                Get the latest smart home news, trends, and advice from Lindsey and the team.\n            \n        \nOf course, these batteries weren’t specifically designed for these tools, so there can be some trade-offs. While tool performance has been found to be broadly similar (and some tools even performed better when using batteries from different brands), for some tools (like grinders and some circular saws) there’s a dropoff in power and performance when using an adapter. That said, you might not notice it if you're just looking to tackling simple DIY projects around the house. Another caveat to consider: You might lose some features. Some tools are designed to communicate with the battery to modulate power draw in order to extend the life of the battery, and using an adapter will remove this functionality. But again, if you’re simply using a power drill for basic maintenance tasks, this might not be a huge issue for you.\n            \n                What do you think so far?\n            \n        \nUniversal adapters are a good solution if you own a bunch of brandsIf you’ve got a bunch of disparate tool brands, of course, buying multiple adapters might not seem like much of an improvement over your collection of batteries and chargers. If this is you, consider something like the Ceenr PDNation Universal Battery System, which provides an 18-volt battery and a series of adapters that allow it to be used in a wide range of power tools, including major brands like Ryobi, Milwaukee, and DeWalt.For example, you can buy a battery with an adapter for DeWalt tools, then buy a second adapter for the same battery that will work with Makita tools. This means you can standardize on one battery system for pretty much any tool you buy (it’s not a truly universal system, since you’re dependent on the range of adapters they offer, but it’s probably close enough for most people).As with other adapters, there can be some performance loss using a universal adapter, but by and large, it’s probably not a big issue if you’re doing work around the house, as opposed to working professionally on a job site.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "There's Actually a Way to Mix and Match Your Cordless Tool Batteries",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFAE6KAZYE3E4GC1YB3TFVX/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T18:00:00.000Z",
      "dateModified": "2026-01-08T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Stylish Marshall Headphones Are $100 Off Right Now",
    "url": "https://lifehacker.com/tech/marshall-iii-headphones-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEHK89GBWKVY5XPEGZN36WDH/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-09T17:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Marshall/Lifehacker \n                            \n    Table of Contents\n    \n        \n        The ANC headphones from Sony and Bose are great, but they look like gadgets, not music gear. Luckily, Marshall is offering these Monitor III ANC earbuds, which offer a cool retro look. And right now, they're available for the lowest price ever, at $279.99 (down from $379.99), beating the heavyweights from Sony and Bose on price.\nThese Monitor III headphones feature the iconic Marshall script logo, a retro brass control knob (instead of touch buttons), and a textured black vinyl finish that mimics Marshall guitar amps. Other than the looks, the most impressive part is the battery life. These will last you for 70 hours of ANC playback (and 100 hours without ANC). That is a staggering number; for comparison, the Sony XM6 gets you 30-40 hours of playback per charge. The headphones are also collapsible, folding into a small ball. They come with a hard-shell travel case and are pretty lightweight, too, at 250 grams. There is no 3.5mm headphone jack here, but the box does include a USB-C to 3.5mm cable for wired listening.They feature the signature Marshall sound, warm and punchy. They are tuned for listening to rock, heavy metal and guitar-heavy music, and offer a more fun sound profile compared to Sony or Bose, which can sound a bit more flat or balanced.\n            \n                What do you think so far?\n            \n        \nIn its review, PCMag gave the Monitor IIIs a 4.0 star rating, noting that they deliver a \"pleasing audio signature, a comfortable fit with intuitive controls, easy portability, and excellent battery life.\" \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Stylish Marshall Headphones Are $100 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEHK89GBWKVY5XPEGZN36WDH/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-09T17:00:00.000Z",
      "dateModified": "2026-01-09T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Delete 'Bloatware' From Your Android (and Why You Should)",
    "url": "https://lifehacker.com/tech/delete-bloatware-from-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEHZX6P8BKAS9C0QZX82B0DT/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-09T19:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: rblfmr / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Any new phone almost certainly comes with a handful of preinstalled apps you'll never use, regardless of which manufacturer you buy from or which operating system you're on. Some devices are more bloated than others: Google Pixels have a relatively \"clean\" build compared to Samsung phones, for example, and don't typically come with third-party apps and games. But you may still want to eliminate apps and features that clutter your home screen, take up valuable space, and create a drag on performance, especially if you have alternatives you like more. On Android, that likely means uninstalling what you easily can and disabling everything else. What you can (and can't) uninstall on AndroidUnfortunately, many preinstalled first-party apps can't be easily removed. This varies by manufacturer and device—for example, Pixel users can uninstall Google Play Games and Books but are stuck with Chrome, Drive, Maps, and Calculator. As HowToGeek points out, you can delete other pre-selected Google apps added during initial setup, such as the Pixel Watch app and NotebookLM. \nOn Samsung Galaxy phones, again, some preinstalled bloatware is locked in, but ZDNET calls out five native apps that most users should delete right away: Global Goals, Samsung Free, Samsung TV Plus, Samsung Shop, and Samsung Kids. To uninstall an app on your Pixel, go to the Google Play Store and tap the Profile icon. Tap Manage apps & devices > Manage, select the app you want to remove, and tap Uninstall. On Samsung, go to Settings > Apps, tap the app name, and tap Uninstall > OK. You can also touch and hold the app icon on your home screen and tap or drag to uninstall. \n            \n                What do you think so far?\n            \n        \nIf you're absolutely set on removing preinstalled apps that can't be deleted using the above steps, you can use the Android Debug Bridge (ADB), but these methods are more advanced. How to disable preinstalled appsBuilt-in apps that aren't in use can be disabled, which hides the icon from your app drawer. They'll still take up space, but at least they'll be out of sight. Most preinstalled apps can be disabled if you don't need them, with the exception of critical system apps. On your Pixel, go to Settings > Apps > See all apps to select individual apps, and tap Disable at the top of the screen. You can hide preinstalled Samsung apps from your home screen settings: tap Hide apps and tap the icon of the apps you want to disable, the press Done. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Delete 'Bloatware' From Your Android (and Why You Should)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEHZX6P8BKAS9C0QZX82B0DT/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-09T19:30:00.000Z",
      "dateModified": "2026-01-09T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Turn on 'App Pinning' Before Letting Someone Else Use Your Android",
    "url": "https://lifehacker.com/tech/turn-on-app-pinning-before-letting-someone-else-use-your-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEAM64MC29Q85Y03VTPCQXCV/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T20:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 7, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        There are likely occasions in your day-to-day life in which you allow someone else to use your phone, whether it's letting your kid play a game or sharing content with a friend. You may do this without thinking about the privacy implications and what might happen if another person has access to everything on your device and—accidentally or on purpose—uses it to view your search history, scroll through your photos, or send messages to your contacts. If you're an Android user, you should enable app pinning to keep others from snooping around your device. This feature keeps the user in the pinned app until you enter your PIN, pattern, or password. (On iOS, you can achieve a similar effect with Guided Access, which also allows you to set time limits and disable the keyboard and touch input.)To pin apps, you'll need to enable the feature in your phone's Settings app. To do so, go to Security or Security & location > Advanced > App pinning and toggle on Use app pinning and Ask for PIN before unpinning. \nBefore handing your phone over, open to the app screen you want to pin, then swipe up to the middle of the screen and hold to open your Overview. Tap the app's icon, then tap Pin. This will keep the user locked into that app until you unpin (using your PIN, pattern, or password). \n            \n                What do you think so far?\n            \n        \nDepending on your device navigation settings, there are a few ways to unpin an app: Gesture navigation: Swipe up and hold2-button navigation: Touch and hold Back + Home3-button navigation: Touch and hold Back + OverviewNote that pinning won't prevent someone from using the app fully, such as swiping through your photos or typing in the search bar, as Android doesn't have the option to disable touch. Pinned apps can also open other apps. At the very least, though, it keeps someone from having access to anything and everything on your device. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Turn on 'App Pinning' Before Letting Someone Else Use Your Android",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEAM64MC29Q85Y03VTPCQXCV/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T20:30:00.000Z",
      "dateModified": "2026-01-07T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: I Made Fun of My Daughter, but This Rideable Luggage Made Me a Believer",
    "url": "https://lifehacker.com/tech/ces-2026-this-rideable-luggage-made-me-a-believer?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KECPHBTJR4F8FCCHD7BPG9BT/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T17:23:34.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Jordan Calhoun\n                            ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Jordan Calhoun\n                            \n        \n            Jordan Calhoun\n                \n                                            Editor in Chief\n                                    \n            \n            \n        \n            ExperienceJordan Calhoun is the Editor in Chief of Lifehacker and author of Piccolo Is Black: A Memoir of Race, Religion, and Pop Culture. He’s been featured in places like The New York Times, Kotaku, The Root, and The AV Club, and his writing has been published in places like Men’s Health, The Atlantic, and Vulture.Jordan served in the Peace Corps and holds a B.A. in Sociology and Criminal Justice, B.S. in Psychology, and an M.P.A. in Public Policy. He lives in New York City.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 7, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Jordan Calhoun / Lifehacker\n                            \n            \n                Key Takeaways\n                                            Rideable suitcases are the combination of a suitcase and scooter.\n                                            Already popular overseas, rideable luggage is making its way to the US.\n                                            The Jitlife JS07i is a finalist for the official Best of CES 2026 awards.\n                                            It can carry 250 pounds, drive 8mph, and travel six miles on a charge.\n                                    \n            \n    Table of Contents\n    \n        \n        Like many parents, sometimes I view my kids as lazy. This was one of those times: At Orlando International Airport, on our way to Disney World, my 16-year-old daughter shared how much she wanted a rideable suitcase. I laughed and told her that she can walk just fine. \"Besides,\" I added, \"that would never work.\" I hadn't seen rideable luggage yet, and I pointed out the immediate detractions that came to mind. First, it wouldn't work for someone like me—6'3 and 215 pounds. Second, I had doubts that it would have much storage space to carry items, which is the whole point of luggage. And third, who would be caught dead riding something so silly? But my daughter was determined to prove to me not only that they exist, but that they're popular. She showed me videos of them in action. I wasn't convinced. We joked about rideable luggage as we walked through the airport. It came up again as we trekked through Disney World. (\"See, if we had rideable luggage, we wouldn't be so tired.\") By the time we walked to baggage claim after returning to LaGuardia, it was a running gag. That same week, as I prepared for CES, I looked into rideable suitcases and made plans to test them out at the show. And as it turns out, my daughter was right.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nAt CES, I tried several rideable suitcases, putting my bulky 6'3, 215-pound frame on motorized, battery-powered, airplane cabin-sized bags. The best I rode came from Jitlife, which is premiering its fourth model, the Jitlife JS07i, this year. Not only did it impress, but it's also one of the finalists for the official Best of CES 2026 awards for the travel category. \n            \n                What do you think so far?\n            \n        \nLike all the suitcases I drove, the Jitlife rideable suitcase is the size of a standard cabin bag but can carry up to 250 pounds, has a maximum speed of around 8 miles per hour, and can travel about six miles on a charge. The suitcase has a capacity of 28 liters, which is indeed much less than the 60-80 liters of space I expect from a standard check-in bag, but it's better than I thought for something that weighs under 20 pounds and can carry me around. Overall, the kid was right: Rideable luggage can work, and it's actually already a fairly common sight in Asia, particularly in China.As for looking goofy riding one, well, I believe my point stands. But, for those with accessibility needs, younger children, or people who prioritize its functionality over the judgment of strangers, rideable luggage might be a worthwhile solution for moving through large airports more quickly and easily. Testing it out is certainly the most fun I've had at CES, so whatever the future of rideable luggage, I'll live with the \"I told you so\" from my kid. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: I Made Fun of My Daughter, but This Rideable Luggage Made Me a Believer",
      "image": [
        "https://lifehacker.com/imagery/articles/01KECPHBTJR4F8FCCHD7BPG9BT/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T17:23:34.000Z",
      "dateModified": "2026-01-07T17:23:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: You Can Chain 100 of These Ikea Bluetooth Speakers Together",
    "url": "https://lifehacker.com/tech/ces-2026-chain-up-to-100-ikeas-bluetooth-speakers-together?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KECNBP0N5XH5CM568DVVBBVS/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T18:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 7, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Ikea\n                            \n            \n                Key Takeaways\n                                            Ikea showed off the Kallsup Bluetooth speaker, which will cost just $10 in the U.S.\n                                            Ikea is claiming that you can chain up to 100 of them together.\n                                            This product is expected to ship in April 2026.\n                                    \n            \n    Table of Contents\n    \n        \n        At CES 2026, Swedish furniture giant Ikea showed off its new Kallsup Bluetooth speaker, which will cost just $10 in the U.S. Normally, I'd be skeptical of any speaker this cheap, but the Kallsup grabbed my attention for a few reasons—chief among them that Ikea says you can chain up to 100 of them together to create the multi-speaker setup of your dreams. That aside, the hardware seems pretty basic: The speaker has a USB-C port at the back, and two buttons up top (play/pause, and pair).Chaining together Bluetooth speakers is nothing new, but this is the first time I'm seeing the ability to pair as many as 100 of them. The only reason this use case is even remotely plausible is the pricing: As reported by The Verge, the Kallsup Bluetooth speaker will be priced at $10 in the U.S. and €5 (roughly $6) in Europe, which means you can buy 10 of them for the same price as one HomePod mini. The Verge also says  that once you pair one of them to your phone (the company promises Bluetooth 5.3 support), you can add more to the chain with a two-button sequence. \n            \n                What do you think so far?\n            \n        \nDesign-wise, the speakers are cubical and colorful, which I'm a fan of (at the moment, Ikea is showing them off  in white, green, and pink). But how do they sound? Well, Gizmodo says that while they are loud, they don't deliver much in the way of bass. I'd love to get a couple to judge for myself before committing to chaining a few dozen of them together, but I definitely  admire Ikea's big swing here. That said, while CES is the place to grab attention with out-there ideas, and I am struggling to find a use case for chaining 100 Bluetooth speakers together. Maybe if you're an amusement park owner and you want the cheapest possible audio setup for a haunted house? Likely most people will be content with a more reasonable number of them, spread around the house.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: You Can Chain 100 of These Ikea Bluetooth Speakers Together",
      "image": [
        "https://lifehacker.com/imagery/articles/01KECNBP0N5XH5CM568DVVBBVS/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T18:00:00.000Z",
      "dateModified": "2026-01-07T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gmail Is Getting AI-Powered Search and Proofreading Features",
    "url": "https://lifehacker.com/tech/gmail-is-getting-personalized-ai-features?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEF67A86X7T9DJ2P23DNQG6F/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T17:30:55.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 8, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Ascannio / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Google is adding a slate of AI features to Gmail to make important information easier to find.\n                                            AI Inbox will show personalized to-dos and priorities.\n                                            Paid subscribers will also get AI-powered proofreading and AI overviews from search.\n                                    \n            \n    Table of Contents\n    \n        \n        Google is adding a slate of AI features to Gmail that could save some of the hassle of searching for important information buried in messages and threads. Many users will soon see a more personalized inbox with AI-powered suggestions, summaries, and proofreading support. Plus, some AI functionality that was previously available only to paid subscribers will be rolling out to all Gmail users, including Help Me Write, AI Overviews for threaded emails, and Suggested Replies. See personalized, AI-powered snapshots Gmail users will soon have an AI Inbox view with two sections. \"Suggested to-dos\" will show immediate action items found in your inbox, such as bills to be paid and appointments to be confirmed. The task will be bolded and followed by a summary and a link to the relevant email or thread. Below that, \"Topics to catch up on\" includes items that are less urgent (but still important), such as order status and event updates.AI Inbox is an optional toggle in the Gmail side panel. You won't see it immediately, though—the feature is being made available to those in Google's Trusted Tester program before launching for users more broadly \"in the coming months.\" \nGet AI Overviews via Gmail searchGoogle AI Pro and Ultra subscribers will also be able to get AI Overviews from natural language questions typed into the Gmail search bar (just like a Google search). Instead of a running standard keyword search and clicking through multiple message threads, you'll be able to ask things like “Who was the plumber that gave me a quote for the bathroom renovation last year?” and get a detailed summary of information pulled from emails in your inbox. The response will also provide citations to specific threads. \n            \n                What do you think so far?\n            \n        \nAI will proofread your emailsFinally, Gmail will have a built-in, AI-powered proofreading feature that will check grammar, tone, and style and analyze your emails for clarity and structure. Similar to third-party tools like Grammarly, you'll see one-click suggestions for fixing typos, simplifying sentence structure, selecting improving word choice, and making writing more concise. Like AI Overviews, Proofread will be limited to paid subscribers. Note that these AI features are optional and can be disabled, and Google says it does not use personal information or content to train its AI models. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gmail Is Getting AI-Powered Search and Proofreading Features",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEF67A86X7T9DJ2P23DNQG6F/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T17:30:55.000Z",
      "dateModified": "2026-01-08T17:30:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "My Favorite Amazon Deal of the Day: The AirPods Pro 3",
    "url": "https://lifehacker.com/tech/airpods-pro-3-deal-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFGV810HZDZJX0870BHJ3X4/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T19:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                            \n        \n            Daniel Oropeza\n                \n                                            Staff Writer\n                                    \n            \n            \n        \n            ExperienceDaniel is a Staff Writer for Lifehacker. He served in the U.S. Navy, where he reached the rank of Petty Officer 3rd Class as a Logistic Specialist and was awarded a Navy Community Service Medal and Navy Letter of Commendation for his exemplary service aboard the USS Theodore Roosevelt aircraft carrier. He earned his bachelor's in Environmental Science from the University of California, Davis, and earned his master’s degree from the Columbia University Graduate School of Journalism. Daniel was a business reporter for the Miami Herald before joining Lifehacker. He lives in Atlanta, GA.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 8, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Ian Moore and product image courtesy of Amazon.\n                            \n    Table of Contents\n    \n        \n        The latest AirPods Pro are a big step up from the first-generation buds. The third (and newest) generation comes with OTA updates that the AirPods Pro 2 also get to enjoy—but considering the second and third generations are the same price right now, why not go with the newer version? The AirPods Pro 3 are down to $199 (originally $249.99), which they briefly hit back in December during the holiday sales—the lowest price yet, according to price tracking tools.\nThe AirPods Pro 3 improve on already great premium earbuds with new features (like a heart rate sensor) without increasing the list price. You'll get Personalized Spatial Audio (so you can hear sounds seemingly coming from different directions as you move your head) and the ability to use head gestures to tell Siri \"yes\" or \"no\" (this also works for answering or denying calls). Apple added a live translation feature to both the second- and third-generation AirPods Pro when iOS 26 rolled out earlier this year. You'll also get features like Conversation Awareness, which lowers your music volume when your AirPods detect that you're talking to someone; Transparency Mode, which lets you better hear your surroundings while your earbuds are in; and Adaptive Audio, which combines ANC and Transparency mode to adjust ANC levels based on the noise around you.\n            \n                What do you think so far?\n            \n        \nSince these are in-ear earbuds (as supposed to regular earbuds like the AirPods 4) the ANC is much better since it naturally blocks out the noise with a tight seal, but the ANC technology itself has also improved—as has the sound quality, thanks to the new H3 chip, as PCMag detailed in its \"exemplary\" review, calling them the best earbuds your money can buy. You can expect about eight hours of juice, depending on your usage, and another 24 hours from the charging case. \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "My Favorite Amazon Deal of the Day: The AirPods Pro 3",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFGV810HZDZJX0870BHJ3X4/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T19:30:00.000Z",
      "dateModified": "2026-01-08T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Google Nest Wifi Pro Mesh Router Is 50% Off Right Now",
    "url": "https://lifehacker.com/tech/google-nest-wifi-pro-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KECK1P3K4SE40WXSJ8W0HMZ7/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T16:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 7, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        The Google Nest Wifi Pro is currently $99.99 on Amazon, which is half off its usual $199.99 price, and according to price trackers, the lowest it's ever been. At this price, it’s a solid entry point for anyone looking to upgrade to Wi-Fi 6E without diving into full-blown mesh systems or complicated installs. The router itself is designed to be discreet—no antennas, no buttons, just a small LED that quietly tells you if things are working. Setup happens through the Google Home app and takes only a few minutes.\nPerformance holds up well for everyday use. It supports tri-band wifi, including 2.4GHz, 5GHz, and the newer 6GHz band, though you can’t manually select which one your device connects to. There’s no separate network name for the 6GHz band; the router decides automatically using band steering. This isn’t ideal for people who want direct control, especially if you're hoping to get the most out of newer Wi-Fi 6E devices. Still, it uses modern features to keep speeds consistent. MU-MIMO (Multi-User, Multiple-Input, Multiple-Output) allows it to communicate with several devices at once, instead of cycling through them one at a time. OFDMA (Orthogonal Frequency-Division Multiple Access) improves efficiency by letting the router serve multiple users with different bandwidth needs at the same time. And 160MHz channel support means it can transmit more data in a shorter amount of time, which is great for streaming, gaming, or transferring large files.\n            \n                What do you think so far?\n            \n        \nIt also supports Matter and Thread, which makes it a good match for newer smart home setups. That said, it’s worth noting that there are no USB ports, and Ethernet is capped at 1Gbps, so no multi-gig options here. You also can’t prioritize devices or set age-based filters as you can on some competing mesh systems, notes this PCMag review. Google does include basic parental controls (SafeSearch filtering and scheduled access), a guest network, and notification options, but it lacks any real security software like malware blocking. Power users will probably feel boxed in by the lack of advanced customization. But for most people, especially those already using Google’s ecosystem, it’s an easy, unobtrusive way to get faster, more reliable internet in their space.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Google Nest Wifi Pro Mesh Router Is 50% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KECK1P3K4SE40WXSJ8W0HMZ7/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T16:00:00.000Z",
      "dateModified": "2026-01-07T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why I Won't Be Giving ChatGPT Health My Medical Records",
    "url": "https://lifehacker.com/tech/dont-give-chatgpt-health-your-medical-records?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFGNJDCMT3JTWC4A7YNJXZ3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T20:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: OpenAI\n                            \n            \n                Key T",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: OpenAI\n                            \n            \n                Key Takeaways\n                                            ChatGPT Health is a sandboxed tab for conversations about your health, including medical records.\n                                            OpenAI says it's \"not intended for diagnosis or treatment.\"\n                                            LLMs' unreliability, as well as privacy and security concerns, mean using ChatGPT Health might be unwise.\n                                    \n            \n    Table of Contents\n    \n        \n        This week, OpenAI announced its new ChatGPT Health feature, which will let users upload their medical records and ask health related questions. However, I certainly won't be making use of it, it might not be the best idea for you to do it either, for both reliability and privacy reasons. The new ChatGPT Health feature will be a sandboxed tab inside the app that is isolated from your conversation history in other conversations with the chatbot. This tab also allows users to connect a variety of health-tracking apps like Apple Health, MyFitnessPal, and Peloton, as well as uploading medical records directly.\n    \n            \n            \n                                        Credit: OpenAI\n                    \n    \nIt's important to note that this is a lot of really personal information to hand over to any tech company—but especially one that isn't primarily focused on providing medical services. OpenAI says that the ChatGPT Health space operates with \"enhanced privacy to protect sensitive data,\" but it doesn't use end-to-end encryption to secure that data. And while the company says data collected via Health isn't used to train its foundation models, it's impossible to know whether that may change in the future. Security breaches can also occur (and have in the past), potentially leaving your medical records exposed.\nThere's also the question of whether the risk of uploading your data is worth it in the first place. According to OpenAI's own data, around 5% of all messages to ChatGPT are already users asking questions about their health, and ChatGPT (and other LLM tools) have a nasty habit of providing inaccurate diagnostic information. This is perhaps why OpenAI says that its new ChatGPT Health feature is \"not intended for diagnosis or treatment.\"\n            \n                What do you think so far?\n            \n        \nCurrently, there's a waitlist to sign up for ChatGPT Health, and over time it will roll out to all users. At the very least, that means that until the feature is available, it's probably a good idea not to ask the regular version of ChatGPT about your health concerns. At the very least, wait until the enhanced privacy sandbox is available. In the meantime, consider whether it makes more sense to just talk to your doctor directly if you have questions or concerns about your health.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why I Won't Be Giving ChatGPT Health My Medical Records",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFGNJDCMT3JTWC4A7YNJXZ3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T20:00:00.000Z",
      "dateModified": "2026-01-08T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Popular Chrome Extensions Are Stealing Your AI Chats",
    "url": "https://lifehacker.com/tech/chrome-extension-stealing-ai-chats?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEF38R9Z7WSA2ND991PT9G9G/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-09T14:00:00.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n   ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Bangla press/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Two malicious Chrome extensions are sending AI chatbot conversations and browsing data directly to threat actors' servers.\n                                            The offenders are impersonating legitimate extensions that connect with ChatGPT and DeepSeek.\n                                            Just because a browser extension is labeled as featured or verified doesn't mean it can be trusted.\n                                    \n            \n    Table of Contents\n    \n        \n        Hackers continue to find ways to sneak malicious extensions into the Chrome web store—this time, the two offenders are impersonating an add-on that allows users to have conversations with ChatGPT and DeepSeek while on other websites and exfiltrating the data to threat actors' servers. On the surface, the two extensions identified by Ox Security researchers look pretty benign. The first, named \"Chat GPT for Chrome with GPT-5, Claude Sonnet & DeepSeek AI,\" has a Featured badge and 2.7K ratings with over 600,000 users. \"AI Sidebar with Deepseek, ChatGPT, Claude and more\" appears verified and has 2.2K ratings with 300,000 users. However, these add-ons are actually sending AI chatbot conversations and browsing data directly to threat actors' servers. This means that hackers have access to plenty of sensitive information that users share with ChatGPT and DeepSeek as well as URLs from Chrome tabs, search queries, session tokens, user IDs, and authentication data. Any of this can be used to conduct identity theft, phishing campaigns, and even corporate espionage. \nResearchers found that the extensions impersonate legitimate Chrome add-ons developed by AITOPIA that add a sidebar to any website with the ability to chat with popular LLMs. The malicious capabilities stem from a request for consent for “anonymous, non-identifiable analytics data.\" Threat actors are  using Lovable, a web development platform, to host privacy policies and infrastructure, obscuring their processes. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nResearchers also found that if you uninstalled one of the extensions, the other would open in a new tab in an attempt to trick users into installing that one instead. How to avoid malicious browser add-onsIf you've added AI-related extensions to Chrome, go to chrome://extensions/ and look for the malicious impersonators. Hit Remove if you find them. As of this writing, the extensions identified by Ox no longer appear in the Chrome Web Store. \n            \n                What do you think so far?\n            \n        \nAs I've written about before, malicious extensions occasionally evade detection and gain approval from browser libraries by posing as legitimate add-ons, even earning \"Featured\" and \"Verified\" tags. Some threat actors playing the long game will convert extensions to malware several years after launch. This means you can't blindly trust ratings and reviews, even if they've been accrued over time. To minimize risk, you should always vet browser extensions carefully (even those that appear legit) for obvious red flags, like misspellings in the description and a large number of positive reviews accumulated in a short time. Head to Google or Reddit to see if anyone has identified the add-on as malicious or found any issues with the developer or source. Make sure you're downloading the right extension—threat actors often try to confuse users with names that appear similar to popular add-ons. Finally, you should regularly audit your extensions and remove those that aren't essential. Go to chrome://extensions/ to see everything you have installed. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Popular Chrome Extensions Are Stealing Your AI Chats",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEF38R9Z7WSA2ND991PT9G9G/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-09T14:00:00.000Z",
      "dateModified": "2026-01-09T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Compact NordicTrack Smart Treadmill Is Under $500 Right Now",
    "url": "https://lifehacker.com/tech/nordictrack-smart-treadmill-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KE8DZCVZV0D2DPZGSCTDD6NK/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-06T15:00:10.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability sub",
    "body": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        As we head into 2026, many people are setting fitness goals and signing up for gym memberships. But if you have the space at home, it’s a lot more convenient to get your cardio in with an at-home treadmill and skip the crowds. While this is by no means the most advanced model on the market, the NordicTrack T Series 5 treadmill is an entry-level smart treadmill for walkers and runners, offering reliable performance and a smaller-than-average footprint. Right now, it’s 20% off at $479 (originally $599).\nThe NordicTrack T Series runs up to 10 mph at a maximum 10% incline and has a 5-inch LCD display that shows basic stats, but it doesn’t have a big built-in touchscreen (unlike the T-Series 8, which is 30% off right now), so it relies mostly on your phone or tablet, which can be placed on the device shelf. With an iFIT integration, you can follow guided workouts where the treadmill automatically adjusts speed and terrain as trainers coach you through your run. It still works in Manual mode if you don’t have a subscription, but it’s worth noting that part of the price tag goes toward these smart features.\n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \nAt 68 inches long, it has a more compact footprint than many at-home treadmills, which typically run from 72 to 84 inches, making it easier to squeeze into smaller offices, dens, and garages. It’s also a little more lightweight due to its smaller frame and has wheels on one end, making it easier to move around. While its smaller size is a perk for many, it also means a narrower running belt, which may be a downside for runners with a longer stride or anyone who wants more lateral room. \n            \n                What do you think so far?\n            \n        \nWith a 2.6 HP motor, it’s a mid-power option. If you’re looking to sprint daily or do a lot of intervals, at 2.6 HP, you may want a higher-powered model. But for walkers and joggers who want a compact machine and incline for conditioning, the NordicTrack T Series 5 treadmill is ideal for space-limited homes and anyone who wants a virtual trainer experience, especially at just $479. However, if you don’t plan to use iFIT and want a wider or longer belt (or a larger display), you may want to go with another model.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Compact NordicTrack Smart Treadmill Is Under $500 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KE8DZCVZV0D2DPZGSCTDD6NK/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-06T15:00:10.000Z",
      "dateModified": "2026-01-06T15:00:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: XREAL's New Smart Glasses Put a Massive Gaming Monitor Right on Your Face",
    "url": "https://lifehacker.com/tech/ces-2026-xreals-new-gaming-glasses-put-huge-gaming-monitor-on-face?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEARPEB5CC2HAP0XRW2DPNQ4/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-06T23:48:16.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                         ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle Ehrhardt is Lifehacker's Associate Tech Editor. She has a bachelor's degree in history from Earlham College, where she also double majored in theatre. She also holds an MFA in game design from NYU. Michelle's career as a journalist began at Out Magazine, where she covered games, music, film, and politics with an eye towards the LGBT perspective.Michelle is a member of the New York Video Games Critics Circle, where she sits on the Game Journalism Award committee. She has participated in panels and workshops at New York's DreamYard Program and has hosted both the Tom's Hardware Show and the Gadgettes podcast.Her work has been featured in outlets including Paste, The Atlantic, Tom's Hardware, Gizmodo, and The Advocate. Some of her favorite pieces include her annual CES recaps, her video game reviews, and her interviews with hardware makers and independent video game developers.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 6, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            The ROG XREAL AR glasses bring a 171-inch, 240Hz screen into AR.\n                                            They come with a dock that can support up to three devices at once.\n                                            2D-to-3D conversion is planned for the future.\n                                    \n            \n    Table of Contents\n    \n        \n        I've been a fan of XREAL for a while, but outside of people who are really into AR, it's still a lesser-known company. Lifehacker has given XREAL's glasses stellar reviews before, but in the company's new collaboration with Asus, it's aiming to expand its market. The new ROG XREAL R1 AR glasses are the first XREAL glasses aimed specifically at gaming (though its other models aren't exactly bad for gaming), and they basically put the best gaming monitor you could ever want right in front of your face. You wear these like a normal pair of sunglasses, and you get a massive 171-inch virtual TV floating in a black void right in front of you. It's an OLED, so there are crisp colors and high contrast, and the resolution is a respectable 1080p. Most importantly, the glasses max out at a 240Hz refresh rate, meaning they can display up to 240 frames per second.Taken all together, that's better than pretty much all of the full-size desktop monitors I have at home, but these are portable. They're barely heavier than my reading glasses, too, and you can set your virtual screen to either be anchored in one spot (meaning it won't follow your head) or stay in front of your eyes at all times. I prefer the former, since it shakes around less.\n\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nI also didn't get any of the usual problems I have with AR or VR, like light bleed or fuzzy graphics. Aside from the black void, this really did feel like looking at a real-life screen. And you don't even have to use the full 171 inches, if you prefer something smaller.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nAside from the glasses, Asus is also shipping these with a dock, to help you better use them with your various devices. It has two HDMI ports and one DisplayPort connection, so you can have up to three devices ready to go at one time. It's probably the most realistic way to simulate gaming on a movie theater screen, and it's only set to improve down the line. Asus told me these glasses will eventually support XREAL's 2D-to-3D conversion tech, which just came out on the new XREAL 1S glasses and automatically converts any image to 3D. The effect uses AI to determine how to split the image between your eyes, but it was so convincing to me when I tried it with Mario Kart World that it felt like it was officially developed by Nintendo.\n            \n                What do you think so far?\n            \n        \nAnd on that end, I have confirmation from XREAL that the ROG XREAL R1 glasses are compatible with the XREAL Neo mobile dock and battery pack. This is much more compact than the dock that comes with the headset, and, if you plug the glasses and the Nintendo Switch or Switch 2 into it at the same time, it will allow you to play your Nintendo console in AR. Even Asus' dock can't do that without another Switch dock acting as an intermediary first. Plus, this will charge whatever device you're playing at the same time.The ROG XREAL R1 AR glasses will release later this year, although pricing isn't available quite yet. They're expected to release in the first half of this year.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: XREAL's New Smart Glasses Put a Massive Gaming Monitor Right on Your Face",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEARPEB5CC2HAP0XRW2DPNQ4/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-06T23:48:16.000Z",
      "dateModified": "2026-01-06T23:48:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]