[
  {
    "title": "That Political 'Call to Action' Might Actually Be a Scam",
    "url": "https://lifehacker.com/tech/political-call-to-action-might-be-a-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG65AQZT1BGJW2MP7E11RTHY/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-06T19:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    No, SendGrid isn't adding a \"Support ICE\" link to your company's emails.\n            \n                        \n    \n                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        February 6, 2026\n            \n            \n                        Credit: Ian Moore/Lifehacker/Adobe Stock\n                            \n    \n        \n        I'm just a humble immigrant, but as a mere (legal!) guest in the U.S., I can't help but notice that the country is rather, shall we say, politically divided these days (sorry if pointing that out seems rude). It seems international scammers have also noticed—and are taking advantage in subtle ways.Recently, investor Fred Benenson blogged about a sophisticated phishing campaign targeting SendGrid users. Phishers sent emails claiming the company was going to add a large \"Support ICE\" button at the bottom of every outgoing email unless users opted out. The emails also featured a large blue button promising to help you disable the message, which, when clicked, naturally led to a fake version of SendGrid that would allow the scammers to steal login information.As scams go, it's not a bad play: Phishing emails work best when they induce a sense of panic—that way you're less likely to think critically about them, and just act. It's not hard to imagine this particular email being effective, given the political climate right now. Say you're running a fair trade coffee company—you wouldn't want a giant \"Support ICE\" button below your signature at this moment in history.But the trick didn't just target left-wing organizations: Variations on the theme claimed the company was going to add pro-LGBT+ and Black Lives Matter banners as well. The differing political messages aren't really the point of the scam, you see—the point is to get business owners to panic about projecting the \"wrong\" values so that they will click the link and give away their login information. Scammers rely on psychological tricks to rope in their victims, all of them designed to get you to stop thinking rationally. Exploiting America's political divide seems to be an excellent way to do that.Political phishing schemes are nothing newThis is just the latest example of a scam that uses politics as a tool. Back in 2020, a fake Black Lives Matter voting campaign spread malware by pretending to be from a county official looking for feedback on the then-exploding political movement. People on both side of the partisan divide ended up clicking through and getting infected.And then there are the campaigns where people pretend to be politicians and beg for donations: Back in 2024 Lifehacker reported on a rash of political donation scams that popped up during the presidential election cycle. That trend is still growing, according to Stacey Wood, a fraud expert writing for Psychology Today. \"What is especially challenging for consumers and voters is that legitimate campaign operatives use many of the same common persuasion techniques employed by scammers,\" she writes.\n            \n                What do you think so far?\n            \n        \nAll of which is to say that international scammers have equal access to American media outlets, are aware of our political divides, and are effective at using them to exploit your emotions in order to steal your money.How to spot a political phishing scamWhat can you do to protect yourself? First, be aware of the tricks that scammers use, and always approach your email inbox with skepticism. Before you click any link from an unfamiliar sender or in an unsolicited email, hover over it to see if it's going to a website that looks legit. Even better: Avoid clicking links altogether, and head to the website for a given service directly by typing it into your browser.Remember, it's easier to fall for a scam than you think, so it pays to be skeptical, especially when you encounter a call to action designed to get you to react in a panic.\n            \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n                        \n                \n            \n                    \n                                            \n                \n            \n                Justin Pot\n                                \n                                            Justin Pot is a freelance journalist who helps people get more out of technology.\n                                    \n                Read Justin's full bio\n                            \n        \n                \n                                            \n    More by Justin\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "That Political 'Call to Action' Might Actually Be a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG65AQZT1BGJW2MP7E11RTHY/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-06T19:00:00.000Z",
      "dateModified": "2026-02-06T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI Actually Shut Down GPT-4o",
    "url": "https://lifehacker.com/tech/openai-actually-shut-down-gpt-4o?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHC6XAVZ3AGTFBN2NPVGZF02/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-13T20:15:41.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Matthew Nichols1\n                            \n            \n                Key Takeaways\n                                            OpenAI finally deprecated its GPT-4o model on Friday, two weeks after announcing the news.\n                                            The company tried to shut down the model in August, but brought it back following intense user backlash.\n                                            4o is at the center of lawsuits accusing ChatGPT of encouraging delusional thinking, including, in some cases, suicide.\n                                    \n            \n    Table of Contents\n    \n        \n        They actually did it. OpenAI officially deprecated GPT-4o on Friday, despite the model's particularly passionate fan base. This news shouldn't have been such a surprise. In fact, the company announced that Feb. 13 would mark the end of GPT-4o—as well as models like GPT-4.1, GPT-4.1 mini, and o4-mini—just over two weeks ago. However, whether you're one of the many who are attached to this model, or you simply know how dedicated 4o's user base is, you might be surprised OpenAI actually killed its most agreeable AI. This isn't the first time the company depreciated the model, either. OpenAI previously shut down GPT-4o back in August, to coincide with the release of GPT-5. Users quickly revolted against the company, some because they felt GPT-5 was a poor upgrade compared to 4o, while others legitimately mourned connections they had developed with the model. The backlash was so strong that OpenAI relented, and rereleased the models it had deprecated, including 4o.   If you're a casual ChatGPT user, you might just use the app as-is, and assume the newest version tends to be the best, and wonder what all the hullabaloo surrounding these models is all about. After all, whether it's GPT-4o, or GPT-5.2, the model spits out generations that read like AI, complete with flowery word choices, awkward similes, and constant affirmations. 4o, however, does tend to lean even more into affirmations than other models, which is what some users love about it. But critics accuse it of being too agreeable: 4o is at the center of lawsuits accusing ChatGPT of enabling delusional thinking, and, in some cases, helping users take their own lives. As TechCrunch highlights, 4o is OpenAI's highest-scoring model for sycophancy.   \nI'm not sure where 4o's most devoted fans go from here, nor do I know how OpenAI is prepared to deal with the presumed backlash to this deprecation. But I know it's not a good sign that so many people feel this attached to an AI model. \n            \n                What do you think so far?\n            \n        \nDisclosure: Ziff Davis, Mashable’s parent company, in April 2025 filed a lawsuit against OpenAI, alleging it infringed Ziff Davis copyrights in training and operating its AI systems.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI Actually Shut Down GPT-4o",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHC6XAVZ3AGTFBN2NPVGZF02/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-13T20:15:41.000Z",
      "dateModified": "2026-02-13T20:15:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Popular AI Chat App Exposed 300 Million Private Messages",
    "url": "https://lifehacker.com/tech/ai-chat-app-exposed-300-million-private-messages?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH24D7NJCV0WX105DT6VYV7Y/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-09T22:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Apple App Store\n                            \n    Table of Contents\n    \n        \n        Have you ever used an application called Chat & Ask AI? If so, there's a good chance your messages were exposed last month. In January, an independent researcher was able to easily access some 300 million messages on the service, according to 404 Media's Emanual Maiberg. The data included chat logs related to all kinds of sensitive topics, from drug use to suicide.Chat & Ask AI, an app offered by the Istanbul-based company Codeway that is available on both Apple and Google app stores, claims to have around 50 million users. The application essentially resells access to large language models from other companies, including OpenAI, Claude, and Google, providing limited free access to its users.The problem that lead to the data leak was related to an insecure Google Firebase configuration, a relatively common vulnerability. The researcher was easily able to make himself an \"authenticated\" user, at which point he could read messages from 25 million of the app's users. He reportedly extracted and analyzed around 60,000 messages before reporting the issue to Codeway.\n            \n                What do you think so far?\n            \n        \nThe good news: The issue was quickly patched. More good news: there have been no reports of these messages leaking to the broader internet. Still, this is yet one more reason to carefully consider the kinds of messages you send AI chatbots. Remember, conversations with AI chatbots aren't private—by their nature, these systems often save your conversations to \"remember\" them later. In the case of a data breach, that could potentially lead to embarrassment, or worse—and using an reseller like Chat & Ask AI to access large language models adds another layer of potential security risks, as this recent leak demonstrates.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Popular AI Chat App Exposed 300 Million Private Messages",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH24D7NJCV0WX105DT6VYV7Y/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-09T22:00:00.000Z",
      "dateModified": "2026-02-09T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft's February Patch Tuesday Update Fixes Six Zero-Day Exploits",
    "url": "https://lifehacker.com/tech/microsofts-february-patch-tuesday-update?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH5ESZQAD4AGMV8N9G6S3Y5P/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-11T17:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 11, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Daniel Chetroni / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            The latest \"Patch Tuesday\" fixes 58 vulnerabilities in total, six of which are zero-day flaws.\n                                            Three of the six actively exploited zero-days fixed in February are security feature bypass vulnerabilities.\n                                            Machines receive updates automatically, but you can check your settings to be sure.\n                                    \n            \n    Table of Contents\n    \n        \n        Microsoft's February security update is a big one. This latest \"Patch Tuesday\" fixes 58 vulnerabilities in total, six of which are zero-day flaws. As a reminder, a zero-day is a vulnerability that has been either actively exploited in the wild or publicly disclosed before an official fix is released by the developer. As BleepingComputer reports, security flaws were found in the following categories: 25 elevation-of-privilege vulnerabilities, five security feature bypass vulnerabilities, 12 remote code-execution vulnerabilities, six information disclosure vulnerabilities, three denial of service vulnerabilities, and seven spoofing vulnerabilities. Three of the elevation of privilege vulnerabilities and two of the information disclosure vulnerabilities are considered \"critical.\" (These numbers do not include the three Microsoft Edge vulnerabilities patched earlier in February.)Patch Tuesday updates are typically released around 10 am PT on the second Tuesday of every month, and your device should receive them automatically. BleepingComputer reports that this month's release also includes Secure Boot certificate updates for 2011 certificates that are expiring in June. \nSix zero-days patched in FebruaryThree of the six actively exploited zero-days fixed in February are security feature bypass vulnerabilities: CVE-2026-21510: This is a flaw the Windows Shell that allows an attacker to execute content without warning or gaining user consent, though the user does need to open a malicious link or shortcut file. CVE-2026-21513: This MSHTML Framework vulnerability allows an unauthorized attacker to bypass a security feature over a network. Microsoft has not released details on how this flaw was exploited. CVE-2026-21514: This vulnerability in Microsoft Word allows an attacker to bypasses OLE mitigations in Microsoft 365 and Microsoft Office once a user has opened a malicious Office file. All three of the above flaws have been attributed to Microsoft Threat Intelligence Center (MSTIC), Microsoft Security Response Center (MSRC), Office Product Group Security Team, and Google Threat Intelligence Group along with an anonymous researcher for CVE-2026-21510 and CVE-2026-21514.\n            \n                What do you think so far?\n            \n        \nTwo of the zero-days are elevation of privilege vulnerabilities. CVE-2026-21519 is a Desktop Windows Manager flaw that allows an attacker to gain SYSTEM privileges, while CVE-2026-21533 is a Windows Remote Desktop Services flaw that allows an attacker to elevate privileges locally. The former has been attributed to MSTIC and MSRC, while the latter was discovered by the Advanced Research Team at CrowdStrike.Finally, CVE-2026-21525 is a denial of service vulnerability in the Windows Remote Access Connection Manager that allows an unauthorized attacker to deny service locally. This flaw was discovered by the ACROS Security team with 0patch—it was reportedly found in a public malware repository in December 2025. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft's February Patch Tuesday Update Fixes Six Zero-Day Exploits",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH5ESZQAD4AGMV8N9G6S3Y5P/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-11T17:00:00.000Z",
      "dateModified": "2026-02-11T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Apple Watch Series 9 With Cellular Connectivity Is 25% Off Right Now",
    "url": "https://lifehacker.com/tech/apple-watch-series-9-cellular-sale-february-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH8QWM0Z10X457B6EX2RXG7M/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-12T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Woot\n                            \n    Table of Contents\n    \n        \n        The Apple Watch Series 9 [GPS + Cellular, 41mm] is currently going for $299.99 on Woot, which is a solid deal considering the same model starts at $399 new and about $226 refurbished on Amazon. This one’s brand-new and comes with a full one-year Apple warranty. With Prime, you also get free standard shipping (while non-Prime members are levied a $6 shipping fee), and the offer is live for four more days or until it sells out. \nIt’s the model with cellular connectivity, so with an active carrier plan, you can call, message, or stream music even when your iPhone’s not nearby—something the cheaper GPS-only versions can’t do. That’s a big plus if you run without your phone or want to stay reachable while leaving it behind.The Series 9 runs on Apple’s S9 processor, which makes everything feel faster, and the screen gets much brighter. At 2,000 nits, it’s easy to read even when the sun’s beating down on your wrist. It also adds a double-tap gesture, so you can control things like answering a call or scrolling through widgets with just a pinch of your fingers. The onboard Siri lets you start a workout or set a timer with your voice, and it’s the first Apple Watch that’s carbon-neutral (at least in this aluminum and sport band combo). It also has access to the App Store, so apps like Spotify, Strava, and Calm run directly on the watch, notes this PCMag review.Battery life is around 32.5 hours, even with the always-on display enabled, which holds up fine for a full day and night of use, though heavy cellular use will shorten that. \n            \n                What do you think so far?\n            \n        \nHealth tracking is comprehensive. You get heart rate monitoring, ECG, blood oxygen readings, temperature sensing, sleep tracking, GPS, and fall detection. The watch is also IP6X dust resistant and WR50 water resistant, making it suitable for swimming and gym sessions. At $299.99, this is a strong price for a new cellular Apple Watch, making it one of the better deals for lifestyle smartwatches right now.\n            \n                    Our Best Editor-Vetted Presidents' Day Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n            Add to Cart NewsletterShop smarter, save more money.\n                    Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Apple Watch Series 9 With Cellular Connectivity Is 25% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH8QWM0Z10X457B6EX2RXG7M/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-12T14:00:00.000Z",
      "dateModified": "2026-02-12T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube Finally Released an App for the Apple Vision Pro",
    "url": "https://lifehacker.com/tech/youtube-app-for-apple-vision-pro?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH9SVASV7VEXA78TP418XENK/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-12T21:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Stephen Johnson\n                  ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Stephen Johnson\n                            \n        \n            Stephen Johnson\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceStephen Johnson is a senior staff writer at Lifehacker covering pop culture and technology, including the columns “The Out-of-Touch Adults’ Guide to Kid Culture” and “What People Are Getting Wrong This Week.”\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: YouTube\n                            \n            \n                Key Takeaways\n                                            A YouTube app is now available for Apple Vision Pro.\n                                            Users can stream every video on YouTube, even 8K video.\n                                            The standalone YouTube app was designed with Vision's spatial computing in mind.\n                                    \n            \n    Table of Contents\n    \n        \n        YouTube has finally come to Apple Vision Pro. YouTube for Vision OS is a free, standalone app that lets users log into their existing YouTube accounts through their Vision headsets and stream videos like they would expect to, including standard videos, 180° videos, 360° videos, and YouTube Shorts. Vision Pro M5 users can stream 8K videos, and premium YouTube members can download videos directly to their headsets, a must for long flights.  Google, YouTube's parent company, has apparently been working on the app for a while. In 2024, a spokesperson confirmed that a standalone Vision Pro app was \"on our roadmap,\" but until today, the only way Vision users could watch YouTube on their headsets was through the Safari web browser. The new YouTube app is designed to fit into Vision's spatial computing environments. \"Rather than just responding to different screen sizes, we needed something that responds to different spaces, volumes and use cases,\" YouTube's senior UX designer Brendan Polley told Apple. \"We built an entirely new design system that isolated core elements—comments, the play button, 'like' and 'dislike'—to fit any layout.\"\n            \n                What do you think so far?\n            \n        \nHaving downloaded the app, it works exactly as intended. If you're looking for something that demonstrates Vision Pro's immersive video capabilities, you should check out the just-released 360° videos from the Milano Cortina winter Olympics on NBC's channel. Immersive luge is terrifying! \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube Finally Released an App for the Apple Vision Pro",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH9SVASV7VEXA78TP418XENK/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-12T21:30:00.000Z",
      "dateModified": "2026-02-12T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple and Google Just Made It Easier to Switch Between iPhone and Android",
    "url": "https://lifehacker.com/tech/apple-and-google-just-made-it-easier-to-switch-between-iphone-and-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBZW51YD9RTK9TT6NWP3RZ28/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-12T19:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Mr.Mikla / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Apple and Google actually worked together on a method to make switching between iPhone and Android easier.\n                                            With iOS 26.3, iPhone users can access the tool to simplify the process of transferring data like photos, messages, contacts and more.\n                                            However, Apple says health data, devices paired with Bluetooth, and \"protected items\" cannot be transferred.\n                                    \n            \n    Table of Contents\n    \n        \n        When it's time to buy a new car, you don't necessarily need to stick with the one you had before. You don't lose your cloud-based photos by switching from Toyota to Subaru, nor will your friends yell at you for ruining the group chat by buying a Kia. That's not the case with smartphones: When you buy an iPhone, it's tough to switch away from it. The same goes for Android: While it's easy enough to switch within the Android ecosystem, such as between Pixel or Galaxy, moving from Android to iPhone can also be a pain. Tech companies tend to make it tempting to stick with their platform, and introduce friction when you try to leave. That, of course, is entirely business-based. Apple hasn't traditionally made it easy to move to Android, because, well, you might actually do it. It doesn't have to be this way, either. There's nothing inherent to smartphones that should make it so challenging to break out of any particular ecosystem. All it takes is some intentional design: If smartphones were made to be traded, you could migrate from one to another, without worrying about losing pictures, messages, or any other important data or processes. As it happens, that intentional design is here. Apple and Google actually worked together to make it easier to transfer data between iPhone and Androids, which makes switching between the two platforms more seamless. \nNews first broke about this partnership back in December, and, at that time, Google released some of this progress as part of the latest Android Canary, the company's earliest pre-release software. Shortly after, Apple released the first beta for iOS 26.3, which featured the transfer tool. Now, iOS 26.3 is here, and with it, an easier way to switch from iPhone to a device made by Google, Samsung, or any other Android OEM.   How to use the new iPhone-to-Android option in iOS 26.3The feature seems easy enough to use. Once you update your iPhone to iOS 26.3, you can head to Settings > General, then scroll down to \"Transfer or Reset iPhone.\" Tap this option, then choose \"Transfer to Android.\" Here, iOS will present a pop-up, telling you to place your iPhone next to your new Android device, where you can transfer photos, messages, and apps, among other data points. (That said, health data, devices paired with Bluetooth, and \"protected items\" cannot be transferred.)You'll need to make sure both devices are running the latest updates, are connected to wifi, and have Bluetooth enabled. However, Apple also says your Android device should be in the \"setup process,\" which means you likely won't be able to use this feature if your Android phone is already set up. From here, your iPhone will ask you to scan a QR code that should appear on your Android device. Alternatively, you'll be able to tap \"Other Options\" on your iPhone to enter the Session ID and Pairing Code that should appear on your Android.    \n            \n                What do you think so far?\n            \n        \nNow, you can choose the data you want to transfer, including photos, contacts, calendars, call history, and messages. Tap \"Continue\" once complete, then choose to transfer your eSIM, if applicable. (You'll need to double-click the side of your iPhone when prompted to complete the eSIM transfer.) This works in the other direction too, though Apple says you do still need to use the Move to iOS app on Android—at least until Google sets up a similar protocol on its end.  More flexibility from Apple and Google is better for everyone Apple and Google might not be motivated by charity, of course, as the EU has been cracking down on restrictive practices by tech companies in recent years. But while both companies may see this as a way to lose customers, it's also a way to gain them: Sure, some iPhone users may switch to Android if it's easier to do so, but some Android users may do the reverse for the same reasons.More choice is good for everyone—even if it doesn't guarantee exponential growth to shareholders.  \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple and Google Just Made It Easier to Switch Between iPhone and Android",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBZW51YD9RTK9TT6NWP3RZ28/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-12T19:30:00.000Z",
      "dateModified": "2026-02-12T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Claim Your Payout From the 23andMe Data Breach Before It's Too Late",
    "url": "https://lifehacker.com/tech/23andme-data-breach-payout?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JV5C7A284BR4Q698FBBHS8JJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-11T14:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 11, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Jennie Book/Shutterstock\n                            \n            \n                Key Takeaways\n                                            If you were affected by 23andMe's data breach, you have just a few more days to claim your compensation.\n                                            \"Extraordinary\" claims may qualify for up to a $10,000 payout.\n                                            Claims can be filed online via the settlement website, or you can mail a hard copy of your claim form (postmarked by Feb. 17) to the address listed.\n                                    \n            \n    Table of Contents\n    \n        \n        If you were affected by 23andMe's data breach—which involved the information of approximately 6.4 million U.S. residents—you have just a few more days to claim your compensation. Following the 2023 credential-stuffing attack, 23AndMe in 2024 agreed to a $30–$50 million payout for impacted consumers. The genetic testing company then filed for Chapter 11 bankruptcy in 2025 (introducing new privacy concerns around the potential sale of customer data).  The courts approved the deal last month, and class members have until Feb. 17 to submit claims related to the cyber incident. How much you'll receive from the 23andMe settlementThere are several tiers of payouts with the 23andMe settlement. Users with an \"extraordinary claim\"—those who experienced identity theft or fraudulent tax filings as a result of the breach—could qualify for up to $10,000 to reimburse verified expenses, including costs for physical or cyber security systems as well as mental health treatment. Claimants who received notices that certain health information was leaked in the breach will be paid up to $165. Eligible data include raw genotype data, health reports (including health predisposition reports, wellness reports, and carrier status reports), and self-reported health conditions. Individuals residing in Alaska, California, Illinois, and Oregon will receive an additional $100 thanks to state privacy laws. Note that payments will likely take time to be distributed. \nThe settlement also provides for five years of identity monitoring services through a customized program called Privacy & Medical Shield + Genetic Monitoring. This is available to all class members regardless of payout.  \n            \n                What do you think so far?\n            \n        \nHow to file a 23andMe claimConsumers who were impacted by the 2023 data breach can file a Cyber Security Incident Claim, which must be submitted by Feb. 17, 2026 (unless you received a notice in 2026 indicating otherwise). To be eligible, you must have been a 23andMe customer between May 1, 2023 and October 1, 2023 and have received a notice (via letter or email) that your information was compromised in the breach. You also must attest that you incurred damages (monetary or non-monetary) as a result of the incident. Claims can be filed online via the settlement website, or you can mail a hard copy of your claim form (postmarked by Feb. 17) to the address listed. To complete a claim, you must provide some personal information as well as details about the harm incurred with supporting documentation, such as bank or credit card statements substantiating losses. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Claim Your Payout From the 23andMe Data Breach Before It's Too Late",
      "image": [
        "https://lifehacker.com/imagery/articles/01JV5C7A284BR4Q698FBBHS8JJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-11T14:30:00.000Z",
      "dateModified": "2026-02-11T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Just Patched Its First Zero-Day Security Vulnerability of 2026",
    "url": "https://lifehacker.com/tech/apple-just-patched-its-first-zero-day-security-vulnerability-of-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH9B1B0Q2NK5PAYNYW5KKY8R/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-12T18:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple just released a whole host of security patches, including a fix for an actively exploited zero-day affecting iOS 26 and iPadOS 26.\n                                            The flaw could allow attackers with memory write capability to execute arbitrary code.\n                                            You can confirm that you're on the latest OS version under Settings > General > Software Update.\n                                    \n            \n    Table of Contents\n    \n        \n        It's once again time to update your Apple devices. The company just released a whole host of security patches, including a fix for an actively exploited zero-day affecting iOS 26, iPadOS 26, and macOS Tahoe. These updates arrived alongside the official release of iOS 26.3, which includes features like more seamless data transfer between iPhone and Android. Other security patches address bugs in Photos, VoiceOver, and Screenshots, to name a few.  iOS 26.3 patches a zero-day affecting dyldAccording to Apple's latest security bulletin, the zero-day—tracked as CVE-2026-20700—is a memory corruption issue in dyld, Apple's \"Dynamic Link Editor.\" The flaw could allow attackers with memory write capability to execute arbitrary code—or, in other words, run their own code on your device.Apple says that the vulnerability may have been exploited in an \"extremely sophisticated attack against specific targeted individuals\" in earlier versions of iOS alongside CVE-2025-14174 and CVE-2025-43529. Those at greatest risk with this bug are likely high-profile users with access to sensitive data—users who might be inclined to use Apple's Lockdown Mode—but everyone should install the update to patch the issue. \nThe patch for this flaw is available for the following iOS and iPadOS devices, in addition to all Macs that run macOS Tahoe:\n            \n                What do you think so far?\n            \n        \niPhone 11 and lateriPad Pro 12.9-inch 3rd generation and lateriPad Pro 11-inch 1st generation and lateriPad Air 3rd generation and lateriPad 8th generation and lateriPad mini 5th generation and laterHow to install the latest security update for iPhoneYou should have automatic updates enabled to ensure you receive critical security patches ASAP, but you can confirm that you're on the latest OS version under Settings > General > Software Update. As a reminder, Apple won't message you urging you to click links, download attachments, or install apps related to security updates. Always go through your device settings to receive official fixes. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Just Patched Its First Zero-Day Security Vulnerability of 2026",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH9B1B0Q2NK5PAYNYW5KKY8R/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-12T18:00:00.000Z",
      "dateModified": "2026-02-12T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Aggressive Spyware Is Targeting Both Android and iOS Devices",
    "url": "https://lifehacker.com/tech/aggressive-spyware-targeting-android-ios-devices?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH6WXXANC515RHZS40RVFH01/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-11T19:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 11, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            A new spyware platform known as ZeroDayRAT is reportedly being sold on Telegram, complete with customer support and updates.\n                                            Once deployed, it allows everything from user profiling and location tracking to live surveillance and financial theft.\n                                            ZeroDayRAT can infect your device only if a malicious binary—an APK on Android or iOS payload—is downloaded and installed.\n                                    \n            \n    Table of Contents\n    \n        \n        Threat actors don't have to work that hard to obtain sophisticated malware to deploy against unsuspecting targets. A new spyware platform known as ZeroDayRAT is reportedly being sold on Telegram, complete with customer support and updates. According to mobile security company iVerify, this aggressive spyware grants full remote control over devices running Android 15 through 16 and iOS versions up to iOS 26. Once deployed, it allows everything from user profiling and location tracking to live surveillance and financial theft. What ZeroDayRAT can gather from your deviceThis spyware has wide-ranging capabilities that, according to iVerify, have traditionally been found on platforms sponsored by state actors. Here's a look at what ZeroDayRAT can do: \nCollect information about the device, such as model, OS, battery, country, lock status, SIM and carrier info, app usage, live activity, and SMS message previews. This allows threat actors to develop user profiles for further targeting.Pull GPS coordinates, capture notifications from apps and systems, and harvest account information, such as usernames and emails. Send SMS messages and receive verification codes to bypass two-factor authentication. Log keystrokes (including biometric unlocks, gestures, and app launches), access the camera and microphone, and screen record.  Log crypto wallet addresses and target banking and payment app credentials via overlay attacks. How to protect against spywareZeroDayRAT can infect your device only if a malicious binary—an APK on Android or iOS payload—is downloaded and installed. These may be distributed through phishing, such as links sent via emails, texts, or messaging platforms, as well as in fake app stores. \n            \n                What do you think so far?\n            \n        \nAll standard guidance for avoiding scams and malware applies: never click links in unsolicited communication, including conversations in apps like Telegram and WhatsApp, and only download apps and extensions from official, trusted sources. Users at high risk of being targeted and anyone who wants an extra layer of security can consider enabling Lockdown Mode (iOS) or Advanced Protection (Android). \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Aggressive Spyware Is Targeting Both Android and iOS Devices",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH6WXXANC515RHZS40RVFH01/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-11T19:00:00.000Z",
      "dateModified": "2026-02-11T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Is Rolling Out Two New Ways to Remove Your Sensitive Data From Search",
    "url": "https://lifehacker.com/tech/google-is-rolling-out-two-ways-to-remove-sensitive-data-from-search?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH27C4ZZ1PTDF491RFHTWZ7P/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-10T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 10, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Galeh Nur Wihantara/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is rolling out two new tools to request to remove sensitive data from Search.\n                                            The first lets you tell Google to remove government ID numbers like driver's licenses, passports, and Social Security numbers from Search.\n                                            The second makes it easier to request the removal of non-consensual explicit images.\n                                            These tools won't remove this content from the internet, but Google can remove them from Search results.\n                                    \n            \n    Table of Contents\n    \n        \n        Google announced two new ways for users to remove their sensitive information from the web Tuesday morning—or, at least, remove that data from Google Search. The first lets users request that Google remove sensitive government ID information from Search, while the second gives users new tools to request the same for non-consensual explicit images. Google's \"Results about you\" tool is getting an update\n    \n            \n            \n                                        Credit: Google\n                    \n    \nFirst, Google is updating its existing \"Results about you\" tool, which helps users scour the internet for their personal information. Before today, this tool could already locate data points like your name, phone number, email addresses, and home addresses. Following the update, you can now find and request the deletion of search results containing highly sensitive information, including your driver's license, passport, or Social Security number.To launch this tool, click here. If you've never used \"Results about you\" before, you'll need to set it up to tell Google what to look out for. Once you do, you'll be able to add government ID numbers, such as your driver's license, passport, and Social Security number. If Google finds a match, the company will let you know. You can receive an alert from the Google app on your smartphone, which takes you to a summary of what data was found and where. From here, you can choose from \"Request to remove,\" or \"Mark as reviewed.\"  \nUnfortunately, this tool won't remove the data from the websites that are hosting it, but it will eventually remove the search results—sharply reducing the chance that someone will find your data on their own. Google says these changes will roll out in the U.S. over the \"coming days,\" while it is working on bringing them to other countries in the future.  \n            \n                What do you think so far?\n            \n        \nGoogle's simpler way to remove explicit images from Search\n    \n            \n            \n                                        Credit: Google\n                    \n    \nIn addition to these changes, Google is now rolling out a simpler tool for users to request the remove of non-consensual explicit images (NCEI) from Search. If you find such an image on Search, you can tap the three dots on that image, choose \"remove result,\" then \"it shows a sexual image of me.\" You'll have the choice to report whether the photo is real, or is artificially generated, as well, and you can report multiple images at once, if needed. Your requests will all appear in the Results about you hub, so you can track the progress of each.The tool lets you opt-in to an option that will filter additional explicit results in other searches. Google says it will also share links to \"emotional and legal support\" after you submit a request.  \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Is Rolling Out Two New Ways to Remove Your Sensitive Data From Search",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH27C4ZZ1PTDF491RFHTWZ7P/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-10T14:00:00.000Z",
      "dateModified": "2026-02-10T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Opt Out of Ads on ChatGPT, but It Might Not Be Worth It",
    "url": "https://lifehacker.com/tech/ads-on-chatgpt-free?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH26KJW3KJD43H7MWGTR35FH/hero-image.fill.size_1200x675.webp",
    "tag": "Life",
    "date": "2026-02-09T22:20:40.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: OpenAI\n                            \n            \n                Key Takeaways\n                                            OpenAI is rolling out ads to all ChatGPT Free and Go users.\n                                            The company says that ads are private, but are informed by your current and past chats.\n                                            You can opt out of ads for free, but you will reduce your ChatGPT message limits.\n                                    \n            \n    Table of Contents\n    \n        \n        It finally happened. After months of speculation, ChatGPT officially has ads. OpenAI revealed the news on Monday, announcing that ads would roll out in testing for logged-in adult users on Free and Go subscriptions. If you or your organization pays for ChatGPT, such as with a Plus, Pro, Business, Enterprise, or Education account, you won't see ads with the bot.OpenAI says that ads do not have an impact on the answers ChatGPT generates, and that these posts are always clearly separated from ChatGPT's actual responses. In addition, ads are labeled as \"Sponsored.\" That being said, it's not exactly a church-and-state situation here. OpenAI says that it decides which ads to show you based on your current and past chats, as well as your past interactions with ChatGPT ads. If you're asking for help with a dinner recipe, you might get an ad for a meal kit or grocery service. The company claims it keeps your chats away from advertisers. The idea, according to the company, is strictly funding-based so that OpenAI can expand ChatGPT access to more users. That's reportedly why ads are starting as a test, not a hardcoded feature: OpenAI says it wants to \"learn, listen, and make sure [it gets] the experience right.\" As such, advertisers don't have access to chats, chat histories, memories, or your personal details. They do have access to aggregate information about ad performance, including views and click metrics.   \nOpenAI will only show ads to adults. If the service detects that you are under 18, it will block ads from populating in your chats. Ads also will not appear if you're talking to ChatGPT about something related to health, medicine, or politics. You can offer OpenAI feedback on the ads you do see, which should inform the ads you receive in the future. You can also delete your ad data and manage ad personalization, if you want to reset the information OpenAI is using to send you ads.\n    \n            \n            \n                                        Credit: OpenAI\n                    \n    \nThe thing is, you don't actually have to deal with ads, even if you use ChatGPT for free. That's not just by upgrading to a paid ChatGPT plan, though OpenAI does suggest that option in its announcement. In addition, OpenAI is offering Free and Go users a dedicated choice to opt out of ads here. There is, of course, a pretty sizable catch: You have to agree to fewer daily free messages with ChatGPT. OpenAI doesn't offer specifics here, so it's not clear how limited the ad-free experience will be. But if you hate ads, or if you simply don't want to see an ad for something irrelevant to your ChatGPT conversation, it's an option.\n            \n                What do you think so far?\n            \n        \nIf you like that trade-off, here's how to opt out of ads. Open ChatGPT, then head to your profile, which opens your profile's Settings page. Here, scroll down to \"Ads controls,\" then choose \"Change plan to go ad-free.\" Select \"Reduce message limits,\" and ChatGPT will confirm ads are off for your account. You can return to this page at any time to turn ads back on and restore your message limits.  Disclosure: Ziff Davis, Mashable’s parent company, in April 2025 filed a lawsuit against OpenAI, alleging it infringed Ziff Davis copyrights in training and operating its AI systems.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Opt Out of Ads on ChatGPT, but It Might Not Be Worth It",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH26KJW3KJD43H7MWGTR35FH/hero-image.fill.size_1200x675.webp"
      ],
      "datePublished": "2026-02-09T22:20:40.000Z",
      "dateModified": "2026-02-09T22:20:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube TV Will Soon Offer a Cheaper, Sports-Only Plan",
    "url": "https://lifehacker.com/entertainment/youtube-tv-sports-only-plan?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH1Y33RZNJJK1NXJPPWZEY6E/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-09T20:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: NurPhoto / Contributor via Getty Images\n                            \n            \n                Key Takeaways\n                                            YouTube TV will soon offer a number of new plans with more tailored options for less than the current subscription price.\n                                            Options will include a sports-only package, an entertainment-focused package, and at least 10 others.\n                                            YouTube TV currently costs $82.99 per month, but these new plans seem to cost about $10-$30 less per month, depending on the plan.\n                                    \n            \n    Table of Contents\n    \n        \n        Traditional TV works best for live events, and for many people, that means sports. Most of the online services providing access to traditional TV, however, don't allow you to only subscribe to sports. That's going to change.Today YouTube TV announced new plans that are a little bit cheaper than the current cost of $82.99 per month. Among them is a $64.99-per-month Sports plan, which includes access to the big national sports channels including FS1, NBC Sports Network, and all of the ESPN channels, along with access to network television. Basically, if a game is broadcast nationally, this package should give you access. And it will eventually give you access to many out-of-market—the post mentions that ESPN Unlimited will be part of the bundle starting in the fall.The new plan is only an $18 discount over the \"main\" YouTube TV plan, but if you're already paying for YouTube TV and are only ever watching sports, this could be a nice discount, particularly if you get access to ESPN Unlimited. \nThere are a few other discounted plans included in the announcement: The Sports + News package adds CNBC, Fox News, MSNow (formerly MSNBC), CNN, and more to the sports bundle, and costs $71.99. That's only $11 cheaper than the full plan, but is still a nice discount if you were only watching sports and news.\n            \n                What do you think so far?\n            \n        \nBut maybe the biggest savings are for people who don't want to watch sports at all. The Entertainment plan costs $54.99, which is $28 cheaper than the main plan ($336 cheaper per year). If you only watch entertainment channels, with no news or sports, this is the package to look into.There will be more than 10 plans like this rolling out in the next few weeks, according to YouTube TV. I've long dreamed of a world where I could pay only for the cable channels I care about at an affordable rate. This isn't perfect, but it's a bit closer than what YouTube TV offered before.\n            \n    \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from our expert team.\n            The Daily NewsletterReady to do everything better?\n                    Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube TV Will Soon Offer a Cheaper, Sports-Only Plan",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH1Y33RZNJJK1NXJPPWZEY6E/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-09T20:00:00.000Z",
      "dateModified": "2026-02-09T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Study's List of the Most Invasive AI Browser Extensions Includes a Few You Probably Use",
    "url": "https://lifehacker.com/tech/invasive-ai-browser-extensions-study-grammarly?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH0F0DCSGGX7YXWDCMW41CCN/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-09T15:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Smith Collection/Gado / Archive Photos via Getty Images\n                            \n            \n                Key Takeaways\n                                            A host of AI-powered browser extensions that have been installed by tens of millions of users may also be invading your privacy.\n                                            The most invasive extensions fall in the programming and mathematical aid category followed closely by meeting assistants and audio transcribers.\n                                            When adding an extension (or installing an app or program), carefully review the permissions requested.\n                                    \n            \n    Table of Contents\n    \n        \n        Browser extensions, even ones from trustworthy sources, are not without privacy and security risks. I've written before about add-ons that manage to slip through official store safeguards and even some that \"wake up\" as malware after operating normally for several years, so it should come as no surprise that a host of AI-powered browser extensions—collectively  installed by tens of millions of users—may also be invading your privacy. Researchers at data removal service Incogni looked at browser extensions available in the Chrome Web Store that included \"AI\" in their name or description and employed AI as part of their core functionality. By analyzing the data collected and permissions required, they assessed both how likely extensions are to be used maliciously and their potential to cause significant damage if compromised.AI-powered browser extensions collect extensive user dataIncogni found that website content, such as text, images, sounds, videos, and hyperlinks, was the most commonly collected data type (by nearly a third of AI-powered extensions). More than 29% of extensions investigated harvest personally identifiable information (PII)—name, address, email, age, identification number, for example—from users. Other forms of data collected include user activity, authentication information, personal communication, location, financial and payment information, web history, and health information. \nThe most invasive extensions fall in the programming and mathematical aid category (such as Classology AI and StudyX), followed closely by meeting assistants and audio transcribers. Writing and personal assistants also pose privacy risks—and many of these are also among the most downloaded AI-powered extensions in Chrome. How popular AI-powered Chrome extensions stack up on privacyIncogni also assigned \"privacy-invasiveness\" scores to the most downloaded AI-powered extensions, a combination of the amount of data collected and both general and sensitive permissions required: \n            \n                What do you think so far?\n            \n        \nGrammarly: AI Writing Assistant and Grammar Checker App (tied for #1)Quillbot: AI Writing and Grammar Checker Tool (tied for #1)Sider: Chat wiht all AI (tied for #3)AI Grammar Checker & Paraphraser — LanguageTool (tied for #3)Google Translate (tied for #4)WPS PDF — Read, Edit, Fill, Convert, and AI Chat PDF with Ease (tied for #4)Monica: All-in-One AI Assist  (tied for #4)AI Chat for Google (tied for #4)Immersive Translate — Translate Web & PDFChatGPT searchGrammarly and Quillbot were found to collect PII and website content as well as location data like region, IP address, and GPS coordinates. Grammarly also harvest user activity through network monitoring, clicks, mouse and scroll positions, and keystroke logging. While both also require sensitive permissions—such as the ability to inject code into websites and access active browser tabs—they have a relatively low risk of being used maliciously. How to protect your personal informationBrowser extensions that use AI aren't inherently bad, but you should be aware of what information they are collecting and what permissions they are requiring. The most common type of sensitive permissions required are scripting, which allows the extension to interact with pages as you navigate online, as well as activeTab, which lets it read or modify the page for the current session. When adding an extension (or installing an app or program), carefully review the permissions requested. If they aren't essential to the extension's functionality–or if they are but don't seem justified—you may be putting your data or device at risk by allowing them. As Incogni points out, users have to decide how much privacy to sacrifice in order to use apps and services. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Study's List of the Most Invasive AI Browser Extensions Includes a Few You Probably Use",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH0F0DCSGGX7YXWDCMW41CCN/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-09T15:30:00.000Z",
      "dateModified": "2026-02-09T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Blink's Highly Rated Wired Floodlight Camera Is Just $45 Right Now",
    "url": "https://lifehacker.com/tech/blink-wired-floodlight-camera-deal-february-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGSJQ580DYGA88RP63EGCJWT/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-06T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 6, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Adding more visibility to a driveway or backyard is cheaper than you might think. The Blink Wired Floodlight Camera is currently selling for just $44.99 on Amazon, down from its usual $99.99, and price-tracking tools show that's the lowest it has ever been. It’s a wired camera, so it replaces an existing outdoor light and runs on household power. In exchange, you get a 1080p camera with a wide 143-degree field of view and dual LED floodlights that emit 2,600 lumens.\nIn daylight, this camera's footage looks sharp with natural colors, and the wide-angle camera does a good job covering a driveway or yard on its own. At night, the camera switches to infrared black-and-white video that stays clear up to 30 feet, and when the floodlights activate, you get full color night video, making it easier to recognize faces, animals, or vehicles.You'll also get motion alerts on your phone, and the live view in the Blink app loads fast enough to check what’s happening in real time. You can also use the two-way audio to speak through the camera, turn the lights on manually, or trigger the 105-decibel siren to draw attention via the app, according to PCMag's review. \n            \n                What do you think so far?\n            \n        \nAs for the limitations of this floodlight camera, it mostly comes down to subscriptions and ecosystem support. You can view live video and receive motion alerts for free, but recording clips and using person detection requires a Blink subscription. The Basic plan costs $4 per month for one camera, while the Plus plan is $12 per month and covers multiple devices with 60 days of storage. Local storage is possible, but only if you buy the Blink Sync Module 2 ($49.99) and add your own USB drive. Also, while the camera integrates easily with Alexa and IFTTT, there’s no Google Home or Apple HomeKit support, which might matter depending on your smart home setup. Still, for under $50, this is a cost-efficient way to add real lighting and usable security footage in one upgrade.\n            \n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n            Add to Cart NewsletterShop smarter, save more money.\n                    Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blink's Highly Rated Wired Floodlight Camera Is Just $45 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGSJQ580DYGA88RP63EGCJWT/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-06T14:00:00.000Z",
      "dateModified": "2026-02-06T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]