[
  {
    "title": "Ten Brands Scammers Are Most Likely to Impersonate",
    "url": "https://lifehacker.com/money/brands-scammers-often-impersonate?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFXQYHY0R0EAF808M8JXPE40/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T22:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Table of Contents\n    \n        \n        Impersonation scams are everywhere: bad actors are constantly trying to convince you that they represent organizations like LinkedIn, PayPal, your bank, the FBI, the FTC, and the IRS as they look to steal your money and information. When it comes to phishing schemes, which typically try to trick you into handing over sensitive data or account credentials via malicious links, tech brands are (perhaps not surprisingly) among the most commonly spoofed.  A recent report from Check Point Research found that Microsoft was imitated in nearly a quarter of all branded phishing attempts in Q4 of last year—nearly double the next most-impersonated company. The most popular brands for phishing scamsAccording to researchers, tech companies and social networks are consistently among the most popular brands for impersonators running phishing scams, with the following share in the final quarter of last year: \nMicrosoft: 22%Google: 13%Amazon: 9%Apple: 8%Facebook (Meta): 3%PayPal: 2%Adobe: 2%Booking: 2%DHL: 1%LinkedIn: 1%While you should always be on guard for common phishing tactics, it's wise to be especially wary of unsolicited communication from any of the companies listed—especially if that communication is related to account security and/or urges you to click a link. We've covered at least one campaign involving nearly every brand here, all of which are known and largely trusted among users, making them prime targets for these types of scams. Check Point notes that stolen Microsoft and Google credentials are particularly valuable because they're widely used in day-to-day workflows. Common phishing tacticsBroadly speaking, a phishing scam starts with an email, text, or social media message that appears to be from a legitimate source. It likely asks you to update or verify personal information—often related to a payment or account security—with a link to what appears to be the company's website or login page. Of course, this link leads instead to a spoofed version of that site designed to harvest your credentials, credit card number, bank details, or other personal data, which scammers can then use for identity theft, account takeover, or purchase fraud. Note that while the above methods are among the most common, phishing can also happen via phone call, voicemail, and malicious browser pop-ups. \n            \n                What do you think so far?\n            \n        \nHow to protect against branded phishing attacksAs we mentioned, just because you generally trust a company doesn't mean you should blindly trust all communication from it. If you receive a message that is unprompted, sounds urgent, and is unrelated to any recent action on your part (such as a login attempt or bill payment), do not engage with it. Don't click any links, open any attachments, or respond directly. Look out for typos and other errors, including the original sender—though as scammers have found ways to appear verified, this isn't always an obvious red flag. If you're unsure about the contents of the message, go directly to the website or app and log in to see any legitimate alerts. A password manager offers an extra layer of security here, as it'll protect you from entering credentials on a spoofed page. Finally, enable a strong, phishing-resistant form of multi-factor authentication everywhere you can, and especially for high-use and high-value accounts like Microsoft and Google. If your credentials are compromised, threat actors won't have that additional factor to utilize them. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ten Brands Scammers Are Most Likely to Impersonate",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFXQYHY0R0EAF808M8JXPE40/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T22:00:00.000Z",
      "dateModified": "2026-01-26T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Finally Announced a New AirTag",
    "url": "https://lifehacker.com/tech/apple-new-airtag?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFXE93Z0SG6XQK14RECA9R5C/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T16:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Wachiwit/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple just announced a new AirTag.\n                                            The new AirTag comes with the latest Ultra Wideband chip, that boosts Precision Finding by 50%.\n                                            It also comes with a 50% louder speaker compared with the original AirTag.\n                                            Other than that, the new AirTag is about the same as the original, including in price.\n                                    \n            \n    Table of Contents\n    \n        \n        It's been nearly five years since Apple released the first—and only—AirTag, but that's not necessarily a surprise: These trackers aren't really the kind of product you expect to update every year or two. Unlike an iPhone, which gets new processors, cameras, and other hardware features every year, AirTags just ... track your stuff. The only thing that needs replacing annually are their batteries; otherwise, they do exactly what you expect them to. That said, Apple has made changes over the years. In response to initial criticism, the company made it much more difficult for someone to slip one of these AirTags in your bag or car and track you without your knowledge. Plus, there's plenty you can do with the current AirTag that wouldn't make you think you needed an upgraded one. Nonetheless, I suppose the original AirTag wasn't going to be the AirTag for all time. As such, Apple just announced a brand-new AirTag. It likely won't get you out to replace your existing Apple trackers, but these new features will come in handy if you decide to expand your AirTag collection.  What's new with the latest AirTagApple isn't really calling this new AirTag anything in particular: It's still just AirTag. I'm a bit surprised, since, even if Apple replaces the existing AirTag with this one, they'll have a difficult time distinguishing between the first and second gen models.\nBut that's a problem for Apple Store Geniuses, not us. The new AirTag comes with Apple's second-gen Ultra Wideband (UWB) chip. This is the UWB chip Apple uses with the iPhone 17 Line, as well as the iPhone Air, the Apple Watch Ultra 3, and Apple Watch Series 11. That new chip, plus the new Bluetooth chip, boosts Precision Finding's range by 50%. Precision Finding uses your iPhone to guide you to your AirTag, using haptics and visual and audio feedback to tell you when you're getting closer or further away. To be clear, the original AirTag also has a UWB chip that is compatible with Precision Finding, but this new UWB chip will make it easier to find an AirTag that isn't as close by.If you have an Apple Watch Series 9 or Apple Watch Ultra 2, the new AirTag marks the first time you'll be able to use Precision Finding. I'm not sure that's worth the upgrade, since you can always use Precision Finding with your iPhone, but it's certainly a nice perk if you happen to own one of these watches. Precision Finding is helpful for finding your AirTag's whereabouts, but it might not help you locate it if it's hiding, like if it's stuck under a cushion. That's what the speaker is for: You can make your AirTag chirp, so you can find it easier when you're within listening range. The new AirTag's speaker is 50% louder than the original, which should help when you really can't find your AirTag in your couch.  What isn't new with the latest AirTagThat's about all the updates Apple added to this newest AirTag—though you wouldn't know it from the press release. Apple sprinkles in existing AirTag features that might make you think they're fresh, but, really, these are just core features of all AirTags, both new and old. \n            \n                What do you think so far?\n            \n        \nThis AirTag, like all AirTags, works within the Find My network: There's no inherent internet connection to enable tracking. Instead, the AirTag passively connects to any and all internet-connected Apple devices that are also connected to Find My—often, that means iPhones, but it can mean other devices like iPads and Macs. That enables features like Share Item Location, which lets you share your AirTags location with a third-party, like an airline. In that example, the airline can use that info to help find your luggage. The new AirTag also carries over the same privacy and security features as the previous model. No data is stored on device, and all Find My communications are end-to-end encrypted. Whether you have this AirTag or the first, Apple can't see your AirTag, or any devices that connected it to the Find My network. How much does the latest AirTag cost?Apple also didn't change the price of the second-gen AirTag. One of these trackers runs you $29, while a four pack costs $99—a small savings if you want to buy that many. Unless you really need the newest ones, however, you might want to consider the previous gen, since you can pick up a four-pack for $69.99 on Amazon right now. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Finally Announced a New AirTag",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFXE93Z0SG6XQK14RECA9R5C/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T16:00:00.000Z",
      "dateModified": "2026-01-26T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yes, You Can Really Have a Heart Attack From Shoveling Snow",
    "url": "https://lifehacker.com/prevent-snow-shoveling-heart-attack?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GMFF62NV01CASNQ31ASZ3/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-23T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Beth Skwarecki\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Beth Skwarecki\n                            \n        \n            Beth Skwarecki\n                \n                                            Senior Health Editor\n                                    \n            \n            \n        \n            ExperienceBeth Skwarecki is Lifehacker’s Senior Health Editor, and holds certifications as a personal trainer and weightlifting coach. She has been writing about health for over 10 years.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 23, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: SKatzenberger/Shutterstock\n                            \n    Table of Contents\n    \n        \n        You may have heard of people—elderly folks in particular—getting a heart attack from shoveling snow. This is a real risk for a lot of people, especially if you are sedentary and have certain health conditions. Here's a breakdown of what’s so dangerous about shoveling, and who's most at risk. Snow shoveling is hard exerciseThe connection between shoveling and cardiac events is real: The American Heart Association cites several studies that found higher rates of heart attacks and sudden cardiac deaths after snowstorms. Shoveling is hard work, and it can cause your blood pressure and heart rate to rise far higher than levels that are considered safe for sedentary people with heart conditions. Cold temperatures also seem to make chest pain more likely, possibly because your arteries can constrict in the cold.Who should check with a doctor before shoveling?You may have heard the advice to check with a doctor before beginning an exercise program. I have more information on that here: Most people don’t need to check with a doctor, but that depends on your medical history and on whether you intend to do intense exercise. Since snow shoveling is intense exercise, it’s worth taking a look at those guidelines. If you have cardiovascular disease, diabetes, or kidney disease, and are currently not exercising intensely, you should check with a doctor before you start. That’s true whether the intense exercise you want to do is running, Crossfit, or shoveling six inches of snow from your driveway. Pushing a snowblower counts, tooOne surprising thing: The cautions around shoveling snow also apply to using a snowblower. Snowblowing turns out to also be serious exercise, even if, in theory, it should be easier because a machine is doing part of the work. How to reduce your risk of heart attackIn a news release from the American Heart Association, the cardiologist who was the lead author on a paper on risks of exercise recommends that certain people should not do their own shoveling. This includes: \n            \n                What do you think so far?\n            \n        \nPeople who have had bypass surgery or coronary angioplastyPeople who have already had a heart attack or strokeCurrent and former smokersPeople who have diabetes, obesity, high blood pressure, or high cholesterolPeople who are sedentaryObviously, advice from an internet article is not the same as medical advice from your doctor, so please defer to actual medical expertise. And if you’re healthy enough that shoveling snow is reasonably safe, you may still want to take a few precautions to make shoveling easier on your body. By the way, even though running a snowblower is hard work, it’s still usually easier on your body than shoveling. And if you need to shovel, pushing a shovel is easier on your body than lifting it repeatedly. I would add that it’s a game changer to shovel multiple times in a single snowstorm. Instead of waiting until you have six inches of snow on the ground, go out when there’s just two inches and it’ll be a breeze. Repeat that process two more times, and you’ll have a clear driveway without ever having to wrestle with ankle-deep snow. Finally, be aware of how your body is feeling as you shovel, and stop if you don’t feel well. Or as the AHA put it: \"If you experience chest pain or pressure, lightheadedness or heart palpitations or irregular heart rhythms stop the activity immediately. Call 9-1-1 if symptoms don’t subside shortly after snow removal.\"\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yes, You Can Really Have a Heart Attack From Shoveling Snow",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GMFF62NV01CASNQ31ASZ3/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-23T15:00:00.000Z",
      "dateModified": "2026-01-23T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What to Do to Prepare Your House for This Weekend's Historic Winter Storm",
    "url": "https://lifehacker.com/home/prepare-your-home-for-winter-storms?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JAG65KMPBS2GT5X9HQ6CRJ7P/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-23T15:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 23, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: ND700/Shutterstock\n                            \n    Table of Contents\n    \n        \n        Ideally, a winter storm is merely uncomfortable and annoying, but they can sometimes be dangerous for you and your home. This weekend, a potentially historic winter storm is bearing down on some 200 million Americans, who may face dangerously icy conditions and significant snowfall. It's important to know your area's risk and understand the meaning and potential impact of different weather terms (advisory, watch, and warning) so you can respond quickly in the event of an emergency. You should also use the next few days to take steps to prepare your home and lower the chances of damage and danger.Winter prep starts with a thorough inspection of your property, both inside and out and top to bottom. Look for everything from roof leaks to door gaps to clogged gutters—anything that could lead to damage from snow, ice, and freezing temperatures. Make a plan for repairs and winterization to ensure your safety and comfort—not just for the next storm, but for the entire season. Here's a quick summary of the most important tasks to take care of before the temperatures drop or the snow starts to fall. \nTest your smoke and carbon monoxide detectorsThis is something that should be part of your regular home maintenance, and it's especially important when you are using your furnace and fireplace regularly (considering both fire safety and indoor air quality). Follow the Environmental Protection Agency's guidelines for where to install CO detectors and how to inspect and maintain them; then check out the National Fire Protection Association's (NFPA) guidelines for smoke alarms. Make sure your fire extinguisher is handy and working as well. Install an easy-to-read thermometerAny thermostat will show you indoor temperature, and if you have a smart system like an Ecobee or Nest, you have real-time data at your fingertips. The CDC also recommends installing easy-to-read thermometers in locations where you'll see them frequently. This is especially important for older adults, as our sense of temperature changes as we age, increasing the risk of cold-related health issues. Fix drafty windows and doorsGaps around doors and windows keep your home drafty, which is uncomfortable and a waste of energy. Door sweeps, weatherstripping, and caulk can be used to fill spaces that allow cold air in. These are simple DIY fixes that go a long way toward lowering your heating bill and keeping your home warm. If your home has older windows, floor-to-ceiling thermal curtains can also help with insulation even if you lose heating. Winterize your outdoor faucets Before freezing temperatures arrive, make sure your outdoor plumbing is prepared—frozen pipes can burst, causing significant damage to your home. To winterize exterior faucets, remove and store hoses, shut off outdoor water, drain spigots, close them up, and insulate with covers.While you don't need to fully winterize your indoor plumbing unless your house will be vacant for an extended period of time, you should look for pipes that are uninsulated and in or near unheated spaces and consider applying insulation sleeves or heat tape. \n            \n                What do you think so far?\n            \n        \nCheck your furnaceTurn your furnace on and make sure it is working properly. Even if you don't need to heat your home right now, you don't want to scramble to schedule an emergency repair down the line when it's freezing outside. Look for common signs that your unit needs maintenance, such as unusual smells and noises, short cycling, and lack of actual heat. Replace your air filter as well. Inspect and clean your fireplaceYour fireplace or wood stove can provide heat in an emergency. Like your furnace, they need seasonal maintenance to avoid chemical buildup and ensure proper venting, both of which impact your indoor air quality and overall safety. The NFPA recommends annual cleaning, which you can do yourself. However, if it's been awhile since your fireplace was professionally inspected and cleaned, consider scheduling a chimney sweep before you start your first winter fire. You can find one online or ask your local fire department for a recommendation. Stock your snow suppliesIf you get snow in your area, make sure your shovels are accessible and restock your ice melt. If you use a snowblower, give it a thorough inspection, replace any worn or damaged parts, change the oil, top it off with fresh gas, and start it up to make sure it runs. Replenish your emergency kitYou should be prepared for storms during any season with a stock of disaster supplies so you and your family (and pets) can survive without outside aid for a few days if needed. We have a guide to creating an emergency kit if you don't have one already, but you should also check all supplies and replenish anything that has been used or is missing. For winter, be sure you also have sleeping bags, warm blankets, and climate-appropriate changes of clothes and shoes available.\n            \n    \n    \n            Never miss a story\n                Get the latest smart home news, trends, and advice from Jordan and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What to Do to Prepare Your House for This Weekend's Historic Winter Storm",
      "image": [
        "https://lifehacker.com/imagery/articles/01JAG65KMPBS2GT5X9HQ6CRJ7P/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-23T15:30:00.000Z",
      "dateModified": "2026-01-23T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Now Instagram Is Down Too",
    "url": "https://lifehacker.com/tech/instagram-is-down-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFKAF9KSJHT1YPXJFXE7GAFT/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-22T17:12:12.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 22, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: miss.cabul/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Instagram is currently down, according to Downdetector.\n                                            Both the app and website appear to be affected.\n                                            Meta will undoubtedly issue a fix sometime soon.\n                                    \n            \n    Table of Contents\n    \n        \n        If you just tried to open Instagram on your phone or computer, only to find that nothing would load, don't worry: It's not your wifi, nor is Verizon experiencing another outage. The fault instead lies with Meta, as Instagram is currently down. That's according to Downdetector, owned by Lifehacker parent company Ziff Davis, which shows over 2,000 user reports of issues with Instagram at the time of this writing. The issues seem to affect Instagram in all forms. While the mobile app was working last time I checked, I couldn't get it to load in Safari. That means you might not be able to check out posts, add new posts, or send and receive DMs—at least until Meta figures out what's causing the issue. \n            \n                What do you think so far?\n            \n        \nInevitably, of course, it will: Outages and downtime happen, though it seems this week they're happening with increasing frequency. There was, obviously, Verizon (which the company attributes to a software issue), but also issues with Yahoo!, X, and Microsoft 365. Something's in the air this week, it seems. Whatever is going on with Instagram though, Meta will assuredly figure it in due time. Usually, these things are resolved pretty quickly, but if there's a deeper issue, us Instagram users may have to go without the app for some time.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Now Instagram Is Down Too",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFKAF9KSJHT1YPXJFXE7GAFT/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-22T17:12:12.000Z",
      "dateModified": "2026-01-22T17:12:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "It's Not Just You, Microsoft 365 Is (Still) Down",
    "url": "https://lifehacker.com/tech/microsoft-365-is-down-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFGSCGZZ7Q0ZMYVDW6NWCC5S/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-22T19:53:30.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 22, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: aileenchik/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Microsoft is currently experiencing another outage with its services.\n                                            Users are reporting issues with Microsoft 365, Microsoft Teams, and Microsoft Outlook.\n                                            This is the second day in a row that Microsoft has experienced these downtimes.\n                                            If your apps are impacted, you'll need to wait for Microsoft to issue a patch.\n                                    \n            \n    Table of Contents\n    \n        \n        Heads up, workers of the world: Microsoft 365 is currently down. Microsoft's flagship work suite, which includes tools like Microsoft Teams and Microsoft Outlook, is currently experiencing issues impacting users. It's not yet clear exactly why these problems are occurring, but according to Downdetector (owned by Lifehacker parent company Ziff Davis) thousands of users are reporting issues.There are any number of causes that could trigger a widespread outage like this, and in all likelihood, Microsoft will have the issue isolated and fixed soon—especially considering how many companies and users rely on Microsoft 365 to function. But it does follow a number of high-profile outages this week. Yesterday, Yahoo! and AOL were both down. Last week, X experienced an outage, as did Verizon—quite famously, I might add. And this morning, Instagram was also down.\n            \n                What do you think so far?\n            \n        \nBut joining that list as well is none other than Microsoft itself. These services were all down yesterday, too, making this the second day in a row. Again, it's not clear why Microsoft is experiencing these issues, but while we wait for a fix, there's not much you can do on your end. If your Microsoft apps are acting up, you can try to work with any of the offline tools you have access to. If you have other means of communication other than Teams, run with that. There's nothing short of Microsoft issuing a patch on its end that will bring back online functionality here.     \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "It's Not Just You, Microsoft 365 Is (Still) Down",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFGSCGZZ7Q0ZMYVDW6NWCC5S/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-22T19:53:30.000Z",
      "dateModified": "2026-01-22T19:53:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta Is Being Sued Over Whether WhatsApp Really Encrypts Your Messages",
    "url": "https://lifehacker.com/tech/meta-sued-whatsapp-encryption-claims?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFXEEGX9SV89M0M6GXJEH96N/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-26T16:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit:  miss.cabul / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            An international group of plaintiffs allege that WhatsApp's end-to-end encryption isn't actually private.\n                                            Meta denies the claims, calling the lawsuit 'frivolous.'\n                                            Lawyers are asking the court to certify a class-action.\n                                    \n            \n    Table of Contents\n    \n        \n        Shortly after Meta (then Facebook) bought WhatsApp in 2014, it promised to implement a surprisingly un-Facebooky feature: End-to-end encryption. The move was supposed to be a boon for privacy, ensuring nobody could see your messages aside from the recipient and yourself. Even now, WhatsApp's website claims, \"No one outside of the chat, not even WhatsApp, can read, listen to, or share [your messages].\" However, a new lawsuit filed in the U.S. District Court in San Francisco is now claiming that's not the case.According to reporting from Bloomberg, an international group of plaintiffs has sued Meta, saying that the app's claims of end-to-end encryption are a lie. The lawsuit alleges that Meta and WhatsApp \"store, analyze, and can access virtually all of WhatsApp user's purportedly 'private' communications.\"The plaintiffs include users from Australia, Brazil, India, Mexico, and South Africa, who are being represented by attorneys from several firms. The allegations cite \"whistleblowers\" who helped bring this information to light, but no more is known as of yet.\nWhen I reached out to Meta for comment, Meta strongly denied the allegations. The company called the lawsuit \"frivolous,\" assuring users that WhatsApp uses the open-source Signal protocol for encryption and adding that \"[a]ny claim that people's WhatsApp messages are not encrypted is categorically false and absurd.\"\n            \n                What do you think so far?\n            \n        \nIf the lawsuit succeeds, it could affect billions of users around the world. That's because the plaintiffs' lawyers are asking the court to certify a class-action lawsuit.In the meantime, WhatApp is far from the only option for encrypted messaging apps. While it's unclear how the lawsuit will proceed, those looking to jump ship might want to look at alternatives like Signal or Viber instead. Note that some apps, like Telegram, do offer end-to-end encryption, but don't enable it by default. (Personally I use Line, because of the anime stickers.)\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta Is Being Sued Over Whether WhatsApp Really Encrypts Your Messages",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFXEEGX9SV89M0M6GXJEH96N/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-26T16:30:00.000Z",
      "dateModified": "2026-01-26T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "We Now Know What Caused the TikTok Outage",
    "url": "https://lifehacker.com/tech/tiktok-outage-cause?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFY3GDB84S524T0BHE3FZMSS/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T23:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: daily_creativity/Shutterstock\n                            \n            \n                Key Takeaways\n                                            TikTok experienced an outage on Sunday.\n                                            The company released a statement on Monday, attributing the issue to a power outage at a U.S. data center.\n                                            The app just experienced a change in ownership as the Chinese-based Bytedance officially divested its majority stake to U.S. companies.\n                                    \n            \n    Table of Contents\n    \n        \n        If you tried hopping on TikTok Sunday, you might have noticed something odd: the app wasn't working. Outages happen, of course, as anyone who has Verizon can attest. But in the moment, theories were flying left and right. TikTok had just officially moved into U.S. control, leading some to speculate that the outage had something to do with this change in ownership. As one user put it, \"TikTok being down days after the people they were forced to sell to take it over does not feel like a coincidence.\" As it happens, it does appear that the changing of the guard was responsible for the outage—just not in the way that some conspiracy theories might suggest. TikTok finally released a statement on X Monday morning, attributing the outage to issues at a U.S. data center. The statement is as follows: \"Since yesterday we’ve been working to restore our services following a power outage at a U.S. data center impacting TikTok and other apps we operate. We're working with our data center partner to stabilize our service. We're sorry for this disruption and hope to resolve it soon.\"   The outage might not be the only thing different about TikTokFor its part, TikTok is very much operational at the moment. If the issue really was just isolated to a power outage at this data center, that data center appears to have patched things up. But that doesn't mean the company's reputation is patched up. Users are accusing the app's new owners of changing the algorithm, complaining of reset For You Pages, irrelevant content in feeds, and AI-generated content. I've seen users accuse the app of blocking anti-Trump and anti-ICE content, while comedian Gianmarco Soresi says even some of his non-political TikToks have \"zero views,” which he attributes to the ineffectiveness of the people running the app. (I've reached out to TikTok for comment on user reports of changes to the algorithm and will update if I hear back.)\n            \n                What do you think so far?\n            \n        \nWe'll need more time to know whether or not there were serious changes made to TikTok's algorithm and user feeds in the wake of this sale. But the app is running—at least, for now.  \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We Now Know What Caused the TikTok Outage",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFY3GDB84S524T0BHE3FZMSS/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T23:00:00.000Z",
      "dateModified": "2026-01-26T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Android 16 Makes Split Screen Easier on Smaller Screens",
    "url": "https://lifehacker.com/tech/androids-16-makes-split-screen-easier-on-smaller-screens?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF2T47H78X04P1P9DDKJEE9Z/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-16T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    \n        \n        Stock Android added the concept of App Pairs back in Android 15. You choose two apps to use in split screen mode, add a shortcut to the paired apps to the home screen, and it's now trivially easy to trigger split screen multitasking (instead of having to perform multiple tap and drag gestures).It sounds neat, but I never really used it, because on my small Pixel 9a, using apps in 50:50 split-screen mode is hardly user-friendly. There's just not enough room on the screen for each app to take up half of it and still be usable. But that changed with Android 16, thanks to a small update to how split screen works.In Android 16, the split screen ratios for app pairs are much more flexible. You can have two apps in 70:30, or even 90:10. And once you get used to the idea of 90:10 split screen multitasking, things really start to flow.\nFor example, I have an app pair for my Chrome and Gemini apps. Chrome for browsing, and Gemini for research. \n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nChrome is usually my maximized app, taking up 90% of my screen space, while Gemini is docked at the bottom, minimized. But with one tap, Gemini comes to the front and Chrome takes a back seat. And I can keep switching between the two just as easily. This is much faster than using Android's multitasking menu.\n            \n                What do you think so far?\n            \n        \nHow to set up App Pairs with 90:10 split screen multitaskingTo set up an App Pair and try this out for yourself, you'll first need to create a split screen pair. Open the two apps that you want to pair, and then go to the multitasking view (swipe up from the Home bar and hold for a second). Tap the name of the first app you want to open and choose the Split screen option. Then choose another app to pair it with. You'll now enter a 50:50 split screen view. Grab the handle in between the two apps and drag it all the way up or all the way down to trigger the 90:10 split. Alternatively, you can also set up a 70:30 split by leaving some extra space on your second app.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nNow, go back to the multitasking view, tap on one of the app names, and choose the Save app pair option.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nAfter that, you'll find the app pair as a shortcut on your home screen. Tap on it to launch your pre-configured app combo. And yes, it does remember your last used split screen ratio, saving you some valuable setup time. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Android 16 Makes Split Screen Easier on Smaller Screens",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF2T47H78X04P1P9DDKJEE9Z/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-16T15:00:00.000Z",
      "dateModified": "2026-01-16T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Five Daily Learning Apps to Try After Duolingo",
    "url": "https://lifehacker.com/tech/five-daily-learning-apps-to-try-after-duolingo?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFM4A41GNP62VZSFT3DZ3AM2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Ascannio/Shutterstock\n                            \n    Table of Contents\n    \n        \n        Duolingo, no matter how you feel about it, accomplishes one thing: It makes practicing a skill every day easy. The application focuses on language, but it also offers math, music, and even chess lessons if you dig around a bit. There are many other subjects worth learning, though, and many ways you can use gamification to learn new skills and generally improve your life. Here are five I found:Learn geography with Globo\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nI love traveling and learning about the world, but I'll admit there are some regions I don't know well. Globo is an iOS and Android app that quizzes you on flags, capitals, and more, all while teaching you trivia along the way. There are courses for all the continents, if you want to focus on a specific region, or you can take the combined global course and work your way through the whole planet. I've been playing with this for about a week and enjoying it for the most part. I like the way questions I answered wrong show up in future quizzes. It does feel like I'm going to run out of content fairly quickly, which is disappointing, but given that the application is free with no in-app subscriptions, I think it's worth checking out. \nLearn art history with Learn Art\n    \n            \n            \n                                        Credit: Normand Martin\n                    \n    \nLearn Art is a free iPhone and iPad application by developer Normand Martin. With it, you'll find a slideshow of classic art from European history. To learn the history of the piece, tap the screen. You can also take an interactive quiz on art history. I'm going to be honest: Art history is very much not my subject. In playing with this for a couple days, though, I find myself able to identify more artists than I did before, and if nothing else, it's nice to have access to high resolution scans of so many classic works of art right on my iPad. If you're at all curious about art history, I'd say give it a spin. The app is free but there is an in-game currency you can earn either by answering questions correctly or spending money. In my testing this wasn't too much of a burden. Learn instruments with Yousician\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nI've been meaning to get back into playing guitar for a while, so I've been testing various apps. Yousician seems like a great starting point, assuming in-person instruction isn't an option. This application uses the microphone on your device so you can use a real instrument to learn actual songs. The guitar version, which I tried for a few days, combines video instruction with Guitar-Hero style practice sessions. There's even a backing track during the early lessons, which might help anyone who'd prefer to play along to an actual song. This makes the early stages of learning an instrument, which can be a drag, feel fun. \n            \n                What do you think so far?\n            \n        \nThere are also courses for piano, ukulele, bass, and singing. If you want to get a feel for it, there is a limited free version, but you might need to tap the \"X\" on the prompt to enter your credit card number if you don't want to pay. Plans start at $7.49 per month.Learn typing with TypingClub\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nWish your typing was faster, or more accurate? The free website TypingClub is perfect for this. It offers touch typing lessons starting from the very basics with tests to work your way up. Lessons unlock as you go. If the early lessons are too easy for you, you can always take a test to earn a higher placement. Memorize anything with Anki's flash cards\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nI didn't grow up in the U.S., meaning I didn't learn the state capitols and locations as a kid. At one point I was tired of not knowing where anything is, so I downloaded Anki. This is an open source application for every platform that makes it easy to learn using flash cards. The system is all about self accountability: You report how easily you were able to come up with the right answer. The system is set up to keep exposing you to the things you find hard. You can design your own decks, if you want, or you can use any of the thousands of decks offered on the website. I, having mastered U.S. states, am moving on to learning the Mexican ones. I'm sure there's something you're interested in memorizing, too.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Five Daily Learning Apps to Try After Duolingo",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFM4A41GNP62VZSFT3DZ3AM2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T14:00:00.000Z",
      "dateModified": "2026-01-26T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "My Favorite Amazon Deal of the Day: The Garmin Forerunner 55",
    "url": "https://lifehacker.com/health/garmin-forerunner-55-sale-amazon?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JPR283AK9N6BR617ZCVZ6DYG/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-22T17:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                            \n        \n            Daniel Oropeza\n                \n                                            Staff Writer\n                                    \n            \n            \n        \n            ExperienceDaniel is a Staff Writer for Lifehacker covering tech deals and reviewing TVs, headphones, speakers, and projectors. He earned his master’s in journalism from Columbia University and has reported for the Miami Herald. He lives in Atlanta.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 22, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Ian Moore and product image courtesy of Amazon.\n                            \n    Table of Contents\n    \n        \n        Ever since I retired my G-Shock in 2015, I’ve been using fitness smartwatches, and some way or another, they’ve all been Garmins—some were passed down from family members, and others were gifts. If you’ve never owned a Garmin watch and want to try one out, the best budget Garmin for runners is down to its lowest price ever, according to price-tracking tools. You can get the Garmin Forerunner 55 for $149 (originally $199.99).\nAs Senior Health Editor Beth Skwarecki said in her intensive search for the best fitness watches for runners, the Garmin Forerunner 55 is the best budget choice you can make, especially at this record-low price. You get some features that have historically only been found in the premium versions, like the Respiration Rate Tracker feature, which tracks your breathing rate. The battery life is up to two weeks when it’s in standby mode and 20 hours when using GPS tracking.\nYou can use the Daily Suggested Workouts to suggest how to train to reach your running goals. If you like to run on tracks, you can choose which lane you’re in with Track Mode, which gives you exact pacing for much better accuracy, snapping your times at 100-meter intervals. Based on those numbers, you can also see the Race Predictor, which tells you how you’d fare in a marathon and other race lengths using your VO2 max and other metrics. There's also Recovery Hours, which suggests how long you should wait until you do another intense workout. \n            \n                What do you think so far?\n            \n        \nWhile the Forerunner 55 was released back in 2021, it's still a great budget option in 2026 since Garmin is known for supporting devices with updates for several years. At this price, you can get a great runner companion to keep track of your miles and still make the rent next month.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "My Favorite Amazon Deal of the Day: The Garmin Forerunner 55",
      "image": [
        "https://lifehacker.com/imagery/articles/01JPR283AK9N6BR617ZCVZ6DYG/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-22T17:00:00.000Z",
      "dateModified": "2026-01-22T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oh Great, It Looks Like Android Is Doing 'Liquid Glass' Now Too",
    "url": "https://lifehacker.com/tech/it-looks-like-android-is-adding-liquid-glass-now-too?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFXGVH2G5Z7154JD70JH297K/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T18:30:43.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            Internal builds of Android 17 show blur is being added across the entire OS.\n                                            According to 9to5Google, the blur produces a transparency effect similar to Apple's Liquid Glass.\n                                            You can turn off blur in your Settings app.\n                                    \n            \n    Table of Contents\n    \n        \n        When Apple introduced Liquid Glass to the public in June of last year, it kicked off a saga that's still ongoing. The company's toned down the effect multiple times, and in November, it added controls for tinting it. Some have even found out ways to disable Liquid Glass entirely. It's not a quagmire I'd jump into willingly, but apparently, that's exactly what Android's about to do.According to \"images of internal builds\" seen by 9to5Google, Android's next update will add significant amounts of blur \"across Android 17.\"\"Throughout the OS, you can expect a system UI that switches from solid light or dark backgrounds to a blur effect that allows you to see what's immediately behind the component you're interacting with,\" writes 9to5Google's Abner Li.\nThat sounds a lot like Liquid Glass to me, and Li further confirms that elements like the volume bar and mode switcher will be translucent, allowing you to see your wallpaper and app icons in the background.\n    \n            \n            \n                                        Credit: Google\n                    \n    \nThis actually isn't Google's first time experimenting with transparency effects. In Android 16 QPR1, Google already added blur to the notification and quick settings panels. What's new is that we can now expect it in other parts of the OS as well, for a more cohesive look. So if it hasn't bothered you yet, you don't need to worry about opening your phone on Android 17's release date and seeing a brand new interface.Li also says that \"Compared to Liquid Glass on iOS, Android's new look is more subtle,\" although some are likely to be more sensitive to it than others.\n            \n                What do you think so far?\n            \n        \nPersonally, I haven't noticed the blur that's already there much, but even if you don't mind the aesthetic, the effect can be a slight drain on battery life. Luckily, even before it's been introduced across the OS at large, there's a way to turn off blur in Android.This came in Android QPR2, specifically as a response to the new effects (although it was technically available in developer options before then). To do this, open your Settings app, and then navigate to Accessibility > Color & Motion. From there, tap on Reduce blur effects. The change will take place immediately, so you'll be able to test then and there which look you prefer.Like other new Android features, the blur is likely to come to Pixels first, and because Google's branding it as part of its own Material 3 Expressive design language, it might not make the jump to Samsung Galaxy or other Android phones. The exception could be in Google-branded apps, although Li said \"it remains to be seen\" whether Google will add blur to its apps in addition to the OS.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oh Great, It Looks Like Android Is Doing 'Liquid Glass' Now Too",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFXGVH2G5Z7154JD70JH297K/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T18:30:43.000Z",
      "dateModified": "2026-01-26T18:30:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Soundcore Bluetooth Speaker Is $75 Right Now",
    "url": "https://lifehacker.com/tech/soundcore-boom-3i-bluetooth-speaker-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFXJJWTDA9K75MF3QJMNYPVX/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-26T17:00:16.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Lifehacker / Amazon\n                            \n    Table of Contents\n    \n        \n        The Soundcore Boom 3i is clearly built with water-first trips in mind. It has an IP68 rating, so it’s fully resistant to dust and water, and it’s also designed to handle saltwater, which in itself is pretty rare even for outdoor speakers. That’s the kind of detail that matters if your idea of “outside” means beaches, boats, or time near the ocean. It also floats, and it does so with the speakers facing upward, which keeps the sound usable instead of muffled when it’s bobbing around. In practice, that makes it less annoying to live with than other floating speakers that constantly flip or drift sideways. The Boom 3i normally sits at $129.99, but it’s currently down to $74.99, which is the lowest price it has reached so far, according to price-trackers.\n    \n    \n                                Soundcore Boom 3i by Anker, Rugged Outdoor Speakers, IP68 Waterproof, Floating Playback, Saltwater-Resistant, BassUp 2.0, 50W Portable Speaker, Bluetooth 5.3, 16H, TWS, Kayak/Fishing/Camping-Brown\n                \n            \n\nAt just over three pounds, this speaker is portable enough to sling across your shoulder with the included strap, but sturdy enough not to feel cheap. It pushes out up to 50 watts of sound, which is more than enough for a beach hang or a camping trip with a small group. You won’t get floor-shaking bass, but the mid-bass hits nicely, and the overall tone stays warm. That said, there’s a BassUp button if you want to dial things up, and the companion Soundcore app has a nine-band EQ, if you want more control. Battery life hovers around 15–16 hours at moderate volume, and it keeps playing while charging over USB-C, which is useful if you’re running it off a power bank.\n            \n                What do you think so far?\n            \n        \nThe Boom 3i also has a Buzz Clean mode that uses a low-frequency vibration to loosen sand and grit stuck inside the speaker. It’s surprisingly effective, though it doesn’t replace a quick rinse after a full day at the beach. You also get an emergency alarm and a voice amplifier, which won’t matter much in everyday use but could come in handy on the water or during group activities. If what you want is a speaker that shrugs off salt, sand, and splashes without interrupting playback, this one makes sense at its current price.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Soundcore Bluetooth Speaker Is $75 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFXJJWTDA9K75MF3QJMNYPVX/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-26T17:00:16.000Z",
      "dateModified": "2026-01-26T17:00:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "All the Ways to File Your Taxes for Free in 2026",
    "url": "https://lifehacker.com/money/how-to-file-your-taxes-for-free?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JJMDMTGR2V2YW4G68G62DNK9/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-26T17:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Tax season is here again, which means it is time to start working on preparing your return (and paying any balance due) ahead of the April 15 filing deadline. As usual, many people will have the option to file their returns for free, but the options are more limited this year, as the short-lived IRS Direct File program, which provided no-cost filing to taxpayers in 25 states, is no more. If you want to avoid paying for the privilege of paying your taxes, here are the remaining ways to file for free in 2026. IRS Free File is one of several free filing options provided by the IRS. With Free File, you complete your tax return using guided software via a partner site, which then e-files it with the IRS. Most commonly used federal tax forms and schedules are available through Free File. However, your adjusted gross income must have been $89,000 or less in 2025 to be eligible for this option. \nIf you do qualify for Free File, go directly through the IRS website—you'll see a list of trusted third-party preparers with their eligibility criteria, or you can use the guided tool to find the best option for your situation. Note that some IRS partners will also file your state return for free, while others charge an additional fee. \n            \n                What do you think so far?\n            \n        \nOther ways to file your taxes for freeIf you make too much for IRS Free File, you may still be able to file your taxes for free. Free Fillable Forms: This option is just like it sounds. You enter your information into the IRS' fillable forms using the provided instructions and file the return yourself. There are no income limits for Free Fillable Forms, but it does have limited guidance, and state returns are not included. You will still need to create a Free File account. Commercial tax software: If your taxes are relatively simple, you can go through tax preparation companies like TurboTax and H&R Block without paying any fees. Cash App Taxes is another free option. Note that these companies also have paid services, so make sure you understand what you are signing up for. Volunteer tax prep help: The IRS offers free tax prep support for eligible taxpayers through the Volunteer Income Tax Assistance (VITA) and the Tax Counseling for the Elderly (TCE) programs. Taxpayers who make less than $69,000 per year, who have disabilities, or who have limited English proficiency qualify for VITA, while TCE supports those who are age 60 and older. Enter your zip code into the locator tool to find volunteer tax prep options in your area. MilTax: MilTax offers free tax preparation and filing for eligible military members, including up to three state returns. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All the Ways to File Your Taxes for Free in 2026",
      "image": [
        "https://lifehacker.com/imagery/articles/01JJMDMTGR2V2YW4G68G62DNK9/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-26T17:30:00.000Z",
      "dateModified": "2026-01-26T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Samsung Galaxy Watch Ultra Is on Sale for $390 Right Now",
    "url": "https://lifehacker.com/tech/samsung-galaxy-watch-ultra-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFKHND7BPH87ASRT9VNY6RC7/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-22T20:00:11.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                            \n        \n            Daniel Oropeza\n                \n                                            Staff Writer\n                                    \n            \n            \n        \n            ExperienceDaniel is a Staff Writer for Lifehacker covering tech deals and reviewing TVs, headphones, speakers, and projectors. He earned his master’s in journalism from Columbia University and has reported for the Miami Herald. He lives in Atlanta.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 22, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Rene Ramos. \n                            \n    Table of Contents\n    \n        \n        Samsung announced the Galaxy Watch Ultra in the summer of 2024, and then refreshed it last August with double the storage and new color options. As we all know, older versions get big discounts, and if the extra storage and colors aren't a big deal to you, you could be in a great position to get a flagship Samsung smartwatch at a big discount. The 2024 Bespoke Edition 47mm LTE Samsung Galaxy Watch Ultra is selling for $389.95, originally $649.99 at launch. This is the lowest price it has reached, according to price-checking tools. The Galaxy Watch Ultra emphasizes outdoor and exercise features, but it's much cheaper than other premium fitness watches like the Apple Watch Ultra.\nThe Galaxy Watch Ultra excels over other watches in one key aspect: its outdoorsy features. If you're an avid hiker or an athlete who spends long hours outdoors, it's a great choice. Like any good rugged watch, this one is tough, made out of Grade 4 titanium, and has an IP68 water- and dust-resistant rating. You can also take it up high altitudes (up to 9,000 meters) and it can withstand up to 10ATM of pressure (about 330 feet underwater). You also get a built-in siren in case of emergencies. The screen is a 1.47-inch Super AMOLED display, brighter than previous Samsung AMOLED smartwatches. The only downside is that it comes in just one size—47mm.The watch runs WearOS from Samsung and comes with 32GB of storage. The 590mAh battery is one of the best for its price point, making it perfect for prolonged outdoor use. If you don't use any power-saving modes, it'll last 60 hours, but it can go up to 100 hours if you're conservative.\n            \n                What do you think so far?\n            \n        \nOne of the new features this watch brings is AI-based health metrics and advanced sleep tracking, which you can read more about in PCMag's \"excellent\" review. If you're looking for a more budget-friendly and smaller option for more general use, the Samsung Galaxy Watch 7 at $217 (originally $379.99) is a great option.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Samsung Galaxy Watch Ultra Is on Sale for $390 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFKHND7BPH87ASRT9VNY6RC7/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-22T20:00:11.000Z",
      "dateModified": "2026-01-22T20:00:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]