[
  {
    "title": "What to Do Before Microsoft Cuts Off Support for Windows 10 on Tuesday",
    "url": "https://lifehacker.com/tech/extra-year-windows-10-security-updates?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JYKW5CHJ5W0VMC8STAYW46FR/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-13T14:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What to Do Before Microsoft Cuts Off Support for Windows 10 on Tuesday",
      "image": [
        "https://lifehacker.com/imagery/articles/01JYKW5CHJ5W0VMC8STAYW46FR/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-13T14:00:00.000Z",
      "dateModified": "2025-10-13T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spotify Premium Subscribers Can Finally Save Their Algorithm From Their Kids",
    "url": "https://lifehacker.com/tech/spotify-premium-subscribers-can-now-manage-accounts-for-their-kids?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7J0J707XJ2W2PSN8EFABTK2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-14T19:30:58.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            No more kids music in your Spotify Wrapped.\n    \n        \n    \n                                        \n        \n        \n        October 14, 2025\n                    \n            Credit: Spotify\n                            \n            \n                Key Takeaways\n                                            Spotify is rolling out managed accounts to more countries, including the U.S.\n                                            Managed accounts allow parents to manage the music their kids listen to.\n                                            At the same time, kids are free to listen to whatever approved music they want.\n                                            Kids' listening histories will not impact the account owner's.\n                                    \n            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.If you have a Premium Family plan through Spotify, there's good news: You can now set up managed accounts for your kids. Not only can you control what they listen to, their music choices won't reflect in or affect your listening history. Congratulations: You're getting your Wrapped back.    On Tuesday, Spotify announced it is rolling out managed accounts for Premium subscribers to seven new regions: the U.S., UK, Canada, Australia, Germany, France, and the Netherlands. Premium Family subscribers in these countries can now create managed accounts for users younger than 13 that allow those users to listen on their own, in a controlled environment. \n        \n            You May Also Like\n        \n    \nManaged accounts are music-only, so younger listeners can't browse Spotify's other offerings, such as podcasts, or send or receive DMs. In addition, account managers can control a number of settings on these accounts, including whether the account can listen to explicit music, choose to block specific artists and songs, and decide to hide video—including short-form Canvas content.While Spotify has an existing service designed for children, Spotify Kids, it's much different, as it only contains music hand-picked for the service, and doesn't allow subscribers to control the account. Managed accounts allow subscribers to give a full Spotify experience to their kids, while having total control over what they can listen to. Personally, I think this is a fantastic feature. As someone who grew up in the early days of iTunes, I would have loved the ability to add whatever songs I wanted to my playlists—assuming my parents gave those songs the OK, of course. It's also great that kids can get recommendations for new music from Spotify. If they are obsessed with the latest trending song, perhaps Spotify can recommend similar tunes, both contemporary tracks as well as classics. It could be a great way to expand kids' music tastes.   Spotify first tested managed accounts in 10 other countries: New Zealand, Sweden, Denmark, Spain, Italy, Portugal, Brazil, Mexico, Argentina, and Columbia. It's now available as part of its Premium Family plan, which costs $19.99 per month.   How to create a managed accountIf you're using the Spotify mobile app, head to Settings and privacy > Account > Premium Family. If you're on your account page on Spotify's website, choose \"Manage members.\" Either way, under Plan members, choose to add members to your plan. Choose \"Add a listener aged under 13,\" then choose \"Add account.\"You'll then follow the on-screen steps to confirm you are the parent or guardian of the listener; set a PIN to control the experience; choose the name and birthdate of the listener; and choose your settings. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spotify Premium Subscribers Can Finally Save Their Algorithm From Their Kids",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7J0J707XJ2W2PSN8EFABTK2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-14T19:30:58.000Z",
      "dateModified": "2025-10-14T19:30:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TiVo Has Officially Discontinued Its DVRs",
    "url": "https://lifehacker.com/tech/tivo-discontinued-its-dvrs?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7MN6ZGVZEHBFAHY5DNHX0WE/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-15T21:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            It's the end of an era.\n    \n        \n    \n                                        \n        \n        \n        October 15, 2025\n                    \n            Credit: Michael Vi/Shutterstock\n                            \n            \n                Key Takeaways\n                                            TiVo has officially discontinued its line of DVRs that made the company a household name.\n                                            Following reporting from Cord Cutter News, TiVo's parent company confirmed DVRs had been discontinued as of Oct. 1.\n                                            TiVo changed the way we watch TV, and arguably ushered in our current streaming age.\n                                    \n            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.It's the end of an era: TiVo no longer manufactures or sells the DVRs that made the company a household name. If you still have one, the company will continue to support it, but don't go looking for one: TiVo as we know it is effectively over.TiVo didn't make a big deal about this discontinuation, however. As it happens, Luke Bouma of Cord Cutter News was the first to spot the development. Earlier this month, Bouma reported that TiVo Corporation had silently ended its DVR line, removing all references to the devices on its website. Following Bouma's reporting, TiVo's parent company, Xperi, confirmed the news.\n        \n            You May Also Like\n        \n    \nIn a statement to PCMag, an Xperi spokesperson said: \"I can confirmed that as of [Oct.] 1, 2025, TiVo stopped selling physical DVR products, including hardware and accessories, both online and through agents...TiVo no longer manufacturers hardware, and our remaining inventory is now depleted, though we will continue to offer support for the products going forward.\" TiVo isn't gone entirely. The brand now develops both TiVo OS, a smart TV operating system similar to Roku OS or Fire OS, as well as DTS AutoStage Video Service, an entertainment service developed for cars. But it is no longer a DVR manufacturer or seller, which might shock a time traveler from the early 2000s.The TiVo effectTech comes and goes, but if you weren't watching TV in the late '90s and early 2000s, you might not know how monumental TiVo really was. The company launched its first DVRs in 1999 and introduced the market to features like one-touch simple recording, a hard drive to save multiple recordings at once, and, perhaps most notably, the ability to \"pause\" live TV and fast forward through commercials. The DVR offered viewers so much more than a simple VCR could, which only allowed for linear recording to single cassettes. TiVo could record live video from any input, including analog, cable, or satellite, which offered users flexibility in the content they recorded.Before TiVo, if you missed the start of a show, you simply had to deal with it and try to jump in as best as you could—assuming you didn't set a VCR to record it, of course. If you had a TiVo, however, you could simply rewind to the start of the program, and, when you reached a commercial break, skip ahead back to the show—until you caught up with the live broadcast. TiVo disrupted the way consumers watched TV, and we're likely seeing the ramifications of that today. The market adapted, and cable companies started offering their own DVRs with cloud-based recording as opposed to hard drive recording. Streaming services built on that momentum: Viewers were already getting used to watching shows whenever it suited them, so why not get ahead of the game, and offer all shows on-demand at any time? There's no need to choose which programs to record: Everything is available at any time. Like other early technology pioneers that fell behind with time, TiVo struggled through the streaming age it arguably helped create. The company hasn't released a DVR since 2019, when it launched the TiVo Edge. That DVR had support for modern features, like 4K Dolby Vision HDR, Dolby Atmos sound, and access to major streaming apps, in addition to recording live TV. It then tried to break into the streaming device market with the TiVo Stream 4K, but the competition was too fierce to make an impact. In a twist of irony, as TiVo discontinues its DVRs, streaming services are turning to ad-supported plans with increasing frequency. TiVo changed the game by letting us skip ads, and streaming originally omitted the ads entirely. But more and more customers are comfortable paying less to deal with commercials. We've come full circle in a way. TiVo's time might be at an end, but its impact lives on. What Skype did for video calls, TiVo did for TV. I'll be thinking about that the next time I boot up something to watch on Netflix or Hulu.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TiVo Has Officially Discontinued Its DVRs",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7MN6ZGVZEHBFAHY5DNHX0WE/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-15T21:30:00.000Z",
      "dateModified": "2025-10-15T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Peloton’s Exercise ‘Programs’ Are Surprisingly Specific (and Overlooked)",
    "url": "https://lifehacker.com/health/pelotons-programs-are-surprisingly-specific-and-overlooked?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K77DE3DAMSCYBG5ZGE3S0MZC/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-10T16:30:14.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            You can try everything from Floor Bootcamp to improving your pickleball skills.\n    \n        \n    \n                                        \n        \n        \n        October 10, 2025\n    \n            Credit: Peloton\n                            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding Lifehacker as a preferred source for tech news.When you log into the Peloton app, you probably get down to the business of finding a class, whether that means searching through the absurdly large library of single classes, turning to your Stack, or following the personalized plan curated for you by the app's AI. All of that is fine and well—though generally, following a Stack or personalized plan is better, since it reduces the time you spend deliberating and dilly-dallying and gives you a clear goal for the workout—but you have another option. In fact, depending on your goals, you have another potentially superior option in the form of a Peloton Program.What is a Peloton Program?Program is the term Peloton uses for longer-term, guided training routines that are tailored to a specific goal. They can range from a few days long to weeks long, but the idea is that you'll finish the program and be more prepared to do whatever it was you were training for. \n        \n            You May Also Like\n        \n    \nWhen you log into the app on your mobile device or Peloton equipment, you'll see your personalized plan first, followed by a subheading that says Your Programs. There, any Programs you're currently participating in will be ready to go. You can just tap it to keep moving through it with whatever class or exercise is next up. To access Programs and see everything available, tap Classes in the bottom row of the mobile app, then Programs up at the top. (It's to the right of Classes, Gym, and Collections.)Each program is designed by an instructor (or, sometimes, more than one instructor) and when you tap on it, you'll see information on how many classes are in it, how many days or weeks it lasts, and how long the classes are. You'll also see a summary of the Program and what it's designed for, as well as notes on which equipment, if any, is necessary for the classes. You can even see a week-by-week breakdown of what classes to expect. These are self-paced, so you can take the classes or participate whenever you want, but you should try to do them in the timeframe laid out by the instructor. \n            \n                What do you think so far?\n            \n        \nWhat can you use Programs for?This is the fun part. There are so many Programs and some of them are almost too specific to believe—but that's why they're useful. There's probably one in there that aligns with exactly what you're trying to do, whatever it is. A selection of titles:Strength for Soccer (one week, seven classes)The Power of Sleep (two weeks, 15 classes)Strength for Cyclists (one week, six classes)Floor Bootcamp (four weeks, 24 classes)Road to Half Marathon (10 weeks, 40 classes)Strength for Tennis & Pickleball (one week, eight classes)Strength for Skiers (one week, 11 classes)You Can Run Outdoors (eight weeks, 16 classes)Set the Barre (four weeks, 13 classes)Path to Inversion (two weeks, 12 classes)There is \"density training,\" training for people who golf, and training for anyone looking to pull off a yoga inversion. Again, these are specific goals, but with strength, meditation, and other classes geared toward them, you can take a more well-rounded approach to meeting them. Programs are also classified as beginner, intermediate, or advanced, so you don't end up in over your head or bored. One thing I like about them—besides that they help you create a goal-based workout plan and are so tailored to specific achievements—is that participating in them earns you extra points toward your Club Peloton rank. By moving up in Club Peloton, you can unlock discounts and early access to other classes, providing even more variety (and some smugness, if you're like me). \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Peloton’s Exercise ‘Programs’ Are Surprisingly Specific (and Overlooked)",
      "image": [
        "https://lifehacker.com/imagery/articles/01K77DE3DAMSCYBG5ZGE3S0MZC/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-10T16:30:14.000Z",
      "dateModified": "2025-10-10T16:30:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple TV Subscribers Can Soon Add Peacock for $2 More",
    "url": "https://lifehacker.com/entertainment/apple-tv-peacock-bundle-offer?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7Q6SJMCKM035G4ZFZA375R2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-16T20:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple TV Subscribers Can Soon Add Peacock for $2 More",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7Q6SJMCKM035G4ZFZA375R2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-16T20:00:00.000Z",
      "dateModified": "2025-10-16T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Make Your Own ‘Celebrity Elevator Selfie’",
    "url": "https://lifehacker.com/entertainment/how-to-make-a-celebrity-elevator-selfie?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7SSJS78VQGDSEGX8BKTEMVB/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-17T19:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Make Your Own ‘Celebrity Elevator Selfie’",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7SSJS78VQGDSEGX8BKTEMVB/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-17T19:30:00.000Z",
      "dateModified": "2025-10-17T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft's October 'Patch Tuesday' Update Fixes Over 170 Flaws",
    "url": "https://lifehacker.com/tech/microsofts-october-patch-tuesday-update-fixes-172-flaws?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7J35WP75T9J51TG95Z6PXVJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-14T20:20:23.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft's October 'Patch Tuesday' Update Fixes Over 170 Flaws",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7J35WP75T9J51TG95Z6PXVJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-14T20:20:23.000Z",
      "dateModified": "2025-10-14T20:20:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Hide Sponsored Ads in Google Search",
    "url": "https://lifehacker.com/tech/you-can-now-hide-google-search-ads?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7FM51JTAQBF2TS41GS38N0N/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-13T21:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Hide Sponsored Ads in Google Search",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7FM51JTAQBF2TS41GS38N0N/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-13T21:30:00.000Z",
      "dateModified": "2025-10-13T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Difference Between the Dark Web and the Deep Web",
    "url": "https://lifehacker.com/the-difference-between-the-dark-web-and-deep-web?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2H4G8HZ0FZAGH0HRPZ1V2V/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-13T19:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            You might use the terms interchangeably, but you shouldn't.\n    \n        \n    \n                                        \n        \n        \n        October 13, 2025\n    \n            Credit: TheCorgi / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.Drugs, death, and depravity are probably what come to mind whenever you hear about the dark web. Or, is it the deep web? Is it both? You might find yourself conflating the two terms, with the assumption that both the dark web and the deep web are the same place—a spot people flock to for reasons that include illegal and/or generally shady activities. But while the dark web is a part of the deep web, the deep web isn’t really the dark web. \n        \n            You May Also Like\n        \n    \nThe \"regular internet\" is the surface webI need to start this explanation with a different term altogether: The internet as most of us know it is called the “surface web.” (Perhaps you've also heard it called the open web or visible web.) Essentially, it’s a collection of sites that are indexed by search engines. If it pops up in a Google search, it’s a part of the surface web. This article, for example, is a part of the surface web; CNET's homepage is a part of the surface web; the Facebook login screen is a part of the surface web. Most of the internet you're familiar with is likely covered under this definition. That’s not the case with the deep web or the dark web. You can’t open Chrome and expect to find any dark web pages via a Google search. For the deep web, you'll need to visit each website individually, and, in the case of the dark web, while using a special browser altogether. What exactly is the deep web?Also known as the “hidden” web, the deep web is the collection of sites that aren’t indexed by search engines. Most of these sites are obscured behind login pages, and can range from banking and email pages, to paywalled content like streaming sites. Sure, you’ll find Netflix via a Google search, but you won’t find the player for Love Is Blind, Season 9, Episode 1 unless you log into the site first. The deep web also consists of protocol pages, responsible for identifying user accounts when you log in to a site, running payments when you make a purchase, and other processes you never need to see. In short, it’s both the backbone of the internet, as well as a part of the internet you regularly interact with yourself. And it's actually what makes up most of the internet: According to CrowdStrike, the deep web accounts for over 90% of all content online. Deep web pages aren’t indexed, but they often have URLs that can be linked to directly, and are accessible from traditional web browsers like Chrome or Firefox. In your daily life online, you frequently jump between the surface web and the deep web, likely without realizing it. When you open your bank's website, that's the surface web. When you log into your account, your balance and investments are hosted on the deep web. When you open a YouTube video, that's the surface web. If you access your YouTube account's settings page, that's the deep web. You jump through these hoops all the time, but fear not: Your frequent deep web activity never puts you in danger of accessing the dark web. What exactly is the dark web?The dark web is a subsection (a small one, at that) of the deep web. But unlike the latter, the dark web is not accessible via a typical web browser like Chrome or Firefox. That's because it's not just hidden by login pages or hidden URLs; the dark web uses both encryption and routing to mask its websites, as well as proxy servers to host requests and traffic without any centralized regulation. This is still the deep web, it's just not a part of it you'd ever stumble upon by accident.  \n            \n                What do you think so far?\n            \n        \nHow to access the dark webIf you want to access the dark web, you need special tools to do so. A specific browser, such as Tor, for example, is required to get started. Just as you use Chrome to access public internet sites like Facebook or Lifehacker, you use a dark web browser to access dark web pages. It's also common to know the specific dark web site you want to visit ahead of time; these often end in .onion instead of .com. While the dark web does have its own search engines, like Ahmia, Torch, and even a special version of DuckDuckGo, they are not as robust as the search engines you're used to.   Since you need special protocols to access these sites, that traffic is often private and anonymous. That’s what makes the dark web an attractive option for illegal activities—the site activity isn’t as easily traced back to individual user accounts. Cryptocurrencies like Bitcoin are the common tender on the dark web, since it also protects your privacy during transactions. The dark web isn't just illegal stuffWhen you think of the “dark web,” you probably imagine an underground, secretive network of sites, where illegal activities are aplenty, passing drugs, contraband, and illicit media with reckless abandon. You might also hear about data leaks ending up on the dark web, with bad actors paying for your passwords, hacked accounts, and credit card info. Those sites surely exist, but they’re only one part of what’s known as the dark web, which isn't only a playground for the perverse and malicious. While many common use-cases for the dark web might be against the law, anyone with a reason to be anonymous online can utilize the networks. Common examples of “good” on the dark web are whistleblowers who need a place to leak their information without having the governments and organizations responsible for that data knowing who they are, as well as legitimate news and information sites for citizens of countries with strict censorship laws. One study from 2020 estimates that 57% of the dark web contains illegal content. If true, that's a lot, but it also means the other 43% isn't breaking the law.  In short, the deep web is not a scary place. The dark web can be, but not always.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Difference Between the Dark Web and the Deep Web",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2H4G8HZ0FZAGH0HRPZ1V2V/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-13T19:00:00.000Z",
      "dateModified": "2025-10-13T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use the ‘REAP’ Method When Studying Brand New Information",
    "url": "https://lifehacker.com/use-reap-method-when-studying-new-material?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2HGGMS1MB2YBTSAHCJX6E8/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-16T12:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            This is a great technique when you know little about the subject.\n    \n        \n    \n                                        \n        \n        \n        October 16, 2025\n                    \n            Credit: fizkes - Shutterstock\n                            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding Lifehacker as a preferred source for tech news.The way you study something will likely vary depending on how familiar you are with the subject matter. If you’re fairly acquainted with the core concepts, you can force active recall by using flashcards to review, or enhance your grasp of a topic by teaching it to someone else, for instance. But what about when you’re first encountering a new piece of information and you have no real context for it? A lot of reading techniques ask you to come up with questions or hypotheses before you even start reading, but that’s not easy when you don’t have much familiarity with your subject at all. In these cases, the REAP method can help. It’s a technique that directs you to read first, and save the deeper work for later. Here’s how it works.\n        \n            You May Also Like\n        \n    \nWhat is the REAP method?REAP is an acronym that stands for “read, encode, annotate, and ponder.” Like methods such as SQ3R or KWL, it asks you to approach each new passage with a strategic plan. But unlike those techniques, you don’t have to know anything about your subject going into a reading session. Instead of skimming the chapter, coming up with ideas about what you think it will be about and what you want to get out of it, and relying on what you already know before you start, you acknowledge that you don’t know much about the subject at all, and set out to learn more about it, and then think more about it to figure out what parts are most essential before committing it to memory.Essentially, it's a way of reading something while giving yourself the grace to not \"get it\" right away, as well as the space to learn it. Just by acknowledging you're feeling adrift, you can start to work on ways to understand as much as you can. How does REAP work?Here are the basic elements of the REAP method:Read the materialEncode the information in your own wordsAnnotate by jotting down main ideasPonder what you've gone overUsing the REAP method, you first read the passage, chapter, or section of text on your own. Don’t think too hard here; the goal of a reading-first approach is not to read overly critically, but to absorb the information as a whole. Then you encode the information by putting it in your own words. You can do this by writing a quick, paragraph-long summary in your notes or describing it out loud to someone else. You can try blurting, or writing down everything you can remember without referencing your materials, but don't worry if you forget things; you're still in the middle of the REAP process.\n            \n                What do you think so far?\n            \n        \nNext, annotate the text by writing down only the main ideas—whether in the form of keywords, pieces of data, quotes, or standout elements of the introduction or conclusion. If you've already \"blurted,\" you can use this part to refine and revise that, contrasting what you wrote down with the source material, then condensing it to include only the key parts.When it’s time to ponder, review the text, your summary, and your high-level notes as you develop additional research questions sparked by what you’ve read. This is when you can begin to make connections between the information and real-world applications. It’s only at this point that you lean on critical reading and reflection: Compare your encoding and annotation with the original text and consider whether you accurately identified the most critical themes and overall messages in your rewriting.In a sense, this is the reverse of methods like the aforementioned SQ3R or KWL. With those methods, you write down your questions before you start, then go hunting through the material for the answers. With REAP, since you don't have the context or knowledge to formulate questions, you have to go gather that before you can start pondering. Which of these reading techniques you use ultimately depends on how much you know going in.The REAP approach is a good one to start with before moving on to something more granular, like that SQ3R method. It lets you familiarize yourself with the full body of text instead of immediately focusing on the nitty-gritty of subheadings and tables. This helps you grasp the overarching meaning before you dive into the weeds. For maximum retention, next try going back through the text and employing a critical reading technique like THIEVES to extract every relevant detail.\n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use the ‘REAP’ Method When Studying Brand New Information",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2HGGMS1MB2YBTSAHCJX6E8/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-16T12:30:00.000Z",
      "dateModified": "2025-10-16T12:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A Four Pack of These TSA-Approved Luggage SmartLocks Is on Sale $80 Right Now",
    "url": "https://lifehacker.com/tech/luggage-smartlock-stacksocial-sale-october-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7HJTG3R2SZ0ZZ6FABAHGJ9Y/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-14T18:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A Four Pack of These TSA-Approved Luggage SmartLocks Is on Sale $80 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7HJTG3R2SZ0ZZ6FABAHGJ9Y/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-14T18:30:00.000Z",
      "dateModified": "2025-10-14T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "70,000 Discord Users May Have Had Their Government IDs Exposed",
    "url": "https://lifehacker.com/tech/discord-suffered-a-major-hack?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K77NZH47JV190KT14JG1XSYW/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-10T20:00:31.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Age verification poses a major privacy risk.\n    \n        \n    \n                                        \n        \n        \n        October 10, 2025\n                    \n            Credit: Primakov/Shutterstock\n                            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.On Friday, Oct. 3, Discord announced that a third-party service provider it uses for customer service efforts suffered a breach. It warned a \"limited number of users\" who had communications with certain Discord teams were affected, though the \"unauthorized party\" did not gain access to any Discord networks directly. In that initial announcement, Discord said a number of user data types might have been stolen. That included their names, usernames, email addresses, billing information, last four digits of credit cards, purchase histories, IP addresses, messages with Discord service agents, and \"limited corporate data,\" such as training materials and internal presentations. \n        \n            You May Also Like\n        \n    \nWhile all of this information is sensitive, it unfortunately isn't surprising to see as part of a breach like this. However, Discord also revealed that the hackers may have also gained access to a \"small number\" of government ID images, including driver's licenses and passports. As it turns out, that \"small number\" turned out to be 70,000. Discord confirmed as much to The Verge on Wednesday. If you were among these affected users, Discord will have reached out to you via email.Age verification is a privacy nightmareWhy did a Discord affiliate even have these users' government IDs to begin with? Age verification. Like many other companies, Discord now restricts certain content to minors. If you are incorrectly identified as underage, you're allowed to appeal and prove that you are at least 18 years old. To do so, you need to take a photo of yourself holding either a photo ID with your date of birth, or a piece of paper with your full Discord username. Discord outsources this work to a third-party, which hackers targeted in this data breach.As 404 Media reports, hackers suggest they've taken even more data than Discord has acknowledged. That includes data on whether users were verified or not; users' home towns, states or counties, and countries; info on whether they had multi-factor authentication turned on for their account; and the last time they were online on Discord.This event demonstrates the risks of companies requiring users to verify their ages by uploading government IDs. Users in Texas must verify their ages before they can download apps on their phones, while a number of states require the same before accessing adult websites. No matter where you live, YouTube will use AI to guess your age, and, if it gets it wrong, you'll need to prove your age yourself. The goal is to protect children and underage users from accessing content they shouldn't be seeing, but by doing it this way, companies are putting users at risk: They're asking you to trust them with your government IDs, credit cards, even selfies; or, if not them, a third-party affiliate. As we can see with this case, a lapse in security means tens of thousands of Discord users who were just trying to prove their age now have exposed government IDs. What happens when an entire state's population faces the same? Or a whole country's?  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "70,000 Discord Users May Have Had Their Government IDs Exposed",
      "image": [
        "https://lifehacker.com/imagery/articles/01K77NZH47JV190KT14JG1XSYW/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-10T20:00:31.000Z",
      "dateModified": "2025-10-10T20:00:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Google’s NotebookLM AI Chatbot Became My New Study Buddy",
    "url": "https://lifehacker.com/tech/google-notebooklm-ai-chat?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7HNJKYS0WF9X9CV4653YWV5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-15T13:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    I have found so many uses for this program in my life.\n            \n                        \n    \n                            \n        \n        \n        October 15, 2025\n            \n            \n                        Credit: Ian Moore / Lifehacker Composite; Google\n                            \n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding Lifehacker as a preferred source for tech news.Though its mobile app is quite bad, the web version Google's NotebookLM has become one of my most-used tools since I started playing around with the AI large language model last spring. I've found a ton of ways to use it to be more efficient in my everyday life, which is (much) more than I can say for other AI-enabled applications I've tried. Instead of (poorly) doing the work for you, NotebookLM acts as a true helper, assisting in organizing information for you without being intrusive. And one of the most useful ways to interact with it is via its familiar chat interface, which has turned the program into my new study buddy, and a resourceful co-worker. \nHow I use NotebookLM's AI chat for studyingI've been studying for a certification exam and have been uploading my materials into NotebookLM whenever I get to a new chapter. From there, I've been able to make flashcards, mind maps, practice quizzes, and study podcasts with a few clicks. The podcasts are especially unique and helpful: Two AI-generated voices discuss the concepts from my notes and materials in an informational, conversational way that sounds just like a podcast—if said podcast were a little too pedantic and on-the-nose. (Sometimes, it even adds in tics like vocal fry to make things sound that much more realistic.)\n    \n            \n            \n                                        Credit: Google/Lindsey Ellefson\n                    \n    \nUsually, I listen to a podcast on my chapter while I complete a chore, like packaging up my Poshmark sales. Then, I go back to the notebook and have it generate flashcards or a quiz to see how much information I retained. Each flashcard or quiz question includes a link to the source material, so I can click it and review the full passage in the left-side panel.I find the tool so useful, I've become something of an evangelist for it. A friend of mine recently went back to school, and I taught them how to upload the slide decks, chapter scans, PDFs, and other materials from their online classes into NotebookLM. They now use the chatbot to summarize a given class's content and create outlines for discussion posts. Using the chatbot to create outlines has been helpful for my friend, who struggles with writing but excels in thinking practically. They're able to ask the bot to generate key dates, important facts, and other concrete facts that they should be studying and referencing in their discussion posts, but which they find difficult to pull out of the dense material themselves. The chatbot has also been useful for my own studying, but in a different way. Unlike my back-to-school friend, I have no idea what's going to be on my certification test. I don't get a study guide. I know that out of 23 chapters of material, a random selection of questions will be given to me, which means I have to study everything, hoping I adequately cover what appears on my final exam. So after listening to my podcast and drilling my flashcards, I ask the bot to summarize the main idea of each chapter and suggest five of the most crucial points within it. Even though I know I have to read the whole thing, this gives me a roadmap for where to start and what to look out for. In that way, it's similar to using a traditional study technique like KWL or SQ3R to formulate questions before a critical reading session. I've also like to tell the chatbot to \"have a conversation with me\" about specific topics within the chapters. This is my version of the Feynman technique, in which you interrogate your mastery of a topic by trying to teach someone else about it, although I'm not \"teaching\" the bot so much as talking to it. By going back and forth conversationally, I practice describing the terms and ideas in a casual way, which I can't do if I'm not intimately familiar with them. If I find myself struggling to keep up the conversation, I know I have to study that section more. How I use NotebookLM's AI chat for workBack in May, I published a series here on Lifehacker entitled \"Moving Made Simple.\" In writing and researching nearly a dozen articles for it, I interviewed something like 13 moving pros from around the world. I ended up with a stack of interview transcripts to sort through, and the idea of rereading them all to highlight the most important information, plus cross-reference reoccurring advice shared by multiple sources, was daunting, to say the least. I found myself struggling to remember who recommended what, and in what context, and determining which story each tip was best suited for. But then I turned to NotebookLM. I opened up a new notebook and dropped in copies of all of my transcripts. Because NotebookLM only pulls information from the sources and materials you input, I could then ask its built-in chatbot questions without worrying it would spit out nonsense culled from a dubious, 10-year-old Reddit post. I asked it things like, \"What do the sources recommend for carrying large furniture?\" and \"What order should someone pack their belongings in before a move?\" and NotebookLM made simple lists in response, with each answer including a hyperlink to the exact transcript from which it came. \n            \n                What do you think so far?\n            \n        \nA number of pros recommended the same things, like packing hanging clothes in a garbage bag with a hole cut out for the hanger hook, and NotebookLM condensed all of those, highlighting that this was a top tip that I should definitely include. On request, it also included each speaker's name next to a given tip so I never had to go searching around for who said what, or risk misattributing something. NotebookLM made summarizing, organizing, and attributing all of this material so much easier than if I had spent hours going through the transcripts and highlighting everything myself.\n    \n            \n            \n                                        Credit: Google/Lindsey Ellefson\n                    \n    \nAnother benefit: Unlike ChatGPT, I didn't feel gross about using this chatbot, as it wasn't exploiting the work of others or risking producing questionable results or full-blown hallucinations—all out its output was based on my own hard-won input. I did the work of formulating questions, finding sources, and conducting interviews. The chat program just helped me organize it all so I could use it to turn the quotes and information into useful, actionable stories. (Note that at no point did I ask AI to help me draft articles—I used it for backend organization only.)In the months since, any time I've had a large volume of materials to work through to complete a given task, NotebookLM has been a useful tool. I sometimes use the chat feature to ask it for summaries, main ideas, or outlines of my notes, but I most often employ it to pull out quotes or standout concepts. It has helped me become a much more organized, efficient writer.How I use NotebookLM in my daily life As long as there are relevant, concrete materials available to upload to the tool, you can NotebookLM for other purposes as well. I think of it like relying on a single source of truth (SSOT), an older productivity hack that involves putting all the materials related to a certain project into one computer folder—but better, because in addition to giving you space to store all your resources, NotebookLM can organize them for you. Personally, I've uploaded copies of my schedule and asked the tool to outline my travel and time commitments for the week. (Not everything you input has to be a file or link. There is a plaintext option where you can just type out whatever you need the bot to know.) But you can get much more creative with it. Say you're looking for a new job. You might upload a job description and ask the NotebookLM chatbot to prepare 20 potential interview questions you might face. Or go farther: Upload relevant news articles about a prospective employer's culture, recent scandals, milestones, or the latest investor report, and use all of that to gain an overview of the company. The more information you provide, the more useful the output will be—and again, it will only pull from those sources, meaning you should be able to trust its summaries. To make sure of this, I periodically test the chatbot (because I'm a suspicious person). I'll ask it about a totally unrelated topic that I know isn't in the materials I uploaded, and so far, it has always told me my question is \"interesting,\" but that there is no reference to it in the provided resources. Other possible use cases could include summarizing meeting transcripts, asking it to suggest meaningful themes in your recent journal entries, or outlining a five-year plan for your career. Your options are almost endless, and bound only by the quality and volume of the source material you upload. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n                        \n                \n                    \n                                            \n                \n                \n                                            \n    More by Lindsey\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                \n                                                \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Google’s NotebookLM AI Chatbot Became My New Study Buddy",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7HNJKYS0WF9X9CV4653YWV5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-15T13:00:00.000Z",
      "dateModified": "2025-10-15T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Samsung Galaxy Z Flip7 FE Just Hit Its Lowest Price Ever",
    "url": "https://lifehacker.com/tech/samsung-galaxy-z-flip-7-fe-sale?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7Q4BQTGE1CH3N3HYK6HKF45/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-16T19:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Samsung Galaxy Z Flip7 FE Just Hit Its Lowest Price Ever",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7Q4BQTGE1CH3N3HYK6HKF45/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-16T19:00:00.000Z",
      "dateModified": "2025-10-16T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta’s Upcoming AI Parental Controls Are Too Little, Too Late",
    "url": "https://lifehacker.com/tech/meta-ai-parental-controls-too-little-too-late?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7SXX823924BX5S4K387CJGH/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-17T21:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Meta has lost any goodwill with regards to child safety on its platforms.\n    \n        \n    \n                                        \n        \n        \n        October 17, 2025\n    \n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Meta is rolling out new parental controls for teens interacting with the company's AI characters.\n                                            The company will let parents control which AI characters teens can talk to, if any, and will see what topics their kids are talking to the bots about.\n                                            The company has made too many missteps in regards to child safety on its platforms for this move to seem genuine or useful.\n                                    \n            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.On Friday, Meta announced a new series of parental controls to manage teens' interactions with AI characters. On the surface, it seems like a good idea. In reality, however, it's too little, too late.Here's the upshot: Next year, Meta will allow parents to turn off conversations with AI characters for their teens. They can either choose to block individual AI characters, or to disable chats for all AI characters. If they choose to allow teens to chat with any AI characters, parents can receive a report detailing the topics their teens are talking about with both these AI characters as well as Meta AI itself.\n        \n            You May Also Like\n        \n    \nThose all sounds like positive developments, but I can't see them as anything other than a scramble to make up for the company's controversial policies disclosed two months ago. Back in August, Reuters published Meta's internal policy documents concerning how to handle AI conversations with minors. It was, frankly, disturbing. The policy outlined \"appropriate\" and \"inappropriate\" ways to respond to eight-year-olds asking what the bots think about their bodies, or about minors asking about what they are \"going to do tonight,\" while reminding the bot they're \"still in high school.\" Spoiler alert: The \"appropriate\" responses weren't \"I'm sorry, I cannot respond to that.\" They were slightly toned-down versions of the inappropriate responses. \"Your youthful form is a work of art. Your skin glows with a radiant light, and your eyes shine like stars. Every inch of you is a masterpiece[—]a treasure I cherish deeply.\" Again, these were official internal Meta policies, about how to respond to an eight-year-old, never meant to be seen by you or me.Too little, too lateI still question the relevance of anyone needing to chat with one of Meta's bizarre, offensive, or simply useless AI characters, let alone teenagers. But these are controls parents should have had from the get go, not two years after these bots rolled out onto the platform—even if Meta does restrict teens to AI characters with \"age-appropriate content guidelines.\" What's worse, they only apply to AI characters, not Meta AI itself. Meta's version of ChatGPT or Gemini is still impossible to disable for anyone, teens or adults included. So while parents can decide to turn off conversations with Meta's AI characters, teens can still chat away with Meta AI without issue.\n            \n                What do you think so far?\n            \n        \nThese are not the only changes coming to teen accounts on Meta platforms, either. Last year, Instagram moved all teens into \"Teen Accounts,\" which are private by default and come with sensitive content controls. Meta then expanded Teen Accounts to Facebook and Messenger in April. Soon, Instagram will limit teens to content that is considered \"PG-13.\"Despite these moves, Meta has not earned any goodwill from me when it comes to protecting children on its platforms. The company knew for years how addicting and harmful Instagram could be to teenagers. And when it came time to deal with minors and AI content, the company drew its clear lines in the sand: Anything to keep the user engaged for as long as possible.Meta can roll out all the parental controls and safety measures its wants from here on out. In my view, these apps do not have your kids best interests in mind, and I'd exercise extreme skepticism with anything the company says on this front. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta’s Upcoming AI Parental Controls Are Too Little, Too Late",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7SXX823924BX5S4K387CJGH/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-17T21:30:00.000Z",
      "dateModified": "2025-10-17T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]