[
  {
    "title": "Check This iPhone Setting to Make Texting Better for Everyone",
    "url": "https://lifehacker.com/tech/check-this-iphone-setting-to-make-texting-better-for-everyone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEWDA68BYW5KT04J8C7XHEHA/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-13T21:00:28.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: enesdigital / Shutterstock.com\n                            \n    Table ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: enesdigital / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Hey, would you mind doing me a favor real quick? If you're on an iPhone, can you double check that you've got RCS chat enabled for me? Thanks, I appreciate it. See, as an Android user, I don't get to use all the fun iMessage features, but RCS lets us share some of them. The only problem is, iPhones seem to sometimes disable RCS for some chats after an update. Or for no reason at all.RCS has been around for a while, but since it needs to be supported on both the carrier and device level, it's taken some time to reach ubiquity. Understandably, you might have seen some chat conversations between iOS and Android users that still default to the older SMS-style texting, and just gone about your day. However, these days, if you're chatting with your Android friends and you don't see read receipts, or your pictures and videos are coming through in potato quality, there's probably an easy fix.To check if RCS is enabled on your phone:\nOpen the Settings app on your iOS device, then go to Apps.Go to Messages > RCS MessagingEnable the RCS Messaging toggle.And that's it! If you text your contacts from multiple devices, it's also worth checking for RCS support on each of them. It might be a little annoying, but trust me, your Android friends will thank you.\n            \n                What do you think so far?\n            \n        \nIf you're the one using an Android phone, it can also be worth double-checking that RCS support is enabled, although it's less likely to be a problem. While iOS devices support both iMessage and RCS as robust texting options, Android only has RCS. Both platforms can fall back to SMS, but your Android phone probably reaches for RCS as a default. Still, it can't hurt to check. The specific directions will differ based on manufacturer, but generally you can go to your default messaging app's settings and look for an \"RCS Chats\" section to make sure the protocol is enabled on your end as well.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Check This iPhone Setting to Make Texting Better for Everyone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEWDA68BYW5KT04J8C7XHEHA/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-13T21:00:28.000Z",
      "dateModified": "2026-01-13T21:00:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Visible Is Also Offering a Credit for This Week's Verizon Outage",
    "url": "https://lifehacker.com/tech/visible-is-also-offering-a-credit-for-the-verizon-outage?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF43JBJEEHSP9GRZDR2V79V7/hero-image.fill.size_1200x675.webp",
    "tag": "Life",
    "date": "2026-01-16T20:10:38.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle Ehrhardt is Lifehacker's Associate Tech Editor. She has a bachelor's degree in history from Earlham College, where she also double majored in theatre. She also holds an MFA in game design from NYU. Michelle's career as a journalist began at Out Magazine, where she covered games, music, film, and politics with an eye towards the LGBT perspective.Michelle is a member of the New York Video Games Critics Circle, where she sits on the Game Journalism Award committee. She has participated in panels and workshops at New York's DreamYard Program and has hosted both the Tom's Hardware Show and the Gadgettes podcast.Her work has been featured in outlets including Paste, The Atlantic, Tom's Hardware, Gizmodo, and The Advocate. Some of her favorite pieces include her annual CES recaps, her video game reviews, and her interviews with hardware makers and independent video game developers.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Sarah Tew/CNET\n                            \n            \n                Key Takeaways\n                                            Verizon's low cost spin-off carrier, Visible, is offering its users a credit to make up for the outage on Wednesday.\n                                            Users will be able to apply this credit while paying their next bill.\n                                            The payout is smaller than Verizon's, but represents a similar value when compared to Visible's smaller bills.\n                                    \n            \n    Table of Contents\n    \n        \n        After Verizon's unexpected nationwide outage Wednesday, the carrier came out yesterday to try to save face, saying it was offering a $20 credit to all accounts in the myVerizon app. Now, its low-cost offshoot carrier, Visible, is also trying to make its own amends.As spotted by 9to5Google, Visible is texting its customers with the following message, promising a $5 credit on their next bill as an apology for the outage:Yesterday we let you down and for that we are sorry. We are giving you a $5 credit towards your next month of service that can be redeemed after Jan 16 when paying with a credit card online. This credit isn’t meant to make up for what happened. But it’s a way of acknowledging your time and showing that this matters to us. If you’re still having trouble connecting, please restart your device (power down and power back on).The amount may be smaller, but it does seem to be a bit more convenient to claim, since it sounds like you can apply it while paying your bill (although I can't make any promises for people using auto pay). Like Verizon's offer, it also doesn't seem to be discriminating between those affected by the outage and those who weren't, as noted by a user on Reddit.\nSome comments from other Visible subscribers on Reddit did point out that they had yet to receive the text, although I'm assuming that's due to a slow rollout more than anything else, as textless users who reached out to customer service were able to confirm they were offered the $5 credit as well. I've reached out to Visible to confirm if the $5 credit applies to everyone, and will update this post when I hear back (I also asked if it would be applied to automatic payments).As for why the payment is so much smaller, it's probably due to the difference in cost between Verizon and Visible. Verizon said it based its $20 payout on the price for \"multiple days of service,\" and frankly, those same days cost much less on Visible.\n            \n                What do you think so far?\n            \n        \nWhile Visible uses the same network as Verizon, it sets itself apart by giving its users lower priority while connecting, which lets it offer unlimited plans starting at $20/month. Prices range to $33/month, but essentially, $5 goes a lot further on the low cost network, meaning it represents a similar value to $20 for a proper Verizon plan.Whether that's a fair price for an unexpected day of spotty connectivity, I'll leave up to you.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Visible Is Also Offering a Credit for This Week's Verizon Outage",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF43JBJEEHSP9GRZDR2V79V7/hero-image.fill.size_1200x675.webp"
      ],
      "datePublished": "2026-01-16T20:10:38.000Z",
      "dateModified": "2026-01-16T20:10:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "We Now Know What Caused the Verizon Outage",
    "url": "https://lifehacker.com/tech/we-now-know-what-caused-the-verizon-outage?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF1RXB8A4970TPAPWE5MHCC1/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-15T21:55:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 15, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: RAMAN SHAUNIA/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Verizon has finally confirmed what caused yesterday's nationwide outage.\n                                            The company shared a statement with Mashable, confirming the outage stemmed from a software issue.\n                                            Verizon specified the outage was not caused by a cyberattack.\n                                    \n            \n    Table of Contents\n    \n        \n        By now, you've no doubt heard about (or experienced yourself) yesterday's massive Verizon outage. For nearly all of Wednesday, roughly two million Verizon customers could not connect to the network, and had to rely on wifi to use their smartphones, which were otherwise stuck in SOS mode. Sure, they could call 911, but they couldn't do much else. It was an ordeal, one Verizon is literally paying for: The company committed to issuing $20 account credits to affected customers. It might not be as much as some of us think the company should offer, but it's something. And if the $20 isn't a comfort, the fact that the outage is over should be—even if you needed to restart your phone this morning to implement the fix.The weirdest part of the whole affair was that Verizon didn't initially offer any details about what caused the outage. The company posted throughout yesterday, issuing updates and responding to angry customers, but never shedding light on why their network was down for so many customers. Finally, a day and a half after the outages kicked off, the company has an answer, albeit a partial one. \nA software issue caused the Verizon outage, not a cyber attackAccording to a statement Verizon sent to our sister site Mashable, the cause of the outage was simply a problem with the company's software. \"This was a software issue and we are conducting a full review of what happened,\" the company said. \"As of now, there is no indication that this was a cyber security issue.\" That last bit is important, as some customers took the outage as evidence of some type of cyber attack. While those worries seem to be unfounded, considering the current state of the world, I understand those fears. \n            \n                What do you think so far?\n            \n        \nStill, while it's nice to have some sort of explanation, I could do with more details. This wasn't a minor, temporary outage affecting only a limited number of users; customers across the country couldn't connect to Verizon for most of the day. Software issues happen, but they usually don't take down one of the three major carriers in the United States. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We Now Know What Caused the Verizon Outage",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF1RXB8A4970TPAPWE5MHCC1/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-15T21:55:00.000Z",
      "dateModified": "2026-01-15T21:55:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spotify Is Raising Prices Yet Again",
    "url": "https://lifehacker.com/entertainment/spotify-is-raising-prices-again?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF1528KXYVYE2NFHBF575YW5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-15T16:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle Ehrhardt is Lifehacker's Associate Tech Editor. She has a bachelor's degree in history from Earlham College, where she also double majored in theatre. She also holds an MFA in game design from NYU. Michelle's career as a journalist began at Out Magazine, where she covered games, music, film, and politics with an eye towards the LGBT perspective.Michelle is a member of the New York Video Games Critics Circle, where she sits on the Game Journalism Award committee. She has participated in panels and workshops at New York's DreamYard Program and has hosted both the Tom's Hardware Show and the Gadgettes podcast.Her work has been featured in outlets including Paste, The Atlantic, Tom's Hardware, Gizmodo, and The Advocate. Some of her favorite pieces include her annual CES recaps, her video game reviews, and her interviews with hardware makers and independent video game developers.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 15, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Diego Thomazini/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Spotify is raising its U.S. subscription cost by $1 to $2, depending on your plan.\n                                            The price hike follows previous price increases in 2023 and 2024.\n                                            If you can find one near you, a Spotify gift card can help you snag a discounted annual rate.\n                                    \n            \n    Table of Contents\n    \n        \n        If you're subscribed to Spotify, start checking your inbox. The music streaming service is sending emails to customers letting them know about yet another price hike coming next month.To Spotify's credit, the price hike is pretty minor. But starting on whatever your February billing date is, individual premium plans will jump from $11.99/month to $12.99/month, while student plans will go from $5.99/month to $6.99/month. More extensive plans will see a slightly more costly jump. The Duo plan, which gives premium access to two people at the same address, is going from $16.99/month to $18.99/month. The Family plan, which gives premium access to up to six people at the same address, will also see a $2 increase, now costing $21.99/month rather than $19.99/month.\nThe price hikes are set to affect the U.S., Estonia, and Latvia, according to Spotify's announcement. The company's rationale for all this? According to the post, \"occasional updates to pricing across our markets reflect the value that Spotify delivers.\"Truthfully, $1 to $2 does seem like a pretty minor change, but the update follows another U.S. price hike in 2024, where Individual plans went up by $1, Duo plans went up by $2, and Family plans went up by $3. And that came after a price hike in 2023, where the Individual, Student, and Family plans went up by $1, while the Duo plan went up by $2. Certain subscribers outside of the U.S. also saw their own price increases in 2025. I can't help but feel like a frog in a slowly boiling pot.\n            \n                What do you think so far?\n            \n        \nThe continual barrage of price hikes is a bit of a disappointment for subscribers who had gotten used to a steady price for Spotify since its U.S. launch in 2011, as the service went for 12 years before its first price change. If all these price hikes are starting to get to you, you might be able to get around them. If you can find one at a store near you, you can pay upfront for a discounted annual subscription using a Spotify gift card, although it won't apply to Spotify's Family or Student plans. Unfortunately, Spotify does not have an annual subscription plan available on its website.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spotify Is Raising Prices Yet Again",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF1528KXYVYE2NFHBF575YW5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-15T16:30:00.000Z",
      "dateModified": "2026-01-15T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Betterment Users Are Being Targeted in This Crypto Scam",
    "url": "https://lifehacker.com/money/betterment-users-are-being-targeted-in-this-crypto-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEX03B4475XYZ4N8PBFZWHRA/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-14T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            Customers of automated investment platform Betterment are being targeted with a cryptocurrency rewards scam.\n                                            Threat actors gained access to a third-party system and sent emails to some users from a legitimate Betterment subdomain.\n                                            Login credentials weren't compromised, but you should be wary of any communication about your Betterment account.\n                                    \n            \n    Table of Contents\n    \n        \n        Customers of automated investment platform Betterment are being targeted with a cryptocurrency rewards scam following a data breach that allowed threat actors to obtain some user data and send fake emails promising huge returns on Bitcoin and Ethereum deposits. According to a Jan. 12 security update posted on Betterment's website (and sent to users via email), hackers gained unauthorized access on Jan. 9 to a third-party platform used for marketing and operations. Following the breach, they sent fraudulent messages to some customers with offers to triple crypto investments. The scam emails were sent to Betterment users on Jan. 9, soon after the data breach, with subject lines like \"We'll triple your crypto!\" The message inside claimed that Betterment was \"giving back\" for a limited time and tripling Bitcoin and Ethereum deposits as large as $750,000 to specified wallets. Threat actors tried to create a sense of urgency with an expiration deadline for the promotion (a typical scam tactic). \nThe messages came from [email protected], which is a legitimate Betterment subdomain, allowing them to appear verified in users' inboxes. Note that this is the same email address Betterment used to send the security update to all of its customers. A nearly identical crypto scheme targeted Grubhub users in December with emails—also sent from a real Grubhub subdomain—promoting a 10x return on $1,000 in deposited bitcoin. \n            \n                What do you think so far?\n            \n        \nBetterment data hackedCybercriminals were able to steal some customer information from the compromised system, including names, email addresses, mailing addresses, phone numbers, and dates of birth. Betterment has said that no passwords or credentials were included in the breach, nor did threat actors gain access to user accounts. While few official details have been published, the company is reportedly being extorted as the target of the distributed denial-of-service (DDoS) attack. If you're a Betterment customer, be wary of any unsolicited communication in the coming days and weeks about your account. Scammers will use events like this as a phishing opportunity. Know that Betterment (and other legitimate companies) will not request your password or other personal information via email, text, or phone call. If you are concerned about your account or want to update your credentials or other data, go directly to the website or app and do so there—this is generally safer than clicking links in communication, even if messages from Betterment are (or seem) legitimate. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Betterment Users Are Being Targeted in This Crypto Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEX03B4475XYZ4N8PBFZWHRA/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-14T14:00:00.000Z",
      "dateModified": "2026-01-14T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft's Latest Patch Tuesday Fixes 114 Vulnerabilities",
    "url": "https://lifehacker.com/tech/microsoft-patch-tuesday-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEWSRKZ2BAFKD483MGAJ5048/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-14T13:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: ACHPF/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Microsoft's Patch Tuesday update for January addresses 114 vulnerabilities in total, including three zero-days.\n                                            Eight of the vulnerabilities are labeled as \"critical.\"\n                                            Ensure your Windows machine has updated and installed these security fixes.\n                                    \n            \n    Table of Contents\n    \n        \n        Microsoft has released its \"Patch Tuesday\" update for January, and you should ensure your computer receives these security fixes as soon as possible. This update addresses 114 vulnerabilities in total, including three zero-days (bugs that have been actively exploited or publicly disclosed before an official fix is available from the developer). As reported by BleepingComputer, security flaws were found across the following categories: 57 elevation-of-privilege vulnerabilities, three security feature bypass vulnerabilities, 22 remote code-execution vulnerabilities, 22 information disclosure vulnerabilities, two denial of service vulnerabilities, and five spoofing vulnerabilities. Six of the remote code execution vulnerabilities and two of the elevation of privilege vulnerabilities are considered \"critical.\" Your machine should receive security updates automatically when Patch Tuesday drops, which is around 10 am PT on the second Tuesday of the month. You can check to confirm by going to Start > Settings > Windows Update and selecting Check for Windows updates\nThree zero-days patched in JanuaryOne of the three zero-days fixed this month has been actively exploited in the wild. The flaw, labeled CVE-2026-20805, is an information disclosure vulnerability in the Desktop Windows Manager that allows attackers access to memory addresses from a remote ALPC port. Microsoft Threat Intelligence Center (MSTIC) & Microsoft Security Response Center (MSRC) have been credited with identifying this bug. \n            \n                What do you think so far?\n            \n        \nThe other two zero-days have been publicly disclosed. CVE-2026-21265 is a security bypass feature vulnerability that allows threat actors to bypass Secure Boot on systems that have not updated certificates issued in 2011 and nearing expiration. CVE-2023-31096 is an elevation of privilege vulnerability in third-party Agere Soft Modem drivers that ship with supported Windows operating systems installed. Microsoft has removed these drivers from Windows. Microsoft released other non-security updates today, as well as additional patches for Microsoft Edge and Mariner vulnerabilities earlier this month.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft's Latest Patch Tuesday Fixes 114 Vulnerabilities",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEWSRKZ2BAFKD483MGAJ5048/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-14T13:30:00.000Z",
      "dateModified": "2026-01-14T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Find Free Movies (Legally) With WikiFlix, a Database of Films in the Public Domain",
    "url": "https://lifehacker.com/tech/find-free-movies-legally-with-wikiflix-a-database-of-films-in-the-public?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEVNNV3VH06MZKWV4DHKQWP5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-13T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Lifehacker\n                            \n    Table of Contents\n    \n        \n        I love movies, and especially when I can watch them for free: And while streaming the latest Hollywood blockbusters might come at a price (at least for those wanting to stay on the right side of the law), there's an ever-growing collection of older films that you can get at online without paying a dime.The site WikiFlix (as spotted by the fine folks at Gizmodo) lists movies available to stream that are now in the public domain. The way that copyright works in the U.S. basically means that copyright expires on films after a period of 95 years—so with every year that passes, a batch of new flicks become available to view by anyone, free of charge.If you're looking for something classic for your next movie night, it's well worth a look. \n\n    \n            \n            There are plenty of categories to choose from.\n                                        Credit: Lifehacker\n                    \n    \nWikiFlix is straightforward to use, right from the homepage. It tracks films added to sites such as Wikimedia Commons, YouTube, and the Internet Archive, and whenever you click through on a movie, you can also see where it has come from. When you've made your pick, it streams right in your browser window.The home page is split up into categories that you can browse through—including female directions, animations, and biographical films, the last time I checked—and there's also a search button up in the top right corner if you know what you're looking for. Next to the search button is an account button, which enables you to sign up for a MediaWiki account if you want to be able to contribute to the site too.Hover over the main WikiFlix heading at the top of the page and a quick link to Movies by year pops up. This is a useful way of finding the most recent flicks added to WikiFlix, and digging back into the archive—not all of the movies here are in the public domain because their copyright has expired, and you will find more recent titles too.Click through on any thumbnail to get more information about each movie. You can typically get information on the director, cast, and running time, and a plot summary is included too. Some of the entries come with trailers (although you can also search for these separately on sites like YouTube).\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            Each movie comes with a cast list.\n                                        Credit: Lifehacker\n                    \n    \nStart streaming a movie, and the usual playback controls appear, though the interface does depend to some extent on the site that's hosting the movie. For films hosted on YouTube, for example, you can typically adjust the playback quality and speed. Some movies come with subtitles too.Obviously a site like this is going to skew towards older, classic movies, but there's plenty to explore here: Metropolis, It's a Wonderful Life, All Quiet on the Western Front, Nosferatu, Charlie Chaplin comedy The Gold Rush, and lots more.Free movie repositories aren't quite as rare online as you might think. We've written before about the best free and legal streaming services for movies and TV, featuring ad-supported streaming platforms such as Tubi and PlutoTV. Again, the emphasis is on older films, but there's a huge amount on offer at no charge.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Find Free Movies (Legally) With WikiFlix, a Database of Films in the Public Domain",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEVNNV3VH06MZKWV4DHKQWP5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-13T14:00:00.000Z",
      "dateModified": "2026-01-13T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Don't Need to Worry About That Security Email From Instagram",
    "url": "https://lifehacker.com/tech/that-instagram-password-reset-email-is-a-bug?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KESFZZPK3D2HPDSVK6FWJS5W/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-12T18:00:08.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Primakov / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Many Instagram users have received unsolicited password reset emails in recent days.\n                                            Following some claims of a major data breach, Meta has said that the issue has been resolved, and no user information has been compromised.\n                                            Still, you should ensure your Instagram account is secured with 2FA.\n                                    \n            \n    Table of Contents\n    \n        \n        If you received an unsolicited password reset email from Instagram in recent days, you don't need to panic. These messages don't appear to be the result of a new data breach or account compromise, but rather a bug that Meta claims it has now fixed. Following a wave of suspicious account recovery requests, antivirus software provider Malwarebytes posted a warning on Jan. 9 that threat actors had stolen personal information from 17.5 million Instagram accounts. As BleepingComputer reports, there have been various claims that hackers have obtained Instagram account data from multiple API scraping incidents in the last several years but notes that there haven't been any confirmed incidents nor definitive proof of a new breach. Meta has said the issue was the result of a bug that allowed threat actors to request password reset emails, which it has since patched, and denies that user data has actually been compromised. Of course, data breaches aren't uncommon, and Meta platforms have been targeted in the past. So you should still practice good digital hygiene and stay vigilant to phishing attempts that could indicate account compromise. \nHow to keep your Instagram account secureIf you do receive an Instagram password reset email that you didn't request, you don't need to do anything with it. You can just ignore and delete the message. In general, you should avoid clicking links in security-related messages that seem urgent or sound scary (again, if you didn't initiate account recovery) as these can be phishing attempts designed to steal your credentials or other sensitive information. If you do want to change a password or update other security details for any account, you should go directly to the website or app and do so there. \n            \n                What do you think so far?\n            \n        \nIf you haven't already, you can (and should) enable two-factor authentication (2FA) for Instagram. On the mobile app, open the Menu from your profile page and go to Accounts Center > Password and security > Two-factor authentication. You can choose to receive login codes via authentication app (like Google Authenticator or Duo), SMS, or WhatsApp. As I've written, not all 2FA methods are created equal: SMS codes are especially easily phished, so an authentication app is probably your best option here. Finally, you can check for suspicious devices logged into your Instagram account under Accounts Center > Password and security > Where you're logged in. If you see any devices you don't recognize, select it and tap Log out. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Don't Need to Worry About That Security Email From Instagram",
      "image": [
        "https://lifehacker.com/imagery/articles/01KESFZZPK3D2HPDSVK6FWJS5W/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-12T18:00:08.000Z",
      "dateModified": "2026-01-12T18:00:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Delete 'Bloatware' From Your Android (and Why You Should)",
    "url": "https://lifehacker.com/tech/delete-bloatware-from-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEHZX6P8BKAS9C0QZX82B0DT/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-09T19:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: rblfmr / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Any new phone almost certainly comes with a handful of preinstalled apps you'll never use, regardless of which manufacturer you buy from or which operating system you're on. Some devices are more bloated than others: Google Pixels have a relatively \"clean\" build compared to Samsung phones, for example, and don't typically come with third-party apps and games. But you may still want to eliminate apps and features that clutter your home screen, take up valuable space, and create a drag on performance, especially if you have alternatives you like more. On Android, that likely means uninstalling what you easily can and disabling everything else. What you can (and can't) uninstall on AndroidUnfortunately, many preinstalled first-party apps can't be easily removed. This varies by manufacturer and device—for example, Pixel users can uninstall Google Play Games and Books but are stuck with Chrome, Drive, Maps, and Calculator. As HowToGeek points out, you can delete other pre-selected Google apps added during initial setup, such as the Pixel Watch app and NotebookLM. \nOn Samsung Galaxy phones, again, some preinstalled bloatware is locked in, but ZDNET calls out five native apps that most users should delete right away: Global Goals, Samsung Free, Samsung TV Plus, Samsung Shop, and Samsung Kids. To uninstall an app on your Pixel, go to the Google Play Store and tap the Profile icon. Tap Manage apps & devices > Manage, select the app you want to remove, and tap Uninstall. On Samsung, go to Settings > Apps, tap the app name, and tap Uninstall > OK. You can also touch and hold the app icon on your home screen and tap or drag to uninstall. \n            \n                What do you think so far?\n            \n        \nIf you're absolutely set on removing preinstalled apps that can't be deleted using the above steps, you can use the Android Debug Bridge (ADB), but these methods are more advanced. How to disable preinstalled appsBuilt-in apps that aren't in use can be disabled, which hides the icon from your app drawer. They'll still take up space, but at least they'll be out of sight. Most preinstalled apps can be disabled if you don't need them, with the exception of critical system apps. On your Pixel, go to Settings > Apps > See all apps to select individual apps, and tap Disable at the top of the screen. You can hide preinstalled Samsung apps from your home screen settings: tap Hide apps and tap the icon of the apps you want to disable, the press Done. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Delete 'Bloatware' From Your Android (and Why You Should)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEHZX6P8BKAS9C0QZX82B0DT/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-09T19:30:00.000Z",
      "dateModified": "2026-01-09T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Samsung Odyssey G5 Gaming Monitor Is $250 Right Now",
    "url": "https://lifehacker.com/tech/samsung-odyssey-g5-gaming-monitor-deal-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF461RB4HFMPAPS5F53CHACB/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-16T22:30:05.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        The Samsung Odyssey line is designed for gamers who want a blend of speed and immersion, and its consistently popular monitors are known for high refresh rates, low-input lag, and crisp visuals that perform more smoothly in a fast-paced world than a standard display. The 32\" Samsung Odyssey G50D S27DG50 is a flat, entry-level alternative to some of the line’s pricier curved monitors, and right now, it’s 42% off at $249.99 (down from $429.99).\nThe 27-inch, 1440p display has wide viewing angles and is ideal for those who want ample screen space without stepping up to an ultra-wide monitor. It has a 180Hz max refresh rate and consistently low input lag, as well as FreeSync and G-SYNC VRR support to minimize screen tearing. That said, some reviews mention low contrast and a poor dimming system with blacks that can look gray in very dark rooms. While response time is fast, there can be a bit of motion blur that occurs with fast-moving objects, which is to be expected with this price range. \n            \n                What do you think so far?\n            \n        \nThough the G5 is marketed primarily as a gaming monitor, it’s also versatile for everyday use thanks to its great color accuracy, effective glare reduction in well-lit rooms, and strong ergonomic adjustments. If you’re looking for a budget-friendly QHD gaming system with a high refresh rate, reliable brightness, and wide viewing angles, the 32\" Samsung Odyssey G50D S27DG50 monitor performs well and offers good value at $249.99. However, if you want a more feature-rich option or a monitor with deeper contrast and stronger HDR, it may be worth stepping up to a higher-end model from the Odyssey line, such as the Odyssey G9—but it will cost you significantly more. \n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Samsung Odyssey G5 Gaming Monitor Is $250 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF461RB4HFMPAPS5F53CHACB/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-16T22:30:05.000Z",
      "dateModified": "2026-01-16T22:30:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Everyone Can Now Use the 'Live' Status on Bluesky, and I Couldn't Be Happier",
    "url": "https://lifehacker.com/tech/live-now-twitch-statuses-on-bluesky?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF48YH8P81EPSNS3C0ZVKY39/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-16T22:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jordan Calhoun\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jordan Calhoun\n                            \n        \n            Jordan Calhoun\n                \n                                            Editor in Chief\n                                    \n            \n            \n        \n            ExperienceJordan Calhoun is the Editor in Chief of Lifehacker and author of Piccolo Is Black: A Memoir of Race, Religion, and Pop Culture. He’s been featured in places like The New York Times, Kotaku, The Root, and The AV Club, and his writing has been published in places like Men’s Health, The Atlantic, and Vulture.Jordan served in the Peace Corps and holds a B.A. in Sociology and Criminal Justice, B.S. in Psychology, and an M.P.A. in Public Policy. He lives in New York City.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Bluesky\n                            \n    Table of Contents\n    \n        \n        The user-generated video industry is worth over $4 billion, reflecting how tastes have evolved away from reading articles and watching television punditry and toward scrolling vertical video feeds and watching live streams. As a reader, a writer, and the editor of an article-driven tech site, the rise of user-generated video and streaming can be a tough reality to accept. But as a longtime fan of live streaming, a part of me is thrilled to see the media landscape begin to take it more seriously. For example: On Jan. 16, Bluesky announced the rollout of a feature that more seamlessly connects its users to live streams—a feature that may catch on more broadly. The latest Bluesky update, v1.114, allows streamers to display their \"Live Now\" status directly on the social network, a feature previously launched to beta testers back in May 2025. Now widely available, the feature makes it easier to connect to social audiences across platforms: Users can click a Bluesky profile's \"Live Now\" status and be directed straight to that profile's associated Twitch stream. (The feature currently works only with Twitch, but is expected to expand to other live streaming platforms soon.)\n    Other social apps punish links — we think linking out should be easy. Live Now is part of how we're making that happen. \nWhile in beta, Live Now is currently limited to Twitch links. Support for other streaming platforms may follow as we learn from the beta.— Bluesky (@bsky.app) January 15, 2026 at 2:00 PM\n\n\"Live Now\" arrives just as Bluesky saw an increase in users this week, following a major X outage and scrutiny of the platform's ongoing deepfake porn problem. Regardless of what it could mean for Bluesky's overall growth, I'm optimistic about any pro-discovery feature that can be adopted more broadly. I can imagine a future where more sites refer its users to live streaming platforms. Consider a Gmail avatar letting me know when a YouTuber is online, a Spotify artist page pointing me to a musician's stream, or an article byline pointing me to a live video on Substack. I hope that the bridge between my social feed and live streams continues to get shorter.\nHow to enable the \"Live Now\" badge on BlueskyTo turn on the \"Live Now\" badge on your Bluesky avatar, click the three-dot menu on the top-right of your profile page on desktop or mobile. From the list of options, choose the  \"Go Live\" option and paste a link to your Twitch profile page. The duration of your temporary \"Live\" badge is customizable, ranging from 5 minutes to 4 hours. Choose your preferred duration, and click \"Go Live.\"\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Jordan Calhoun / Lifehacker\n                    \n    \n\n    \n            \n            \n                                        Credit: Jordan Calhoun / Lifehacker\n                    \n    \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Everyone Can Now Use the 'Live' Status on Bluesky, and I Couldn't Be Happier",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF48YH8P81EPSNS3C0ZVKY39/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-16T22:30:00.000Z",
      "dateModified": "2026-01-16T22:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here's How Much Money Verizon Will Credit You for Its Service Outage",
    "url": "https://lifehacker.com/tech/verizon-outage-credit-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF13P7TH56B63VDVTYB9SVH4/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-16T14:27:16.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Mino Surkala/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Verizon is issuing accounts credits of $20 to customers affected by a major outage.\n                                            Verizon says the number represents multiple days of service, and that no credit can make up for what happened.\n                                            If you qualify, you can claim your credit on the myVerizon app.\n                                    \n            \n    Table of Contents\n    \n        \n        Earlier this week, your phone might have been borderline unusable—at least, when you were away from wifi. That was due to Verizon's nationwide outage, which affected roughly two million customers across the United States. If you were among them, you couldn't use your phone on the go, which is sort of the idea behind cellphones in general. This included the ability to use navigation apps in your car, send work emails or messages, or make calls outside of SOS mode, which basically limited you to emergency services. Worse, some users are still experiencing issues this morning following Verizon's official resolution, though there's likely a quick fix for that.I don't have Verizon, but if I did, I'd be a bit ticked off. Outages happen, but this one was massive, and the company still hasn't offered much of an explanation for what actually happened. In spite of this (or perhaps because of it), the company seems keen to smooth the whole thing over. When Verizon announced it had resolved the outage, it also said it would reach out to affected customers directly to issue account credits. It's a pain to deal with interruptions to services as important as your wireless network, but at least Verizon wants to compensate you for the problem, right? Just don't expect much.Verizon's account credits might seem a bit lowVerizon made a post on X, once again apologizing for the outage and revealing what each affected account can expect to receive as compensation: $20. \n\n    \n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \n\nVerizon says this number represents \"multiple days of service\" on average, and that no credit can make up for what happened. That might be true, but in my humble opinion, a larger credit could perhaps get a bit closer. Maybe this is greater than the on-paper dollar value of losing a day of service, but it's not like customers think of their bills as paying for their usage. They pay Verizon quite a bit, expecting that their smartphones to be connected at all times within Verizon's coverage map. Considering the upheaval a day of disconnection no doubt caused, I'm not sure $20 is going to cut it.\n            \n                What do you think so far?\n            \n        \nBut I digress: $20 is the number, and $20 is what affected customers can expect to receive. If you're among them, Verizon says they will text you when the credit is available. When it is, you can log into the myVerizon app to claim your recompense.        \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's How Much Money Verizon Will Credit You for Its Service Outage",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF13P7TH56B63VDVTYB9SVH4/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-16T14:27:16.000Z",
      "dateModified": "2026-01-16T14:27:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Android 16 Makes Split Screen Easier on Smaller Screens",
    "url": "https://lifehacker.com/tech/androids-16-makes-split-screen-easier-on-smaller-screens?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF2T47H78X04P1P9DDKJEE9Z/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-16T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    \n        \n        Stock Android added the concept of App Pairs back in Android 15. You choose two apps to use in split screen mode, add a shortcut to the paired apps to the home screen, and it's now trivially easy to trigger split screen multitasking (instead of having to perform multiple tap and drag gestures).It sounds neat, but I never really used it, because on my small Pixel 9a, using apps in 50:50 split-screen mode is hardly user-friendly. There's just not enough room on the screen for each app to take up half of it and still be usable. But that changed with Android 16, thanks to a small update to how split screen works.In Android 16, the split screen ratios for app pairs are much more flexible. You can have two apps in 70:30, or even 90:10. And once you get used to the idea of 90:10 split screen multitasking, things really start to flow.\nFor example, I have an app pair for my Chrome and Gemini apps. Chrome for browsing, and Gemini for research. \n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nChrome is usually my maximized app, taking up 90% of my screen space, while Gemini is docked at the bottom, minimized. But with one tap, Gemini comes to the front and Chrome takes a back seat. And I can keep switching between the two just as easily. This is much faster than using Android's multitasking menu.\n            \n                What do you think so far?\n            \n        \nHow to set up App Pairs with 90:10 split screen multitaskingTo set up an App Pair and try this out for yourself, you'll first need to create a split screen pair. Open the two apps that you want to pair, and then go to the multitasking view (swipe up from the Home bar and hold for a second). Tap the name of the first app you want to open and choose the Split screen option. Then choose another app to pair it with. You'll now enter a 50:50 split screen view. Grab the handle in between the two apps and drag it all the way up or all the way down to trigger the 90:10 split. Alternatively, you can also set up a 70:30 split by leaving some extra space on your second app.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nNow, go back to the multitasking view, tap on one of the app names, and choose the Save app pair option.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nAfter that, you'll find the app pair as a shortcut on your home screen. Tap on it to launch your pre-configured app combo. And yes, it does remember your last used split screen ratio, saving you some valuable setup time. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Android 16 Makes Split Screen Easier on Smaller Screens",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF2T47H78X04P1P9DDKJEE9Z/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-16T15:00:00.000Z",
      "dateModified": "2026-01-16T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Protect Your Credit Cards From 'Web Skimming' Scams",
    "url": "https://lifehacker.com/money/how-to-protect-your-credit-cards-from-web-skimming-scams?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF1KKB3K7ZPSR71AE99FZV1F/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-16T15:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Table of Contents\n    \n        \n        You have probably heard of skimming, a type of fraud in which criminals install physical devices capable of capturing your payment card details on ATMs, gas pumps, and point-of-sale terminals. If you enter your debit or credit card into one of these fake card readers, your data is stored for later download or transmitted wirelessly in real time to a device controlled by scammers, who will use the information to steal from your accounts. Unfortunately, online shoppers aren't immune from this scheme. Web skimming is a type of cyberattack that uses malicious code to steal card data during checkout, and researchers have identified an ongoing campaign targeting major payment providers and, by extension, consumers. Online credit card skimmingWeb skimming attacks, broadly referred to as \"Magecart\" campaigns, are initiated when malicious JavaScript is injected into e-commerce websites and payment portals. When a checkout page loads, the skimmer replaces it with a spoofed form that collects card numbers, expiry dates, card verification codes, and billing or shipping addresses—everything threat actors need to turn around and use your card for fraudulent purchases. \nThe fake payment forms use legitimate-looking branding and styling to minimize suspicion. Once payment details are transmitted to the attacker, the user gets an error message and is redirected to the real checkout page, a flow designed to make you believe that you've simply entered your information incorrectly. Web skimmers are typically designed to avoid detection and may even self-destruct, making them difficult to identify even for site admins. They also utilize bulletproof hosting, which shields cyber actors from takedown requests and law enforcement action. \n            \n                What do you think so far?\n            \n        \nHow to protect your payment cardUnfortunately, consumers can't do much about the presence of web skimmers, but they can play defense against them. Red flags of an online shopping scam are also red flags for skimming—for example, deals and discounts that are too good to be true are indicators of a possible fraudulent vendor or malicious site, where you may be more likely to have your card details stolen. Shopping with reputable vendors will reduce (though not entirely eliminate) the risk. You should also be vigilant about any unusual steps during checkout, such as redirects or error messages, and abandon any suspicious transactions. If you suspect that your payment details may have been stolen, keep an eye on your bank and credit card statements for unauthorized activity, and enable transaction alerts for real-time updates. Remember that credit cards offer more security protections than debit cards. You could also use virtual cards for online purchases, which allows you to keep your actual card details private and protect you from further fraud. (Note, however, that virtual cards have some drawbacks. For example, you may lose some protections offered by your primary card provider and have a tougher time obtaining refunds.)\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Protect Your Credit Cards From 'Web Skimming' Scams",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF1KKB3K7ZPSR71AE99FZV1F/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-16T15:30:00.000Z",
      "dateModified": "2026-01-16T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scammers Are Impersonating LinkedIn",
    "url": "https://lifehacker.com/money/scammers-are-impersonating-linkedin-with-this-phishing-scheme?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEZ2PB6CK2RBVR8RWYGAW717/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-15T18:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 15, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Bangla press / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Scammers are using LinkedIn branding in official-looking \"reply\" comments to spread phishing links intended to harvest users' login credentials.\n                                            f you click through the link, you'll land on a phishing page that uses LinkedIn branding and requests your login.\n                                            The real LinkedIn won't send communication about account or policy violations in a public manner.\n                                    \n            \n    Table of Contents\n    \n        \n        If you receive a warning on a LinkedIn post that your account has been restricted, don't engage with it. Scammers are using LinkedIn branding in official-looking \"reply\" comments to spread phishing links intended to harvest users' login credentials.  As reported by BleepingComputer, this impersonation campaign relies on fake company pages and LinkedIn's official link shortener to trick users into \"verifying\" their identities on a domain run by threat actors. Here's what to look for.Scammers are replying to posts on LinkedIn with messages claiming that users have in some way violated the platform's policies. The comments include a link, which users are urged to click to prevent their accounts from being further restricted or suspended. \nIn some cases, the link's preview text states \"We take steps to protect your account when we detect signs of potential unauthorized access. This may include logins from unfamiliar locations or...\" which may convince users to overlook the link itself, which clearly does not lead to a page on a valid LinkedIn domain. In others, the scammers have further masked the phishing site using LinkedIn's official URL shortener, lnkd.in, which is even less likely to raise suspicion, especially if the link preview doesn't generate on certain devices. If you click through the link, you'll land on a phishing page that uses LinkedIn branding and contains more information about the supposed account restriction with a button to \"Verify your identity.\" That leads to another page that closely spoofs LinkedIn's standard sign-in interface and is designed to steal your credentials. \n            \n                What do you think so far?\n            \n        \nThe reply comments themselves utilize LinkedIn's logo and branding and are connected to company pages with variations on the platform's name—\"Linked Very,\" for example. These are obviously fake at first glance, as they don't have any of the robust content (such as posts, employees, or followers) you'd expect from the real LinkedIn. But users could feasibly follow the phishing link without further investigation into the commenter.  As always, any urgent message or comment about your account security or status, no matter how official-sounding, should raise red flags. A second look at these replies make it clear that they are not from the real LinkedIn, which won't send communication about account or policy violations in a public manner nor urge you to click links in comments or private messages. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scammers Are Impersonating LinkedIn",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEZ2PB6CK2RBVR8RWYGAW717/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-15T18:30:00.000Z",
      "dateModified": "2026-01-15T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]