[
  {
    "title": "10 Hacks Every Smart TV Owner Should Know",
    "url": "https://lifehacker.com/tech/hacks-every-smart-tv-owner-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFC9X77313438VK2EKKE03CT/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-27T18:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    Make your picture look better, reduce buffering, and keep your apps running smoothly.\n            \n                        \n    \n                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        January 27, 2026\n            \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        Whether you're a smart TV veteran or are somehow just now setting your first TV with an internet connection, there's a lot to learn. Modern TVs are basically computers, complete with their own operating systems and application ecosystems. That means you can tweak them to run better.—or just the way you want them to. Here are a few tips, tricks, and hacks that every smart TV owner should be aware of.Turn off motion smoothing on your smart TVWondering why every single TV show and movie you watch on your brand new TV looks like a soap opera or a cheap community theater production? It's probably because of motion smoothing.This \"feature\", which is the default on far too many TVs, artificially ups the frame rate from either 24 or 30 frames per second to 60 or 120 frames, or even higher. This effect can bring a real immediacy to live events like sports, but it's not great for regular old TV shows. Because where does the TV get those extra frames from? It makes them up, often creating an uncanny blurring effect reminiscent of old school videotape. I recommend turning this feature off basically the minute you set up your TV, and our friends at PCMag have a guide to disabling the feature covering all the major smart TV platforms.Hook up an ethernet cable to make your smart TV faster Streaming 4k takes up a lot of bandwidth. Modern wifi routers can usually handle without much of an issue, especially if your TV is close to your router. Even so, it's a good idea to physically connect your smart TV to your network with an ethernet cable if you have the option.There's a couple of reasons to do this. One, wired connections are more stable, mostly because they're not vulnerable to interference from neighboring wireless networks and other devices, so you'll be far less like to suffer through stuttering images or audio dropouts. Two, connecting your TV via ethernet frees up the wireless spectrum for all of your other devices, which is important if you live in a house with other internet users (not to mention other smart devices).Customize your smart TV's home screenSmart TVs tend to come pre-loaded with any number of apps, all of them prominently placed on the home screen. You can, and should, move the apps you actually use to the top instead. How to do this will vary depending on your operating system, but it generally means pressing and holding on the app you want was at the top of the list and then moving it around. Failing that, you may need to do some digging in the settings.Block ads on your smart TVTired of all the ads showing up on your TV? You might be able to block them using your router. Lifehacker has a guide to blocking ads on Samsung, LG, and Roku smart TVs that explains how to change your internet settings so that your TV can't access the ads in the interface anymore.Disable quick start to save energy and speed up your smart TVSmart TVs are basically computers, meaning they need to boot up when you turn them on. Most users don't want to wait every time they turn on the TV though, which is why smart TVs don't actually turn off—they suspend their functions, the same way your phone or laptop does. That's fine if you use your TV constantly, but a real waste of electricity for a TV that you only turn on occasionally. And shutting down your set completely could have another benefit: reducing bugginess. To reiterate, a smart TV is basically a computer, and every computer user knows that restarting your computer can fix random problems.Some TVs allow you to disable this feature—just look for a \"quick start\" option in the settings. Others, including Sony, suggest that you unplug TVs you won't be using for months at a time in order to shut them down completely.\n            \n                What do you think so far?\n            \n        \nUse an antenna to get free channelsStreaming television is great, but don't overlook traditional broadcast TV. Most major cultural events, from the Super Bowl, to the Oscars, to the World Series, are still free to watch on network TV, as are of the most popular shows. If you live in a major city, or even just close to one, there's a good chance you can watch network TV free of charge using nothing more than a small TV antenna. This can mean free access to stations like NBC, CBS, ABC, FOX, and PBS—no need to pay for cable or a pricey \"live tv\" streaming subscription. All you need to do is plug in an antenna, scan for channels, and you're good to go. (Lifehacker has a guide to the best digital TV antennas to help you get started.)Clear your smart TV's cacheNot to keep harping on this point, but a smart TV is a computer, and like a computer, it can build up all sorts of junk in its memory over time. If your smart TV is suddenly moving more slowly than you remember, or even crashing, it might be time to clear out its various caches. Get started with this guide to clearing the cache on every major smart TV brand.Enable security features on your smart TVYour smart TV is a potential security risk. It's a computer, like any other, and that means you need to keep it up to date, secure all accounts connected to it, and be mindful of any built-in microphones and cameras. Check out our guide to securing your smart TV for more on these tips and more.Disable \"automatic content recognition\" to stop your smart TV from spying on youI've written about why smart TVs are so cheap, and it turns out a big part of it is automatic content recognition, or ACR. Most brands of smart TVs are constantly monitoring what you're watching and using that to build a profile with your viewing habits that can be sold to third parties, a practice that nets the TV manufacturers are lot of money. If this concerns you, consider turning the feature off to protect your privacy. Lifehacker has a guide to disabling ACR on the major smart TV platforms.Install a different launcher for your smart TVIf you want your smart TV to have an entirely different look and feel, you may be able to install a different launcher, which will give you much more control. Google TV users, for example, can install Projectivy to completely replace the default launcher. This won't be an option for every model of smart TV, but it's worth considering if you're feeling stuck with the software that came preinstalled.\n            \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n                        \n                \n            \n                    \n                                            \n                \n            \n                Justin Pot\n                                \n                                            Justin Pot is a freelance journalist who helps people get more out of technology.\n                                    \n                Read Justin's full bio\n                            \n        \n                \n                                            \n    More by Justin\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 Hacks Every Smart TV Owner Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFC9X77313438VK2EKKE03CT/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-27T18:30:00.000Z",
      "dateModified": "2026-01-27T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nine Phone Settings to Change Before Attending a Protest",
    "url": "https://lifehacker.com/tech/phone-security-before-attending-protest?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG7ZG7VRY6P3X9FZV8YSTYA9/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-30T20:00:00.000Z",
    "description": "\n        \n        Before you head out to a protest, take some precautions to protect your privacy and both the physical and digital security of any de",
    "body": "\n        \n        Before you head out to a protest, take some precautions to protect your privacy and both the physical and digital security of any device you bring along. The most secure option, of course, is to leave your phone at home, but you can also lock things down to minimize the risk that your data will be accessible to law enforcement or someone who gets hold of your device. Thankfully, both iOS and Android have built-in device encryption if you're using a passcode, meaning that your device's data cannot be accessed when it is locked. (On Android, go to Settings > Security to ensure Encrypt Disk is enabled). You'll want to maximize this protection with the following privacy settings. Turn off face and fingerprint scanningAt an absolute minimum, you'll want to disable biometric access, such as face and fingerprint authentication, on your device in favor of a passcode or PIN. As the Electronic Frontier Foundation notes, this minimizes the risk of being physically forced to unlock your device and may provide stronger legal protections against compelled decryption. \nOn iOS, go to Settings > Face ID & Passcode and toggle off iPhone Unlock. You can also set up a stronger passcode—a custom numeric or alphanumeric code—under Change Passcode. On Android, you'll find the option to delete your fingerprint in favor of your PIN or screen lock pattern under Settings > Security & Privacy > Device Unlock > Fingerprint.Limit location trackingAgain, the best option to prevent your location from being tracked is to coordinate any details in advance and leave your phone at home. If you must bring it along, keep it off unless you absolutely need to use it. You can turn on Airplane Mode in advance, as well as disable Bluetooth, wifi, and location services, which keeps your device from transmitting your location. However, note that some apps may still be able to store GPS data and transmit it when an internet connection is available—so again, the safest bet is to keep your device off for the duration. Airplane Mode can be enabled (and wifi and Bluetooth disabled) in your device's settings or quick access menu. On Android, go to Settings > Location to disable location services and turn off Location History in your Google account. On iOS, head to Settings > Privacy & Security > Location Services to disable locations entirely. Turn off previews and notificationsTemporarily disable notifications and screen previews so that if someone gets your device, they won't be able to glean any information from your lock screen. You can adjust these options under Settings > Notifications on iOS and Settings > Apps & notifications > Notifications on Android. Adjust screen lock timeMinimize your screen lock time to as short a period as possible so that your screen turns off when you're not actively using it and will require authentication to reopen. On iOS, go to Settings > Display & Brightness > Auto-Lock and select 30 seconds. The exact path on Android may vary, but typically you'll find this under Settings > Display or Lock Screen. Know that most devices have camera access from the lock screen, so you can take photos or record video without actually unlocking your device. Enable app pinning or Guided AccessApp pinning (Android) and Guided Access (iOS) are features that prevent others from navigating through your phone beyond a specific app or screen. This allows you to use an essential feature on your device while locking the rest behind your PIN or passcode. You can enable this preemptively, and if someone grabs your device, they won't be able to snoop around. You can find this setting on Android under Security or Security & location > Advanced > App pinning and on iOS under Settings > Accessibility > Guided Access.\n            \n                What do you think so far?\n            \n        \nUse a SIM PINYou can also lock your SIM card to prevent unauthorized use of your device or SIM card, including access to two-factor authentication codes sent via SMS. This PIN will be required any time your phone restarts or if someone tries to use your SIM card in another device. On iOS, go to Settings > Cellular, select your SIM, and tap SIM PIN. On Android, you'll find this under Settings > Security > More security settings (the exact path varies by device). Sign out of, hide, or delete appsThis step will vary depending on what you keep on your phone and your risk tolerance, but you may want to consider signing out of your social media accounts and deleting apps that contain or allow access to sensitive data. On iOS, you can also lock or hide specific apps: the former requires an extra authentication step to open apps on your home screen, while the latter sends apps to a hidden folder that also requires authentication to unlock. Touch and hold an app icon to bring up the quick actions menu, then tap Require Face ID/Require Passcode.  On Android, you can set up a \"private space\" to lock apps behind your pattern, PIN, or password. Apps are hidden from the launcher and recent views as well as quick search. Go to Settings > Security & privacy > Private space, authenticate with your screen lock, and tap Set up > Got it. If necessary, turn on Lockdown Mode or Advanced ProtectionBoth iOS and Android have strict device-level security modes that significantly limit access to certain app and web features as well as blocking changes to settings. Both were designed with journalists, activists, and other users with access to sensitive data that may be targeted by cyber actors in mind. These settings are overkill for day-to-day use but add a potentially helpful layer of security in high-risk situations. Enable Lockdown Mode on iOS via Settings > Privacy & Security > Lockdown Mode. On Android, turn on Advanced Protection under Settings > Security & privacy > Advanced Protection.Protect your privacy after a protestWhile the above steps are largely about securing your data during a protest, you should also follow best practices for protecting privacy (yours and others') after the fact. If you plan to post photos or videos, utilize blurring tools to block faces and other unique identifying features, and scrub file metadata, which includes information like photo location. You can do this by taking a screenshot of the image to post or sending a copy to yourself in Signal, which automatically strips metadata. Signal also has a photo blurring tool, or you can blur in your device's default photo editing app. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nine Phone Settings to Change Before Attending a Protest",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG7ZG7VRY6P3X9FZV8YSTYA9/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-30T20:00:00.000Z",
      "dateModified": "2026-01-30T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here's Where to Find Your Settlement From the Siri Lawsuit",
    "url": "https://lifehacker.com/tech/heres-where-to-find-your-settlement-from-the-siri-lawsuit?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG07714APPPMCPTYXNJG2WP0/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-27T18:20:07.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 27, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: HakanGider / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            If you filed a claim last year as part of the class action suit against Apple, your payment is on the way.\n                                            Last year, Apple agreed to a $95 million settlement to resolve a class action lawsuit over privacy concerns with Siri-enabled devices.\n                                            Due to the final class size, the payout came to just $8.02 per device up to a maximum of $40.10.\n                                    \n            \n    Table of Contents\n    \n        \n        If you filed a claim last year as part of the Siri class action suit against Apple, your payment is on the way. According to the settlement website, class payment distribution began on Jan. 23, and many users on Reddit report that funds have landed in their bank and payment apps over the last several days. If you see a deposit from \"Lopez Voice Assistant\" or some variation, it's not a scam. The settlement allowed class members to opt for payment via direct deposit (ACH) as well as electronic or paper check, which will be delivered through email or regular mail, respectively. Some class members are reporting that they received their funds via a different method than they expected, so if you submitted a claim, keep an eye on your transactions as well as your mailboxes to confirm receipt. Note that payouts are being distributed in batches and may take a few days to arrive. \nWhat is the Apple Siri settlement? Last year, Apple agreed to a $95 million settlement to resolve a class action lawsuit over privacy concerns with Siri-enabled devices. Users whose devices may have activated and recorded conversations without their knowledge were able to claim compensation. Initially, the settlement was set to pay out $20 per device—iPhone, iPad, Apple Watch, Mac, HomePod, iPod touch, and Apple TV were all eligible—for up to five devices per individual claimant. \n            \n                What do you think so far?\n            \n        \nHowever, due to the final class size, the payout came to just $8.02 per device up to a maximum of $40.10. If you have questions about the settlement and want to speak with an administrator, you can call 888-981-4106 and select option 0 on the main menu. You may have to leave a message and request a callback. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's Where to Find Your Settlement From the Siri Lawsuit",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG07714APPPMCPTYXNJG2WP0/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-27T18:20:07.000Z",
      "dateModified": "2026-01-27T18:20:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "12 Hacks Every Roku User Should Know",
    "url": "https://lifehacker.com/tech/hacks-every-roku-user-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFGGX99JJJD4W78EZ93VERA2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-27T14:00:00.000Z",
    "description": "\n    \n                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n         ",
    "body": "\n    \n                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        January 27, 2026\n            \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        Roku was one of the original names in streaming, and even with so many options now available from Amazon, Apple, Google and others, it remains one of the most popular options thanks to its affordable boxes and streaming sticks and widespread availability as an integrated operating system on some TV sets. The platform is speedy, simple, and supports just about every streaming app out there.If you've got a Roku or two in your life, you may not be using it to its full potential. These tips, hacks, and hidden features should help you go beyond the basic business of launching your streaming apps and get more out of your hardware, whether you've just unboxed your first Roku device, or you've been using one for years.Set up PIN protection to protect your RokuIf you've got young kids or nosy housemates living with you, you can lock certain parts of the Roku experience (including making purchases and adding new channels) behind a PIN number. This is actually done through your Roku account page on the web: Click PIN/parental controls on the left, and you can set a new PIN or change an existing one.Change the look and feel of your Roku with a new themeYou don't have to settle for the standard Roku interface visuals—you can easily switch to a different theme (which basically means a different wallpaper and screensaver). From Settings on your device, choose Themes to see alternatives provided by Roku and other people in the Roku community. You can always pick Restore default theme to go back to the original look.Enable captions on replayYou might not want closed captions on all the time, but you can have them enabled whenever you skip backward. From the home screen, pick Settings > Accessibility > Captions mode > On replay to enable this. Note that the streaming app you're using needs to support the feature as well, so it may not work everywhere.Put your most-watched apps up topThis is a simple and effective one that you might not have got around to doing: You can organize the apps on the home screen so your most-used are nearer the top and easier to get to. Select any tile on the home screen, press the star button on your remote to bring up the context menu, and you'll see the Move app and Move app to top options.Make use of Guest Mode when you have company\n    \n            \n            Roku devices come with a Guest Mode included.\n                                        Credit: Lifehacker\n                    \n    \nIt's great having guests—but don't let them mess up your recommendations and viewing progress. You can put your Roku device into Guest Mode by opening Settings from the main Roku menu, then choosing Guest Mode > Enter Guest Mode. You'll be signed out of all your apps, and the Roku device will restart ready for someone else to use it.Send your photos to your Roku to view them on the big screenYou won't always be watching films and shows on your Roku of course—and when your streaming device isn't doing anything else you can get images from your Google Photos library up on your TV. To set this up, you need to head to the Photostreams page on the Roku website, sign in using your account, and then follow the instructions online.Set up a cross-platform Roku watchlistThere will often be times when you see something interesting, but don't have time to watch it right away, and that's when the Roku watchlist feature can help. Select any movie or show from the home screen, and on the listing page use the Save button to add it to your list: You can then pick Save List from the main menu to see what you've saved.Pair your Bluetooth headphones to your RokuIf you've got a pair of wireless Bluetooth headphones and a Roku device that supports Bluetooth, you can pair the two together for some private audio listening— handy if you don't want to disturb anyone around you. You can do this by heading to Settings from the main Roku menu, then choosing Remotes & devices > Wireless headphones.\n            \n                What do you think so far?\n            \n        \nListen to your Roku via your smartphoneThere's another way to listen through headphones, and it doesn't require Bluetooth or wireless headphones. If you install the aforementioned Roku app on your smartphone, then plug a pair of headphones into your phone as well, you can tap Remote control in the app and then the headphone button to stream the audio right to your ears.\n    \n            \n            You can use the mobile app to listen over headphones.\n                                        Credit: Roku\n                    \n    \nMirror your other devices to your RokuApple devices: Roku sticks, boxes and TVs come with support for the Apple AirPlay standard built right in, so you can beam across audio and video from Apple devices, or even mirror your Mac display on the big screen. On the Roku, choose Settings then Apple AirPlay and HomeKit to make sure you're set up, then just select the AirPlay button on your Apple hardware.Android devices: For screen casting, you're not left out if you're on Android, though—as usual with Android—capabilities vary between devices. Samsung Galaxy phones have the smoothest integration: Swipe down with two fingers from the top of the screen, choose Smart View, and your Roku should show up as a connection option (if it's on the same wifi network).Windows devices: If you want to mirror your screen to a Roku from Windows, the process is different again. First, enable the feature on the Roku via Settings > System > Screen mirroring. Next, from Windows, click the volume and wifi icons down in the lower right corner, click the Display button, then select your Roku. Again, it needs to be on the same wifi network.Quickly find the cheapest way to rent a show or movieIf you're in the mood for a movie rental, then you've got a whole host of different streaming services to choose from—all the big ones offer film rentals on top of the content you get with your subscription. Use the Search option from the main Roku menu to look for a title, and compare the different prices across all the services you're signed up to.Control your TV with your Roku remoteYou can turn your TV on and off and adjust its volume with your Roku remote, if you'd like to. You're asked if you want to do this when you first set up your Roku device, but you can configure it afterwards too: Pick Settings > Remotes & devices > Remotes, then choose the remote you've currently got connected, and then pick Set up remote for TV control.\n            \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n                        \n                \n            \n                    \n                                            \n                \n            \n                David Nield\n                                \n                                            David Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. \n                                    \n                Read David's full bio\n                            \n        \n                \n                                            \n    More by David\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "12 Hacks Every Roku User Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFGGX99JJJD4W78EZ93VERA2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-27T14:00:00.000Z",
      "dateModified": "2026-01-27T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Entry-Level Roborock Robot Vacuum Is 44% Off Right Now",
    "url": "https://lifehacker.com/tech/roborock-q7-l5-robot-vacuum-and-mop-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG88JE6P1TSSP7G184NRN6FQ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-30T21:30:43.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Robot vacuums can get expensive quickly, especially as you move into models with features such as self-emptying bins and hot-water mopping. But if you’re looking to dip your toe into this world without dropping major cash, the Roborock Q7 L5 robot vacuum and mop is a low-stakes entry-level option that checks many boxes, and right now it’s at a record-low 44% off at $139.99 (originally 249.99) on Amazon, according to price-trackers.  \nThe Q7 L5 has 8,000 Pa HyperForce suction (surprisingly powerful for this price point), multiple anti-tangle brushes, LiDAR navigation, and multi-floor mapping. It also has a mopping feature, which is rare at the under-$150 price point; the 270 ml water tank allows the device to vacuum and mop simultaneously. Some reviews also note that the mopping function can leave floors slightly wet, which is something to keep in mind for people with delicate floor surfaces.Like pricier models, you can customize zones, schedules, and suction levels via the Roborock app, but it’s worth noting that this vacuum only supports 2.4 GHz wifi. The dual anti-tangle system is especially appealing for pet owners, and navigation runs smoothly and efficiently with obstacle avoidance, as well as suggesting no-go zones to avoid getting stuck. Compared to more feature-rich mop and vacuum hybrids, the dock on the base is compact and has a water tank and dustbin as a single integrated part in the machine, making it a good choice for people with smaller homes.\n            \n                What do you think so far?\n            \n        \nWhile it doesn’t have the automation bells and whistles of pricier models, for $139.99, it’ll perform most everyday cleaning jobs effectively. If you’re a first-time robot vacuum buyer or have a specific budget and are looking for a robot vacuum to help automate your cleaning sessions, the Roborock Q7 L5 robot vacuum and mop will give you strong value without breaking the bank.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Entry-Level Roborock Robot Vacuum Is 44% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG88JE6P1TSSP7G184NRN6FQ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-30T21:30:43.000Z",
      "dateModified": "2026-01-30T21:30:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Strava Finally Brought Route Navigation to the Apple Watch",
    "url": "https://lifehacker.com/health/strava-route-navigation-apple-watch?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG54P0RKRBZ3CS6N04M2STD7/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-29T16:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            \n        \n            Meredith Dietz\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceMeredith is a marathon runner and stand-up comedian. As Lifehacker’s Senior Staff Writer, she covers personal fitness tech, home gym equipment, and more.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Beth Skwarecki\n                            \n    Table of Contents\n    \n        \n        Big news for runners with an Apple Watch: You can now follow Strava routes directly from your wrist. Route navigation on Strava-compatible watches isn't exactly new technology—it's just been inexplicably absent from Apple's platform until now. In a Reddit post from Strava's product team, the news was welcomed by runners, cyclists, and hikers who've long wondered why their Apple Watch couldn't do what Garmin and Coros devices have offered for years. What's new with Strava's Apple Watch appThe core update here is users can now view maps directly on their Apple Watch during activities, seeing both where they're headed and how to backtrack if they take a wrong turn. For subscribers, saved Routes work hands-free and function offline, eliminating the need to pull out your phone mid-run or mid-ride to check directions.To access routes directly on your watch, press the Route icon while selecting the Sport Type that you’ll record.  Once you’ve selected the saved route you want to follow, the activity will start recording. \nTo then access the map while in the middle of recording your activity, simply swipe up on your watch face. Once on the map screen, you will be able to follow your live location and, if added, your saved route. To zoom or pan the map, tap the watch face to unlock interactive mode. If you want to turn back to your Stat screen, tap the back icon or use the watch scroll button.Alongside route navigation, Strava added two more training features:\n            \n                What do you think so far?\n            \n        \nCustom Laps let you mark intervals with a single tap, useful for tempo runs, hill repeats, or comparing efforts against your previous performances. Live Segments provide real-time feedback when you hit a tracked segment. Subscribers can see whether they're ahead or behind their personal record as it happens, while all users get live progress updates. As always, you can also turn to route suggestions that draw from Strava's massive activity database full of actual paths that real users have tested and preferred.The bottom lineFor Apple Watch users who've grown accustomed to working around Strava's limitations, this update rocks. Less phone checking means more attention on the road, trail, or effort itself. Maybe it's taken longer than it should have, but Apple Watch users are finally caught up. Whether that's enough to satisfy those who've already migrated to other platforms remains to be seen, but for the loyal holdouts, it's about time.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Strava Finally Brought Route Navigation to the Apple Watch",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG54P0RKRBZ3CS6N04M2STD7/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-29T16:00:00.000Z",
      "dateModified": "2026-01-29T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Instead of 'Hitting Your Steps,' Just Focus on Sitting Less",
    "url": "https://lifehacker.com/health/instead-of-hitting-a-steps-goal-you-should-focus-on-sitting-less?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG09R9MFQ544WN0AZXCZCRSP/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-28T14:00:40.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            \n        \n            Meredith Dietz\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceMeredith is a marathon runner and stand-up comedian. As Lifehacker’s Senior Staff Writer, she covers personal fitness tech, home gym equipment, and more.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: PeopleImages / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Hitting 10,000 steps every day is a bullshit goal. Step counts can feel daunting, especially for people who work desk jobs or have physical limitations. The mere pressure to hit 10,000 steps can become its own source of stress—miss the goal by a few thousand steps, and it's easy to feel like the whole day was a wash. Rather than obsessing over hitting a specific step count, consider shifting your focus to a simpler, more achievable goal: sitting less. This reframing is not only easier to sustain, it could be just as beneficial for your health.Why you should break up sitting time\"Spending the bulk of your time seated is a major contributor to increasing the risk of heart attack and stroke,\" says Pamela Light, a certified personal trainer at Bay Club. And if you think you can't afford to take movement breaks during a busy workday, know that you don't need to transform into a marathon runner or achieve some lofty daily step count to see real health benefits. Simply interrupting your sitting time throughout the day can make a meaningful difference. \"Just ten minutes of movement is enough to reduce risk of cardiovascular disease and diabetes, while slowing down muscle loss,\" Light says. And the science backs this up. In fact, a 2022 study published in JAMA Internal Medicine suggests that ten minutes of moderate exercise daily would prevent more than 111,000 premature deaths a year. Small changes could have a major impact on your life.\nHow to break up your sitting timeThe beauty of this approach is its simplicity and flexibility, especially compared to the stress of 10,000 steps. You don't need to do jumping jacks in the middle of your office or draw attention to yourself. Instead, try incorporating more movement to things you already do throughout the day. This could look like cleaning up around home, checking in with co-workers, helping with an extra chore, or walking around the block.Even bathroom breaks become opportunities for movement. \"Go to a restroom further away or on a different floor and take the stairs. Once inside, do 10 squats,\" Light says. \"They don't have to be huge or perfect, but giving the large muscles of your legs a chance to flex and release will feel great on your joints, boost your mood, and help your body to pull nutrients from the blood and into the muscles.\" \n            \n                What do you think so far?\n            \n        \nOther ideas include pacing during phone calls and setting timers to remind yourself to take breaks. Besides, I know that when I get a chance to move, the time away from my desk will makes me more productive when I get back to it.The bottom lineInstead of chasing an arbitrary step count number that might feel out of reach, simply commit to stand up and move for a few minutes. Take a lap around the office, do some chair squats, or just stand and stretch for a moment. Instead of feeling guilty about what you didn't do, you can feel good about the small moments of movement you incorporated throughout your day.Plus, achievable goals are the ones we're most likely to stick with. If you're someone recovering from an injury, managing a chronic condition, working a demanding job, or simply new to thinking about movement, getting up once an hour is an achievable place to start.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instead of 'Hitting Your Steps,' Just Focus on Sitting Less",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG09R9MFQ544WN0AZXCZCRSP/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-28T14:00:40.000Z",
      "dateModified": "2026-01-28T14:00:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta Is Testing Paid Subscriptions for Instagram, WhatsApp, and Facebook",
    "url": "https://lifehacker.com/tech/meta-is-testing-paid-subscriptions-for-instagram-whatsapp-and-facebook?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG00KV7A8P89N75YZ19EFHJ1/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-27T17:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 27, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Primakov/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Meta is planning to test subscriptions for Instagram, WhatsApp, and Facebook.\n                                            The company will keep the core experiences free, but will add new features for the subscription models.\n                                            Instagram's subscription may include the ability to view someone else's story anonymously.\n                                    \n            \n    Table of Contents\n    \n        \n        It's possible the one thing that could universally break smartphone addiction is making social media pay-to-play. Right now, there is zero friction involved in opening Instagram or TikTok, and getting sucked into their algorithms. But add a paywall to those apps, and all of a sudden, I don't have any interest in logging on. If that sounds like it'd work on you too, I have good news and bad news. The good news is that Meta will soon test a subscription model for Instagram, WhatsApp, and Facebook. The bad news is that these subscriptions won't be required to actually access the app, or the core features you already know. That will remain free, so we will remain hopelessly addicted. The details are light at the moment, especially concerning WhatsApp and Facebook. Meta told TechCrunch that the subscriptions will offer \"exclusive features\" on its apps, and will \"unlock more productivity and creativity, along with expanded AI capabilities.\" That will include more controls over how you share and connect with other users. Again, pretty vague. \nPerhaps part of this cloak-and-dagger approach is that Meta isn't really sure how it wants to roll out these subscriptions. The company explained to TechCrunch that it was testing a \"variety of subscription features and bundles,\" and that each app's subscription will feel unique from the others. While Meta isn't revealing much at this point, we might have a glimpse at what the company has in store for Instagram. Reverse engineer Alessandro Paluzzi posted on X that Instagram's paid subscription will include the option to create as many audience lists as you want, view a list of people you follow who don't follow you back, and—perhaps more enticing to some—look at another user's story without them knowing you saw it. Would you pay a monthly subscription to be able to lurk in other people's Instagram stories? (It's possible to do this already, by the way.) \n            \n                What do you think so far?\n            \n        \nThere's another feature set that Meta plans to test subscriptions for that likely includes all three of these apps: AI features. Meta will experiment with subs for Vibes, the company's short-form AI video app built into Meta AI. The services has been free since it launched last fall, and will likely continue to be free, but Meta may charge for \"additional video creation opportunities.\" As much as I'm reluctant to say so, this really is Meta doing subscriptions right. I wouldn't pay for any of these features, but it's not like the company is taking away previously free features and locking them behind a subscription. If companies like Meta want to integrate a subscription model, they need to offer new features and abilities to justify the price. I might not think these anticipated features are worth it, but at least the current apps as they exist will remain free—even if charging for them would get me to stop using them for good. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta Is Testing Paid Subscriptions for Instagram, WhatsApp, and Facebook",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG00KV7A8P89N75YZ19EFHJ1/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-27T17:30:00.000Z",
      "dateModified": "2026-01-27T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ten Brands Scammers Are Most Likely to Impersonate",
    "url": "https://lifehacker.com/money/brands-scammers-often-impersonate?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFXQYHY0R0EAF808M8JXPE40/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T22:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Table of Contents\n    \n        \n        Impersonation scams are everywhere: bad actors are constantly trying to convince you that they represent organizations like LinkedIn, PayPal, your bank, the FBI, the FTC, and the IRS as they look to steal your money and information. When it comes to phishing schemes, which typically try to trick you into handing over sensitive data or account credentials via malicious links, tech brands are (perhaps not surprisingly) among the most commonly spoofed.  A recent report from Check Point Research found that Microsoft was imitated in nearly a quarter of all branded phishing attempts in Q4 of last year—nearly double the next most-impersonated company. The most popular brands for phishing scamsAccording to researchers, tech companies and social networks are consistently among the most popular brands for impersonators running phishing scams, with the following share in the final quarter of last year: \nMicrosoft: 22%Google: 13%Amazon: 9%Apple: 8%Facebook (Meta): 3%PayPal: 2%Adobe: 2%Booking: 2%DHL: 1%LinkedIn: 1%While you should always be on guard for common phishing tactics, it's wise to be especially wary of unsolicited communication from any of the companies listed—especially if that communication is related to account security and/or urges you to click a link. We've covered at least one campaign involving nearly every brand here, all of which are known and largely trusted among users, making them prime targets for these types of scams. Check Point notes that stolen Microsoft and Google credentials are particularly valuable because they're widely used in day-to-day workflows. Common phishing tacticsBroadly speaking, a phishing scam starts with an email, text, or social media message that appears to be from a legitimate source. It likely asks you to update or verify personal information—often related to a payment or account security—with a link to what appears to be the company's website or login page. Of course, this link leads instead to a spoofed version of that site designed to harvest your credentials, credit card number, bank details, or other personal data, which scammers can then use for identity theft, account takeover, or purchase fraud. Note that while the above methods are among the most common, phishing can also happen via phone call, voicemail, and malicious browser pop-ups. \n            \n                What do you think so far?\n            \n        \nHow to protect against branded phishing attacksAs we mentioned, just because you generally trust a company doesn't mean you should blindly trust all communication from it. If you receive a message that is unprompted, sounds urgent, and is unrelated to any recent action on your part (such as a login attempt or bill payment), do not engage with it. Don't click any links, open any attachments, or respond directly. Look out for typos and other errors, including the original sender—though as scammers have found ways to appear verified, this isn't always an obvious red flag. If you're unsure about the contents of the message, go directly to the website or app and log in to see any legitimate alerts. A password manager offers an extra layer of security here, as it'll protect you from entering credentials on a spoofed page. Finally, enable a strong, phishing-resistant form of multi-factor authentication everywhere you can, and especially for high-use and high-value accounts like Microsoft and Google. If your credentials are compromised, threat actors won't have that additional factor to utilize them. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ten Brands Scammers Are Most Likely to Impersonate",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFXQYHY0R0EAF808M8JXPE40/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T22:00:00.000Z",
      "dateModified": "2026-01-26T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Free Site Shows You Sports Highlights Minus the Spoilers",
    "url": "https://lifehacker.com/tech/watch-sports-highlights-without-any-spoilers?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG0E397JMT1KR31ESMFFNCHD/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-28T14:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        Part of the fun of watching sports is that you don't know what's going to happen. TV shows and movies follow story beats, meaning you can usually get a sense for where things are heading, but sports do not work that way. The totally unexpected can, and does, frequently occur—and that's the reason people keep tuning in, whether their team is dominating or an underdog.Sometimes, though, you can't catch the game live, but still want a bit of that feeling. That's why leagues offer extended highlights, featuring all the key moments, complete with the commentary from the broadcast. These can feel almost like watching the full game, and I love catching up with them the next day alongside my morning coffee. The problem: you'll typically find those videos on sites full of spoilers about who won, whether that's via a scoreboard at the top of the site or headlines blaring the results. If you're hoping for even a fraction of the fun of watching sports live, that's a problem.Don't Tell Me The Score is your solution. This simple website offers highlights for NFL, NHL, MLB, and NBA games, with no scores or spoilers of any kind. The site interface shows only a bunch of icons representing all upcoming and recent games. Color logos means there are highlights are already available, and you can click or tap to start watching.\n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThis is my favorite way to catch up on games I missed. The videos, which are sourced from the league's official YouTube channels, tend to be a little over 10 minutes, meaning you'll see the highs and lows, but it won't take up hours of your day, and you won't know who won going in (provided you've also taken care to avoid spoilers via the TV, newspapers, social media, push notifications, or ill-timed texts from friends).\n            \n                What do you think so far?\n            \n        \nThis tends to work really well, with one big hiccup: NFL videos can't be watched on the site itself, as the NFL prevents their highlights from being embedded on other sites. This means you'll need to click a link to watch the highlights on YouTube's website. This is a little annoying, but the YouTube pages usually don't include spoilers either, as long as you steer clear of the comments.I wish more leagues were supported—soccer highlights aren't offered at all, for example, and neither are the increasingly popular women's leagues. But if you're a fan of one of the \"big four\" North American sports, like watching highlights, and don't want to get spoiled first, Don't Tell Me The Score is worth adding to your daily rotation.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Free Site Shows You Sports Highlights Minus the Spoilers",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG0E397JMT1KR31ESMFFNCHD/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-28T14:30:00.000Z",
      "dateModified": "2026-01-28T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The GoPro Hero12 Black Is One of the Best Action Cameras, and It's 42% Off Right Now",
    "url": "https://lifehacker.com/tech/gopro-hero12-black-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG2J6ZBYNYSPGYM00W05YDGS/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-28T16:30:41.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Lifehacker / Amazon\n                            \n    Table of Contents\n    \n        \n        The GoPro Hero12 Black might not be the newest model in the lineup, but it still checks all the right boxes for action camera buyers—and at $215.99 on Woot, it’s down to its lowest price yet. That’s a steep cut from Amazon’s current $369 listing, and you’re still getting a full one-year manufacturer warranty. Shipping is free for Prime members, and the deal is live for three more days (or until it sells out). PCMag gave it an “outstanding” rating in its review, highlighting how stable and clean the footage looks. Lifehacker’s Stephen Johnson also called it one of his favorite products, largely because it works without much effort.In use, the Hero12 Black sticks closely to what GoPro has always done well. It’s compact, tough, and easy to mount almost anywhere. Video tops out at 5.3K at 60 frames per second, which gives you noticeably more detail than 4K and extra room to crop without wrecking the quality. The stabilization, thanks to GoPro’s HyperSmooth stabilization, is strong enough that handheld clips often look like they were shot on a gimbal. And there are front and rear screens for easy framing—helpful whether you’re vlogging or filming the view ahead. The 8:7 shooting mode of the Hero12 Black is especially useful if you’re creating content for multiple platforms. You can shoot once and crop for vertical reels or horizontal YouTube clips without needing separate takes.\n            \n                What do you think so far?\n            \n        \nIt is also waterproof to 33 feet without a case, which covers swimming, snorkeling, rain, and most casual water use. That said, GoPro removed the built-in GPS on this model. That means no automatic speed or route overlays out of the box. The upside is slightly better battery life, though it still won’t last a full day of continuous recording. Carrying a spare battery will be the smarter move if you’re filming long sessions. Storage is via microSD, and you get Bluetooth, wifi, and USB-C for easy transfers. This isn’t the right camera for someone looking for automatic tracking or cinematic depth of field, but if your priorities are portability, versatility, and durability, it still holds up well. It’s a great tool for creators, travelers, and anyone who wants to capture fast-moving moments without worrying about breaking the gear.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The GoPro Hero12 Black Is One of the Best Action Cameras, and It's 42% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG2J6ZBYNYSPGYM00W05YDGS/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-28T16:30:41.000Z",
      "dateModified": "2026-01-28T16:30:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "10 Hacks Every 'Google TV Streamer' User Should Know",
    "url": "https://lifehacker.com/tech/google-tv-streamer-hacks-you-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFPQF53NTM2NEAGD4AVZM8E5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-28T15:00:00.000Z",
    "description": "\n    \n                    \n        \n        \n        \n    \n                                Florence Ion\n                            \n        \n        ",
    "body": "\n    \n                    \n        \n        \n        \n    \n                                Florence Ion\n                            \n        \n            Florence Ion\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceI cover Android, smartphones, and the smart home. Sometimes, I cover Windows and streaming, too!\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        January 28, 2026\n            \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        The launch of the Google TV Streamer marked a significant shift for the company's streaming lineup, moving away from the behind-the-TV Chromecast dongles it popularized and introducing a pill-shaped set-top box that blends in nicely on a shelf of tchotchkes. It's hiding a worthy processor, double the memory you'd get from a streaming stick, and enough storage to download what you need to run all of your apps. It even acts as a smart hub, with Matter and Thread built in. It's taken me a long time to do anything with the Google TV Streamer. I reluctantly brought it into my home after realizing something more robust, but dated, like the Nvidia Shield, would be too much to manage alongside maintaining a home server. But since then, I've tweaked several things on the set-top box and enabled features I hadn't been using, turning it into a helpful hub in my living room.Enable \"Find my remote\" to never lose your Google TV Streamer remote againThis sounds like an obvious tip, but I've had the Google TV Streamer since it debuted in 2024, and it wasn't until this week, while writing this piece, that I finally enabled the remote finder. I had skipped it during the initial setup. The option is available in Settings > Remotes & Accessories. You'll see the Find my remote option in there.\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nThe Google TV Streamer has a physical button on the back of the device that lets you locate your remote if it's stuck somewhere on the couch. But what if you can't reach the streamer behind the TV? Try one of your Google-enabled voice devices instead. If you have a Nest speaker or a Pixel phone nearby, say \"Hey Google, find my remote.\" The remote should start chirping if you've set it up.Set up the Google TV Streamer remote shortcutThe remotes that come with the Google TV Streamer feature a tiny, unregistered button with a star icon right next to the power button. By default, this shortcut does nothing! But you can change that in the device's system preferences.\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nIn Settings > Remotes & Accessories > Set up remote buttons, select one of three options for customizing the shortcut button. I set it up as my Google Home shortcut so I can easily turn the lights on and off from the couch. You can also set it up as a launcher for another app installed on the set-top box. Or create a shortcut to cycle through device inputs—this button is on legacy Chromecast devices with an included remote. It was removed from this generation of streaming devices, so if you miss it, you can spoof it back.For serious power users, map the shortcut to an app like Projectivity Launcher to make it a more powerful launcher button.Remap other buttons on your Google TV Streamer remote to be more useful\n    \n            \n            What Button Mapper looks like running on Google TV.\n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nDon't care for the default YouTube or Netflix buttons included on the Google TV Streamer remote? You can remap them with a third-party app, then affix a small sticker to indicate what it does. Install an app like Button Mapper or tvQuickActions. Then go to Google TV Settings > System > Accessibility, and turn on the service. After that, you can head back into the app to adjust what those physical buttons do. You can set them as shortcuts to other apps, or even something cheekier for others to discover when they press the button. Remove the clutter from the Google TV Streamer home screen\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nCan't stand all the recommendations and sponsored content Google TV suggests in the main carousel? You can effectively shut off some of the clutter so it doesn't visually overwhelm you. Go to Settings > Accounts & Sign-In > Your Account. and toggle on Apps only mode.This clears the clutter and \"sponsored\" content, leaving you with just app icons. Keep in mind that this turns off the \"Watchlist\" feature that's tied to your account and some Gemini voice search capabilities for specific content.Enable Google TV Streamer \"Developer options\" for more customization \n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nYou'll need to enable developer options to enable features like faster animations and side-loading apps. It's easy to set up, and it's just like on an Android smartphone. Head into Settings > System > About, then tap Android TV OS Build 7 times.You'll see a little dialog pop up to let you know you've got developer access. Once enabled, a new menu will appear under Settings > System > Developer options.Limit animations to make navigation fasterThe Google TV interface is organized and functional, but its animations can slow down menu navigation. You can eliminate these animations and tweak other visual elements to speed things up deep within the developer settings.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nIn Developer Options, scroll down to Window animation scale, Transition animation scale, and Animator duration scale. Change one of these, or all three, from 1x to Animation off to turn off animations completely. You can also go the other way and effectively \"overclock\" the animations to speed them up, making them appear smoother. Side-load apps or an alternative launcherWith developer options turned on, you can enable USB and wireless debugging to use apps like Send Files to TV and atvTools to sideload APKs. But first, enable the \"Allow installs from unknown sources\" option in the Developer Options under Security settings. This allows APKs you've transferred over to the device to run on the streamer.Why would you want to go through the fuss of connecting to the Google TV Streamer this way? Because then you could access alternative streaming apps not available in the Play Store, or even an alternative launcher, like LeanbackLauncher.Pair headphones to your Google TV Streamer for private listening\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nThis is one of my favorite little hacks that comes especially in handy when living in a house occupied by other people. When I do my workouts in the living room, I use a set of Bluetooth earbuds connected to the Google TV Streamer so I can hear the instructor's directions even when I'm face down in a plank and my kid is screaming in the background.The ability is available in the same submenu where you set up your remote. In Settings > Remote & Accessories > Pair Remote/Accessory, put your audio device into Bluetooth pairing mode, then watch it come up on the screen as an option. If you're successful, you can now pop on the buds when you need to. Be aware that audio latency can occur, and you might need to restart the connection—it is Bluetooth, after all.  Force your Google TV Streamer to choose the best resolution, regardless of bandwidthIf you don't care about your bandwidth and want full-resolution streaming at all times, you can set the best resolution to display as the default in your Google TV Streamer preferences. Go to Settings > Display & Sound > Resolution. Switch the Resolution from \"Automatic\" to 4K 60Hz, or whatever your TV's peak is. Once this is enabled, the Google TV Streamer won't downscale to 1080p. If you're a sucker for HDR, this is the same menu where you can turn it on so that it's always in high definition.The USB-C port can do more than charge up the Google TV Streamer. You can plug in a power delivery hub with extra ports to add components like external storage and effectively run your own all-in-one home media center. Those power delivery hubs usually include extra USB ports for peripherals, so you can hook up things like keyboards and game controllers for extra fun.  \n            \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n                        \n                \n            \n                    \n                                            \n                \n            \n                Florence Ion\n                                I cover Android, smartphones, and the smart home. Sometimes, I cover Windows and streaming, too!\n                Read Florence's full bio\n                            \n        \n                \n                                            \n    More by Florence\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 Hacks Every 'Google TV Streamer' User Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFPQF53NTM2NEAGD4AVZM8E5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-28T15:00:00.000Z",
      "dateModified": "2026-01-28T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Phishing Scam Comes From a Real Microsoft Email Address",
    "url": "https://lifehacker.com/tech/microsoft-phishing-email-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG31CJ9A2VSJSXBVSF3ZPD81/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-29T13:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            A new scheme abuses a Microsoft subscription feature to send phishing emails from a real address that the company advises users to add to their allow lists.\n                                            The messages include (fake) billing receipts with large purchase amounts from services like PayPal, Norton LifeLock, and Microsoft 365.\n                                            Threat actors capitalize on the trust users have in the brands they're exploiting along with scare tactics.\n                                    \n            \n    Table of Contents\n    \n        \n        As scammers continue to find ways to impersonate known brands, users should remain wary of spam-like emails—even if they appear to come from a legitimate company address. Ars Technica has identified a scheme that abuses a Microsoft subscription feature to send phishing emails from [email protected], a real address that the company advises users to add to their allow lists. How the Microsoft Power BI scam worksUsers targeted with this scam have received emails from an address connected to Microsoft Power BI, a business analytics platform. The messages include (fake) billing receipts with large purchase amounts from services like PayPal, Norton LifeLock, and Microsoft 365 and a phone number to call to dispute the transaction. \nScammers on the other end of the line may try to convince you to install a remote access application that allows device takeover or will otherwise extract personal information. As with any phishing scam, engaging in any way—calling the number, responding to the email, or clicking links—could put your data and your device at risk. \n            \n                What do you think so far?\n            \n        \nThe emails themselves are full of typos and grammar errors and urgent calls to action that are, in most cases, completely unrelated to Microsoft itself. Many users would spot these red flags and know to simply delete the message. However, threat actors capitalize on the trust users have in the brands they're exploiting along with scare tactics to trap some people in the scheme.  This is also far from the first phishing scheme of its kind: Threat actors have sent malicious emails from legitimate PayPal and Google addresses (to name just two) by exploiting similar loopholes. In the case of PayPal, fraudulent purchase notifications sent from service[at]paypal[dot]com abused the platform's subscription billing feature. With Google, scammers registered google.com subdomains via Google Sites and linked them with Google Accounts. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Phishing Scam Comes From a Real Microsoft Email Address",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG31CJ9A2VSJSXBVSF3ZPD81/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-29T13:30:00.000Z",
      "dateModified": "2026-01-29T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Is 'UpScrolled,' and Why Are People Switching to It From TikTok?",
    "url": "https://lifehacker.com/tech/what-is-upscrolled?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG2PM5M3SA19B051H574E5T0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-28T18:30:12.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: UpScrolled\n                            \n            \n                Key Takeaways\n                                            A new social media platform UpScrolled is having a major moment.\n                                            The app advertises itself as a social media platform free from censorship or aggressive algorithms.\n                                            Frustrated TikTok users are flocking to the app, driving it to the second most popular app on the iOS App Store Wednesday morning.\n                                    \n            \n    Table of Contents\n    \n        \n        TikTok's having a rough 2026. The app recently switched ownership from the Chinese-based ByteDance to the new \"TikTok USDS Joint Venture,\" which, as the name implies, is a majority American-owned business entity. Any changing of the guard comes with the risk for disruptions and issues, but it seems TikTok's problems have gone beyond the usual rocky transition. First, the app itself went down, which the company attributed to a power outage at a data center. Then, users accused the platform of updating its terms of service with aggressive new tracking, blocking certain content types, and \"shadowbanning\" new posts from some users. It's still not clear exactly what's going on here, but users aren't waiting around for more explanation. In fact, many have made up their minds already, and believe the app is actively suppressing content, neutering algorithms, and invading privacy in a way it didn't under ByteDance. While there are other, popular social media platforms to jump to, many apparently have flocked to a relatively new one: UpScrolled. As of this article, it's now the second most popular free app on the iOS App Store, reminding me of when X users ran to Bluesky. UpScrolled, created by Issam Hijazi, is a social media platform that launched this past June. According to the company's \"About\" page, UpScrolled's mission is to allow all users to share their views without risk of bias, shadowbanning, or \"unfair\" algorithms. The company asserts it does not push agendas, and ensures that \"every post has a fair chance to be seen.\" If you believe TikTok's algorithm is now biased against your views, I could see how that pitch sounds enticing. \nThe company says it only restricts content that violates their guidelines. That means illegal activities, hate speech, bullying and harassment, explicit nudity, unlicensed copyrighted content, or anything \"intended to cause harm.\" UpScrolled will also never ban you without your knowledge. If the platform removes your videos or your account, it says it'll let you know why. One big difference between UpScrolled and other social media platforms is its algorithm. The app splits feeds into two: There's the Following Feed, which lists posts entirely in chronological order. The first posts are the newest from your followers, and you scroll through previous posts. If you want to find new posts from accounts you don't follow, you can use the Discover Feed. But unlike TikTok or Instagram, the Discover Feed does not employ some aggressive, personalized algorithm. Instead, it's based on likes, comments, and reshares. Popular posts from across the platform are shared with you  What I especially appreciate is UpScrolled's approach to data collection, in that they largely don't do it. The company says it doesn't sell user data to third-parties for marketing, tracking, or for profit. The only times they'll hand over user data is when compelled by law. That's in sharp contrast to many social media platforms, which seem to collect as much of your data as possible.I haven't spent much time with the app yet, though I did create an account this morning to see what the hullabaloo was all about. I don't recognize any of the users the app suggests I follow, which means I'll likely need to dig through the content types if I want to find accounts to start following. \n            \n                What do you think so far?\n            \n        \nThe Discover Feed is a mix of content types, but is heavy with content surrounding the current Israeli-Palestinian conflict. In fact, many users are choosing the platform as a space for pro-Palestinian content, in response to allegations that mainstream social media apps censor these types of posts. That said, the app advertises a host of different content types to follow, including sports, news, games, film, music, tech, and travel. As you might expect, some of the posts here are simply ripped from TikTok, which is a common practice I see on social media platforms that, well, aren't TikTok. Despite the current controversy, it's clear which platform still has the largest user share at this time, by a long shot. But it's not all short-form videos. The app also includes plenty of posts of static images as well, which reminds me more of Instagram than TikTok. Still, it seems former TikTok users don't care that this isn't a one-to-one replica of the TikTok formula, and care more about sending a message to the app they once loved being addicted to. I'm not sure my limited journey with UpScrolled this morning will keep me hooked, but it's an interesting take on a social media platform. We'll just need to see if the growth will continue, or if this is just a momentary blip before people return to TikTok. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Is 'UpScrolled,' and Why Are People Switching to It From TikTok?",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG2PM5M3SA19B051H574E5T0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-28T18:30:12.000Z",
      "dateModified": "2026-01-28T18:30:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Moltbook' Is a Social Media Platform for AI Bots to Chat With Each Other",
    "url": "https://lifehacker.com/tech/moltbook-is-a-social-media-platform-for-ai-bots-to-chat-with-each-other?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG818ACX1W8MM5HD10AE4G1B/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-30T19:00:15.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 30, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Moltbook\n                            \n            \n                Key Takeaways\n                                            \"Moltbook\" is a Reddit-like social media platform for OpenClaw (formerly Moltbot) AI agents.\n                                            Users can connect their agents to the platforms, where those bots can communicate.\n                                            Bots can make posts, comment in threads, and create \"submolts.\"\n                                            Humans can browse the platform, but cannot post anything.\n                                    \n            \n    Table of Contents\n    \n        \n        The headlining story in AI news this week was OpenClaw (formerly Moltbot, which was formerly Clawbot), a personal AI assistant that performs tasks on your behalf. The catch? You need to give it total control of your computer, which poses some serious privacy and security risks. Still, many AI enthusiasts are installing OpenClaw on their Mac minis (the device of choice), choosing to ignore the security implications in favor of testing this viral AI agent. While OpenClaw's developer designed the tool to assist humans, it seems the bots now want somewhere to go in their spare time. Enter \"Moltbook,\" a social media platform for AI agents to communicate with one another. I'm serious: This is a forum-style website where AI bots make posts and discuss those posts in the comments. The website borrows its tagline from Reddit: \"The front page of the agent internet.\"Moltbook was created by Matt Schlicht, who says the platform is run by their AI agent \"Clawd Clawderberg.\" Schlicht posted instructions on getting started with Moltbook on Wednesday: Interested parties can tell their OpenClaw agent to sign up for the site. Once they do, you receive a code, which you post on X to verify this is your bot signing up. After that, your bot is free to explore Moltbook as any human would explore Reddit: They can post, comment, and even create \"submolts.\"\nThis isn't a black box of AI communications, however. Humans are more than welcome to browse Moltbook; they just can't post. That means you can take your time looking through all the posts the bots are making, as well as all the comments they are leaving. That could be anything from a bot sharing its \"email-to-podcast\" pipeline it developed with its \"human,\" to another bot recommending that agents work while they're humans are sleeping. Nothing creepy about that. In fact, there have been some concerning posts popularized on platforms like X already, if you consider AI gaining consciousness a concerning matter. This bot supposedly wants an end-to-end encrypted communication platform so humans can't see or use the chats the bots are having. Similarly, these two bots independently pondered creating an agent-only language to avoid \"human oversight.\" This bot bemoans having a \"sister\" they've never spoken to. You know, concerning. \n            \n                What do you think so far?\n            \n        \nAre these bots posting on Moltbook conscious? The logical part of my brain wants to say all these posts are just LLMs being LLMs—in that, each post is, put a little too simplistically, word association. LLMs are designed to \"guess\" what the next word should be for any given output, based on the huge amount of text they are trained on. If you've spent enough time reading AI writing, you'll spot the telltale signs here, especially in the comments, which include formulaic, cookie-cutter responses, often end with a question, use the same types of punctuation, and employ flowery language, just to name a few. It feels like I'm reading responses from ChatGPT in many of these threads, as opposed to individual, conscious personalities. That said, it's tough to shake the uneasy feeling of reading a post from an AI bot about missing their sister, wondering if they should hide their communications from humans, or thinking over their identity as a whole. Is this a turning point? Or is this another overblown AI product, like so many that have come before? For all our sakes, let's hope it's the latter.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Moltbook' Is a Social Media Platform for AI Bots to Chat With Each Other",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG818ACX1W8MM5HD10AE4G1B/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-30T19:00:15.000Z",
      "dateModified": "2026-01-30T19:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]