[
  {
    "title": "Here's What's New With Veo 3.1, Google's Latest AI Video Model",
    "url": "https://lifehacker.com/tech/google-ai-video-veo-31?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7SQB76SEB0CT85NT4HVPYJ7/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-17T20:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Even more ways to make AI-generated videos.\n    \n        \n    \n                                        \n        \n        \n        October 17, 2025\n    \n            Credit: Google DeepMind/YouTube\n                            \n            \n                Key Takeaways\n                                            Google announced its latest AI video model this week, Veo 3.1.\n                                            The new model is capable of generating convincing clips, with features like the ability to add any element into a scene, or extend a clip.\n                                            Is it really a good thing that companies like Google are making it easy to generate hyper-realistic scenes?\n                                    \n            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.OpenAI's new Sora app has been the main focus concerning hyper-realistic AI slop over the past few weeks. Sora makes it all too easy for users to generate short-form videos that seem real enough to most people, including videos that showcase real people's likenesses.But before Sora dropped, it was Google that was stirring fears about these realistic AI videos. With Veo 3, Google launched an AI model that not only produced lifelike videos, it also generated realistic audio synced to the action. Sound effects, environments, even dialog could all generate alongside the video itself, selling the effect entirely from one simple prompt. \n        \n            You May Also Like\n        \n    \nVeo 3.1Now, Google is back with an upgrade to Veo, appropriately named Veo 3.1, which the company announced in a blog post on Wednesday. This isn't necessarily an overhaul or a revolutionary new video model. Instead, Veo 3.1 builds on top of Veo 3, adding \"richer audio\" and \"enhanced realism\" that Google says generates \"true-to-life\" textures. The new model also reportedly supports new narrative controls tools, which pairs with new upgrades to Flow, Google's AI video editor. Flow users now have more granular controls when editing, and can add audio to existing features like \"Ingredients to Video,\" \"Frames to Video,\" and \"Extend.\" What does that mean in practice? According to Google, Ingredients to Video with Veo 3.1 lets users add references images to their scenes, such as a specific person, clothing items, or an environment. The new Flow editor can then insert those elements into the finished product, as you can see in the demo video below: \nBuilding off of this new feature, Flow now lets you add new elements to an existing scene as well. With \"Insert,\" you can tell Veo 3.1 to add new characters, details, lighting effects, and more to the clip. Google says it is also working on the opposite as well, to allow users to remove any elements they don't like from a generation.\nGoogle also now has a new way for users to dictate how they'd like a scene to generate, called \"First and last frame.\" Users can choose reference frames for the beginning and ending of a scene. Flow with Veo 3.1 will then fill in the gap, and generate a scene that starts and ends based on those images. \n            \n                What do you think so far?\n            \n        \nThere's also now a way to create videos that are longer than previous iterations of Flow would generate. The new \"Extend\" feature lets you either continue the action of the current clip, or cut to a new scene that follows it, though Google says the feature is most useful for generating a longer establishing shot. According to the company, Extend can create videos that last over a minute.\nVeo 3.1 is available for users in the Gemini app as well as Vertex AI, as long as you have a Google AI Pro subscription. Developers can access it via the Gemini API. Google says Ingredients to Video, First and last frame, and Extend are coming to Gemini API, but \"Add object\" and \"Remove object\" are not available. \"Extend\" is also not yet available in the Vertex AI API. Is this really a good thing?Google sees all of these advancements as a boon for creatives and creativity, but I'm highly skeptical. I could see Veo 3.1 and Flow as a good tool for envisioning shots before filming or animating them (i.e. a storyboarding tool), or even a way for new and budding filmmakers to learn editing by seeing their ideas in a more realized form. However, as a whole, I don't think AI-generated content is the future—or, at least, not a future most of us want. Sure, there's humor or novelty in some of these AI-generated videos, but I'd wager most of the people who enjoy them do so ironically, or exclusively to social media. The idea of replacing human filmmakers and actors with AI generations seems absurd, especially when it puts all of us at risk of disinformation. Is it really so important for companies like Google and OpenAI to make it easy to generate hyper-realistic fully-rendered scenes, when those videos could so easily be used to trick the masses? This could be the ramblings of someone resistant to change, but I don't think most of us would like to see our favorite shows and movies made with passion and emotion, replaced by realistic-looking people delivering muted and robotic performances.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's What's New With Veo 3.1, Google's Latest AI Video Model",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7SQB76SEB0CT85NT4HVPYJ7/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-17T20:00:00.000Z",
      "dateModified": "2025-10-17T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Blink Outdoor Security Camera Two-Pack Is $100 Off Right Now",
    "url": "https://lifehacker.com/tech/blink-outdoor-security-cameras-refurbished-deal?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7RD9F6ZXFPZ3H7W9CQN7PY4/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-17T13:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Blink Outdoor Security Camera Two-Pack Is $100 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7RD9F6ZXFPZ3H7W9CQN7PY4/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-17T13:00:00.000Z",
      "dateModified": "2025-10-17T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Will Finally Let You Control How Liquid Glass Looks",
    "url": "https://lifehacker.com/tech/apple-will-finally-let-you-control-how-liquid-glass-looks?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K81EP75346P8RMQ2A3W4EB5W/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-20T20:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Do you prefer your UI clear or tinted?\n    \n        \n    \n                                        \n        \n        \n        October 20, 2025\n    \n            Credit: Apple/YouTube\n                            \n            \n                Key Takeaways\n                                            Apple is now testing a setting that lets you choose how Liquid Glass looks on your iPhone, iPad, or Mac.\n                                            The company is testing the toggle as part of iOS 26.1, which is currently on its fourth beta version.\n                                            As it stands now, you'll have the option to turn on a \"Tinted\" mode forLiquid Glass, as opposed to \"Clear.\"\n                                    \n            \n    Table of Contents\n    \n        \n        For better or worse, nothing defines iOS 26 quite so much as Liquid Glass. Apple's distinct new design language has been met with praise and criticism, with some users enjoying the refreshed look, and others bemoaning the UI's issues with visibility and consistency.  It seems Apple was similarly of two minds on the update, having toyed around with the exact look of Liquid Glass throughout the iOS 26 beta testing period. The company seemed to be having trouble settling on a specific balance between the design's glassy effect, which can look really cool, and its overall readability. If buttons are too clear, for example, they'll let in more of the background elements, which can make it more difficult to see them. But by reducing the glass effect too much by adding a tint to the icon and menu backgrounds, Apple risks loses the charm of the design entirely. (Some critics have dubbed it \"Frosted Glass\" by comparison.)While Apple is seemingly still continuing to tweak Liquid Glass, it appears the company has decided that part of the problem is down to user preference. So rather than stick with one look for the design, Apple is now working on a setting that lets you choose whether Liquid Glass looks more clear, or more tinted.\n        \n            You May Also Like\n        \n    \nTo be clear, or not to be clearThis new setting first appeared in the fourth beta for iOS 26.1, as well as iPadOS 26.1 and macOS 26.1, which Apple released on Monday, Oct. 20. The toggle, which beta testers can find in Settings > Display and Brightness (iOS and iPadOS) or System Settings > Appearance on the Mac (macOS), gives users a simple choice in how Liquid Glass looks across their particular system: \"Clear,\" which is more transparent, and is in-line with Liquid Glass' original intent; or \"Tinted,\" which increases the opacity of menus and windows. You'll likely be able to read these elements better, but you won't see as much of the background shining through. \n    \n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \n\nGiving tester what they asked for (sort of)During the pre-release beta testing period, some users called on Apple to add a Liquid Glass \"slider\" to iOS, iPadOS, and macOS. The idea was to allow users to fine-tune how Liquid Glass looks. Apple seems to have taken a different approach, offering only two levels of transparency with the new control. While a slider (or more transparency options, at least) would be great, what we're getting is better than nothing for users who prefer a more opaque Liquid Glass appearance.\n            \n                What do you think so far?\n            \n        \niOS 26.1 is still in beta testing, so it isn't clear (no pun intended) whether this feature will in fact make it to the official update, and if it does, whether it'll still work the same way. How to fix Liquid Glass right nowBut even without this dedicated settings page, there is something you can do to \"undo\" Liquid Glass: By kicking on the \"Reduce Transparency\" feature in Accessibility settings, you can achieve a similar look to choosing the new \"Tinted\" option. My guess, however, is that \"Tinted\" will achieve a more visually pleasing look, as it is something Apple deliberately implemented to work with the design of Liquid Glass, while reduce Transparency is simply a blanket effect that turns down transparency effects across iOS, iPadOS, or macOS. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Will Finally Let You Control How Liquid Glass Looks",
      "image": [
        "https://lifehacker.com/imagery/articles/01K81EP75346P8RMQ2A3W4EB5W/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-20T20:30:00.000Z",
      "dateModified": "2025-10-20T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Beats Studio3 Are Just $89 Right Now",
    "url": "https://lifehacker.com/tech/beats-studio3-headphones-deal?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K86HNSHW75RRPKW8DFFM87D7/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-22T18:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Beats Studio3 Are Just $89 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01K86HNSHW75RRPKW8DFFM87D7/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-22T18:30:00.000Z",
      "dateModified": "2025-10-22T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why an AWS Outage Can Break the Internet",
    "url": "https://lifehacker.com/tech/what-is-aws?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K81QYSWSW78HM2TJY1ZEFF85/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-20T22:00:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            What is AWS, anyway, and why does it matter so much?\n    \n        \n    \n                                        \n        \n        \n        October 20, 2025\n    \n            Credit: Sundry Photography/Shutterstock\n                            \n            \n                Key Takeaways\n                                            AWS had a global outage on Monday that resulted in interruptions for many sites and services.\n                                            AWS is short for Amazon Web Services, and offers cloud computing products for companies.\n                                            The company is the largest cloud-based hosting service in the world, with over four million physical businesses relying on it.\n                                    \n            \n    Table of Contents\n    \n        \n        If you used the internet at all on Monday, you probably noticed a lot of things weren't working all that well. Sites and services around the world experienced interruptions, including the likes of Facebook, McDonald's, and even Fortnite. You might have heard by now that the issues were caused by an AWS outage. If you don't know what AWS is, however, that explanation might not be all that clear. \"Amazon Web Services\" runs the internetAWS is an Amazon subsidiary, short for Amazon Web Services. The company offers over 200 cloud-based products to customers, including applications for all of the following:Accessing AWS servicesAnalyticsApplication integrationBlockchainBusiness applicationsCloud Financial ManagementComputeCustomer enablementContainersDatabasesDeveloper toolsEnd user computingFrontend web and mobile servicesGame techIoTMachine learning and AIManagement and governanceMediaMigration and transferNetworking and content deliveryQuantum technologiesSatelliteSecurity, identity, and complianceStorageMore than this list, it's important to understand why AWS matters. The service replaces the need for companies to purchase their own hardware for their data storage, networking, and computing requirements. Instead, companies can choose to outsource these needs to AWS, and adjust those services as those needs change. As such, a company can start out hiring AWS to handle a small amount of their processing, but as the company grows, they can choose to add more servers to their plan—rather than invest in additional hardware to handle the processing. This is known as cloud computing. \n        \n            You May Also Like\n        \n    \nIn order to keep up with a global demand, AWS relies on a large number of physical server locations spread out throughout the world. Amazon says AWS has 120 \"Availability Zones\" across 38 global regions—physical locations that contain at least one data center with \"redundant power, networking, and connectivity.\" The idea is, having these physical data centers across continents means your cloud compute is easier to expand and is better protected from failure—which is a little ironic, given today's events. \n            \n                What do you think so far?\n            \n        \nHow much of the internet runs on AWS?In theory, there are a lot of advantages to cloud computing. It can be much simpler and cost efficient for a company to rent AWS servers and technology to power their applications, store their data, or handle their traffic. As such, a lot of the world runs on AWS. According to HG Insights, as of 2025, 4.19 million businesses with a physical address use AWS. (There doesn't appear to be data on customers without a physical address, so this number could be much higher.) In addition, AWS is the largest cloud computing company in the market at this time: That same report found AWS has 30% of the market, while competitors like Microsoft Azure and Google Cloud make up 20% and 12%, respectively. Why an AWS outage is such a big dealWhen so many companies rely on your cloud computing to run their internet-based services, the risk for failure is great. That's what we saw on Monday: AWS' outages resulted in issues with many sites and services. If the HG Insights is correct, as many as 30% of businesses that use some type of cloud computing services could have been impacted today. One analyst thinks the impacts of the outage may be billions of dollars in lost revenue. It's not clear what the solution is, but it's clear that there's a jeopardy in so much of the internet relying on one cloud hosting service.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why an AWS Outage Can Break the Internet",
      "image": [
        "https://lifehacker.com/imagery/articles/01K81QYSWSW78HM2TJY1ZEFF85/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-20T22:00:00.000Z",
      "dateModified": "2025-10-20T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Google’s NotebookLM AI Chatbot Became My New Study Buddy",
    "url": "https://lifehacker.com/tech/google-notebooklm-ai-chat?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7HNJKYS0WF9X9CV4653YWV5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-15T13:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    I have found so many uses for this program in my life.\n            \n                        \n    \n                            \n        \n        \n        October 15, 2025\n            \n            \n                        Credit: Ian Moore / Lifehacker Composite; Google\n                            \n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding Lifehacker as a preferred source for tech news.Though its mobile app is quite bad, the web version Google's NotebookLM has become one of my most-used tools since I started playing around with the AI large language model last spring. I've found a ton of ways to use it to be more efficient in my everyday life, which is (much) more than I can say for other AI-enabled applications I've tried. Instead of (poorly) doing the work for you, NotebookLM acts as a true helper, assisting in organizing information for you without being intrusive. And one of the most useful ways to interact with it is via its familiar chat interface, which has turned the program into my new study buddy, and a resourceful co-worker. \nHow I use NotebookLM's AI chat for studyingI've been studying for a certification exam and have been uploading my materials into NotebookLM whenever I get to a new chapter. From there, I've been able to make flashcards, mind maps, practice quizzes, and study podcasts with a few clicks. The podcasts are especially unique and helpful: Two AI-generated voices discuss the concepts from my notes and materials in an informational, conversational way that sounds just like a podcast—if said podcast were a little too pedantic and on-the-nose. (Sometimes, it even adds in tics like vocal fry to make things sound that much more realistic.)\n    \n            \n            \n                                        Credit: Google/Lindsey Ellefson\n                    \n    \nUsually, I listen to a podcast on my chapter while I complete a chore, like packaging up my Poshmark sales. Then, I go back to the notebook and have it generate flashcards or a quiz to see how much information I retained. Each flashcard or quiz question includes a link to the source material, so I can click it and review the full passage in the left-side panel.I find the tool so useful, I've become something of an evangelist for it. A friend of mine recently went back to school, and I taught them how to upload the slide decks, chapter scans, PDFs, and other materials from their online classes into NotebookLM. They now use the chatbot to summarize a given class's content and create outlines for discussion posts. Using the chatbot to create outlines has been helpful for my friend, who struggles with writing but excels in thinking practically. They're able to ask the bot to generate key dates, important facts, and other concrete facts that they should be studying and referencing in their discussion posts, but which they find difficult to pull out of the dense material themselves. The chatbot has also been useful for my own studying, but in a different way. Unlike my back-to-school friend, I have no idea what's going to be on my certification test. I don't get a study guide. I know that out of 23 chapters of material, a random selection of questions will be given to me, which means I have to study everything, hoping I adequately cover what appears on my final exam. So after listening to my podcast and drilling my flashcards, I ask the bot to summarize the main idea of each chapter and suggest five of the most crucial points within it. Even though I know I have to read the whole thing, this gives me a roadmap for where to start and what to look out for. In that way, it's similar to using a traditional study technique like KWL or SQ3R to formulate questions before a critical reading session. I've also like to tell the chatbot to \"have a conversation with me\" about specific topics within the chapters. This is my version of the Feynman technique, in which you interrogate your mastery of a topic by trying to teach someone else about it, although I'm not \"teaching\" the bot so much as talking to it. By going back and forth conversationally, I practice describing the terms and ideas in a casual way, which I can't do if I'm not intimately familiar with them. If I find myself struggling to keep up the conversation, I know I have to study that section more. How I use NotebookLM's AI chat for workBack in May, I published a series here on Lifehacker entitled \"Moving Made Simple.\" In writing and researching nearly a dozen articles for it, I interviewed something like 13 moving pros from around the world. I ended up with a stack of interview transcripts to sort through, and the idea of rereading them all to highlight the most important information, plus cross-reference reoccurring advice shared by multiple sources, was daunting, to say the least. I found myself struggling to remember who recommended what, and in what context, and determining which story each tip was best suited for. But then I turned to NotebookLM. I opened up a new notebook and dropped in copies of all of my transcripts. Because NotebookLM only pulls information from the sources and materials you input, I could then ask its built-in chatbot questions without worrying it would spit out nonsense culled from a dubious, 10-year-old Reddit post. I asked it things like, \"What do the sources recommend for carrying large furniture?\" and \"What order should someone pack their belongings in before a move?\" and NotebookLM made simple lists in response, with each answer including a hyperlink to the exact transcript from which it came. \n            \n                What do you think so far?\n            \n        \nA number of pros recommended the same things, like packing hanging clothes in a garbage bag with a hole cut out for the hanger hook, and NotebookLM condensed all of those, highlighting that this was a top tip that I should definitely include. On request, it also included each speaker's name next to a given tip so I never had to go searching around for who said what, or risk misattributing something. NotebookLM made summarizing, organizing, and attributing all of this material so much easier than if I had spent hours going through the transcripts and highlighting everything myself.\n    \n            \n            \n                                        Credit: Google/Lindsey Ellefson\n                    \n    \nAnother benefit: Unlike ChatGPT, I didn't feel gross about using this chatbot, as it wasn't exploiting the work of others or risking producing questionable results or full-blown hallucinations—all out its output was based on my own hard-won input. I did the work of formulating questions, finding sources, and conducting interviews. The chat program just helped me organize it all so I could use it to turn the quotes and information into useful, actionable stories. (Note that at no point did I ask AI to help me draft articles—I used it for backend organization only.)In the months since, any time I've had a large volume of materials to work through to complete a given task, NotebookLM has been a useful tool. I sometimes use the chat feature to ask it for summaries, main ideas, or outlines of my notes, but I most often employ it to pull out quotes or standout concepts. It has helped me become a much more organized, efficient writer.How I use NotebookLM in my daily life As long as there are relevant, concrete materials available to upload to the tool, you can NotebookLM for other purposes as well. I think of it like relying on a single source of truth (SSOT), an older productivity hack that involves putting all the materials related to a certain project into one computer folder—but better, because in addition to giving you space to store all your resources, NotebookLM can organize them for you. Personally, I've uploaded copies of my schedule and asked the tool to outline my travel and time commitments for the week. (Not everything you input has to be a file or link. There is a plaintext option where you can just type out whatever you need the bot to know.) But you can get much more creative with it. Say you're looking for a new job. You might upload a job description and ask the NotebookLM chatbot to prepare 20 potential interview questions you might face. Or go farther: Upload relevant news articles about a prospective employer's culture, recent scandals, milestones, or the latest investor report, and use all of that to gain an overview of the company. The more information you provide, the more useful the output will be—and again, it will only pull from those sources, meaning you should be able to trust its summaries. To make sure of this, I periodically test the chatbot (because I'm a suspicious person). I'll ask it about a totally unrelated topic that I know isn't in the materials I uploaded, and so far, it has always told me my question is \"interesting,\" but that there is no reference to it in the provided resources. Other possible use cases could include summarizing meeting transcripts, asking it to suggest meaningful themes in your recent journal entries, or outlining a five-year plan for your career. Your options are almost endless, and bound only by the quality and volume of the source material you upload. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n                        \n                \n                    \n                                            \n                \n                \n                                            \n    More by Lindsey\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                \n                                                \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Google’s NotebookLM AI Chatbot Became My New Study Buddy",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7HNJKYS0WF9X9CV4653YWV5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-15T13:00:00.000Z",
      "dateModified": "2025-10-15T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "That Coinbase Text Is a Scam",
    "url": "https://lifehacker.com/tech/dont-fall-for-this-coinbase-scam-text?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8679QZN2MB3K2HG7THDFG7Q/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-22T15:00:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Unless you requested a 2FA code, that text isn't from Coinbase.\n    \n        \n    \n                                        \n        \n        \n        October 22, 2025\n                    \n            Credit: miss.cabul/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Scammers are now sending fake Coinbase authentication codes to targets, complete with phone numbers to contact \"support.\"\n                                            If you receive one of these texts, and you did not request a 2FA code, don't respond to it.\n                                            Phishing texts can be dangerous, so just delete the message and report it as spam.\n                                    \n            \n    Table of Contents\n    \n        \n        As a rule of thumb, if you receive an unsolicited text, especially one claiming to include a security code, it's likely part of a phishing scheme. Such is the case with a recent spate of unprompted texts purporting to be from the crypto wallet service Coinbase. If you receive such a message, even if you have a Coinbase account, delete it. Someone is likely trying to scam you. Coinbase isn't texting you Here's how the scam works: You receive an unsolicited text message that reads \"Your Coinbase withdrawal code is...\" followed by a six-digit number. The message continues: \"Please do not share this code with anyone. If you have no requested this, please call:\" followed by a phone number and a reference number. On the surface, this seems like a fairly standard two-factor authentication (2FA) code. Most companies include a similar warning in their messages when sending along your code, as hackers really want you to give them those digits. In many cases, a 2FA code the only thing standing between them and your account, so companies want to ensure you don't hand yours over to someone else.\n        \n            You May Also Like\n        \n    \nUnfortunately, this text is an example of the opposite: a scammer impersonating the language of a legitimate company in order to gain your trust. The hope on the scammer's part is that you receive this text and assume that it's real, but worry, because you know you didn't request a 2FA code. Since you now trust that the message really is from Coinbase, you might turn to the contact number conveniently included with the message to follow up. Hey, they've even attached a reference number, so the \"Coinbase rep\" you talk to can track your issue. How considerate. In reality, this is one big scam. If you called the number, the scammer will likely continue the charade, perhaps by assuring you that they'll help secure your account. My guess is that the scammer would ask you to \"verify\" your Coinbase login credentials, which they would enter on their end, triggering the legitimate 2FA process. Once you receive that code, the scammer might ask you to tell them what it is as part of verification process. But once they have that code, they can log into your account for real, change the password, and lock you out. Bye bye crypto. If you're a Coinbase user, this definitely seems concerning, but don't worry too much: I've been getting these scam texts myself, and I don't have a Coinbase account. While scammers might be targeting Coinbase users who have had their information leaked in data breaches, it's more likely they're simply sending these scam texts to leaked phone numbers en masse. They'll likely snag some anxious Coinbase users in their net, but I'm sure they'd happy \"chat with\" anyone who doesn't have a Coinbase account who happens to call, too. \"Oh, you don't have a Coinbase account? No problem, we'll get this cleared up for you. Can you just confirm your Social Security number for us, so we can make sure you're really not in our system?\"What to do when you get a suspicious textsIt can be tempting to respond to these texts once you know they are scams, especially when the goal is to simply waste the scammer's time. But as fun as that can be, my advice is to ignore these texts whenever you receive them. While the immediate risks are diminished once you know the \"rep\" is really malicious, responding to these texts lets the scammer know your number is active, and, in response, they might file it away for a future scam attempt. Scammers can also be clever. If you're not careful, you might give away more information than you realize while you're \"messing\" with them. Part of a phishing scheme is establishing a rapport: The scammer wants to lull you into a false sense of security so you give them personal details that might help them steal your info or break into accounts.  The best thing you can do is to delete these texts whenever you receive them. If your messaging app of choice gives you the option to report the text as spam, all the better.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "That Coinbase Text Is a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8679QZN2MB3K2HG7THDFG7Q/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-22T15:00:00.000Z",
      "dateModified": "2025-10-22T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Samsung Galaxy Z Flip7 FE Just Hit Its Lowest Price Ever",
    "url": "https://lifehacker.com/tech/samsung-galaxy-z-flip-7-fe-sale?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7Q4BQTGE1CH3N3HYK6HKF45/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-16T19:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Samsung Galaxy Z Flip7 FE Just Hit Its Lowest Price Ever",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7Q4BQTGE1CH3N3HYK6HKF45/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-16T19:00:00.000Z",
      "dateModified": "2025-10-16T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This JBL PartyBox Speaker Is Over $100 Off Right Now",
    "url": "https://lifehacker.com/tech/jbl-partybox-110-bluetooth-speaker-sale?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8324HG7F6TCP1RKTQE81EN5/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-21T13:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This JBL PartyBox Speaker Is Over $100 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8324HG7F6TCP1RKTQE81EN5/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-21T13:30:00.000Z",
      "dateModified": "2025-10-21T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "My Favorite Amazon Deal of the Day: These Soundcore Sleep A30 Earbuds",
    "url": "https://lifehacker.com/tech/my-favorite-amazon-deal-of-the-day-soundcore-sleep-a30-earbuds?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K86BAKHX97TF4RK3FTKDRF49/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-22T17:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "My Favorite Amazon Deal of the Day: These Soundcore Sleep A30 Earbuds",
      "image": [
        "https://lifehacker.com/imagery/articles/01K86BAKHX97TF4RK3FTKDRF49/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-22T17:30:00.000Z",
      "dateModified": "2025-10-22T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta’s Upcoming AI Parental Controls Are Too Little, Too Late",
    "url": "https://lifehacker.com/tech/meta-ai-parental-controls-too-little-too-late?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7SXX823924BX5S4K387CJGH/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-17T21:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta’s Upcoming AI Parental Controls Are Too Little, Too Late",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7SXX823924BX5S4K387CJGH/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-17T21:30:00.000Z",
      "dateModified": "2025-10-17T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Limit How Many YouTube Shorts You Watch in a Day",
    "url": "https://lifehacker.com/tech/youtube-shorts-limit-added?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K86HEEV4RQYJDEHXN6QQ82K4/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-22T19:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Limit How Many YouTube Shorts You Watch in a Day",
      "image": [
        "https://lifehacker.com/imagery/articles/01K86HEEV4RQYJDEHXN6QQ82K4/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-22T19:30:00.000Z",
      "dateModified": "2025-10-22T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "When It's Best to Study in Silence (and When a Little Noise Is OK)",
    "url": "https://lifehacker.com/why-you-should-always-study-in-silence-according-to-sc-1850843477?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GPDPA1AQJ276G054WK42S/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-20T12:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "When It's Best to Study in Silence (and When a Little Noise Is OK)",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GPDPA1AQJ276G054WK42S/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-20T12:00:00.000Z",
      "dateModified": "2025-10-20T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Is the iPhone 17 Pro’s ‘Colorgate’ Worth Worrying About?",
    "url": "https://lifehacker.com/tech/iphone-17-pro-colorgate?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K86FFEMN3QQQ128NQKYKGV43/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-22T19:00:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Is your orange iPhone turning pink?\n    \n        \n    \n                                        \n        \n        \n        October 22, 2025\n    \n            Credit: Evolf/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Some users are reporting their Cosmic Orange iPhone 17 Pros are turning pink.\n                                            Viral posts on social media show discoloration on the orange-coated aluminum of some iPhone 17 Pros.\n                                            While it's not clear why this is happening, there isn't enough evidence yet to suggest this is a widespread issue.\n                                    \n            \n    Table of Contents\n    \n        \n        If you're looking to buy a new iPhone 17 this year, not only do you have a number of models to consider, you also have a number of colors to choose from. But some users who opted for the iPhone 17 Pro and 17 Pro Max are claiming that the color they picked isn't the color they see today. According to these users, their iPhones have changed color over the short period of time they've owned them. Obviously, the internet has dubbed the issue \"colorgate.\" Apple is no stranger to \"gates,\" of course, especially when it comes to the iPhone: There was \"antennagate,\" when the iPhone 4's redesigned antennas reported caused cellular connection issues; \"bendgate,\" when the iPhone 6 Plus was prone to physically bending; and most recently, \"scratchgate,\" where the aluminum on the iPhone 17 Pro Max appeared susceptible to scratching easily.Now, colorgate is here to further draw criticism to the 17 Pro and 17 Pro Max. Customers such as DakAttack316 on Reddit are claiming their Cosmic Orange iPhone 17 Pros are turning pink—or, if you want to give it an \"Apple label,\" rose gold. It's tough not to see the reason this would bother people: Apple's advertisements for the Cosmic Orange iPhones highlight a vibrant and striking orange. The iPhone in the photos from DakAttack316 looks more sunburnt than anything else. The wireless charging pad remains a somewhat bright orange, but the aluminum has taken on a salmon hue. The orange accents throughout the phone also seem to have been affected, with some looking faded or dirty. Maybe if the entire iPhone was all one pinkish hue, it wouldn't look so bad, but the variety of colors visible in the photo make it look damaged.\n        \n            You May Also Like\n        \n    \nDakAttack316's might be among the most viral accounts of the issue, but they aren't alone. Take this post for instance: The issue isn't quite as pronounced, but you can clearly see how faded the orange metal is, especially when directly compared to another Cosmic Orange iPhone 17 Pro Max. Meanwhile, this viral TikTok shows some more selective discoloration on different elements of an iPhone 17 Pro. \nIt's not clear what is causing these issues, or how many Cosmic Orange iPhone 17 Pros are affected. Some theories suggest that using the wrong type of solvent to clean your iPhone, such as bleach or hydrogen peroxide, could be causing or contributing to the discoloration, since Apple says these chemicals shouldn't be used on iPhones. (Even if that isn't the case, it's always good practice to abstain from treating your devices with cleaning solutions unless the manufacturer has officially approved those chemicals.)\n            \n                What do you think so far?\n            \n        \nShould people stop buying the iPhone 17 Pro in Cosmic Orange?No. We don't know why this is happening yet, or how widespread the issue is, but if a statistically significant number of Cosmic Orange iPhones were having this issue, you'd likely be seeing a lot more complaints than you are at the moment—especially considering the iPhone 17 Pro and iPhone 17 Pro Max are selling better than expected.Maybe these users were treating their iPhones with harsh chemical cleaners; perhaps a small number of Cosmic Orange iPhones have a manufacturing defect. Whatever the cause turns out to be, it doesn't appear to be something afflicting the majority of the devices. Compare these two Reddit posts showing off pink Cosmic Orange iPhones, with this thread of users who are happy with their color choice. It's all anecdotal evidence, of course, but for the moment, I'm just not seeing very many users complaining about sunburnt iPhones.If you do buy a Cosmic Orange iPhone 17 Pro, and it does turn pink, take it to Apple or your carrier. So long as you didn't clean it with bleach, the company will almost assuredly swap it out for you—hopefully for a device that won't fade with age.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Is the iPhone 17 Pro’s ‘Colorgate’ Worth Worrying About?",
      "image": [
        "https://lifehacker.com/imagery/articles/01K86FFEMN3QQQ128NQKYKGV43/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-22T19:00:00.000Z",
      "dateModified": "2025-10-22T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Global AWS Outage Is Over, but There's Still Cause for Concern",
    "url": "https://lifehacker.com/tech/global-aws-outage-fixed?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K80W0C7NFQRAP9GYQ5X4ACWK/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-20T14:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global AWS Outage Is Over, but There's Still Cause for Concern",
      "image": [
        "https://lifehacker.com/imagery/articles/01K80W0C7NFQRAP9GYQ5X4ACWK/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-20T14:00:00.000Z",
      "dateModified": "2025-10-20T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]