[
  {
    "title": "Meta’s Upcoming AI Parental Controls Are Too Little, Too Late",
    "url": "https://lifehacker.com/tech/meta-ai-parental-controls-too-little-too-late?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7SXX823924BX5S4K387CJGH/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-17T21:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta’s Upcoming AI Parental Controls Are Too Little, Too Late",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7SXX823924BX5S4K387CJGH/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-17T21:30:00.000Z",
      "dateModified": "2025-10-17T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sora Will Soon Let You Make Cameos of Your Pets",
    "url": "https://lifehacker.com/tech/sora-will-soon-let-you-make-cameos-of-your-pets?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K88X6MG6FCTN6RWNDDSNGQ9B/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-23T17:00:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Meanwhile, the app is also on its way to Android.\n    \n        \n    \n                                        \n        \n        \n        October 23, 2025\n                    \n            Credit: OpenAI\n                            \n            \n                Key Takeaways\n                                            Sora, OpenAI's short-form AI video platform, is getting some new features in coming days.\n                                            Bill Peebles, head of Sora, says you'll soon be able to make cameos of just about anything you want, including pets and toys.\n                                            You'll also be able to use light video editing tools to stitch two clips together.\n                                            The app is currently iPhone-only, but is coming to Android soon.\n                                    \n            \n    Table of Contents\n    \n        \n        Sora, OpenAI's short-form AI video platform, has been available for iPhones for the past few weeks. Users have spent that time generating hyper-realistic vertical videos that, despite their watermarks, might already be fooling people on the internet. I, for one, see nothing good about a tool that can make these types of videos from simple prompts, perhaps outside the sheer novelty alone. But the app is undeniably popular, and, as expected, OpenAI is continuing to \"improve\" it. On Wednesday, the head of Sora, Bill Peebles, shared a roadmap of updates coming to the app, from cameos for your pets to video editing tools. Sora will soon let you make cameos of anything you wantPeebles says that \"character cameos\" are on their way in the coming days. When this feature drops, you'll be able to make cameos of just about anything you want, including your pets (Peebles suggests your dog or guinea pig), stuffed toys, as well as AI-generated characters Sora may have produced in your past videos.  \n        \n            You May Also Like\n        \n    \nCameos are a defining, and controversial, Sora feature. It lets you scan your likeness into the app so you can create videos featuring yourself. Not only that, you can remix videos with cameos of anyone else who has scanned themself into Sora—assuming their permissions allow you to use their cameos. It's impressive tech, but it raises major ethical concerns, considering you can make someone else do or say things they never signed off on. Now, apparently, you'll also be able to do the same with the family cat or your childhood stuffed animal. Following these additional cameo options, Peebles says you'll be able to see \"the latest trending cameos in real time.\" I'm guessing the idea is to browse the most popular cameos on the platform, and, if you want to, add them to your own videos. Sora is also getting basic video editing tools. According to Peebles, this starts with the ability to stitch multiple clips together, though other \"powerful new features\" will follow. Peebles says the Sora team is also working on reducing \"excessive moderation,\" which he acknowledges is \"super annoying\" to users, as well as improving the app's performance.Speaking of apps, Android users will soon have their chance to try Sora. Right now, the app is iOS-only, but Sora's Android version is \"actually coming soon,\" Peebles says.  A reminder to be wary of what you see on the internetAs critical and cynical as I am about Sora and services like it, I can see the utility here. I imagine people will get a kick out of being able to put their pets in any situation they want. And if they want to make fried eggs sing a song, or a stuffed animal say \"hello,\" more power to them. But my main concerns with this app are not assuaged by any of these updates: Sora still lets you generate convincing videos with a simple prompt, with the only safeguard a watermark that's easy to remove if you know where to look. People were already falling for fake videos on the internet before these tools came along; now, it's becoming way too difficult to know whether what you're watching is actually real or not. If you ask me, you're better off assuming all of it is fake.Disclosure: Lifehacker’s parent company, Ziff Davis, filed a lawsuit against OpenAI in April, alleging it infringed Ziff Davis copyrights in training and operating its AI systems.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sora Will Soon Let You Make Cameos of Your Pets",
      "image": [
        "https://lifehacker.com/imagery/articles/01K88X6MG6FCTN6RWNDDSNGQ9B/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-23T17:00:00.000Z",
      "dateModified": "2025-10-23T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steam's Calendar View Is a Convenient and Personalized Way to Track New Games",
    "url": "https://lifehacker.com/tech/steams-calendar-view-is-the-best-way-to-make-sure-you-dont-miss-new-games?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K868HAEN1NM914DERVP9N3XP/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-22T16:30:33.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Finally, a way to check upcoming Steam Games without looking at the \"Popular Upcoming\" tab.\n    \n        \n    \n                                        \n        \n        \n        October 22, 2025\n    \n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            Steam's Personal Calendar shows you upcoming games in a handy calendar view.\n                                            Games shown depend on your wishlist and recent playtime.\n                                            You can customize what's displayed based on tags.\n                                    \n            \n    Table of Contents\n    \n        \n        One of my favorite tabs to check when I'm looking at new PC Games on the Steam Store is \"Popular Upcoming,\" but over the years, it's gotten far less useful. While it's supposed to show me what the next big game is ahead of time, the truth is, there are just too many games and too many types of players out there for it to keep up anymore. My tastes probably aren't the same as yours, and limiting the highlights to a small selection of popular picks could bury smaller titles some players might be more interested in. That's why I'm so excited about Steam's new Personal Calendar page.Released last night, it's technically an experiment, but it's already looking great. Essentially, rather than showing you a generic list of ten games like the Popular Upcoming tab (I have no idea how Valve picks those games, by the way), this instead shows you a personally curated selection of recently released and upcoming games, organized on a daily calendar, and up through the next eight weeks. The specifics depend on how you customize it, but already, it's far more useful for me than the Popular Upcoming tab.To check it out, either click here for the web version or open your Steam desktop client, and next to the search bar, navigate to Special Sections > Steam Labs > 016 Personal Calendar.\n        \n            You May Also Like\n        \n    \nWhen you first open the calendar, you'll see 100 games, split across titles released last month, titles released in the last seven days, and titles that aren't out yet. At time of writing, I currently see suggested games through Dec. 12, which gives me a pretty good window of what to look forward to. If you're eagle-eyed, you might notice that the Personal Calendar excludes weekends, which Valve says is because most games don't release on weekends. If a game Valve wants to suggest does release on a weekend, it'll instead show up on the following Monday.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nAs for the curation, I'm satisfied. Unlike the Popular Upcoming tab, the Personal Calendar uses a combination of your wishlist and your playtime in certain games to decide what to show you, making for a list that's catered to your tastes. Lately, I've been playing a lot of platformers and RPGs, and low and behold, my Personal Calendar opened right up to suggestions like Final Fantasy Tactics: The Ivalice Chronicles and Dragon Quest I & II HD-2D Remake. These are bigger titles, but there are smaller choices I might have otherwise overlooked peppered in, and it already seems like a great way to make sure I don't miss out on a game I'd like. I even appreciate the heads-up about recently released games, which are easy to think about once and then forget.\n            \n                What do you think so far?\n            \n        \nThe one criticism I have is that the default of 100 games looks a little overstuffed to me. Luckily, you can slim down your suggestions to anywhere from ten to fifty games (at the top of the page, under Game Count), which also has the benefit of narrowing down the algorithm to only show you what it thinks you'd enjoy most. Or, if you want to see as many options as possible, you can also have the calendar display 250 or 500 games. There are also controls to only show games with specific tags, and also to exclude games you've wishlisted or already own.Essentially, the Personal Calendar feels like a personalized and easy-to-check version of those \"Biggest Game Releases of the Month\" videos, except you don't need to constantly rewind or pull up the video again whenever you're looking for what to play next. Valve says your Calendar's algorithm gets re-trained daily, though, so don't expect to always see the same games on it every time you check it. If you see a game you're interested in but aren't ready to pull the trigger on yet, wishlisting it is still your best bet.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steam's Calendar View Is a Convenient and Personalized Way to Track New Games",
      "image": [
        "https://lifehacker.com/imagery/articles/01K868HAEN1NM914DERVP9N3XP/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-22T16:30:33.000Z",
      "dateModified": "2025-10-22T16:30:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Upcoming Google Photos Feature Turns Your Selfies Into Memes",
    "url": "https://lifehacker.com/tech/google-ai-meme-generator-from-selfies?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K894008RZ7X8M2CYX18MBCC9/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-23T19:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Upcoming Google Photos Feature Turns Your Selfies Into Memes",
      "image": [
        "https://lifehacker.com/imagery/articles/01K894008RZ7X8M2CYX18MBCC9/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-23T19:00:00.000Z",
      "dateModified": "2025-10-23T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft Teams Will Soon Tell Your Boss When You're Not in the Office",
    "url": "https://lifehacker.com/tech/microsoft-teams-will-let-your-boss-know-when-youre-not-in-the-office?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BDF03ZQK8WBMVP6C7F66FK/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-24T16:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft Teams Will Soon Tell Your Boss When You're Not in the Office",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BDF03ZQK8WBMVP6C7F66FK/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-24T16:30:00.000Z",
      "dateModified": "2025-10-24T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why You Should ‘Eat the Frog’ First Thing in the Morning",
    "url": "https://lifehacker.com/eat-the-frog-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GNJPPQER0BNX0MMSX8XCE/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-24T12:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why You Should ‘Eat the Frog’ First Thing in the Morning",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GNJPPQER0BNX0MMSX8XCE/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-24T12:30:00.000Z",
      "dateModified": "2025-10-24T12:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How I Used Smart Glasses to Trick a Bartender Into Giving Me a Free Drink",
    "url": "https://lifehacker.com/tech/used-smart-glasses-to-trick-a-bartender?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BY594J33K2J5Q3D41GQHPD/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T21:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            I can use my glasses to do crime! Who's the nerd now?\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n                    \n            Credit: Stephen Johnson\n                            \n    Table of Contents\n    \n        \n        I recently reviewed Even Realities G1 smart glasses (they're very cool) and the first real-world thing I used them for was scamming someone. I told a local bartender I had an encyclopedic knowledge of film, and I would answer the hardest movie trivia question he could come up with in exchange for a drink. After a short consultation with Google, dude came back with \"Who directed 1922's Cabinet of Dr. Caligari?\"I tilted my head thoughtfully and repeated the question as if verifying I heard him right. The AI agent silently did its thing, and in about three seconds, the answer was floating before my eyes, totally invisible to everyone around me. \n    \n            \n            \n                                        Credit: Stephen Johnson\n                    \n    \n\"Robert Wiene?\" I asked, feigning uncertainty. Boom! Free drink. It's not the hardest trivia question, but I could have answered literally anything: the date Dr. Caligari was released, the day of the week it was, or the weather that day—all short work.  \n        \n            You May Also Like\n        \n    \nBartenders know to be wary of bar bets, so this one was watching me like a hawk to make sure I wasn't looking up the answer on my phone or something. He didn't seem to suspect my glasses, and even if he had, it wouldn't have mattered. Even inspected up close, G1s offer no indication of electronics of any kind: No USB port, no flashing light, no visible controls. The AI agent is activated with a subtle tap behind the ear. Repeating the question sends the AI off for the answer, presented in a display that's invisible to everyone but the wearer. You could do the same trick with a pair of Meta Ray-Ban Display glasses or audio-only smart glasses with AI.I don't like deceiving people, so I ended up telling the bartender what was up to and not accepting the drink, but it got me thinking about what more nefarious people than I could do (and probably already are) with AI smart glasses.Just imagine what I did on a bigger level: a team of hustlers at bar trivia silently tapping their temples whenever “which actor played…?” was asked would never lose. It's pretty small stakes, but not hard to imagine. Hypothetically, a hacked pair of smart glasses could be programmed to read the cards in your poker hand and give you the probability of winning in real time, either through the display or whispered in your ear. They could, hypothetically, make counting cards in blackjack effortless and undetectable. Stretching it out further, hypothetically, glasses could scan others players for \"tells\" that they're bluffing, or read micro-expressions to give a constantly updated read on opponents. Along the same lines, imagine attending a self-help meeting, and the leader, who you have never met, says, \"I've had a vision about you\" and begins to describe something that happened in your life exactly. All it would take would be glasses that recognize your face (supposedly coming to Meta Displays) connecting to a social media feed, which is then displayed in real time to the leader. Or you could go more subtle and engineer small \"serendipities\" like mentioning a movie someone recently saw and having exactly their opinion. It would only take a few of these and maybe some mystical patter to convince people you are divine being they should definitely donate to.How to spot tricky smart glassesI could go on, but you get the idea. Luckily, there are some indications when someone is using tech hidden in their eyeglasses. The most important is a general understanding of the possibilities of this technology. If someone seems to know something they shouldn't, ask yourself if their glasses could be the source of their power. Here are some more specific giveaways.Look for identifiable kinds of smart glasses\n    \n            \n            \n                                        Credit: Meta\n                    \n    \nThe most popular display style glasses, Meta Ray-Ban Displays, are distinctive looking, with a fairly obvious camera in one of the corners and a specific look and branding. But other kinds of smart glasses, like the Even Realities G1s mentioned above, are obscure enough that most won't recognize them, and so \"normal\" looking that most people wouldn't pick them out of lineup.Look for where the tech is hiddenMost smart glasses are still fairly bulky, so look for thick arms or frames where the wires are hidden. But again, that's only most smart glasses; some are totally sleek, with imperceptible tech.Look for a small glint In most situations, the display in display glasses is not visible to anyone but the glasses wearer, but there's still light being projected. In a dark room, you can see a green glow, and even if it's not dark, the display windows are visible if the light hits it just right, as you can see here:\n    \n            \n            \n                                        Credit: Stephen Johnson\n                    \n    \nBut honestly, it's subtle and hard to spot. Listen for the soundsOlder styles of audio-only smart glasses can feed information to wearers, but the open-air speakers mean some sound is bleeding into the atmosphere. You can definitely hear smart glasses if you're in a quiet room and you're trying to. If it's loud, operating glasses becomes problematic for the wearer.Look for the source of controlSmart glasses have to be controlled somehow. Meta Display glasses are operated with a wrist band. G1 glasses' AI agent is powered on by tapping on the frames behind your ear. Anyone who practices for a few hours could make these movements seem natural, but they're there if you know what to look for. Odd movements and speechIt doesn't take advanced stagecraft to operate these kinds of glasses imperceptibly, but it does take something. Tells might include small glances upward to see the display, tapping on glasses, stilted speech while waiting for information to come in, and a reading-a-teleprompter style of talking. Watch for people repeating questions back. But understand, it's hard to spot. When I was conning my bartender, I thought how I repeated the question back was obvious, but my wife said I just seemed a little odd, which suits the personality of a trivia whizz anyway. Smart glasses are powerful tools, like a hammer or a calculator. Like any innocent tool, they can be used for nefarious things, so until manufacturers or regulators require obvious indicators, like flashing lights or visible controls, we have to protect ourselves by paying attention to these small cues and staying skeptical when someone seems to know more than they reasonably should.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How I Used Smart Glasses to Trick a Bartender Into Giving Me a Free Drink",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BY594J33K2J5Q3D41GQHPD/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T21:30:00.000Z",
      "dateModified": "2025-10-24T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI's New Web Browser Comes With Some Serious Security Risks",
    "url": "https://lifehacker.com/tech/what-to-know-about-openais-new-chatgpt-web-browser?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K86PZ6Z797NMX3THWRPX0VAK/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-22T21:00:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            \"ChatGPT Atlas\" is officially here. But should you use it?\n    \n        \n    \n                                        \n        \n        \n        October 22, 2025\n                    \n            Credit: OpenAI\n                            \n            \n                Key Takeaways\n                                            ChatGPT Atlas, OpenAI's web browser, is officially here.\n                                            The browser comes with ChatGPT integration, including memory, assistance, and agent mode.\n                                            Agent mode can perform tasks on your behalf, but that poses risks to your security and privacy.\n                                    \n            \n    Table of Contents\n    \n        \n        OpenAI has officially entered the browser wars. On Tuesday, the company announced Atlas, a new web browser with ChatGPT integration. At the moment, it's Mac-only, but I wouldn't recommend even my Apple friends jumping on board immediately—at least not without understanding the underlying risks. Atlas' AI web browsing\nIf you've already used other AI browsers, like Perplexity's Comet, Atlas is going to feel familiar. In fact, that's also likely true if you've used any web browser before: Atlas is built on Chromium, the engine that powers browsers like Google Chrome, Microsoft Edge, and Opera. That means the core mechanics of Atlas are fairly standard; there's nothing particularly revolutionary happening here when it comes to sorting tabs or the browsing experience itself. The same is true when it comes to some ChatGPT interactions. As with other AI browsers, ChatGPT is assigned to the sidebar of the browser window. You can call it up by clicking on the \"Ask ChatGPT\" button, where you can ask it questions about the content you're currently browsing. You can also ask ChatGPT for writing assistance any time you enter an open text field in the browser. \n        \n            You May Also Like\n        \n    \nLike Comet, Atlas has an agent mode, but the latter's is built off the existing ChatGPT agent. The idea is that you can task Atlas with performing functions on your behalf. So, rather than pulling up DoorDash's website and ordering yourself dinner, you could ask Atlas to order dinner for you. You can even watch Atlas get to work, and see its thinking behind each decision. OpenAI has other ideas for how to use Atlas' agent mode, including giving the browser a recipe to shop for, or asking the bot to run through team documents at work to generate a brief. Deeper ChatGPT integration is what might set Atlas apart from the competition. If you're a regular ChatGPT user, you'll probably appreciate it having that contextual awareness of your past conversations—if you've already asked ChatGPT about a topic, and you're currently researching it in a browser window, you can pick up the conversation and assume ChatGPT will remember what you've already talked about.        \n    \n            \n            \n                                        Credit: OpenAi\n                    \n    \nSimilarly, Atlas will track your browsing and activity history and call upon it in future sessions. Perhaps you'll open your browser to find personalized suggestions on which sites and topics to explore next. Does that sound creepy? Absolutely. But if you're someone who doesn't mind the privacy trade-off, there could be some benefits there. In OpenAI's announcement, it suggested asking Atlas to pull up all the job postings you looked at last week, and produce a summary of industry trends to use in interview prep. If you find that these memories are a bit too much for you, you can disable them from the browser settings. (OpenAI says deleting your browsing history also deletes associated browser memories, and the browser's incognito window logs you out of ChatGPT.)The company includes a setting called \"ChatGPT page visibility,\" which lets you control whether ChatGPT can actually see the webpage you're visiting. If you choose \"Not Allowed,\" you can block the bot from seeing what you're doing, which is good. But then again, doing that defeats the purpose of Atlas a bit. If you don't want ChatGPT seeing what you're doing, you might as well use a browser that doesn't have ChatGPT built right into it. (The company does promise it won't train ChatGPT on your browsing data unless you opt into it, but why would you do that?)Is Atlas safe to use?\n    \n            \n            \n                                        Credit: OpenAI\n                    \n    \nI'm of the opinion that if the safety of a browser is in question, it's best not to bother with. That's the case with Atlas, as well as other AI browsers. The main issue with browsers that incorporate AI agents is that they are susceptible to indirect prompt injection attacks. Brave has done a lot of research on this subject, particularly with Comet. In short, bad actors can potentially hide malicious instructions on websites that the AI agents see as no different from a typical user request. Because the browser is designed to act on your behalf, these malicious instructions can command the AI to do things you definitely don't want it to do. You might ask Atlas to summarize a webpage, but because a bad actor hid a command to do something involving your email, bank account, or corporate intranet on the site, it does that instead. To OpenAI's credit, the company has compiled a list of safeguards to mitigate risks with Atlas. Atlas cannot run code directly in the browser, nor can it download files or install extensions. The browser has no way to access other apps on your Mac, nor its file system. If agent mode needs to access sensitive sites, like your bank, it'll pause to make sure \"you're watching.\" To that point, you can use Atlas' agent in logged out mode, which limits its ability to access sensitive data or take actions \"as you\" on websites. But even OpenAI admits that after thousands of hours of testing, their safeguards \"will not stop every attack that emerges as AI agents grow in popularity.\" The company says it'll patch new vulnerabilities as it finds them, but if bad actors find them first, they might trick these AI agents into doing some terrible things.To me, the risks currently far outweigh the benefits. I don't yet see much reason to have a bot in my browser do things on my behalf, but even if I did, I wouldn't use it just yet. The risk that someone injects a website with a malicious command and derails my AI agent—and my digital life—is too great, especially when I can book those flights or order that delivery on my own without issue.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI's New Web Browser Comes With Some Serious Security Risks",
      "image": [
        "https://lifehacker.com/imagery/articles/01K86PZ6Z797NMX3THWRPX0VAK/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-22T21:00:00.000Z",
      "dateModified": "2025-10-22T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Beats Studio3 Are Just $89 Right Now",
    "url": "https://lifehacker.com/tech/beats-studio3-headphones-deal?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K86HNSHW75RRPKW8DFFM87D7/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-22T18:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Beats Studio3 Are Just $89 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01K86HNSHW75RRPKW8DFFM87D7/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-22T18:30:00.000Z",
      "dateModified": "2025-10-22T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "When It's Best to Study in Silence (and When a Little Noise Is OK)",
    "url": "https://lifehacker.com/why-you-should-always-study-in-silence-according-to-sc-1850843477?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GPDPA1AQJ276G054WK42S/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-20T12:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "When It's Best to Study in Silence (and When a Little Noise Is OK)",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GPDPA1AQJ276G054WK42S/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-20T12:00:00.000Z",
      "dateModified": "2025-10-20T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Actually Counts As ‘Moderate Exercise’",
    "url": "https://lifehacker.com/health/what-counts-as-moderate-exercise?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HYBNJME1N6DCMKBMC062VPRX/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-21T21:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Your’re supposed to get 150 minutes of it per week, but how do you know when you're doing it?\n    \n        \n    \n                                        \n        \n        \n        October 21, 2025\n    \n    We may earn a commission from links on this page.\n    \n            Credit: MIA Studio - Shutterstock\n                            \n    Table of Contents\n    \n        \n        Exercise is a healthy and, one might argue, necessary part of our lives. The guidelines from public health organizations tell you to aim for at least 150 minutes of “moderate” exercise each week, and that each minute of “vigorous” exercise counts double. That raises the question: What the hell is “moderate” exercise? How do you know when you’re doing it? Scientists measure METs, but you don't have to If you have any kind of smartwatch or fitness tracker, it may try to tell you that \"moderate\" exercise occurs at a certain heart rate. This isn't actually the case. The scientists who came up with the exercise guidelines didn't use heart rate as their guide. Instead, they used charts that measured how many \"METs,\" or metabolic equivalents, each type of exercise requires. I'll explain more about METs below, but the important thing to know is that the type and intensity of exercise is what tells you whether it's moderate, not your heart rate while you're doing it. You can look up exercises on a chart like this one, but here's the basic idea: \n        \n            You May Also Like\n        \n    \nWalking is moderate, jogging or running is vigorous.Bicycling is moderate if it’s under about 12 miles per hour on the flat.Indoor cycling is moderate if it’s up to about 100 watts of power.All that said, you don’t have to overthink it. The guidelines that mention “moderate” and “vigorous” activities aren’t asking you to monitor your heart rate or any other numeric metric. They want you thinking in terms of generalities: walking versus running, leisurely bike commuting versus sweating your heart out in a spin studio.And honestly, if it’s easier to watch your heart rate than to worry about the above, that’s fine. For most of us, 150 minutes of Zone 2 is going to be at least 150 minutes of moderate exercise. So follow that guideline, and you’ll be an overachiever.It’s not really about heart rateSo why does your watch want to steer you toward a certain heart rate during exercise? Mostly because that's easy to measure. Moderate exercise sorta-kinda matches up to \"zone 2\" cardio, which I’ve previously explained. (Zone 2 is is the second-lowest intensity in a five-zone system, and the easiest way to know which zone you're in is to glance at your fitness watch.)While you can use heart rate zones as a rule of thumb to find moderate exercise, this idea falls short in two ways: (1) different gadgets and systems use different cutoffs to decide which numbers count as \"zone 2\", and (2) for most of us, zone 2 includes most moderate activities but also some vigorous activities. If you’re relatively fit, you can jog at a 12 minute-per-mile pace while keeping your heart rate in zone 2. That’s a “vigorous” activity in terms of METs, though. The other reason heart rate isn’t accurate for this task is that your heart rate changes for all kinds of reasons. The hotter it is when you're working out, the higher your heart rate tends to be. Same goes for when you’re nervous or stressed. And as you get fitter, you’ll be able to do the same activities at a lower heart rate. Those activities might feel easier than they used to, but they’re not any less work. What is a MET, anyway?One MET is the energy expended when you’re at rest—the amount of oxygen, calories, etc that it takes to keep you alive and breathing. (We use oxygen in the process of burning calories, so officially a MET is 3.2 milliliters of oxygen per kilogram of body weight per minute.) Researchers can then put a mask on a person and measure how much oxygen they use while running, walking, playing guitar, etc. If an activity takes twice as much oxygen as sitting still, they say it takes two METs. Here are a few examples (taken from this scientific paper): \n            \n                What do you think so far?\n            \n        \n2 MET: washing dishes, or playing croquet3 MET: walking at 3 miles per hour (a pretty typical walking pace)4 MET: table tennis, ice skating5 MET: modern dance, fast-paced ballroom dance6 MET: volleyball, singles tennis7 MET: jogging, jumping ropeThe numbers go up from there. Speed skating clocks in at 15 MET. To be clear, you will not be measuring METs directly when you exercise. The MET studies are done in labs so that we can use the information to get a sense of what MET values each common type of exercise tends to have.Moderate exercise is 3 to 6 MET, and vigorous is 6 or moreThe physical activity guidelines define “moderate” exercise as at least 3 MET, but less than 6. Vigorous is 6 MET or more. Because METs are specific to the activity, not to how fit you are, it makes the most sense to look at METs in terms of the pace you run or the settings you use on your treadmill or other cardio machine. Here are paces and activities that have been clocked as between 3 and 6 METs: Walking at 3-4 mph (a 15-minute to 20-minute mile)Cycling, between 50 to 100 wattsShooting basketsPlaying baseballTaking a low-impact aerobics classAnd these are vigorous (6 or more MET): Race walking (5+ mph) Walking uphillWalking with a 12-pound packJogging (a 12-minute mile is 8.0 MET; the faster you go, the higher the MET)Bicycling at 12 miles per hour or fasterSwimming lapsPlaying a game of basketball, soccer, or hockeySo when you're trying to get your 150 minutes (or more) of moderate exercise each week, you can count all your walking, your easy bike riding, and your low-impact aerobics class. Give yourself credit for vigorous exercise for all the time you spend jogging (at any heart rate), lap swimming, or rucking. You may find you've been doing more exercise than you think.\n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Actually Counts As ‘Moderate Exercise’",
      "image": [
        "https://lifehacker.com/imagery/articles/01HYBNJME1N6DCMKBMC062VPRX/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-21T21:30:00.000Z",
      "dateModified": "2025-10-21T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube Has a New Look on Mobile",
    "url": "https://lifehacker.com/tech/youtube-has-a-new-look-on-mobile?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BHERH2G90G7G5XZK8Z480G/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T19:30:05.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            And there's not a lot you can do about it.\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n                    \n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            YouTube has a new UI on mobile.\n                                            Buttons are bigger and chunkier, and there are some new animations.\n                                            There are extensions for desktop to reverse some of these changes, but not much you can do on mobile.\n                                    \n            \n    Table of Contents\n    \n        \n        Last week, YouTube started rolling out a new look across both the web and its various apps, promising a \"more expressive and intuitive interface.\" In reality, the reaction has been mixed. The TV app, for instance, no longer automatically rewinds or fast forwards when you press back or forward, instead navigating between buttons including \"like\" or \"subscribe.\" More than once while on TV, I've accidentally subscribed to a channel without meaning to, before realizing that I now need to press up first to get to the progress bar.Now, the changes have reached the YouTube mobile app, as first spotted by 9to5Google. While they're a bit more mild than you'll see on TV, there's still a few changes to get used to.Bigger, chunkier icons\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nBy far, the most noticeable new change is YouTube's new suite of icons, which all look like they've been hit with a \"Ctrl + B.\" Compared to the old look, the play, fast forward, and other buttons all look larger and bolder, with the idea being to make them more prominent.\n        \n            You May Also Like\n        \n    \nSome of the buttons have also been consolidated. When watching a video in landscape, buttons that don't affect playback (like, dislike, comment, etc.) all now appear together in a pill in the bottom-left corner, rather than as separate elements.New animationsNew buttons aren't the only change YouTube has in store for you. Seeking videos also has a new animation now, and on some videos, liking now comes with a bit of extra personality.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nThe first is a pretty minor change. Now, when you double tap the screen to either go forward or back 10 seconds, the video will just automatically jump to the new spot and display a big \"-10\" or \"+10,\" rather than showing a quick animation of three arrows disappearing into each other with a smaller \"-10 seconds\" or \"+10 seconds\" below them.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nThe second is a bit cuter. On certain videos, tapping the \"like\" button will now play a custom animation, rather than simply putting some sparkles around a thumbs up. For instance, on a music video, you'll now briefly see a musical note replacing the thumbs up.Pausing no longer darkens your backgroundIt used to be that pausing a video would darken the background until you unpaused it, kind of like lights being lowered on a stage. That's no longer the case. While you'll still see the lights go slightly down while you have controls open, a paused video will now display as normal if you tap again to dismiss the controls. It's a small tweak, but could prove useful for taking screenshots. At the same time, though, I do worry that it might make it easy to think a video has frozen, if you're not paying attention.Nested comments and easier bookmarksFinally, Google has removed a few steps to saving and commenting on videos. Now, hitting the bookmark icon to save a video to a playlist has fewer steps, no longer requiring you to navigate multiple pages. Instead, it'll just pause the video and open a list of your playlists for you, where you can quickly tap the playlist you want to save your video to.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nAdditionally, comments are threaded now, easily showing who is replying to which comment. It's a great way to keep track of the flow of the conversation, although it does make each comment take up a bit of extra space.Can you get rid of the new YouTube UI?Ultimately, I'm a little torn on the new YouTube app. Certain new features, like threaded comments, just make sense to me. But the chunkier buttons do feel like they get in the way a bit to me, and I can't help but think of Fisher-Price when I see them.Unfortunately, there's not a lot you can do if you don't like the new YouTube mobile interface. It's still rolling out, so it's possible you might not see every change yet. But because it's server-side, once it hits you, that's it. Even the web player is getting these changes, so leaving the app behind isn't a viable option.That said, if you're on desktop, users on both Reddit and YouTube itself are putting together extension lists that you can mix and match to customize your experience. Technically, there are browsers for mobile that will allow you to play with these as well, with Firefox being the big one these days. However, I found that most of the suggested extensions no longer worked for me or weren't available for mobile. In that case, if you're sick of how YouTube looks now, you might want to consider an alternate player app instead, like Play. It still relies on embedded videos, so it won't save you from every change, but its overall minimalist style could offer welcome relief from YouTube's increasingly busy design language.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube Has a New Look on Mobile",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BHERH2G90G7G5XZK8Z480G/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T19:30:05.000Z",
      "dateModified": "2025-10-24T19:30:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Working Out in a Weighted Vest Won’t ‘Transform Your Body’ Like the Influencers Say",
    "url": "https://lifehacker.com/health/is-working-out-in-weighted-vests-actually-effective?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8984PJV4FYSM7PAPEM2BYWQ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-23T20:00:54.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Trendy doesn't mean effective.\n    \n        \n    \n                                        \n        \n        \n        October 23, 2025\n                    \n            Credit: Samuel Ponce / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Walk through any park these days and you might spot them: people sporting bulky weighted vests, adding 10, 20, even 30 pounds to their morning stroll. Scroll through social media and you'll find countless influencers touting weighted vests as the secret to building unbreakable bones and sculpted muscles. Many videos have gained hundreds of thousands of views with claims that weighted vests will \"transform your body\"—a claim that, to be fair, is par for the course in any fitness trend. \"Weighted vest walks\" are popular enough to be parodied, and even if I find those videos a little mean-spirited, they do point to an important question: Does this trendy fitness accessory actually deliver on its promises?Let's dig into what science really says about weighted vests—and what they can (and can't) do for your body.The claim: Weighted vests can build bone density or stop bone lossI can see how this theory sounds legit. Bones respond to mechanical stress by becoming stronger—it's why astronauts lose bone density in zero gravity, and why weight-bearing exercise is recommended for osteoporosis prevention. So logically, strapping on extra weight should signal your bones to bulk up, right? Not exactly.\n        \n            You May Also Like\n        \n    \nAccording to Dr. Leah Verebes, a professor at the Touro School of Health Science's DPT program, the reality is more nuanced. \"Some research, particularly among elderly persons and postmenopausal women, suggests that the use of a weighted vest while exercising, or plain walking, can slow bone loss or improve bone density modestly—especially in the legs and hips,\" she says.However, the gains are far from dramatic. Verebes notes that \"results are variable and gains are minimal.\" Traditional resistance training like weightlifting and higher-impact activities like jogging or jumping produce significantly better results. A 2023 review found that while weighted vests may help maintain bone mineral density, the overall quality of evidence supporting this benefit remains low to moderate.Weighted vests can help maintain bone strength, particularly for people who can't tolerate high-impact exercise due to joint issues or other limitations. But they're not a substitute for proper resistance training or impact activities.The claim: Wearing a weighted vest builds muscle and increases strength.Here's where expectations need serious adjustment. Yes, adding weight to your body does increase the resistance during bodyweight exercises like squats, lunges, push-ups, and step-ups. And yes, this can contribute to improvements in muscular endurance and modest strength gains. But there's a catch.\"Vest walking also increases caloric expenditure and activates muscles more than regular walking, but the weight is typically too low to induce significant muscle growth,\" Verebes says. Most weighted vests are designed to be 5-15% of your body weight—enough to make your workout harder, but not enough to trigger substantial muscle building.Think of it this way: If you weigh 150 pounds, a 10% weighted vest adds just 15 pounds. That's less resistance than you'd use for a basic strength training exercise. \"Significant muscle growth continues to require progressive resistance training with more substantial weights,\" Verebes says.So, weighted vests can intensify your workout and improve muscular endurance, but they won't replace a proper strength training program if your goal is building significant muscle mass.The risks nobody's posting aboutWhile social media showcases people effortlessly crushing workouts in weighted vests, the reality is that adding load to your body comes with real risks. Verebes says that \"too much excess weight can cause strain on joints, especially the knees, hips, and lower back.\" The increased load can also impair balance and increase fall risk, a particular concern for older adults who might be using vests specifically to improve bone health.Perhaps most concerning is the risk of overuse injuries when people add weight too quickly. \"Professionals recommend starting with a light vest—roughly 5–10% body weight—and adding to it gradually as strength and tolerance improve,\" Verebes says.What actually works for building strong bones and musclesIf you're serious about improving your musculoskeletal health, Verebes offers evidence-based recommendations:Prioritize resistance training. Weightlifting or using resistance bands remain the most effective methods for keeping bones and muscles strong. Progressive overload—gradually increasing the weight you lift—is key to continued improvement.Include impact and weight-bearing exercise. Walking, hiking, stair climbing, and jumping all provide bone stimulation. Activities that involve impact force your bones to adapt and strengthen.Support exercise with proper nutrition. You can't out-train a poor diet. Adequate protein, calcium, and vitamin D are essential for maintaining bone and muscle health. Without proper nutrition, even the best exercise program will fall short.So, should you use a weighted vest?Look, weighted vests aren't worthless. They can add challenge to bodyweight exercises and walking routines, providing modest improvements in muscle endurance and bone maintenance, particularly for older adults or those unable to do high-impact activities.But as Verebes says, \"they are not a shortcut to get to stronger bones and bigger muscles overnight. For significant improvements, regular resistance training and impact exercise remain the gold standard.\"The bottom line? Weighted vests are a tool, not a miracle solution. If you do decide to try a weighted vest, start conservatively with 5-10% of your body weight, add load gradually, and pay attention to how your joints respond. And crucially: Always speak with your doctor first, especially if you have existing joint problems, balance issues, or bone density concerns.\n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Working Out in a Weighted Vest Won’t ‘Transform Your Body’ Like the Influencers Say",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8984PJV4FYSM7PAPEM2BYWQ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-23T20:00:54.000Z",
      "dateModified": "2025-10-23T20:00:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I Tried the At-Home Flu Vaccine, and It Was Great",
    "url": "https://lifehacker.com/health/how-to-order-flu-mist-at-home-flu-vaccine?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01J8FS01VYQM1PSDQ1GTRMM0ZY/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-23T16:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            You can order FluMist to be delivered right to your home.\n    \n        \n    \n                                        \n        \n        \n        October 23, 2025\n                    \n            Credit: Beth Skawrecki\n                            \n    Table of Contents\n    \n        \n        If I ever skip my flu shot, or fail to get one for my kids, it's because I didn't find time to get to the pharmacy during flu shot season. That's why I've been excited for FluMist's home delivery ever since I read about its FDA approval last year. My shots arrived this week (in nasal spray form), and I found the whole experience blessedly painless.The FluMist vaccine is a nasal spray, not an injection. It's available for people aged 2 to 49 (with some exceptions) and I try to get it for my kids when it's available. My youngest hates needles, and I sometimes have to call multiple pharmacies to find one that has it in stock. So when home delivery became available, I placed my order right away. How can you get the at-home flu vaccine? The nasal spray vaccine, called FluMist, still needs to be prescribed by a medical provider. But since nearly everyone aged 2 through 49 is eligible, FluMist’s maker (AstraZeneca) has a created a telehealth website that bundles the provider's approval with an order to an online pharmacy. The process takes about five minutes on average, the company says, and I found that to be accurate. \n        \n            You May Also Like\n        \n    \nI had already gotten a flu shot, so I ordered just for my kids. The website allowed me to add multiple people to the same order, so I filled out the questionnaire for each child, giving their names, ages, allergies, and so on. The website then reached into some big data cloud out there and told me it already knew their insurance information (existentially frightening, yet convenient!) and presented me with my bill: an $8.99 fee, which included $2.50 for physician evaluation and $6.49 for shipping and processing. Insurance covers the cost of the vaccine itself. Who can use the at-home flu vaccine? The at-home vaccine is the same as regular FluMist, which is approved for ages 2 through 49. That means babies and older adults will still need to visit a provider for the regular, injectable flu vaccine. Children can get flu shots starting at the age of six months.FluMist uses a live, weakened virus. It can't give you the actual flu, but it can cause some respiratory symptoms in people with weakened immune systems. So it's not recommended for people who are pregnant, have certain medical conditions, or are immunocompromised or have close contact with an immunocompromised person. If that's you, talk to a provider about your best options. You may be advised to get the regular injectable type, which doesn't include any live virus. What happens when the at-home flu vaccine arrivesWhen I placed the order, I had to choose a delivery date (to be sure I'd be home and ready to receive it). It arrived via FedEx, with multiple texts ahead of time letting me know it was on its way. The vaccine needs to stay at refrigerator temperature, so you don't want it sitting out on your porch all weekend. I thought I would have to refrigerate it immediately—the instructions say as much—but it can actually be unrefrigerated for up to 12 hours before administration. So the box arrived, insulated and with the vaccine packages surrounded by cold packs. There was a \"TiveTag\" sticker on the interior box, so I followed the instructions to download the TiveTag app from a QR code on the package. It installed quickly, and then I just had to hold the phone up to the RFID sticker on the box. A screen told me that the box had stayed at an appropriate temperature the whole time, so I was good to go. How do you give yourself the at-home flu vaccine? Giving the vaccine is simple. To give you a sense: an at-home COVID test is about ten times more complicated. All you have to do here is take off the rubber cap, squirt the vaccine into one nostril, then take off the little spacer around the plunger and squirt into the second nostril. (The spacer makes sure that you get half the vaccine into each nostril.) If you've gotten a FluMist at a pharmacy, it's the same idea. Adults can administer it to themselves, and children will need an adult to do it for them. Instructions are, of course, provided. After I gave it to my kids, I clicked a link in a text message to \"report vaccination,\" which updates their health records in, again, some big ol' data cloud. (I will also let their doctor know at their next appointment.) After you administer the vaccine, there is a prepaid envelope you can use to return the sprayers for disposal. The paper packages and inserts obviously could be recycled. That left me with the cardboard box, its insulated foam liner, and six liquid cold packs that the FluMist site says are filled with \"non-toxic water\" and can be either poured out and recycled, or reused as ice packs if I'd like. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I Tried the At-Home Flu Vaccine, and It Was Great",
      "image": [
        "https://lifehacker.com/imagery/articles/01J8FS01VYQM1PSDQ1GTRMM0ZY/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-23T16:00:00.000Z",
      "dateModified": "2025-10-23T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Pixels Are Still Having Problems Calling 911",
    "url": "https://lifehacker.com/tech/google-pixels-are-still-getting-911-bugs?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BSWKQV1QJ9ZV3XA00PVQVM/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T21:00:19.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            The problems has persisted since 2021.\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n                    \n            Credit: omar hesham2qwe / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Multiple Google Pixel users yesterday reported that they couldn't call 911.\n                                            The issue has persisted since 2021, in one form or another.\n                                            A Canadian carrier also posted about similar problems, but says they have since been fixed.\n                                    \n            \n    Table of Contents\n    \n        \n        For the past few years, Google's Pixel phones have had recurring problems with calling 911, and the issue has once again reared its ugly head. Over the past 24 hours, multiple users on Reddit have complained about being unable to call 911, while the Bell carrier in Canada issued a warning that the Pixel 6 and up was also having problems contacting emergency services on its network.According to user Fabulous_Disaster730, who posted yesterday about difficulties contacting emergency services during a gas leak, her Pixel 9 Pro repeatedly prompted her to turn on wifi calling or turn off airplane mode before she could call 911, despite her having full signal on both 5G and wifi. The phone would then freeze and restart. After multiple attempts, she resorted to asking a friend to place the call for her instead.Multiple replies mentioned facing similar problems yesterday as well, across multiple networks and models of Pixel. Bell, however, was the only carrier to issue an official notice.\n        \n            You May Also Like\n        \n    \nAside from the obvious danger, the problem with this bug is that it's not consistent. Despite seemingly having had a surge yesterday, it's been a known issue as far back as 2021. However, it doesn't affect all users, nor is it entirely predictable when or how it will pop up. While recent reports are of calls simply not going through, one user posted two months ago that their call did go through, but they only heard screeching and static on the other end of the line. These recent reports are only the latest in an ever-evolving concern.It's also not clear what's causing the problem. In 2021, the problem was attributed to Microsoft Teams, but even with that error patched up, users are still facing problems. To Google's credit, Bell said it reached out to the company shortly after it learned about yesterday's uptick in cases, and afterwards said that a fix had been issued. However, no other carriers have issued similar notices, and I wouldn't be surprised to see other users making their own complaints in the future.It's worth noting that Bell mentioned that Pixel 6 users and up were the ones affected this time around, and that the Pixel 6 also happened to release in 2021, which is when the bug first started making news. Whatever is at the core of the problem here, I wouldn't be surprised if it worked its way in on the Pixel 6 and just hasn't yet been addressed.However, given the severity of the issue, it's something that needs looking at sooner rather than later. I've reached out to Google for comment on this issue, and will update if I hear back. In the meantime, it's best to be prepared in case the worst happens. If you're on a Pixel phone, here's what you can do to contact 911 in an emergency:First, try to place a 911 callIf you have time and the danger is not immediate, it's worth trying to call 911 on your Pixel despite the issues. While users reporting problems have increased as of late, it's still not an everyone or every time problem. It's possible your call will still go through without issue.You can also text 911If, however, you are unable to call 911, it's worth remembering that in certain jurisdictions (check this regularly updated list to see if where you live is supported), you can also contact 911 via text. This is a slower method of reaching out for help, but is still better than nothing. To text 911, open your texting app, put in 911 as the recipient, and write a concise message with your issue, your location, and any necessary specifics, like cross streets, landmarks, a specific hiding location, or whether you're able to talk.Use a backup phoneWhile I don't expect someone who isn't constantly reviewing tech to have multiple phones on hand, the surest method to ensure you'll be able to call 911 if you're on a Pixel is to keep a backup phone that isn't a Pixel handy. This could be a landline or another cell phone. Crucially, it can be an old cell phone, even one that isn't actively attached to a phone plan. So long as your phone is able to connect to a network, it's legally required to be able to call 911, so if you have an old phone you've upgraded from and haven't traded in laying around, it may be smart to keep it charged up in case you need it in an emergency.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Pixels Are Still Having Problems Calling 911",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BSWKQV1QJ9ZV3XA00PVQVM/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T21:00:19.000Z",
      "dateModified": "2025-10-24T21:00:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]