[
  {
    "title": "wBlock Is the Best Way to Block Ads on Safari",
    "url": "https://lifehacker.com/tech/wblock-ad-blocker-for-safari?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAKYB7B9MFSGKFGQQQY6FZD3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-21T21:00:51.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n            Credit: Justin Pot\n              ",
    "body": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        Want to block ads on your Mac, iPhone, or iPad? wBlock is quickly becoming my favorite solution: it's free, open source, fast, and customizable.Ad blocking is in a weird place. Google, the company that makes more money from advertising than any other on Earth, is actively working to make ad blockers worse on Chrome while it also makes it harder to block ads on YouTube. Basically, it's a good time to not use Chrome.So it's nice that Apple users have another choice: Safari. And, as luck would have it, Safari has an extremely efficient API for ad blocking built right in. The ad blocker wBlock uses this, and the result is ads are blocked in a way that doesn't slow down your browsing.\nI wrote a few months ago about uBlock Origin for Safari, which doesn't use Apple's native blocking feature. I enjoyed how effective that application was at blocking ads, but over time I've found it does impact the performance of my browser a little. After setting up wBlock, everything feels snappy.You can install wBlock from the App Store on your Mac, iPhone, or iPad. After doing so, you can choose which filter lists you want to use. Several are offered, or you can just stick with the defaults.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nYou will also be asked if you want to enable any userscripts. The ones offered bring back YouTube's old interface and bypass paywalls. You can also install custom userscripts, if you want, meaning you won't need a separate application for that functionality.After that, you'll need to open Safari, head to the settings, and turn on all the wBlock entries you see on the extensions page. Do that and you should be able to browse the web without any ads.If you're curious about how this extension works and how it compares to other Safari ad blockers, I recommend checking out the documentation on Github—it goes over how this tool works and how it differs from other applications. I also encourage you to think about the pros and cons of blocking ads overall.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "wBlock Is the Best Way to Block Ads on Safari",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAKYB7B9MFSGKFGQQQY6FZD3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-21T21:00:51.000Z",
      "dateModified": "2025-11-21T21:00:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Directly Import Apple Music Playlists to Spotify",
    "url": "https://lifehacker.com/tech/transfer-apple-music-playlists-spotify?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAKW6VSX2VJRC9Q8XKYBVB9A/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-21T20:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n            Credit: RAMAN SHAUNIA / Shutterst",
    "body": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n            Credit: RAMAN SHAUNIA / Shutterstock\n                            \n    Table of Contents\n    \n        \n        If you've spent years curating playlists in Apple Music or another streaming service, you can now easily transfer your playlist to your Spotify library without needing to start from scratch or pay for a third-party service. Playlist transfers are now built into Spotify thanks to a new integration with TuneMyMusic, which facilitates music syncing, sharing, transfers, and backups across platforms. To initiate a playlist transfer from Apple Music or another streaming service (YouTube Music, Amazon Music, SoundCloud, etc.), open the Spotify mobile app and tap Your Library. Scroll to the bottom of the page, tap Import your music > Get Started, and follow the on-screen prompts to connect with TuneMyMusic. You can choose which platform to transfer music from, and your playlists will populate in Spotify. Your playlists will remain on the original platform, as they are simply being copied into Spotify. (This feature is currently rolling out to users, so you may need to update your Spotify app.)Data portability across music streamers has been very limited, but it's getting better: TuneMyMusic was already compatible with Spotify, but users had to sign up for a free trial with the service and were capped at just 500 songs before needing to upgrade to a paid plan. (Other third-party playlist transfer tools include FreeYourMusic and Soundiiz.) \n            \n                What do you think so far?\n            \n        \nApple Music has a music transfer feature built into its iOS and iPadOS (under Settings > Apps > Music) as well as the Apple Music app for Android and via the web. YouTube Music supports playlist imports and exports but requires a third-party service for platforms that don't permit direct transfers. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Directly Import Apple Music Playlists to Spotify",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAKW6VSX2VJRC9Q8XKYBVB9A/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-21T20:30:00.000Z",
      "dateModified": "2025-11-21T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Best Journal Apps to Use Instead of Your Phone's Built-In Option",
    "url": "https://lifehacker.com/tech/best-journal-apps-to-use-instead-of-your-built-in-option?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAKJZCSR8BVFJF3Q6H62248V/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-25T13:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    There are better third-party apps out there.\n            \n                        \n    \n                            \n        \n        \n        November 25, 2025\n            \n            \n                        Credit: Zooey Liao/Lifehacker/Getty Images/Day One/Five Minute Journal/Rosebud\n                            \n    \n        \n        Since you're already carrying your phone with you everywhere like a digital appendage, you might as well use it for journaling. It's always at hand, can capture photos, videos, and voice notes as well as text, and is able to log locations, trips and more. Its new AI tools can even draft a few entries automatically for you.What's more, your phone probably now comes with a journal app preinstalled: Apple's Journal app launched in 2023, and a brand new Journal app from Google, initially exclusive to the Pixel 10, is now available on the Pixel 8 and Pixel 9 too (apparently because these phones also have Gemini Nano on board). Plus, a wide selection of third-party options is available on the Android and iOS app stores.In recent days, in an attempt to determine whether or not journaling on my phone might be for me, I've tested out both the Apple and Google offerings, as well as some of the best third-party alternatives. Here's what I found, and which apps I'd recommend if you want to log your thoughts and feelings on your phone.\nThe built-in optionsJournal by AppleLet's start with Journal by Apple, launched in December 2023. It's fair to say there haven't been a ton of updates released for the app since then, but all of the essentials are covered: Your journal entries can combine text, photos, videos, audio, locations, and sketches, and you can even set up multiple journals for different purposes.I do like the way this app makes suggestions for journaling, particularly in terms of recent locations and photos—it means it's easier to get started or to jump back in after a while. There are also a good number of options for what you can attach to your journal entries, and I can see myself using the mood slider a lot.\n    \n            \n            Journaling with Apple.\n                                        Credit: Lifehacker\n                    \n    \nJournal by GoogleAs for the Journal app that Google recently launched for Android, it is limited to those with a phone from the Pixel 8, Pixel 9, and Pixel 10 series. It's also pretty bare bones: I was able to log text, photos, videos, and places, as well as fitness data collected through Health Connect, but there's nothing here for audio or moods.In addition, the interface is rather plain—much more spartan than the Apple equivalent. You do get a neat overview of all your posts, but it's not particularly inspiring, and you can't configure multiple journals. In addition, the AI-powered prompts for what to write about remain exclusive to Pixel 10 handsets, so you have to do without these on the Pixel 8 and Pixel 9.\n    \n            \n            Google's Journal app sticks to the basics.\n                                        Credit: Lifehacker\n                    \n    \nNeither of these are bad apps; each will do the job of getting down your thoughts in a digital format, with some useful extras attached. The biggest benefits are they're both well integrated into their respective operating systems, and you don't need new accounts to use them. Apple's journal app is certainly better than Google's at the moment, though it's had a two-year head start.If you just want something quick and simple that's made by the company that made your phone (and that may well come preinstalled on your phone), then they're fine. However, these two journal apps remain rather bare bones compared to the other options, as well as keeping you locked in on either Android or iOS. That's why, if you're serious about your journaling, I think it's worth exploring a third-party app installed.The best third-party journal appsDay One\n    \n            \n            Day One was one of the first mobile journals to appear.\n                                        Credit: Lifehacker\n                    \n    \nOutside of Google and Apple, Day One (Android and iOS) has long been one of the best journaling apps around—and you can take it with you if you ever jump between the Apple and Google platforms. It's been around since 2011 and is stacked with features, including multiple view types, prompts, tags, summaries, recaps, and a gorgeous design that looks great on every device.\n            \n                What do you think so far?\n            \n        \nYour entries can include all the usual features, plus weather details, playlists, health data, social media posts, and more. You get a lot for free, but there is also a premium plan available for $50 a year. It gives you support for unlimited images, videos, and audio, plus extras like the ability to create journal entries over email.5 Minute Journal\n    \n            \n            5 Minute Journal focuses on positivity.\n                                        Credit: Lifehacker\n                    \n    \nAs someone just dipping a toe into the world of journaling, 5 Minute Journal (Android and iOS) appeals right from the name. The idea is you don't have to spend too long jotting down your thoughts and ideas each day, and the app is geared towards getting you to record the more positive aspects of your life, boosting mindfulness and well-being.I like the writing prompts and journaling reminders this app provides to keep you motivated, as well as the really simple way you can log your mood as you go. It's also a beautifully designed and organized app—a completely different aesthetic experience than a more utilitarian option like Google Journal. However, some features (including unlimited photos and videos) requires a premium subscription, which starts at $5 a month.Rosebud Journal\n    \n            \n            Rosebud comes with a few AI prompt extras.\n                                        Credit: Lifehacker\n                    \n    \nOne more recommendation from my own experience: Rosebud (Android and iOS). It's branded as \"AI-powered\" but thankfully you don't have to worry too much about that, and it does a really nice job of summarizing and tracking your thoughts over time, as well as encouraging you to jot stuff down in the here and now.The app does quite a bit of hand-holding and prompting, but that's perfect if you're just getting started or struggling to journal each day, and you can always just  jot down standard journal entries with text and images if you prefer. As you might have guessed given the other options on my list, there is a pro-level subscription for $13 a month that gives you a lot more insights in terms of past entries, trends, and emotional patterns and triggers, if an AI's summary of your life is interesting to you.The best journal app is the one you useOne of the benefits of there being so many journal apps out there is that there really is something for everyone, so there's no harm in testing out Google and Apple's offerings first—they are, after all, completely free. But for journaling apps that really invest in user design and features, there are much better options out there. Now I just need to pick the one I'm going to stick with, because in the end, the best journal app is the one that you use consistently. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n                        \n                \n            \n                    \n                                            \n                \n            \n                David Nield\n                                \n                                            David Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. \n                                    \n                Read David's full bio\n                            \n        \n                \n                                            \n    More by David\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Best Journal Apps to Use Instead of Your Phone's Built-In Option",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAKJZCSR8BVFJF3Q6H62248V/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-25T13:00:00.000Z",
      "dateModified": "2025-11-25T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch Out for These New Scams Targeting Social Security and VA Benefits",
    "url": "https://lifehacker.com/money/social-security-and-va-benefit-scams?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KASZMKTMC5CJZF9YCMA0KDP3/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-25T14:00:00.000Z",
    "description": "\n        \n        Scammers love to impersonate government and law enforcement officials, from the FBI to the U.S. Marshals Service to Medicare and oth",
    "body": "\n        \n        Scammers love to impersonate government and law enforcement officials, from the FBI to the U.S. Marshals Service to Medicare and other health insurance programs. There's a good reason for this: Most Americans use government services at some point, and many may be apt to trust, or at least engage with, someone claiming to be from a well-known agency. Plus, the threat of losing benefits or being targeted by legal action is especially compelling when it comes from a government representative, and victims may be more likely to comply with scammers' demands. It's no surprise, then, that schemes currently making the rounds involve Social Security and Veterans Affairs benefits, according to warnings from the Social Security Administration and the Department of Veterans Affairs. Social Security numbers are often part of identity theft, so it would be alarming to receive a notice that yours has been involved in criminal activity. Scammers are counting on this when impersonating the SSA's Office of the Inspector General (OIG) and trying to trick you into actually giving up your SSN and other sensitive information.  \nHere's how the scheme works: Fraudsters are sending emails with the subject line \"Alert: Social Security Account Issues Detected\" and including attachments on letterhead that looks like it comes from the OIG. The notice contains official-seeming information, such as a reference number and case ID, and states that your SSN will be suspended within 24 hours due to fraudulent activity on your account. The letter also says that criminal charges have been filed and even includes the statutes that have supposedly been violated. Recipients are instructed to call the number listed to \"respond to these allegations,\" but the person on the other end is a scammer impersonating an SSA employee. They will try to exploit your fear and confusion to collect personal and financial information from you. VA benefits overpayment scamScammers are also contacting veterans and military family members who receive VA benefits, claiming that said benefits have been overpaid and pressuring targets to pay back the money owed. According to the VA's advisory, fraudsters are using fake VA letterhead and logos on notices sent by mail and email as well as spoofing real VA phone numbers. They are trying to convince beneficiaries to make payments immediately using methods like wire transfers, cryptocurrency, prepaid debit cards, and gift cards, and they may also request sensitive information your VA login or bank account credentials. \n            \n                What do you think so far?\n            \n        \nWhile VA benefits could legitimately be overpaid, the VA won't contact you and demand money—especially via bitcoin and other unrecoverable methods. Nor should you ever have to pay an upfront fee for assistance with managing VA debts and claims (the VA does this for free). If you do actually owe money, you will be able to find more information on repayment through your official VA.gov account. Always verify through official VA channels, such as VA.gov and the VA’s Debt Management Center (800-827-0648). Never rely solely on unsolicited communication, and never give out your password, SSN, or financial information. Government agencies don't send threatening notices via email (or by any other means), so if you receive a scary letter out of the blue, don't act without investigating. Always contact the agency via the information found on its website—don't call or text any number provided in these notices.   \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch Out for These New Scams Targeting Social Security and VA Benefits",
      "image": [
        "https://lifehacker.com/imagery/articles/01KASZMKTMC5CJZF9YCMA0KDP3/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-25T14:00:00.000Z",
      "dateModified": "2025-11-25T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I've Love My Google TV Streamer, and It's Never Been Cheaper",
    "url": "https://lifehacker.com/tech/google-tv-streamer-black-friday-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KB01F96ZADTPBDSJ9DHZA932/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-26T14:00:23.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 26, 2025\n    \n            Credit: Amazon\n                  ",
    "body": "\n        \n    \n                                        \n        \n        \n        November 26, 2025\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over. Follow our live blog to stay up-to-date on the best sales we find.Browse our editors' picks for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.Subscribe to our shopping newsletter, Add to Cart, for the best sales sent to your inbox.Sales are accurate at the time of publication, but prices and inventory are always subject to change.There's an awful lot to like about the Google TV Streamer, especially when it's back down to its lowest price for Black Friday. You can now pick this versatile, reliable streaming box for $74.99 on Amazon, down from its original price of $99.99.\nLifehacker's review of the device highlights the smoothness of the user interface, the wealth of onboard storage, the bonus of having an Ethernet port (for steady internet access), and the benefits of the improved remote control—which you can actually make sound an alarm if you lose it. (Invaluable!)I've been using and loving Google TV for years, and the Google Streamer is a great way to access it. I like its broad support for multiple streaming apps, and the way it combines all those apps together—making it easy to see what you're currently watching. You can add to your watchlist from all across Google apps and services too, including Google Search.The streaming box and its associated remote are available in either Porcelain or Haze, so you can pick whichever matches your personal taste and internal decor. This 25% Black Friday discount may not last, so if you're interested, I'd recommend getting this bought as soon as possible.\n            \n                What do you think so far?\n            \n        \nDoes Amazon have Black Friday deals?Yes, Amazon has Black Friday sales, but prices aren’t always what they seem. Use a price tracker to make sure you’re getting the best deal, or refer to guides like our live blog that use price trackers for you. And if you have an Amazon Prime membership, make the most of it.Are Black Friday deals worth it?In short, yes, Black Friday still offers discounts that can be rare throughout the rest of the year. If there’s something you want to buy, or you’re shopping for gifts, it’s a good time to look for discounts on what you need, especially tech sales, home improvement supplies, and fitness tech. Of course, if you need to save money, the best way to save is to not buy anything. Are Cyber Monday deals better than Black Friday?Black Friday used to be bigger for major retailers and more expensive tech and appliances, while Cyber Monday was for cheaper tech and gave smaller businesses a chance to compete online. Nowadays, though, distinction is almost meaningless. Every major retailer will offer sales on both days, and the smart move is to know what you want, use price trackers or refer to guides like our live blog that use price trackers for you, and don’t stress over finding the perfect timing.\n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I've Love My Google TV Streamer, and It's Never Been Cheaper",
      "image": [
        "https://lifehacker.com/imagery/articles/01KB01F96ZADTPBDSJ9DHZA932/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-26T14:00:23.000Z",
      "dateModified": "2025-11-26T14:00:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This New Scam Is Leaving Voicemails Saying You Owe $1,000",
    "url": "https://lifehacker.com/tech/this-new-scam-is-leaving-voicemails-saying-you-owe-a-thousand-dollars?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAKSREKTRKE98HF4M1845YNV/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-21T20:00:15.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n            Credit: Credit: Zooey Liao/Lifeha",
    "body": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n            Credit: Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            A new scam claims there's been a charge on your Amazon account for an expensive new iPhone.\n                                            The call will either say the charge is for $999 for an iPhone 16 Pro, or $1,099 for an iPhone 17 Pro.\n                                            If you receive this call, hang up or ignore it: It's a scam.\n                                    \n            \n    Table of Contents\n    \n        \n        Someone stealing your credit card information is the absolute worst. Opening your statement to see expensive charges you didn't make is stressful, and canceling your card—and dealing with all of your attached subscriptions—is a nightmare. So if you get a call about an unauthorized charge for a brand new iPhone, you're probably going to want to get to the bottom of it. Here's the thing: It's likely a scam. I speak from experience: My wife keeps getting calls from unknown numbers, all of which leave voicemails about charges for iPhones. The voicemail starts off with what sounds like standard holding music. Suddenly, a voice pops in, saying something to the affect of: \"This is Amazon. This call is to authorize the payment of $999 for the recent order of Apple iPhone 16 Pro on your account. If you do not authorize this payment, please press \"one\" to speak to our customer support representative.\" Your call may also be about, \"the payment of $1,099 for the recent order of Apple iPhone 17 Pro on your account.\" We are inundated with the calls, and besides the payment amount and the specific iPhone model, the rest of the message is identical. As you might expect, no such charges are actually present on either our Amazon account or in our credit card history. That's because no one bought an iPhone in our name, or by using our financial information: This was simply a scam.\nHad we answered the phone and pressed \"one\" to speak with a \"customer support representative,\" or called the number back after listening to the voicemail, this is what would have likely happened: The \"representative\" would have assured us that they would be able to dispute the charge, but of course they'd need some information from us first. Perhaps they would have needed us to confirm the credit card information, and would ask us to read our digits out loud. Maybe they'd need to make sure we actually owned the Amazon account in question, and would ask for our two-factor authentication code to \"confirm our identity.\" No matter what the case, the scammers would have been praying on our concern about the charge to extract some type of sensitive information from us, all for their own financial gain. Had we called back and complied, we would have almost assuredly handed the scammers the money we thought they were helping us get back.  What to do if you get this voicemailIf you get a voicemail like this, don't call them back. If you pick up the phone, and you get this message, don't press \"one;\" just hang up. You are definitely being scammed, and there's no risk in simply ignoring the caller completely. \n            \n                What do you think so far?\n            \n        \nIf you'd like to verify their claims, don't involve the caller at all. Instead, head to your Amazon account, and check your order history. You'll be able to see if any such iPhones were ordered under your account—and, if they were, you can cancel the order here. Similarly, check your credit card history: If you don't see a charge for an iPhone, there wasn't one. If you do see one, reach out to the credit card company directly through their official contact information.  Scammers rely on pressure tactics that stress you out, and make you feel like time is of the essence. It rarely ever is. While it might seem common practice for companies like Amazon to call customers about large charges, it really isn't. If you ever receive unsolicited communications from someone claiming to represent a company you belong to, you can always end the conversation, and reach out directly yourself. If you contact Amazon's official customer support, or the company that issues your credit card, they'll be able to confirm or deny the claim for you.  While you can block the number, it might not do much good. Each time we've received a call, it's been from a different number, so my guess is they're not reusing numbers when calling you back. Instead, you should strongly consider using one of Apple's built-in anti-spam tools. If you're running iOS 26, you can choose to have your iPhone screen calls from unknown numbers, and ask for information before sending the call your way. No matter which version of iOS you have, you can also choose to silence unknown callers en masse, so you're never interrupted by any caller that isn't in your contacts. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This New Scam Is Leaving Voicemails Saying You Owe $1,000",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAKSREKTRKE98HF4M1845YNV/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-21T20:00:15.000Z",
      "dateModified": "2025-11-21T20:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Garmin's Newest Running Watches Are Already on Sale for Black Friday",
    "url": "https://lifehacker.com/health/garmins-newest-running-watches-first-sale-black-friday-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KB0Q5EP87VXK05D78JK6K8PN/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-26T19:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 26, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 26, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Beth Skwarecki\n                            \n    Table of Contents\n    \n        \n        Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over. Follow our live blog to stay up-to-date on the best sales we find.Browse our editors’ picks for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.Subscribe to our shopping newsletter, Add to Cart, for the best sales sent to your inbox.Sales are accurate at the time of publication, but prices and inventory are always subject to change. When Garmin watches first went on sale for Black Friday last week, I was a little bummed that the Forerunner 570 and 970 didn't seem to have been discounted. But sometimes a company saves a few special things for later, and that turned out to be the case here: These two brand-new watches, released earlier this year, are now both $100 off. I've used and reviewed the Forerunner 570, and found it a step up from the earlier Forerunner 265 (which I also loved). The 570 adds a microphone and two different types of voice assistants, plus some new software features like heat acclimation and the ability to trim your activity if you didn't press \"stop\" when you crossed the race finish line. My only complaint is (or was) that the price seemed a bit steep in comparison to the previous model. But with the current deal, it's a lot closer to the original price of the 265: The 570 is now going for $449.99.\nThe Forerunner 970 is also $100 off, which brings its current price to $649.99. The biggest thing the 970 has going for it over the 570 is that it can show you maps while you run. Both watches can do breadcrumb tracking (drawing a line showing where you've been), but with a fully map-enabled watch, you can see important details like where your hiking route crosses roads or turns along them. The 970 also has an LED flashlight, which is incredibly handy for getting around in the dark—whether that means snuggling into your sleeping bag at a campsite or just sneaking out of your kid's room at bedtime.\nHow long do Black Friday deals really last?Black Friday sales officially begin Friday, November 28, 2025, and run throughout “Cyber Week,” the five-day period that runs from Thanksgiving through Cyber Monday, December 1, 2025. But Black Friday and Cyber Monday dates have expanded as retailers compete for customers. You can get the same Black Friday sales early, and we expect sales to wind down by December 3, 2025. \n            \n                What do you think so far?\n            \n        \nAre Black Friday deals worth it?In short, yes, Black Friday still offers discounts that can be rare throughout the rest of the year. If there’s something you want to buy, or you’re shopping for gifts, it’s a good time to look for discounts on what you need, especially tech sales, home improvement supplies, and fitness tech. Of course, if you need to save money, the best way to save is to not buy anything. Are Cyber Monday deals better than Black Friday?Black Friday used to be bigger for major retailers and more expensive tech and appliances, while Cyber Monday was for cheaper tech and gave smaller businesses a chance to compete online. Nowadays, though, distinction is almost meaningless. Every major retailer will offer sales on both days, and the smart move is to know what you want, use price trackers or refer to guides like our live blog that use price trackers for you, and don’t stress over finding the perfect timing.\n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Garmin's Newest Running Watches Are Already on Sale for Black Friday",
      "image": [
        "https://lifehacker.com/imagery/articles/01KB0Q5EP87VXK05D78JK6K8PN/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-26T19:30:00.000Z",
      "dateModified": "2025-11-26T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "My 1,000-Mile Running Shoes Are Less Than $50 for Black Friday",
    "url": "https://lifehacker.com/health/my-1000-mile-running-shoes-are-under-50-for-black-friday?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAVNDGPMAJA1XV264SVEK6WM/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-24T20:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Beth Skwarecki\n                            \n    Table of Contents\n    \n        \n        Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over. Follow our live blog to stay up-to-date on the best sales we find.Browse our editors’ picks for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.Subscribe to our shopping newsletter, Add to Cart, for the best sales sent to your inbox.Sales are accurate at the time of publication, but prices and inventory are always subject to change.You're supposed to replace your running shoes after 300 to 500 miles, but I've discovered that some shoes can take a lot more mileage than that. Now, the shoe that lasted so long for me—the Nike Downshifter—is on sale for $50 or less, depending on the color.\nWhy I love these shoesYou can read the full saga of my 1,000 mile shoes here. Briefly, I wore a pair of Nike Downshifter 12s for nearly every road run I did for about a year, putting 1,024 miles on the shoes by the time I wrote about them. (I've worn them a few times since then, as well.) Since these are a budget shoe to begin with, the value was incredible—6.5 cents per mile, according to my calculations. The current model is the Downshifter 13, which I also own, although I've only put a few dozen miles on mine so far. But they seem to be a very similar type of shoe, and I won't be surprised if they make it into the quadruple digits as well. The Downshifter 13 is the one that's on sale right now.How to get the best price on Nike DownshiftersBoth the men's and women's version of the Downshifter 13 are on sale at Nike's website. (While you can find them at other retailers as well, I like to buy direct from Nike if I can find a good price, because of their excellent return policy.)The regular price is $80 for each version, and the sale price varies by color. I'm seeing prices from $48.97 to $68.97. But there's an additional discount—Nike is also offering a code, BFRIDAY, that gives you 25% off. I threw one of those cheaper pairs into my cart, applied the code, and the price dropped to $36.73. There's an $8 shipping charge, but that means the total is just $44.73. That's less than 45 bucks, shipped, for a pair of shoes that with luck might last a thousand miles. \n            \n                What do you think so far?\n            \n        \nDoes Apple do Black Friday?Yes, Apple participates in Black Friday, though you may want to compare their sales with other retailers like Best Buy and Walmart. Apple is offering an exclusive $250 gift card for eligible purchases, but so far, the best Black Friday sale on an Apple product is the M4 MacBook on sale for cheaper than ever.Does Amazon have Black Friday deals?Yes, Amazon has Black Friday sales, but prices aren’t always what they seem. Use a price tracker to make sure you’re getting the best deal, or refer to guides like our live blog that use price trackers for you. And if you have an Amazon Prime membership, make the most of it.What stores have the best sales on Black Friday?Nowadays, both large retailers and small businesses compete for Black Friday shoppers, so you can expect practically every store to run sales through Monday, December 1, 2025. The “best” sales depend on your needs, but in general, the biggest discounts tend to come from larger retailers who can afford lower prices: think places like Amazon, Walmart, Target, Best Buy, and Home Depot. You can find all the best sales from major retailers on our live blog. \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "My 1,000-Mile Running Shoes Are Less Than $50 for Black Friday",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAVNDGPMAJA1XV264SVEK6WM/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-24T20:00:00.000Z",
      "dateModified": "2025-11-24T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I Gifted My Mom an Apron of Her Art Using Adobe's AI Tools, and Here's How I Did It",
    "url": "https://lifehacker.com/tech/i-gifted-my-mom-an-apron-of-her-art-using-adobes-ai-tools-and-heres-how?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAXYF9Q1V09P3WZT7D6DS43E/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-25T18:06:55.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 25, 2025\n    \n    Opinions expressed by Lifehacker Creator ",
    "body": "\n        \n    \n                                        \n        \n        \n        November 25, 2025\n    \n    Opinions expressed by Lifehacker Creator Perspectives contributors are their own and are separate from Lifehacker's editorial team. If you buy a product featured here, we may earn a commission.\n    \n            Credit: Lifehacker Composite; Amazon, Getty Images / Mary Michelle Emery\n                            \n    Table of Contents\n    \n        \n        My mom has been a master Chinese painter for over 40 years. I recently used AI to incorporate her art into physical gifts. If you want to achieve the same quality with a meaningful family photo, here's how you can utilize Adobe's new upscaling features to get the best results.\nFor this process, I used Adobe Firefly and Photoshop. Adobe Firefly is Adobe's generative AI application, and the company released a phone app this summer to help you create on the go. If you're a total newbie to Firefly, you can just ask the app for help along the way. Photoshop, which has long been the gold standard for image editing, recently added an AI upscaling feature that can improve scanned photos or images with the click of a button. Here's how I did it.\n\n    \n        Meet industry creators, contributors, and thought leaders who have paired with Lifehacker's award-winning staff to publish first-person commentary from lived experience.\n    \n    \n        \n                                                                    \n                                                                    \n                                                                    \n                                        \n        \n            Meet our contributors\n            \n        \n    \n\nHow I used Adobe AI features to make giftsI started by using Adobe Firefly to visualize my mom’s art on various products, including aprons, scarves, and even dresses. Seeing mockup options helped me decide on an apron as the perfect first piece.Next, I brought an image of an original painting into Photoshop and used the AI upscaling feature. Wearables require a much larger print size, and this step ensures every detail stays crisp and vibrant. I then uploaded the file to Printful, a print-on-demand platform. You can also use Printify or a different print-on-demand provider, as the process is nearly identical.\n            \n                What do you think so far?\n            \n        \nIn just a few clicks, the apron was ready to print and ship directly, and it was such a pleasure to see my mom wear her own artwork. With technology and AI, we’ve been able to take her creations beyond the canvas and share them with people everywhere, making every gift feel personal, meaningful, and timeless. If you want to tinker with AI this holiday season, this is one way to get some practice and make a thoughtful gift for a loved one along the way.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I Gifted My Mom an Apron of Her Art Using Adobe's AI Tools, and Here's How I Did It",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAXYF9Q1V09P3WZT7D6DS43E/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-25T18:06:55.000Z",
      "dateModified": "2025-11-25T18:06:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Five Home Maintenance Tasks You Should Tackle Before November Ends",
    "url": "https://lifehacker.com/home/november-home-maintenance-tasks?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JBV5A3SP6BS56VTN5WJN5JC3/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-25T14:45:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 25, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 25, 2025\n    \n    We may earn a commission from links on this page.\n    \n            Credit: Nataliia Yankovets / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        November is the ideal time to prepare your home for colder weather and to get ready to spend more time indoors. Not only can you save yourself from more expensive heating bills with thoughtful weatherproofing, but you can also be more confident in the event of winter storms or simply more comfortable when you choose to stay indoors. Keeping your house warm, cozy, and safe for the winter is made easier by addressing potential problems early through simple checks and chores now. Here are all the home maintenance tasks you should do in November.1) Add vent covers to your vents and crawlspacesWhen the weather gets colder, wild animals seek a good place to shelter for the winter. If you have uncovered vents or crawl spaces, they can prove to be an inviting spot for creatures. To keep them out, see that you have vent covers in place and that crawl spaces or any other exterior nooks and crannies are sealed up or covered with a sturdy metal mesh. If you don't have vent covers installed, consider adding them. This method will help defend against squirrels, raccoons, rats, mice, birds, and bats.2) Change the batteries in your fire and carbon monoxide alarmsIf you have non-wired smoke and carbon monoxide detectors, change the batteries once a year—even before they begin making the annoying low-battery beep, if you're up for it. While you're at it, check your various hazard detection systems to ensure they work properly. Since people spend more time indoors during the colder months, there is an elevated risk of fire from the use of heaters, candles, and cooking. Additionally, keeping windows closed and sealed can increase the risk of carbon monoxide accumulation inside. Giving your detectors a once-over can help reduce your risk.\n3) Install weatherproofing to doors and windowsIf you live in an older home or have windows or doors that aren’t well-insulated, November is a good time to weatherproof problem areas. Begin by inspecting the weatherstripping around doors and windows, checking for leaks, broken, or worn stripping. If you find any gaps, use replacement weather stripping to seal them. If you have bigger leaks around windows or doors, or older windows that let in too much air, you can also use a weatherization kit to temporarily seal off leaky openings with heat-shrinking plastic wrap. This basic weatherproofing will keep you warmer and help save money on utility bills.\n            \n                What do you think so far?\n            \n        \n4) Organize your winter weather suppliesIf you live in an area that can get a lot of snow and ice in the winter, stock up on ice melt, shovels, and roof rakes. Take a look at your snow removal tools and make sure they’re in good shape before it’s time to use them, as replacing equipment before a storm can save you a lot of headache later. It's also a good time to stash your ice scraper, snow brush, and snow chains in your car's trunk. If you live in an area with heavy snowfall and ice, consider keeping a scraper and de-icer in your garage or utility room, so you can access them if your vehicle becomes frozen over.5) Clean ovens, toasters, and other crumb-catching appliancesKitchen fires can be caused by ovens, toasters, and other cooking appliances that have crumbs and other burnt food deposits. Since people tend to stay home and use their ovens more during colder months—not to mention entertain more during the holiday season—ovens and toasters can get a more intense workout this time of year. Checking that your appliances are clean and hazard-free in November can save you from a disaster down the road, not to mention that you'll be happier with cleaner appliances and less work during spring cleaning season.\n            \n    \n\n    \n        Smarter Home & Living Newsletter\n            Never miss a story\n        \n        \n            Lindsey Ellefson\n            \n        \n        Get the latest smart home news, trends, and advice from Lindsey and the team.\n    \n    \n        Smarter Home & Living Newsletter\n            Never miss a story. Get the latest smart home news, trends, and advice from Lindsey and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Five Home Maintenance Tasks You Should Tackle Before November Ends",
      "image": [
        "https://lifehacker.com/imagery/articles/01JBV5A3SP6BS56VTN5WJN5JC3/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-25T14:45:00.000Z",
      "dateModified": "2025-11-25T14:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Electric Hand-Sander Makes Large DIY Projects More Tolerable",
    "url": "https://lifehacker.com/home/this-bosch-electric-hand-sander-is-a-diy-upgrade?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAVCDQ3RD3ZT71RH94ZFAAS2/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-24T17:45:04.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on this page.\n    \n            Credit: Amazon/Lifehacker\n                            \n    Table of Contents\n    \n        \n        No one ever tells you how much of your adult life will be spent sanding things down. Drywall? Sanding. Every piece of wood you cut and install in a DIY project? Sanding. Want to repair or refinish your floors, or furniture? Yup, probably sanding. And there’s nothing worse than laboring over a large sanding project—you feel it in your arms and back for days, and your hand starts to cramp holding that buzzing hand sander for long periods of time. That is, until I picked up this palm sander from Bosch, which is so comfortably designed, I haven’t hated sanding since—and my Tylenol consumption has plummeted. If you use a hand sander frequently, this will definitely be an upgrade for you.\nThe wood stairs in my old house have a lot of character, which is a polite way of saying they are beat up. I’m not in the market to replace both staircases, though, so I try to keep them in good shape. I recently decided to sand them down and repaint them, and wasn’t looking forward to the process. I needed a new hand sander, so after a bit of research that praised the GSS20-40’s comfort, I picked one up for the job. It was a great experience.The first reason I love this hand sander is that it’s relatively quiet and doesn’t buzz as much as others—there’s a lot less vibration. That vibration can be very fatiguing over long periods of use, so cutting it down makes a huge difference both in how comfortable the tool is to use generally and how long you can tolerate it. And the longer you can tolerate using the tool, the more you can accomplish.\nThe GSS20-40 also has a very comfortable two-handed grip. You can use it one-handed, but I always wind up using two hands because I feel more in control of the tool. Normally, this is pretty awkward, because most hand sanders have pommels that are just a bit too small for two-handed operation, but with this model it works well.\n            \n                What do you think so far?\n            \n        \nThe sander is well-designed in general. The speed dial is on the back, and it’s easy to adjust depending on the material and results you’re getting. It’s a sheet sander, with sandpaper clamping into place over the pad. I’ve had trouble with shifting paper in previous sanders, but the Bosch held the sheets in place reliably.This is a corded tool—one of the few corded tools I still use, actually. I hate having to deal with extension cords like it’s 1995, but I think the comfort and performance make it well worth the extra trouble. If you’re going to be doing a lot of sanding at some point, definitely check this one out—your arms and back will thank you.\n            \n    \n\n    \n        Smarter Home & Living Newsletter\n            Never miss a story\n        \n        \n            Lindsey Ellefson\n            \n        \n        Get the latest smart home news, trends, and advice from Lindsey and the team.\n    \n    \n        Smarter Home & Living Newsletter\n            Never miss a story. Get the latest smart home news, trends, and advice from Lindsey and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Electric Hand-Sander Makes Large DIY Projects More Tolerable",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAVCDQ3RD3ZT71RH94ZFAAS2/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-24T17:45:04.000Z",
      "dateModified": "2025-11-24T17:45:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Says It Isn't Using Your Emails to Train Its AI",
    "url": "https://lifehacker.com/tech/google-says-it-isnt-using-your-emails-to-train-its-ai?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAVAHNKZTHHQZ5JJ6QRR0G4Q/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-24T17:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n            Credit: Tada Images/Shutterstock\n",
    "body": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Last week, claims spread across the internet that Google was secretly collecting users' private messages to train Gemini.\n                                            The claims center on the company's \"smart features\" settings, and suggest Google opted users into these settings to scrape their data.\n                                            Google denies this, pointing to the fact that \"smart features\" has existed for years, and is opt-in only.\n                                            Smart features also has no control over AI training, and is used for personal customization only.\n                                    \n            \n    Table of Contents\n    \n        \n        Last week, tech headlines were abuzz with a concerning claim: According to some on social media platforms, and even some news outlets, Google had secretly opted Gmail users into sharing their emails with Gemini. The goal? To train Google's AI. While this controversy set off quite a lot of noise, it appears much of the conversation kicked off with this inflammatory post on X, complete with select words in all caps: \n    \n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \n\nAccording to the poster, the only remedy for the situation is to disable a setting you've probably never heard of: \"smart features.\" The claims suggest \"smart features\" was switched on in two locations on your account: One that controls Gmail, Chat, and Meet, and another that enables it in the larger Google Workspace suite—assuming you have a Workspace account. The \"smoking gun\" is a small part of Google's privacy policy which says that the company does not use your Workspace data to train its AI models, without permission. Taken at face value, the assertion is that Google opted you into these settings, thus taking your \"permission\" to start using your data for this AI training. As of this morning, the post has nearly 150,000 likes on X, but the claims spread far and wide across the internet. Even Malwarebytes ran a story explaining the situation, and urging users to disable these settings to keep their messages out of Google's AI training. As it turns out, however, Google doesn't actually appear to be doing this. \nWhat are \"smart features?\" I reached out to Google on Friday to see if the company had any comment concerning these claims. In response, I received the following from a Google spokesperson:\"These reports are misleading—we have not changed anyone’s settings, Gmail Smart Features have existed for many years, and we do not use your Gmail content for training our Gemini AI model. Lastly, we are always transparent and clear if we make changes to our terms of service and policies.\"Indeed, \"smart features\" has existed for years. In fact, Lifehacker first covered the setting back in 2020, nearly three years before Google first launched Bard (now Gemini). To the claimants' credit, smart features does use your data to improve Google features, but not to train AI models en masse. Instead, smart features uses your data to customize your specific Google experience. In Gmail, that might mean learning how you write, to generate more relevant smart replies; in Search, that might mean suggesting keywords based on previous searches; in Maps, that might mean showing restaurant reservations; in Wallet, that might mean recommending tickets for shows based on your interests. Smart features also powers core Google features, like spam filters and categorization.That's not to say that you should necessarily be down for smart features: If you personally don't care for Google collecting your data to customize your personal experience, you can absolutely turn these features off. But it's important to understand what you're choosing to turn on or off: Just because someone claims that these features are doing something doesn't make it true. Turn off smart features if you want, but just know that it has no impact on how Google handles your private messages, or how it trains its AI models for everyone. Plus, it may impact how apps like Gmail function: You may not be able to sort your emails into categories, or stop certain spam from getting into your inbox. How to disable \"smart features\"If you do want to turn off smart features, it's easy to do. You'll find the settings in the Gmail web app: Click the settings gear, then choose \"See all settings.\" Here, scroll down, and disable the toggle next to \"Smart features.\" You'll need to agree to \"Turn off and reload\" Gmail in order to see the changes take effect. \n            \n                What do you think so far?\n            \n        \nIf you have a Workspace account, you have another settings page to manage. Click \"Manage Workspace smart features settings,\" then disable the toggles next to \"Smart features in Google Workspace\" and \"Smart features in other Google products.\" Finally, choose \"Save.\" Just remember: These settings control a number of smart features across your Google products. As such, you might notice certain features missing going forward. To revert your changes, return to these settings pages at any time and flip the toggles back on.  Google isn't in the clearThe dust has settled since controversy's peak last week. Malwarebytes issued a correct to its original article, sharing the same spokesperson statement I received. The site says that Google's vague rewrite of the smart features setting contributed to this confusion, but that it does appear the setting doesn't scrape users' private messages to train Gemini. However, that's not to say Google is entirely in the clear here. While this specific claim might not be true, a lawsuit claims the company improperly gave Gemini private user data from Gmail, Chat, and Meet without the permission of those users. Google as a whole doesn't have the best reputation when it comes to respecting users' privacy too, so it's not surprising that these claims took off the way they did.  Malwarebytes also makes the point that while Google says these settings are all opt-in, many users don't actually remember opting in themselves, further fueling confusion around smart features. To be candid, I definitely don't remember enabling smart features on either my personal or work Gmail accounts, though it's entirely possible I did. All I know is these settings are on now, and while I'm considering disabling them, I also don't know if I'd be willing to get rid of all smart features. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Says It Isn't Using Your Emails to Train Its AI",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAVAHNKZTHHQZ5JJ6QRR0G4Q/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-24T17:00:00.000Z",
      "dateModified": "2025-11-24T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Some Americans Are Boycotting Black Friday This Year",
    "url": "https://lifehacker.com/money/why-some-americans-are-boycotting-black-friday-this-year?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAKMD91GB80PHT8JDZ4EWWAJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-24T18:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n            Credit: Zooey Liao/Lifehacker/Get",
    "body": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Table of Contents\n    \n        \n        This post-Thanksgiving weekend, a growing number of Americans have pledged that they won't be camping outside stores or refreshing their browsers for deals. Instead, they're participating in coordinated boycotts that aim to turn one of the biggest shopping events of the year into a statement about economic power, inequality, and corporate influence in American life.What are the Black Friday boycotts?Two major boycott campaigns are underway during the 2025 holiday shopping season. The first, called \"Mass Blackout,\" is a coalition effort involving grassroots groups including Blackout the System, The People's Sick Day, American Opposition, the Money Out of Politics Movement, and The Progressive Network. Running from Nov.25 through Dec. 2, this weeklong economic protest asks Americans to stop shopping at major retailers, halt their streaming service subscriptions, avoid nonessential travel, and even refrain from working if possible.“No spending. No work. No surrender. The system isn’t broken. It’s working exactly as designed—for the wealthy,” says the homepage of the Mass Blackout website. This isn't about hurting small business or communities, but targeting major corporations that \"that profit from injustice, fuel authoritarianism, and crush worker power.”\nThe second campaign, \"We Ain't Buying It,\" is spearheaded by organizations like Black Voters Matter, Indivisible, and Until Freedom. This effort specifically targets major retailers, including Amazon, Target, and Home Depot, during the crucial Black Friday through Cyber Monday period.Both campaigns share similar goals: to demonstrate that everyday consumers and workers hold real economic power, and to protest what organizers see as a political and economic system that serves billionaires and corporations rather than ordinary Americans.Why the Black Friday boycotts are happeningThe timing of these campaigns is no accident. The five-day period from Thanksgiving through Cyber Monday (also known as the \"Cyber Five\"), accounts for approximately 17% of all holiday season sales. It's when retailers are most vulnerable to consumer action—and when consumers have the potential to make the biggest impact.The movements are responding to what they see as an increasingly divided economy, one in which the gap between the richest and poorest Americans continues to widen. \"This isn't about left versus right,\" reads the Mass Blackout website, \"this is about people versus power.\" The goal is a collective refusal to participate in a system where special interests and billionaires shape policy, while working people are exploited and democratic norms are eroded. LaTosha Brown, co-founder of Black Voters Matter Fund, said on CNN that the effort isn't a mere boycott, but a consumer action: \"We're sending a message to companies that when they align with policies that harm us, we will not support them,\" she said. In other words, don't let the word \"boycott\" make you think this is solely an economic movement. It's a political and personal one, too. These aren't isolated protests either—nor are they as fruitless as they may seem to cynics. Throughout 2025, boycotts have proven effective in shifting corporate behavior. Target recently reported declining sales partially attributed to customer backlash over its rollback of diversity, equity, and inclusion initiatives. This points to the fact that consumer action really can impact even retail giants.How to meaningfully participate in a Black Friday boycottParticipating in these boycotts (or consumer actions) doesn't require taking dramatic action. The core principle is simple: pause unnecessary consumption during this period, and reconsider your relationship with shopping. It's not just about \"not spending,\" but actually rerouting that time and money back into your own community.If you're interested in participating, here's what organizers suggest you do:\n            \n                What do you think so far?\n            \n        \nAvoid major corporations. The boycotts specifically target large retailers that dominate the market. If you need to make purchases, support small, local, or independent businesses instead. Small Business Saturday on Nov. 30 is explicitly excluded from the boycott for this reason.Reduce digital consumption. Log off streaming platforms, cancel or pause subscriptions you're not using, and avoid ad-driven platforms unless you're using them for organizing. This removes your engagement from the attention economy that drives corporate profits.Consider a \"working strike.\" Remember \"quiet quitting?\" For those who can't take time off work, organizers suggest working to rule (doing only what's required), going slow, or simply showing up without extra effort. Stop impulse shopping. Black Friday has become synonymous with deals that create urgency, with \"limited time only\" sales designed to trigger immediate purchases. Before buying anything, ask yourself: Do I actually need this, or am I responding to marketing? Will I still want this item in a week? This pause alone can be powerful, and give you time to reconsider shopping at local businesses instead.If you're unable to join the economic shutdown directly, or if you're looking for a way to support those who are, you can take action by donating to mutual aid here. Apolitical reasons to consider participating in a Black Friday boycottEven if you're not politically motivated to participate in these boycotts, there are compelling personal reasons to step back from Black Friday shopping this year.First, most Black Friday \"deals\" aren't as good as they appear. Retailers often inflate original prices to make discounts look more impressive, or offer deals on older models and inferior products. Whatever sense of urgency you feel when shopping this week, remember it's by design. Even if you aren't compelled by the bigger political movements going on, it's worth taking a step back from Black Friday shopping for your own sanity (and wallet). Perhaps most importantly, participating in a boycott—even partially—is an opportunity to reclaim agency. In a consumer culture that constantly pushes us to buy more, choosing not to participate can be surprisingly liberating. It's a chance to align your spending with your values and to recognize that you have power in the economy.The bottom lineWhether or not these boycotts significantly impact retail sales remains to be seen. Economists note that short-term boycotts often face challenges because consumers simply shift their spending to other times. However, organizers argue that the act of participation itself matters—it demonstrates economic consciousness and solidarity that can build into long-term collective action.What is already clear is that these movements reflect growing frustration with economic inequality and corporate power. They're attempting to transform Black Friday from a celebration of consumerism into a moment of collective reckoning about who holds the power in the American economy.You don't have to join a political movement to benefit from stepping back this Black Friday. Simply pausing, questioning whether you really need to shop, and avoiding impulse purchases you'll regret later is a form of participation. Before you reach for your wallet or click \"add to cart,\" take a moment to consider: What if you just didn't? What if instead of shopping, you spent time with people you care about, engaged with your community, or simply rested? In a culture that equates shopping with happiness and consumption with success, sometimes the most radical thing you can do is nothing at all.\n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Some Americans Are Boycotting Black Friday This Year",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAKMD91GB80PHT8JDZ4EWWAJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-24T18:00:00.000Z",
      "dateModified": "2025-11-24T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Best Budget Running Watch Is 20% Off for Black Friday",
    "url": "https://lifehacker.com/health/suunto-run-watch-sale-black-friday-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KB0FZSDNEK5KCE2RHPVXSGX8/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-26T16:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 26, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 26, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Image courtesy of Amazon.\n                            \n    Table of Contents\n    \n        \n        Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over. Follow our live blog to stay up-to-date on the best sales we find.Browse our editors’ picks for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.Subscribe to our shopping newsletter, Add to Cart, for the best sales sent to your inbox.Sales are accurate at the time of publication, but prices and inventory are always subject to change. One of my favorite affordable running watches just got even more budget-friendly. The Suunto Run is on sale for $199, down from its usual $249 price tag. That's a solid 20% discount (or $50 off) for Black Friday.\nMy colleague Beth Skwarecki reviewed the Suunto Run and really enjoyed it. She found it to be lightweight, with a bright display and excellent GPS and heart rate accuracy. As a big runner myself, I know the Suunto is something of a cult classic: a niche pick for runners who want simplicity without sacrificing quality. For runners who want reliable tracking and solid performance without breaking the bank, this is an excellent option.More Suunto deals for Black FridayIf you're looking at other models in the Suunto lineup, several are discounted right now:Suunto Race S: $279 (normally $349)Suunto Vertical: $339.15 (normally $399)Each of these watches offers different features depending on your training needs, but the Run remains my top pick for a quality budget option.If you've been holding off on upgrading your running watch (or finally investing in your first one), this Black Friday discount makes the Suunto Run one to consider. At $199, you're getting a capable, reliable running companion.\n            \n                What do you think so far?\n            \n        \nHow long do Black Friday deals really last?Black Friday sales officially begin Friday, November 28, 2025, and run throughout “Cyber Week,” the five-day period that runs from Thanksgiving through Cyber Monday, December 1, 2025. But Black Friday and Cyber Monday dates have expanded as retailers compete for customers. You can get the same Black Friday sales early, and we expect sales to wind down by December 3, 2025. Are Black Friday deals worth it?In short, yes, Black Friday still offers discounts that can be rare throughout the rest of the year. If there’s something you want to buy, or you’re shopping for gifts, it’s a good time to look for discounts on what you need, especially tech sales, home improvement supplies, and fitness tech. Of course, if you need to save money, the best way to save is to not buy anything. Are Cyber Monday deals better than Black Friday?Black Friday used to be bigger for major retailers and more expensive tech and appliances, while Cyber Monday was for cheaper tech and gave smaller businesses a chance to compete online. Nowadays, though, distinction is almost meaningless. Every major retailer will offer sales on both days, and the smart move is to know what you want, use price trackers or refer to guides like our live blog that use price trackers for you, and don’t stress over finding the perfect timing.\n            \n                    Our Best Editor-Vetted Early Black Friday Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Best Budget Running Watch Is 20% Off for Black Friday",
      "image": [
        "https://lifehacker.com/imagery/articles/01KB0FZSDNEK5KCE2RHPVXSGX8/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-26T16:30:00.000Z",
      "dateModified": "2025-11-26T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Base Amazon Kindle Is Down to $80 for Black Friday",
    "url": "https://lifehacker.com/tech/the-base-kindle-is-down-to-80-dollars-for-black-friday?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAY1JJ04ZQ2F1X1Z7FKR8FZS/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-25T18:16:48.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 25, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 25, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over. Follow our live blog to stay up-to-date on the best sales we find.Browse our editors’ picks for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.Subscribe to our shopping newsletter, Add to Cart, for the best sales sent to your inbox.Sales are accurate at the time of publication, but prices and inventory are always subject to change.The base Amazon Kindle is one of the cheapest ebook readers that you can buy right now. Even better, the 2024 version was updated with a new screen, and a trendy new \"matcha\" color option.Currently, you can get the base Kindle 16GB model with Lockscreen Ads for $79.99. That’s a $30 discount off the usual price of $109.99. The model without Lockscreen Ads is also discounted to $99.99 (down from $129.99). This is the lowest price we’ve seen for the base Kindle, ever. That makes this pretty tempting, since because the Kindle is already one of the cheapest e-readers out there, it doesn’t go on sale that often.\nThe 2024 Kindle comes with a 6-inch e-Ink display with 16GB storage and a screen with 94 nits of brightness (25% brighter than before). The new updated screen with 300 PPI pixel density is also now as bright as the Kindle Paperwhite, which retails for $159.99 (and is currently discounted to $124). There’s also an updated processor that promises faster page turns. It still offers the same 6-week long battery life, too. The Kindle measures 6.2 x 4.3 x 0.32 inches (HWD) and weighs 157 grams. The device has a USB-C port for charging and manually transferring books and files. The 16GB storage should be good for thousands of books.The Amazon Kindle comes with the standard Kindle software, where ebooks bought using Amazon will show up automatically on your device. You can also use Amazon’s Send to Kindle feature to wirelessly transfer your own books to the Kindle. There’s also Goodreads integration and a recommendation engine to help you discover more books to read.In PCMag's review, the Amazon Kindle (2024) received a 3.5-star “Good” rating. PCMag noted that “We like its small size and consistent lighting, and even though it isn't as fast as the Paperwhite, it works perfectly well.”If you have the extra $70 to spend, you can also consider the Kindle Paperwhite, which comes with a bigger screen, faster page turns, a waterproof body, a longer battery life, and the option for warm backlighting.\n            \n                What do you think so far?\n            \n        \nDoes Amazon have Black Friday deals?Yes, Amazon has Black Friday sales, but prices aren’t always what they seem. Use a price tracker to make sure you’re getting the best deal, or refer to guides like our live blog that use price trackers for you. And if you have an Amazon Prime membership, make the most of it.What stores have the best sales on Black Friday?Nowadays, both large retailers and small businesses compete for Black Friday shoppers, so you can expect practically every store to run sales through Monday, December 1, 2025. The “best” sales depend on your needs, but in general, the biggest discounts tend to come from larger retailers who can afford lower prices: think places like Amazon, Walmart, Target, Best Buy, and Home Depot. You can find all the best sales from major retailers on our live blog. Are Cyber Monday deals better than Black Friday?Black Friday used to be bigger for major retailers and more expensive tech and appliances, while Cyber Monday was for cheaper tech and gave smaller businesses a chance to compete online. Nowadays, though, distinction is almost meaningless. Every major retailer will offer sales on both days, and the smart move is to know what you want, use price trackers or refer to guides like our live blog that use price trackers for you, and don’t stress over finding the perfect timing.\n            \n                    Our Best Editor-Vetted Early Black Friday Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Base Amazon Kindle Is Down to $80 for Black Friday",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAY1JJ04ZQ2F1X1Z7FKR8FZS/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-25T18:16:48.000Z",
      "dateModified": "2025-11-25T18:16:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]