[
  {
    "title": "12 Hacks Every Roku User Should Know",
    "url": "https://lifehacker.com/tech/hacks-every-roku-user-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFGGX99JJJD4W78EZ93VERA2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-27T14:00:00.000Z",
    "description": "\n    \n                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n         ",
    "body": "\n    \n                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        January 27, 2026\n            \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        Roku was one of the original names in streaming, and even with so many options now available from Amazon, Apple, Google and others, it remains one of the most popular options thanks to its affordable boxes and streaming sticks and widespread availability as an integrated operating system on some TV sets. The platform is speedy, simple, and supports just about every streaming app out there.If you've got a Roku or two in your life, you may not be using it to its full potential. These tips, hacks, and hidden features should help you go beyond the basic business of launching your streaming apps and get more out of your hardware, whether you've just unboxed your first Roku device, or you've been using one for years.Set up PIN protection to protect your RokuIf you've got young kids or nosy housemates living with you, you can lock certain parts of the Roku experience (including making purchases and adding new channels) behind a PIN number. This is actually done through your Roku account page on the web: Click PIN/parental controls on the left, and you can set a new PIN or change an existing one.Change the look and feel of your Roku with a new themeYou don't have to settle for the standard Roku interface visuals—you can easily switch to a different theme (which basically means a different wallpaper and screensaver). From Settings on your device, choose Themes to see alternatives provided by Roku and other people in the Roku community. You can always pick Restore default theme to go back to the original look.Enable captions on replayYou might not want closed captions on all the time, but you can have them enabled whenever you skip backward. From the home screen, pick Settings > Accessibility > Captions mode > On replay to enable this. Note that the streaming app you're using needs to support the feature as well, so it may not work everywhere.Put your most-watched apps up topThis is a simple and effective one that you might not have got around to doing: You can organize the apps on the home screen so your most-used are nearer the top and easier to get to. Select any tile on the home screen, press the star button on your remote to bring up the context menu, and you'll see the Move app and Move app to top options.Make use of Guest Mode when you have company\n    \n            \n            Roku devices come with a Guest Mode included.\n                                        Credit: Lifehacker\n                    \n    \nIt's great having guests—but don't let them mess up your recommendations and viewing progress. You can put your Roku device into Guest Mode by opening Settings from the main Roku menu, then choosing Guest Mode > Enter Guest Mode. You'll be signed out of all your apps, and the Roku device will restart ready for someone else to use it.Send your photos to your Roku to view them on the big screenYou won't always be watching films and shows on your Roku of course—and when your streaming device isn't doing anything else you can get images from your Google Photos library up on your TV. To set this up, you need to head to the Photostreams page on the Roku website, sign in using your account, and then follow the instructions online.Set up a cross-platform Roku watchlistThere will often be times when you see something interesting, but don't have time to watch it right away, and that's when the Roku watchlist feature can help. Select any movie or show from the home screen, and on the listing page use the Save button to add it to your list: You can then pick Save List from the main menu to see what you've saved.Pair your Bluetooth headphones to your RokuIf you've got a pair of wireless Bluetooth headphones and a Roku device that supports Bluetooth, you can pair the two together for some private audio listening— handy if you don't want to disturb anyone around you. You can do this by heading to Settings from the main Roku menu, then choosing Remotes & devices > Wireless headphones.\n            \n                What do you think so far?\n            \n        \nListen to your Roku via your smartphoneThere's another way to listen through headphones, and it doesn't require Bluetooth or wireless headphones. If you install the aforementioned Roku app on your smartphone, then plug a pair of headphones into your phone as well, you can tap Remote control in the app and then the headphone button to stream the audio right to your ears.\n    \n            \n            You can use the mobile app to listen over headphones.\n                                        Credit: Roku\n                    \n    \nMirror your other devices to your RokuApple devices: Roku sticks, boxes and TVs come with support for the Apple AirPlay standard built right in, so you can beam across audio and video from Apple devices, or even mirror your Mac display on the big screen. On the Roku, choose Settings then Apple AirPlay and HomeKit to make sure you're set up, then just select the AirPlay button on your Apple hardware.Android devices: For screen casting, you're not left out if you're on Android, though—as usual with Android—capabilities vary between devices. Samsung Galaxy phones have the smoothest integration: Swipe down with two fingers from the top of the screen, choose Smart View, and your Roku should show up as a connection option (if it's on the same wifi network).Windows devices: If you want to mirror your screen to a Roku from Windows, the process is different again. First, enable the feature on the Roku via Settings > System > Screen mirroring. Next, from Windows, click the volume and wifi icons down in the lower right corner, click the Display button, then select your Roku. Again, it needs to be on the same wifi network.Quickly find the cheapest way to rent a show or movieIf you're in the mood for a movie rental, then you've got a whole host of different streaming services to choose from—all the big ones offer film rentals on top of the content you get with your subscription. Use the Search option from the main Roku menu to look for a title, and compare the different prices across all the services you're signed up to.Control your TV with your Roku remoteYou can turn your TV on and off and adjust its volume with your Roku remote, if you'd like to. You're asked if you want to do this when you first set up your Roku device, but you can configure it afterwards too: Pick Settings > Remotes & devices > Remotes, then choose the remote you've currently got connected, and then pick Set up remote for TV control.\n            \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n                        \n                \n            \n                    \n                                            \n                \n            \n                David Nield\n                                \n                                            David Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. \n                                    \n                Read David's full bio\n                            \n        \n                \n                                            \n    More by David\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "12 Hacks Every Roku User Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFGGX99JJJD4W78EZ93VERA2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-27T14:00:00.000Z",
      "dateModified": "2026-01-27T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Five Daily Learning Apps to Try After Duolingo",
    "url": "https://lifehacker.com/tech/five-daily-learning-apps-to-try-after-duolingo?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFM4A41GNP62VZSFT3DZ3AM2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Ascannio/Shutterstock\n                            \n    Table of Contents\n    \n        \n        Duolingo, no matter how you feel about it, accomplishes one thing: It makes practicing a skill every day easy. The application focuses on language, but it also offers math, music, and even chess lessons if you dig around a bit. There are many other subjects worth learning, though, and many ways you can use gamification to learn new skills and generally improve your life. Here are five I found:Learn geography with Globo\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nI love traveling and learning about the world, but I'll admit there are some regions I don't know well. Globo is an iOS and Android app that quizzes you on flags, capitals, and more, all while teaching you trivia along the way. There are courses for all the continents, if you want to focus on a specific region, or you can take the combined global course and work your way through the whole planet. I've been playing with this for about a week and enjoying it for the most part. I like the way questions I answered wrong show up in future quizzes. It does feel like I'm going to run out of content fairly quickly, which is disappointing, but given that the application is free with no in-app subscriptions, I think it's worth checking out. \nLearn art history with Learn Art\n    \n            \n            \n                                        Credit: Normand Martin\n                    \n    \nLearn Art is a free iPhone and iPad application by developer Normand Martin. With it, you'll find a slideshow of classic art from European history. To learn the history of the piece, tap the screen. You can also take an interactive quiz on art history. I'm going to be honest: Art history is very much not my subject. In playing with this for a couple days, though, I find myself able to identify more artists than I did before, and if nothing else, it's nice to have access to high resolution scans of so many classic works of art right on my iPad. If you're at all curious about art history, I'd say give it a spin. The app is free but there is an in-game currency you can earn either by answering questions correctly or spending money. In my testing this wasn't too much of a burden. Learn instruments with Yousician\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nI've been meaning to get back into playing guitar for a while, so I've been testing various apps. Yousician seems like a great starting point, assuming in-person instruction isn't an option. This application uses the microphone on your device so you can use a real instrument to learn actual songs. The guitar version, which I tried for a few days, combines video instruction with Guitar-Hero style practice sessions. There's even a backing track during the early lessons, which might help anyone who'd prefer to play along to an actual song. This makes the early stages of learning an instrument, which can be a drag, feel fun. \n            \n                What do you think so far?\n            \n        \nThere are also courses for piano, ukulele, bass, and singing. If you want to get a feel for it, there is a limited free version, but you might need to tap the \"X\" on the prompt to enter your credit card number if you don't want to pay. Plans start at $7.49 per month.Learn typing with TypingClub\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nWish your typing was faster, or more accurate? The free website TypingClub is perfect for this. It offers touch typing lessons starting from the very basics with tests to work your way up. Lessons unlock as you go. If the early lessons are too easy for you, you can always take a test to earn a higher placement. Memorize anything with Anki's flash cards\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nI didn't grow up in the U.S., meaning I didn't learn the state capitols and locations as a kid. At one point I was tired of not knowing where anything is, so I downloaded Anki. This is an open source application for every platform that makes it easy to learn using flash cards. The system is all about self accountability: You report how easily you were able to come up with the right answer. The system is set up to keep exposing you to the things you find hard. You can design your own decks, if you want, or you can use any of the thousands of decks offered on the website. I, having mastered U.S. states, am moving on to learning the Mexican ones. I'm sure there's something you're interested in memorizing, too.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Five Daily Learning Apps to Try After Duolingo",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFM4A41GNP62VZSFT3DZ3AM2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T14:00:00.000Z",
      "dateModified": "2026-01-26T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Cold Is Too Cold to Run Outside?",
    "url": "https://lifehacker.com/how-cold-is-too-cold-to-run-outside?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GG4A4DBB0KW3QA3HF3PPR/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-23T17:30:00.000Z",
    "description": "\n        \n        Dedicated runners and winter athletes will tell you that exercising in the cold is not as tough as it looks. Personally, I'd rather ",
    "body": "\n        \n        Dedicated runners and winter athletes will tell you that exercising in the cold is not as tough as it looks. Personally, I'd rather risk frostbite over any treadmill run that lasts longer than 20 minutes. But is there a point where winter runs cross over from difficult to dangerous? There is no clear cut-offMost experts suggest that the danger zone begins around -18°F (-28° Celsius), particularly when factoring in wind chill. At these extreme temperatures, the risk of frostbite increases dramatically, and breathing frigid air can become uncomfortable or even harmful to your lungs and airways.But beyond the raw temperature, certain conditions should prompt you to choose the treadmill over the trail. Wind chill matters significantly more than the actual temperature—a 20°F day with 25 mph winds feels like -4°F and carries similar risks. Precipitation combined with cold is particularly dangerous, as wet clothing rapidly accelerates heat loss.\nIcy conditions create obvious fall risks, and a twisted ankle or other injury becomes far more serious when you're miles from home in subzero temperatures. If the footing is treacherous with ice or you're unable to adequately protect your extremities with the gear you have available, it's wise to skip the outdoor run. Trust your instincts: If the cold feels genuinely painful within the first few minutes rather than just uncomfortable, that's your body sending a clear message.Again, this threshold isn't absolute. Your personal cold tolerance, experience level, the gear you own, and specific weather conditions all play a role. I know I've managed runs in 10°F, mostly because it was plenty sunny, with no wind, and I was expertly bundled up. Here are some of things to do if you’re a brave soul heading out to run in the freezing cold.If you do venture out in very cold weather, preparation is everything. Dress in layers using moisture-wicking base layers, insulating middle layers, and windproof outer shells. Protect your extremities carefully with gloves or mittens, a hat or headband, and warm socks. A neck gaiter is a must-have to pull up over your nose and mouth to help warm the air before it reaches the lungs.Start your run into the wind so you'll have it at your back when you're sweaty and more vulnerable to heat loss on the return trip. Keep your runs shorter and stay close to home or in areas with bailout options. Let someone know your route and expected return time. It also helps to physically modify your route to accommodate layers. Plan a run where you can shed extra layers after the first mile and then pick them up on your way back.\n            \n                What do you think so far?\n            \n        \nPay attention to your body throughout the run. Any numbness, excessive pain, confusion, or severe shivering means it's time to get indoors immediately. Remember that you can always cut a run short—there's no shame in prioritizing your safety over a workout.Another tip, from plenty of personal experience: Be extra aware of mouth-breathing while running in cold, dry air. I recommend running with cough drops in order to help you practice breathing through your nose.The bottom lineI always tell myself that if something feels off after my first mile, I’m allowed to turn around and walk home. Grant yourself extra leniency in extreme weather conditions. If you really can’t bear missing any miles, consider a hybrid plan of running half of your route outdoors and half on a treadmill.You can run outside at quite chilly temperatures before you seriously risk frostbite or any other cold-weather consequences. For most runners, the practical limit for safe outdoor running falls somewhere between 0 and -20°F. As long as you’re prepared with protective gear, you can listen to your body to acclimate to cold temperatures as best as you personally can. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Cold Is Too Cold to Run Outside?",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GG4A4DBB0KW3QA3HF3PPR/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-23T17:30:00.000Z",
      "dateModified": "2026-01-23T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yahoo! and Yahoo! Mail Are Down, Reminding Everyone They Still Exist",
    "url": "https://lifehacker.com/tech/yahoo-and-yahoo-mail-down?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFGGGKQJHC84A6YZPFJV4NRQ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-21T14:57:19.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 21, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Rokas Tenys/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Yahoo! is currently down.\n                                            Yahoo!'s website, including Yahoo! Mail and AOL Mail, are not responding.\n                                            Downdetector shows almost 9,000 user reports as of 9:50 a.m. ET.\n                                    \n            \n    Table of Contents\n    \n        \n        Your eyes don't deceive you: You did just read a headline in the year of our lord 2026 about Yahoo! Despite losing out to other search engine and email companies like Google, Yahoo! is very much still a thing. In fact, one statistic claims Yahoo! Mail still has 225 million daily active users to this day. That's a ways off from Gmail's 1.8 billion daily active users, but way better than AOL's eight million users. (Yes, AOL is still a thing, and is actually a part of Yahoo!—at least until its sale to Bending Spoons goes through).But I'm not here to talk about Yahoo! and AOL's marketshare. Instead, I'm here to sound the alarms to the millions of people that use Yahoo!, and, by extension, AOL: The services were down this morning. If you tried to search the web for something on Yahoo!, or check your Yahoo! Mail, or even your AOL Mail, you'd find the following error message: \"Edge: Too Many Requests.\" I first spotted the outage via Downdetector, owned by Lifehacker parent company Ziff Davis, which had tens of thousands of user reports, before falling off by 10:30 a.m. ET. Since then, the sites are back online.\n            \n                What do you think so far?\n            \n        \nThere's no official reason for the outage from Yahoo! as of this article, but, like most of these outages, the company resolved the issues fairly quickly. Last week, X had an outage, and it came back online before long. Of course, that outage was overshadowed by the massive Verizon outage, which Verizon claimed was simply a \"software issue.\" There's a big difference between a series of web sites going down and a nationwide cell network, however, so it's not surprising Yahoo! and AOL alike were both back online this morning. The millions of users who rely on these services now have them back, while the rest of us can forget about them all over again.  \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yahoo! and Yahoo! Mail Are Down, Reminding Everyone They Still Exist",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFGGGKQJHC84A6YZPFJV4NRQ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-21T14:57:19.000Z",
      "dateModified": "2026-01-21T14:57:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "All the Ways to File Your Taxes for Free in 2026",
    "url": "https://lifehacker.com/money/how-to-file-your-taxes-for-free?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JJMDMTGR2V2YW4G68G62DNK9/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-26T17:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Tax season is here again, which means it is time to start working on preparing your return (and paying any balance due) ahead of the April 15 filing deadline. As usual, many people will have the option to file their returns for free, but the options are more limited this year, as the short-lived IRS Direct File program, which provided no-cost filing to taxpayers in 25 states, is no more. If you want to avoid paying for the privilege of paying your taxes, here are the remaining ways to file for free in 2026. IRS Free File is one of several free filing options provided by the IRS. With Free File, you complete your tax return using guided software via a partner site, which then e-files it with the IRS. Most commonly used federal tax forms and schedules are available through Free File. However, your adjusted gross income must have been $89,000 or less in 2025 to be eligible for this option. \nIf you do qualify for Free File, go directly through the IRS website—you'll see a list of trusted third-party preparers with their eligibility criteria, or you can use the guided tool to find the best option for your situation. Note that some IRS partners will also file your state return for free, while others charge an additional fee. \n            \n                What do you think so far?\n            \n        \nOther ways to file your taxes for freeIf you make too much for IRS Free File, you may still be able to file your taxes for free. Free Fillable Forms: This option is just like it sounds. You enter your information into the IRS' fillable forms using the provided instructions and file the return yourself. There are no income limits for Free Fillable Forms, but it does have limited guidance, and state returns are not included. You will still need to create a Free File account. Commercial tax software: If your taxes are relatively simple, you can go through tax preparation companies like TurboTax and H&R Block without paying any fees. Cash App Taxes is another free option. Note that these companies also have paid services, so make sure you understand what you are signing up for. Volunteer tax prep help: The IRS offers free tax prep support for eligible taxpayers through the Volunteer Income Tax Assistance (VITA) and the Tax Counseling for the Elderly (TCE) programs. Taxpayers who make less than $69,000 per year, who have disabilities, or who have limited English proficiency qualify for VITA, while TCE supports those who are age 60 and older. Enter your zip code into the locator tool to find volunteer tax prep options in your area. MilTax: MilTax offers free tax preparation and filing for eligible military members, including up to three state returns. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All the Ways to File Your Taxes for Free in 2026",
      "image": [
        "https://lifehacker.com/imagery/articles/01JJMDMTGR2V2YW4G68G62DNK9/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-26T17:30:00.000Z",
      "dateModified": "2026-01-26T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "It's Not Just You, Microsoft 365 Is (Still) Down",
    "url": "https://lifehacker.com/tech/microsoft-365-is-down-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFGSCGZZ7Q0ZMYVDW6NWCC5S/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-22T19:53:30.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 22, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: aileenchik/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Microsoft is currently experiencing another outage with its services.\n                                            Users are reporting issues with Microsoft 365, Microsoft Teams, and Microsoft Outlook.\n                                            This is the second day in a row that Microsoft has experienced these downtimes.\n                                            If your apps are impacted, you'll need to wait for Microsoft to issue a patch.\n                                    \n            \n    Table of Contents\n    \n        \n        Heads up, workers of the world: Microsoft 365 is currently down. Microsoft's flagship work suite, which includes tools like Microsoft Teams and Microsoft Outlook, is currently experiencing issues impacting users. It's not yet clear exactly why these problems are occurring, but according to Downdetector (owned by Lifehacker parent company Ziff Davis) thousands of users are reporting issues.There are any number of causes that could trigger a widespread outage like this, and in all likelihood, Microsoft will have the issue isolated and fixed soon—especially considering how many companies and users rely on Microsoft 365 to function. But it does follow a number of high-profile outages this week. Yesterday, Yahoo! and AOL were both down. Last week, X experienced an outage, as did Verizon—quite famously, I might add. And this morning, Instagram was also down.\n            \n                What do you think so far?\n            \n        \nBut joining that list as well is none other than Microsoft itself. These services were all down yesterday, too, making this the second day in a row. Again, it's not clear why Microsoft is experiencing these issues, but while we wait for a fix, there's not much you can do on your end. If your Microsoft apps are acting up, you can try to work with any of the offline tools you have access to. If you have other means of communication other than Teams, run with that. There's nothing short of Microsoft issuing a patch on its end that will bring back online functionality here.     \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "It's Not Just You, Microsoft 365 Is (Still) Down",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFGSCGZZ7Q0ZMYVDW6NWCC5S/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-22T19:53:30.000Z",
      "dateModified": "2026-01-22T19:53:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "We Now Know What Caused the TikTok Outage",
    "url": "https://lifehacker.com/tech/tiktok-outage-cause?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFY3GDB84S524T0BHE3FZMSS/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T23:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: daily_creativity/Shutterstock\n                            \n            \n                Key Takeaways\n                                            TikTok experienced an outage on Sunday.\n                                            The company released a statement on Monday, attributing the issue to a power outage at a U.S. data center.\n                                            The app just experienced a change in ownership as the Chinese-based Bytedance officially divested its majority stake to U.S. companies.\n                                    \n            \n    Table of Contents\n    \n        \n        If you tried hopping on TikTok Sunday, you might have noticed something odd: the app wasn't working. Outages happen, of course, as anyone who has Verizon can attest. But in the moment, theories were flying left and right. TikTok had just officially moved into U.S. control, leading some to speculate that the outage had something to do with this change in ownership. As one user put it, \"TikTok being down days after the people they were forced to sell to take it over does not feel like a coincidence.\" As it happens, it does appear that the changing of the guard was responsible for the outage—just not in the way that some conspiracy theories might suggest. TikTok finally released a statement on X Monday morning, attributing the outage to issues at a U.S. data center. The statement is as follows: \"Since yesterday we’ve been working to restore our services following a power outage at a U.S. data center impacting TikTok and other apps we operate. We're working with our data center partner to stabilize our service. We're sorry for this disruption and hope to resolve it soon.\"   The outage might not be the only thing different about TikTokFor its part, TikTok is very much operational at the moment. If the issue really was just isolated to a power outage at this data center, that data center appears to have patched things up. But that doesn't mean the company's reputation is patched up. Users are accusing the app's new owners of changing the algorithm, complaining of reset For You Pages, irrelevant content in feeds, and AI-generated content. I've seen users accuse the app of blocking anti-Trump and anti-ICE content, while comedian Gianmarco Soresi says even some of his non-political TikToks have \"zero views,” which he attributes to the ineffectiveness of the people running the app. (I've reached out to TikTok for comment on user reports of changes to the algorithm and will update if I hear back.)\n            \n                What do you think so far?\n            \n        \nWe'll need more time to know whether or not there were serious changes made to TikTok's algorithm and user feeds in the wake of this sale. But the app is running—at least, for now.  \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We Now Know What Caused the TikTok Outage",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFY3GDB84S524T0BHE3FZMSS/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T23:00:00.000Z",
      "dateModified": "2026-01-26T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Stop This New Pixel Bug From Leaking Your Audio to Incoming Callers",
    "url": "https://lifehacker.com/tech/pixel-bug-take-a-message?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFKNQSZQJMDTC2Z5YQRWGVC6/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-22T21:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 22, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tyler Onove / Shutterstock\n                            \n            \n                Key Takeaways\n                                            A handful of Pixel users have experienced a bug with the Take a Message feature that records and sends audio to callers as they are leaving a voicemail.\n                                            It's important to note that this is not a widespread issue, and most of the reports come from people with older Pixel devices that no longer get OS updates.\n                                            You can disable Take a Message temporarily if you are concerned about this issue on your device.\n                                    \n            \n    Table of Contents\n    \n        \n        If you're a Pixel owner, you may want to update your settings for Phone by Google. 9to5Google reports that a handful of users have experienced a bug with the Take a Message feature that records and sends audio to callers as they are leaving a voicemail. Take a Message is a recently introduced feature for the Phone app that activates when the recipient is not available to answer (or declines the incoming call). The caller hears the following: “The person you have called is not available. Please leave a message after the tone.” If you, as the recipient, tap the Take a message notification on your device, you can see a transcript of the audio in real time and hit Answer if you want to pick up. (Take a Message will also detect spam calls and mark them with a warning.)A few users have reported that Take a Message has activated and allowed the caller to hear the recipient's background audio as they are leaving a message. It's important to note that this is not a widespread issue, and most of the reports come from people with older Pixel devices that no longer get OS updates. According to 9to5Google, Google is investigating the reports. \nAgain, while this doesn't seem to be a bug affecting most Pixel users, you can disable Take a Message if you are concerned about privacy, especially with unknown callers. \n            \n                What do you think so far?\n            \n        \nHow to disable Take a Message on your PixelOpen the Phone app on your device and tap the icon in the top-left corner to open Settings. Tap Take a Message under the Call Assist section and toggle the feature off. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Stop This New Pixel Bug From Leaking Your Audio to Incoming Callers",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFKNQSZQJMDTC2Z5YQRWGVC6/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-22T21:00:00.000Z",
      "dateModified": "2026-01-22T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Get Samsung Galaxy's Best Feature on Your Pixel (or Any Android)",
    "url": "https://lifehacker.com/tech/how-to-get-samsung-galaxy-best-feature-on-your-pixel-or-any-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFDNAD1YSQ1ND85BJHHDSG0H/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-20T15:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 20, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    \n        \n        I'm a devout Pixel user. I love stock Android, and I'm always running the latest Android beta, making Pixel basically my only choice. But there are times when I get jealous looking at all the extra tools that Samsung provides on its Galaxy phones, Edge Panel being the big one. With Edge Panel, you can swipe in from the edge of your phone and a hidden drawer reveals itself, filled with apps, system actions, and shortcuts. Given how barebones Pixel Launcher is, I've always wanted something like this. Then I found the Panels app by Fossor Coding (not to be confused with the ill-fated wallpaper app by MKBHD).In some ways, Panels is even better than Edge Panels on Samsung. It lets you use custom icon packs, there's a quick search shortcut, and you can even open floating widgets. Plus, because it's customizable, you can move the trigger point to the bottom edge of your phone instead of the side (incredibly handy for large phones), and you can add multiple columns (up to a ridiculous seven column layout). And while you can pay for Panels, all of that basic functionality is included for free.How to customize the Panels app for AndroidFirst, install the app and give it permission to display over other apps; this makes sure that the Panels launcher can work when you're using any app.\n\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nNext, tap on the View button and customize the panel. The free version limits you to 3 columns and 9 rows, which seems like plenty to me. You can upgrade to the full version to remove this limit (which is quite cheap, at just $1.50). From the Trigger section, you can customize the trigger area. If you have a larger phone, I highly recommend bringing down the trigger area towards the bottom of the screen.Now, let's customize the Panels launcher itself. Swipe in from your trigger area and hold for a second to bring up the sidebar panel. By default, you'll see some apps here already. Tap and hold on an empty area to start adding more apps.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nYou can choose to add any of the following items:Applications: Choose any installed app. Add your most frequently used apps here.Shortcuts: Launch actions from inside any supported apps. For example, you can create a shortcut for adding a new task in TickTick, or messaging someone on WhatsApp.App pair: Create shortcuts for launching two apps side-by-side, made even more useful after Android 16's latest 90:10 split screen update.Accessibility: Add shortcuts for system-level options like Home, Back, Notifications, Screenshot, and more.System preferences: Quick access to frequently used settings like media volume, cellular data, airplane mode, Wi-Fi, and a lot more.Website: You can add any website as a quick shortcut here.Floating widget: This is a hidden gem. You can add widgets that open in a floating window above everything else. You can trigger widgets for news, weather, or sports updates. They can hover over everything else for a few seconds, before you dismiss them out of the way.Folder: If you have too many quick app options, organize them in folders instead.Contact: Add any contact here as an icon. Press and hold to quickly call, message, or email them.Quick Search: Another useful hack. The Quick Search panel brings up a fast search for all installed apps.Go over each option and choose what you'd like to add to your sidebar launcher. Me, I'm a simple man, so my focus is mostly on my most frequently used apps, shortcuts for common actions, and quick access to some system level functionality.\n            \n                What do you think so far?\n            \n        \nOne swipe gesture: Lastly, here's a pro tip. While you can open apps in Panels by swiping, lifting your thumb, and selecting, you can also do it without taking your thumb off the screen.Once you swipe in from the edge and the Panels sidebar opens up, don't let go. You can keep moving your thumb to highlight any app or shortcut (the icon that's in focus will get bigger). Then simply let go over your selection to launch it. Overall, Panels is a pretty robust app. Once you have your personalized setup, you can launch apps, shortcuts, or widgets, with just a swipe, no matter which app you're using.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Get Samsung Galaxy's Best Feature on Your Pixel (or Any Android)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFDNAD1YSQ1ND85BJHHDSG0H/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-20T15:30:00.000Z",
      "dateModified": "2026-01-20T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Script Removes the AI Features From Chrome, Edge, and Firefox",
    "url": "https://lifehacker.com/tech/script-removes-ai-features-from-chrome-edge-firefox?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFKGXVMPEQY0K2EQ8ZCJG6WD/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-22T19:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 22, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Rokas Tenys / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Tech companies are getting increasingly pushy with their large language models—prominent buttons for these AI features coat every surface designers can think of, including in three of the most prominent browsers: Chrome, Edge, and Firefox.If you want these AI features to go away, and stay away, there's a script for that. JustTheBrowser is a free and open source tool from developer and tech blogger Corbin Davenport that removes AI features, telemetry data reporting, sponsored content, product integrations, and other annoyances from Chrome, Firefox, and Microsoft Edge. Basically, you can run this once and never think about these features again.To get started, head to the JustTheBrowser homepage. There are scripts to copy (which I'm not going to include here in case they change in the future).\n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nWindows users will need to run PowerShell as an admin—the easiest way to do that is by right-clicking PowerShell in the start menu and clicking \"Run as administrator.\" There is a different script for Mac and Linux users—that one just needs to be copied into a regular Terminal.Either way, you will be asked which browser you'd like to update the settings for—just hit the number corresponding to what you want to do.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nIn my testing, the process was very simple on Windows—just click the number and the script will do its thing. On macOS, I needed to follow a few instructions to enable a configuration policy in the Settings app, something that only took a couple of clicks. After that, Chrome was free of any and all references to AI.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nA number of other features were also gone, including those annoying prompts to switch my default browser.The way this works is kind of interesting: it uses features intended for large organizations. Basically all major browsers allow for group settings, which is how IT departments control what you can and can't do with your browser. Among these settings are ones to disable AI features.It's an interesting workaround, and hopefully one that keeps working. There is always a chance that browser companies make it so even IT departments can't disable AI features, at which point we'll all need to find a new solution (or switch to an alternative browser).\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Script Removes the AI Features From Chrome, Edge, and Firefox",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFKGXVMPEQY0K2EQ8ZCJG6WD/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-22T19:30:00.000Z",
      "dateModified": "2026-01-22T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "10 Google Search Hacks Everyone Should Know",
    "url": "https://lifehacker.com/tech/10-google-search-hacks-everyone-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEVTN0KW2N682C6R3V4VABJJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-22T19:00:00.000Z",
    "description": "\n        \n        It's not just you. Google Search has become significantly worse in recent years. In the past, you only had to watch out for low-qual",
    "body": "\n        \n        It's not just you. Google Search has become significantly worse in recent years. In the past, you only had to watch out for low-quality content filled with SEO-bait keywords. Today, you have to be wary of AI-generated garbage, misinformation, and a generally worse UI. Still, it's not impossible to find good search results on Google. I've found a number of tricks that have helped me reduce the number of low-quality entries Google returns for my searches. Here are 10 such tips everyone should know about before their next search:Remove AI from results\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nI'm still annoyed by Google's decision to slap AI right at the top of search results, and I make it a point to get rid of it every time I use a new browser or a new device. Doing this is much harder if you're using the Google Search app, so stick to web browsers if you want to rid yourself of AI results. To that end, there are actually a few easy ways to remove AI from Google's results. The quickest is to add -ai to your search queries and Google will remove AI results. Alternatively, you can try using the Hide Gemini browser extension.Return Google search to 10 blue linksGoogle's best days were when it showed a simple page with 10 blue links the moment you searched for anything. If you want to return to that simplicity, you can use the Web search filter in Google. Once you search for something on Google, click the More button below the search bar up top, and select Web. This will remove all the clutter from Google Search and return 10 webpages at a time. If you use Chrome, you can simply type \"web\" in the address bar to start a Web search. \nI've also written about a browser extension called Lucky, which does the same thing in Safari for iPhone. Lucky is available at a one-time fee of $3, and, in my opinion, it's well worth the price.Search a particular domainIf you know the domain you want to visit, you can limit your search to that domain alone. For example, you could restrict results to .gov if you only want to look at official US government sites, or .fr if you only wish to search websites registered in France. Just add site:.gov (or any other domain of your choice) to your search queries, and you'll find better results that way. It's also useful if you want to restrict searches to .ac.uk or .edu sites, which are more education-focused.Restrict results to one websiteIf you've found a trusted source that you like, such as Lifehacker, you can use Google to restrict your results only to that website. You can add site:lifehacker.com to your queries on Google, and it'll only show you results from this website. Just replace the name of the site with whichever one you like. This method is often better than using that site's internal search tools, too.Look for specific file formatsWhen you're looking for specific information, you may be better off searching for a particular file format. For instance, if you're looking for scientific articles, you may have a better chance of finding a pdf file than a web result. In these cases, you can use the filetype:pdf filter to locate pdf files, and you can replace the file type to locate results in a different file format.Google has easily accessible filters If you're finding significantly worse results using Google search, you can try to refine the results by using Google's built-in filters. Just below the search bar, you'll see a few tabs such as All, News, More, Tools, etc. Click through each of these to eliminate certain types of results. Specifically, the Tools tab lets you refine results by date, and even allows you to remove results for related search terms and focus only on exact matches.\n            \n                What do you think so far?\n            \n        \nUse Google's Advanced Search\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nSometimes, basic Google search tools just aren't good enough to find what you need. This is particularly true when your search terms include words that are popular for other reasons. For instance, you're searching \"president,\" but not the president of your country. This is where advanced search could help you remove unwanted results. You can go to the Google Advanced Search page and use all the filters there to find what you need. Each filter has a helpful description right next to it, which makes it easy to figure out what you're doing.Try reverse image searchGoogle also allows you to upload files and images to find results. Open Google search and click the + button in the search bar to upload a file or an image. You can attach a query to the image, and Google will help answer that question, or you can even look for images similar to the one you've uploaded. This can be useful if you want to detect fake profiles online, as scammers often steal profile photos from others to create a fake identity.Use content blockers to hide unwanted resultsIf you can't always be bothered with using various manual methods to hide all the junk from your Google Search results, consider using a content blocker to do so. My favorite has long been uBlock Origin, which is available on desktop and on mobile. It'll remove all sponsored results, unwanted product listings, and most types of junk from your Google results.Set your favorite websites as preferred sourcesIf you really like and trust certain websites, you should add those as preferred sources on Google. This will ensure that results from those sites are highlighted among search results and the Top Stories section in your search results. Google rolled this feature out in 2025, and it's the most effective way to find information from higher quality websites. If you'd like, you can click this link to add Lifehacker as a preferred source.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 Google Search Hacks Everyone Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEVTN0KW2N682C6R3V4VABJJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-22T19:00:00.000Z",
      "dateModified": "2026-01-22T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Protect Your Credit Cards From 'Web Skimming' Scams",
    "url": "https://lifehacker.com/money/how-to-protect-your-credit-cards-from-web-skimming-scams?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF1KKB3K7ZPSR71AE99FZV1F/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-16T15:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Table of Contents\n    \n        \n        You have probably heard of skimming, a type of fraud in which criminals install physical devices capable of capturing your payment card details on ATMs, gas pumps, and point-of-sale terminals. If you enter your debit or credit card into one of these fake card readers, your data is stored for later download or transmitted wirelessly in real time to a device controlled by scammers, who will use the information to steal from your accounts. Unfortunately, online shoppers aren't immune from this scheme. Web skimming is a type of cyberattack that uses malicious code to steal card data during checkout, and researchers have identified an ongoing campaign targeting major payment providers and, by extension, consumers. Online credit card skimmingWeb skimming attacks, broadly referred to as \"Magecart\" campaigns, are initiated when malicious JavaScript is injected into e-commerce websites and payment portals. When a checkout page loads, the skimmer replaces it with a spoofed form that collects card numbers, expiry dates, card verification codes, and billing or shipping addresses—everything threat actors need to turn around and use your card for fraudulent purchases. \nThe fake payment forms use legitimate-looking branding and styling to minimize suspicion. Once payment details are transmitted to the attacker, the user gets an error message and is redirected to the real checkout page, a flow designed to make you believe that you've simply entered your information incorrectly. Web skimmers are typically designed to avoid detection and may even self-destruct, making them difficult to identify even for site admins. They also utilize bulletproof hosting, which shields cyber actors from takedown requests and law enforcement action. \n            \n                What do you think so far?\n            \n        \nHow to protect your payment cardUnfortunately, consumers can't do much about the presence of web skimmers, but they can play defense against them. Red flags of an online shopping scam are also red flags for skimming—for example, deals and discounts that are too good to be true are indicators of a possible fraudulent vendor or malicious site, where you may be more likely to have your card details stolen. Shopping with reputable vendors will reduce (though not entirely eliminate) the risk. You should also be vigilant about any unusual steps during checkout, such as redirects or error messages, and abandon any suspicious transactions. If you suspect that your payment details may have been stolen, keep an eye on your bank and credit card statements for unauthorized activity, and enable transaction alerts for real-time updates. Remember that credit cards offer more security protections than debit cards. You could also use virtual cards for online purchases, which allows you to keep your actual card details private and protect you from further fraud. (Note, however, that virtual cards have some drawbacks. For example, you may lose some protections offered by your primary card provider and have a tougher time obtaining refunds.)\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Protect Your Credit Cards From 'Web Skimming' Scams",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF1KKB3K7ZPSR71AE99FZV1F/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-16T15:30:00.000Z",
      "dateModified": "2026-01-16T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here's How Much Money Verizon Will Credit You for Its Service Outage",
    "url": "https://lifehacker.com/tech/verizon-outage-credit-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF13P7TH56B63VDVTYB9SVH4/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-16T14:27:16.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Mino Surkala/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Verizon is issuing accounts credits of $20 to customers affected by a major outage.\n                                            Verizon says the number represents multiple days of service, and that no credit can make up for what happened.\n                                            If you qualify, you can claim your credit on the myVerizon app.\n                                    \n            \n    Table of Contents\n    \n        \n        Earlier this week, your phone might have been borderline unusable—at least, when you were away from wifi. That was due to Verizon's nationwide outage, which affected roughly two million customers across the United States. If you were among them, you couldn't use your phone on the go, which is sort of the idea behind cellphones in general. This included the ability to use navigation apps in your car, send work emails or messages, or make calls outside of SOS mode, which basically limited you to emergency services. Worse, some users are still experiencing issues this morning following Verizon's official resolution, though there's likely a quick fix for that.I don't have Verizon, but if I did, I'd be a bit ticked off. Outages happen, but this one was massive, and the company still hasn't offered much of an explanation for what actually happened. In spite of this (or perhaps because of it), the company seems keen to smooth the whole thing over. When Verizon announced it had resolved the outage, it also said it would reach out to affected customers directly to issue account credits. It's a pain to deal with interruptions to services as important as your wireless network, but at least Verizon wants to compensate you for the problem, right? Just don't expect much.Verizon's account credits might seem a bit lowVerizon made a post on X, once again apologizing for the outage and revealing what each affected account can expect to receive as compensation: $20. \n\n    \n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \n\nVerizon says this number represents \"multiple days of service\" on average, and that no credit can make up for what happened. That might be true, but in my humble opinion, a larger credit could perhaps get a bit closer. Maybe this is greater than the on-paper dollar value of losing a day of service, but it's not like customers think of their bills as paying for their usage. They pay Verizon quite a bit, expecting that their smartphones to be connected at all times within Verizon's coverage map. Considering the upheaval a day of disconnection no doubt caused, I'm not sure $20 is going to cut it.\n            \n                What do you think so far?\n            \n        \nBut I digress: $20 is the number, and $20 is what affected customers can expect to receive. If you're among them, Verizon says they will text you when the credit is available. When it is, you can log into the myVerizon app to claim your recompense.        \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's How Much Money Verizon Will Credit You for Its Service Outage",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF13P7TH56B63VDVTYB9SVH4/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-16T14:27:16.000Z",
      "dateModified": "2026-01-16T14:27:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Android 16 Makes Split Screen Easier on Smaller Screens",
    "url": "https://lifehacker.com/tech/androids-16-makes-split-screen-easier-on-smaller-screens?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF2T47H78X04P1P9DDKJEE9Z/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-16T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    \n        \n        Stock Android added the concept of App Pairs back in Android 15. You choose two apps to use in split screen mode, add a shortcut to the paired apps to the home screen, and it's now trivially easy to trigger split screen multitasking (instead of having to perform multiple tap and drag gestures).It sounds neat, but I never really used it, because on my small Pixel 9a, using apps in 50:50 split-screen mode is hardly user-friendly. There's just not enough room on the screen for each app to take up half of it and still be usable. But that changed with Android 16, thanks to a small update to how split screen works.In Android 16, the split screen ratios for app pairs are much more flexible. You can have two apps in 70:30, or even 90:10. And once you get used to the idea of 90:10 split screen multitasking, things really start to flow.\nFor example, I have an app pair for my Chrome and Gemini apps. Chrome for browsing, and Gemini for research. \n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nChrome is usually my maximized app, taking up 90% of my screen space, while Gemini is docked at the bottom, minimized. But with one tap, Gemini comes to the front and Chrome takes a back seat. And I can keep switching between the two just as easily. This is much faster than using Android's multitasking menu.\n            \n                What do you think so far?\n            \n        \nHow to set up App Pairs with 90:10 split screen multitaskingTo set up an App Pair and try this out for yourself, you'll first need to create a split screen pair. Open the two apps that you want to pair, and then go to the multitasking view (swipe up from the Home bar and hold for a second). Tap the name of the first app you want to open and choose the Split screen option. Then choose another app to pair it with. You'll now enter a 50:50 split screen view. Grab the handle in between the two apps and drag it all the way up or all the way down to trigger the 90:10 split. Alternatively, you can also set up a 70:30 split by leaving some extra space on your second app.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nNow, go back to the multitasking view, tap on one of the app names, and choose the Save app pair option.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nAfter that, you'll find the app pair as a shortcut on your home screen. Tap on it to launch your pre-configured app combo. And yes, it does remember your last used split screen ratio, saving you some valuable setup time. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Android 16 Makes Split Screen Easier on Smaller Screens",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF2T47H78X04P1P9DDKJEE9Z/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-16T15:00:00.000Z",
      "dateModified": "2026-01-16T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yes, You Can Really Have a Heart Attack From Shoveling Snow",
    "url": "https://lifehacker.com/prevent-snow-shoveling-heart-attack?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GMFF62NV01CASNQ31ASZ3/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-23T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Beth Skwarecki\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Beth Skwarecki\n                            \n        \n            Beth Skwarecki\n                \n                                            Senior Health Editor\n                                    \n            \n            \n        \n            ExperienceBeth Skwarecki is Lifehacker’s Senior Health Editor, and holds certifications as a personal trainer and weightlifting coach. She has been writing about health for over 10 years.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 23, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: SKatzenberger/Shutterstock\n                            \n    Table of Contents\n    \n        \n        You may have heard of people—elderly folks in particular—getting a heart attack from shoveling snow. This is a real risk for a lot of people, especially if you are sedentary and have certain health conditions. Here's a breakdown of what’s so dangerous about shoveling, and who's most at risk. Snow shoveling is hard exerciseThe connection between shoveling and cardiac events is real: The American Heart Association cites several studies that found higher rates of heart attacks and sudden cardiac deaths after snowstorms. Shoveling is hard work, and it can cause your blood pressure and heart rate to rise far higher than levels that are considered safe for sedentary people with heart conditions. Cold temperatures also seem to make chest pain more likely, possibly because your arteries can constrict in the cold.Who should check with a doctor before shoveling?You may have heard the advice to check with a doctor before beginning an exercise program. I have more information on that here: Most people don’t need to check with a doctor, but that depends on your medical history and on whether you intend to do intense exercise. Since snow shoveling is intense exercise, it’s worth taking a look at those guidelines. If you have cardiovascular disease, diabetes, or kidney disease, and are currently not exercising intensely, you should check with a doctor before you start. That’s true whether the intense exercise you want to do is running, Crossfit, or shoveling six inches of snow from your driveway. Pushing a snowblower counts, tooOne surprising thing: The cautions around shoveling snow also apply to using a snowblower. Snowblowing turns out to also be serious exercise, even if, in theory, it should be easier because a machine is doing part of the work. How to reduce your risk of heart attackIn a news release from the American Heart Association, the cardiologist who was the lead author on a paper on risks of exercise recommends that certain people should not do their own shoveling. This includes: \n            \n                What do you think so far?\n            \n        \nPeople who have had bypass surgery or coronary angioplastyPeople who have already had a heart attack or strokeCurrent and former smokersPeople who have diabetes, obesity, high blood pressure, or high cholesterolPeople who are sedentaryObviously, advice from an internet article is not the same as medical advice from your doctor, so please defer to actual medical expertise. And if you’re healthy enough that shoveling snow is reasonably safe, you may still want to take a few precautions to make shoveling easier on your body. By the way, even though running a snowblower is hard work, it’s still usually easier on your body than shoveling. And if you need to shovel, pushing a shovel is easier on your body than lifting it repeatedly. I would add that it’s a game changer to shovel multiple times in a single snowstorm. Instead of waiting until you have six inches of snow on the ground, go out when there’s just two inches and it’ll be a breeze. Repeat that process two more times, and you’ll have a clear driveway without ever having to wrestle with ankle-deep snow. Finally, be aware of how your body is feeling as you shovel, and stop if you don’t feel well. Or as the AHA put it: \"If you experience chest pain or pressure, lightheadedness or heart palpitations or irregular heart rhythms stop the activity immediately. Call 9-1-1 if symptoms don’t subside shortly after snow removal.\"\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yes, You Can Really Have a Heart Attack From Shoveling Snow",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GMFF62NV01CASNQ31ASZ3/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-23T15:00:00.000Z",
      "dateModified": "2026-01-23T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]