[
  {
    "title": "This New Android Feature Protects You From a Scam Call While It's Happening",
    "url": "https://lifehacker.com/tech/this-new-android-feature-protects-you-from-a-scam-call-while-its-happening?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBN5YJXM3RYZVHHBB4D420Z3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-04T20:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Google / Hight Photography",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Google / Hight Photography / Shutterstock\n                            \n            \n                Key Takeaways\n                                            Android users in the U.S. will soon have extra protection against scams targeting their financial apps.\n                                            You'll get a pop-up warning that the call is likely a scam with a reminder not to make payments or share personal information and a button to end the call.\n                                            U.S. users will see these protections when trying to access Cash App and JPMorganChase.\n                                    \n            \n    Table of Contents\n    \n        \n        Bank impersonation is a popular scam tactic, and one I've written about a lot. Fraudsters prey on people's fear, confusion, and desire to protect their money, which may lead targets to hand over login credentials, make irreversible wire transfers, or provide other sensitive information without stopping to question their actions. Android users in the U.S. will soon have extra protection against scams targeting their financial apps, preventing threat actors impersonating bank representatives from accessing data on their devices. Google's in-call scam protection is designed to prevent users from sharing their screens with threat actors and help them avoid revealing their banking information. How Android in-call protection worksAndroid's scam protection kicks in if you are on a phone call with a number not saved in your contacts and attempt to open a participating financial app. You'll get a pop-up warning that the call is likely a scam with a reminder not to make payments or share personal information and a button to end the call (and stop screen sharing). There's also a 30-second delay on further action on your device, which Google says is designed to disrupt any sense of urgency. \nNote that financial institutions must opt into in this feature—at this time, Google has specifically named Cash App and JPMorganChase as partners, though it indicates expansion to other popular fintechs and banks. \n            \n                What do you think so far?\n            \n        \nGoogle initially rolled out in-call protections for banking apps to UK users earlier this year as part of a larger package of security features announced ahead of Google I/O. That launch also included real-time scam detection alerts for calls and texts, improved theft protection via remote lock and identity check, key verifier for Google Messages, and device-level Advanced Protection (in addition to account-level settings). Alongside the US pilot, in-call scam protections will now cover most major banks in the UK as well as financial apps in Brazil and India. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This New Android Feature Protects You From a Scam Call While It's Happening",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBN5YJXM3RYZVHHBB4D420Z3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-04T20:30:00.000Z",
      "dateModified": "2025-12-04T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This macOS App Makes It Easy to See (and Use) Your Keyboard Shortcuts",
    "url": "https://lifehacker.com/tech/learn-macos-app-shortcuts?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNBQ0H4F582WCTDJF7E7Z8H/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-05T15:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 5, 2025\n    \n            Credit: sergey causelove / Shutter",
    "body": "\n        \n    \n                                        \n        \n        \n        December 5, 2025\n    \n            Credit: sergey causelove / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Using keyboard shortcuts is a lot faster than clicking around in the menus, but only after you learn them. That's the hard part.You could look up the documentation for the application or explore the menu bar—but if you're on a Mac, you could also just install KeyClu. This free application shows an overlay with all the keyboard shortcuts for the currently open Mac application, which is very useful for anyone trying to become a more keyboard-savvy computer user.To get started, install the application. Then, you'll need to choose a trigger key (basically one of the modifier keys on your keyboard). By default, you will tap the key twice and hold on the second tap to trigger the overlay, but you can optionally set the application to simply press and hold the key if you prefer. I opted to press and hold Command.\nAfter that, you'll be asked to enable permissions so KeyClu can access the keyboard shortcuts for your applications. Then you can start using the application. I tend to ignore the application until I wonder whether a keyboard shortcut for a particular function exists. I trigger the application, look through the list of keyboard shortcuts, and see what's available. When I let go of the trigger key, the window disappears.This default floating window is useful, but you might want a window listing shortcuts to stay open even when you let go of the trigger. That's where the persistent panel comes in. This window, which you can trigger using the menu bar, stays open and always shows a list of keyboard shortcuts for the currently active application. You can add a separate keyboard shortcut for this window in the settings, if you like.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nIf you dig around in KeyClu's settings, you can configure the layout of both the pop-up and persistent panels, changing the size of the windows, how many columns shortcuts are sorted into, and which display the panels show up on.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nIt's a simple piece of software, but it's completely free and can help you get better at using your computer. And if you're reading Lifehacker, that's probably something you want. Speaking of keyboard shortcuts: here are a few keyboard shortcuts you should know. You can also check out our guide to creating your own macOS keyboard shortcuts.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This macOS App Makes It Easy to See (and Use) Your Keyboard Shortcuts",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNBQ0H4F582WCTDJF7E7Z8H/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-05T15:30:00.000Z",
      "dateModified": "2025-12-05T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple’s New iPhone Update Will Make Sure You’ll Never Miss a Reminder Again",
    "url": "https://lifehacker.com/tech/iphone-alarm-for-reminders?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC1HZPG712EAKM1NVA9T5DGC/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-09T15:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Khamosh Pathak\n           ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    \n        \n        Apple’s various apps and utilities are finally starting to talk to each other, and it’s great news for iPhone users. Last year, Apple added the ability to sync Reminders with Calendar, which added time-based reminders directly into your Calendar view—a feature I now regularly use. Now, with iOS 26.2, Apple is finally integrating Reminders with the Alarms app; you'll be able to set an accompanying alarm for any reminder. If, like me, you tend to be forgetful—if you need a reminder for your reminder—this will be a handy feature. The alarm will sound, taking up your entire screen until you dismiss it. And yes, you can snooze it.How to add an alarm to any reminder on your iPhoneTo get started, open the Reminder app, navigate to a task list, and either create a new reminder, or edit it. When you’re adding a date and time, you’ll see a new Urgent toggle. When you enable the Urgent mode, it will turn on an alarm that will go off when the reminder is due. The alarm will trigger even when your iPhone is in silent mode or in a Do Not Disturb Focus mode, so be careful when setting it up.\n\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nWhen you enable this for the first time, you’ll get a connection request for integrating Reminders with Alarms. Here, tap Allow. If you don’t see this popup, or if you’ve dismissed it before, go to Settings > Apps > Reminders, and in the \"Allow Reminders to Access\" section, enable the Alarms toggle.When the reminder is due, you’ll see a full-screen reminder interface, with the reminder up top, and an option to slide to stop (using Apple’s new sliding interface for dismissing alarms, which you can disable if you want). You’ll also see a big blue Snooze button. This will snooze the reminder for nine minutes.\n            \n                What do you think so far?\n            \n        \nWhether you hit the Snooze button or you use the slider to stop the alarm, Apple will add the Reminder to the top of the notifications list, as a Live Activity. You’ll see the reminder, with the snooze duration (if enabled), and the task. To actually complete the task, you’ll have to check it off from the Live Activity or the Reminders app.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nUnlike in the new alarm feature, there’s no way to edit the Snooze duration for reminders, or to disable the slider. If you don’t like the Snooze feature or the two-tap approach to completing reminders, you can switch it out for a Complete button instead. Go to Settings > Apps > Reminders and in the \"Urgent Reminders\" section, enable the Complete from Alarm feature. Now, when the alarm goes off, you’ll see two buttons instead: Slide to Stop and Complete. When you tap Complete, the alarm will disappear, and the task will be marked as Complete.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple’s New iPhone Update Will Make Sure You’ll Never Miss a Reminder Again",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC1HZPG712EAKM1NVA9T5DGC/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-09T15:30:00.000Z",
      "dateModified": "2025-12-09T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Windows Update Pop-Up Is a Scam",
    "url": "https://lifehacker.com/tech/windows-update-pop-up-clickfix-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBK2SENEP0XTH9T90WPKGE98/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T17:30:00.000Z",
    "description": "\n        \n        The update screen is a normal occurrence on Windows machines, so of course hackers are now manipulating it to sneak malware onto dev",
    "body": "\n        \n        The update screen is a normal occurrence on Windows machines, so of course hackers are now manipulating it to sneak malware onto devices. The scheme, a recent iteration of a ClickFix attack, is designed to trick you into executing a dangerous command under the guise of completing a \"critical security update.\" But what you're actually doing is installing an infostealer that hands data over to bad actors. When a Windows update pop-up is actually a ClickFix attackClickFix is a social engineering ploy that uses tactics like fake error messages, CAPTCHA forms, and command prompts to deliver malware to your device. As PCMag reports, the Windows update scam is a pop-up that looks like a standard Windows blue screen but is actually a full screen browser page being displayed from a malicious domain. The ClickFix element is a set of keystrokes—not part of the real update interface—that have the user paste and execute a malicious command, ultimately delivering malware to their device. These instructions have an air of urgency, which is a common element of a scam. \nResearchers at cybersecurity firm Huntress have detailed the exact mechanism behind this attack, including an iteration in which users are prompted to verify they are human (rather than complete a security update). As Bleeping Computer outlines, the malicious code is embedded into the pixel data of PNG images, and the final payload is one of two known infostealers.According to the Huntress analysis, following a recent law enforcement operation, fake Windows update pages continue to exist across multiple domains, but those domains no longer seem to host the malware payload. That doesn't mean, however, that this attack, or some version of it, won't pop up elsewhere. \n            \n                What do you think so far?\n            \n        \nHow to stay safe from this ClickFix attackIf you run Windows on your device, you've probably seen a blue or black update or error screen many times, and you may not be suspicious if your computer randomly begins an update or prompts you to take an extra step to confirm it. But while a legitimate update screen will have a progress indicator and instructions not to turn off your computer, you should never need to input manual commands. This is a red flag of a ClickFix attack and not something a trusted service will require.  Of course, it's important to keep your computer up to date. Microsoft releases security updates on the second Tuesday of the month, known as Patch Tuesday, and you can enable automatic updates on your machine to ensure you get fixes as soon as they're available. If you want to take additional steps to prevent ClickFix attacks on Windows, you can disable the Windows Run box to prevent unauthorized access to commands.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Windows Update Pop-Up Is a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBK2SENEP0XTH9T90WPKGE98/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T17:30:00.000Z",
      "dateModified": "2025-12-04T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google's December Security Update Fixes Two Zero-Day Exploits (and 105 Others)",
    "url": "https://lifehacker.com/tech/googles-december-security-update-fixes-107-vulnerabilities?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBFXJ9XJ5SF2EE3X0HJ7KDAM/hero-image.fill.size_1200x675.webp",
    "tag": "Life",
    "date": "2025-12-02T19:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: pcperle / Shutterstock\n   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: pcperle / Shutterstock\n                            \n            \n                Key Takeaways\n                                            The Android Security Bulletin for December patches 107 vulnerabilities.\n                                            Two of the flaws are zero-days that may have been exploited in the wild.\n                                            Android users should install security updates as soon as they are made available.\n                                    \n            \n    Table of Contents\n    \n        \n        In its Android Security Bulletin for December, Google is pushing an especially large number of updates to address vulnerabilities across different components—and two of the flaws may have been exploited in the wild. The December patch covers 107 bugs across Android Kernel, System, and Framework as well as Qualcomm, MediaTek, Arm, Unisoc, and Imagination Technologies components. The high-severity vulnerabilities include denial of service, elevation of privilege, and information disclosure flaws. There are also a handful of bugs labeled as \"critical.\" Two active exploitsTwo of the vulnerabilities addressed in the December update are zero-days, which are flaws that have been actively exploited or publicly disclosed before the developer makes a patch available. Google notes that both may be under \"limited, targeted exploitation.\" \nCVE-2025-48633 is an information disclosure vulnerability, while CVE-2025-48572 is an elevation of privilege flaw. Both affect the Android Framework in versions 13 through 16. Google hasn't disclosed any additional information about the flaws and how they may have been exploited (or by whom). However, as Bleeping Computer reports, similar bugs have been targeted in the past by commercial spyware operations and nation-state campaigns. \n            \n                What do you think so far?\n            \n        \nEnsure your Android device is up to dateYou should always implement security patches as soon as they're available, so if you see a notification to update, go ahead and follow the prompts to download and install it. You can also check for updates via a path like Settings > Security & privacy > System & updates > Security update. Note that this may be slightly different depending on your device, and you can always search \"update\" to locate it. This month's patches apply to Android Open Source Project (AOSP) versions 13, 14, 15, and 16 and are dated 2025-12-01 and 2025-12-05—the latter fixes all known issues. Pixel users (and the core AOSP code) receive patches from Google, and those on other Android devices from Huawei, LGE, Samsung, Motorola, and Nokia should see updates from their respective manufacturers around the same time. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google's December Security Update Fixes Two Zero-Day Exploits (and 105 Others)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBFXJ9XJ5SF2EE3X0HJ7KDAM/hero-image.fill.size_1200x675.webp"
      ],
      "datePublished": "2025-12-02T19:00:00.000Z",
      "dateModified": "2025-12-02T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Surprisingly Convincing Phishing Scam Imitates Apple Support",
    "url": "https://lifehacker.com/tech/apple-support-ticket-imitation-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBQT32MVCHGMC1BT7C0WBR01/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-05T20:00:00.000Z",
    "description": "\n        \n        You may have a keen eye for spotting scams, but fraudsters are finding new ways to weaponize trusted systems to avoid detection. For",
    "body": "\n        \n        You may have a keen eye for spotting scams, but fraudsters are finding new ways to weaponize trusted systems to avoid detection. For example, threat actors are generating real Apple support tickets to phish two-factor authentication (2FA) codes and gain access to iCloud accounts. The scheme, detailed on Medium by a security researcher and software product manager Eric Moret, shows how social engineering tactics can sow just enough fear and confusion to trick even those who know the red flags. (The money transfer scam that conned a financial advice columnist out of $50,000 is another example.) How scammers are exploiting Apple's support systemThe Apple support scam started with a text message from Apple containing a 2FA code, followed by verification notifications across devices, indicating that someone was trying to log into Moret's account. He then received an automated call from Apple with another 2FA code. The text was delivered from a five-digit short code, and the call from a toll-free number, both of which are used by legitimate businesses and not necessarily red flags of a scam.\nThe next call, however, came from an Atlanta-based 404 phone number. The caller claimed to be from Apple Support, stated that Moret's account was under attack, and assured him that they were opening up a support ticket. During a follow-up call lasting 25 minutes, Moret received a real Apple Support case confirmation via email (it turns out anyone can create an Apple support ticket in someone else's name) and was directed to reset his iCloud password. He was then sent a link via text—from the 404 number this time—to close the ticket. After clicking through, Moret was directed to a phishing website that spoofed a real Apple page (the URL was appeal-apple[dot]com), where he was prompted to enter a 6-digit 2FA code he'd just received via text. An email to his inbox then alerted him that an unknown Mac mini had been used to sign into his iCloud account, which the rep on the phone told him was \"expected as part of the security process\" and \"standard procedure.\" Moret then immediately reset his iCloud password again to kick the unauthorized device off.  It may be easy in hindsight to see the signs: the unsolicited call about an urgent security issue, the 404 number, the phishing link that isn't a real Apple subdomain, the request for an authentication code. But the Apple support ticket—with a real case number and official emails from apple.com domains—lent just enough credibility, and the multiple 2FA notifications just enough urgency, to work.  \n            \n                What do you think so far?\n            \n        \nThat's the problem with social engineering. It manipulates emotions and instincts that are stronger than logic and reason, leading to actions that are not in our interest. How to stay safe As always, you should be wary of anyone who calls, texts, or emails you about a security or account issue, even if you have received real security alerts or they have a legitimate case number. Don't click links, enter credentials, or provide codes when prompted by these unsolicited callers. Don't accept reassurance from anyone on the phone, no matter how calm and confident they sound. If you are concerned, you should reach out directly using trusted contact information or open support tickets yourself. Always check URLs and subdomains carefully, as hackers can play tricks to make them look legit. Also, know that simply having 2FA enabled isn't enough to keep your accounts secure. Some forms are (obviously) easily phished, so if possible, you should use a multi-factor authentication method like a hardware key or WebAuthn credentials (biometrics and passkeys) rather than codes. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Surprisingly Convincing Phishing Scam Imitates Apple Support",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBQT32MVCHGMC1BT7C0WBR01/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-05T20:00:00.000Z",
      "dateModified": "2025-12-05T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple and Google Are Making It Easier to Switch Between iPhone and Android",
    "url": "https://lifehacker.com/tech/google-and-apple-are-making-it-easier-to-switch-between-iphone-and-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBZW51YD9RTK9TT6NWP3RZ28/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-08T21:30:59.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: Mr.Mikla/Shutterstock\n    ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: Mr.Mikla/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple and Google are reportedly working together on a method to make switching between iPhone and Android easier.\n                                            Details are slim, though Google has started to roll out some of its work to the latest build of Android Canary.\n                                            These changes should make it easier to move from one platform to another, something that has traditionally been more difficult than it should be.\n                                    \n            \n    Table of Contents\n    \n        \n        When it's time to buy a new car, you don't necessarily need to stick with the one you had before. You don't lose your cloud-based photos by switching from Toyota to Subaru, nor will your friends yell at you for ruining the group chat by buying a Kia. That's not the case with smartphones: When you buy an iPhone, it's tough to switch away from it. The same goes for Android: While it's easy enough to switch within the Android ecosystem, such as between Pixel or Galaxy, moving from Android to iPhone can also be a pain. Tech companies tend to make it tempting to stick with their platform, and introduce friction when you try to leave. That, of course, is entirely business-based. Apple hasn't traditionally made it easy to move to Android, because, well, you might actually do it. It doesn't have to be this way, either. There's nothing inherent to smartphones that should make it so challenging to break out of any particular ecosystem. All it takes is some intentional design: If smartphones were made to be traded, you could migrate from one to another, without worrying about losing pictures, messages, or any other important data or processes. As it happens, that intentional design may be on the horizon. As reported by 9to5Google, Apple and Google are actually working together to make it easier to transfer data between iPhone and Androids, which would make switching between the two platforms more seamless. This isn't theoretical, either: Google has already released some of this progress as part of the latest Android Canary, the company's earliest pre-release software. All compatible Pixel devices can currently access this latest build, though it doesn't seem there are any user-facing features available to test. 9to5Google says that similar features will roll out to testers in a future iOS 26 beta. Perhaps at that time, Google will roll out its features to the Android beta as well, which has a much larger user base than Canary. \nWhile details are slim here, any cooperation between Apple and Google on this front is huge. Current migration tools do exist, but they can be problematic. By actually working together on a native transfer solution, it might actually be seamless to move between platforms. Apple and Google might not be motivated by charity, of course, as the EU has been cracking down on restrictive practices by tech companies in recent years. But while both companies may see this as a way to lose customers, it's also a way to gain them: Sure, some iPhone users may switch to Android if it's easier to do so, but some Android users may do the reverse for the same reasons.\n            \n                What do you think so far?\n            \n        \nMore choice is good for everyone—even if it doesn't guarantee exponential growth to shareholders.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple and Google Are Making It Easier to Switch Between iPhone and Android",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBZW51YD9RTK9TT6NWP3RZ28/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-08T21:30:59.000Z",
      "dateModified": "2025-12-08T21:30:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Happened to the iPhone 17 Pro’s Portrait Night Mode?",
    "url": "https://lifehacker.com/tech/iphone-17-pro-portrait-night-mode-missing?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNG47316RZ18KQCY4V2BFM8/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T22:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Hadrian/Shutterstock\n     ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Hadrian/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple's latest iPhone 17 Pro models are missing a feature found in the last five generations of Pro iPhones.\n                                            For some reason, you can no longer take Portrait mode shots with Night mode—though Night mode itself still works for standard shots.\n                                            Apple has not disclosed why this feature is missing.\n                                    \n            \n    Table of Contents\n    \n        \n        New products tend to add features, not take them away. That isn't always the case with Apple, however. The company has a long history of removing functions from one generation of devices to the next, whether that's removing the disc drive from its MacBooks back in 2012, or taking away the iPhone's Home button in 2017. Some of these changes are good, some are controversial, while others are undone altogether: MagSafe and HDMI both found their way back to MacBooks after all.It's not often I hear about Apple removing software features from one generation of product to the next, however. So, imagine my surprise when I saw a number of headlines this morning asserting that the iPhone 17 Pro, Apple's latest and greatest flagship, is missing a feature found in the last five generations of Pro iPhones—and nobody noticed for nearly three months. Night mode is missing from Portrait mode on the iPhone 17 Pro and 17 Pro Max. The short answer? We have no idea. This was not something Apple announced publicly, of course. In fact, Macworld spotted the change in an Apple support doc: If you scroll down to the section where it says \"On supported models, you can take Night mode photos with Portrait mode,\" and click the hyperlink on \"On supported models,\" you'll pull up a list of iPhones that, mysteriously, doesn't include the 17 Pro or 17 Pro Max. The list includes:\niPhone 12 ProiPhone 12 Pro MaxiPhone 13 ProiPhone 13 Pro MaxiPhone 14 ProiPhone 14 Pro MaxiPhone 15 ProiPhone 15 Pro MaxiPhone 16 ProiPhone 16 Pro Max For the uninitiated, Night mode and Portrait mode are technically two distinct features. Portrait mode was released first, all the way back on the iPhone 7 Plus, which utilized the dual-camera system to add a bokeh effect to shots of people. Those early shots were hit or miss, and were often no replacement for a true DSLR, but as Apple's tech and cameras have improved, so has Portrait mode. Part of the improvement was the introduction of Night mode. This feature, which Apple was a bit late to the game on, allowed you to take brighter images in low-light environments by lengthening the time the shutter stays engaged. Older iPhones without the feature would take images that were hard to see without the flash engaged, but Night mode could pull in details as long as there was just enough light present in the scene. Since the iPhone 12 Pro, Portrait mode came with the option of Night mode, as well. If you're trying to take a portrait shot in a dark environment, Night mode kicks in and gives the image a chance to turn out brighter and more detailed. But now, it seems, the 17 Pro and 17 Pro Max do not have this option. \n            \n                What do you think so far?\n            \n        \nTo be clear, these new iPhones still have Night mode: Per that previously mentioned support page, you can take brighter shots at night when taking standard photos, selfies, and time-lapse videos. It just seems Apple decided to remove the feature for Portrait mode shots on its latest Pros.Of course, this news started breaking on Dec. 3, nearly three months after the 17 Pros launched. If it took this long for someone to notice a missing feature, was it really all that important to begin with? I don't have a 17 Pro, so I really can't say, but I also can't say I take many Portrait mode shots in dark environments. I've reached out to Apple for comment, and will update this story if I hear back. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Happened to the iPhone 17 Pro’s Portrait Night Mode?",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNG47316RZ18KQCY4V2BFM8/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T22:00:00.000Z",
      "dateModified": "2025-12-04T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Your Apple Music Replay 2025 Is Live",
    "url": "https://lifehacker.com/tech/your-2025-apple-music-replay-is-live?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JE6J21FWJFV1ZH8WHWBSQXDC/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-02T16:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Lifehacker\n               ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Lifehacker\n                            \n            \n                Key Takeaways\n                                            Apple Music Replay 2025 is now live.\n                                            You can access your Replay from the Apple Music app on iPhone and iPad, or from the web app on your computer.\n                                            Like Spotify Wrapped, Replay features a number of your listening statistics over the past year, including stats from years prior.\n                                    \n            \n    Table of Contents\n    \n        \n        2025 was another big year for music. We had new albums from Taylor Swift, Sabrina Carpenter, Tyler the Creator, and, of course, Huntrix (of KPop Demon Hunters fame), just to name a few. You may have listened to any number of new albums that came out this year, mixed in with music that released any time over the last century. You might not even remember what you were listening to back in January. But Apple Music remembers, and will serve in up to you in your 2025 Apple Music Replay. Like last year, your Replay is available in your Apple Music app. If you're relatively new to the streaming service, that might sound obvious—especially if you've previously used a service like Spotify that offers a similar annual wrap-up. But this wasn't always the case: For much of Apple Music Replay's brief history, you had to visit a separate website, music.apple.com/us/replay, and log into your Apple Music account in order to access your recap. It seemed silly, considering Spotify Wrapped is very much an in-app experience, but it took Apple until 2024 to get with the program.That said, it seems Apple has made additional improvements this year. In 2024, the experience was essentially contained in an in-app browser, where it loaded your Apple Music Replay with the same UI as the website. This year, Replay is a native function of the Apple Music app, at least on iOS. \nHow to access your 2025 Apple Music Replay \n    \n            \n            \n                                        Credit: Lifehacker\n                    \n    \nYou can still access your Replay from the official website, but the easiest way to review it is from the app on your iPhone or iPad. Open the app on your device of choice. Make your way to the Home tab if the app doesn't open there automatically, then tap or click on the large Replay option, which should appear at the top left. (This option also shows up in the Music app for Mac, but it will automatically direct you to the website in your browser.) Whichever way you access it, you'll be able to see all of your Replay months here (excluding December, of course, since the month just started), but let's focus on 2025 as a whole.Unpacking your Apple Music ReplayAt the top, you'll find a Replay your year in music tile. Tap Play Your Highlight Reel and Apple Music will walk you through your year. Here's what you can expect, at least based on my results: \n            \n                What do you think so far?\n            \n        \nFirst, you'll see your total listening minutes, complete with both a collage of the albums you listened to most, and one of your top-played songs playing in the background. Next, you'll see your top artist of the year, with a collage of their images and a relevant song playing in the background. The following slide is a breakdown of your top artist by monthThe next will show if any artist was your number one for multiple months. Next, you'll see the number of songs you listened to, complete with your top song of the year. Then you'll see the number of albums you listened to, and which one was your top choice. Second to last, Apple Music tells you your top genres of the year, including the one you listened to mostOne final slide summarizes the whole year.You don't have to watch the highlight reel to see these stats: Once out of the reel, you can scroll through the Replay page to see everything covered in the slides, plus additional stats. Mine shows top artists, songs, and albums by month—so I can see which artist defined March (Will Stratton), which song I listened to most in August  (\"The Subway\" by Chappel Roan), and which album I played on repeat in May (\"Tunnel Vision\" by Beach Bunny). I also see top playlists of the year; different listening milestones, like Minutes Listened, Artists Played, and Songs Played; stats from last year's Replay; and a playlist of my top songs of the year. Many of these stats, both in and out of the highlight reel, are easily sharable. You'll see a share icon next to any stat you can export, which makes it simple to share fun graphics with friends or on social media. I've already blown up the group chat with some of my stats here, and I expect many of you to do the same. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Your Apple Music Replay 2025 Is Live",
      "image": [
        "https://lifehacker.com/imagery/articles/01JE6J21FWJFV1ZH8WHWBSQXDC/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-02T16:30:00.000Z",
      "dateModified": "2025-12-02T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Android 16 Just Put Parental Controls Directly on Your Kid's Phone",
    "url": "https://lifehacker.com/tech/android-16-new-parental-controls?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBMPR1K2ATMCKXMFGQ63PXWP/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T18:30:00.000Z",
    "description": "\n        \n        In the long-running Android vs. iOS competition, iPhones have historically had the edge in terms of parental controls: They've been ",
    "body": "\n        \n        In the long-running Android vs. iOS competition, iPhones have historically had the edge in terms of parental controls: They've been a bit more straightforward and intuitive, and easier for caregivers to understand and manage. Apple does many things well, and getting its apps and devices working seamlessly together is definitely one of them.Google, however, is gradually improving the experience for parents, with a batch of updates earlier this year, and now some more changes as part of a significant Android 16 upgrade. The latest changes mean more controls can be accessed on your kids' devices.What's new in Android 16The usual Android caveat applies here: Each Android phone maker does things slightly differently, though there's not actually too much variation in this particular area. The latest Android 16 updates mentioned above are rolling out now to Pixel phones (and I've tested them on a Pixel), but will take a while to reach other handsets—Samsung phones will most likely get them early next year, for example, with One UI 8.5.\nSo what's new? Essentially, more of the existing parental controls are available on the Android devices of your youngsters, so you can get at them from their phones and tablets as well as accessing them remotely. It should make life easier if you're with your kids and they pass their devices over to you.You can find the options that have been added to kids' devices by opening Settings on the phone or tablet of your young person and choosing Parental controls. Right away you'll see a toggle switch for enabling on-device controls, and when you do enable them you need to enter a PIN—to stop your kid from changing these settings themselves.\n    \n            \n            The new on-device controls in Android 16.\n                                        Credit: Lifehacker\n                    \n    \nThere are then four sections you can access: Daily limit, App limits, Downtime, and Website content filters. Tap on any of these to set restrictions for the current device, which can be adjusted depending on the day of the week in some cases. Pick Downtime, for example, and you can set times during which the device is locked. These match the tools you've previously been able to manage remotely.Select Daily limit, then turn on the Use daily limit toggle switch, and you're able to control how many hours your kid can use their phone or tablet for each day. There's also a bar chart showing device usage over time, so you can see how much screen time your child has been taking advantage of. These settings are simple, understandable, and a breeze to use—you don't have to mess around with Google accounts or family relationships if you don't want to. You can just enter a PIN and start making changes—you don't necessarily have to connect these settings to any other devices. If you want to manage them remotely, though, Google has a wider parental control system in place.Google's Family Link controls The new Android 16 controls that appear on devices can work independently of anything else, but Google already offers plenty of options if you need them. Everything is managed through the Google Family Link portal, which you can access on the web or through the apps on Android or iOS.\n            \n                What do you think so far?\n            \n        \nYou can use Google Family Link to set up Google accounts for your kids, and then manage what they're able to do with them. The idea is that they sign into their Android devices using the account you've created for them, and because Google knows you have a verified connection to them, you can put restrictions on those devices remotely.All the usual safeguards and protections are covered: You can set screen time limits, manage the apps your kids can use (and for how often), put blocks on certain websites and categories of website, and put parental approvals in place for making purchases through Google's various digital storefronts. These mostly match what's now available on-device.\n    \n            \n            Google Family Link on the web.\n                                        Credit: Lifehacker\n                    \n    \nThere's a location tracking element to Google Family Link as well, so you can see where your young people are at all times, and even get notifications based on their movements: You might want to get a ping when they turn up at school, for example, or when they leave home. All this can be managed through the apps.More recent updates let you control the amount of screen time your children can have during school hours, and there are also now tools for managing the contacts that youngsters are able to interact with—as yet you can't get to these controls directly on your kids' devices. There's plenty in the way of reports on usage too, alongside these controls.Add everything up, and Google now has a fairly comprehensive set of parental controls that you can manage from just about any device, or from the devices your kids are using—assuming you've given them Android phones or tablets. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Android 16 Just Put Parental Controls Directly on Your Kid's Phone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBMPR1K2ATMCKXMFGQ63PXWP/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T18:30:00.000Z",
      "dateModified": "2025-12-04T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "One of the Mac's Best Productivity Apps Is Now on Windows",
    "url": "https://lifehacker.com/tech/raycast-is-finally-on-windows?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBN70EVQ6Y5Q9205YSR8ZV7J/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-04T20:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Raycast\n                  ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Raycast\n                            \n            \n                Key Takeaways\n                                            Raycast is finally available on Windows.\n                                            The previously Mac-exclusive app makes it easy to search for apps and files anywhere on your PC.\n                                            You can also use the tool for a number of tasks, including converting currencies and dimensions, managing your clipboard history, and emptying your recycle bin.\n                                    \n            \n    Table of Contents\n    \n        \n        Raycast is one of the best things to happen to Windows. It brings one of my favorite Mac apps to Microsoft's operating system. In fact, I've enjoyed using Raycast for Windows so much, I can't see myself going back to the non-Raycast life. This app is free to download and use, though there is an optional paid subscription for those who want certain additional features. What is Raycast?\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nAt its heart, Raycast is an app that lets you search for apps and files stored in your computer. It stays hidden until you press its keyboard shortcut (Alt-Space on Windows). Once you do, Raycast appears as a floating search bar on the desktop. You can type anything you want to locate in the search bar, and Raycast forages through your computer to find it. I primarily use it as an app launcher since I have way too many apps on my Mac (and PC). Raycast helps me find the right app quickly and open it.That's just the surface layer of Raycast, though. You can use Raycast to search for files on your computer, retrieve items you've copied to the clipboard, send queries to ChatGPT (or other AI tools), convert currencies and units, and much more. All of these features are available under the same simple floating search bar.\nSet up keyboard shortcuts in Raycast\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nRaycast is designed for people who love keyboard shortcuts. You can totally use it without them, but you'll enjoy it a lot more if you set up a few shortcuts of your own. As an example, if you open Raycast and press Tab, it switches to AI mode, and you can directly send your questions and requests to ChatGPT from Raycast.Whenever you search for anything in Raycast, you'll probably see a button called Record hotkey next to the results. This is your cue to set up a keyboard shortcut for that action, and doing so will allow you to get to it faster. You can also go to Raycast settings to find commonly used actions and record your preferred keyboard shortcuts for all of them.Note that the Raycast app is still in beta on Windows, and during this trial period, you can use these AI features for free. Expect that to change, though, once it's out of beta. If you want to keep using these features, the pro tier costs $8 per month for most AI models, but certain advanced AI models are only available in the $16 per month subscription tier.What I use Raycast for on Windows\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nI use Raycast for a lot more than just launching apps on Windows. As someone who lives outside the US, converting units and currencies is a big part of my work day. Raycast's workflow is quite seamless for this task. You can just type \"$499\" or any other number after the dollar sign, and Raycast automatically converts it to your local currency. You can also type something like \"EUR499 to USD\" and it'll convert euros to the US dollar. I really like the fact that you don't even have to press the Enter/Return key to see the converted currency. The moment you type a currency number, the result shows up without any further prompts.You can also try other unit conversions with Raycast, eg: \"100kg to lbs,\" \"800ml to fl oz,\" \"44 sqm to sqft,\" etc. This helps me a lot when I'm ordering things from international websites that don't always have dimensions, weight, or pricing available in units I'm used to.\n            \n                What do you think so far?\n            \n        \nBeyond this, I like using Raycast to store and view clipboard history. You can search for Clipboard in Raycast to access items you've copied, and the app even categorizes these items for you. You can search just for links, images, files, or email address you've copied, which makes it easy to quickly find specific items from your clipboard history.Raycast also supports many other things such as window management, emptying the recycle bin, restarting your computer, locking your PC, bookmarking links and opening them in specific browsers, and text snippets—which let you quickly create or copy bits of text or code. You can open Raycast, and press Ctrl-, (comma) to open its settings and explore all its features.The limitations of Raycast for Windows\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nRaycast only recently launched on Windows, which means there are a few things still missing from the macOS version. This includes the AI Chat feature (more advanced than the quick AI search available now), focus timers, the built-in notes feature, and support for more extensions. Many of its extensions were originally built only for macOS, so it's going to take some time to bring them to Windows. The feature that I miss the most is the ability to sync your snippets, notes, chats, and other data across devices. This feature is yet to come to the Windows app, and I hope the developers change that soon.Raycast is available on the Mac, iPhone, and now, Windows.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "One of the Mac's Best Productivity Apps Is Now on Windows",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBN70EVQ6Y5Q9205YSR8ZV7J/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-04T20:00:00.000Z",
      "dateModified": "2025-12-04T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Four Easy Ways to Clean Up Your Mac's Menu Bar",
    "url": "https://lifehacker.com/tech/four-easy-ways-to-clean-up-mac-menu-bar?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBG0ZXFR5XVAS47Y78MNP0Z5/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-02T18:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Pranay Parab\n             ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Pranay Parab\n                            \n    Table of Contents\n    \n        \n        When I switched to a Mac about a decade ago, I immediately fell in love with my MacBook's menu bar, and especially the various icons in its top-right corner. I've always enjoyed keeping useful menu bar apps there, such as clipboard managers, app launchers, or apps that update other apps. But unfortunately, if you've installed more than a few third-party apps on your MacBook, your menu bar might be pretty cluttered. It's nothing a quick clean-up can't fix, though, and now macOS ships with a few ways to help fix your messy menu bar.\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nJust as you'd remove unwanted items from your desk, you should periodically declutter the menu bar by removing apps that don't need to be there. This doesn't uninstall those apps, but it does free up some space in your menu bar. I do this for menu bar icons I never end up clicking. macOS 26 Tahoe has an easy way to remove apps from the menu bar. Follow these steps to do it:Click the Apple logo in the top-left corner of your Mac's screen.Go to System Settings > Menu Bar.In the right pane, navigate to the section called Allow in the Menu Bar.You'll see a list of apps that have a menu bar icon. You can uncheck any app you want to remove.Some apps also offer a way to remove their icons from the menu bar. Try checking your apps' settings to see if they let you remove their menu bar icons.\nNote that removing a menu bar icon for an app can sometimes cause the app to become \"headless,\" which means that it'll be running in the background but its icon won't show up in either the menu bar or the dock. This is fine for apps that you only need to configure once, but it can become a problem if you want to use the app regularly. In such cases, you can use a Spotlight search (Cmd + Space, or the magnifying glass icon in the menu bar) or alternatives such as Alfred or Raycast to search for the app's name and open it.\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nI'm sure you've noticed that the menu bar has more than just app icons. It's also home to the clock, wifi, volume controls, and more. You can easily add or remove these controls from the menu bar, as long as you're running macOS Tahoe. Here's how:\n            \n                What do you think so far?\n            \n        \nGo to System Settings > Menu Bar.Head over to the Menu Bar Controls section.Uncheck any control you want to remove from the menu bar.You cannot entirely remove the clock from the menu bar, but you can click Clock Options… and switch to Analog to make its icon a lot smaller.Drag and drop icons to rearrange the menu bar\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nYou also have the option of dragging and dropping your app icons around the menu bar, or using drag-and-drop to remove them from the menu bar. Just hold the Command key and drag any menu bar icon to a different position within the menu bar to rearrange it. To remove icons from the menu bar using drag-and-drop, hold Command and drag-and-drop them outside the menu bar.\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nTo tame the chaos at the top of your Mac's screen, I strongly recommend using a menu bar manager app. These apps will automatically show or hide menu bar icons based on triggers (eg: the battery icon will only show up when your MacBook's charge is below 25%), or add a second row of icons that's visible only when you click the menu bar. You'll need to try a couple of menu bar managers to decide which one works best for you. I've been using Barbee for some time, and its my current favorite.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Four Easy Ways to Clean Up Your Mac's Menu Bar",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBG0ZXFR5XVAS47Y78MNP0Z5/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-02T18:30:00.000Z",
      "dateModified": "2025-12-02T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "5 Little-Known Extensions That Make Safari Even Better",
    "url": "https://lifehacker.com/tech/little-known-safari-extensions?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBJWSH2Q396WMNPK4A15GW74/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-03T20:30:00.000Z",
    "description": "\n        \n        I've said it before and I'll say it again: Safari is better than Chrome. Apple's default browser runs faster, is less cluttered, off",
    "body": "\n        \n        I've said it before and I'll say it again: Safari is better than Chrome. Apple's default browser runs faster, is less cluttered, offers privacy features Google would never contemplate, and doesn't try to cram AI down your throat.But that doesn't mean Safari is perfect. Like all browsers, it works better if you install the right extensions. Here are a few I've found in the past year or so that make the best browser even better.Block ads and other clutter\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThe internet is increasingly useless without a good ad blocker, and the best ad blocker for Safari—which works on both macOS and mobile devices—is wBlock. This extension uses the built-in ad blocking functionality offered by Safari, which is much faster than the workarounds that extensions on browsers like Chrome need to use. It also supports a number of popular blocklists, with automatic updating. Or you can go even further and install Userscripts. Best of all, it's completely free. Try it out if you're not happy with your current ad blocker.\nAdd a dark mode to sites that don't have one\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nWe can argue endlessly about whether dark or light mode are better (and I have), but we can all agree it's annoying to be using dark mode only for the websites you're browsing to be white as snow. That's where Noir comes in. This extension forces Dark Mode in Safari on websites that otherwise don't offer the feature. It's a must-have for dark mode enthusiasts.Automatically open picture in picture when you switch tabsSafari, on mobile, will keep playing videos using picture-in-picture mode if you switch to another application or tab. The desktop version of Safari doesn't do this, which is a shame. Autopip is a Safari extension for Mac that adds this feature. The result: you can keep watching a video in the background while you're working in another tab or application. It's perfect if you're the sort of person who leaves a video playing while you're working on something else.\n            \n                What do you think so far?\n            \n        \nQuickly copy the URL for the current site\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nArc, the browser, is dead, and if I'm honest I only miss one feature: the ability to copy the URL of the current website using the keyboard shortcut Command-Shift-C. Yes, it's a very specific thing to miss, but I can't overstate how much of a habit this became for me. And I can keep the habit thanks to Supercopy, a Safari extension that adds the keyboard shortcut to Safari. Yes: that's all it does. I use it dozens of times every day, though, so for me it's well worth keeping around.Filter Reddit to be less rage inducing\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nI'd love it if I spent less time on Reddit and I'm sure I'm not alone. The problem: there's a mix of useful and rage-inducing stuff on that website. The good news is Protego lets you filter Reddit to be less infuriating. The idea is to pick a few subreddits you know, in your heart of hearts, you shouldn't be looking at. Do that and you'll be able to use Reddit without ending up down rabbit holes of rage and disgust. You can also filter out posts using keywords and hide promoted content. Trust me: you'll be happier.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "5 Little-Known Extensions That Make Safari Even Better",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBJWSH2Q396WMNPK4A15GW74/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-03T20:30:00.000Z",
      "dateModified": "2025-12-03T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pebble Is Releasing a $75 Ring, but It’s Not an Oura Competitor",
    "url": "https://lifehacker.com/tech/pebble-is-releasing-the-index-01-ring?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC2E547V2E9MXT03HQM9TRA3/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-09T21:30:40.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n    We may earn a commission from links on thi",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n    We may earn a commission from links on this page.\n    \n            Credit: Pebble\n                            \n            \n                Key Takeaways\n                                            Pebble's new ring is called the Index 01, and it costs $75 to pre-order.\n                                            The ring has a button and microphone, but no heart rate sensor.\n                                            It's intended to be a one-handed input for voice notes that are sent to your phone and/or Pebble watch.\n                                    \n            \n    Table of Contents\n    \n        \n        When I hear that a smartwatch company is launching a ring, I assume it’s going to be a smart ring. But Pebble went a different direction, instead creating what’s basically a remote microphone that can work with your phone and other devices. It's available for pre-order for $75, and will sell for $99 after launch.Pebble’s new ring is called the Index 01. It’s got a button you can click and hold, and a microphone that will listen to what you’re saying as you hold the button. The recording is then sent to your phone, where it’s processed on-device. That's it—no heart rate sensor, and no charging dock.The Index 01's specs and functionalityEric Migicovsky, Pebble’s founder, describes using the Index to capture short messages and send instructions to his Pebble watch via his phone. The idea is that you wear the Index on your index finger (get it?) and press the button with your thumb. The ring comes in three colors: matte black with a black button, polished gold with a blue button, and silver with a white button. \nThere is no battery to charge, just a built-in battery that lasts a total of 12 to 15 hours. Migicovsky writes: “On average, I use it 10-20 times per day to record 3-6 second thoughts. That’s up to 2 years of usage.” The ring doesn’t have a speaker and can’t vibrate for notifications; it’s just for input. Communication between the ring and your phone is encrypted, and the voice recordings are processed into text on your phone, without requiring an internet connection. The ring doesn’t talk directly to a Pebble watch, but it can talk to your phone and your phone can then display any output to the watch—for example, displaying the text of a reminder that you set. Who should buy an Index 01 ring?So far, Pebble users don’t seem to be nearly as excited about this product as Migicovsky is. A Reddit thread discussing the announcement has comments like “Cool idea, weird product,” and “Why would I want this if I already have a Pebble that has all the capability to take voice notes?” \n            \n                What do you think so far?\n            \n        \nMigicovsky explains in the company’s blog post that his goal was for the button to be operated with one hand, and gestures on the Pebble weren’t reliable enough. He also emphasizes the fact you don’t need to charge it, while some of the users seem to be more concerned that a device that can't be charged is basically disposable—\"manufactured e-waste.\" After about two years of use (or less, if you make longer recordings), the app will ask if you’d like to order another ring. The ring will cost $75 to pre-order, and $99 at its regular price. There hasn’t been any mention of a discounted rate for a replacement; it sounds like you’re supposed to buy a new $99 ring every two years. The ring’s functionality could be extended in the future. A double click-and-hold could signal the Pebble app to process the data in a different way (perhaps sending it to ChatGPT, Migicovsky suggests) and developers could connect the voice processing in the app to other services like calendar and weather apps. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pebble Is Releasing a $75 Ring, but It’s Not an Oura Competitor",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC2E547V2E9MXT03HQM9TRA3/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-09T21:30:40.000Z",
      "dateModified": "2025-12-09T21:30:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "10 Hacks Every iPhone User Should Know",
    "url": "https://lifehacker.com/tech/hacks-every-iphone-user-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KB4W4TKHXTNC6N1PACDZC71W/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-09T18:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    Time to power up.\n            \n                        \n    \n                            \n        \n        \n        December 9, 2025\n            \n            \n                        Credit: René Ramos/Lifehacker/BillionPhotos.com/Stockii_Studio/Adobe Stock/Apple\n                            \n    \n        \n        I'm routinely surprised by just how much technology Apple has managed to pack into the iPhone that I can carry in the palm of my hand. What's even more surprising is that underneath the layers, there's even more than what meets the eye. There's a better, faster way to use the keyboard, there's a faster way to select unread emails to archive, there are better ways to browse the web than just the usual Safari experience, and you can get way better photos out of the iPhone Pro cameras than what the stock Camera app shows you. The iPhone has become such a default product in all our lives that we just take it for granted. Yes, it's a great way to stay in touch with friends and coworkers, to capture moments, and to doomscroll the night away. But spend some more time, and there's a whole new iPhone experience just waiting for you that will truly transform how your iPhone looks and works.  Automate the small, redundant tasks\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nApple installs the Shortcuts app on every device and even offers pre-built shortcut automations that you can install from the Gallery. But the fun starts when you explore the very active Shortcuts community online and start to integrate Automations into the mix.\nApple’s Shortcuts app lets you create automations that automatically follow pre-defined steps. They can be used to resize images, compress files, convert data, and even control aspects of your smartphone. For example, you can create an automation that automatically enables a VPN when you step out of your home, or sends a message to your partner when you leave work. Looking to get started? We have a list of seven automations that I feel every iPhone user should install.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nI’m a huge fan of custom widgets. Whenever someone picks up my iPhone, the response is usually something like, \"Your iPhone doesn’t look like a regular iPhone.\" That’s down to custom widgets that show the time, day, my appointments, the weather, my tasks, and more. The world of custom iPhone widgets is huge, and if you just want to dip your toes in, I would suggest you start with the Widgetsmith app, which lets you customize multiple widgets with the same theme and fonts. All together, it looks really aesthetically pleasing. When you’re ready, you can dive in with the Widgy app, where you can import and customize thousands of interactive widgets.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThe iPhone has a hidden button, and it’s on the back of your iPhone. It’s an accessibility feature that you can access via Settings > Accessibility > Touch > Back Tap. You can then assign any app, shortcut, or action to either the Double Tap or Triple Tap gesture. It’s a great way to trigger Shortcuts automations, or to simply bring up the selfie camera. I personally find that the double-tap gesture has a tendency to misfire sometimes, and the triple-tap gesture is a lot more reliable.Enhance Safari using extensions\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nIf you don’t use Safari extensions, you’re sleeping on unrealized potential. Just like on the Mac, the Safari browser on the iPhone also supports extensions. And you can use extensions to do some really cool things, like blocking all ads and trackers (of course), but also to force every website to be in dark mode, all the time. You’ll also find extensions to improve the Reddit browsing experience and to take complete control of all the elements on the websites you use frequently.Upgrade to a third-party browser \n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nUsing a third-party browser, like Vivaldi, is a very power-user move. All third-party browsers on iOS are technically variations of Safari, as Apple forces developers to build their browsers on Safari's WebKit platform. However, these third-party browsers can include unique features that Safari doesn't.  Vivaldi, for example, offers desktop-class tab browsing, including tab groups and pinned tabs. Then there’s Orion, which can run desktop-class extensions from Firefox and Chrome Web Store on your iPhone (something that Safari can’t do). And if you don’t like Safari’s new interface, try out Quiche, which is a completely customizable browser.Master your Focuses\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nFocuses have the potential to transform how your iPhone looks and works, based on your location, time, day, or the task at hand. It’s time to go beyond Do Not Disturb and embrace everything that Apple's Focuses can do.It would be a good idea for you to set up Focuses for Work, Personal Time, and Sleep. In each Focus, you can decide which apps can send notifications, and which friends or family members can contact you. You can even choose which home screens to show in particular Focus, choosing to hide widgets and apps depending on the Focus (no work stuff at all in Personal Time Focus, for example). Focus also integrates with Shortcuts and Automations, so you can trigger a Focus when you start a video call on your Mac or reach a particular location (like your workplace). Go to Settings > Focus to get started.You’ll be familiar with all the usual iPhone gestures, like swiping up from the Home bar, or tapping the top edge of the iPhone to instantly scroll to the top. But the iPhone has a lot more hidden gestures that can really speed things up. If you see a long list, try to swipe down with two fingers to instantly start selecting items. This works really well in Mail, Phone, and other Apple apps, but is also supported by third-party apps. Next, in iOS 26, Apple added back gesture support that’s arguably better than Android. You can swipe in from anywhere on the left edge to quickly go back.\n            \n                What do you think so far?\n            \n        \nYou can also cut, copy, and paste with a three-finger gesture. To copy something, pinch it with three fingers. To cut, do it twice. To paste something, do a three-finger spread gesture (opposite of the pinch).Get faster with the iPhone keyboard\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThe iPhone keyboard is more than what meets the eye. It has a built-in Slide to Type feature where you can glide your finger over the keys to type words. It works really well, especially when using the phone one-handed. There’s a virtual trackpad built in, too. Just tap and hold the Space bar and move your finger to move the cursor around.If you find your keyboard too large to type on, you can also enable the one-handed keyboard from the Keyboard Settings button (tap and hold the Globe icon). From here, you can go to Keyboard Settings to enable a multi-lingual keyboard and to try out Text Replacement, where you can create shortcuts for expanding your frequently used text snippets. For example, you can type “adrs” to expand to your full home address.Scan documents without a third-party app\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nYou might not know this, but there’s a really neat document scanner built into the Notes app and the Files app. I prefer to use the Files app for this because I get to save a PDF directly in the folder that I want. Open the Files app, go to any folder, tap the three-dotted Menu icon, and choose the Scan Documents feature. There’s an Auto Shutter feature that’s enabled by default that will automatically scan each new page you put in front of your camera (if you find this annoying, you can disable it as well). Scan as many pages as you want, and tap the Done button. Then, give the document a name. And it’s now stored as a PDF in the folder. You can now send it to where it needs to go, or back it up using iCloud Drive.Upgrade your photos and videos on iPhone Pro\n    \n            \n            \n                                        Credit: Blackmagic\n                    \n    \nThe cameras on the iPhone Pro are truly stellar. But the Camera app is not. The default Camera app does too much computational photography for my taste, and has trouble focusing on elements exactly when I need to capture something small. Plus, the Pro cameras can shoot in Log in ProRes, and to fully take control of the visuals from your iPhone, you’ll need to step out of the Camera app.For shooting video in the best light, Blackmagic is a great choice. Here, you get full manual control over both photos and videos, with film-grade presets (including the ability to create your own custom ones).If that feels a bit too Pro, try using a third-party app to capture much better photos. My colleague Pranay has highlighted a couple of great options, with Halide Mark II topping the list (I agree, as well). Halide gives you a lot more control over the look of your photos. There’s also a Process Zero feature that removes all of Apple’s computational processes from the photos.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n                        \n                \n            \n                    \n                                            \n                \n            \n                Khamosh Pathak\n                                \n                                            Khamosh Pathak is freelancer tech journalist with over 13 years of experience writing online.\n                                    \n                Read Khamosh's full bio\n                            \n        \n                \n                                            \n    More by Khamosh\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 Hacks Every iPhone User Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KB4W4TKHXTNC6N1PACDZC71W/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-09T18:30:00.000Z",
      "dateModified": "2025-12-09T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]