[
  {
    "title": "Microsoft's Latest 'Patch Tuesday' Update Fixes These Three Zero-Days",
    "url": "https://lifehacker.com/tech/microsoft-patch-tuesday-update-december-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC352X3QRTYWNS7CP2G3NBYA/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-10T14:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Alex Photo Stock/Shutters",
    "body": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Alex Photo Stock/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Microsoft's Patch Tuesday for December addresses 56 flaws in total.\n                                            Windows users should ensure their machines are updated as soon as possible to fix three zero-day vulnerabilities.\n                                            One of the zero-days has been actively exploited, while the other two have been publicly disclosed.\n                                    \n            \n    Table of Contents\n    \n        \n        Microsoft's Patch Tuesday update for December is here, and Windows users should ensure their machines are updated as soon as possible to fix three zero-day vulnerabilities. These are security flaws that are actively exploited or publicly disclosed before the developer releases an official patch. As reported by Bleeping Computer, this month's update addresses 56 bugs in total: 28 elevation-of-privilege vulnerabilities, 19 remote-code-execution vulnerabilities, four information-disclosure vulnerabilities, three denial-of-service vulnerabilities, and two spoofing vulnerabilities. Three of the remote code execution flaws are labeled \"critical.\" Note that these figures do not include updates released for Microsoft Edge and Mariner. Patch Tuesday is typically released on the second Tuesday of every month around 10am PT, so you can anticipate security updates at that time. \nOne of the zero-days patched in December has been actively exploited in the wild, though Microsoft has not shared any details as to how. CVE-2025-62221 is an elevation-of-privilege vulnerability in the Windows Cloud Files Mini Filter Driver, and when exploited, give attackers SYSTEM privileges. The mini filter allows cloud applications, such as OneDrive, access to file system functions. \n            \n                What do you think so far?\n            \n        \nThe other two bugs fixed have been publicly disclosed: CVE-2025-64671 - GitHub Copilot for Jetbrains Remote Code Execution Vulnerability: This flaw, which can be exploited through a Cross Prompt Injection in untrusted files or MCP servers, allows attackers to execute commands locally. According to Krebs on Security, this could trick the LLM into adding malicious instructions in the user's auto-approve settings. CVE-2025-54100 - PowerShell Remote Code Execution Vulnerability: This bug could cause scripts embedded in a webpage to be executed when retrieved using Invoke-WebRequest. CVE-2025-62221 has been attributed to Microsoft Threat Intelligence Center (MSTIC) & Microsoft Security Response Center (MSRC). CVE-2025-64671 was disclosed by Ari Marzuk, while CVE-2025-54100 has been credited to multiple security researchers. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft's Latest 'Patch Tuesday' Update Fixes These Three Zero-Days",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC352X3QRTYWNS7CP2G3NBYA/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-10T14:30:00.000Z",
      "dateModified": "2025-12-10T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This New Android Feature Protects You From a Scam Call While It's Happening",
    "url": "https://lifehacker.com/tech/this-new-android-feature-protects-you-from-a-scam-call-while-its-happening?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBN5YJXM3RYZVHHBB4D420Z3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-04T20:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Google / Hight Photography",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Google / Hight Photography / Shutterstock\n                            \n            \n                Key Takeaways\n                                            Android users in the U.S. will soon have extra protection against scams targeting their financial apps.\n                                            You'll get a pop-up warning that the call is likely a scam with a reminder not to make payments or share personal information and a button to end the call.\n                                            U.S. users will see these protections when trying to access Cash App and JPMorganChase.\n                                    \n            \n    Table of Contents\n    \n        \n        Bank impersonation is a popular scam tactic, and one I've written about a lot. Fraudsters prey on people's fear, confusion, and desire to protect their money, which may lead targets to hand over login credentials, make irreversible wire transfers, or provide other sensitive information without stopping to question their actions. Android users in the U.S. will soon have extra protection against scams targeting their financial apps, preventing threat actors impersonating bank representatives from accessing data on their devices. Google's in-call scam protection is designed to prevent users from sharing their screens with threat actors and help them avoid revealing their banking information. How Android in-call protection worksAndroid's scam protection kicks in if you are on a phone call with a number not saved in your contacts and attempt to open a participating financial app. You'll get a pop-up warning that the call is likely a scam with a reminder not to make payments or share personal information and a button to end the call (and stop screen sharing). There's also a 30-second delay on further action on your device, which Google says is designed to disrupt any sense of urgency. \nNote that financial institutions must opt into in this feature—at this time, Google has specifically named Cash App and JPMorganChase as partners, though it indicates expansion to other popular fintechs and banks. \n            \n                What do you think so far?\n            \n        \nGoogle initially rolled out in-call protections for banking apps to UK users earlier this year as part of a larger package of security features announced ahead of Google I/O. That launch also included real-time scam detection alerts for calls and texts, improved theft protection via remote lock and identity check, key verifier for Google Messages, and device-level Advanced Protection (in addition to account-level settings). Alongside the US pilot, in-call scam protections will now cover most major banks in the UK as well as financial apps in Brazil and India. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This New Android Feature Protects You From a Scam Call While It's Happening",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBN5YJXM3RYZVHHBB4D420Z3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-04T20:30:00.000Z",
      "dateModified": "2025-12-04T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Windows Update Pop-Up Is a Scam",
    "url": "https://lifehacker.com/tech/windows-update-pop-up-clickfix-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBK2SENEP0XTH9T90WPKGE98/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T17:30:00.000Z",
    "description": "\n        \n        The update screen is a normal occurrence on Windows machines, so of course hackers are now manipulating it to sneak malware onto dev",
    "body": "\n        \n        The update screen is a normal occurrence on Windows machines, so of course hackers are now manipulating it to sneak malware onto devices. The scheme, a recent iteration of a ClickFix attack, is designed to trick you into executing a dangerous command under the guise of completing a \"critical security update.\" But what you're actually doing is installing an infostealer that hands data over to bad actors. When a Windows update pop-up is actually a ClickFix attackClickFix is a social engineering ploy that uses tactics like fake error messages, CAPTCHA forms, and command prompts to deliver malware to your device. As PCMag reports, the Windows update scam is a pop-up that looks like a standard Windows blue screen but is actually a full screen browser page being displayed from a malicious domain. The ClickFix element is a set of keystrokes—not part of the real update interface—that have the user paste and execute a malicious command, ultimately delivering malware to their device. These instructions have an air of urgency, which is a common element of a scam. \nResearchers at cybersecurity firm Huntress have detailed the exact mechanism behind this attack, including an iteration in which users are prompted to verify they are human (rather than complete a security update). As Bleeping Computer outlines, the malicious code is embedded into the pixel data of PNG images, and the final payload is one of two known infostealers.According to the Huntress analysis, following a recent law enforcement operation, fake Windows update pages continue to exist across multiple domains, but those domains no longer seem to host the malware payload. That doesn't mean, however, that this attack, or some version of it, won't pop up elsewhere. \n            \n                What do you think so far?\n            \n        \nHow to stay safe from this ClickFix attackIf you run Windows on your device, you've probably seen a blue or black update or error screen many times, and you may not be suspicious if your computer randomly begins an update or prompts you to take an extra step to confirm it. But while a legitimate update screen will have a progress indicator and instructions not to turn off your computer, you should never need to input manual commands. This is a red flag of a ClickFix attack and not something a trusted service will require.  Of course, it's important to keep your computer up to date. Microsoft releases security updates on the second Tuesday of the month, known as Patch Tuesday, and you can enable automatic updates on your machine to ensure you get fixes as soon as they're available. If you want to take additional steps to prevent ClickFix attacks on Windows, you can disable the Windows Run box to prevent unauthorized access to commands.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Windows Update Pop-Up Is a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBK2SENEP0XTH9T90WPKGE98/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T17:30:00.000Z",
      "dateModified": "2025-12-04T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Your Android Can Now Share Live Video to 911",
    "url": "https://lifehacker.com/tech/your-android-can-share-live-video-to-911?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC87Y7A3B2PQDPHH536D5D8E/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-12T15:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Skrypnykov Dmytro/Shutter",
    "body": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Skrypnykov Dmytro/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Live video sharing is rolling out now to U.S. users, as well as those in parts of Germany and Mexico.\n                                            The service is available for Android phones running Android 8 and up.\n                                            You don't need to do anything to set up Emergency Live Video.\n                                    \n            \n    Table of Contents\n    \n        \n        If you find yourself in an emergency or crisis situation, the more information you can give first responders, the better. Android users can now share a live stream of their surroundings with 911, allowing emergency services to assess and provide guidance in real time while you wait for help to arrive onsite.Emergency services on AndroidYour Android already shares some information with first responders via Emergency Location Services (unless you disable this feature). This built-in tool sends an accurate location as well as contextual information, such as language settings, when you call or text an emergency number. Now, that includes live video from your device's camera. You don't need to do anything to set up Emergency Live Video. Once available in your area, responders can send a request during an emergency call or text to securely share your camera's live video. You'll see a prompt on your screen to start sharing with one tap. \nAccording to Google, Emergency Live Video is encrypted by default. Users can choose whether to share their video from the prompt as well as stop the share at any time by clicking the onscreen Stop sharing button. \n            \n                What do you think so far?\n            \n        \nLive video sharing is rolling out now to U.S. users, as well as those in parts of Germany and Mexico, on Android phones running Android 8 and up. Google says they are partnering with public safety organizations to expand the feature to more users. Other Android safety featuresEmergency Live Video is the latest in Google's suite of safety features designed to make help more accessible—more quickly—in an emergency. Pixel users in Australia, North America, and several dozen countries across Europe now have access to Satellite SOS, which allows you to call emergency services even without a cellular or wifi connection. Car Crash Detection contacts emergency services and shares your location in the event of severe crash, while Fall Detection and Loss of Pulse Detection will call for help based on Pixel Watch sensor data. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Your Android Can Now Share Live Video to 911",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC87Y7A3B2PQDPHH536D5D8E/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-12T15:30:00.000Z",
      "dateModified": "2025-12-12T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reading in Cars Makes Me Nauseous, but This App Helps",
    "url": "https://lifehacker.com/tech/motion-sickness-app-kinestop?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC7FNXVW0F2ARBX239E0AKH5/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-12T14:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Justin Pot\n              ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        I get really carsick if I try to read in a moving vehicle. And there's a reason for that: my eyes and my sense of movement are out of sync.At least, that's according to the CDC, which states that motion sickness, \"happens when the movement you see is different from what your inner ear senses.\" Your inner ear is a sack of fluid that moves when you do, giving you an innate sense of movement. If you're in a car and watching the horizon, your senses are aligned. But if you're looking at your phone, your senses are confusing each other. It's similar to the reason VR games make some people feel sick.The free Android app KineStop aims to help. The application overlays a transparent horizon, and a number of transparent dots, across your entire screen. The accelerometer on your phone is used to move these reference points as your phone moves, helping to reduce the conflict between your eyes and your inner ear. You can turn the feature on manually in the application or, if you prefer, you can set it up to turn on automatically when you're in a moving car.\nI tried it out, wondering if it would help with my carsickness, and it did—surprisingly well. Normally I can't read for more than a few minutes without feeling sick, but the KineStop app helped me do so for longer, without discomfort. I'm still not going to be able to read novels during a long road trip, mind you, but I can look up the next restaurant on a road trip without vomiting, and I call that a win.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nKineStop is totally free, though there's a $3.50 pro version that adds themed overlays, including one that makes it look like your phone is a half-empty beer. It's great to support a developer, but I also think the free version will work fine for most everyone.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reading in Cars Makes Me Nauseous, but This App Helps",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC7FNXVW0F2ARBX239E0AKH5/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-12T14:00:00.000Z",
      "dateModified": "2025-12-12T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yep, Apple Music and Apple TV Are Down",
    "url": "https://lifehacker.com/tech/apple-music-and-apple-tv-are-down?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC51TK4KGMVS7CCNEJNV6HQQ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-10T21:36:56.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Matthew Nichols1/Shutters",
    "body": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Matthew Nichols1/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple is reporting that Apple Music, Apple TV, and Game Center are experiencing outages.\n                                            The outages appear to have started at 2:53 p.m. ET for all affected services.\n                                            The report says that \"some users are affected,\" so these services might not be down on your end.\n                                    \n            \n    Table of Contents\n    \n        \n        If you picked up your iPhone to round out your Apple Music Replay for the year, or turned on your TV to watch a show like Pluribus, you might have noticed something odd: Neither service is working. It's not just you: Apple Music, Apple TV, and Game Center are currently down. That's directly from Apple's \"System Status\" website, which tracks all of Apple's web-based services and identifies which ones may be experiencing problems. While most of Apple's services, like the App Store, Find My, and iMessage, are all \"Available,\" four of these services are experiencing an outage: Apple Music, Apple TV, Apple TV Channels, and Game Center.   If you click on each, you can see the service's full status report:\nApple Music - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Apple TV Channels - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Apple TV - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Game Center - 1 Outage, 1 Resolved IssueOutage: Today, 2:53 PM - ongoingSome users are affectedUsers may be experiencing a problem with this service. Resolved Issue: Today, 8:43 AM - 9:14 AMSome users were affectedUsers may have experienced a problem with this service.It's not clear what is causing the outages, though they all went down at 2:53 p.m.. (Apple doesn't specify, but I imagine that's ET.) This isn't the first time this has happened, of course. In fact, Apple Music was down earlier this year, though it was actually still working for me when Apple said the outage was active. \n            \n                What do you think so far?\n            \n        \nThat appears to be the situation today, as well. Each report says \"some users are affected,\" not all. As it happens, Apple Music is working on my Mac, and I'm able to stream the free pilot episode of Pluribus without issue. Apple will likely get these services back up and running for affected users. In the meantime, if your Apple Music or Apple TV won't cooperate, this is likely the cause. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yep, Apple Music and Apple TV Are Down",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC51TK4KGMVS7CCNEJNV6HQQ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-10T21:36:56.000Z",
      "dateModified": "2025-12-10T21:36:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three Changes Coming to Your Apple Watch With watchOS 26.2",
    "url": "https://lifehacker.com/tech/apple-watchos-262-updates?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNMEX42ZBVNCHDQH53K9ACF/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T22:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: DenPhotos/Shutterstock\n   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: DenPhotos/Shutterstock\n                            \n            \n                Key Takeaways\n                                            watchOS 26.2 is bringing three new features and changes to your Apple Watch.\n                                            Apple is updating Sleep Score, which should now be a bit more accurate when calculating your overall score.\n                                            The update also fixes an annoying Music glitch and introduces Enhanced Safety Alerts.\n                                    \n            \n    Table of Contents\n    \n        \n        Yesterday, Apple unveiled release candidates (RCs) for its slate of upcoming updates. An RC, as the name implies, is the version of a software update Apple intends to release to the general public. Before it rolls out, though, Apple sends the update out to beta testers to see if there are any bugs or glitches that need addressing. If not, these are the updates that will hit your Apple devices sometime this month. That includes watchOS 26.2, Apple's latest OS for its line of smartwatches. While there aren't nearly as many new features and changes in this update as there were in watchOS 26 proper, there are still some key things to highlight in this RC. In fact, as noted by 9to5Mac, there are three:Updates to Sleep ScorewatchOS 26 introduced Sleep Score, a feature that was sorely missing on the Apple Watch. Sleep Score analyzes a host of data collected while you slept, including sleep duration, the time you actually went to bed, and any wake-ups you might have had during the night, and gives you an overall score. The idea is to glance at the score and see how you slept that night, so you can either take steps to improve your sleep going forward, or know you're on the right track. The total score is out of 100: Duration gets you up to 50 points, bedtime gets up to 30, and sleep interruptions go up to 20.  \nwatchOS 26.2 refines the feature, by adjusting the final Sleep Score metrics. The feature had a tendency to give you higher scores than you might have otherwise felt you earned: A mediocre night's sleep might have have scored \"High\" on your chart, which wouldn't have made much sense to you. Going forward, the scoring is a bit more conservative. Here's what you can expect, and how the scores changed from the last update:Very Low: 0–40 (previously 0–29)Low: 41–60 (previously 30–49)OK: 61–80 (previously 50–69)High: 81–95 (previously 70–89)Very High: 96–100 (previously 90–100) You'll also noticed Apple changed the \"Excellent\" score to \"Very High,\" which keeps the naming a bit more consistent.Music app glitch fixIf you've been using the Music app on your Apple Watch, but have been struggling to get your songs to actually, you know, play, good news: Apple says in the release notes for watchOS 26.2 RC that there is now a fix for an issue where the Music app doesn't move to the next song.\n            \n                What do you think so far?\n            \n        \nEnhanced Safety AlertsFinally, watchOS 26.2, along with other Apple updates, introduces Enhanced Safety Alerts. According to Apple, this feature will warn you about \"imminent threats,\" including floods, natural disasters, and other emergencies. The feature will also include data like maps and links to official safety advice. Apple has been positioning the Apple Watch to be an overall health and safety device, and this feature only seems to complement that. Recent Apple Watches have hypertension alerts, which can help you passively identify high blood pressure, while fall and crash protection can automatically call for help in emergencies when you can't reach the phone. When does watchOS 26.2 come out?Apple doesn't have a set date for watchOS 26.2, or iOS 26.2 and macOS 26.2 for that matter. However, now that the RCs are out, these updates are likely coming soon. As long as there aren't any glaring bugs or glitches in these RCs, Apple will likely ship the updates sometime this month.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three Changes Coming to Your Apple Watch With watchOS 26.2",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNMEX42ZBVNCHDQH53K9ACF/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T22:30:00.000Z",
      "dateModified": "2025-12-04T22:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Happened to the iPhone 17 Pro’s Portrait Night Mode?",
    "url": "https://lifehacker.com/tech/iphone-17-pro-portrait-night-mode-missing?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNG47316RZ18KQCY4V2BFM8/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T22:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Hadrian/Shutterstock\n     ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Hadrian/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple's latest iPhone 17 Pro models are missing a feature found in the last five generations of Pro iPhones.\n                                            For some reason, you can no longer take Portrait mode shots with Night mode—though Night mode itself still works for standard shots.\n                                            Apple has not disclosed why this feature is missing.\n                                    \n            \n    Table of Contents\n    \n        \n        New products tend to add features, not take them away. That isn't always the case with Apple, however. The company has a long history of removing functions from one generation of devices to the next, whether that's removing the disc drive from its MacBooks back in 2012, or taking away the iPhone's Home button in 2017. Some of these changes are good, some are controversial, while others are undone altogether: MagSafe and HDMI both found their way back to MacBooks after all.It's not often I hear about Apple removing software features from one generation of product to the next, however. So, imagine my surprise when I saw a number of headlines this morning asserting that the iPhone 17 Pro, Apple's latest and greatest flagship, is missing a feature found in the last five generations of Pro iPhones—and nobody noticed for nearly three months. Night mode is missing from Portrait mode on the iPhone 17 Pro and 17 Pro Max. The short answer? We have no idea. This was not something Apple announced publicly, of course. In fact, Macworld spotted the change in an Apple support doc: If you scroll down to the section where it says \"On supported models, you can take Night mode photos with Portrait mode,\" and click the hyperlink on \"On supported models,\" you'll pull up a list of iPhones that, mysteriously, doesn't include the 17 Pro or 17 Pro Max. The list includes:\niPhone 12 ProiPhone 12 Pro MaxiPhone 13 ProiPhone 13 Pro MaxiPhone 14 ProiPhone 14 Pro MaxiPhone 15 ProiPhone 15 Pro MaxiPhone 16 ProiPhone 16 Pro Max For the uninitiated, Night mode and Portrait mode are technically two distinct features. Portrait mode was released first, all the way back on the iPhone 7 Plus, which utilized the dual-camera system to add a bokeh effect to shots of people. Those early shots were hit or miss, and were often no replacement for a true DSLR, but as Apple's tech and cameras have improved, so has Portrait mode. Part of the improvement was the introduction of Night mode. This feature, which Apple was a bit late to the game on, allowed you to take brighter images in low-light environments by lengthening the time the shutter stays engaged. Older iPhones without the feature would take images that were hard to see without the flash engaged, but Night mode could pull in details as long as there was just enough light present in the scene. Since the iPhone 12 Pro, Portrait mode came with the option of Night mode, as well. If you're trying to take a portrait shot in a dark environment, Night mode kicks in and gives the image a chance to turn out brighter and more detailed. But now, it seems, the 17 Pro and 17 Pro Max do not have this option. \n            \n                What do you think so far?\n            \n        \nTo be clear, these new iPhones still have Night mode: Per that previously mentioned support page, you can take brighter shots at night when taking standard photos, selfies, and time-lapse videos. It just seems Apple decided to remove the feature for Portrait mode shots on its latest Pros.Of course, this news started breaking on Dec. 3, nearly three months after the 17 Pros launched. If it took this long for someone to notice a missing feature, was it really all that important to begin with? I don't have a 17 Pro, so I really can't say, but I also can't say I take many Portrait mode shots in dark environments. I've reached out to Apple for comment, and will update this story if I hear back. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Happened to the iPhone 17 Pro’s Portrait Night Mode?",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNG47316RZ18KQCY4V2BFM8/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T22:00:00.000Z",
      "dateModified": "2025-12-04T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This macOS App Makes It Easy to See (and Use) Your Keyboard Shortcuts",
    "url": "https://lifehacker.com/tech/learn-macos-app-shortcuts?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNBQ0H4F582WCTDJF7E7Z8H/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-05T15:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 5, 2025\n    \n            Credit: sergey causelove / Shutter",
    "body": "\n        \n    \n                                        \n        \n        \n        December 5, 2025\n    \n            Credit: sergey causelove / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Using keyboard shortcuts is a lot faster than clicking around in the menus, but only after you learn them. That's the hard part.You could look up the documentation for the application or explore the menu bar—but if you're on a Mac, you could also just install KeyClu. This free application shows an overlay with all the keyboard shortcuts for the currently open Mac application, which is very useful for anyone trying to become a more keyboard-savvy computer user.To get started, install the application. Then, you'll need to choose a trigger key (basically one of the modifier keys on your keyboard). By default, you will tap the key twice and hold on the second tap to trigger the overlay, but you can optionally set the application to simply press and hold the key if you prefer. I opted to press and hold Command.\nAfter that, you'll be asked to enable permissions so KeyClu can access the keyboard shortcuts for your applications. Then you can start using the application. I tend to ignore the application until I wonder whether a keyboard shortcut for a particular function exists. I trigger the application, look through the list of keyboard shortcuts, and see what's available. When I let go of the trigger key, the window disappears.This default floating window is useful, but you might want a window listing shortcuts to stay open even when you let go of the trigger. That's where the persistent panel comes in. This window, which you can trigger using the menu bar, stays open and always shows a list of keyboard shortcuts for the currently active application. You can add a separate keyboard shortcut for this window in the settings, if you like.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nIf you dig around in KeyClu's settings, you can configure the layout of both the pop-up and persistent panels, changing the size of the windows, how many columns shortcuts are sorted into, and which display the panels show up on.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nIt's a simple piece of software, but it's completely free and can help you get better at using your computer. And if you're reading Lifehacker, that's probably something you want. Speaking of keyboard shortcuts: here are a few keyboard shortcuts you should know. You can also check out our guide to creating your own macOS keyboard shortcuts.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This macOS App Makes It Easy to See (and Use) Your Keyboard Shortcuts",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNBQ0H4F582WCTDJF7E7Z8H/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-05T15:30:00.000Z",
      "dateModified": "2025-12-05T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple’s New iPhone Update Will Make Sure You’ll Never Miss a Reminder Again",
    "url": "https://lifehacker.com/tech/iphone-alarm-for-reminders?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC1HZPG712EAKM1NVA9T5DGC/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-09T15:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Khamosh Pathak\n           ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    \n        \n        Apple’s various apps and utilities are finally starting to talk to each other, and it’s great news for iPhone users. Last year, Apple added the ability to sync Reminders with Calendar, which added time-based reminders directly into your Calendar view—a feature I now regularly use. Now, with iOS 26.2, Apple is finally integrating Reminders with the Alarms app; you'll be able to set an accompanying alarm for any reminder. If, like me, you tend to be forgetful—if you need a reminder for your reminder—this will be a handy feature. The alarm will sound, taking up your entire screen until you dismiss it. And yes, you can snooze it.How to add an alarm to any reminder on your iPhoneTo get started, open the Reminder app, navigate to a task list, and either create a new reminder, or edit it. When you’re adding a date and time, you’ll see a new Urgent toggle. When you enable the Urgent mode, it will turn on an alarm that will go off when the reminder is due. The alarm will trigger even when your iPhone is in silent mode or in a Do Not Disturb Focus mode, so be careful when setting it up.\n\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nWhen you enable this for the first time, you’ll get a connection request for integrating Reminders with Alarms. Here, tap Allow. If you don’t see this popup, or if you’ve dismissed it before, go to Settings > Apps > Reminders, and in the \"Allow Reminders to Access\" section, enable the Alarms toggle.When the reminder is due, you’ll see a full-screen reminder interface, with the reminder up top, and an option to slide to stop (using Apple’s new sliding interface for dismissing alarms, which you can disable if you want). You’ll also see a big blue Snooze button. This will snooze the reminder for nine minutes.\n            \n                What do you think so far?\n            \n        \nWhether you hit the Snooze button or you use the slider to stop the alarm, Apple will add the Reminder to the top of the notifications list, as a Live Activity. You’ll see the reminder, with the snooze duration (if enabled), and the task. To actually complete the task, you’ll have to check it off from the Live Activity or the Reminders app.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nUnlike in the new alarm feature, there’s no way to edit the Snooze duration for reminders, or to disable the slider. If you don’t like the Snooze feature or the two-tap approach to completing reminders, you can switch it out for a Complete button instead. Go to Settings > Apps > Reminders and in the \"Urgent Reminders\" section, enable the Complete from Alarm feature. Now, when the alarm goes off, you’ll see two buttons instead: Slide to Stop and Complete. When you tap Complete, the alarm will disappear, and the task will be marked as Complete.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple’s New iPhone Update Will Make Sure You’ll Never Miss a Reminder Again",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC1HZPG712EAKM1NVA9T5DGC/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-09T15:30:00.000Z",
      "dateModified": "2025-12-09T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Will Now Let You Virtually Try on Clothes With Just a Selfie",
    "url": "https://lifehacker.com/tech/google-virtually-try-on-clothes-with-selfie?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC7MXWH4N3KCDYTMB9DBREC0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-11T22:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n            Credit: Google/YouTube\n          ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n            Credit: Google/YouTube\n                            \n            \n                Key Takeaways\n                                            Google's feature that lets you try on clothes virtually now works with just a selfie.\n                                            The feature uses Google's AI image model, Nano Banana, to generate a full-length avatar from your photo.\n                                            There are guardrails in place to stop people from using selfies of celebrities or children, but not of selfies of other people.\n                                    \n            \n    Table of Contents\n    \n        \n        The pace of AI technology is so rapid, it's tough to keep up with everything. At Google I/O back in May, Google rolled out an AI-powered shopping feature that let you virtually try on clothes you find online. All you needed to do was upload a full-length photo of yourself, and Google's AI would be to dress you up in whatever article of clothing you liked. I still can't decide whether the feature sounds useful, creepy, or a little bit of both.  Google's virtual try on feature only needs a selfie to workWhat I can say, however, is that the feature is getting a little creepier. On Thursday, Google announced an update to its virtual try on feature, that takes advantage of the company's new AI image model, Nano Banana. Now, you don't need a full-length photo of yourself: just a selfie. With solely a photo of your face, Nano Banana will generate a full-length avatar in your likeness, which you can use to virtually try on your clothes.I'm not exactly sure who this particular update is for: Maybe there are some of us out there who want to use this virtual try-on feature, but don't have a full-length photo of ourselves to share. Personally, I wouldn't really want to send Google my photo—selfie or otherwise—but I don't think I'd prefer to have Google infer what I look like from a photo of my face alone. I'd rather just send it the full photo, and give it something to actually work off of.  \nHere's the other issue: While Google asks you to only upload images of yourself, it doesn't stop you if you upload an image of someone else. Talk about creepy: You can upload someone else's selfie and see how they look in various clothes. There is a system in place to stop you from uploading certain selfies, like celebrities, children, or otherwise \"unsafe\" items, but if the system fails, this feature could be used maliciously. I feel like Google could get around this by verifying the selfie against your Google Account, since you need to be signed in to use the feature anyway. \n            \n                What do you think so far?\n            \n        \nHow to upload a selfie to Google's virtual try on featureIf you are interested in trying the feature out—and, subsequently, trying on virtual clothes with your AI-generated avatar—you can head over to Google's try on feature, sign into your Google Account, and upload your selfie. When it processes, you choose one of four avatars, each dressed in a different fit, to proceed. Once through, you can virtually try on any clothes you see in the feed. Again, I see the potential usefulness of a feature that lets you see what you might look like in a certain piece of clothing before buying it. But, at the same time, I think I'd rather just order the item and try it on in the comfort (and privacy) of my own home.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Will Now Let You Virtually Try on Clothes With Just a Selfie",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC7MXWH4N3KCDYTMB9DBREC0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-11T22:00:00.000Z",
      "dateModified": "2025-12-11T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Will Fix Your Pixel’s Broken Display for Free (If It Qualifies)",
    "url": "https://lifehacker.com/tech/google-will-fix-pixel-broken-display-for-free-if-it-qualifies?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC1X6QJ222BT0E57J35XZQXA/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-09T17:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Karlis Dambrans/Shuttersto",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Karlis Dambrans/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is launching a new Extended Repair Program for Pixel 9 Pro devices with specific display issues.\n                                            Pixel 9 Pro and 9 Pro XL units with a vertical line running from the top of the display to bottom qualify.\n                                            Your Pixel 9 Pro and 9 Pro XL device also qualifies if the display flickers.\n                                            The Pixel 9 Pro Fold has a repair program too, though Google does not specify what issues it covers.\n                                    \n            \n    Table of Contents\n    \n        \n        Smartphone display issues are nothing new. Most of us have dropped our phones the wrong way one time or another, and had to deal with the pain (and cost) of getting them fixed. But when your smartphone's screen starts acting up for no particular reason, it's pretty frustrating—especially if the manufacturer still holds you accountable for the repair fees. If that sounds like your experience with your Pixel 9 Pro, Pixel 9 Pro XL, or Pixel 9 Pro Fold, there's good news: Google is now launching an Extended Repair Program for the Pixel 9 Pro line. According to Google's announcement on Monday, the company has identified a \"limited number\" of Pixel 9 Pro and Pixel 9 Pro XL units that might exhibit display issues that impact the user's experience with the device. Should your Pixel 9 Pro's display show these symptoms, Google will fix the display at no cost to you.  What it takes for your Pixel 9 Pro to qualifyThat doesn't mean any and all display issues on your Pixel 9 Pro device qualify here. Google has identified two specific problems that this Extended Repair Program actually covers. The first is a vertical line present on the display. The line has to run from the bottom of the screen to the top, so partial lines won't quality. The second is display flicker. If you notice your Pixel 9 Pro's display quickly getting brighter and darker, as if someone was flicking a switch back and forth, you qualify for the repair program. \nThe Pixel 9 Fold is another story altogether. Like the 9 Pro and 9 Pro XL, Google is offering a free repair program for the 9 Pro Fold. However, unlike the other devices, there are no specific issues identified here. The problems may be display-related, but since the company won't specify, you could bring your 9 Pro Fold in for just about anything that's going wrong with it—as long as you didn't cause the issue yourself. In addition, Google won't actually fix your foldable, but will instead replace it entirely. The company is also being strict regarding the quality of the display outside of these issues across all Pixel 9 Pro devices. If your Pixel's display or cover-glass is cracked, that may disqualify you from the free repair. If Google finds liquid damage in your device, same story. In any of these cases, the company will still fix the display issues mentioned above, but they might charge you for it.    \n            \n                What do you think so far?\n            \n        \nHow to get your Pixel 9 Pro fixedAffected Pixel 9 Pro, 9 Pro XL, and 9 Pro Fold units qualify for repair as of Dec. 8, and coverage will last for three years after the original purchase date of the device. You will need to have your device inspected at a Google walk-in center, Google-authorized center, or an online repair store before the company can confirm eligibility. You can get started on your claim from Google's official repair site. This is good news for any Pixel 9 Pro users who have these specific issues—or any issues at all for Pixel 9 Pro Fold users. It joins a host of other Extended Repair Programs for Pixel devices, including the Pixel 4a battery program, the Pixel 6a battery program, the Pixel 7a repair program, and the Pixel 8 repair program, \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Will Fix Your Pixel’s Broken Display for Free (If It Qualifies)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC1X6QJ222BT0E57J35XZQXA/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-09T17:00:00.000Z",
      "dateModified": "2025-12-09T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple and Google Are Making It Easier to Switch Between iPhone and Android",
    "url": "https://lifehacker.com/tech/google-and-apple-are-making-it-easier-to-switch-between-iphone-and-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBZW51YD9RTK9TT6NWP3RZ28/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-08T21:30:59.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: Mr.Mikla/Shutterstock\n    ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: Mr.Mikla/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple and Google are reportedly working together on a method to make switching between iPhone and Android easier.\n                                            Details are slim, though Google has started to roll out some of its work to the latest build of Android Canary.\n                                            These changes should make it easier to move from one platform to another, something that has traditionally been more difficult than it should be.\n                                    \n            \n    Table of Contents\n    \n        \n        When it's time to buy a new car, you don't necessarily need to stick with the one you had before. You don't lose your cloud-based photos by switching from Toyota to Subaru, nor will your friends yell at you for ruining the group chat by buying a Kia. That's not the case with smartphones: When you buy an iPhone, it's tough to switch away from it. The same goes for Android: While it's easy enough to switch within the Android ecosystem, such as between Pixel or Galaxy, moving from Android to iPhone can also be a pain. Tech companies tend to make it tempting to stick with their platform, and introduce friction when you try to leave. That, of course, is entirely business-based. Apple hasn't traditionally made it easy to move to Android, because, well, you might actually do it. It doesn't have to be this way, either. There's nothing inherent to smartphones that should make it so challenging to break out of any particular ecosystem. All it takes is some intentional design: If smartphones were made to be traded, you could migrate from one to another, without worrying about losing pictures, messages, or any other important data or processes. As it happens, that intentional design may be on the horizon. As reported by 9to5Google, Apple and Google are actually working together to make it easier to transfer data between iPhone and Androids, which would make switching between the two platforms more seamless. This isn't theoretical, either: Google has already released some of this progress as part of the latest Android Canary, the company's earliest pre-release software. All compatible Pixel devices can currently access this latest build, though it doesn't seem there are any user-facing features available to test. 9to5Google says that similar features will roll out to testers in a future iOS 26 beta. Perhaps at that time, Google will roll out its features to the Android beta as well, which has a much larger user base than Canary. \nWhile details are slim here, any cooperation between Apple and Google on this front is huge. Current migration tools do exist, but they can be problematic. By actually working together on a native transfer solution, it might actually be seamless to move between platforms. Apple and Google might not be motivated by charity, of course, as the EU has been cracking down on restrictive practices by tech companies in recent years. But while both companies may see this as a way to lose customers, it's also a way to gain them: Sure, some iPhone users may switch to Android if it's easier to do so, but some Android users may do the reverse for the same reasons.\n            \n                What do you think so far?\n            \n        \nMore choice is good for everyone—even if it doesn't guarantee exponential growth to shareholders.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple and Google Are Making It Easier to Switch Between iPhone and Android",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBZW51YD9RTK9TT6NWP3RZ28/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-08T21:30:59.000Z",
      "dateModified": "2025-12-08T21:30:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Surprisingly Convincing Phishing Scam Imitates Apple Support",
    "url": "https://lifehacker.com/tech/apple-support-ticket-imitation-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBQT32MVCHGMC1BT7C0WBR01/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-05T20:00:00.000Z",
    "description": "\n        \n        You may have a keen eye for spotting scams, but fraudsters are finding new ways to weaponize trusted systems to avoid detection. For",
    "body": "\n        \n        You may have a keen eye for spotting scams, but fraudsters are finding new ways to weaponize trusted systems to avoid detection. For example, threat actors are generating real Apple support tickets to phish two-factor authentication (2FA) codes and gain access to iCloud accounts. The scheme, detailed on Medium by a security researcher and software product manager Eric Moret, shows how social engineering tactics can sow just enough fear and confusion to trick even those who know the red flags. (The money transfer scam that conned a financial advice columnist out of $50,000 is another example.) How scammers are exploiting Apple's support systemThe Apple support scam started with a text message from Apple containing a 2FA code, followed by verification notifications across devices, indicating that someone was trying to log into Moret's account. He then received an automated call from Apple with another 2FA code. The text was delivered from a five-digit short code, and the call from a toll-free number, both of which are used by legitimate businesses and not necessarily red flags of a scam.\nThe next call, however, came from an Atlanta-based 404 phone number. The caller claimed to be from Apple Support, stated that Moret's account was under attack, and assured him that they were opening up a support ticket. During a follow-up call lasting 25 minutes, Moret received a real Apple Support case confirmation via email (it turns out anyone can create an Apple support ticket in someone else's name) and was directed to reset his iCloud password. He was then sent a link via text—from the 404 number this time—to close the ticket. After clicking through, Moret was directed to a phishing website that spoofed a real Apple page (the URL was appeal-apple[dot]com), where he was prompted to enter a 6-digit 2FA code he'd just received via text. An email to his inbox then alerted him that an unknown Mac mini had been used to sign into his iCloud account, which the rep on the phone told him was \"expected as part of the security process\" and \"standard procedure.\" Moret then immediately reset his iCloud password again to kick the unauthorized device off.  It may be easy in hindsight to see the signs: the unsolicited call about an urgent security issue, the 404 number, the phishing link that isn't a real Apple subdomain, the request for an authentication code. But the Apple support ticket—with a real case number and official emails from apple.com domains—lent just enough credibility, and the multiple 2FA notifications just enough urgency, to work.  \n            \n                What do you think so far?\n            \n        \nThat's the problem with social engineering. It manipulates emotions and instincts that are stronger than logic and reason, leading to actions that are not in our interest. How to stay safe As always, you should be wary of anyone who calls, texts, or emails you about a security or account issue, even if you have received real security alerts or they have a legitimate case number. Don't click links, enter credentials, or provide codes when prompted by these unsolicited callers. Don't accept reassurance from anyone on the phone, no matter how calm and confident they sound. If you are concerned, you should reach out directly using trusted contact information or open support tickets yourself. Always check URLs and subdomains carefully, as hackers can play tricks to make them look legit. Also, know that simply having 2FA enabled isn't enough to keep your accounts secure. Some forms are (obviously) easily phished, so if possible, you should use a multi-factor authentication method like a hardware key or WebAuthn credentials (biometrics and passkeys) rather than codes. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Surprisingly Convincing Phishing Scam Imitates Apple Support",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBQT32MVCHGMC1BT7C0WBR01/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-05T20:00:00.000Z",
      "dateModified": "2025-12-05T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The AirPods Pro 3 Are Now Under $200 for the First Time",
    "url": "https://lifehacker.com/tech/airpods-pro-3-sale-december-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC7JV9CXW41K0CXPP1A8VSDF/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-11T21:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Rene Ramos.\n                            \n    Table of Contents\n    \n        \n        The latest AirPods Pro are a big step up from the first generation buds. The third (and newest) generation comes with OTA updates that the AirPods Pro 2 also got to enjoy—but considering the second and third generations are the same price right now, why not go with the newer version? If you want the latest Apple has to offer, this is a great time to do so. The AirPods Pro 3 are down to $199 (originally $249.99) for the first time since their September release—the lowest price yet, according to price tracking tools.\nThe AirPods Pro 3 improve on already great premium earbuds with new features (like a heart rate sensor) without increasing the list price. You'll get Personalized Spatial Audio (so you can hear sounds seemingly coming from different directions as you move your head) and the ability to use head gestures to tell Siri \"yes\" or \"no\" (this also works for answering or denying calls). Apple added a live translation feature to both the second- and third-generation AirPods Pro when iOS 26 rolled out earlier this year. You'll also get features like Conversation Awareness, which lowers your music volume when your AirPods detect that you're talking to someone; Transparency Mode, which lets you better hear your surroundings while your earbuds are in; and Adaptive Audio, which combines ANC and Transparency mode to adjust ANC levels based on the noise around you.\n            \n                What do you think so far?\n            \n        \nSince these are in-ear earbuds (as supposed to regular earbuds like the AirPods 4) the ANC is much better since it naturally blocks out the noise with a tight seal, but the ANC technology itself has also improved—as has the sound quality, thanks to the new H3 chip, as PCMag detailed in its \"exemplary\" review. You can expect about eight hours of juice, depending on your usage, and another 24 hours from the charging case. \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The AirPods Pro 3 Are Now Under $200 for the First Time",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC7JV9CXW41K0CXPP1A8VSDF/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-11T21:00:00.000Z",
      "dateModified": "2025-12-11T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]