[
  {
    "title": "X Might Start Showing This Personal Information on Your Profile Page",
    "url": "https://lifehacker.com/tech/x-showing-personal-data-profile?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7QB5NV76HSP5TC8XJERMTBZ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-16T21:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            I hope you want everyone to know where you live.\n    \n        \n    \n                                        \n        \n        \n        October 16, 2025\n    \n            Credit: JarTee / Shutterstock\n                            \n            \n                Key Takeaways\n                                            X could start putting personal information on your profile page.\n                                            This will include the country you're located in, as well as when you made your account.\n                                            It's still in testing, and will start with X team members.\n                                    \n            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.When Elon Musk bought Twitter in 2022, he repeatedly promised to reduce the amount of bots on the site, and pitched plans to \"authenticate all real humans.\" Now, in 2025, the social media site known as X's true bot numbers are unknown, although a cybersecurity firm speaking to Mashable said that 76% percent of traffic coming from X during last year's Super Bowl was fake. Toss in the fact that those plans to authenticate real users have now been replaced by a paid verification scheme, and it's clear the site is still figuring out how to deal with fake users. The most recent plan? Put a bunch of your personal information in an \"About this account\" section on your profile page.In an X post this week, X head of product Nikita Bier said that starting next week, the social media site will begin \"experimenting with displaying new information on profiles.\" This includes which country a user is based in, when they joined the site, how many times they've changed their username, and how they're accessing the site (via desktop or via the app, for instance).\n        \n            You May Also Like\n        \n    \nThe idea, Bier says, is that checking this information will allow users to \"to verify [an account's] authenticity.\" For instance, if you're being spammed with a bunch of suspicious followers, and they all seem to be new accounts from the same region, you might be able to infer that you're being targeted by some kind of coordinated spam attack.At the same time, however, the new section comes with privacy concerns. One user, for instance, asked Bier if X accounts will be able to opt out of having the country they're based in displayed for all to see. Another, seemingly in favor of the new system, asked if the page could include information about which device a user is posting from, to which Bier replied that the team is \"experimenting with various device details for users to form judgments on authenticity.\" Yikes.While none of that is quite as aggressive as just posting your address, it still peels back the curtain a bit more than I'd like, and leaves room for others to make judgments about you based on geography, or if Bier follows through on that second point, your model of phone.\n            \n                What do you think so far?\n            \n        \nLuckily, the feature isn't guaranteed to make it live for everyone quite yet. Bier says that the initial test will begin with \"a handful of X team members to get feedback.\" And to his credit, he has been responsive in replies to his post, acknowledging that in \"countries where speech can have penalties, we should substitute country for region.\"If the new section rubs you the wrong way, now's the time to speak up about it. If, however, it does make its way towards your profile one day, there is a silver lining. Bier says that should you not want certain information made public on your profile, \"There will be privacy toggles.\" However, if a user configures them, he says \"that will likely be highlighted on their profile.\"For my own two cents, I have essentially moved on from X at this point, and bots have been a big reason why. Still, I'm not sure encouraging users to judge each other based on where they're located (or even username changes, which are common during spooky season) is the right move. While some countries are more associated with inauthentic accounts than others, real users live everywhere, and implying that readers should dismiss others based simply on where they are runs the risk of adding more toxicity to the pile. Take this bizarre reply to Bier's announcement, which implies that...Canada?...is full of trolls.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "X Might Start Showing This Personal Information on Your Profile Page",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7QB5NV76HSP5TC8XJERMTBZ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-16T21:30:00.000Z",
      "dateModified": "2025-10-16T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TiVo Has Officially Discontinued Its DVRs",
    "url": "https://lifehacker.com/tech/tivo-discontinued-its-dvrs?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7MN6ZGVZEHBFAHY5DNHX0WE/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-15T21:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            It's the end of an era.\n    \n        \n    \n                                        \n        \n        \n        October 15, 2025\n    \n            Credit: Michael Vi/Shutterstock\n                            \n            \n                Key Takeaways\n                                            TiVo has officially discontinued its line of DVRs that made the company a household name.\n                                            Following reporting from Cord Cutter News, TiVo's parent company confirmed DVRs had been discontinued as of Oct. 1.\n                                            TiVo changed the way we watch TV, and arguably ushered in our current streaming age.\n                                    \n            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.It's the end of an era: TiVo no longer manufactures or sells the DVRs that made the company a household name. If you still have one, the company will continue to support it, but don't go looking for one: TiVo as we know it is effectively over.TiVo didn't make a big deal about this discontinuation, however. As it happens, Luke Bouma of Cord Cutter News was the first to spot the development. Earlier this month, Bouma reported that TiVo Corporation had silently ended its DVR line, removing all references to the devices on its website. Following Bouma's reporting, TiVo's parent company, Xperi, confirmed the news.\n        \n            You May Also Like\n        \n    \nIn a statement to PCMag, an Xperi spokesperson said: \"I can confirmed that as of [Oct.] 1, 2025, TiVo stopped selling physical DVR products, including hardware and accessories, both online and through agents...TiVo no longer manufacturers hardware, and our remaining inventory is now depleted, though we will continue to offer support for the products going forward.\" TiVo isn't gone entirely. The brand now develops both TiVo OS, a smart TV operating system similar to Roku OS or Fire OS, as well as DTS AutoStage Video Service, an entertainment service developed for cars. But it is no longer a DVR manufacturer or seller, which might shock a time traveler from the early 2000s.The TiVo effectTech comes and goes, but if you weren't watching TV in the late '90s and early 2000s, you might not know how monumental TiVo really was. The company launched its first DVRs in 1999 and introduced the market to features like one-touch simple recording, a hard drive to save multiple recordings at once, and, perhaps most notably, the ability to \"pause\" live TV and fast forward through commercials. The DVR offered viewers so much more than a simple VCR could, which only allowed for linear recording to single cassettes. TiVo could record live video from any input, including analog, cable, or satellite, which offered users flexibility in the content they recorded.Before TiVo, if you missed the start of a show, you simply had to deal with it and try to jump in as best as you could—assuming you didn't set a VCR to record it, of course. If you had a TiVo, however, you could simply rewind to the start of the program, and, when you reached a commercial break, skip ahead back to the show—until you caught up with the live broadcast. \n            \n                What do you think so far?\n            \n        \nTiVo disrupted the way consumers watched TV, and we're likely seeing the ramifications of that today. The market adapted, and cable companies started offering their own DVRs with cloud-based recording as opposed to hard drive recording. Streaming services built on that momentum: Viewers were already getting used to watching shows whenever it suited them, so why not get ahead of the game, and offer all shows on-demand at any time? There's no need to choose which programs to record: Everything is available at any time. Like other early technology pioneers that fell behind with time, TiVo struggled through the streaming age it arguably helped create. The company hasn't released a DVR since 2019, when it launched the TiVo Edge. That DVR had support for modern features, like 4K Dolby Vision HDR, Dolby Atmos sound, and access to major streaming apps, in addition to recording live TV. It then tried to break into the streaming device market with the TiVo Stream 4K, but the competition was too fierce to make an impact. In a twist of irony, as TiVo discontinues its DVRs, streaming services are turning to ad-supported plans with increasing frequency. TiVo changed the game by letting us skip ads, and streaming originally omitted the ads entirely. But more and more customers are comfortable paying less to deal with commercials. We've come full circle in a way. TiVo's time might be at an end, but its impact lives on. What Skype did for video calls, TiVo did for TV. I'll be thinking about that the next time I boot up something to watch on Netflix or Hulu.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TiVo Has Officially Discontinued Its DVRs",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7MN6ZGVZEHBFAHY5DNHX0WE/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-15T21:30:00.000Z",
      "dateModified": "2025-10-15T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I Tried the New LE Bluetooth Audio on the Sony WH-1000XM6 Headphones",
    "url": "https://lifehacker.com/tech/le-bluetooth-audio-on-sony-wh-1000xm6-headphones?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7MX10ZWF8DV7PJHQTZB5WCY/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-15T22:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I Tried the New LE Bluetooth Audio on the Sony WH-1000XM6 Headphones",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7MX10ZWF8DV7PJHQTZB5WCY/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-15T22:00:00.000Z",
      "dateModified": "2025-10-15T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft’s Latest Windows Update Has a Bug That Makes It Harder to Fix Issues With Your PC",
    "url": "https://lifehacker.com/tech/microsoft-broke-windows-recovery-environment?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K811SVREYZ7TQE16PKAZQKTV/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-20T16:00:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            If your PC loads into Windows RE, you won't be able to interact with anything.\n    \n        \n    \n                                        \n        \n        \n        October 20, 2025\n    \n            Credit: sdx15/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Microsoft's October build for Windows 11 breaks USB device functionality in Windows Recovery Environment.\n                                            If your PC loads into Windows RE, you won't be able to interact with anything.\n                                            Microsoft is aware of the issue, and is working on releasing a fix \"in the coming days.\"\n                                    \n            \n    Table of Contents\n    \n        \n        When your PC is acting up, one diagnostic tool at your disposal is the Windows Recovery Environment (or Windows RE). Windows RE offers a series of functions to help you root out whatever is ailing your machine. Using it, you can choose to reset your computer, run an automated diagnosis and repair tool, adjust settings to see if any are causing the issue, uninstall previous updates that might be tripping up Windows, and restore to a previous back Windows backup, among other potentially helpful options. It's a necessary feature of the operating system, meant for times when a simple shut down and restart doesn't help your PC get back to normal operations. So it's not ideal when Windows ships with a bug that not only breaks part of the OS, but also breaks the part of the OS designed to help fix your PC.As spotted by Tom's Hardware, a bug in Windows 11's October update, KB5066835, hinders your ability to access Windows RE. The recovery environment can still load if you need it, but you'll find you won't be able to select any of the options it offers to try to fix your PC. That's because this bug breaks USB device functionality specifically in Windows RE. Simply stated, your mouse and keyboard will not work in Windows RE, preventing any navigation within the recovery environment. \n        \n            You May Also Like\n        \n    \nThis is obviously bad news for anyone who wants to use Windows RE to fix a problem with their PC—including, ironically, this Windows RE-specific bug. But you might think that so long as your particular issue with Windows isn't prohibiting you from actually using your computer, you could live without Windows RE for the time being. As Tom's Hardware points out, however, it's not so simple: When your PC has trouble starting up, it will automatically boot into the recovery environment. That's normally a good thing, since you'll have the tools to help diagnose and solve the issue. However, when Windows takes you to a screen where you can't use your mouse and keyboard, or interact with any elements whatsoever, you're kind of stuck. The good news is Microsoft is aware of the issue. The company has called out the bug as a known issue in Windows 11, version 25H2, and says it is working on releasing a fix \"in the coming days.\"\n            \n                What do you think so far?\n            \n        \nWindows is experiencing other issues, tooWindows is going through it this month. This same October update also broke localhost functionality, which impacted any apps that connect to services running locally on your PC. (Luckily, Microsoft did issue a fix for that bug.) Then, last week, the company also officially ended support for Windows 10, and though it still offers Extended Security Updates for any user that wants to enroll their PC in the program, it puts the security of roughly half a billion PC users into question.   This Windows RE bug is just one more critical issue PC users have to deal with. Hopefully, Microsoft's next Windows 11 build introduces only fixes, and no additional bugs.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft’s Latest Windows Update Has a Bug That Makes It Harder to Fix Issues With Your PC",
      "image": [
        "https://lifehacker.com/imagery/articles/01K811SVREYZ7TQE16PKAZQKTV/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-20T16:00:00.000Z",
      "dateModified": "2025-10-20T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What People Are Getting Wrong This Week: The Short Video to Conspiracy Theory Pipeline",
    "url": "https://lifehacker.com/entertainment/what-people-are-getting-wrong-this-week-the-short-video-to-conspiracy-theory?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7FQ1SF53HQX9JEA2W38377H/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-14T13:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            It turns out, there's a ton of misinformation on social media. And it doesn't take much to find it.\n    \n        \n    \n                                        \n        \n        \n        October 14, 2025\n                    \n            Credit: Dmytro Sheremeta/Shutterstock \n                            \n    \n            \n            \n        \n            The internet is full is misinformation, conspiracies, and lies. Each week, we tackle the misunderstandings that are going viral.\n        \n    \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.While sometimes there's a big piece of misinformation that a lot of people latch onto—like The Rapture or the existence of \"MedBeds\"—the fractured nature of the information sphere has all but killed the overarching conspiracy theory. No longer do big ideas like \"we never went to the moon\" unite the dumbest minds; instead, the algorithm creates bespoke conspiracy theories. So instead of joining the Flat Earth Society, you might think the actual year is 1728, or that AI secretly imagined a British comedian from the the 1980s and seeded the web with evidence of his existence.But how does it start? And how quickly can social media platforms transform someone from a person from a seeker-of-knowledge to a believer-in-bullshit? YouTuber Benaminute recently posted a video where he dug in to find out. His question: If you start with a benign, broad, randomly chosen subject, and you only watch videos having to do with that subject, how long will it take until TikTok, YouTube Shorts, and Instagram Reels feed you a conspiracy theory video? The answer: not long at all. \n        \n            You May Also Like\n        \n    \nDifferent topics all lead to the same place (more or less) For the experiment, Benaminute created \"blank\" social media profiles and behaved like someone who was innocently curious about one of three topics—dinosaurs, The Vietnam War, and the 2000 presidential election. He put the keyword in each platform's search bar and only watched and liked videos about the initial subject. DinosaursYouTube Shorts: The initial videos were ads for Jurassic Park, AI slop featuring dinosaurs, and the occasional educational video, but the 541st video was a clip from the Joe Rogan Experience about how the pyramids were not tombs, but \"DNA restoration devices.\"TikTok: If you thought TikTok would get to conspiracy theories quickly, you'd be right. The 144th video was this fake UFO video that has 24 million views. Instagram Reels: Insta took 661 videos to get from dinosaurs to a \"forbidden phone from the 2000s that lets you see into a parallel dimension.\"The Vietnam WarThings get worse for people interested in historical or political events. On all short-form platforms, an interest in Vietnam will lead you pretty quickly to right-leaning content, which leads you to conspiracy theories. YouTube Shorts got to a conspiracy theory video about Noah's Ark in only seven videos. TikTok took a little longer; video 161 was about how financial services company Blackrock had something to do with the attempted assassination of Donald Trump. Reels took 139 videos to get to \"Bush did 9/11.\" The 2000 electionThe election of 2000 is still a charged topic, but it's been awhile, so maybe cooler heads and verified information will win the day? Spoiler: nope. YouTube Shorts took 136 videos to get to the same Noah's Ark conspiracy as it did for dinosaur fans.TikTok only took 38 videos to get to \"The Rapture is happening on September 24.\"Reels took only 26 videos to land on \"The World Trade Center was bombed\" (by either Clinton or Bush). Which social media app leads to conspiracy theories fastest?The champion of \"normal search to conspiracy theory\" speed runs is TikTok, with an average of 114 videos or 57 minutes of watching. YouTube Shorts comes in second with 230 videos or 1 hour 57 minutes of time, and Reels takes 275 video or 138 minutes. It's a distinction without a difference; however, all three platforms lead to conspiracies in the time it takes to watch a Marvel movie. What does it all mean? It would be easy to conclude that the massive tech companies that built YouTube, Instagram, and TikTok companies weight their recommendation engines so viewers are led to fake stories. Maybe they have specific political aims and are trying to sway votes, or maybe (as Benaminute posits in a semi-tongue-in-cheek way) these apps are built to \"keep us angry, divided, and distracted\" from realizing the conflict isn't between Left and Right, but between \"up and down.\" This is also a conspiracy theory, however. I'm not saying he's wrong, but we don't have enough information to know why algorithms recommend conspiracy content. It could be because bad actors at the top demand specific results for some purpose, but it seems more likely to me that TikTok et al. don't have an agenda beyond making money.\\I have no doubt that a social media platform featuring an algorithm that weighs the truth heavily would fail pretty quickly; the Truth is boring compared to conspiracy theories. Conspiracy theories, broadly, make believers feel special, like they have inside knowledge the rest of us lack. People scroll TikTok to have fun; the truth usually isn't fun.  Conspiracy theorist can say things like \"UFOs are here!\" or \"They're turning the frogs gay!\" Meanwhile, if you're devoted to the truth, you mostly have to go with \"the best evidence suggests...\" or \"it seems logical that...\" and who wants to hear that?\n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What People Are Getting Wrong This Week: The Short Video to Conspiracy Theory Pipeline",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7FQ1SF53HQX9JEA2W38377H/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-14T13:30:00.000Z",
      "dateModified": "2025-10-14T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Real History of Halloween",
    "url": "https://lifehacker.com/entertainment/real-history-of-halloween?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JAVDYTVW486K8Y0JSCM2XS3Q/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-20T21:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            It's scary how little we know about how our spooky traditions got started.\n    \n        \n    \n                                        \n        \n        \n        October 20, 2025\n                    \n            Credit: Everett Collection/Shutterstock\n                            \n    Table of Contents\n    \n        \n        If you don’t like Halloween, we can’t be friends. I don’t care whether you celebrate with a drunken costume party, pumpkin carving, door-to-door candy begging, or a more personal observance like watching horror movies alone, but respect must be paid to the awesomest of all holidays. But where did Halloween come from, and how did it end up like the modern holiday we now celebrate?The origins of Halloween are surprisingly slippery. Oct. 31 is next door to a Christian religious holiday, and it's  around \"harvest time,\" which might generally explain the date, but no one really knows why we put on costumes and beg for candy. There are a ton of theories describing how modern Halloween practices could have sprung from various ancient traditions, religious rites, or folk practices, but the first direct evidence of anything resembling modern \"Halloween\" is no older than the 1800s, and even then, it didn't really take off for another 100 years. Put succinctly, the history of Halloween as we know it is a muddy, confusing collection of practices that probably owe more to Peanuts comics published in the 1950s than Medieval Catholicism or pagan rites.\n        \n            You May Also Like\n        \n    \nThe theoretical history of HalloweenThe most commonly repeated Halloween origin story says that the holiday began with the Samhain (pronounced sah-win or sow-in) celebrations of the Celts in Ireland, England, and Northern France. The date of Nov. 1 or Oct. 31 is about halfway between the autumnal equinox and winter solstice, and ninth century Irish literature describes gatherings and feasts marking Samhain, the day when ancient burial mounds were opened, and with them, portals to the Otherworld, the land of the Gods and the dead. Later, the theory goes, these practices were Christianized, renamed “All Hallow’s Day” and “All Hallow’s Eve” by the early Church, and that’s where we get Halloween. Sounds plausible enough......but it's probably not what happened. The idea that Halloween comes from pagan rituals usurped by Christians originated with Welsh scholar Sir John Rhŷs, and he didn’t back up his theory with a ton of evidence. Some modern historians maintain that ties between Celtic celebrations and early Christian practices are tenuous, and medieval Christian festivals provide the real blueprint for the holiday. Medieval Christians celebrated All Saints' and All Souls days during the observance of Allhallowtide—the time in the liturgical year dedicated to remembering the dead—by holding community feasts, emphasizing dead souls, and decorating skeletons. But they didn't get that from the Celts, or so the theory goes.Either way, both All Souls Day and Samhain likely have roots that go deeper than written history records. Harvest festivals were common in many places, and maybe they were like Halloween parties, but maybe they weren't. We don't know. The holiday takes place at the end of the harvest season and the beginning of winter, a time between life and death, when both Pagan and Christian minds turn toward the inevitable end of things. Halloween traditions seem to pay homage to that \"between\" place, and while we don't know how much about how ancients celebrated \"halfway between solstice and equinox day,\" it probably wasn't by dressing up and begging for treats. Verified Halloween historyNo matter where it started, by 835 AD, All Saints Day (Nov. 1) became an official Catholic day of obligation, and Allhallowtide practices like ringing church bells for souls in purgatory and black-clad criers taking to the streets to remind people to think of the dead are a little Halloween-like. If you squint.Another tradition of the time was baking “soul cakes” in memory of the dead. This led to “souling,” where groups of children traveled from house to house asking for cakes in exchange for praying for the dead. Later soulers would carry carved lanterns made of hollowed-out turnips too. Is this the origin of “trick or treating” and Jack o’ Lanterns? Maybe...but again, probably not. It doesn’t seem like souling children wore costumes, even though “guising” or “mumming” (dressing in costumes and bothering your neighbors for treats and/or money) was practiced in various places in Europe during other holidays, particularly around Christmas.Another theory for the origin of costumes for Halloween originates with the Late Medieval French tradition of the Danse Macabre—the dance of death. Perhaps in response to the Black Plague ravaging Europe, 14th century artists would depict the personification of Death surrounded by figures of a pope, an emperor, a king, a child, and a laborer—people from all levels of society—dancing toward the grave. Live versions of the Danse Macabre were enacted at village pageants, no doubt to the delight and horror of all. The grotesque but comical performance reminded people that Death would come for everyone, but also that we should have as much fun as possible before the inevitable, and there’s nothing more “Halloween” than that. But again, this is only a theory. The origins of Halloween in AmericaIn colonial America, Halloween was not widely observed. While New England Puritans generally frowned on anything fun like wearing costumes, dancing with Death, or carving pumpkins, more liberal colonists in New York, Maryland, and further south may have brought some Halloween-like activities over the ocean from their villages in Germany or Ireland. We don't really know, but other than for a few pockets of diehards, maybe, celebrating Halloween wasn't a thing in either the U.S. or Europe before the late 1800s.The earliest American expression of Halloween-like activities performed in late October or early November came in the form of “play parties,” or Autumn festivals, to celebrate the harvest. These gatherings, immortalized in Washington Irving's horror tale The Legend of Sleepy Hollow, often included ghost stories, attempts at divination, apple bobbing, pranks, and attempts to scare people—proto-Halloween activities, where you can see the holiday taking shape. It wasn’t until the Irish mass immigration of the 19th century that we see Halloween celebrations labeled as such. Beginning around the 1850s, Irish immigrants fleeing the Potato Famine descended on the country. These immigrants brought Halloween celebrations to the U.S., but it doesn’t seem like they brought Halloween costumes or trick-or-treating. The possible origins of trick-or-treatingAll of our modern ideas that Halloween traditions came from this or that ancient practice could be examples of cherry-picking data to support the conclusion that our modern Halloween traditions have a deep lineage in the first place. But what if they don't? Trick-or-treating is the most well-known expression of Halloween, but, despite historic examples of costume-clad holiday revelers and/or people going to door to door to beg for treats on holidays, there doesn't seem to be a direct link between any these older practices and modern trick or treating. Yes, it's a little like souling, but no one in America seems to have ever practiced souling. There's no evidence of anyone wearing costumes for Halloween in the U.S., the U.K., or Ireland before 1900 either, leading some Halloween scholars to suggest that American children developed trick-or-treating and costume-wearing independently of any older tradition. Which is actually the coolest theory: American kids made up Halloween from scratch.The first mention of Halloween candy collection in costume comes from a newspaper in Kingston, Ontario in 1911, but the practice remained obscure enough that there’s no mention of anything like it in Ruth Edna Kelley's 1919 history of the holiday, The Book of Hallowe’en, and there are no trick-or-treaters depicted in any of the many Halloween postcards printed in the 1920s. The practice doesn’t seem to have been widespread until the late 1930s, when the first mentions of it appears in a national publication, and it didn’t really take off until the early '50s, when it appeared in a Peanuts comic strip and a Disney cartoon. From there, everything we call \"Halloween\" comes into focus: The ghosts, the parties, the scares, the candy, all evolving from comic strips, movies, candy company advertising campaigns, and regular folks who seem to really enjoy dressing up in costumes.Halloween: The people's holidayWe ultimately don’t know much about the origin of Halloween because its meaning, and how we celebrate it, change constantly—it used to be a day for parties celebrating the harvest, during which people would read each other's fortunes; then it became a day for kids to go trick or treating; then adults started using it as an excuse to dress in sexy Martha Washington costumes and get drunk. Parents got a freaked about razorblades in candy and invent \"trunk-or-treating;\" overly ambitious suburbanites started turning their homes into elaborate spook-houses; and on and on. No ancient pagan ritual needed, just folks figuring out what works for them. Many other major holidays are rooted in religion or meant to commemorate a specific historical event—they’re top-down holidays, where the Pope or the government decreed that everyone would get a day off on this specific date, and observe it in this specific way. But Halloween is the people's holiday, so there's no official list of rules telling us how we're supposed to commemorate it, or even any reason why we should be celebrating it. But every year we do anyway, perhaps due to a collective desire to get some candy or do something witchy before it gets too cold to go outside. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Real History of Halloween",
      "image": [
        "https://lifehacker.com/imagery/articles/01JAVDYTVW486K8Y0JSCM2XS3Q/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-20T21:30:00.000Z",
      "dateModified": "2025-10-20T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "When It's Best to Study in Silence (and When a Little Noise Is OK)",
    "url": "https://lifehacker.com/why-you-should-always-study-in-silence-according-to-sc-1850843477?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GPDPA1AQJ276G054WK42S/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-20T12:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "When It's Best to Study in Silence (and When a Little Noise Is OK)",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GPDPA1AQJ276G054WK42S/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-20T12:00:00.000Z",
      "dateModified": "2025-10-20T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "X Is Changing How It Displays Articles",
    "url": "https://lifehacker.com/tech/x-is-changing-how-it-displays-articles?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K81EN4ERBRCVX5Q9SNJ74G2X/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-20T19:26:56.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            X is trying to up engagement on posts with links, but it means dealing with a new interface for external articles.\n    \n        \n    \n                                        \n        \n        \n        October 20, 2025\n                    \n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            X users on iPhone might start seeing a new footer at the bottom of external links.\n                                            The feature is currently in testing, and isn't affecting everyone.\n                                            You still have two options to read external links without the new footer.\n                                    \n            \n    Table of Contents\n    \n        \n        If you use the X app on iPhone, there’s a good chance any links you open today will look different than they did yesterday. That’s because the platform is trying to up engagement on posts with links in them, by keeping the like, comment, repost, favorite, and share buttons active in a new footer even when you click through to an outside article.When you click on a link in X, it doesn’t actually navigate away from the app, but instead uses a special version of either Chrome (on Android) or Safari (on iPhone) to open the article within X. That hasn’t changed. But what has is that, on iPhone, you’ll now continue to see interactable elements at the bottom of the page, with buttons you can press to engage directly with X while reading. Also, when you first access a link or scroll up, you’ll even see part of the original social media post that drove you there above those buttons. These elements will remain even if you click another link in the article you’re reading.It’s a small change despite maybe looking a little busy, but it points to a potential fix for a major problem. According to X head of product Nikita Bier, the idea is to try to increase traffic for posts with links in them, by making it easier for users to engage with them even after clicking through.\n        \n            You May Also Like\n        \n    \n\n    \n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \n\nA lot of controversy has been made about X posts that include links getting less traffic than those that don’t, especially after the platform was acquired by current owner Elon Musk. While the site hasn’t admitted to it directly, SEO experts have recently started warning users to avoid putting links in their traffic, claiming that X now deprioritizes posts with links on them, as they keep people away from their timelines. Musk has also made comments that some have accused of implying this to be the case.Bier, however, refuted this while debuting the new interface for opening links on iOS, instead saying “links are not deboosted,” and implying that the lack of interactable timeline elements on them simply leads to less engagement naturally, something the new change is trying to fix.For instance, the old method of opening links could potentially draw you away from the site and interrupt any intention you had to reply to the original social media post or share it to your own audience. Bier said this is what led to posts getting lower reach, and that the new footer should help them “get better signal.”But at the same time, it’s clear that the new approach has benefits for X as well, since it gives users easier avenues to navigate away from external articles and back to their timelines, where they can drive engagement on other posts and see ads.But regardless of whether X manually deprioritizes posts with links, or if the motivations for the change are selfish, the fact that changes like this are even being made means the platform might finally start trying to make linking in posts more viable. That could be a huge boon for users like myself, who have historically used X (and Twitter before it) to help drive traffic to our posts. Whatever the reason this stopped working, it would be helpful for those who rely on it if it were fixed.That said, there’s a chance you might not be seeing the new interface at all, or that if you are, you might not like it. Luckily, if that sounds like you, you’re not out of options.X Links only look different on iPhone, for nowIn the post announcing the change, Bier mentioned that the “new link experience” is only in testing, and that it’s only on iOS at the moment. That means that, while I do currently see it on posts I’m opening with my iPhone 15 Pro, you might not. On my Pixel 10, I’m still getting the old interface, and even on iPhone, it doesn’t seem to be affecting all users. My husband, for instance, is not seeing the footer on his iPhone 17 Pro. That’s great news if you don’t like the look of the new footer, although if you would like to try it out, I unfortunately don’t have much advice at the moment. It seems only some users have access to it right now.However, if you are seeing the new footer but you would prefer not to, there are two steps you can take to get rid of it.How to open X links without the new footer\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nThe change to how X links work is server-side, so downgrading your app or avoiding an update won’t save you here. Instead, to get rid of the footer from links you open in X, you’ll need to first open the link, then hit the three-dots button just above the footer on the right-hand side.From there, you’ve got two options. First, to open the page with its formatting intact but no footer, tap “Open in browser.” This will open the link in your default browser, but also take you to that browser’s app instead, meaning you’ll have to find your way back to the X app if you want to keep scrolling once you’re done reading.To stay in the X app, you can take advantage of Safari’s reader mode, which will still be available to you even if Chrome or another app is your default browser. In the same three-dot menu, simply tap “Show Reader” instead, and you’ll see a plain version of the link with all website formatting stripped out, including the X app’s new footer, all without having to move to a new app. To return to the normal view, just tap the X button in the top left corner. Then, to go back to your X timeline, either grab the footer and scroll up, or tap the X button just above the footer on the left-hand side.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "X Is Changing How It Displays Articles",
      "image": [
        "https://lifehacker.com/imagery/articles/01K81EN4ERBRCVX5Q9SNJ74G2X/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-20T19:26:56.000Z",
      "dateModified": "2025-10-20T19:26:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use 'Elaborative Interrogation' to Challenge Yourself While Studying",
    "url": "https://lifehacker.com/how-to-use-the-elaborative-interrogation-study-technique?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2HJGNYQZJ63BVAC4XDR33V/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-15T12:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            You need to fully understand your material if you want to retain it.\n    \n        \n    \n                                        \n        \n        \n        October 15, 2025\n    \n            Credit: Pickadook - Shutterstock\n                            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding Lifehacker as a preferred source for tech news.When you’re studying, you can try to simply memorize phrases and facts long enough to pass a test, but you should really be trying to retain concepts for the long term. What are you putting all this time and effort (and money) into if it's not preparation for the future? One way you can do that is by using “elaborative interrogation,” a technique that helps you learn more effectively by challenging the facts you’re going over. Even if you do only want to pass a test, this can help you understand how the material's concepts relate to one another, which can help you remember them better ahead of exam day.What is elaborative interrogation?Inquiry is an important part of learning, which is why it’s fundamental to some of the best study methods, like SQ3R and KWL. Using those techniques, you outline what you may already know before you start studying, take a quick scan of the material to formulate questions that can guide your reading, then answer your own questions as you go. They're great techniques for making sure you stay engaged and curious, both of which help you focus and actually learn.\n        \n            You May Also Like\n        \n    \nWith inquiry in general, not only do you have to memorize what’s presented to you, but you have to dig in and understand it by asking questions. Like I said, when employing SQ3R or KWL, you ask questions before you start reading, so you can find the answers. When you try elaborative interrogation, you ask the questions as you go.Asking questions helps you find answers and establish connections that aren’t immediately apparent in the text, letting you more thoroughly understand what you’re going over. This concept makes sense: When your friend is telling you a wild story, you ask follow-up questions, right? When you ask questions, you're automatically more involved in the process of receiving information and you remember what you take in better because you're getting answers to the parts you were curious about.How to study with elaborative interrogationTo make this work for you, you need to assess the facts of your material. Say you’re studying accounting. One fact you’ll learn is that you journalize debits before credits. You can get by and do well enough on tests just by knowing that fact without thinking any deeper about it—but if you really want to understand the material, it would be helpful to figure out why you journalize debits before credits. When doing elaborative interrogation, you ask yourself these kinds of questions after looking at your facts, so you fully grasp the meaning of it all. Here, your elaborative interrogation is, “Why do we journalize debits before we journalize credits?” Your next question can be, “Why do we record debits as a positive number?” The reason it’s done this way is to reflect incoming money more easily on the credit side.You can even go deeper by working backwards: Why do accountants journalize? What do accountants journalize? Who sees the accountant's journal? What is included in an accountant's journal entry? What are debits? What are credits? Why are they journalized? When are they journalized? The more you understand about the core concept, the more questions you can ask, and the more you can grasp the primary fact, which is that you journalize debits before credits. Eventually, the reasoning for why debits are journalized before credits will be so obvious that the fact itself will be more than obvious. Of course that's the order you do it in, and if that order is all you need to know for your test, you're golden. \n            \n                What do you think so far?\n            \n        \nSo, start by identifying the basic facts you need to know. You can do this easily by writing them down as you go through your text, notes, or lecture. Any assertion or basic fact makes the cut. You can also try using AI, like Google's NotebookLM or ChatGPT, to generate facts. As a test, I just asked ChatGPT, “What are some basic facts to study for accounting?” It gave me 16, almost all of which are great for elaborative interrogation. For instance, the software told me that the International Financial Reporting Standards are used in many countries for financial reporting. That’s probably an answer to a question on a test on its own, but to really understand the point of it all, I could ask, “Why do countries need a set of accounting standards? Which countries use the IFRS?” If you're using ChatGPT or similar, just make sure it’s giving you actual facts; look them up to be sure they’re true. Better yet, use the other tool I mentioned, NotebookLM, because it pulls only from material you provide. Upload your course materials—slide decks, chapter scans, handouts from the professor, whatever—and ask it to pull out the key facts. You can also use the software to generate flashcards, quizzes, mind maps, and informational podcasts, but those are for different study approaches entirely. (Try them out when you're done elaborately interrogating!)On a separate paper, write down these questions about your facts, then set to work investigating the answers. The answers may come from materials outside your class lecture, notes, or texts, so don’t be afraid to dig deep. For the most part, though, do try to stick with what you've been provided unless the professor has instructed you to look elsewhere on your own. Ultimately, getting the answers to these questions will help you establish the  connections you need to truly grasp the material and remember it well. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use 'Elaborative Interrogation' to Challenge Yourself While Studying",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2HJGNYQZJ63BVAC4XDR33V/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-15T12:00:00.000Z",
      "dateModified": "2025-10-15T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Your AI Fitness Trainer Can Do More Harm Than Good",
    "url": "https://lifehacker.com/health/your-ai-personal-trainer-can-do-more-harm-than-good?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7PZEC1QW89VH28QKWF1TM4Z/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-16T18:30:10.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            There's a dark side to these \"smarter\" workouts.\n    \n        \n    \n                                        \n        \n        \n        October 16, 2025\n    \n            Credit: Ian Moore / Lifehacker Composite; Kitti Suwaneakkasit / Anton Vierietin / FG Trade / E+ / BananaStock / iStock / Getty\n                            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.Want customized workout plans, real-time feedback, and 24/7 motivation, all without the cost of a human trainer? AI personal trainers sound like a perfect solution. Download an app, answer some questions about your goals and fitness level, and receive a personalized training program. I've tested some of these apps myself, and I definitely see the appeal. But more than anything, I see companies stuffing AI into apps where it doesn't belong. There's Strava's Athlete \"Intelligence\"; Garmin's underwhelming Connect+ subscription; Whoop's recovery recommendations, just to name a few. And as Lifehacker senior health editor Beth Skwarecki points out, people are increasingly asking ChatGPT for training advice, which is infuriating considering how many high-quality, free programs are already out there. \n        \n            You May Also Like\n        \n    \nMedical professionals and trainers are increasingly noticing clients experiencing anxiety around optimization and performance, becoming discouraged when AI labels their efforts as inadequate. Think of how something like \"closing your rings\" on Apple Watch activity goals had a chokehold over the nation. Or Fitbit step counts, even when step goals are bullshit in the first place. When metrics don't align with expectations, people feel like failures. And it's not because they haven't made progress, but because an algorithm told them so. Blind trust and data obsessionCertified personal trainer Cara D'Orazio describes what she calls \"digital guilt\"—the anxiety that creeps in when you miss a workout notification or can't keep up with your app's demands. She recalls clients who arrived at her gym burnt out and demoralized, including one woman whose AI coach prescribed six consecutive training days without rest. The woman felt \"lazy\" for being sore—a natural physiological response her digital trainer couldn't recognize or validate.\"People begin relying so much on the algorithm that they lose connection with how their body actually feels,\" D'Orazio says. \"A real coach can tell when your stress levels are high, when you didn't sleep, or when you just need to talk for five minutes before starting. AI doesn't do that. It only sees numbers—calories, steps, heart rate—not emotions, hormones, or mindset.\" Movement should enhance your relationship with your body, not create anxiety around it. This disconnection is particularly dangerous when you consider how deeply intertwined your fitness can be with your mental health. Marshall Weber, a certified personal trainer and owner of Jack City Fitness, has witnessed the psychological toll firsthand. \"I have definitely seen folks get discouraged and even anxious when they rely too heavily on AI fitness enhanced tools,\" he explains. \"While it is great that these apps can track everything, they are lacking a bit on the balance and self compassion side of fitness.\" I know that when I'm in a vulnerable mental state, this lack of empathy can be devastating. As D'Orazio warns, \"If we're not careful, we're going to see a whole new wave of people who are 'fit' on paper but emotionally exhausted and disconnected from their bodies.\" The constant performance feedback is a recipe for an unhealthy fixation on fitness goals.The human touch AI simply can't replaceOutside of fitness, one of AI's most significant limitations is its inability to read context. Adrian Kelly, a business and sports performance coach, emphasizes the risks here: \"Exercise can be quite an emotional experience with highs and lows generated by meeting, or failing to meet, our own expectations.\" He notes that traditional trainer-client relationships provide something AI cannot replicate: empathy, accountability, and trust built through genuine human connection. A skilled coach recognizes early warning signs of disordered eating, overtraining, or emotional distress. They celebrate non-scale victories, adjust plans when life gets complicated, and remind you that rest is productive.\"The healthiest results come from building trust, flexibility, and self-awareness—things a machine simply can't measure,\" D'Orazio says. \"Movement should make you feel more human, not less.\"\n            \n                What do you think so far?\n            \n        \nDr. Ayesha Bryant, a clinical advisor at Alpas Wellness, warns about the unhealthy fixation on health data that AI systems encourage. \"This heavy quantification of fitness can drive clients and patients to perfectionism or body dysmorphia tendencies, especially in vulnerable individuals,\" Bryant says. The problem is compounded by all that blind trust in the algorithm, where users continue following AI recommendations even when experiencing pain, burnout, or clear signs they need rest or medical attention.Even if someone is self-aware enough to override AI recommendations, there's still the need for algorithmic validation. It's all too easy to shift from intrinsic to extrinsic motivation, forgetting that the whole point of moving your body is because it feels good. The bottom line: Find some balanceThis isn't to say AI fitness tools have no place in a healthy lifestyle. They can be useful for tracking data, setting reminders, or logging workouts. But they should complement—not replace—human guidance and your own body awareness.Weber recommends that anyone training regularly \"consider checking in with a PT of some sort just to make sure you are still being kind to yourself.\" Bryant agrees, emphasizing that \"long-term wellness and quality of life is driven by empathy, adaptability, and human connections.\"If the fitness industry's AI revolution has arrived, we need to approach it with clear eyes. Your body is not a machine to be optimized. It's a complex, intelligent system that deserves compassion, flexibility, and human understanding—things no algorithm can provide.\n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Your AI Fitness Trainer Can Do More Harm Than Good",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7PZEC1QW89VH28QKWF1TM4Z/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-16T18:30:10.000Z",
      "dateModified": "2025-10-16T18:30:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Try the 'THIEVES' Technique to Make Reading More Engaging When You're Studying",
    "url": "https://lifehacker.com/thieves-reading-technique-study-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GT1EJP8W82MBT3D3FWX0A/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-17T12:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            This study technique will help you engage critically with new information.\n    \n        \n    \n                                        \n        \n        \n        October 17, 2025\n                    \n            Credit: Dikushin Dmitry/Shutterstock\n                            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding Lifehacker as a preferred source for tech news.There are a lot of popular study methods to choose from and they can all work well depending on the type of learner you are. One that isn’t as commonly discussed is the THIEVES method. Use it the next time you break open a fresh chapter for school or need to retain a lot of new information for work.What is the THIEVES method?The THIEVES reading technique, recommended by universities like Kent State, is designed to get you thinking critically while you read. THIEVES is an acronym for the following elements of your content:\n        \n            You May Also Like\n        \n    \nTitleHeadingsIntroductionEvery first sentence in a paragraphVisuals and vocabularyEnd-of-chapter questionsSummaryThe goal of using this method is figuring out what you want to learn from the chapter and how the information within it connects. By writing down each of the seven categories before you start, you’ll set the stage to get a bigger-picture view of the content before you start digging into it, similar to how the SQ3R or KWL methods work. How to use the THIEVES reading methodWrite down all seven of your categories—and I do mean write them down, since writing by hand can aid in retention. You can use your phone or a Word doc if you want, of course, but if you're looking for portability and modern convenience, I recommend handwriting, then digitizing your notes when you're done. After writing down the categories, from Title to Summary, and leaving some room under each, start jotting down what you want to gain from each one. Under Title, ask yourself what you think the text is about and what you already know about it based on the title. Under Headings, ask yourself why the information has been divided up this way, what you think you’ll learn in each section, and how the subtopics might relate to the bigger picture. From there, start reading, but mark down notes every time you encounter one of the THIEVES items. For instance, after the Introduction, write down what made you curious about the rest of the chapter after you read it, and make sure you do the same after Every first sentence in a section. Any time you get to a graph, picture, or table, write in your Visuals section about what each one represents and what they might tell you about the content and the bigger picture.At the End, jot down notes on how the author finished the chapter and what you learned, plus what you might learn in the future that relates to what you just went over. Finally, Summarize your reading, writing down what you think the author’s main idea was and your overall understanding of the primary themes and concepts.\n            \n                What do you think so far?\n            \n        \nThis is a more structured form of close reading, a reading technique that forces you to pause and consider every tiny detail of a text. The author, publisher, and professor all have reasons for why they want you to read something, why details were left in or out, and why the material presented in the text is relevant. Everything in there matters somehow, which is what close reading is designed to help you figure out. When you use THIEVES, you give yourself a road map to make close reading even easier.During the \"summarize\" portion, try blurting, or writing down everything you can remember, then checking your notes against the material. You can also try making a mind map, which helps you visualize the connections between your concepts. If you struggle with those, reread the material until you retain enough to move on to the summary. It might take a few passes.Doing this before and as you read will help you stay engaged as you go, and it gives you notes to look back on when you review in the future. Use distributed study to determine how frequently you need to review these notes before your next big test. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Try the 'THIEVES' Technique to Make Reading More Engaging When You're Studying",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GT1EJP8W82MBT3D3FWX0A/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-17T12:00:00.000Z",
      "dateModified": "2025-10-17T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Will Finally Let You Control How Liquid Glass Looks",
    "url": "https://lifehacker.com/tech/apple-will-finally-let-you-control-how-liquid-glass-looks?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K81EP75346P8RMQ2A3W4EB5W/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-20T20:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Do you prefer your UI clear or tinted?\n    \n        \n    \n                                        \n        \n        \n        October 20, 2025\n                    \n            Credit: Apple/YouTube\n                            \n            \n                Key Takeaways\n                                            Apple is now testing a setting that lets you choose how Liquid Glass looks on your iPhone, iPad, or Mac.\n                                            The company is testing the toggle as part of iOS 26.1, which is currently on its fourth beta version.\n                                            As it stands now, you'll have the option to turn on a \"Tinted\" mode forLiquid Glass, as opposed to \"Clear.\"\n                                    \n            \n    Table of Contents\n    \n        \n        For better or worse, nothing defines iOS 26 quite so much as Liquid Glass. Apple's distinct new design language has been met with praise and criticism, with some users enjoying the refreshed look, and others bemoaning the UI's issues with visibility and consistency.  It seems Apple was similarly of two minds on the update, having toyed around with the exact look of Liquid Glass throughout the iOS 26 beta testing period. The company seemed to be having trouble settling on a specific balance between the design's glassy effect, which can look really cool, and its overall readability. If buttons are too clear, for example, they'll let in more of the background elements, which can make it more difficult to see them. But by reducing the glass effect too much by adding a tint to the icon and menu backgrounds, Apple risks loses the charm of the design entirely. (Some critics have dubbed it \"Frosted Glass\" by comparison.)While Apple is seemingly still continuing to tweak Liquid Glass, it appears the company has decided that part of the problem is down to user preference. So rather than stick with one look for the design, Apple is now working on a setting that lets you choose whether Liquid Glass looks more clear, or more tinted.\n        \n            You May Also Like\n        \n    \nTo be clear, or not to be clearThis new setting first appeared in the fourth beta for iOS 26.1, as well as iPadOS 26.1 and macOS 26.1, which Apple released on Monday, Oct. 20. The toggle, which beta testers can find in Settings > Display and Brightness (iOS and iPadOS) or System Settings > Appearance on the Mac (macOS), gives users a simple choice in how Liquid Glass looks across their particular system: \"Clear,\" which is more transparent, and is in-line with Liquid Glass' original intent; or \"Tinted,\" which increases the opacity of menus and windows. You'll likely be able to read these elements better, but you won't see as much of the background shining through. \n    \n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \n\nGiving tester what they asked for (sort of)During the pre-release beta testing period, some users called on Apple to add a Liquid Glass \"slider\" to iOS, iPadOS, and macOS. The idea was to allow users to fine-tune how Liquid Glass looks. Apple seems to have taken a different approach, offering only two levels of transparency with the new control. While a slider (or more transparency options, at least) would be great, what we're getting is better than nothing for users who prefer a more opaque Liquid Glass appearance.iOS 26.1 is still in beta testing, so it isn't clear (no pun intended) whether this feature will in fact make it to the official update, and if it does, whether it'll still work the same way. How to fix Liquid Glass right nowBut even without this dedicated settings page, there is something you can do to \"undo\" Liquid Glass: By kicking on the \"Reduce Transparency\" feature in Accessibility settings, you can achieve a similar look to choosing the new \"Tinted\" option. My guess, however, is that \"Tinted\" will achieve a more visually pleasing look, as it is something Apple deliberately implemented to work with the design of Liquid Glass, while reduce Transparency is simply a blanket effect that turns down transparency effects across iOS, iPadOS, or macOS. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Will Finally Let You Control How Liquid Glass Looks",
      "image": [
        "https://lifehacker.com/imagery/articles/01K81EP75346P8RMQ2A3W4EB5W/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-20T20:30:00.000Z",
      "dateModified": "2025-10-20T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Are Brain Wearables the Future of Fitness Tracking?",
    "url": "https://lifehacker.com/health/are-brain-wearables-the-future-of-fitness-tracking?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K6NDFCN1ME7TFZP90HHMJS6G/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-10T18:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    What if headphones could read your mind the way a smartwatch reads your wrist?\n            \n                        \n    \n                            \n        \n        \n        October 10, 2025\n            \n            \n                        Credit:  René Ramos/Lifehacker/Jonathan Knowles/Stone, Antagain/iStock via Getty Images; Neurable/Master & Dynamic\n                            \n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding Lifehacker as a preferred source for tech news.This week, neurotech startup Neurable launched its MW75 Neuro headphones with a pretty seductive pitch—one that I'm not quite buying.Just slip on this pair of headphones, and you’ll gain unprecedented access to your brain's inner workings. Track your focus. Measure your mental fatigue. Quantify your cognitive performance. It's supposed to be the quantified-self movement's next frontier—moving from steps and heart rates to the most intimate data source of all: your brainwaves.\nIf you ask me, a pair of headphones that can read your mind sounds either too good to be true, or too creepy to be good. Neurable doesn’t plan to stop at headphones, and they aren’t the only company making a name in the space. Glasses, helmets, what have you—the next wave of wearable devices are targeting the brain. Whether you find it tempting or find it terrifying, the real question: Is this technology even real? Can \"brain tracking\" headphones actually measure anything meaningful, or are people paying $499 for an elaborate placebo wrapped in EEG sensors? Unsurprisingly, the answers are a little wrinkly. What are brain wearables in theory?The concept behind brain wearables is this: Using electroencephalography (EEG) sensors embedded in headphone ear cups, devices like Neurable's MW75 Neuro claim to track electrical signals from your brain, translating them into actionable insights about your mental state. The headphones promise to tell you when you're losing focus, when you need a break, and even provide a \"cognitive snapshot\" of your brain health over time.For the wellness-obsessed, it's pretty much catnip. Where fitness trackers gave us visibility into our physical states, brain wearables promise to illuminate the black box of our mental performance. In theory, you could optimize not just your workout routine, but your work-work routine, catching burnout before it catches you.The problem, according to experts across technology law and neuroscience, is that we're nowhere near ready for this technology to become mainstream—neither from a regulatory standpoint nor a scientific one. Let's start with the science.How does the science of brain wearables hold up?Before getting into the fairly obvious privacy nightmare, there's a fundamental question about whether these devices can actually deliver on their promises.José M. Muñoz, an associate at The Centre for Neurotechnology and Law in the United Kingdom and the International Center for Neuroscience and Ethics in Spain, is blunt in his assessment: \"For years, there has been an ongoing debate regarding the effectiveness, accuracy, and challenges of direct-to-consumer neurotechnologies such as this new device from Neurable,\" he explains. \"Although it is true that the algorithms analyzing brain data collected via EEG are steadily improving, this remains a neurotechnology that is still insufficiently accurate outside of a medical or clinical setting.\"The problems are both technical and practical. EEG data quality is extremely sensitive to electrode placement—sometimes within a range of millimeters. When users place these sensors themselves, without medical supervision, their reliability plummets. Moreover, the most accurate EEG studies use far more electrodes than the handful embedded in a pair of headphones.\"In sum, you may be wearing these headphones and believing they are helping to improve your mental health, physical performance, or attention,\" Muñoz says. \"But what you are really improving are the manufacturer's algorithms, while handing over your brain data in exchange for very little.\"In other words, it's the tech tale old as time: You're not the customer being served by this technology. You're the data source training it.Dr. Annu Navani offers a more measured perspective. She acknowledges that brain wearables have \"significant limitations, including being currently expensive, less clinically validated, and less convenient or comfortable than wrist-worn trackers.\" The metrics they provide are also harder to translate into practical guidance—most people intuitively understand what to do with their step count, but what action should you take when your \"cognitive load score\" hits 73?\n            \n                What do you think so far?\n            \n        \nRather than replacing traditional fitness trackers, Navani believes brain wearables will likely \"complement rather than replace conventional devices, targeting a niche of users interested in cognitive and neuro-performance insights.\" Traditional wearables, she points out, still provide reliable, validated data for basic health metrics that users can easily understand and apply.Who is really reading your mind here?Think about it (and hey, maybe relish in the fact that no headphones are successfully reading those thoughts): Your brainwave data is arguably the most intimate biometric information you possess. We're talking about a window into your mental and emotional states. So what happens when you willingly give up this data with no meaningful oversight? \"I hope brain wearables are not the future of fitness tracking, or any industry, at least certainly not yet and not any time soon,\" says Star Kashman, a technology attorney and founding partner of a cyber law firm. \"We are still somehow facing a complete lack of federal regulation in the U.S. when it comes to biometric data, data privacy law, and minimal to no cybersecurity standards for these devices, and no protective regulations for users.\"The implications are stark: \"What happens when a 'brain wearable' is hacked?\" Kashman asks. The lack of regulation means users have little recourse and limited knowledge about how their neural data is being stored, used, or potentially sold.Regulation aside, individual consumers do still have their own privacy concerns. The sort of consumer ready to spend hundreds of dollars on headphones might just be the same type of person who is uncomfortable with constant surveillance. \"Unless someone is so obsessed with optimizing their fitness journey that they ignore the serious risks present, I just do not see this becoming the norm anytime soon,\" Kashman notes. Just look at Meta's push for smart glasses. The tech has got to be good and ready before consumers are going to drop hundreds of dollars and risk their most private bodily information. The bottom lineSo, simply put, at the time of this publication, asked with my own private brain waves: Are brain wearables the future of fitness tracking? Almost certainly not in the way their manufacturers hope. The technology is too immature, the regulatory landscape too barren, and consumer wariness too high for these devices to start popping up like Fitbits tomorrow. I'd say what we're witnessing instead is the familiar pattern of the wellness industry: a genuine technological development (EEG monitoring does work in controlled settings!) being prematurely commercialized and marketed with promises that totally outstrip the reality. The result is an expensive product that may provide some users with interesting data, but likely offers more placebo than breakthrough.For now, brain wearables occupy an awkward position: too invasive for casual users, too unproven for serious applications, and too unregulated to trust. They may have a future, but it's not this one—not until the science catches up to the marketing, and the law catches up to both.Until then, your regular fitness tracker measuring your heart rate and steps? That's probably telling you more useful information about your health than any headphones reading your brainwaves ever could.\n            \n    \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n                        \n                \n            \n                    \n                                            \n                \n            \n                Meredith Dietz\n                                    Senior Staff Writer\n                                \n                                            Covering personal fitness tech, home gym equipment, and more.\n                                    \n                Read Meredith's full bio\n                            \n        \n                \n                                            \n    More by Meredith\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                \n                                                \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Are Brain Wearables the Future of Fitness Tracking?",
      "image": [
        "https://lifehacker.com/imagery/articles/01K6NDFCN1ME7TFZP90HHMJS6G/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-10T18:00:00.000Z",
      "dateModified": "2025-10-10T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Make Your Own ‘Celebrity Elevator Selfie’",
    "url": "https://lifehacker.com/entertainment/how-to-make-a-celebrity-elevator-selfie?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7SSJS78VQGDSEGX8BKTEMVB/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-17T19:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Make Your Own ‘Celebrity Elevator Selfie’",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7SSJS78VQGDSEGX8BKTEMVB/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-17T19:30:00.000Z",
      "dateModified": "2025-10-17T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What to Do Before Microsoft Cuts Off Support for Windows 10 on Tuesday",
    "url": "https://lifehacker.com/tech/extra-year-windows-10-security-updates?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JYKW5CHJ5W0VMC8STAYW46FR/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-13T14:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What to Do Before Microsoft Cuts Off Support for Windows 10 on Tuesday",
      "image": [
        "https://lifehacker.com/imagery/articles/01JYKW5CHJ5W0VMC8STAYW46FR/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-13T14:00:00.000Z",
      "dateModified": "2025-10-13T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]