[
  {
    "title": "Start Each Week With This Digital Decluttering Method",
    "url": "https://lifehacker.com/best-digital-decluttering-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2H6ND61Y2JAHPTZQJM2DSW/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-30T13:00:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Prathankarnpap - Shutterstock\n                            \n    Table of Content",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Prathankarnpap - Shutterstock\n                            \n    Table of Contents\n    \n        \n        It’s well-established that physical clutter impairs your productivity and focus, going as far as to make you exhausted, stressed, and burnt out, which is why decluttering your workspace is key component in a lot of productivity techniques. In this day and age, though, your \"workspace\" isn't always (or, in some cases, even) an office or desk. Your phone and computer are your workspace. That's where you spend most of your work day looking and interacting—and when it's cluttered, you can feel discombobulated, the same as you might with a messy cubicle. It's time to stop thinking only about decluttering the physical world and make a better plan to keep the digital one in good shape. Take stock of your desktop, your tabs, your inbox, and your home screen: How many different windows do you have open right now? They are not only bogging down your mental energy, but your device’s energy, too. Let's fix that—and find a solution that sticks.When to declutter your devicesAim to start each week with a digital decluttering. It doesn’t have to take more than 15 minutes, but you’ll be more productive when it’s done, so it’s a good investment of your time. Approaches like this work best when you actively take the time to schedule them out, so fall back on time boxing and time blocking, and consider using a specialized to-do list system like 3-3-3, then designating the weekly decluttering one of Monday's three small tasks. How to digitally declutter (easily)On your desktop, create folders that can store whatever you need, whether those are documents for work or screenshots for your side business. Each Monday, go through whatever docs or pics have accumulated on the desktop and stick them in their respective folders so the whole thing looks cleaner. Do the same thing with any new apps you’ve put on your phone. There’s no reason to scroll through pages and pages of apps to find the one you need when you can stash it in a folder and keep your home screen organized. Only keep the necessary, daily-use folders available on your desktop and home screen. The rest should be banished somewhere invisible, but searchable.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nClose all open windows you’re not using—and all the tabs left over from your last browsing session. If you genuinely need something available, bookmark it. Get in the habit of closing tabs whenever you’re done with them. (Check for minimized browser windows, too; I always have at least two that need to be closed, but I rarely realize they're running in the background.)\n            \n                What do you think so far?\n            \n        \nNext up is email. I've recommended the “one-touch” method of inbox management before, and an adaptation of it works great here: Open every email you’ve gotten in the last week and either delete it or archive it, depending on whether you anticipate needing it later. Anything you archive, be sure to set aside time to respond to later in the day or week. (Again, time box and time block this, plus add it to your to-do list so it's a real, scheduled task, not just a good idea you may or may not get around to.)Perhaps most importantly, delete as you go. This is the the one I struggle with most, but once you get in the habit, it's easy. If you downloaded an app for a single purpose and don’t use it anymore, delete it. If you have docs in your files from an old class or work project, delete them. Stick to doing this for the first 15 minutes every Monday (or whenever you start your week) to dramatically reduce your digital clutter and any related stress. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Start Each Week With This Digital Decluttering Method",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2H6ND61Y2JAHPTZQJM2DSW/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-30T13:00:00.000Z",
      "dateModified": "2025-12-30T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "That Grubhub Bitcoin Email Is a Scam",
    "url": "https://lifehacker.com/money/grubhub-bitcoin-email-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDPB8KZSCNR1QX8Q9JQ4RMPY/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-30T15:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: BestStockFoto/Shutterstock \n                            \n            \n",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: BestStockFoto/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Scammers are impersonating Grubhub to promote a crypto rewards scam.\n                                            Emails were sent from addresses on a legitimate Grubhub subdomain.\n                                            Grubhub is not actually doling out $10,000 in bitcoin.\n                                    \n            \n    Table of Contents\n    \n        \n        Some Grubhub users have received a tempting email offer from the food delivery service: Send $1,000 in bitcoin to a specified wallet, and get 10 times that amount back. Unfortunately, this is very much a scam.  As BleepingComputer reports, these promo emails were sent from addresses on b.grubhub.com, a legitimate Grubhub subdomain, so they appear verified in recipients' inboxes. Two examples of senders include [email protected] and [email protected]. Beyond that, there are some pretty clear red flags. The subject line reads \"30 minutes left - We'll 10x your Bitcoin!\" to promote a sense of urgency and an offer too good to be true (but also too good to ignore). The body includes the recipient's name and instructions on how to participate in Grubhub's \"Holiday Crypto Promotion\" with a bitcoin wallet address. While Grubhub has acknowledged the problem, they haven't released any details as to what facilitated attackers sending emails using a company address. The company did suffer a major security breach earlier this year, resulting in the leak of some user data (including names and email addresses). \n            \n                What do you think so far?\n            \n        \nThere are several varieties of the crypto reward scamThe Grubhub email promotion is a pretty typical example of a cryptocurrency scam. The Federal Trade Commission outlines several variants, including get-rich-quick schemes guaranteeing big returns on your investment and celebrity-promoted \"giveaways\" that claim to multiply any funds you send.If you fall for crypto fraud, there's no way to track or get your money back, and even if victims are few and far between, scammers can score big paydays. That's why you should be especially wary of anything and everything requiring a crypto transaction, especially if the offer sounds urgent or provokes a sense of either excitement or fear. And remember that no legitimate organization—government agency, law enforcement official, utility company, or prize promoter—will ever ask for payments in cryptocurrency.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "That Grubhub Bitcoin Email Is a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDPB8KZSCNR1QX8Q9JQ4RMPY/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-30T15:00:00.000Z",
      "dateModified": "2025-12-30T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'GhostPairing' Attacks Are Taking Over WhatsApp Accounts",
    "url": "https://lifehacker.com/tech/ghostpairing-attacks-are-taking-over-whatsapp-accounts?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDNG01324DJGEC5DZVSBVB38/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-29T18:30:06.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Melnikov Dmitriy / Shutterstock.com\n                            \n    Table of C",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Melnikov Dmitriy / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        If you use WhatsApp, you may be targeted by scammers looking to take over your account by pairing their browser to your number. This scheme, dubbed GhostPairing by researchers, uses WhatsApp's device linking process to allow fraudsters to access all of your messages, impersonate you in chats, and perpetuate the scam to your contacts. Here's how threat actors are hijacking WhatsApp accounts—and how to defend yours. GhostPairing manipulates WhatsApp device linkingWhatsApp allows users to link their desktop or browser to their account without needing to enter login credentials in one of two ways: scanning a QR code and approving the session or confirming a numeric pairing code in the mobile app. While the GhostPairing scam could theoretically manipulate users in either approach, researchers found that the latter is much more common. The fraud begins with a short message sent from a contact with a link that purportedly goes to a Facebook photo or some type of Facebook content. If you click through, you'll be directed to a spoofed Facebook login page to enter your phone number—a familiar confirmation flow for Meta platforms. The next screen will likely show a numeric code with instructions to enter said code into WhatsApp to confirm the login (again, this may feel like a familiar two-step verification). If you're not paying attention, you may not realize that this didn't do anything on your end but instead registered the attacker's browser as a linked device to your account. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe danger in this scam is that everything will seem normal on your device and in your account, as attackers haven't hijacked your credentials to lock you out. However, they can do anything and everything in WhatsApp that you can, such as reading chats, receiving messages, viewing and downloading media, collecting information from your contacts, and forwarding the same phishing link. As they learn more about you and the people you know, they can potentially use that for ongoing scams. How to protect your WhatsApp accountAs always, be wary of links received via messaging platforms, even if they seem harmless or you think you know and can trust the sender. Threat actors frequently use social media and direct messaging to spread phishing lures. If you do click a link in WhatsApp (or any other communication), read all prompts carefully before providing or verifying any information to identify scams. \n            \n                What do you think so far?\n            \n        \nTo protect your WhatsApp account specifically, you can set up two-step verification, which will also prevent attackers from adding or changing a connected email address. Go to Settings > Account > Two-step verification > Turn on or Set up PIN and add an email address when prompted. You can also check to see if there are any suspicious devices paired with your account under Settings > Linked devices and remove any you don't recognize or regularly use.Finally, if you have been targeted by this scam, let your WhatsApp contacts know, as threat actors may spread the malicious link by making it look like it came from you. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'GhostPairing' Attacks Are Taking Over WhatsApp Accounts",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDNG01324DJGEC5DZVSBVB38/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-29T18:30:06.000Z",
      "dateModified": "2025-12-29T18:30:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seven Clever Ways to Use C-Clamps Around the House",
    "url": "https://lifehacker.com/home/best-ways-to-use-c-clamps-around-the-house?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDR556NVN3TRJ6HQ29DQ3YNZ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-30T18:00:21.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Valery Orlov / Shutt",
    "body": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Valery Orlov / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        If you’ve been doing any kind of work around any kind of house for a while, you probably have a few trusty old-school C-Clamps on hand. The C-Clamp has been in use for thousands of years. It’s one of those dead-simple tools that just works. It’s also one of those tools you tend to collect multiple examples of, in different sizes.Typically, you use a C-Clamp to, uh, clamp stuff together, like two pieces of wood, or to clamp something into place while you work on it (I use them a lot to cut lumber so I can have both hands on the saw, as I am allergic to emergency rooms.) But the C-Clamp is actually a very versatile tool that can be deployed in a number of creative—but useful!—ways. Here are some of my favorite ways to repurpose those old C-Clamps.A carrying handleIf you need to carry something that’s bulky, heavy, and awkward, having some temporary handles always makes the job easier. If you have a few C-Clamps, you’re golden: Just clamp a couple onto whatever you’re transporting and you have instant handles to make the haul a little easier. They can also be used as handles for rolled-up materials, like rugs or mats—just thread the roll through a pair of C-Clamps, tighten them closed, and carry on.A quiet hammerIt’s happened to all of us: You need to drive a nail somewhere, but there’s no room to swing a hammer, or for some reason you’re reluctant to make a lot of banging noise. The solution is your trusty C-Clamp: Just place the clamp over the nail head and tighten. The clamping action will inexorably (and silently) drive that nail into place. This isn’t an efficient way to drive a lot of nails, of course, but in a tight spot, it’s brilliant.An emergency wrench\n            Never miss a story\n                Get the latest smart home news, trends, and advice from Lindsey and the team.\n            \n        \nNeed to tighten or loosen a connector, but you don’t have a wrench at hand? Tighten a C-Lamp around the bolt, cuff, or connection point so that it’s gripping tightly, then slowly turn it in the direction you need. Make sure the clamp is tight enough to prevent slippage, and you might want to use something (a handy piece of cloth works) to protect the connection from damage as you work.A cord organizerWhether it’s corralling all those extension and power cords on a workbench or work site, or organizing computer cables on your desk with an industrial vibe, C-Clamps can keep all those wires under control and out of your way in a pinch. Just gather the cords at the edge of the desk or table and clamp them down. This is a perfect temporary solution, as the cords can pass freely through the clamps without risk of damage, and the clamps can be removed when the job is done.\n            \n                What do you think so far?\n            \n        \nBookendsNeed a couple of bookends to hold stuff in place on a shelf? A pair of C-Clamps attached to the outer edge and clamped in as deep as possible will work. This could even be a permanent design choice if your taste runs toward the rustic or industrial.AnchorsC-Clamps are ideal devices when anchor points are needed, but you don’t want to attach anything permanent that would require fasteners and drilling into a structure. Need a clothesline to dry your laundry when the dryer breaks? Two C-Clamps and some rope or twine are all you need. Need to hang tools, clothes, or anything else? C-Clamps attached to a shelf of any kind, combined with a hook, will work a charm. Need to hold a tablecloth or other covering in place? Nothing clamps stuff down to a horizontal surface better than C-Clamps.Spool holderWhether you’re spooling filament to your 3D-printer or feeding twine or wire to yourself as you work on a project, sliding the spool over a C-Clamp and then clamping it into place gives you a sturdy holder that you can pull from. This means you won’t have to juggle your spool every time you need more slack, and you can easily unclamp and reposition the spool if you’re on the move as you work.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seven Clever Ways to Use C-Clamps Around the House",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDR556NVN3TRJ6HQ29DQ3YNZ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-30T18:00:21.000Z",
      "dateModified": "2025-12-30T18:00:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Last-Minute Sale on the Switch 2 Bundle Is Available at Best Buy Today",
    "url": "https://lifehacker.com/tech/switch-2-mario-kart-world-bundle-sale?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KD8NG4RASC04D7Q8DSF4WMHZ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-24T17:45:13.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Rene Ramos\n                            \n    Table of Contents\n    \n        \n        The Nintendo Switch 2 with Mario Kart World bundle is in stock at Best Buy after running out of stock very quickly on Amazon. The deal includes the new console with the new Mario Kart for the same price as the standalone console. You can get this one for $449 (down from $499)—the lowest price it has reached yet, according to price-tracking tools. (Note that you can only see the price once you've signed in and it's in your cart, as Nintendo restricts retailers from promoting anything below the \"minimum advertised price\" of $499.) To top it off, Best Buy is somehow promising to have it delivered to your home by 9 p.m. tonight, Dec. 24—a true Christmas miracle. Not all locations will be available, so make sure you see the \"shipping get it by 9 p.m. today\" note above \"add to cart.\" You can also pick it up within an hour if time is of the essence.\nThis bundle deal is great, and likely the best one you'll see for quite some time, judging by Nintendo's previous deals. To put it into perspective, the OLED edition of the original Nintendo Switch is $400 right now, meaning you can get the new Switch 2 with Mario Kart for $50 more. The new console is also an upgrade in every way, according to Associate Tech Editor Michelle Ehrhardt's Nintendo Switch 2 review. The ergonomics and design have improved, making it much better to hold and look at. The battery life has also improved, now with about 180 minutes of handheld playtime before the juice runs out.A big plus is that the Switch 2 is backwards compatible, meaning you can play your old Switch games on it. Some Switch games have the ability to upgrade to the Switch 2 Edition by buying that game's upgrade pack. This is especially worth it for games like The Legend of Zelda: Tears of the Kingdom, which will look better on the Switch 2.\n            \n                What do you think so far?\n            \n        \nThere aren't a lot of Switch 2 games out at the moment, but there are some classic Nintendo games to keep you busy until the library expands, like Donkey Kong Bananza, Kirby Air Riders, and Hyrule Warriors: Age of Imprisonment.\n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Last-Minute Sale on the Switch 2 Bundle Is Available at Best Buy Today",
      "image": [
        "https://lifehacker.com/imagery/articles/01KD8NG4RASC04D7Q8DSF4WMHZ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-24T17:45:13.000Z",
      "dateModified": "2025-12-24T17:45:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "So, I Tried an AI Shopping Cart",
    "url": "https://lifehacker.com/tech/what-it-is-like-to-use-an-ai-shopping-cart?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDNHTX3BKPDRC6QF6FCM0D8D/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-29T20:00:54.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    These fancy new shopping carts are popping up at grocery stores.\n            \n                        \n    \n                            \n        \n        \n        December 29, 2025\n            \n            \n                        Credit: René Ramos / Lifehacker / LumenSt / Urbanscape / Sashkin / Maina / Adobe Stock\n                            \n    \n        \n        The first supermarket, the Piggly Wiggly in Memphis, opened its doors in 1916. It was the first time people could wander around a store and pick their items from a shelf instead of handing a list to a clerk who would gather everything for them—typically without any choice of brand or style. Grocery shopping remains a daily or weekly ritual for most people, and it can be a real chore—especially if you’re shopping for a large family. My own grocery lists aren’t all that long, but I still find myself juggling my phone and a scrap of paper as I walk around the store, checking for digital coupons and trying to do quick math. So when I read that one of the local grocery stores (a ShopRite) was rolling out Smart Shopping Carts powered by artificial intelligence (AI), I was intrigued. I’m naturally dubious about a lot of AI tools, but grocery shopping seemed like a place where a little digital help might come in handy. So I headed out to see whether these fancy new carts would offer real benefits or just a lot of targeted advertisements.What are caper carts?The carts in question are Caper Carts, which is owned by Instacart. They’re pretty large and tank-like, and kind of heavy to push.\n\n    \n            \n            The Caper Carts are pretty big and heavy.\n                                        Credit: Jeff Somers\n                    \n    \nYou need to have an account with ShopRite in order to use these carts, as they use your phone number to track your purchases; you can choose to store a credit card or other form of payment in there for convenience, but it’s not required. When you walk in the store, the Caper Carts are right there in the entrance area. When you pull one out, the screen lets you enter your phone number, then offers you a (mercifully brief) tutorial.\n    \n            \n            The welcome screen on the AI shopping cart.\n                                        Credit: Jeff Somers\n                    \n    \n\n    \n            \n            The log-in screen\n                                        Credit: Jeff Somers\n                    \n    \nThe carts have barcode scanners mounted on both sides of the back of the cart, and the cart itself is a scale, which is both how it ensures you’ve scanned everything in the cart and how it calculates the cost of loose produce. If you’ve ever used a self-checkout in a grocery store, it’s kind of similar: You hold items up to the scanners and then drop them into your cart. For produce, you look up what you’re buying and then drop it into the cart, where it’s weighed and added to the total. Along the way, the cart will look for potential coupons or deals you might be interested in. The carts can import your shopping lists from the store’s app, if you want, and will keep track of your loyalty points and rewards as well.How to use a Caper CartThe first Caper Cart I selected didn’t work; nothing would scan no matter how I held things up to the scanners. This wasn’t a big deal—I let the store folks know, logged out of the cart, and grabbed another. The second cart worked perfectly.\n    \n            \n            The  Caper Cart screen while shopping\n                                        Credit: Jeff Somers\n                    \n    \nThese carts are pretty heavy, and the second cart I used had a loose wheel which made it rumble loudly as I walked the aisles—you aren’t going to be racing these carts and jumping on for a quick glide. When I dropped an item in the cart without scanning it, the cart politely showed me a video of me placing the item (creepy) and asked if I wanted to fess up to adding something to the cart. It did, however, give me the option to declare a “personal item,” which is a solid feature.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n\n    \n            \n            A video pops up if you try putting an un-scanned item in the cart\n                                        Credit: Jeff Somers\n                    \n    \nI forgot to put my shopping bags in the cart, because I am frequently dumb. You’re supposed to bag as you go, which saves you time; I had to bag after checkout, which did not save me time. On the other hand, I don’t always shop in bagging order, so bagging as I go might result in some of my items getting crushed under heavier groceries, or me having to re-arrange everything in the middle of the shopping experience. I kind of like bagging at the end, when I can make decisions about how to arrange everything optimally.If you change your mind about an item, you just remove it from the cart. The Caper system will notice and remove the item from your bill.\n            \n                What do you think so far?\n            \n        \nWhen you’re done, you just tap “Checkout” and head to the Checkout Area.\n    \n            \n            Checking out with a Caper Cart\n                                        Credit: Jeff Somers\n                    \n    \nThis will be different depending on the specific store you’re in—some stores don’t have checkout lanes for the Caper Carts, but this ShopRite did. There was only one lane for Caper Carts, and I had to wait behind someone as they checked themselves out. Then I scanned a barcode on my screen with a gun and tapped my card to pay while a security guard loomed nearby, presumably to discourage folks from making a run for it.\n    \n            \n            Barcode for checking out with a Caper Cart\n                                        Credit: Jeff Somers\n                    \n    \n\n    \n            \n            Scanning the checkout barcode on a Caper Cart\n                                        Credit: Jeff Somers\n                    \n    \nOverall, the AI shopping cart experience was a slight upgrade from typical grocery shopping. Bagging as you go is convenient, and checkout is a little easier because you scan a single barcode instead of two dozen. I didn’t receive many personalized coupons or recipe suggestions because this was my first time using the system, but I can see how that could become very useful if the cart is able to dig up coupons or offers that I missed.A few specific notes:The cart can accidentally scan a barcode if you get close to a shelf, which can cause confusion, though the cart will quickly delete it if the weight doesn’t change.As noted above, the carts are pretty heavy. If you’re going to be buying a lot of groceries all at once, this could become a real workout.Adding produce can be a little complicated: You have to locate the “price look up” (PLU) code for the specific produce you’re adding, then scan or type it into the screen before dropping it into the cart. That means sometimes hunting for those little stickers and tapping a bunch of numbers into your cart over and over again.Seeing your total spend add up in real time is useful, especially if you’re tracking costs. If an item costs more than expected, you see it immediately, and if the overall cost is more than anticipated you have time to adjust your selections before you hit the checkout.Because you have to go through a checkout lane as usual (and there was only one dedicated lane for Caper Carts), during busy times you might wind up waiting a long time to get out of the store, which kind of cancels out the convenience factor. Of course, as more people use these carts, ShopRite might add more dedicated Caper lanes.Depending on how you shop for groceries, these AI shopping carts might be worth a try—but don’t expect a revolutionary experience.\n            \n                        \n                \n            \n                    \n                                            \n                \n            \n                Jeff Somers\n                                \n                                            Jeff Somers is a freelancer who has been writing about writing, books, personal finance, and home maintenance since 2012.\n                                    \n                Read Jeff's full bio\n                            \n        \n                \n                                            \n    More by Jeff\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "So, I Tried an AI Shopping Cart",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDNHTX3BKPDRC6QF6FCM0D8D/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-29T20:00:54.000Z",
      "dateModified": "2025-12-29T20:00:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Is the Easiest Way to Filter Junk Out of Your Gmail Inbox",
    "url": "https://lifehacker.com/the-easiest-way-to-filter-junk-out-of-your-gmail-inbox?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GM9VNRCNAZ4S1G8DJ9VC5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-24T13:00:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Jarretera - Shutterstock\n                            \n    Table of Contents\n   ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Jarretera - Shutterstock\n                            \n    Table of Contents\n    \n        \n        No matter how dedicated you are to responding to and archiving all your emails, there will always be one thing preventing you from hitting true inbox zero: all of those mailing lists you're subscribed to. These horrors will visit you at all hours of the day, making it harder to spot the truly important messages in your inbox—and it gets worse once you've gotten fed up enough to disable push notifications and they start to really pile up. It’s time to banish these buggers. And, if you're using Gmail, there’s an easy way to do it.Use filters to manage mailing list emails in GmailYou can use a third-party add-on to go through your mailing lists and unsubscribe, saying goodbye to newsletters and e-blasts. But you know what’s easier and less expensive? Setting a filter in Gmail. Open up one of your mailing list emails and click the three dots in the menu bar. You’ll see “Mark as unread,” “Mark as important,” and a few other options, but the one you want is “Filter messages like these.”\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n\n    \n            \n            \n                                        Credit: Gmail\n                    \n    \nFrom there, you’ll see a dialog box asking how you want to filter your messages. You can filter by sender, recipients, and subjects, but also by anything that “has the words…” In the “has the words” row, type “unsubscribe.” \n            \n                What do you think so far?\n            \n        \nNow, any email containing the word “unsubscribe”—which reputable email blasts almost always do—can be filtered out of your inbox without you having to do anything. Once you type “unsubscribe” there, hit the “create filter” button. The following dialog box will ask how you want these filtered. You can choose to have them archived, marked as read, starred, forwarded, or immediately deleted.Things to consider when creating Gmail filtersI recommend archiving over deleting in case you ever want to find them again, but if you are sure you’ll never want to open another mailing list, newsletter, or sales blast, feel free to check the box next to “delete.” Note that if you choose to archive but later want to delete them, you’ll have to do so manually. Personally, I am happy to pay for extra Google storage to keep a record of messages instead of inadvertently lose something I need, but I know that's needlessly neurotic. If you do end up archiving those, the next step needs to be actually unsubscribing from the messages you truly don't want to receive. Gmail has recently made this a lot easier: You can usually click an unsubscribe button up at the top of the offending email. The Google-run email service also rolled out a Manage Subscriptions service this past summer, so once you take a gander at the archive full of junk and notice what you're not exactly needing or opening up, you can head over there and nuke your subscriptions quickly and easily. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Is the Easiest Way to Filter Junk Out of Your Gmail Inbox",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GM9VNRCNAZ4S1G8DJ9VC5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-24T13:00:00.000Z",
      "dateModified": "2025-12-24T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Last-Minute Gift Ideas If Your Only Option Is the Drug Store",
    "url": "https://lifehacker.com/last-minute-gift-ideas-from-the-drug-store?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GPC2Q7B6KXHQ7P9BQWFEJ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-22T21:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images / Shutterstock\n                            \n    Table of Contents\n ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Perhaps you completely forgot about the “Secret Santa” gift exchange, or your estimated delivery date got pushed back to 2026. Whatever your reasons, you’re in need of a last-minute gift, and your options are limited. If you're reading this at a time when it's too late for online delivery, and in-person store options are already closed, then all that’s left is the glory of your local 24-hour drug store.If you have access to a major chain like Walgreens or CVS, you could be in surprisingly good shape for this last-minute gift. All it takes is a little ingenuity to level up this gift from \"a protein bar\" to \"a gym bro collection,\" or \"some loose nail polish\" to a \"curated at-home spa day.\"Following this logic, I’ve carefully categorized your gift options into three tiers. The first is for gift-givers willing to shell out a little extra cash in their panic in order to create something somewhat personalized. The second tier includes single-item purchases that are simply passable gift options. The third tier is a warning.Tier one: DIY signature collectionsLike a chef turning baskets of mystery ingredients into a three-course meal on Chopped, this category of gifts is all about your innovation. In these DIY arrangements, the sum is greater than its parts, which should all be available at most chain drug stores. Here are some of our ideas for themed collections, but feel free to customize at your convenience.\n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nMovie night: Popcorn. Funky popcorn toppings. Candy. Hot chocolate. Fuzzy socks. A little slip of paper with your Netflix login. You can’t go wrong with a cozy movie-night theme.Treat yo’ self: Think spa day materials, like face masks, nail polish, and bath bombs. Throw in a candle to help set the pampering vibe.Health and wellness: Browse around for gummy vitamins, supplements, protein powder, and whatever else catches your eye in the fitness aisle. Be warned: This one can quickly get expensive. The Jetsetter: Pick from the array of travel-sized must-haves, including ear plugs and perhaps even a neck pillow (with a note about how to wear it right). The Techie: Head to the electronics section and go wild with whatever gadgets are available and within your price range. Portable chargers and speakers are quality gifts in their own right. Tier two: It’s the thought that countsThese items aren’t necessarily bad gifts, but many will be easily detected as a last-minute purchase. The success of tier two drug store gifts will come down to the charm of the gift-giver and the chill factor of the recipient.\n            \n                What do you think so far?\n            \n        \nGift cardsCandlesCosmetic bagsTherapeutic massagerJewelryInsulated mugsCalendars or plannersNotebooksCoffee/tea bundlesWine and a corkscrew (depending on your state’s liquor laws)Picture framesElectronics, like ear buds or portable chargersTier three: “Gifts” that will do more harm than goodHey, buddy. All is lost, huh? Personally, I recommend a white lie about an imaginary gift that didn’t arrive in time. Unless you’re confident you can pull off a gag gift, proceed with caution should you opt to gift someone anything from the list below. Lottery ticketsCommand stripsBatteriesPregnancy testBeef jerkyLaxativesA toilet plungerLaxatives and a toilet plunger tied together with a bowThere you have it. If you have access to a drug store, you should be able to pull together a last-minute gift with moderate success. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Last-Minute Gift Ideas If Your Only Option Is the Drug Store",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GPC2Q7B6KXHQ7P9BQWFEJ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-22T21:30:00.000Z",
      "dateModified": "2025-12-22T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Might Soon Be Able to Change Your Gmail Address",
    "url": "https://lifehacker.com/tech/you-might-soon-be-able-to-change-gmail-address?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDNBSRSHKRHDFRYRE32T83BF/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-29T17:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: abdullah serbest/Shutterstock \n                            \n            \n      ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: abdullah serbest/Shutterstock \n                            \n            \n                Key Takeaways\n                                            An updated Google support page says the company is rolling out the ability to change your gmail address.\n                                            The support page is currently only in Hindi, but it says the feature will come to \"all users.\"\n                                            There are still limitations on how often and how much you can change your gmail address.\n                                    \n            \n    Table of Contents\n    \n        \n        One of the most annoying restrictions in Gmail is that, once you've picked an email address, you're stuck with it. There are exceptions for third-party addresses, like work emails tied to a company's domain, but for the typical @gmail.com account, no dice. Personally, I've had a number of loyalty programs and store accounts tied to an embarrassingly edgy email from high school for decades now, but finally, it seems like I'll be able to change it.A recently updated Google support page says the company is now \"gradually rolling out\" the ability to change your Gmail address, with some limitations. Oddly, the page is only available in Hindi for the moment, so I've reached out to Google for clarification about where and when the feature will be available and will update when I hear back. Still, the support page does say (through a machine translation) that the feature's coming \"to all users,\" which implies it'll see a global release at some point.For good measure, I checked if I could change any of my personal gmail addresses, but no luck. But once the feature rolls out to you, here's how you'll be able to do it.On a computer or mobile device, navigate to myaccount.google.com/google-account-email.At the top of the page, click or tap \"Personal Information.\" On mobile, this may show up as \"Personal Info.\"Click or Tap on \"Google Account Email.\"From there, click or tap on \"Change Your Google Account Email Address\" and enter your updated email address.Note that these instructions were filtered through a machine translation, so exact wording may differ depending on region. I'll update with official English instructions when available, but the process does seem simple enough.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThere are a couple of wrinkles, however. The big one is that emails sent to your old address will still be sent to your new one, and that your old email may still show up instead of your new one in some cases, like on Calendar events created before you changed your address. That's because your former name will be listed as an alias for the account, rather than deleted. That could be a pain if you're trying to leave old contacts behind, but it'll also ensure important contacts don't get lost in the shuffle, and it'll keep anyone else from registering a new account with that email address. You'll also still be able to use your old gmail address to sign into any accounts associated with it, and regardless of which name you sign in with, you'll still have access to all of your messages, photos, and other files. \n            \n                What do you think so far?\n            \n        \nYou can also revert to your old address at any time, but as for changing it to a new address, you can only do it once a year, and only three times total. So no changing it to a wacky new address every Halloween and then back to normal come November.Still, it should be a major quality-of-life upgrade, and should help Google's email service better catch up to more permissive email providers like Proton. No more sounding like an edgelord every time I talk to the checkout clerk at Sephora.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Might Soon Be Able to Change Your Gmail Address",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDNBSRSHKRHDFRYRE32T83BF/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-29T17:30:00.000Z",
      "dateModified": "2025-12-29T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I Tested Three macOS Finder Alternatives, and This Is the Best One",
    "url": "https://lifehacker.com/tech/macos-finder-alternatives?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDN90GDF262G1P75HTFFF3A0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-29T16:30:00.000Z",
    "description": "\n        \n        You can customize more on your Mac than you might have realized, and that extends to the file management software you use to browse ",
    "body": "\n        \n        You can customize more on your Mac than you might have realized, and that extends to the file management software you use to browse around your system. Take, for example, Finder: There are a good number of alternatives around that bring with them extra features and different layouts.I've been testing out three of the most well-known and highly rated alternatives to Finder to see what I might be missing. Each one has its own appeal, but the third in the list here is so good that I might switch to it permanently for all my file and folder needs on macOS.Commander One\n    \n            \n            \n                                        Credit: Lifehacker\n                    \n    \nAs soon as you load up Commander One, you'll notice it has a busier interface than Finder, which may or may not suit you, depending on your attitude toward minimalism. Its layout is based around a dual-pane interface, and you can customize it in a variety of ways—even down to the fonts and colors used, if you want something bespoke.The software starts to show its potential when you move from just looking at your files and folders to actually doing something with them. You're able to rename files when copying and moving them; you get a dedicated file operations queue; and you can run complex searches through your system using regular expressions, too.I like the quick toggle switches for seeing hidden files and for previewing files without any additional apps, and connecting up to network locations and cloud storage is straightforward. There's even an integrated Terminal for you to make use of. It's handy having shortcut keys on show in the interface as well, and you can customize these as needed if you don't like the defaults.There's certainly a lot going on, and while the interface takes a little bit of getting used to, that's to be expected—and it doesn't take long to learn what's what. The Pro version of the software comes with extra features, including layout themes, and integrations for FTP, Google Drive, and Dropbox: That's yours for a one-off fee of $29.99.QSpace Pro\n    \n            \n            \n                                        Credit: Lifehacker\n                    \n    \nQSpace Pro is the best Finder alternative I tested in terms of the interface customizations you get access to: You can tailor to a fine level of detail, though the default look isn't all that different from Finder. You can have up to four different system locations on view at once, with the panels arranged in a variety of different ways, and jumping between these layouts is easily done.After a short while using QSpace Pro I definitely felt I was better able to get around my Mac more efficiently, and when you've got a lot to do on your system, that really helps. Copying, moving, searching, deleting, tagging, and previewing is all intuitively and simply done, and you can easily hide parts of the interface if you know you won't need them.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe wealth of settings available in QSpace Pro is a testament to how much you can do with this: Keyboard shortcuts, the context menu, new file creation, batch operations, folder syncing, iCloud links, and app launching can all be customized, and those are just some of the options available. It's like Finder, but with a lot more going on.QSpace Pro isn't free, however: Its features cost a one-off fee of $27.99 via the Mac App Store (or $29.99 via a direct download), though at the time of writing, those prices are down to $12.99 and $13.99, respectively. If you go through the QSpace Pro website, you can test the software out for 30 days for free before buying.\n            \n                What do you think so far?\n            \n        \nPath Finder\n    \n            \n            \n                                        Credit: Lifehacker\n                    \n    \nPath Finder is one of the Finder alternatives that's been around the longest, and I think it's the one I'm actually going to switch to permanently. It's absolutely packed with features and options to play around with, and if you spend a little time getting it set up the way you want it, it should seriously speed up all your file operations.There are a choice of different layouts to pick from, including a dual-pane layout that makes moving and copying more straightforward, and I very much appreciate the \"stacking\" approach that lets you pile up several files and folders in a temporary holding pane first, before you do anything with them.Batch file operations are supported, as are synced folders, so you can merge and compare two folders on your system as required. There's also extensive use of bookmarks and tab presets, so that you can quickly jump to the places on your Mac system that you need to visit the most—something that isn't always simple to do in Finder.The visual representations of how much space files and folders are taking up on disk is very handy, and so is the Dropbox integration (with Dropbox being my go-to cloud storage option). Admittedly it's not the most visually appealing of the software packages listed here, but that's not necessarily the most important thing in a file manager, and it adds all the features I didn't know I'd been missing from Finder.Path Finder is $29.99 for the year, but there's a 30-day trial available. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I Tested Three macOS Finder Alternatives, and This Is the Best One",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDN90GDF262G1P75HTFFF3A0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-29T16:30:00.000Z",
      "dateModified": "2025-12-29T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "3 New Year’s Resolutions for Your Dog",
    "url": "https://lifehacker.com/ad/food-drink/3-new-years-resolutions-for-your-dog?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KD3DX0RD5EDWS7M3X8J7RGTA/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-29T15:25:41.000Z",
    "description": "Deal pricing and availability subject to change after time of publication.\n    \n        \n        New Year’s resolutions are all about improving oursel",
    "body": "Deal pricing and availability subject to change after time of publication.\n    \n        \n        New Year’s resolutions are all about improving ourselves, right? The same goes for your best buddy—your dog. While your dog can’t physically tell you what they need to feel their best, there are simple things you can do to help set them up for success. Right now, you can save 50% off your first box of human-grade The Farmer’s Dog pet food, so that’s a great start. Check out these pup-centric resolutions and help keep their tail wagging into 2026—and for years to come. \nMake the switch to fresh dog foodSay goodbye to kibble this year by getting a subscription to The Farmer’s Dog. A new study from the company shows that fresh food can support healthier aging in dogs—and who doesn’t want more good years with their pup? The Farmer’s Dog makes fresh dog food that’s formulated by on-staff board-certified veterinary nutritionists. Each batch is made from gently cooked meats and vegetables, has no added fillers or preservatives, and is quickly frozen to lock in nutrients. It’s then shipped to your door while it’s still fresh. Sign up and The Farmer’s Dog will create a personalized plan with portions that meet your pup’s unique nutritional and caloric needs. Considering nearly 60% of dogs are overweight, these portions can support a healthy lifestyle. \n            \n                What do you think so far?\n            \n        \nBrush your dog’s teeth Over 80% of dogs will get some form of dental disease in their lifetime. To tackle that stinky dog breath and protect their chompers, you’ll need a toothbrush designed for dogs and doggie toothpaste that has your vet’s approval. (Never use human toothpaste on your pup, as it can be toxic for dogs.) Start by putting doggie toothpaste on your finger and letting your pup lick it off to get them used to having your finger in their mouth. Eventually, replace your finger with the toothbrush.Teach your dog some new tricksWhile daily walks with your dog are key for physical fitness (for both you and your pup), training your dog is a fantastic way to provide them with intellectual stimulation. Teach your dog to sit or some ‘Gram-worthy tricks like playing Bach on the piano, as long as you give them positive affirmation, your pet will feel like the good dog they are. When you’re making resolutions this year, don’t forget about your pup. Subscribe to The Farmer’s Dog today and save 50% off your first box of human-grade pet food—and keep the wag-worthy vibes going all year.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "3 New Year’s Resolutions for Your Dog",
      "image": [
        "https://lifehacker.com/imagery/articles/01KD3DX0RD5EDWS7M3X8J7RGTA/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-29T15:25:41.000Z",
      "dateModified": "2025-12-29T15:25:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This 'Gift Card Draining' Scam Wants to Steal Your Christmas Money",
    "url": "https://lifehacker.com/money/gift-card-draining-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDNNQDDQRV3PT352ZAP9NNQP/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-30T14:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Credit: Zooey Liao/Lifehacker/Getty Images\n                           ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            Bad websites claiming to show you your gift card balance are actually collecting that information for later.\n                                            Other scam sites may offer to pay you for gift cards that you don't want or won't use.\n                                            Always use the official gift card site listed on the back of your card, or call or visit the retailer directly.\n                                    \n            \n    Table of Contents\n    \n        \n        If you received gift cards over the holidays, don't throw them in a drawer and forget about them. While many gift card scams involve thieves demanding payments—for everything from taxes and fines owed to outstanding utility bills—via prepaid cards, there's a less obvious type of fraud known as gift card draining. How gift card draining scams workIf you forget how much money is on a gift card you received a while ago, you're likely to check the balance online. You'll typically need to enter your card number and PIN or security code, but some websites that claim to provide gift card balances are actually collecting that information to use it later. Always use the official site listed on the back of your card, or better yet, call or visit the retailer directly to confirm the balance. In another version of this scam, fraudsters have set up sites offering to pay you for gift cards you don't want or won't use. They may claim to purchase your $100 card for $90—which sounds better than no money at all—but are simply out to steal the card information and drain the funds, and you'll never actually see that cash. Sites promoting that type of deal are typically not legitimate. When you purchase or receive a gift card, keep the receipt, note the starting balance, and register it with the retailer or transfer the funds from the gift card to your existing account if those options are available. If possible, change the PIN, and spend the funds sooner rather than later. Gift card scams begin in the storeIf you're considering buying physical gift cards in the future, be sure to check for signs of a scam. Fraudsters will tamper with cards in stores by adding stickers over the barcode, so when you check out, the funds you pay go to their account rather than the card itself, which means the balance will be zero when the recipient goes to spend it. Scammers can also record the card number and activation PIN or security code, then reseal the packaging and replace the card on the rack—once the card is paid for or activated, they use the information to spend the funds. \n            \n                What do you think so far?\n            \n        \nInspect gift cards purchased in-store carefully for added stickers, damage to the packaging, or scratch-off coating that has been removed. You can avoid some risk by purchasing gift cards online directly from the merchant's website (as gift cards sold at steep discounts on social media or deal sites are often scams). And if you do end up with a scam card, you can file a report with the gift card issuer, though your mileage may vary in terms of recovering funds. The Federal Trade Commission (FTC) has a list of fraud contacts for some of the most popular card retailers, including American Express, Visa, and Amazon. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This 'Gift Card Draining' Scam Wants to Steal Your Christmas Money",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDNNQDDQRV3PT352ZAP9NNQP/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-30T14:00:00.000Z",
      "dateModified": "2025-12-30T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "When Clearing Out Your Inbox, Trying Sorting It by Sender",
    "url": "https://lifehacker.com/sort-email-by-sender-when-clearing-out-inbox?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GX8ANP37Z4CNPP28PZDKB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-23T13:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: verona studio - Shutterstock\n                            \n    Table of Contents",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: verona studio - Shutterstock\n                            \n    Table of Contents\n    \n        \n        There are a lot of methods to try in the never-ending quest for a way to sort through and slim down our bulging inboxes. They're different enough that there's certainly one out there that matches or comes close to matching your exact needs, but they do all have one thing in common: They rely on the chronology of when each email came in. Let’s try turning that approach on its head, and instead, sort by sender to weed through the mess.Why you should sort your inbox by senderWhen purging your messages, you probably have an organizational system you follow, like the 4Ds. You go through and decide what gets deleted, done, delegated, or deferred—but there’s not much pattern recognition if you’re just starting at the top and working your way down. Every day's demands or outreach might look different depending on what you have going on at that time. Sorting your inbox by sender instead of most recent helps you see whose (or what) messages you receive most. If it’s a newsletter or mailing list, you can delete them all in one go, but if it’s a specific person at work, you might get a signal that they tend to need a response from you. From there, you can prioritize their emails, maybe adding them as a favorite contact or paying special attention for new correspondence from them, since you know their messages are more consequential than others. Even if you're using the one- or two-touch methods, which call on you to open every single email the moment you get it, this can be helpful because you'll feel a sense of urgency around specific senders once you identify the patterns. So instead of deleting or delegating emails one by one, you can try nuking or dealing with entire batches from certain senders to make the sorting process faster. How to sort by sender in GmailIn Gmail, if you’ve already found a message from the person or entity whose emails you want to bundle up, you can right-click it from your inbox and hit “find emails from.” This brings you to an inbox only of messages from that sender. You can also access this inbox by typing “from:[their email address]” in the search bar, or clicking the advanced search button  and entering their name into the “from” field.\n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nUnfortunately, you can’t sort your entire Gmail inbox by sender, and instead can only make bundles sender by sender, but it still helps with batching them up.\n            \n                What do you think so far?\n            \n        \nHow to sort by sender in OutlookOutlook is better than Gmail for this method. In fact, it allows you to sort your entire inbox not only by sender, but by other recipients, size, and more.At the top of the inbox, hit “Filter,” then “Sort by.” Depending on what version you’re running, you may have to go into the “View” tab and hit “From” in the Arrangement group. The emails will line up in your inbox by sender, making them easy to bundle and delete.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "When Clearing Out Your Inbox, Trying Sorting It by Sender",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GX8ANP37Z4CNPP28PZDKB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-23T13:30:00.000Z",
      "dateModified": "2025-12-23T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Ray-Ban Meta Smart Glasses Are 25% Off Right Now",
    "url": "https://lifehacker.com/tech/ray-ban-meta-glasses-sale-december-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDSPA16RPMY2T450DD4GHGK2/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-31T14:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Smart glasses have promised convenience for years, but few have felt practical enough to wear daily. The Ray-Ban Meta Smart Glasses (Gen 1) come closer by keeping things familiar. They look like classic Wayfarers, not a tech experiment, which lowers the barrier right away. Right now, they’re also easier to justify on price. The matte black version with polarized lenses is 25% off at $246.75, down from $329, which is the lowest price so far, according to price trackers. A glossy black version with clear lenses costs less at $224.25 if you don’t need sun protection. \nThe real test is whether they fit into your routine without getting in the way. At 49 grams, they’re a bit heavier than standard Ray-Bans, and if you use prescription lenses, you’ll feel that extra weight after a while. In short bursts, though, they’re easy to live with. Tapping the frame to snap a photo or record 1080p video feels natural when your phone is in your pocket or bag. The 12 MP ultra-wide camera captures a lot of what’s in front of you and handles movement well enough for walks or events. That said, everything is recorded vertically, which should work fine for social media but limits what you can do with the footage later. \n            \n                What do you think so far?\n            \n        \nMeta AI is where these glasses either win you over or leave you cold. You can ask simple questions, send texts, manage music, or use live language translation that keeps up with real conversations (which is genuinely helpful when traveling, as noted by our senior staff writer in his review), but these won’t book trips or handle complicated requests. Also, its open-ear speakers let you listen to music or take calls while staying aware of traffic and people around you. That trade-off favors awareness over audio quality, which makes sense for everyday use. The potential downside is its battery life, which lasts about four hours, with the case adding up to eight more charges, so you’ll need to think about charging if you plan to wear them all day.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Ray-Ban Meta Smart Glasses Are 25% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDSPA16RPMY2T450DD4GHGK2/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-31T14:00:00.000Z",
      "dateModified": "2025-12-31T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "My Favorite Amazon Deal of the Day: The Bose QuietComfort Ultra Headphones",
    "url": "https://lifehacker.com/tech/bose-quiet-comfort-ultra-headphones-sale?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01J53PP0FREJA44ZMEM9FQ7K5Z/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-29T18:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit:  Illustration by Ian Moore and product image courtesy of Amazon.\n                            \n    Table of Contents\n    \n        \n        When it comes to buying the best headphones at the best price, the Bose QuietComfort Ultra is at the top of the list for active noise-cancelling (ANC) right now, while also excelling in other important categories. Right now, the Bose QuietComfort Ultras (in the \"deep plum\" color) are $269.99 (originally $429), a record-low price according to price-tracking tools. The other colors are also discounted but not quite as steeply—for example, you can get \"white smoke\" for $299 or \"Lunar Blue\" for $349.\nFew other brands can compete with Bose's QuietComfort Ultra lineup when it comes to ANC. Apart from the headphone model, they also make some of the best ANC earbuds, both using the same tech. PCMag's \"outstanding\" review goes into detail on how the headphones do the best job at dialing back low-frequency rumbles, as well as lows and mids. Despite those plaudits, they're not perfect: Some high-frequency sounds still make it through the ANC technology (that's the case for all ANC headphones, though). But these headphones performed better at ANC than their other two main competitors at the time of their respective release, Apple AirPods Max and the Sony WH-1000XM5. Of course, the new Sony WH-1000XM6 has new ANC technology that outshines the QuietComfort Ultra, but you'd be paying a premium for those.The Bose QuietComfort Ultra headphones launched in the fall of 2023 with many reviewers praising their overall quality, but earning complaints for their pricing, at almost half a grand. At their current discounted price, there is no better value for your money if you value top-tier ANC. Another great feature of the headphones is their transparency mode, meant to be used to allow you to better hear your surroundings (cars, bikes, or people around you) while wearing them.\n            \n                What do you think so far?\n            \n        \nYou can expect about 24 hours of juice with a full charge, or about 18 hours if you're using ANC. The accompanying app has a well-designed, customizable EQ.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "My Favorite Amazon Deal of the Day: The Bose QuietComfort Ultra Headphones",
      "image": [
        "https://lifehacker.com/imagery/articles/01J53PP0FREJA44ZMEM9FQ7K5Z/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-29T18:00:00.000Z",
      "dateModified": "2025-12-29T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]