[
  {
    "title": "CES 2026: This Accessory Can Turn Your MacBook’s Display Into a Touchscreen",
    "url": "https://lifehacker.com/tech/this-accessory-turns-your-macbook-display-into-a-touchscreen-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KECJZHYKZXDK8DSY00KQED53/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T16:30:07.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 7, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Intricuit\n                            \n    Table of Contents\n    \n        \n        Plenty of people have been asking for a MacBook with a touchscreen display, and now that is possible with the Intricuit Magic Screen, according to an announcement at CES 2026. It's a snap-on accessory that attaches to your MacBook's display, and uses one of the USB-C ports on the laptop for power. Once connected, you can touch the Magic Screen and your input will be registered on the Mac.The good news is that this product ships with a stylus, which will make it a lot easier to interact with different Mac apps. When you tap something on your iPhone or iPad, the UI takes into account the fact that your fingers are a lot thicker than a mouse pointer. On the Mac, the default input is the mouse cursor, so the Magic Screen's stylus is better suited to those interactions than using your fingers. Having said that, you can use your fingers with this touchscreen accessory too.Keep in mind that using a snap-on touchscreen accessory has a few caveats. The first is that you can't quickly close your MacBook's lid when the Magic Screen is attached. The company has added a thick piece of plastic to the base of the accessory. This part rests just above your MacBook's keyboard and it'll stop you from accidentally closing your laptop's lid with the Magic Screen attached. This ensures that you won't accidentally damage your laptop'd display by slamming the lid shut when the accessory is attached.\nIt also means that you'll always have to unplug the Magic Screen when you're not using the Mac, which can be a bit annoying. Intricuit says it also works in pen tablet mode, so you can place the Magic Screen on your desk and use your stylus to draw something or to control the Mac. This accessory's battery will last up to 100 hours on a single charge, the company claims.\n            \n                What do you think so far?\n            \n        \nIntricuit announced this product at CES 2026 and said the Magic Screen will be on Kickstarter soon at a launch price of $139. The company says it expects to start shipping the product in the first quarter of 2026. It currently supports the 16-inch M-series MacBook Pro, 14-inch M-series MacBook Pro, 15-inch M-series MacBook Air, and 13-inch M-series MacBook Air models. You'll just need to choose the correct variant for your laptop while placing the order.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: This Accessory Can Turn Your MacBook’s Display Into a Touchscreen",
      "image": [
        "https://lifehacker.com/imagery/articles/01KECJZHYKZXDK8DSY00KQED53/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T16:30:07.000Z",
      "dateModified": "2026-01-07T16:30:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google's Getting Rid of a Way to Import Third-Party Accounts Into Gmail",
    "url": "https://lifehacker.com/tech/gmail-ending-pop3-support-email-importing?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFPNQA250RDQZVEXF1CWENH/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T21:30:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Ascannio / Shutterstock\n                            \n            \n    ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Ascannio / Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is removing support for the POP3 protocol, which allows users to sync emails from third-party accounts into Gmail.\n                                            POP3 is an older standard of syncing emails, so it's not surprising that Google's disallowing it.\n                                            There are a couple of other ways to make sure you can still import emails from other accounts into Gmail., such as email forwarding and IMAP.\n                                    \n            \n    Table of Contents\n    \n        \n        If you've been running several email accounts through your Gmail, you might want to double-check your settings this month—that's because Google is ending support for the POP3 protocol that can sync emails from third-party accounts. And while there are some other solutions, they don't work quite the same.POP3 is an older standard of syncing emails between multiple accounts that allowed users to import emails from a third-party account and manage them in one spot. It's also a less secure method of transferring emails, so it's not a total surprise that Google is phasing it out, but the company hasn't broadcast the change too loudly, so it might come as a surprise to some users.How to keep your third-party accounts working in GmailIf you're still using POP3 to fetch your emails from a third-party account, there are a couple of ways to fix it before Google pulls the plug:\nForward emails from your other accounts. Rather than having Gmail reach out to your third-party accounts, you can set up automatic forwarding on the other end. How to do this will depend on which email providers you use, so check your third-party account settings for forwarding options.Use IMAP to check your email from the Gmail apps. In the Gmail app for Android and iOS, you can log into third-party email accounts that support IMAP connections.The IMAP protocol works a bit differently than POP3. While POP3 would import messages into your Gmail but leave the original, IMAP syncs between your accounts. So if you use the Gmail app to check your email and delete some messages, they'll be gone if you check the original account later.\n            \n                What do you think so far?\n            \n        \nGoogle's support doc says this change will take effect \"Starting January 2026\" with no more specific time frame. At time of writing, POP3 support is still working on my own email accounts, so it's not disabled just yet, but it's a good idea to update your email setup sooner rather than later.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google's Getting Rid of a Way to Import Third-Party Accounts Into Gmail",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFPNQA250RDQZVEXF1CWENH/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T21:30:00.000Z",
      "dateModified": "2026-01-08T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Delete 'Bloatware' From Your Android (and Why You Should)",
    "url": "https://lifehacker.com/tech/delete-bloatware-from-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEHZX6P8BKAS9C0QZX82B0DT/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-09T19:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: rblfmr / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Any new phone almost certainly comes with a handful of preinstalled apps you'll never use, regardless of which manufacturer you buy from or which operating system you're on. Some devices are more bloated than others: Google Pixels have a relatively \"clean\" build compared to Samsung phones, for example, and don't typically come with third-party apps and games. But you may still want to eliminate apps and features that clutter your home screen, take up valuable space, and create a drag on performance, especially if you have alternatives you like more. On Android, that likely means uninstalling what you easily can and disabling everything else. What you can (and can't) uninstall on AndroidUnfortunately, many preinstalled first-party apps can't be easily removed. This varies by manufacturer and device—for example, Pixel users can uninstall Google Play Games and Books but are stuck with Chrome, Drive, Maps, and Calculator. As HowToGeek points out, you can delete other pre-selected Google apps added during initial setup, such as the Pixel Watch app and NotebookLM. \nOn Samsung Galaxy phones, again, some preinstalled bloatware is locked in, but ZDNET calls out five native apps that most users should delete right away: Global Goals, Samsung Free, Samsung TV Plus, Samsung Shop, and Samsung Kids. To uninstall an app on your Pixel, go to the Google Play Store and tap the Profile icon. Tap Manage apps & devices > Manage, select the app you want to remove, and tap Uninstall. On Samsung, go to Settings > Apps, tap the app name, and tap Uninstall > OK. You can also touch and hold the app icon on your home screen and tap or drag to uninstall. \n            \n                What do you think so far?\n            \n        \nIf you're absolutely set on removing preinstalled apps that can't be deleted using the above steps, you can use the Android Debug Bridge (ADB), but these methods are more advanced. How to disable preinstalled appsBuilt-in apps that aren't in use can be disabled, which hides the icon from your app drawer. They'll still take up space, but at least they'll be out of sight. Most preinstalled apps can be disabled if you don't need them, with the exception of critical system apps. On your Pixel, go to Settings > Apps > See all apps to select individual apps, and tap Disable at the top of the screen. You can hide preinstalled Samsung apps from your home screen settings: tap Hide apps and tap the icon of the apps you want to disable, the press Done. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Delete 'Bloatware' From Your Android (and Why You Should)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEHZX6P8BKAS9C0QZX82B0DT/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-09T19:30:00.000Z",
      "dateModified": "2026-01-09T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "My Favorite Amazon Deal of the Day: The AirPods Pro 3",
    "url": "https://lifehacker.com/tech/airpods-pro-3-deal-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFGV810HZDZJX0870BHJ3X4/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T19:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                            \n        \n            Daniel Oropeza\n                \n                                            Staff Writer\n                                    \n            \n            \n        \n            ExperienceDaniel is a Staff Writer for Lifehacker. He served in the U.S. Navy, where he reached the rank of Petty Officer 3rd Class as a Logistic Specialist and was awarded a Navy Community Service Medal and Navy Letter of Commendation for his exemplary service aboard the USS Theodore Roosevelt aircraft carrier. He earned his bachelor's in Environmental Science from the University of California, Davis, and earned his master’s degree from the Columbia University Graduate School of Journalism. Daniel was a business reporter for the Miami Herald before joining Lifehacker. He lives in Atlanta, GA.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 8, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Ian Moore and product image courtesy of Amazon.\n                            \n    Table of Contents\n    \n        \n        The latest AirPods Pro are a big step up from the first-generation buds. The third (and newest) generation comes with OTA updates that the AirPods Pro 2 also get to enjoy—but considering the second and third generations are the same price right now, why not go with the newer version? The AirPods Pro 3 are down to $199 (originally $249.99), which they briefly hit back in December during the holiday sales—the lowest price yet, according to price tracking tools.\nThe AirPods Pro 3 improve on already great premium earbuds with new features (like a heart rate sensor) without increasing the list price. You'll get Personalized Spatial Audio (so you can hear sounds seemingly coming from different directions as you move your head) and the ability to use head gestures to tell Siri \"yes\" or \"no\" (this also works for answering or denying calls). Apple added a live translation feature to both the second- and third-generation AirPods Pro when iOS 26 rolled out earlier this year. You'll also get features like Conversation Awareness, which lowers your music volume when your AirPods detect that you're talking to someone; Transparency Mode, which lets you better hear your surroundings while your earbuds are in; and Adaptive Audio, which combines ANC and Transparency mode to adjust ANC levels based on the noise around you.\n            \n                What do you think so far?\n            \n        \nSince these are in-ear earbuds (as supposed to regular earbuds like the AirPods 4) the ANC is much better since it naturally blocks out the noise with a tight seal, but the ANC technology itself has also improved—as has the sound quality, thanks to the new H3 chip, as PCMag detailed in its \"exemplary\" review, calling them the best earbuds your money can buy. You can expect about eight hours of juice, depending on your usage, and another 24 hours from the charging case. \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "My Favorite Amazon Deal of the Day: The AirPods Pro 3",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFGV810HZDZJX0870BHJ3X4/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T19:30:00.000Z",
      "dateModified": "2026-01-08T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How 'Cognitive Overload' Might Be Hampering Your Productivity",
    "url": "https://lifehacker.com/work/cognitive-overload-productivity?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KECWK3SPCSZMK1Z0TKW52G0G/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T20:00:00.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Lindsey Ellefson\n                          ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Lindsey Ellefson\n                            \n        \n            Lindsey Ellefson\n                \n                                            Features Editor\n                                    \n            \n            \n        \n            ExperienceLindsey Ellefson is Lifehacker’s Features Editor. She currently covers study and productivity hacks, as well as household and digital decluttering, and oversees the freelancers on the sex and relationships beat. She spent most of her pre-Lifehacker career covering media and politics for outlets like Us Weekly, CNN, The Daily Dot, Mashable, Glamour, and InStyle. In recent years, her freelancing has focused on drug use and the overdose crisis, with pieces appearing in Vanity Fair, WIRED, The New Republic, The Daily Beast, and more. Her story for BuzzFeed News won the 2022 American Journalism Online award for Best Debunking of Fake News.In addition to her journalism, Lindsey recently graduated from the NYU School of Global Public Health with her Master of Public Health after conducting research on media bias in reporting on substance use with the Opioid Policy Institute’s Reporting on Addiction initiative. She is also a Schwinn-certified spin class teacher and won the 2023 Dunkin’ Donuts Butter PeContest that earned her a year of free coffee. Lindsey lives in New York, NY.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 7, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images / Shutterstock\n                            \n    Table of Contents\n    \n        \n        I write a lot about productivity, which means I also read a lot about it. Over the last few months, I've noticed an uptick in people discussing something called \"cognitive overload,\" citing it as a potential reason for a decline in output. The phrase stuck out to me as one of those buzzy terms that has the potential to be overused until it's meaningless—but at its core, it certainly has a real, clear definition that can be helpful tool in maximizing productivity. Basically, cognitive overload is what happens when you're inundated with more information than your brain can process, so your brain just gives up altogether, making hard to focus on anything at all. Here's what to know about it and what to do once you identify it. What causes cognitive overload?You know all those jokes on social media about how a single news item or food product from modern times would kill a person born just a few centuries ago? They're funny and hyperbolic, but they're grounded in the fact that while the ways in which we produce things and share information have advanced wildly, the human brain has basically remained the same. We say it all the time but it bears repeating: We're just not cut out to handle the onslaught of stimuli we get on a daily basis.\nThink of how many times your phone lights up on a given day. I just checked my screentime app and discovered that though it's only early afternoon, I've gotten 150 notifications straight to my lock screen already today. It's only Wednesday, so I'm averaging 213 a day, which my phone assures me is down 20% from last week and I'm quite sure I'll pick back up by the time Sunday rolls around. Considering that a few months ago, I redid all my phone settings so not all of my notifications got blasted to my lock screen, this is concerning. That's just a lot of information to constantly see. As it turns out, text-based info is the main cause of cognitive overload, at least according to one study. Emails, Slack and Teams messages, texts, calendar notifications—the never-ending stream of these bad boys is a major contributor to the overall feeling of being unable to process or do anything. If you think about an average day when you've felt too zapped to work, it probably included plenty of those. Audio-visual stimuli are less debilitating, according to the study, so a Zoom or phone call or a manager stopping by your desk may not trip you up as badly. \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nBeyond feeling like you can't even think straight or like you're too overwhelmed to take action on any one task, you may be able to recognize cognitive overload from other signs. If incoming messages make you feel frustrated or detached, for instance, no matter what they say, this could be happening to you. That's actually the symptom I experience most often, for what it's worth. When I'm overwhelmed by too much information, I find myself thinking, \"What do you want?!\" every time my phone lights up, before I even see who is reaching out. (Sorry, Mom.) \n            \n                What do you think so far?\n            \n        \nHow I'm battling cognitive overloadAs I was going through the study and thinking over cognitive overload, I realized I've already been implementing a few tricks that may have been helping me avoid it. As mentioned above, I banned my least-used apps from sending me notifications a few months ago. For years, I've also tinkered with my MacBook settings so I don't get any form of push notification on my computer. My phone is next to me at all times; there's no good reason for the top right corner of my laptop screen to be whacking me with the same notifications the phone is already showing me. A few other tried-and-true productivity approaches came to mind for me once I got a good grasp of what cognitive overload actually is. The one-touch rule of inbox management could be useful for you if you find that messages get you worked up. With that, you open each message as you get it and make an instant decision about what to do with the contents. It might seem counterintuitive to face each incoming message head-on if you're trying to avoid feeling burned out by the sheer volume of them, but I've found that when I see a message preview at the top of my screen and do nothing about it, it nags at me all day. Addressing it instantly helps me clear my mind and keep working. Otherwise, the way you go about battling this is going to be pretty subjective, although I do have one more recommendation: If you're not familiar with the Pomodoro technique, get familiar now. With it, you work for a set amount of time (usually 25 minutes) before taking a small break (usually five). When you're in those focus sessions, you should be completely distraction-free, putting your devices in Do Not Disturb mode or even using specialized apps to block other, distracting apps. Knowing you have to work seriously for a certain amount of time can help get you in the zone and push you away from information and decision paralysis while knowing you eventually get a break can help you stay relaxed as you go. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How 'Cognitive Overload' Might Be Hampering Your Productivity",
      "image": [
        "https://lifehacker.com/imagery/articles/01KECWK3SPCSZMK1Z0TKW52G0G/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T20:00:00.000Z",
      "dateModified": "2026-01-07T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use RICE to Prioritize Your To-Dos",
    "url": "https://lifehacker.com/work/rice-productivity-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFJR3ZWQH0A6B699J70YS00/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T20:30:00.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Lindsey Ellefson\n                          ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Lindsey Ellefson\n                            \n        \n            Lindsey Ellefson\n                \n                                            Features Editor\n                                    \n            \n            \n        \n            ExperienceLindsey Ellefson is Lifehacker’s Features Editor. She currently covers study and productivity hacks, as well as household and digital decluttering, and oversees the freelancers on the sex and relationships beat. She spent most of her pre-Lifehacker career covering media and politics for outlets like Us Weekly, CNN, The Daily Dot, Mashable, Glamour, and InStyle. In recent years, her freelancing has focused on drug use and the overdose crisis, with pieces appearing in Vanity Fair, WIRED, The New Republic, The Daily Beast, and more. Her story for BuzzFeed News won the 2022 American Journalism Online award for Best Debunking of Fake News.In addition to her journalism, Lindsey recently graduated from the NYU School of Global Public Health with her Master of Public Health after conducting research on media bias in reporting on substance use with the Opioid Policy Institute’s Reporting on Addiction initiative. She is also a Schwinn-certified spin class teacher and won the 2023 Dunkin’ Donuts Butter PeContest that earned her a year of free coffee. Lindsey lives in New York, NY.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 8, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Kaspars Grinvalds / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Whenever you have a bunch of looming tasks—as many of us do at the start of the new year, when everyone actually \"circles back\" on the things we've been putting off—having a structured to-do list is an essential part of getting everything done. Determining what goes on that list and in what order, though, is a task all its own. I've covered a lot of ways to do that, but if you're stuck with a high volume of important responsibilities, you need an approach that matches the complexity of what you're trying to do—and that's where the RICE method comes into play.What is the RICE method of prioritization?RICE, as you probably guessed, is an acronym. Here's what it stands for: Reach: How many people or parts of your life or project this task will impactImpact: How meaningful that impact will be if and when it's done correctlyConfidence: How sure you are about your estimates of the other three factorsEffort: The time, energy, knowledge, and resources requiredA unique combination of those factors is going to give you guidance on which tasks are the most crucial to prioritize, which is helpful when you're overloaded by information and dread, unable to think about when or where to get started. \nHow and when to use RICEI won't lie to you: This method is more convoluted than some of the others I've covered in the past. I might even recommend trying a simpler prioritization technique, like the Eisenhower matrix, before you try this one and only whip this out if Eisenhower or its peers aren't given you solid results. RICE takes a little time—and that's because you need to do some math. \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nStart by writing down all your tasks. Under each, you're assigning numbers. The Reach score will be the number of people or parts of your life or project that the task will impact and the Impact score is a 3 (massive impact), 2 (high), 1 (medium), .5 (low), or .25 (minimal impact). Confidence should be a 100, 80, or 50, to represent the percentage of confidence you feel in your estimates and abilities. You can use any number between 0 and 100, but falling back on those three just makes it easier. Most adherents of this method use a complicated math equation (determining \"person-months\") for Effort, but I'm going to simplify that for you. Score it the same way you scored Impact, with a 3 for multiple days or resources, 2 for a day, 1 for half a day, .5 for an hour, and .25 for a half an hour or less. You can also score Reach that way if you're working on a personal project and your results won't necessarily reach a big number of people. In that case, think about the different areas of your life or personal goals it will affect and use that 3-to-.25 scale. \n            \n                What do you think so far?\n            \n        \nThat part is all subjective, similar to using the ABCDE method to assign grades to your to-dos. It can't be avoided—you won't know the true resources required or reach of the project until it's done—but you can quantify it a bit. Next, you do math. It's R x I x C divided by E. You'll end up with a numerical score for each task. Rank the tasks in descending order, with the biggest numbers first. Obviously, you may find that some can't be completed until others are done, so use your discretion there, but for the most part, you've just created a clear outline of which things will have the biggest impact and reach and you can at least know where to start. Add each into your calendar using time boxing and time blocking, then get after it. Knowing you have a plan of attack is half the motivational battle.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use RICE to Prioritize Your To-Dos",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFJR3ZWQH0A6B699J70YS00/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T20:30:00.000Z",
      "dateModified": "2026-01-08T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Stylish Marshall Headphones Are $100 Off Right Now",
    "url": "https://lifehacker.com/tech/marshall-iii-headphones-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEHK89GBWKVY5XPEGZN36WDH/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-09T17:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Marshall/Lifehacker \n                            \n    Table of Contents\n    \n        \n        The ANC headphones from Sony and Bose are great, but they look like gadgets, not music gear. Luckily, Marshall is offering these Monitor III ANC earbuds, which offer a cool retro look. And right now, they're available for the lowest price ever, at $279.99 (down from $379.99), beating the heavyweights from Sony and Bose on price.\nThese Monitor III headphones feature the iconic Marshall script logo, a retro brass control knob (instead of touch buttons), and a textured black vinyl finish that mimics Marshall guitar amps. Other than the looks, the most impressive part is the battery life. These will last you for 70 hours of ANC playback (and 100 hours without ANC). That is a staggering number; for comparison, the Sony XM6 gets you 30-40 hours of playback per charge. The headphones are also collapsible, folding into a small ball. They come with a hard-shell travel case and are pretty lightweight, too, at 250 grams. There is no 3.5mm headphone jack here, but the box does include a USB-C to 3.5mm cable for wired listening.They feature the signature Marshall sound, warm and punchy. They are tuned for listening to rock, heavy metal and guitar-heavy music, and offer a more fun sound profile compared to Sony or Bose, which can sound a bit more flat or balanced.\n            \n                What do you think so far?\n            \n        \nIn its review, PCMag gave the Monitor IIIs a 4.0 star rating, noting that they deliver a \"pleasing audio signature, a comfortable fit with intuitive controls, easy portability, and excellent battery life.\" \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Stylish Marshall Headphones Are $100 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEHK89GBWKVY5XPEGZN36WDH/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-09T17:00:00.000Z",
      "dateModified": "2026-01-09T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why I Won't Be Giving ChatGPT Health My Medical Records",
    "url": "https://lifehacker.com/tech/dont-give-chatgpt-health-your-medical-records?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFGNJDCMT3JTWC4A7YNJXZ3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T20:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: OpenAI\n                            \n            \n                Key T",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: OpenAI\n                            \n            \n                Key Takeaways\n                                            ChatGPT Health is a sandboxed tab for conversations about your health, including medical records.\n                                            OpenAI says it's \"not intended for diagnosis or treatment.\"\n                                            LLMs' unreliability, as well as privacy and security concerns, mean using ChatGPT Health might be unwise.\n                                    \n            \n    Table of Contents\n    \n        \n        This week, OpenAI announced its new ChatGPT Health feature, which will let users upload their medical records and ask health related questions. However, I certainly won't be making use of it, it might not be the best idea for you to do it either, for both reliability and privacy reasons. The new ChatGPT Health feature will be a sandboxed tab inside the app that is isolated from your conversation history in other conversations with the chatbot. This tab also allows users to connect a variety of health-tracking apps like Apple Health, MyFitnessPal, and Peloton, as well as uploading medical records directly.\n    \n            \n            \n                                        Credit: OpenAI\n                    \n    \nIt's important to note that this is a lot of really personal information to hand over to any tech company—but especially one that isn't primarily focused on providing medical services. OpenAI says that the ChatGPT Health space operates with \"enhanced privacy to protect sensitive data,\" but it doesn't use end-to-end encryption to secure that data. And while the company says data collected via Health isn't used to train its foundation models, it's impossible to know whether that may change in the future. Security breaches can also occur (and have in the past), potentially leaving your medical records exposed.\nThere's also the question of whether the risk of uploading your data is worth it in the first place. According to OpenAI's own data, around 5% of all messages to ChatGPT are already users asking questions about their health, and ChatGPT (and other LLM tools) have a nasty habit of providing inaccurate diagnostic information. This is perhaps why OpenAI says that its new ChatGPT Health feature is \"not intended for diagnosis or treatment.\"\n            \n                What do you think so far?\n            \n        \nCurrently, there's a waitlist to sign up for ChatGPT Health, and over time it will roll out to all users. At the very least, that means that until the feature is available, it's probably a good idea not to ask the regular version of ChatGPT about your health concerns. At the very least, wait until the enhanced privacy sandbox is available. In the meantime, consider whether it makes more sense to just talk to your doctor directly if you have questions or concerns about your health.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why I Won't Be Giving ChatGPT Health My Medical Records",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFGNJDCMT3JTWC4A7YNJXZ3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T20:00:00.000Z",
      "dateModified": "2026-01-08T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Is the Best Firewall App for Mac I've Ever Used, and It's Free",
    "url": "https://lifehacker.com/tech/firewally-free-app-for-macos?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEJ4C3JQFF5DYWJYBKHXPS6A/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-09T20:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        Most people haven't actively managed a firewall in at least a decade, assuming they ever have. But keeping track of which applications are using the internet—and how much data they're using—is still useful at times, as is blocking apps from accessing the net entirely.While you're traveling, for example, internet access might be limited, so it's a good idea to cut off applications that constantly churn through data. But even while at home, it's a good security practice to review which applications are connecting to the internet. And while macOS comes with a firewall, it's not really a useful tool for that.Which is why I like FireWally. This totally free application, offered by the Ukraine-based indie Mac developers Nektony, isn't a tool for power users—it's streamlined and user friendly. Click the menu bar icon and you'll see a list of applications using the internet. You can see a summary of all traffic today, in the past hour, or monitor incoming traffic in real time.\nBeside every application is its data usage. You can see a breakdown of inbound and outbound traffic for any application by hovering the mouse over it. You can block any application from accessing the internet by toggling the switch.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nWhat if you don't recognize an application? I, traditionally, ended up copying the name of the application and pasting it into a search engine. FireWally tries to save you some time by providing AI-generated summaries of each application using Apple Intelligence (assuming your Mac supports that feature). It's a useful way to quickly remind yourself what a particular application is, or to identify one you don't recognize.It's a very streamlined application, but perfect for anyone hoping to understand a bit more about how much data their various Mac applications are using. Give it a spin if you're looking for a simple firewall application.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Is the Best Firewall App for Mac I've Ever Used, and It's Free",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEJ4C3JQFF5DYWJYBKHXPS6A/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-09T20:30:00.000Z",
      "dateModified": "2026-01-09T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube Now Lets You Filter Shorts Out of Search",
    "url": "https://lifehacker.com/tech/youtube-now-lets-you-filter-shorts-out-of-search?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEHWWQHE9MYVT1AMJZAFVWV8/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-09T18:30:01.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: 19 STUDIO/Shutterstock\n                            \n            \n                Key Takeaways\n                                            YouTube now officially lets you filter Shorts out of search.\n                                            When you search for something on YouTube, you can choose to only see long-form videos, and omit Shorts completely.\n                                            You have to set this filter each time you perform a search.\n                                            The change is part of a wider update to how YouTube's search filters work.\n                                    \n            \n    Table of Contents\n    \n        \n        Internet videos have always been addicting, but short-form content is a whole other beast. Whatever platform you watch them on, these brief clips pull you in and don't let go, and, before you know it, you've mindlessly scrolled through hours of videos, most of which you'll never remember watching. YouTube Shorts are no exception. But unlike TikTok or Instagram, short-form content is not the main source of videos on the platform. YouTube, of course, hosts long-form videos first and foremost, and is the sole reason why many of us visit the site or app. Shorts are just an afterthought, but an afterthought that YouTube pushes hard. You might hop on to watch a specific video, or check out new content from your subscriptions, but to do so, you'll have to push past rows of \"Shorts\" all vying for your attention. God help your afternoon if you accidentally click on one. If you like YouTube Shorts, please disregard. But for the rest of us that just want to find and watch standard videos on YouTube, there's now some respite: As part of a larger update to search filters and content discovery, YouTube is now allowing users to filter out Shorts in searches. The company is pitching this as a way to separate searches between either Shorts or traditional videos, but you'll never catch me searching specifically for Shorts. What YouTube has done here, at least for users like myself, is to create a way to exclude Shorts from any particular search. \nHow to remove YouTube Shorts from searchTo start, open YouTube and search for something. You should now see a series of options along the top of the display, one of which is \"Videos.\" Choose it, and you'll reload the search with only long-form videos. Huzzah. You can also do the same from the greater search filters settings: On desktop, when the results appear, select \"Filters\" in the top right then look for \"Type\" on the left of the \"Search filters\" pop-up window. On mobile, tap the three dots icon, then choose \"Search filters.\" On both platforms, you'll find the \"Videos\" option here.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nUnfortunately, this isn't something you can set and forget: You'll need to choose this option every time you search for something, which is definitely a bummer. That said, at least there's some way to filter Shorts out of a search—especially if those Shorts were impacting your ability to find what you were looking for in the first place. \n            \n                What do you think so far?\n            \n        \nYouTube might not ever let us disable Shorts completely, but there are tools to get around them. You can choose to limit how many Shorts you watch in any given day—though the guardrails aren't necessarily strict. The company also lets you tell them to show you fewer Shorts on the home page, but if that's not enough, you can also install an extension to block Shorts from your feeds.Other changes to YouTube filtersIn addition to this new Shorts filter, YouTube made some adjustments to filters and sorting options. \"Sort By\" is now known as \"Prioritize,\" and while YouTube doesn't say whether it changed the function, it does say the menu \"aims to maximize utility.\" The company also changed the \"View count\" sort option to \"Popularity.\" The menu still takes view count into consideration, but also watch time, to sort videos in a search by the algorithms' assumed popularity.    Finally, YouTube is removing the \"Upload Date - Last Hour\" and \"Sort by Rating\" options from search. The company says you can still find videos uploaded most recently from the \"Upload Date\" filters. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube Now Lets You Filter Shorts Out of Search",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEHWWQHE9MYVT1AMJZAFVWV8/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-09T18:30:01.000Z",
      "dateModified": "2026-01-09T18:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: You Can Chain 100 of These Ikea Bluetooth Speakers Together",
    "url": "https://lifehacker.com/tech/ces-2026-chain-up-to-100-ikeas-bluetooth-speakers-together?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KECNBP0N5XH5CM568DVVBBVS/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T18:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 7, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Ikea\n                            \n            \n                Key Takeaways\n                                            Ikea showed off the Kallsup Bluetooth speaker, which will cost just $10 in the U.S.\n                                            Ikea is claiming that you can chain up to 100 of them together.\n                                            This product is expected to ship in April 2026.\n                                    \n            \n    Table of Contents\n    \n        \n        At CES 2026, Swedish furniture giant Ikea showed off its new Kallsup Bluetooth speaker, which will cost just $10 in the U.S. Normally, I'd be skeptical of any speaker this cheap, but the Kallsup grabbed my attention for a few reasons—chief among them that Ikea says you can chain up to 100 of them together to create the multi-speaker setup of your dreams. That aside, the hardware seems pretty basic: The speaker has a USB-C port at the back, and two buttons up top (play/pause, and pair).Chaining together Bluetooth speakers is nothing new, but this is the first time I'm seeing the ability to pair as many as 100 of them. The only reason this use case is even remotely plausible is the pricing: As reported by The Verge, the Kallsup Bluetooth speaker will be priced at $10 in the U.S. and €5 (roughly $6) in Europe, which means you can buy 10 of them for the same price as one HomePod mini. The Verge also says  that once you pair one of them to your phone (the company promises Bluetooth 5.3 support), you can add more to the chain with a two-button sequence. \n            \n                What do you think so far?\n            \n        \nDesign-wise, the speakers are cubical and colorful, which I'm a fan of (at the moment, Ikea is showing them off  in white, green, and pink). But how do they sound? Well, Gizmodo says that while they are loud, they don't deliver much in the way of bass. I'd love to get a couple to judge for myself before committing to chaining a few dozen of them together, but I definitely  admire Ikea's big swing here. That said, while CES is the place to grab attention with out-there ideas, and I am struggling to find a use case for chaining 100 Bluetooth speakers together. Maybe if you're an amusement park owner and you want the cheapest possible audio setup for a haunted house? Likely most people will be content with a more reasonable number of them, spread around the house.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: You Can Chain 100 of These Ikea Bluetooth Speakers Together",
      "image": [
        "https://lifehacker.com/imagery/articles/01KECNBP0N5XH5CM568DVVBBVS/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T18:00:00.000Z",
      "dateModified": "2026-01-07T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Choose the Right VPN for You",
    "url": "https://lifehacker.com/tech/how-to-choose-the-right-vpn-for-you?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEC6X19FDSW9A9CDGB0RG4B0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-07T14:30:00.000Z",
    "description": "\n        \n        There are many good reasons to get a VPN (Virtual Private Network) app installed on your phone or laptop: They make it harder for an",
    "body": "\n        \n        There are many good reasons to get a VPN (Virtual Private Network) app installed on your phone or laptop: They make it harder for anyone else to track your browsing, they keep your data safe when you're on public wifi networks, and they even let you spoof your location so you can access geolocation-locked content.You'll also find plenty of choice when it comes to VPNs. Our own guides to the best paid VPNs and the best free VPNs show the wealth of impressive apps out there, and even when you narrow down the criteria, you've still got lots of options to pick from—see our recommendations for the best free VPNs for Android.So what exactly should you be looking for when it comes to choosing the right VPN for you? These are the features and selling points that you'll see mentioned when you're browsing VPN comparisons, and what they mean (and once you've built up a shortlist from these criteria, then you can look at the prices and extras).\nBrowsing speedOne of the downsides of loading up a VPN is that your browsing speed can suffer, while your data gets pinged around multiple servers across the globe. Ideally, you want all the protection that a VPN offers, without too much of a hit on download and upload rates (no matter how many other people are using the same VPN).Unfortunately, this isn't really something you can gauge just by looking at VPN listings and ads, as most VPNs will claim to be the fastest. Either read benchmark tests put together by publications and authors you trust (watch out for sponsored content), or make use of as many free trials as you can and do some testing yourself.Server locations\n    \n            \n            Even VPN service will tell you how many servers it has, and where they are.\n                                        Credit: ExpressVPN\n                    \n    \nYour VPN of choice needs to reroute your internet traffic somewhere, and how many servers a particular VPN has around the world can make a substantial difference to speed and availability. It's also going to determine where in the world you can pretend to be of course, if you want to jump to another country virtually.Broadly speaking, the more servers the better, though as with VPN speeds you may have to do some testing of your own to check reliability and transfer rates. Look for server locations close to you (for speed), and outside of heavily censored or surveilled countries (for privacy), and check any technical specs that are given for them.Split tunneling and kill switchesSomething else to look out for is split tunneling, or the ability to send only some of your internet traffic through a VPN. This means you get better speeds (and less security and privacy) on data that's not so important, if you're just reading the news or learning a language. It's a feature that many of the best VPNs now offer.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nAnother feature worth checking for is a kill switch. It sounds rather dramatic, but it's simply a feature that shuts down your internet connection if the data encryption somehow fails—cutting you off from the internet, but preventing your connection and data from being exposed. Again, this is now fairly common, but not every VPN offers it.No logs or zero logs\n    \n            \n            Mullvad VPN lets you pay by cash, if you don't want to enter payment info.\n                                        Credit: Mullvad VPN\n                    \n    \nYou should only consider VPNs that have clear no-logs policies (no browsing data is permanently retained) or zero-logs policies (supposedly even stricter, covering more data). Don't take the VPN's word for it. though: Look for third-party audits from independent security companies, carried out regularly, to verify these claims.If these logs are retained, they might be sold to data brokers, or pulled by law enforcement agencies—so check the individual privacy policies for details of what happens when you're connected to your VPN. Some VPNs go above and beyond when it comes to letting you stay anonymous: Mullvad VPN lets you pay by cash through the post, for example.\n            \n                What do you think so far?\n            \n        \nVPN protocolA VPN protocol is the way that the VPN connects to the internet at large: It makes a major difference to speed and security, and you'll often see it mentioned in VPN listings. However, as important as it is, it's not something that's easy to compare across different VPN services—most VPNs will simply say their protocol of choice is the best.Once you've got a shortlist of VPNs together, do some background reading on the protocols they use: Look for independent assessments of their security and transparency, technical benchmarks, and protocols that have been open sourced so they can be analyzed. OpenVPN and WireGuard are two well-regarded protocols, for example.Location and reputation\n    \n            \n            Where a VPN is based is important, as well as where it connects to.\n                                        Credit: Lifehacker\n                    \n    \nVPN companies are bound by the laws and regulations of the country that they're based in—so it's a good idea to look for ones based in places where surveillance regulation and government monitoring is less strict. If necessary, check the VPN's policies on how it deals with data requests from the authorities and law enforcement in its local region.It's also worth weighinga VPN company's reputation: How does it make money? What other services does it offer? What's its record with data breaches? This is much more important with a VPN than it is with your streaming music provider, for example, because you're trusting it with all of your online data while you're connected.Trials and money backGenerally speaking, it's worth paying for a VPN, as you're giving it so much responsibility in terms of your online access and security. The paid options are almost always going to give you a faster and more reliable service, and if you regularly make use of a VPN then the monthly fee is well worth the investment.It is, however, worth looking for services that offer free trials and your money back if you're not satisfied (usually after 30 days). Not only does it reflect well on the VPN company, it means you can see if the VPN suits your needs—and check how fast its servers are—before signing up for any kind of payment plan.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Choose the Right VPN for You",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEC6X19FDSW9A9CDGB0RG4B0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-07T14:30:00.000Z",
      "dateModified": "2026-01-07T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: AMD Just Showed Off 'Helios,' the Hardware That Will Power the AI Content in Your Feeds",
    "url": "https://lifehacker.com/tech/amd-just-announced-helios-at-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KE8KYWR5P7GSGHGH8VZQSBQM/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-06T03:39:44.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 6, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: AMD/YouTube\n                            \n            \n                Key Takeaways\n                                            At CES, AMD unveiled Helios, its newest rack for AI compute.\n                                            This AI rack is extremely powerful, and will enable generations for all kinds of AI content.\n                                            The announcement comes as AI and AI data centers alike are under fire from critics for misinformation and impact on local communities.\n                                    \n            \n    Table of Contents\n    \n        \n        When you come across an AI video on Instagram, or watch ChatGPT respond to your query, do you ever think about how that content was generated? Beyond the actual programs and prompts, generative AI takes an enormous amount of compute to support, especially as it skyrockets in popularity. As such, AI companies are looking for more power than ever, which means, of course, turning to those that make the hardware. AMD calls Helios \"The world's best AI rack\" During a Monday evening keynote, AMD's CEO Dr. Lisa Su showed off the hardware that will soon power everything from ChatGPT to the AI videos overwhelming your feeds. Su introduced—against a backdrop of dramatic music—\"Helios,\" the company's upcoming AI rack, which packs a staggering amount of computing power into a rack that weighs nearly 7,000 pounds. Each \"cross-section\" of these racks is powered by four key AMD pieces of hardware: the company's new AMD Instinct MI455X GPU, the new AMD EPYC \"Veince\" CPU, the AMD Pensando \"Vulcano\" 800 AI NIC, and the AMD Pensando \"Salina\" 400 DPU. There are some staggering stats here: Helios is capable of 2.9 exaflops of AI compute, and comes with 31 TB of HBM4 memory. It offers 43 TB per second scale out bandwidth, and is developed with 2nm and 3nm architecture. The rack has 4,600 \"Zen 6\" CPU cores, and 18,000 GPU compute units. In other words, this isn't your average piece of hardware.\nSu's pitch is that the AI industry is in need of this additional compute power. She notes how the world used one ZettaFlop of computing power in 2022 on AI technology, compared to 100 ZettaFlops in 2025. (For the curious, one ZettaFlop has a value of 10 to the power of 21.) It's no surprise: AI is everywhere, and many of us are using it—whether we know it or not. Some of us are using it overtly, generating AI videos or running chatbots daily. But others are using AI quietly embedded in functions, like live translation.    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nSu welcomed reps from OpenAI, maker of ChatGPT, and Luma AI, which creates generative AI video content, to talk about how additional compute helps their programs. But during Luma AI's demonstration of its hyperrealistic video generations, all I could think about was how this type of content is already tricking people into thinking it's real, when it's entirely fabricated—not to mention the impact on human artists. AMD is optimistic about AI, and the data centers powering it, but critics have been pushing back, citing concerns with the impacts on the communities companies are building these data centers in. \n            \n                What do you think so far?\n            \n        \nHelios will likely be a major success for AMD, but it comes at an interesting time for tech, and AI in general. AI is more popular than ever, but it's also more controversial than ever. I see hardware like Helios only fueling the fire in both directions.  AMD Ryzen AI 400 seriesIn addition to Helios, Su announced the AMD Ryzen AI 400 series. These newest chips comes with either 12 \"Zen 5\" CPU cores and 24 threads, 16 RDNA 3.5 GPU cores, a 60 TOPS XDNA 2 NPU, and memory speeds of 8,533 MT/s. AMD says the Ryzen AI 400 series is 1.7 times faster at content creation and 1.3 times faster at multitasking when compared to Intel Core Ultra 9 288V. These new chips will ship soon in a number of major PC brands, including Acer, Asus, Dell, HP, Lenovo, Beelink, Colorful, Gigabyte, LG, Mechrevo, MSI, and NEC.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: AMD Just Showed Off 'Helios,' the Hardware That Will Power the AI Content in Your Feeds",
      "image": [
        "https://lifehacker.com/imagery/articles/01KE8KYWR5P7GSGHGH8VZQSBQM/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-06T03:39:44.000Z",
      "dateModified": "2026-01-06T03:39:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "There's Actually a Way to Mix and Match Your Cordless Tool Batteries",
    "url": "https://lifehacker.com/home/cordless-power-tool-battery-adapters?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFAE6KAZYE3E4GC1YB3TFVX/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T18:00:00.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Jeff Somers\n                            \n  ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Jeff Somers\n                            \n        \n            Jeff Somers\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceJeff Somers is a freelancer who has been writing about writing, books, personal finance, and home maintenance since 2012.Jeff has published nine novels and more than 70 short stories; his story Ringing the Changes was selected for inclusion in The Best American Mystery Stories 2006. In 2018, Jeff published the book Writing Without Rules: How to Write & Sell a Novel Without Guidelines, Experts, or (Occasionally) Pants. He holds a bachelor’s degree in English and previously worked in medical publishing as a production editor. When not writing, Jeff spends his free time fixing up his old house. He has tackled a wide range of DIY projects, including remodeling a bathroom entirely on his own in two weeks, and building a roof deck that hasn't fallen down yet. You can find him on Bluesky.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 8, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: VVVproduct / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        When shopping for cordless power tools, you'd think you could simply purchase the best option of each to fit your needs. But there's a big problem that makes this a lot harder (and more expensive) than it should be: battery incompatibility. By design, you can’t simply pop a Ryobi battery into a DeWalt tool and expect it to work. Engineering decisions aside, using proprietary batteries allows companies to create a sort of obligatory brand loyalty, forcing you to stick with their line of tools unless you want to invest in a whole new set of batteries for every new tool you buy.If you've been building your cordless tool collection for some time, you may wind up with four or five different chargers and multiple batteries cluttering your workspace. And that clutter can be expensive, because you wind up buying more chargers and batteries than you might not need if batteries were interchangeable.But it turns out they are, sort of. You can actually swap batteries between brands—you just need the right adapters.\nAdapters let you swap tool batteries between brandsThere are two kinds of battery adapters to consider:Inter-brand adapters allow you to use one brand’s batteries in another brand’s tool (like DeWalt batteries in Milwaukee tools).Voltage adapters allow you to use a different voltage battery than the tool expects (say, a 20-volt battery in a 18-volt tool).These adapters are a fairly simple solution to the problem of incompatible battery systems. If you have a lot of DeWalt tools, for example, you can purchase a Milwaukee tool without a battery (which will be cheaper) and just use an adapter to plug in one of the DeWalt batteries you already have.\n            Never miss a story\n                Get the latest smart home news, trends, and advice from Lindsey and the team.\n            \n        \nOf course, these batteries weren’t specifically designed for these tools, so there can be some trade-offs. While tool performance has been found to be broadly similar (and some tools even performed better when using batteries from different brands), for some tools (like grinders and some circular saws) there’s a dropoff in power and performance when using an adapter. That said, you might not notice it if you're just looking to tackling simple DIY projects around the house. Another caveat to consider: You might lose some features. Some tools are designed to communicate with the battery to modulate power draw in order to extend the life of the battery, and using an adapter will remove this functionality. But again, if you’re simply using a power drill for basic maintenance tasks, this might not be a huge issue for you.\n            \n                What do you think so far?\n            \n        \nUniversal adapters are a good solution if you own a bunch of brandsIf you’ve got a bunch of disparate tool brands, of course, buying multiple adapters might not seem like much of an improvement over your collection of batteries and chargers. If this is you, consider something like the Ceenr PDNation Universal Battery System, which provides an 18-volt battery and a series of adapters that allow it to be used in a wide range of power tools, including major brands like Ryobi, Milwaukee, and DeWalt.For example, you can buy a battery with an adapter for DeWalt tools, then buy a second adapter for the same battery that will work with Makita tools. This means you can standardize on one battery system for pretty much any tool you buy (it’s not a truly universal system, since you’re dependent on the range of adapters they offer, but it’s probably close enough for most people).As with other adapters, there can be some performance loss using a universal adapter, but by and large, it’s probably not a big issue if you’re doing work around the house, as opposed to working professionally on a job site.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "There's Actually a Way to Mix and Match Your Cordless Tool Batteries",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFAE6KAZYE3E4GC1YB3TFVX/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T18:00:00.000Z",
      "dateModified": "2026-01-08T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: There's a Whole Windows PC in This HP Keyboard",
    "url": "https://lifehacker.com/tech/ces-2026-hp-windows-pc-inside-keyboard?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDTYM6CST1T1M71X4E76QBDY/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-06T03:30:00.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                         ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle Ehrhardt is Lifehacker's Associate Tech Editor. She has a bachelor's degree in history from Earlham College, where she also double majored in theatre. She also holds an MFA in game design from NYU. Michelle's career as a journalist began at Out Magazine, where she covered games, music, film, and politics with an eye towards the LGBT perspective.Michelle is a member of the New York Video Games Critics Circle, where she sits on the Game Journalism Award committee. She has participated in panels and workshops at New York's DreamYard Program and has hosted both the Tom's Hardware Show and the Gadgettes podcast.Her work has been featured in outlets including Paste, The Atlantic, Tom's Hardware, Gizmodo, and The Advocate. Some of her favorite pieces include her annual CES recaps, her video game reviews, and her interviews with hardware makers and independent video game developers.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 6, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: HP\n                            \n            \n                Key Takeaways\n                                            The HP EliteBoard G1a is a keyboard with a whole Windows PC inside it.\n                                            It's aimed at enterprise customers, but you will be able to buy it from HP.com.\n                                            It's up to you whether to include a battery with it.\n                                    \n            \n    Table of Contents\n    \n        \n        If you're anything like me, you spend 90% of your time using your laptop with it docked and plugged into a monitor (or two). And if you're at that point, you might be wondering why you even bother having a screen attached to your computer at all. If so, HP's got your back. Announced at this year's CES, the HP Eliteboard G1a looks like a normal keyboard on the outside, but on the inside, it's got a whole Windows PC.That's not exactly a new concept, but with the experimental days of Windows XP long behind us, it's mostly been reserved for less powerful, Linux-based single-board computers like the Raspberry Pi. That's great if you're a hacker or tinkerer, but not if you're just looking for a screenless, keyboard-equipped Mini PC to get you through the workday. The Eliteboard G1a, instead, comes equipped with the latest AMD Ryzen AI chips, up to 64GB of RAM, and up to 2TB of storage, so while you shouldn't expect to play the latest and greatest games on it, for internet browsers and lightweight productivity programs, it should really be able to hustle.\n\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nIt's also a bit of a sleeper build. I've been able to go hands-on with it, and to all outside eyes, it really does look like a regular office keyboard, complete with black, low-profile chiclet keys, a function row, and a numpad. Ranging from 1.5 to 1.7 pounds based on how you spec it out, it's also pretty lightweight, and the right person might believe you if you said it was just a keyboard, with no computer inside whatsoever.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe catch? This baby is aimed at enterprise customers, rather than your typical consumer. That does come with a few bonuses, like a Kensington lock slot, some extra security software, and an optional fingerprint reader. But it also means you're not going to find it up for sale anywhere other than the HP store, and while pricing hasn't been announced yet, it'll probably be a bit more expensive if bought individually rather than as part of an office fleet. It can also only connect to monitors using DisplayPort, which is fine if you're an office manager that knows to buy displays that will work with it, but may not fit into everyone's home set-up.\n            \n                What do you think so far?\n            \n        \nThat's a shame, because I love unusual form factors, and this keyboard PC could make for a really clean desk in my home office. It's strong enough, uses a familiar operating system with wide app compatibility, and can even output to two 4K monitors at once. There are also two versions, one that always needs to be plugged in, and one with a battery and a detachable USB power cable for quickly moving between different workstations. That's great flexibility, since the battery version is a bit more portable, but is also heavier.Here's hoping this is just an early experiment for HP, because I'd love to buy a consumer version of this laptop at some point in the future. If you're willing to take the plunge on the enterprise model, though, HP says it's expected to launch on HP.com sometime in March.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: There's a Whole Windows PC in This HP Keyboard",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDTYM6CST1T1M71X4E76QBDY/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-06T03:30:00.000Z",
      "dateModified": "2026-01-06T03:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]