[
  {
    "title": "The US Has Reached a 'Final' Deal on TikTok With China",
    "url": "https://lifehacker.com/tech/us-reaches-final-deal-on-tiktok-with-china?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8K3V4XPHG6RGWFFFZEW327D/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-27T16:00:24.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The US Has Reached a 'Final' Deal on TikTok With China",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8K3V4XPHG6RGWFFFZEW327D/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-27T16:00:24.000Z",
      "dateModified": "2025-10-27T16:00:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Limit How Many YouTube Shorts You Watch in a Day",
    "url": "https://lifehacker.com/tech/youtube-shorts-limit-added?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K86HEEV4RQYJDEHXN6QQ82K4/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-22T19:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Limit How Many YouTube Shorts You Watch in a Day",
      "image": [
        "https://lifehacker.com/imagery/articles/01K86HEEV4RQYJDEHXN6QQ82K4/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-22T19:30:00.000Z",
      "dateModified": "2025-10-22T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tinder Is Using Face Scans to Make Catfishing More Difficult",
    "url": "https://lifehacker.com/tech/tinder-facial-scans-to-fight-bots?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8944MWRSPRM6C5WWMDHCE17/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-23T19:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Face scanning is now required for new users in seven countries, plus California.\n    \n        \n    \n                                        \n        \n        \n        October 23, 2025\n                    \n            Credit: Tinder\n                            \n            \n                Key Takeaways\n                                            Tinder is now requiring new accounts in certain areas to scan their faces during setup.\n                                            The new feature is now live in California and in seven countries across the globe.\n                                            Tinder says it will not keep your video selfie, but it does retain a \"non-reversible, encrypted face map.\"\n                                    \n            \n    Table of Contents\n    \n        \n        It's about to get a whole lot harder for catfishers on Tinder. Starting today, new users in California will have to scan their faces while setting up their accounts to ensure that they're both real and that they match their profile photos. Called Face Check, the new mandatory feature is the first step in a new initiative from Tinder's parent company Match Group, which says the goal is to help reduce \"spam, scam attempts, or [bots] operating automated fake profiles.\" When signing up, users will need to complete a \"liveness check,\" during which they'll take a video selfie from various angles. After that, the app will compare the selfie to profile pictures also uploaded during setup, and if it determines that they match, the user will get a \"Photo Verified badge\" and they'll be able to finish making their account. Tinder also says the system can determine if a picture has been used across multiple accounts to help prevent impersonation.While Face Check is new to the United States, it's already been launched abroad in Colombia, Canada, Australia, India, and \"several countries across Southeast Asia.\" According to Tinder, \"when coupled with other recent safety initiatives,\" Face Check has led to an over 60% decrease in users exposed to \"bad actors,\" and an over 40% decrease in reports of bad actors.\n        \n            You May Also Like\n        \n    \nFace Check's debut also coincides with the rise of AI image generators, and while the company's announcement post doesn't explicitly call out AI, it's not hard to see how it could prove handy against bots using generated photos to pretend to be someone who doesn't even exist. Traditional catfishing methods, such as using stock photos, can be detected with diligent reverse image searching, but AI's ability to quickly create novel, believable, and specifically tailored results has made it harder than ever to know whether you're speaking to a genuine human online.At the same time, as other apps begin to collect personal information like government IDs, there is a privacy concern. Tinder says that Face Check only uses your video selfie to complete the verification process, and deletes it shortly after review, although it does generate a \"non-reversible, encrypted face map\" that is stored to \"help verify new photos, detect fraud, and prevent duplicate accounts.\"As someone who met my husband on Twitter (RIP), I'll leave it up to you whether that's worth it. Have you tried just getting real good at posting instead?For now, though, you might have to wait a bit until Face Check actually makes its way to you. First, Tinder is not forcing existing accounts to use Face Check, which is why I assume it's using a badge to indicate the accounts that have gone through Face Check, even though it's mandatory during setup. Second, Face Check is rolling out slowly. Tinder says that it will come to additional states \"in the coming months,\" although the company did not provide an exact timeline.As for other apps, Match Group (which also owns OKCupid, Hinge, and Plenty of Fish, among others) says it will extend Face Check to additional platforms in 2026.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tinder Is Using Face Scans to Make Catfishing More Difficult",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8944MWRSPRM6C5WWMDHCE17/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-23T19:30:00.000Z",
      "dateModified": "2025-10-23T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Update Your PC Now to Patch This Windows RE Bug",
    "url": "https://lifehacker.com/tech/microsoft-broke-windows-recovery-environment?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K811SVREYZ7TQE16PKAZQKTV/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-21T15:57:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            If your PC loads into Windows RE, you won't be able to interact with anything.\n    \n        \n    \n                                        \n        \n        \n        October 21, 2025\n                    \n            Credit: sdx15/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Microsoft just released an emergency update to patch a disruptive Windows RE bug.\n                                            Microsoft's October build for Windows 11 broke USB device functionality in Windows Recovery Environment.\n                                            Before the patch, if your PC loaded into Windows RE, you weren't able to interact with anything.\n                                    \n            \n    Table of Contents\n    \n        \n        When your PC is acting up, one diagnostic tool at your disposal is the Windows Recovery Environment (or Windows RE). Windows RE offers a series of functions to help you root out whatever is ailing your machine. Using it, you can choose to reset your computer, run an automated diagnosis and repair tool, adjust settings to see if any are causing the issue, uninstall previous updates that might be tripping up Windows, and restore to a previous back Windows backup, among other potentially helpful options. It's a necessary feature of the operating system, meant for times when a simple shut down and restart doesn't help your PC get back to normal operations. So it's not ideal when Windows ships with a bug that not only breaks part of the OS, but also breaks the part of the OS designed to help fix your PC.As spotted by Tom's Hardware, a bug in Windows 11's October update, KB5066835, hinders your ability to access Windows RE. The recovery environment can still load if you need it, but you'll find you won't be able to select any of the options it offers to try to fix your PC. That's because this bug breaks USB device functionality specifically in Windows RE. Simply stated, your mouse and keyboard will not work in Windows RE, preventing any navigation within the recovery environment. \n        \n            You May Also Like\n        \n    \nThis is obviously bad news for anyone who wants to use Windows RE to fix a problem with their PC—including, ironically, this Windows RE-specific bug. But you might think that so long as your particular issue with Windows isn't prohibiting you from actually using your computer, you could live without Windows RE for the time being. As Tom's Hardware points out, however, it's not so simple: When your PC has trouble starting up, it will automatically boot into the recovery environment. That's normally a good thing, since you'll have the tools to help diagnose and solve the issue. However, when Windows takes you to a screen where you can't use your mouse and keyboard, or interact with any elements whatsoever, you're kind of stuck. Microsoft has issued a patchThe good news is a fix is officially here. Microsoft had called out the bug as a known issue in Windows 11, version 25H2, and said it was working on releasing a fix \"in the coming days.\" That fix came sooner than expected. The new KB5070773 update restores USB device functionality in Windows RE, so you should update as soon as possible. If you have normal access to Windows, all you need to do is head to Start > Settings > Windows Update, and install it when it appears.However, if your PC is stuck in Windows RE, it's a bit trickier to solve. As Tom's Hardware explains, Microsoft recommends users to use their touchscreens or PS/2 ports if available. If not, you may need to rely on a USB recovery drive to get your PC back up and running.  Windows is experiencing other issues, tooWindows is going through it this month. This same October update also broke localhost functionality, which impacted any apps that connect to services running locally on your PC. (Luckily, Microsoft did issue a fix for that bug.) Then, last week, the company also officially ended support for Windows 10, and though it still offers Extended Security Updates for any user that wants to enroll their PC in the program, it puts the security of roughly half a billion PC users into question.   This Windows RE bug is just one more critical issue PC users have to deal with. Hopefully, Microsoft's next Windows 11 build introduces only fixes, and no additional bugs.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Update Your PC Now to Patch This Windows RE Bug",
      "image": [
        "https://lifehacker.com/imagery/articles/01K811SVREYZ7TQE16PKAZQKTV/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-21T15:57:00.000Z",
      "dateModified": "2025-10-21T15:57:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Check This Database to See If Your Email Credentials Have Been Leaked",
    "url": "https://lifehacker.com/tech/leaked-email-credentials-in-database?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K88R3FXB3Z4XKH73YQ5B9HV5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-23T15:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Check This Database to See If Your Email Credentials Have Been Leaked",
      "image": [
        "https://lifehacker.com/imagery/articles/01K88R3FXB3Z4XKH73YQ5B9HV5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-23T15:00:00.000Z",
      "dateModified": "2025-10-23T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Pixels Are Still Having Problems Calling 911",
    "url": "https://lifehacker.com/tech/google-pixels-are-still-getting-911-bugs?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BSWKQV1QJ9ZV3XA00PVQVM/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T21:00:19.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            The problems has persisted since 2021.\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n    \n            Credit: omar hesham2qwe / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Multiple Google Pixel users yesterday reported that they couldn't call 911.\n                                            The issue has persisted since 2021, in one form or another.\n                                            A Canadian carrier also posted about similar problems, but says they have since been fixed.\n                                    \n            \n    Table of Contents\n    \n        \n        For the past few years, Google's Pixel phones have had recurring problems with calling 911, and the issue has once again reared its ugly head. Over the past 24 hours, multiple users on Reddit have complained about being unable to call 911, while the Bell carrier in Canada issued a warning that the Pixel 6 and up was also having problems contacting emergency services on its network.According to user Fabulous_Disaster730, who posted yesterday about difficulties contacting emergency services during a gas leak, her Pixel 9 Pro repeatedly prompted her to turn on wifi calling or turn off airplane mode before she could call 911, despite her having full signal on both 5G and wifi. The phone would then freeze and restart. After multiple attempts, she resorted to asking a friend to place the call for her instead.Multiple replies mentioned facing similar problems yesterday as well, across multiple networks and models of Pixel. Bell, however, was the only carrier to issue an official notice.\n        \n            You May Also Like\n        \n    \nAside from the obvious danger, the problem with this bug is that it's not consistent. Despite seemingly having had a surge yesterday, it's been a known issue as far back as 2021. However, it doesn't affect all users, nor is it entirely predictable when or how it will pop up. While recent reports are of calls simply not going through, one user posted two months ago that their call did go through, but they only heard screeching and static on the other end of the line. These recent reports are only the latest in an ever-evolving concern.It's also not clear what's causing the problem. In 2021, the problem was attributed to Microsoft Teams, but even with that error patched up, users are still facing problems. To Google's credit, Bell said it reached out to the company shortly after it learned about yesterday's uptick in cases, and afterwards said that a fix had been issued. However, no other carriers have issued similar notices, and I wouldn't be surprised to see other users making their own complaints in the future.It's worth noting that Bell mentioned that Pixel 6 users and up were the ones affected this time around, and that the Pixel 6 also happened to release in 2021, which is when the bug first started making news. Whatever is at the core of the problem here, I wouldn't be surprised if it worked its way in on the Pixel 6 and just hasn't yet been addressed.However, given the severity of the issue, it's something that needs looking at sooner rather than later. I've reached out to Google for comment on this issue, and will update if I hear back. In the meantime, it's best to be prepared in case the worst happens. If you're on a Pixel phone, here's what you can do to contact 911 in an emergency:\n            \n                What do you think so far?\n            \n        \nFirst, try to place a 911 callIf you have time and the danger is not immediate, it's worth trying to call 911 on your Pixel despite the issues. While users reporting problems have increased as of late, it's still not an everyone or every time problem. It's possible your call will still go through without issue.You can also text 911If, however, you are unable to call 911, it's worth remembering that in certain jurisdictions (check this regularly updated list to see if where you live is supported), you can also contact 911 via text. This is a slower method of reaching out for help, but is still better than nothing. To text 911, open your texting app, put in 911 as the recipient, and write a concise message with your issue, your location, and any necessary specifics, like cross streets, landmarks, a specific hiding location, or whether you're able to talk.Use a backup phoneWhile I don't expect someone who isn't constantly reviewing tech to have multiple phones on hand, the surest method to ensure you'll be able to call 911 if you're on a Pixel is to keep a backup phone that isn't a Pixel handy. This could be a landline or another cell phone. Crucially, it can be an old cell phone, even one that isn't actively attached to a phone plan. So long as your phone is able to connect to a network, it's legally required to be able to call 911, so if you have an old phone you've upgraded from and haven't traded in laying around, it may be smart to keep it charged up in case you need it in an emergency.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Pixels Are Still Having Problems Calling 911",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BSWKQV1QJ9ZV3XA00PVQVM/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T21:00:19.000Z",
      "dateModified": "2025-10-24T21:00:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sora Will Soon Let You Make Cameos of Your Pets",
    "url": "https://lifehacker.com/tech/sora-will-soon-let-you-make-cameos-of-your-pets?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K88X6MG6FCTN6RWNDDSNGQ9B/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-23T17:00:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Meanwhile, the app is also on its way to Android.\n    \n        \n    \n                                        \n        \n        \n        October 23, 2025\n                    \n            Credit: OpenAI\n                            \n            \n                Key Takeaways\n                                            Sora, OpenAI's short-form AI video platform, is getting some new features in coming days.\n                                            Bill Peebles, head of Sora, says you'll soon be able to make cameos of just about anything you want, including pets and toys.\n                                            You'll also be able to use light video editing tools to stitch two clips together.\n                                            The app is currently iPhone-only, but is coming to Android soon.\n                                    \n            \n    Table of Contents\n    \n        \n        Sora, OpenAI's short-form AI video platform, has been available for iPhones for the past few weeks. Users have spent that time generating hyper-realistic vertical videos that, despite their watermarks, might already be fooling people on the internet. I, for one, see nothing good about a tool that can make these types of videos from simple prompts, perhaps outside the sheer novelty alone. But the app is undeniably popular, and, as expected, OpenAI is continuing to \"improve\" it. On Wednesday, the head of Sora, Bill Peebles, shared a roadmap of updates coming to the app, from cameos for your pets to video editing tools. Sora will soon let you make cameos of anything you wantPeebles says that \"character cameos\" are on their way in the coming days. When this feature drops, you'll be able to make cameos of just about anything you want, including your pets (Peebles suggests your dog or guinea pig), stuffed toys, as well as AI-generated characters Sora may have produced in your past videos.  \n        \n            You May Also Like\n        \n    \nCameos are a defining, and controversial, Sora feature. It lets you scan your likeness into the app so you can create videos featuring yourself. Not only that, you can remix videos with cameos of anyone else who has scanned themself into Sora—assuming their permissions allow you to use their cameos. It's impressive tech, but it raises major ethical concerns, considering you can make someone else do or say things they never signed off on. Now, apparently, you'll also be able to do the same with the family cat or your childhood stuffed animal. Following these additional cameo options, Peebles says you'll be able to see \"the latest trending cameos in real time.\" I'm guessing the idea is to browse the most popular cameos on the platform, and, if you want to, add them to your own videos. Sora is also getting basic video editing tools. According to Peebles, this starts with the ability to stitch multiple clips together, though other \"powerful new features\" will follow. Peebles says the Sora team is also working on reducing \"excessive moderation,\" which he acknowledges is \"super annoying\" to users, as well as improving the app's performance.Speaking of apps, Android users will soon have their chance to try Sora. Right now, the app is iOS-only, but Sora's Android version is \"actually coming soon,\" Peebles says.  A reminder to be wary of what you see on the internetAs critical and cynical as I am about Sora and services like it, I can see the utility here. I imagine people will get a kick out of being able to put their pets in any situation they want. And if they want to make fried eggs sing a song, or a stuffed animal say \"hello,\" more power to them. But my main concerns with this app are not assuaged by any of these updates: Sora still lets you generate convincing videos with a simple prompt, with the only safeguard a watermark that's easy to remove if you know where to look. People were already falling for fake videos on the internet before these tools came along; now, it's becoming way too difficult to know whether what you're watching is actually real or not. If you ask me, you're better off assuming all of it is fake.Disclosure: Lifehacker’s parent company, Ziff Davis, filed a lawsuit against OpenAI in April, alleging it infringed Ziff Davis copyrights in training and operating its AI systems.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sora Will Soon Let You Make Cameos of Your Pets",
      "image": [
        "https://lifehacker.com/imagery/articles/01K88X6MG6FCTN6RWNDDSNGQ9B/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-23T17:00:00.000Z",
      "dateModified": "2025-10-23T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube Is Trying to Eradicate Deepfakes With This New Program",
    "url": "https://lifehacker.com/tech/youtube-likeness-detection-program-deepfake?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K848RQZ2AG1NFWNFWDQR4VPB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-22T14:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube Is Trying to Eradicate Deepfakes With This New Program",
      "image": [
        "https://lifehacker.com/imagery/articles/01K848RQZ2AG1NFWNFWDQR4VPB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-22T14:00:00.000Z",
      "dateModified": "2025-10-22T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Is the iPhone 17 Pro’s ‘Colorgate’ Worth Worrying About?",
    "url": "https://lifehacker.com/tech/iphone-17-pro-colorgate?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K86FFEMN3QQQ128NQKYKGV43/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-22T19:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Is the iPhone 17 Pro’s ‘Colorgate’ Worth Worrying About?",
      "image": [
        "https://lifehacker.com/imagery/articles/01K86FFEMN3QQQ128NQKYKGV43/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-22T19:00:00.000Z",
      "dateModified": "2025-10-22T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How I Used Smart Glasses to Trick a Bartender Into Giving Me a Free Drink",
    "url": "https://lifehacker.com/tech/used-smart-glasses-to-trick-a-bartender?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BY594J33K2J5Q3D41GQHPD/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T21:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            I can use my glasses to do crime! Who's the nerd now?\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n                    \n            Credit: Stephen Johnson\n                            \n    Table of Contents\n    \n        \n        I recently reviewed Even Realities G1 smart glasses (they're very cool) and the first real-world thing I used them for was scamming someone. I told a local bartender I had an encyclopedic knowledge of film, and I would answer the hardest movie trivia question he could come up with in exchange for a drink. After a short consultation with Google, dude came back with \"Who directed 1922's Cabinet of Dr. Caligari?\"I tilted my head thoughtfully and repeated the question as if verifying I heard him right. The AI agent silently did its thing, and in about three seconds, the answer was floating before my eyes, totally invisible to everyone around me. \n    \n            \n            \n                                        Credit: Stephen Johnson\n                    \n    \n\"Robert Wiene?\" I asked, feigning uncertainty. Boom! Free drink. It's not the hardest trivia question, but I could have answered literally anything: the date Dr. Caligari was released, the day of the week it was, or the weather that day—all short work.  \n        \n            You May Also Like\n        \n    \nBartenders know to be wary of bar bets, so this one was watching me like a hawk to make sure I wasn't looking up the answer on my phone or something. He didn't seem to suspect my glasses, and even if he had, it wouldn't have mattered. Even inspected up close, G1s offer no indication of electronics of any kind: No USB port, no flashing light, no visible controls. The AI agent is activated with a subtle tap behind the ear. Repeating the question sends the AI off for the answer, presented in a display that's invisible to everyone but the wearer. You could do the same trick with a pair of Meta Ray-Ban Display glasses or audio-only smart glasses with AI.I don't like deceiving people, so I ended up telling the bartender what was up to and not accepting the drink, but it got me thinking about what more nefarious people than I could do (and probably already are) with AI smart glasses.Just imagine what I did on a bigger level: a team of hustlers at bar trivia silently tapping their temples whenever “which actor played…?” was asked would never lose. It's pretty small stakes, but not hard to imagine. Hypothetically, a hacked pair of smart glasses could be programmed to read the cards in your poker hand and give you the probability of winning in real time, either through the display or whispered in your ear. They could, hypothetically, make counting cards in blackjack effortless and undetectable. Stretching it out further, hypothetically, glasses could scan others players for \"tells\" that they're bluffing, or read micro-expressions to give a constantly updated read on opponents. Along the same lines, imagine attending a self-help meeting, and the leader, who you have never met, says, \"I've had a vision about you\" and begins to describe something that happened in your life exactly. All it would take would be glasses that recognize your face (supposedly coming to Meta Displays) connecting to a social media feed, which is then displayed in real time to the leader. Or you could go more subtle and engineer small \"serendipities\" like mentioning a movie someone recently saw and having exactly their opinion. It would only take a few of these and maybe some mystical patter to convince people you are divine being they should definitely donate to.How to spot tricky smart glassesI could go on, but you get the idea. Luckily, there are some indications when someone is using tech hidden in their eyeglasses. The most important is a general understanding of the possibilities of this technology. If someone seems to know something they shouldn't, ask yourself if their glasses could be the source of their power. Here are some more specific giveaways.Look for identifiable kinds of smart glasses\n    \n            \n            \n                                        Credit: Meta\n                    \n    \nThe most popular display style glasses, Meta Ray-Ban Displays, are distinctive looking, with a fairly obvious camera in one of the corners and a specific look and branding. But other kinds of smart glasses, like the Even Realities G1s mentioned above, are obscure enough that most won't recognize them, and so \"normal\" looking that most people wouldn't pick them out of lineup.Look for where the tech is hiddenMost smart glasses are still fairly bulky, so look for thick arms or frames where the wires are hidden. But again, that's only most smart glasses; some are totally sleek, with imperceptible tech.Look for a small glint In most situations, the display in display glasses is not visible to anyone but the glasses wearer, but there's still light being projected. In a dark room, you can see a green glow, and even if it's not dark, the display windows are visible if the light hits it just right, as you can see here:\n    \n            \n            \n                                        Credit: Stephen Johnson\n                    \n    \nBut honestly, it's subtle and hard to spot. Listen for the soundsOlder styles of audio-only smart glasses can feed information to wearers, but the open-air speakers mean some sound is bleeding into the atmosphere. You can definitely hear smart glasses if you're in a quiet room and you're trying to. If it's loud, operating glasses becomes problematic for the wearer.Look for the source of controlSmart glasses have to be controlled somehow. Meta Display glasses are operated with a wrist band. G1 glasses' AI agent is powered on by tapping on the frames behind your ear. Anyone who practices for a few hours could make these movements seem natural, but they're there if you know what to look for. Odd movements and speechIt doesn't take advanced stagecraft to operate these kinds of glasses imperceptibly, but it does take something. Tells might include small glances upward to see the display, tapping on glasses, stilted speech while waiting for information to come in, and a reading-a-teleprompter style of talking. Watch for people repeating questions back. But understand, it's hard to spot. When I was conning my bartender, I thought how I repeated the question back was obvious, but my wife said I just seemed a little odd, which suits the personality of a trivia whizz anyway. Smart glasses are powerful tools, like a hammer or a calculator. Like any innocent tool, they can be used for nefarious things, so until manufacturers or regulators require obvious indicators, like flashing lights or visible controls, we have to protect ourselves by paying attention to these small cues and staying skeptical when someone seems to know more than they reasonably should.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How I Used Smart Glasses to Trick a Bartender Into Giving Me a Free Drink",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BY594J33K2J5Q3D41GQHPD/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T21:30:00.000Z",
      "dateModified": "2025-10-24T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why You Should ‘Eat the Frog’ First Thing in the Morning",
    "url": "https://lifehacker.com/eat-the-frog-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GNJPPQER0BNX0MMSX8XCE/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-24T12:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why You Should ‘Eat the Frog’ First Thing in the Morning",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GNJPPQER0BNX0MMSX8XCE/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-24T12:30:00.000Z",
      "dateModified": "2025-10-24T12:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube Has a New Look on Mobile",
    "url": "https://lifehacker.com/tech/youtube-has-a-new-look-on-mobile?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BHERH2G90G7G5XZK8Z480G/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T19:30:05.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            And there's not a lot you can do about it.\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n    \n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            YouTube has a new UI on mobile.\n                                            Buttons are bigger and chunkier, and there are some new animations.\n                                            There are extensions for desktop to reverse some of these changes, but not much you can do on mobile.\n                                    \n            \n    Table of Contents\n    \n        \n        Last week, YouTube started rolling out a new look across both the web and its various apps, promising a \"more expressive and intuitive interface.\" In reality, the reaction has been mixed. The TV app, for instance, no longer automatically rewinds or fast forwards when you press back or forward, instead navigating between buttons including \"like\" or \"subscribe.\" More than once while on TV, I've accidentally subscribed to a channel without meaning to, before realizing that I now need to press up first to get to the progress bar.Now, the changes have reached the YouTube mobile app, as first spotted by 9to5Google. While they're a bit more mild than you'll see on TV, there's still a few changes to get used to.Bigger, chunkier icons\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nBy far, the most noticeable new change is YouTube's new suite of icons, which all look like they've been hit with a \"Ctrl + B.\" Compared to the old look, the play, fast forward, and other buttons all look larger and bolder, with the idea being to make them more prominent.\n        \n            You May Also Like\n        \n    \nSome of the buttons have also been consolidated. When watching a video in landscape, buttons that don't affect playback (like, dislike, comment, etc.) all now appear together in a pill in the bottom-left corner, rather than as separate elements.New animationsNew buttons aren't the only change YouTube has in store for you. Seeking videos also has a new animation now, and on some videos, liking now comes with a bit of extra personality.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nThe first is a pretty minor change. Now, when you double tap the screen to either go forward or back 10 seconds, the video will just automatically jump to the new spot and display a big \"-10\" or \"+10,\" rather than showing a quick animation of three arrows disappearing into each other with a smaller \"-10 seconds\" or \"+10 seconds\" below them.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nThe second is a bit cuter. On certain videos, tapping the \"like\" button will now play a custom animation, rather than simply putting some sparkles around a thumbs up. For instance, on a music video, you'll now briefly see a musical note replacing the thumbs up.Pausing no longer darkens your backgroundIt used to be that pausing a video would darken the background until you unpaused it, kind of like lights being lowered on a stage. That's no longer the case. While you'll still see the lights go slightly down while you have controls open, a paused video will now display as normal if you tap again to dismiss the controls. It's a small tweak, but could prove useful for taking screenshots. At the same time, though, I do worry that it might make it easy to think a video has frozen, if you're not paying attention.Nested comments and easier bookmarksFinally, Google has removed a few steps to saving and commenting on videos. Now, hitting the bookmark icon to save a video to a playlist has fewer steps, no longer requiring you to navigate multiple pages. Instead, it'll just pause the video and open a list of your playlists for you, where you can quickly tap the playlist you want to save your video to.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nAdditionally, comments are threaded now, easily showing who is replying to which comment. It's a great way to keep track of the flow of the conversation, although it does make each comment take up a bit of extra space.Can you get rid of the new YouTube UI?Ultimately, I'm a little torn on the new YouTube app. Certain new features, like threaded comments, just make sense to me. But the chunkier buttons do feel like they get in the way a bit to me, and I can't help but think of Fisher-Price when I see them.Unfortunately, there's not a lot you can do if you don't like the new YouTube mobile interface. It's still rolling out, so it's possible you might not see every change yet. But because it's server-side, once it hits you, that's it. Even the web player is getting these changes, so leaving the app behind isn't a viable option.That said, if you're on desktop, users on both Reddit and YouTube itself are putting together extension lists that you can mix and match to customize your experience. Technically, there are browsers for mobile that will allow you to play with these as well, with Firefox being the big one these days. However, I found that most of the suggested extensions no longer worked for me or weren't available for mobile. In that case, if you're sick of how YouTube looks now, you might want to consider an alternate player app instead, like Play. It still relies on embedded videos, so it won't save you from every change, but its overall minimalist style could offer welcome relief from YouTube's increasingly busy design language.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube Has a New Look on Mobile",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BHERH2G90G7G5XZK8Z480G/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T19:30:05.000Z",
      "dateModified": "2025-10-24T19:30:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Use Your iPhone As an ID in These 12 States",
    "url": "https://lifehacker.com/you-can-use-your-iphone-as-an-id-in-these-states?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2HAA4EPN6RTQFW5EHG8HX0/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T15:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Can I please stop carrying my driver's license everywhere I go?\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n    \n            Credit: Tada Images / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Why do I still carry a wallet? My iPhone can handle just about anything you used to need a traditional wallet for. Most (if not all) of my purchases are made via Apple Pay or QR code, my phone holds all of my pictures, and most of my receipts go straight to my email. Basically the only I keep my wallet around is to carry my ID. Once my state starts supporting Apple’s digital ID feature, however, things will change between me and my wallet—provided that support ever comes.Since iOS 15.4, Apple has allowed you to add a driver’s license or other state ID to your iPhone’s digital wallet. That doesn’t mean you’ve been needlessly carrying your ID around since then—states have been slow to roll out their own support for the feature, and most have yet to sign on at all. When I first covered this feature in 2022, only two states actively allowed you to add your ID to your iPhone, while 10 more (plus Puerto Rico) had confirmed plans to offer the option eventually, on a loose timeline of “soon.” Fast forward three years, and just 9 states and one territory now officially allow you to add IDs to Wallet.\n        \n            You May Also Like\n        \n    \nThese states support digital ID nowHere’s the full list as it stands in June 2025:ArizonaCaliforniaColoradoGeorgiaHawaiiIowaMarylandMontanaNew MexicoNorth DakotaOhioPuerto RicoWest VirginiaSupport is still \"coming soon\" in these statesThese states had originally pledged that support was \"coming soon,\" but after nearly three years, still haven't committed:ConnecticutKentuckyMississippiOklahoma UtahAirports where you can use a digital ID in Apple WalletNow, be warned: You can't simply hand a cop your iPhone when you get pulled over. There are specific, limited use cases for this feature. Right now, that means identifying yourself at the airport, as well as at select businesses. Apple worked with the TSA to make this happen, and while it used to maintain an active list of supported airpots, it seems to have taken it down. This is the list as it was last updated:Baltimore/Washington International Thurgood Marshall Airport (BWI)Cincinnati/Northern Kentucky Airport (CVG)Daniel K. Inouye International Airport (HNL)Denver International Airport (DEN)Des Moines International Airport (DSM)Eastern Iowa Airport (CID)Hartsfield-Jackson Atlanta International Airport (ATL)John Glenn Columbus International Airport (CMH)Los Angeles International (LAX)Luis Muñoz Marín International Airport (SJU)Ronald Reagan Washington National Airport (DCA)Phoenix Sky Harbor International Airport (PHX)San Francisco International Airport (SFO)San Jose Mineta International (SJC)Missoula International Airport (MSO)Great Falls International Airport (GTF)Bozeman Yellowstone International Airport (BZN)Billings Logan International Airport (BIL)Lea County Regional Airport (HOB)Albuquerque International Sunport (ABQ)This feature will also work with participating businesses to verify your age, including bars, restaurants, liquor stores, festivals, concerts, and certain age-restricted apps. However, there is no list of venues that support this feature.\n            \n                What do you think so far?\n            \n        \nHow to add a digital ID to your iPhoneIf you do live in a supported state, setting up the feature is simple. Open Wallet, then, tap the (+) in the top right, then choose “Driver’s License and ID Cards.” Choose your state, then choose whether to add the ID to your iPhone 8 or newer, as well as your Apple Watch Series 4 or newer. (There are caveats here: California requires an iPhone XS or later running iOS 17.5 or newer, or an Apple Watch Series 4 running at least watchOS 10. Puerto Rico requires an iPhone XS or later running iOS 18.1 or newer, or an Apple Watch Series 6 or later running watchOS 11 or newer.)   Either way, you’ll need to scan your ID with your iPhone’s camera, then scan your face to prove your identity. Once complete, send all information to your state to confirm. If you live in North Dakota, you will need to pay a $5 fee to use this feature.  \n    \n            \n            \n                                        Credit: Lifehacker\n                    \n    \nThe next time you fly from a participating airport, you can unlock your iPhone and place it next to the ID scanner. You’ll see your digital ID appear, complete with all information you will be sharing with the TSA if you approve (name, date of birth, sex, issuing authority, and issue and expiration dates).\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Use Your iPhone As an ID in These 12 States",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2HAA4EPN6RTQFW5EHG8HX0/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T15:30:00.000Z",
      "dateModified": "2025-10-24T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "X Is Getting Rid of ‘Twitter,’ and It Might Affect Your Account",
    "url": "https://lifehacker.com/tech/x-is-getting-rid-of-twitter-and-it-might-affect-your-account?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8JXYXC3H9CHFPWX4S0GZ7EG/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-27T14:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "X Is Getting Rid of ‘Twitter,’ and It Might Affect Your Account",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8JXYXC3H9CHFPWX4S0GZ7EG/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-27T14:30:00.000Z",
      "dateModified": "2025-10-27T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Maps Might Be Getting Ads Soon",
    "url": "https://lifehacker.com/tech/apple-maps-might-be-getting-ads-next-year?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8KBA02F26MD9KQBQYVQT2BR/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-27T18:30:45.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Maps Might Be Getting Ads Soon",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8KBA02F26MD9KQBQYVQT2BR/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-27T18:30:45.000Z",
      "dateModified": "2025-10-27T18:30:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]