[
  {
    "title": "That Political 'Call to Action' Might Actually Be a Scam",
    "url": "https://lifehacker.com/tech/political-call-to-action-might-be-a-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG65AQZT1BGJW2MP7E11RTHY/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-06T19:00:00.000Z",
    "description": "\n                                                    \n                    No, SendGrid isn't adding a \"Support ICE\" link to your company's emails.\n   ",
    "body": "\n                                                    \n                    No, SendGrid isn't adding a \"Support ICE\" link to your company's emails.\n            \n                        \n    \n                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        February 6, 2026\n            \n            \n                        Credit: Ian Moore/Lifehacker/Adobe Stock\n                            \n    \n        \n        I'm just a humble immigrant, but as a mere (legal!) guest in the U.S., I can't help but notice that the country is rather, shall we say, politically divided these days (sorry if pointing that out seems rude). It seems international scammers have also noticed—and are taking advantage in subtle ways.Recently, investor Fred Benenson blogged about a sophisticated phishing campaign targeting SendGrid users. Phishers sent emails claiming the company was going to add a large \"Support ICE\" button at the bottom of every outgoing email unless users opted out. The emails also featured a large blue button promising to help you disable the message, which, when clicked, naturally led to a fake version of SendGrid that would allow the scammers to steal login information.As scams go, it's not a bad play: Phishing emails work best when they induce a sense of panic—that way you're less likely to think critically about them, and just act. It's not hard to imagine this particular email being effective, given the political climate right now. Say you're running a fair trade coffee company—you wouldn't want a giant \"Support ICE\" button below your signature at this moment in history.But the trick didn't just target left-wing organizations: Variations on the theme claimed the company was going to add pro-LGBT+ and Black Lives Matter banners as well. The differing political messages aren't really the point of the scam, you see—the point is to get business owners to panic about projecting the \"wrong\" values so that they will click the link and give away their login information. Scammers rely on psychological tricks to rope in their victims, all of them designed to get you to stop thinking rationally. Exploiting America's political divide seems to be an excellent way to do that.Political phishing schemes are nothing newThis is just the latest example of a scam that uses politics as a tool. Back in 2020, a fake Black Lives Matter voting campaign spread malware by pretending to be from a county official looking for feedback on the then-exploding political movement. People on both side of the partisan divide ended up clicking through and getting infected.And then there are the campaigns where people pretend to be politicians and beg for donations: Back in 2024 Lifehacker reported on a rash of political donation scams that popped up during the presidential election cycle. That trend is still growing, according to Stacey Wood, a fraud expert writing for Psychology Today. \"What is especially challenging for consumers and voters is that legitimate campaign operatives use many of the same common persuasion techniques employed by scammers,\" she writes.\n            \n                What do you think so far?\n            \n        \nAll of which is to say that international scammers have equal access to American media outlets, are aware of our political divides, and are effective at using them to exploit your emotions in order to steal your money.How to spot a political phishing scamWhat can you do to protect yourself? First, be aware of the tricks that scammers use, and always approach your email inbox with skepticism. Before you click any link from an unfamiliar sender or in an unsolicited email, hover over it to see if it's going to a website that looks legit. Even better: Avoid clicking links altogether, and head to the website for a given service directly by typing it into your browser.Remember, it's easier to fall for a scam than you think, so it pays to be skeptical, especially when you encounter a call to action designed to get you to react in a panic.\n            \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n                        \n                \n            \n                    \n                                            \n                \n            \n                Justin Pot\n                                \n                                            Justin Pot is a freelance journalist who helps people get more out of technology.\n                                    \n                Read Justin's full bio\n                            \n        \n                \n                                            \n    More by Justin\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "That Political 'Call to Action' Might Actually Be a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG65AQZT1BGJW2MP7E11RTHY/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-06T19:00:00.000Z",
      "dateModified": "2026-02-06T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Messenger Apps Are Compressing Your Files, but There's a Workaround",
    "url": "https://lifehacker.com/tech/your-messenger-apps-are-compressing-your-files-but-there-is-a-workaround?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGMK82ZS681VVA1ABK538XP9/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-04T17:00:07.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 4, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Chiociolla / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        In the old days, we'd post our photos and videos on social media for the world to see. Right now, it's far more common to send these pictures and clips to friends and family through private chat groups—but what you might not have realized is that they get pretty heavily compressed along the way.There are many reasons for this: It means the files get sent faster, for example, and that the companies behind these messenger apps don't have to spend quite so much on cloud storage (imagine millions of images being sent by millions of users, all the time). However, the recipients of these photos and videos are missing out, and getting copies that are of a much lower quality.A lot of the time, you can't really tell the difference on a small phone screen, which is why apps can get away with it. But if you're looking at something on a computer screen or trying to print something out to get a permanent physical copy, the compression quickly becomes apparent. It's something most messenger apps do—but there is a workaround if you want your photos and videos shared at full resolution.\nHow much do messenger apps compress your files?\n    \n            \n            Look out for the HD button when sharing on Instagram.\n                                        Credit: Lifehacker\n                    \n    \nMessenger apps are rather coy when it comes to revealing just how much compression they apply: Search the web and you'll hit Reddit threads and support forums rather than actual official documents. Apple admits iMessage applies compression \"when necessary\", and Google acknowledges files \"may have a lower resolution\" when sent through Google Chat, but it's all rather vague.To try and get a bit more clarity, I ran a quick test myself, with a 12MP, 4,000 x 3,000 pixel, 3.4MB image taken on a Pixel. Bearing in mind that compression levels will vary depending on what you're sending, and this was just a test with a single image, here's how the file was changed after it got sent through various DMs:Facebook Messenger: 2,048 x 1,536 pixels, 392KBGoogle Chat: 1,600 x 1,200 pixels, 324KBGoogle Messenger: 4,000 x 3,000 pixels, 3.4MB.iMessage: 4,000 x 3,000 pixels, 3.2MBInstagram: 1,000 x 750 pixels, 138KBWhatsApp: 2,000 x 1,500 pixels, 390KBYou can see there's a lot of compression going on here, but Google Messages and iMessage are the clear winners when it comes to retaining original quality (at least with images)—a good advert for both Apple's proprietary messaging system and for RCS.It's also worth delving into the settings for each app. In Instagram, for example, there's a HD button next to the photo and video picker: When I selected this, Instagram shrank my original photo down to 2,000 x 1,500 pixels, with a file size of 421KB.In its help section, Instagram says it automatically adjusts image compression based on current network conditions, which is something else to think about—you might want to do all your photo and video sharing over wifi (which is what I did here).\n            \n                What do you think so far?\n            \n        \nHow to send files in their original quality through messenger apps\n    \n            \n            It only takes a couple of taps to get iCloud links in Apple Photos.\n                                        Credit: Lifehacker\n                    \n    \nYou can make sure your photos and videos get to your friends and family in their glorious, original quality, but you lose a bit of convenience along the way. Essentially, you need to pick a cloud storage service where your images and videos will be stored in full resolution, and then share links to these files—rather than sharing the files themselves.It's not quite the same immediate experience if you're sending around baby pictures or party pictures: Your recipients will just see a rather dull-looking link instead of thumbnails right inside their apps (though in some cases, there might be a small preview attached). If quality is what matters most to you, this is the way to go when it comes to sharing photos and videos.You're free to use your cloud storage provider of choice, but if there is one made by the same company behind your favorite messaging app, it makes sense to combine them together. In Google Photos on Android, for example, you can tap on a photo to view it, then choose Share and Share again to find the Create link feature: You can then share this link with any contact in any app.For Apple Photos on the iPhone, you can get a link to a photo once you've opened it up by tapping the share button (lower left), then Copy iCloud Link. Again, you can paste this anywhere you like, and it's not much more difficult to share entire folders of pictures rather than individual images.There is an extra advantage to sharing photos and videos this way, in that you can revoke sharing permissions any time you like: New people can be added and other people can be removed from albums showing your toddler growing up for example. It's not as fast and easy as direct file sharing, but you do get a bit more control (and higher resolutions).\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Messenger Apps Are Compressing Your Files, but There's a Workaround",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGMK82ZS681VVA1ABK538XP9/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-04T17:00:07.000Z",
      "dateModified": "2026-02-04T17:00:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Perfect Time to Buy Valentine's Day Flowers Is Earlier Than You Think",
    "url": "https://lifehacker.com/relationships/why-buy-valentines-day-flowers-early?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JJZ68YYNVEB9V2Z133FDE0DB/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-03T18:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            \n        \n            Meredith Dietz\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceMeredith is a marathon runner and stand-up comedian. As Lifehacker’s Senior Staff Writer, she covers personal fitness tech, home gym equipment, and more.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 3, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: ceeceelee / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Planning to express your love with flowers this Valentine's Day? While the gesture is timeless, the pricing certainly isn't: While you might think flowers are something you have to get fresh that day, waiting until Feb. 14 to buy that perfect bouquet means fewer options and higher prices. Here's the case for ordering your Valentine's flowers as soon as possible.Why you should order Valentine's Day flowers right nowThe sooner you order, the less likely you are to pay the top-dollar prices the last-minute shoppers will shoulder. As the big date approaches and inventory dwindles, prices skyrocket. A dozen roses that might cost $50 a week before Valentine's Day could easily jump to $90 or more come Feb. 14. \nEspecially if you're planning to have flowers delivered, early ordering is a must. Florists are absolutely slammed on Valentine's Day, and delivery slots fill up fast. Last-minute orders often can't be guaranteed for same-day delivery, meaning your romantic gesture might arrive a day late—which rather defeats the purpose. When you order early, you can schedule delivery for exactly when you want them to arrive, whether that's first thing in the morning to start your partner's day off right, or perfectly timed during the workday to make all their jealous coworkers. In short, Valentine's Day is about showing someone you care, and nothing shows you care like putting real thought and planning into your gesture. \n            \n                What do you think so far?\n            \n        \nHow to keep Valentine's Day flowers healthy until Valentine's DayThe good news: When properly cared for, roses can stay healthy for five to seven days after purchase. And for even more value and longevity, consider alternatives to traditional roses. Carnations and orchids are beautiful and tasteful while lasting up to two weeks. Not only will you be choosing something more economical, but also, you'll be showing your valentine that they're more special and unique than a boring old rose. (At least, you should be prepared with a little speech in case your lover actually really wanted roses.) To maximize the lifespan of your roses (and most bouquets):Keep them in clean water.Trim the stems at an angle every few days.Remove any leaves below the waterline.Store them away from direct sunlight and heat sources.Add flower food to the water.Remember, Valentine's Day is about expressing your feelings, not emptying your wallet. When you plan ahead, you have time to think about what your partner would really love. You can browse different options, read reviews, compare florists, and make a thoughtful choice rather than panic-buying whatever's available. (And if you're looking for gift ideas that aren't a bouquet, check out my alternative Valentine's Day gift ideas.) \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Perfect Time to Buy Valentine's Day Flowers Is Earlier Than You Think",
      "image": [
        "https://lifehacker.com/imagery/articles/01JJZ68YYNVEB9V2Z133FDE0DB/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-03T18:00:00.000Z",
      "dateModified": "2026-02-03T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Stream Super Bowl LX Without Cable",
    "url": "https://lifehacker.com/entertainment/how-to-watch-super-bowl-lx-without-cable-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HN3S83XW1VRJP7THNSSWMSCA/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-06T13:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 6, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: San Francisco Chronicle/Hearst Newspapers / Contributor via Getty Images\n                            \n    Table of Contents\n    \n        \n        Super Bowl LX kicks off on Sunday, Feb. 8 at 6:30 p.m. ET. This year's broadcast, hosted on NBC, includes pregame coverage starting at 1 p.m. ET and a pregame show featuring Green Day at 6 p.m. ET. Even if you don't have cable, there are a few ways, both paid and free, that you can watch all the action live from Levi's Stadium in Santa Clara, CA. You can watch Super Bowl LX on PeacockThe game will be shown on NBC-owned streaming service Peacock, which is available on the web as well as iOS, Android, smart TVs, and gaming consoles. Peacock doesn't have a free trial, and you have to subscribe to the middle tier—Peacock Premium, which costs $11 per month—to get live sports. Or you can pay $17 per month for ad-free Premium Plus (live sports still have ads). There are a few ways to get around subscribing at full price. Peacock Premium is a perk of both a Walmart+ subscription ($98 per year after a 30-day free trial) and an Instacart+ subscription ($99 per year after a 14-day free trial), so if you have or would benefit from either of these services, now may be the time to sign up. Students qualify for a discounted rate of $6 per month for Peacock Premium. Note that Peacock will also have streaming and on-demand coverage of the Winter Olympics, which begin this weekend, so subscribing for a month may be well worth $11. \nSign up for a live TV streaming serviceThere are a handful of streaming services with live TV that include NBC. Before signing up, check the channel listings for your zip code to confirm NBC is available in your local market. DirectTV Stream: $50 per month for the first month with current promotions, 5-day free trialHulu + Live TV: $90 per month, 3-day free trial (includes ads on Hulu)YouTube TV: Currently $70 per month with promo, 21-day free trial for new usersSling TV (in limited markets): $46 per monthWhen signing up for a free trial, make sure you know when you'll be billed for a paid subscription and cancel before your trial expires. The game will be available in 4K for YouTube TV subscribers (included in the free trial but at an additional fee or at a higher tier with paid plans). The Spanish-language broadcast will be on Telemundo, which is also available on most live TV streaming services. \n            \n                What do you think so far?\n            \n        \nHow to watch Super Bowl LX over the airAnother free (ish) way to get the game is with over-the-air (OTA) TV. Of course, this requires you to invest in a digital TV antenna and have a place to put it that gets good reception. You should check the FCC's reception map to see what signals are available in your area and try your antenna out before game day. Your mileage may vary, so if you want a stress-free watch experience, this probably isn't the best option. Other ways to watch the Super BowlYou can also watch the game through the NFL+ mobile app—a subscription costs $7 per month. Fubo previously carried NBC channels but has been in a contract dispute with NBCUniversal since last 2025. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Stream Super Bowl LX Without Cable",
      "image": [
        "https://lifehacker.com/imagery/articles/01HN3S83XW1VRJP7THNSSWMSCA/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-06T13:30:00.000Z",
      "dateModified": "2026-02-06T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ChatGPT Is Down (Again)",
    "url": "https://lifehacker.com/tech/chatgpt-is-down-again?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGMVP6Q8RJSV91ZSAB2NTGQW/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-04T17:45:21.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 4, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Primakov/Shutterstock\n                            \n            \n                Key Takeaways\n                                            ChatGPT is currently down, as of Wednesday just after noon.\n                                            It follows a period of downtime Tuesday afternoon, which saw over 25,000 user reports on Downdetector.\n                                            OpenAI will likely issue a fix soon.\n                                    \n            \n    Table of Contents\n    \n        \n        If you tried talking to ChatGPT this morning, you might have found it unresponsive—something unusual for the bot that always has something say. It's not your internet connection, and it isn't your OpenAI account: ChatGPT is down. According to Downdetector, owned by Lifehacker parent company Ziff Davis, users started reporting issues with ChatGPT at 11:56 a.m. ET. Those reports ballooned by 12:11 p.m., as the total number of incidents as of this article currently sits above 7,000. If you're an avid ChatGPT user, you might have also had issues with the bot yesterday: Downdetector shows over 25,000 reports of down time starting at 2:56 p.m. Tuesday and resolving around 4:11 p.m. the same day. \n            \n                What do you think so far?\n            \n        \nAs with all outages, OpenAI will likely figure out a patch for the issue soon enough. But these outages are becoming more common. There was the Verizon outage, of course, but other services like TikTok have also experienced intermittent periods of downtime. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ChatGPT Is Down (Again)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGMVP6Q8RJSV91ZSAB2NTGQW/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-04T17:45:21.000Z",
      "dateModified": "2026-02-04T17:45:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Redditors Have Figured Out a Way to Save Hundreds on a Whoop Subscription",
    "url": "https://lifehacker.com/health/reddit-discount-whoop-subscription?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGQK4GSV1BX0429JKSG48PAK/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-05T19:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Beth Skwarecki\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Beth Skwarecki\n                            \n        \n            Beth Skwarecki\n                \n                                            Senior Health Editor\n                                    \n            \n            \n        \n            ExperienceBeth Skwarecki is Lifehacker’s Senior Health Editor, and holds certifications as a personal trainer and weightlifting coach. She has been writing about health for over 10 years.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 5, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Beth Skwarecki\n                            \n    Table of Contents\n    \n        \n        I’ve always said there’s no good reason to buy an older model Whoop band, since the company will give you the latest model for free when you subscribe. But on Reddit, some people who already own Whoop 5.0 bands are buying up old 4.0 bands to get a bargain on the subscription price. There have been a few posts on this, but perhaps the master of this hack is Redditor u/thelifeofcb, who found Whoop 4.0 bands, new in box, at a T. J. Maxx store for $39 each, and bought several. This allowed them to extend their existing subscription—they wear a Whoop 5.0—for several years at essentially a $200/year discount.How the discount Whoop hack worksWhen new Whoop bands are sold through retailers, they come packaged with a one-year subscription. The idea is that you’ll create an account on the app, pair the band you bought through the app, and get credit for a 12-month subscription—since that was the main thing you paid for when you bought the band at full price. \nBack in the Whoop 4.0 days, there was only one tier of membership. When tiers were introduced, those subscriptions rolled over to a Peak subscription, the one that currently goes for $239/year. That means a 4.0 device—however much you pay for it—can give you a year-long Peak subscription. Redditors have found that pairing one of these new Whoop 4.0 devices added a year’s subscription to their accounts, whether they were a new customer or not. That means you can buy a few discount bands, pair them all, and enjoy several years’ worth of discounted membership. That $39 band is thus a $200 discount on each year’s membership. Some say that they received an offer to upgrade to a Whoop 5.0 band if they added two years' worth of membership (paired two bands).That $39 price is an unusually good one, but you can still get a significant discount anywhere new Whoop 4.0 devices are sold. For example, Amazon has 4.0 devices right now for $124, which is still about half the price of a Peak subscription. You can find them cheaper on eBay, but I’d be wary of buying a box that may have been opened. I’ll explain that below. Scoring a cheap Whoop won't always work, thoughWhile Redditors say this works—and it does fit with my understanding of how subscriptions are paid for and claimed in the app—there are a few pitfalls to beware of. \n            \n                What do you think so far?\n            \n        \nThe first is that this applies to new-in-box devices that (1) are sold with a subscription, and (2) have never been paired. The hack would not work with a hand-me-down device that has already been used, nor with a new one that has already been paired and its subscription claimed. For example, you can’t pass the same band to a friend and expect it to give both of you a subscription. This means you have to be sure the band you buy has not been opened. If a store accepts returns of opened items, they may not realize that the valuable item here—the digital subscription—has already been claimed. If they put it back on the shelf, and you buy it, you’re out the purchase price and you still don’t have a subscription. The other issue is just the e-waste that this causes. You’re buying a device just to throw it in the trash. But I’d argue that’s Whoop’s fault, not yours—those devices are obsolete and headed for the landfill (or responsible electronics recycling program, if you can find one) regardless of what you do. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Redditors Have Figured Out a Way to Save Hundreds on a Whoop Subscription",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGQK4GSV1BX0429JKSG48PAK/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-05T19:00:00.000Z",
      "dateModified": "2026-02-05T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Feature Lets You Autofill Your Credit Card on Any Site or App on iPhone",
    "url": "https://lifehacker.com/tech/how-to-autofill-your-credit-card-on-any-site-or-app-on-iphone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGJTSNR1CF7SJXW2RDVJS694/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-04T14:00:24.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 4, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Funstock / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        A useful feature baked into iOS 26 is the ability to autofill credit cards stored in Apple Wallet across apps and browsers. If you don't use a password manager (which you absolutely should), AutoFill via Apple Wallet saves you the trouble of having to manually enter your credit card information every time you want to make a purchase on your phone. Even if you have a password manager, though, not all plans allow payment card storage and autofilling, and the feature can be clunky on those that do. As 9to5Mac points out, AutoFill for credit cards was already available in Safari and is now supported systemwide, managed through Apple Wallet. How to set up and use AutoFill in Apple WalletFirst, you'll need to add your payment cards to Apple Wallet's autofill list (which is separate from your general wallet). Tap the three dots in the upper-right corner and select AutoFill. Tap Add Card to input card details manually or use the camera scan feature. The security code is optional, meaning you can add and store it in Apple Wallet AutoFill or enter it for each transaction. \n            \n                What do you think so far?\n            \n        \nTo autofill saved credit cards, simply tap any form field to bring up the Paste/AutoFill option. Select AutoFill > Credit Card, authenticate with Face ID or Touch ID, and tap the card you want to enter. You'll have to repeat the process for each field, as Apple Wallet won't autofill the whole form at once. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Feature Lets You Autofill Your Credit Card on Any Site or App on iPhone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGJTSNR1CF7SJXW2RDVJS694/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-04T14:00:24.000Z",
      "dateModified": "2026-02-04T14:00:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Car Icons Are Disappearing From Google Maps in Android Auto (but You Might Be Able to Fix It)",
    "url": "https://lifehacker.com/tech/what-to-do-if-your-car-icon-disappears-from-google-maps-in-android-auto?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGQNEWSTZPJM7HY91D8X1ZP8/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-05T21:30:02.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 5, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Vladimka production / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Car icons are disappearing from the navigation screen when using Google Maps in Android Auto.\n                                            The issue seems to trigger when navigating away from Google Maps, and then returning to the app.\n                                            Community members have developed fixes, but they might not work for everyone.\n                                    \n            \n    Table of Contents\n    \n        \n        Android Auto users are reporting a bug that is making their cars disappear from the road—ok, not literally, but within Google Maps. On both Reddit and Google's own support forums, drivers now say their car icons are sporadically disappearing from their navigation screens while using the Google Maps app through Android Auto. Some users have discovered workarounds, but the fixes don't appear to be consistent for everyone. Here's what's happening, and what you can do to try to fix it.The news first started popping up six days ago, on a Reddit thread where multiple users reported problems with their car icons disappearing while using the Google Maps app through Android Auto. According to these drivers, when the bug was triggered, the map would move around normally, and traffic data and navigation instructions continued to display as expected. However, the icon indicating their car's position would suddenly disappear from their screen, making it difficult to know where exactly they were in comparison to the road. That's not ideal if you're trying to judge when your next turn is coming up.According to the thread's original poster, the issue popped up for them on the Android Auto version 16.1 release, although others mentioned the issue occurring as far back as version 15.9. The bug doesn't appear to happen all the time, but \"reliably\" appears when leaving Google Maps, opening another app in fullscreen, and either returning to Google Maps in fullscreen or pulling it up alongside the new app in a splitscreen view. To get their icon back, the original poster had to force quit Google Maps on their phone, but this wouldn't stop the bug from occurring again in the future. Google itself has not yet offered public comment on the issue, although I've reached out to the company and will update this post when I hear back.\nHow to fix Google Maps in Android Auto If you're encountering a disappearing car icon while using Google Maps through Android Auto, there are a few fixes that have worked for community members, although whether they'll work for everyone appears to be inconsistent.Try updating or downgrading your Android Auto versionThe timing of this bug appears to line up with the Android Auto v16.1 release, which launched last week. While the bug has been reported appearing on older versions of the app, like Android Auto v15.9, it could be worth trying out another version of Android Auto to see if it clears up the issue. For instance, one user mentioned that installing Android Auto V16.0.66 fixed the issue for them. If you're on an older version, you can update to a newest one from the Android Auto listing on the Play Store. If you're on a newest version and want to try an older one, though, you'll need to uninstall your Android Auto app and manually sideload the older version using a trusted APK file. Because these can be tricky to verify, this might not be the best option for most people.\n            \n                What do you think so far?\n            \n        \nTry changing your Android Auto car iconMultiple users in the original Reddit thread, including the original poster, pointed out that the bug only seems to affect them when using a non-default car icon. Until Google issues a fix, one solution might be to change your car icon back to the standard white arrow within a blue circle. To change your car icon in Google Maps, open the app on your phone while not connected to Android Auto. Start navigating to a location. Tap on your car icon, and swipe left or right to adjust the icon until you land on the default white arrow within a blue circle. The next time you connect your Google Maps app to Android Auto, your car's icon should be updated. Note that this isn't a guaranteed fix. One user on a Google support forum, for instance, said that their arrow icon also disappeared from Google Maps in Android Auto when returning from another app.Avoid triggering the bug, or use an alternative navigation appIf there is one saving grace to this bug, it's that the circumstances for triggering it seem to be pretty consistent. That means you can largely avoid it if you simply don't leave the Google Maps app once you open it. But while that might be OK for short trips, it's not ideal for longer ones, where you might want to adjust a podcast or playlist during your drive. You can manually restart your Google Maps app on your phone every time the bug pops up, but not only is that annoying, it's possibly dangerous if you're in the middle of a drive.If none of the above fixes work for you and you want to retain the ability to exit your fullscreen navigation app without losing your car icon, it might be worth putting Google Maps to bed for now and using an alternative navigation app. Google's own Waze app, for instance, works with Android Auto and does not seem to have this bug right now. Alternative navigation apps do have their own pros and cons, as Waze focuses less on comprehensive mapping and more on real-time crowdsourced traffic information when determining routes. However, it might be worth a shot. If Waze doesn't work for you, other popular navigation apps compatible with Android Auto include Sygic GPS and TomTom - Maps & Traffic (formerly TomTom AmiGo).\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Car Icons Are Disappearing From Google Maps in Android Auto (but You Might Be Able to Fix It)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGQNEWSTZPJM7HY91D8X1ZP8/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-05T21:30:02.000Z",
      "dateModified": "2026-02-05T21:30:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "10 Fitness Hacks Every Apple Watch User Should Know",
    "url": "https://lifehacker.com/health/fitness-hacks-every-apple-watch-user-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGTA9NMNS8YPHC0HHV57657D/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-06T22:00:51.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Beth Skwarecki\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Beth Skwarecki\n                            \n        \n            Beth Skwarecki\n                \n                                            Senior Health Editor\n                                    \n            \n            \n        \n            ExperienceBeth Skwarecki is Lifehacker’s Senior Health Editor, and holds certifications as a personal trainer and weightlifting coach. She has been writing about health for over 10 years.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 6, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    Table of Contents\n    \n        \n        The Apple Watch is a powerful tool for following and tracking exercise. We’ve already shown you 10 hacks for all Apple Watch users, but I’m here with a follow-up on the fitness features, specifically. With these lesser-known settings, apps, and features, you can get more out of your workouts and your health data.Give your Apple Watch rings a \"rest day\"\n    \n            \n            \n                                        Credit: Beth Skwarecki\n                    \n    \nThe Apple Watch’s Fitness app famously includes three rings (Move, Exercise, Stand) that you can close with activity throughout the day. Not only should you change your Move and Exercise goals to numbers that work for you (raising or lowering them as appropriate), you can also schedule in different goals for each day. Originally, your Move, Exercise, and Stand goals were the same every day, but these days you can change your ring-closing goals, including adding rest days. Go to the Fitness app and tap the Activity Rings card, and then tap the “+/-” icon next to each goal. You can create a weekly schedule so that you have lower targets on certain days. You can also change a goal temporarily just for today—for example, reducing your Stand hour goal on a day you’re taking a road trip. \nWear your Apple Watch on your arm (or ankle)The Apple Watch is meant to be worn on the wrist, but that doesn’t mean you have to wear it there. If your workout has you snatching kettlebells or bench pressing in wrist wraps, consider wearing the Watch on your upper arm. Or if you use a standing desk, your steps may not register unless you put the Watch on your ankle. Both of these locations will likely require a bigger wristband than what came with the Watch. Fortunately, you can buy an extra-long band, like this one. Change the Apple Watch's app view for easier tapping during a workout\n    \n            \n            \n                                        Credit: Beth Skwarecki\n                    \n    \nThis is a tiny hack, but one that makes it so much easier to operate your watch mid-workout: Press the crown, and you’ll see all your installed apps. By default, they appear as little icons clustered together. You can rearrange them if you like, but no matter the arrangement, they’re tough to accurately tap while you’re running down the street. Make life easier on yourself by scrolling to the bottom of this screen, and tap List View. This puts your apps in an alphabetical list, with the name next to each icon. It’s now far easier to tap anything you might need during your workout.Use Bevel to gather your Apple watch data into a convenient dashboard\n    \n            \n            \n                                        Credit: Beth Skwarecki\n                    \n    \nThe Apple Watch collects a lot of data, but Apple doesn’t give you a convenient way to view it all in one place. The Fitness app has workout data, and the Health app stores everything else—but the Health app isn’t as user-friendly as you might wish. Third-party apps have stepped in to fill the gap. Bevel, for example, provides recovery scores and collects data in much the same way you’d see from a Whoop or Oura ring. There are other apps that do the same thing, like Athlytic, but I’m recommending Bevel because it has a free tier (and most of its functionality is on that tier). If you like the experience, consider shopping around to see if you prefer other apps.Create custom intervals on your Apple WatchThe Workout app on Apple Watch has evolved quite a bit from its original format as a simple tracker with a start and stop button. The current version of the Fitness app has a little timer icon in the corner of each workout type, under the Workouts tab. Tap that, and you can view and edit custom workouts. Program yourself an interval workout, or a workout of a specific length. You can do this most easily from your phone—Apple has instructions here. Use your Apple Watch to race yourselfIf you run or bike the same route often, try the Race Route feature. Routes are automatically generated after you do the same run twice. On the Watch itself, go to the Workout app and choose a Run or Cycle workout, then tap the timer icon to bring up options including race routes. You can choose to race your personal best time on that route, or just your last workout on that route. During the activity, you’ll see whether you’re keeping pace with that previous workout.\n            \n                What do you think so far?\n            \n        \nDo a workout even without the Apple Watch\n    \n            \n            It may look empty, but it got tracked.\n                                        Credit: Beth Skwarecki\n                    \n    \nOne of the best upgrades to iOS 26 is that the Fitness app can now track workouts even without the Apple Watch. If you left your watch at home but still want to get a run in, you can track it directly from your phone. Just go to the Fitness app, then Workout, and then tap whichever type of workout you’d like to do. If you choose an outdoor workout like a run, your phone will track your distance and pace with the phone’s GPS. If you choose an indoor workout, the app can still log the workout with a timer, but it won’t be able to collect any data. You’ll get a readout with the amount of time you worked out, and an estimate of your calorie burn, and you can rate your effort so the workout counts toward your training load. If you have a device that can measure your heart rate—like a chest strap or headphones like the Powerbeats Pro 2—you can pair that device directly to your iPhone, without involving the watch, and track your workout through the Fitness app with heart rate data intact.Connect your Apple Watch to a treadmillThe Apple Watch is pretty good at judging distance and speed outdoors when you run, and your iPhone can do a good job of that, too. But once you’re indoors on a treadmill, only the treadmill knows how far you’re running. The Apple Watch’s distance estimations aren’t always very good. That is, unless you’re using a treadmill that can beam data directly to your watch. The treadmills in a lot of commercial gyms have this feature through a system called GymKit. In your Settings on the watch, go to Workout and turn on Detect Gym Equipment. When you use a compatible gym machine, there will be a spot on the console to tap your watch. You’ll hear a beep, and then the data on your watch will be synced to the data on the machine. Install WorkOutDoors on your Apple Watch for more run data and mapping\n    \n            \n            \n                                        Credit: Beth Skwarecki\n                    \n    \nWe’ve seen that the stock Workout app has plenty of great features for running and other workouts, but many runners and hikers prefer a different option. The Apple Watch app WorkOutDoors gives Garmin-level mapping and data analytics during your run. It takes a bit of time to learn your way around all the features, but this is an incredibly powerful tool for just a small investment ($8.99 as a one-time charge).Top up the Apple Watch's battery before sleepIf you use the Apple Watch to track your sleep, you don’t have the option of charging it while you sleep. But don’t worry if it’s close to bedtime and you’re low on battery—Apple Watches, especially the most recent models, are designed to charge quickly for exactly this reason. The Apple Watch Series 11 only needs five minutes of charge time for eight hours of sleep tracking. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 Fitness Hacks Every Apple Watch User Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGTA9NMNS8YPHC0HHV57657D/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-06T22:00:51.000Z",
      "dateModified": "2026-02-06T22:00:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I Tried Malwarebytes' ChatGPT App, and It's Actually Good at Detecting Scams",
    "url": "https://lifehacker.com/tech/malwarebytes-chatgpt-app-impressions?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGSJ8K8YYSPM82BZDG46DYXW/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-06T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 6, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Sharaf Maksumov / Lifehacker\n                            \n    Table of Contents\n    \n        \n        A few months ago, ChatGPT got an app store of its own, which means you can access tools like Photoshop and Apple Music right inside the ChatGPT prompt box. Now Malwarebytes has joined the ChatGPT app store, which means you can get some expert help when investigating web links, emails, text messages, domains, and phone numbers you think might be suspicious.The app is free to use for everyone, whether or not they're signed up to a paid ChatGPT subscription, and you can enable the tool via the ChatGPT app store or by entering the prompt \"Malwarebytes, is this a scam?\" Once you've used the app for the first time, you can access it again via the + (plus) button on the prompt box.Malwarebytes' ChatGPT app can test links, sites, and phone numbers\n    \n            \n            Malwarebytes will do a deep security dive into links you provide.\n                                        Credit: Lifehacker\n                    \n    \nYou can paste just about anything you like into a conversation with the Malwarebytes plugin, but there are certain approaches that scammers will often take—including links contained in phishing emails—that make for good candidates to test this thing out. I dived deep into my email spam folder to find some URLs to test Malwarebytes on, and gave it a few trustworthy web addresses as well—you just copy the link into the prompt box and ask the app for an assessment.\nMalwarebytes successfully sifted out the scam links from the safe ones, even when it didn't have any specific information in its databases about the links I was providing. When it was unsure, it said so, with lots of extra context: For example, for one URL I was told the address was \"a legitimate email security and tracking service used by companies to rewrite links\" but one that scammers also used to conceal the link destination.You also get an assessment of the domain name: When given a link to a Lifehacker article, the plugin correctly identified that it was a legitimate domain with a registered owner, even though it didn't have any specific information about the URL. Malwarebytes was also able to spot domain redirecting, a trick frequently used by scammers.Phone numbers can be given to Malwarebytes as well: When I tested this out with a few scam calls I've had, these numbers were correctly identified as coming from scammers or at least being suspicious. I like the way the app gives you some context to its thinking (explaining how spam call centers work, for example), and will also offer up advice about next steps and how to stay safe.Something else I appreciated was that the Malwarebytes app has a memory inside ChatGPT: If you post a series of links and numbers in the same chat thread, as I did, then it will try and put them all in context (explaining why one URL is potentially more dangerous than another, for example).The Malwarebytes ChatGPT app can also look at messages and emails\n    \n            \n            You'll get a list back of red flags in email and text message content.\n                                        Credit: Lifehacker\n                    \n    \nYou can also give the Malwarebytes app some text you've come across in an email or text message and get a verdict on this too—you can even type in a transcript of a conversation you're having on the phone, if you want. The plugin will scan the text for phrasing that scammers often use and will alert you of any other red flags.\n            \n                What do you think so far?\n            \n        \nI tried this out with a variety of spammy text, and again Malwarebytes scored highly in terms of recognizing anything dodgy. As before, if it came across something it wasn't sure about, it would explain the reasons why and suggest some next steps. The responses also include some detail on why different scam approaches are taken and why they sometimes work, and how they might escalate—so if you get a message purporting to be from a family member asking for help, Malwarebytes tells you why these scams are common and how they're used to steal identities or money.It's an intelligent system, in that it'll ask you questions about the texts or emails you've received: If it's not sure about something, you'll be told about extra checks you can run (like looking at the \"reply to\" address on an email). However, the usual ChatGPT sycophancy does start to grate a bit, as you're constantly told that you're doing the right thing and that you're right to be suspicious.The app taps into Malwarebytes Threat Intelligence, so it should be able to keep you protected against the latest threats (making it more helpful than a Google search or just a regular ChatGPT query). From the examples I used at least, it comes across as a security tool that's accurate, comprehensive, and easy to use—one that's well worth keeping close at hand if you come across potential scams you're not sure about.Disclosure: Ziff Davis, Mashable’s parent company, in April 2025 filed a lawsuit against OpenAI, alleging it infringed Ziff Davis copyrights in training and operating its AI systems.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I Tried Malwarebytes' ChatGPT App, and It's Actually Good at Detecting Scams",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGSJ8K8YYSPM82BZDG46DYXW/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-06T15:00:00.000Z",
      "dateModified": "2026-02-06T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Is What You’ll Find the Best Deals on During This Year’s Presidents Day Sales",
    "url": "https://lifehacker.com/tech/what-to-buy-during-presidents-day-sales-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGJGCTJ9YB7MTGTJXAM9B72Z/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-03T20:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                            \n        \n            Daniel Oropeza\n                \n                                            Staff Writer\n                                    \n            \n            \n        \n            ExperienceDaniel is a Staff Writer for Lifehacker covering tech deals and reviewing TVs, headphones, speakers, and projectors. He earned his master’s in journalism from Columbia University and has reported for the Miami Herald. He lives in Atlanta.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 3, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Getty Images/South_agency\n                            \n    Table of Contents\n    \n        \n        It feels like the year just started, but we're already approaching the first major retail holiday of 2026, and as Lifehacker's deals writer, I'm here to tell you how to make the most of the upcoming Presidents Day sales. Here are my tips on which products are likely to be a great buy, and which ones your better off waiting to pick up during a future sale.When is Presidents Day 2026?Presidents Day is a federal holiday that originally started to honor George Washington's birthday, but eventually evolved to recognize all U.S. presidents. Presidents Day falls on the third Monday of February each year, which means this year, it will take place on Feb. 16, 2026. Presidents Day sales, then, are usually concentrated on the weekend before the holiday, which means that this year, you're likely to see the biggest discounts from Feb. 13–16—and I wouldn't be surprised if some retailers start their sales even earlier.Presidents Day sales generally bring big discounts to items like home furnishings and mattresses, as well as major appliances like refrigerators and washing machines, and you can expect the same this year. As we're getting close to the end of winter, you'll likely also see price drops on winter gear like snow blowers, space heathers, and power generators, plus cold weather clothing like coats, as retailers try to sell down their inventory and make room for next season's items. You'll likely see some tech deals as well, as older model TVs and laptops will see price cuts to make room for newer models (some of which likely debuted at January's CES show). If you're planning to shop in one of these categories, start paying attention to prices now, so you'll be able to spot good discounts come the holiday weekend.What items aren't worth buying during Presidents Day sales?Seasons come and go, and even as retailers push their winter inventory out, they will try to sell you their spring products. You should hold off on picking these items up for now, as you'll likely be paying a premium price—even items that are \"marked down\" are likely to see bigger price cuts later, if you can wait.\n            \n                What do you think so far?\n            \n        \nWho will be holding Presidents Day sales?All major retailers will be having a Presidents Day sale, including Amazon, Best Buy, Target, Walmart, and others. The sales will generally be available both online and in-person (except at Amazon, of course).Should you wait for Amazon's Big Spring Sale? Presidents Day is a time-honored tradition, but in recent years, the biggest sale of the early part of the year has been Amazon's Big Spring Sale (with other retailers planning their own sales events around the same time). While we don't know the exact dates, its likely this year's will take place around the same time as last year—in mid- to late March. Is it worth waiting to shop until then? It depends on what you want to buy.The online retailer debuted the Big Spring Sale in 2024 with many sales on many different categories, but especially on tech, so if you're eyeing a specific tech product but haven't found a great deal yet, it's worth waiting to see if it is discounted in a month or so. However, if you're shopping for winter gear, mattresses, furniture, or large appliances, you'll likely see better discounts during Presidents Day sales.\n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Is What You’ll Find the Best Deals on During This Year’s Presidents Day Sales",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGJGCTJ9YB7MTGTJXAM9B72Z/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-03T20:30:00.000Z",
      "dateModified": "2026-02-03T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spotify Just Added Three New Lyrics Features, Including One I've Been Dying For",
    "url": "https://lifehacker.com/tech/spotify-just-added-these-lyrics-features?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGMRFKQ96DMR9J5NVC1W89XF/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-04T18:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 4, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Spotify\n                            \n            \n                Key Takeaways\n                                            Spotify just announced three new lyrics features for free and Premium users.\n                                            Premium subscribers can now download lyrics for offline playback.\n                                            All users will find lyrics in a new location going forward, and lyrics translations is rolling out to all users globally.\n                                    \n            \n    Table of Contents\n    \n        \n        Built-in lyrics are one of my favorite features of modern music streaming services. Back in ancient times, I had to google the lyrics to the songs I was listening to—which was fine if I was near a computer, but impossible when I was on the go with my iPod. This is probably why there are so many songs I think I know the words to, only to discover, once I read the actual lyrics, that I am sorely mistaken. Built-in lyrics are thus a feature that is equal parts useful and humbling. As it happens, Spotify's existing lyrics features are getting some upgrades to kick off February. The company announced three key updates on Wednesday—two that impact free users, and one exclusive to Premium subscribers. Spotify might not offer Apple Music's dynamic lyrics, but these updates should still be welcomed by anyone who likes reading along to their music. Spotify now supports offline lyricsThe biggest announcement of the day—in my opinion, anyway—is offline support for lyrics. This is always something that frustrates me whenever I'm using my phone without cellular service. Say I download some albums to listen to on a flight: When I try to listen to them in airplane mode, lyrics are unavailable. Being able to download the lyrics when you grab a song or album is a small but actually meaningful upgrade.\nUnfortunately, offline lyrics are not available free of charge: At this time, the feature is only available to Premium subscribers, which makes sense, given that free users can't download music for offline listening anyway—only podcasts.Lyrics are moving to a new location in the Spotify appTraditionally, lyrics have appeared at the bottom of the player window in the Spotify app. To view them, you need to scroll down, then tap on the lyrics window to fully expand it. It seems Spotify wasn't content with this UI. The company says that in its testing, it finds that placing the lyrics directly below the album art, rather than below the player, makes them easier to interact with. And so that's where the lyrics are moving. The company calls these \"lyrics previews,\" as you see just a snippet of the lyrics at one time. This change is rolling out to both free and Premium users on iOS and Android. If you'd rather not see the lyrics at all, you can tap the three-dot menu and choose \"Lyrics Off.\"\n            \n                What do you think so far?\n            \n        \nSpotify is adamant that this new placement won't change lyric sharing. You'll still be able to send specific lyrics to friends and social media platforms. You'll just need to do so from the new lyrics window. Spotify now support lyrics translations worldwideSpotify's lyrics translation feature makes it easy to figure out what artists are singing about when you don't speak their particular language. When you listen to a song that doesn't match your device's system language, you'll find a translate button in the lyrics window. Tap that, and Spotify will include translations beneath each line of the song, so you can follow along. According to Spotify, this feature was available in more than 25 markets as of the end of last year, but now, the company is rolling out the feature worldwide. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spotify Just Added Three New Lyrics Features, Including One I've Been Dying For",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGMRFKQ96DMR9J5NVC1W89XF/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-04T18:00:00.000Z",
      "dateModified": "2026-02-04T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Avoid Paying Crunchyroll's Recent Price Increase",
    "url": "https://lifehacker.com/entertainment/how-to-avoid-paying-crunchyrolls-recent-price-increase?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGN5P4G0PAEEDJNP61768PSA/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-04T21:00:08.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Koshiro K / Shutterstock.com\n                            \n            ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Koshiro K / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Starting March 4, Crunchyroll's subscriptions will increase in price.\n                                            The least expensive Fan Tier is going from $7.99 to $9.99 a month.\n                                            On the high end, the Ultimate Fan Tier will go from $15.99 to $17.99.\n                                            Crunchyroll's free, ad-supported tier was discontinued at the end of 2025.\n                                    \n            \n    Table of Contents\n    \n        \n        Anime fans are about to feel a bit of a squeeze from your Crunchyroll subscription. For the second time in two years, the streaming service is raising prices, this time across all of its plans, including the entry-level Fan Tier. This comes shortly after the company discontinued its free, ad-supported tier on Dec. 31.The new tiers and their pricing will be as follows:\n            \n                What do you think so far?\n            \n        \nThe Fan Tier will go up from $7.99/month to $9.99/month. This tier offers basic access to the full Crunchyroll library, and the ability to download shows to a single device for offline viewing.The Mega Fan tier will go up from $11.99/month to $13.99/month. At this tier, you can stream on up to four devices at once, download content in HD for offline viewing, and get access to the Crunchyroll Game Vault.The Ultimate Fan Tier will go up from $15.99/month to $17.99/month. This tier adds access to Crunchyroll Manga, streaming on up to six devices at once, and a swag bag after you've been subscribed to this plan for a year. The new pricing will kick in on your first billing date after March 4. If you're not already subscribed, however, there's still a little bit of time to sign up and get the (slightly) lower price for your first month. While existing users can't lock in the lower price, Crunchyroll is offering a limited-time upgrade to an annual plan for the Fan Tier for $66.99/year, which comes out to $5.58/month. If you're confident you're still going to be subject to your anime addiction a year from now, this is going to be your best way to save money in the long run.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Avoid Paying Crunchyroll's Recent Price Increase",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGN5P4G0PAEEDJNP61768PSA/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-04T21:00:08.000Z",
      "dateModified": "2026-02-04T21:00:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AirDrop Is Coming to Even More Android Phones This Year",
    "url": "https://lifehacker.com/tech/airdrop-is-coming-to-more-android-phones-this-year?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGSQ3C35MZAK5MNA9NQ5QQMM/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-06T16:04:03.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 6, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: sdx15 / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Additional Android phones are about to get AirDrop compatibility in Quick Share.\n                                            Currently, the feature is limited to the Pixel 10 line of phones.\n                                            Google says it's working with partners to bring AirDrop to other Android devices \"very soon.\"\n                                    \n            \n    Table of Contents\n    \n        \n        Last November, Google announced that it had managed to make Apple's AirDrop compatible with Quick Share on its Pixel 10 phones, allowing them to easily share photos and files with iPhones, iPads, and Macs. The feature was intuitive, and to quote my colleague Jake Peterson, it's worked so seamlessly that it was almost like Quick Share and AirDrop \"were built this way from the beginning.\" But for other Android users, it continued to be business as usual, leading to awkward texts and emails to share files across iOS and Android. Now, though, Google confirmed it's working to bring AirDrop to other Android phones, too, including phones it doesn't make. At an event attended by Android Authority, Android Vice President of Engineering Eric Kay said, \"Last year, we launched AirDrop interoperability. In 2026, we're going to be expanding it to a lot more devices.\"To a degree, we kind of knew this was coming. While many Pixel only features are implemented via a special Pixel-only system component, Google added AirDrop compatibility to the Pixel 10 by upgrading Quick Share from a system level feature to a full-on app, with its own APK. That laid the groundwork for other Android phones to eventually get AirDrop compatibility of their own, since they can all use this app. For instance, Nothing CEO Carl Pei said in November that his team was \"already exploring\" adding AirDrop compatibility to Nothing phones, while chipmaker Qualcomm said it \"can't wait\" for the feature to be enabled on Snapdragon—commonly used in Samsung's Galaxy phones—in the \"near future.\"Now, it seems like the wait for AirDrop across the rest of Android won't be much longer. While Kay didn't give an exact timeline beyond 2026, he did say that Google is already \"working with our partners to expand it into the rest of the ecosystem, and you should see some exciting announcements very soon.\" That's it as far as official communication goes, but I've reached out to Google for additional comment and will update if I can snag more details. In the meantime, we do have a few possible dates where we could expect the feature to be announced.\nThe soonest might be the next Samsung Unpacked, where the company is expected to announce the S26 lineup of phones. According to rumors, that'll take place on Feb. 25, and it's not unusual for Google to make an appearance during Unpacked to discuss new features coming to Android that the new phones can take advantage of. Alternatively, Google might save the announcement for its next Google I/O event, which would likely be sometime in May. Or it could just drop the feature online without the fanfare of an official event.\n            \n                What do you think so far?\n            \n        \nEither way, I can't wait. I take a lot of photos on my phone for this job, and while sending them from my personal iPhone to my work Mac usually isn't an issue, getting them off an Android phone I might be reviewing can be a much bigger pain. As someone who's got an Android tablet, an iPhone, a MacBook, and a Windows PC all within 5 feet of me right now, anything that helps bridge these ecosystems together is a good move in my book.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AirDrop Is Coming to Even More Android Phones This Year",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGSQ3C35MZAK5MNA9NQ5QQMM/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-06T16:04:03.000Z",
      "dateModified": "2026-02-06T16:04:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Create a Sleep Routine That's Perfect for You",
    "url": "https://lifehacker.com/create-perfect-sleep-routine?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2H6ZAF1DRRM8M0G16ZFB38/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-06T21:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    If you're low on energy all the time, have you tried spending eight hours in a cool, dark, quiet room?\n            \n                        \n    \n                    \n        \n        \n        \n    \n                                Beth Skwarecki\n                            \n        \n            Beth Skwarecki\n                \n                                            Senior Health Editor\n                                    \n            \n            \n        \n            ExperienceBeth Skwarecki is Lifehacker’s Senior Health Editor, and holds certifications as a personal trainer and weightlifting coach. She has been writing about health for over 10 years.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        February 6, 2026\n            \n    We may earn a commission from links on this page.\n    \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        It's amazing how many problems can be solved with a little sleep hygiene. If you often feel low on energy, one of the first things you should ask yourself is how much sleep you're getting. Good sleep also helps our overall health, our recovery from exercise, our ability to focus, and more. And while there are plenty of gadgets and biohacks that claim to help, the fundamentals of sleep hygiene are basic and simple. How to know if you need more sleepMost adults need seven to nine hours of sleep, on average, each night. This varies: you might be a seven-hour person or a nine-hour person. (Young people usually need even more; older adults may be okay with less.) So if you’re feeling tired all the time, an easy gut check is to note how much time you spend in bed, on average. If it's fewer than seven hours, it's probably not enough. And even if it's within that seven- to nine-hour window, try getting an extra hour or two of sleep for a few days in a row. If you feel a lot better, you have your answer. Wearables like smartwatches and rings can help collect data, but remember that the main thing they can tell you is how much sleep you're getting. (Sleep \"quality\" scores and even sleep stages are not necessarily reliable.) To call out a few of my favorites: the Oura ring is pricey ($349-$499) but comfortable to wear and presents data nicely. The Amazfit Helio Strap is a bargain at $99 and can track workouts, too. Garmin's Index Sleep Band ($169) is built for comfort while you sleep, but gives the same data as Garmin watches, so you may just want to find a watch you like and stick with that. If you have trouble waking up on time but easily fall asleep when you’re sitting quietly (like watching a movie), that's another sign you're probably not getting enough sleep. If you sleep in when you get the chance, your wake-up time is another hint. If you sleep in two hours or more past your normal time, that's your body applying a short-term fix (getting enough sleep now) to a long-term problem (chronically getting too little sleep). If you know you should sleep more, but you can’t seem to figure out how, below are the basics of sleep hygiene you need to master.Stick to a sleep scheduleSet a wake-up time that you can stick to every day. Consistency is important here: don’t set the alarm for 6 a.m. on weekdays and sleep until noon on weekends. If you can’t be perfectly consistent—for example, if you work different shifts—adjust as needed, but try to do your best. Next comes setting a bedtime. Figure out what time you need to hit the hay to get enough sleep before your alarm goes off. Then work backward from that to figure out when to start changing into jammies and whatever else your nighttime routine involves. (More on that routine below.)Crucial to both steps is prioritizing sleep so you can actually get yourself on schedule. If you’ve been having trouble getting enough sleep lately, give yourself a week or two to make your bedtime and wake-up time (and nine or so hours in between) the highest priority appointments in your calendar. Don’t go out too late, and don’t stay up revenge procrastinating. There will be time for occasional indulgences once your everyday schedule is more consistent. Include these four things in your bedtime routineOkay, so what goes into that routine? Feel free to personalize the specifics, but sleep experts recommend that you include the following as basic building blocks: At least 30 minutes dedicated to winding down. Don’t expect to switch off the lights and instantly be able to zonk out.No screens right before bedtime. No, not even with blue-blocking glasses. Those glasses don’t actually block very much blue light anyway. Videos and social media keep your brain awake and unrelaxed, so they don’t really have a place in your wind-down time anyway. Dim the lights. A cool, dark bedroom makes it easier to fall asleep and stay asleep. Do something relaxing. Read a chill book. Take a luxurious bath. Do some breathing exercises. Whatever works for you. Sticking to this routine not only helps you get into a relaxed mood for sleeping, it also helps you stick to that sleep schedule you set in the first step. After all, you can't be halfway through a movie at 10 p.m. if you refrained from starting it at 9 p.m.Set your body clock during the daySleep and darkness aren't the only things that set your body's circadian rhythms. Daytime activities help to keep your internal clock on track, and these can help your overall health as well.Get plenty of sunlight in the morning. (In the winter, a light box may help.) Exercise during the day. You can combine this with sunlight by going for a morning or lunchtime walk. But any type of exercise will help you to sleep better. Eat meals earlier in the day. We sleep best when we eat during the daytime; if a nice early breakfast fits your schedule, consider making it a regular thing. But at the very least, don’t eat right before bed. Avoid caffeine and alcohol in the eveningsCaffeine keeps you up, and its effects linger longer than you may realize. Caffeine has a half-life of five hours, with some of us processing it a little faster or a little slower. To put this another way, If the average person has a 250-milligram cup of coffee at noon (such as a Starbucks Tall sized brewed coffee), they'll still have about 125 milligrams in their system at 5 p.m. and 63 milligrams at 10 p.m.\n            \n                What do you think so far?\n            \n        \nThe speed with which we break down caffeine varies from person to person, but in general: It’s affecting you more than you realize. If you think of yourself as a person who “can have an energy drink and then fall right to sleep” you are probably (a) in denial—hey, you’re the one who clicked on an article about getting better sleep—and/or (b) you have built up a massive caffeine tolerance because you drink so much of the stuff to stay awake, which in turn is because you don’t get enough sleep so you’re tired all the time. Do yourself a favor and break the cycle. An easy way to back off is to give yourself a cutoff time. No caffeine after 5 p.m., let’s say. Once that’s part of your routine, walk it back to 2 p.m. or noon. Alcohol is another chemical that affects our sleep. A nightcap before bed may make you feel sleepy, but it tends to disrupt the quality of your sleep. If you aren’t convinced, just start keeping a sleep diary—on paper is fine if you don’t have a sleep-tracking gadget—and see if you don’t get more and better sleep on the nights you don’t drink.Make your bedroom a dark little caveA welcoming, cozy bed will help you get to sleep faster. Make it dark, with blackout curtains or an eye mask, if needed. Make it quiet, with a white noise machine or earplugs if you can’t completely silence your surroundings. And make it a comfortable temperature. Most people prefer a cool environment—usually around 66 degrees—but again, this varies from person to person.Comfortable sheets and pillows can help. If you’re always tossing and turning, try to figure out if there’s something that physically bothers you. A new mattress might not be in the budget, but a mattress topper or a different pillow is an easy fix.ExperimentWhile the tips here are the basic things you should at least try, you may not need every single aspect to be textbook. I freeze if my room is set to 66 degrees, for example, so I keep the thermostat a tick warmer and I make sure I always have a warm duvet, even in summertime. You may find that you can bend certain rules but not others. I always have a crappy night’s sleep if I’ve been drinking, but late meals don’t bother me much. Once you’re getting a solid night’s sleep on the regular, you can start playing with the routine. And if you’re doing everything you can for good sleep hygiene and you still feel tired all the time, consider seeking medical help in case you have sleep apnea or another condition that could be affecting your sleep or energy levels.\n            \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n                        \n                \n            \n                    \n                                            \n                \n            \n                Beth Skwarecki\n                                    Senior Health Editor\n                                \n                                            Covering health, fitness tech, home gym equipment, and more.\n                                    \n                Read Beth's full bio\n                            \n        \n                \n                                            \n    More by Beth\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Create a Sleep Routine That's Perfect for You",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2H6ZAF1DRRM8M0G16ZFB38/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-06T21:30:00.000Z",
      "dateModified": "2026-02-06T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]