[
  {
    "title": "That Grubhub Bitcoin Email Is a Scam",
    "url": "https://lifehacker.com/money/grubhub-bitcoin-email-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDPB8KZSCNR1QX8Q9JQ4RMPY/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-30T15:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: BestStockFoto/Shutterstock \n                            \n            \n",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: BestStockFoto/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Scammers are impersonating Grubhub to promote a crypto rewards scam.\n                                            Emails were sent from addresses on a legitimate Grubhub subdomain.\n                                            Grubhub is not actually doling out $10,000 in bitcoin.\n                                    \n            \n    Table of Contents\n    \n        \n        Some Grubhub users have received a tempting email offer from the food delivery service: Send $1,000 in bitcoin to a specified wallet, and get 10 times that amount back. Unfortunately, this is very much a scam.  As BleepingComputer reports, these promo emails were sent from addresses on b.grubhub.com, a legitimate Grubhub subdomain, so they appear verified in recipients' inboxes. Two examples of senders include [email protected] and [email protected]. Beyond that, there are some pretty clear red flags. The subject line reads \"30 minutes left - We'll 10x your Bitcoin!\" to promote a sense of urgency and an offer too good to be true (but also too good to ignore). The body includes the recipient's name and instructions on how to participate in Grubhub's \"Holiday Crypto Promotion\" with a bitcoin wallet address. While Grubhub has acknowledged the problem, they haven't released any details as to what facilitated attackers sending emails using a company address. The company did suffer a major security breach earlier this year, resulting in the leak of some user data (including names and email addresses). \n            \n                What do you think so far?\n            \n        \nThere are several varieties of the crypto reward scamThe Grubhub email promotion is a pretty typical example of a cryptocurrency scam. The Federal Trade Commission outlines several variants, including get-rich-quick schemes guaranteeing big returns on your investment and celebrity-promoted \"giveaways\" that claim to multiply any funds you send.If you fall for crypto fraud, there's no way to track or get your money back, and even if victims are few and far between, scammers can score big paydays. That's why you should be especially wary of anything and everything requiring a crypto transaction, especially if the offer sounds urgent or provokes a sense of either excitement or fear. And remember that no legitimate organization—government agency, law enforcement official, utility company, or prize promoter—will ever ask for payments in cryptocurrency.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "That Grubhub Bitcoin Email Is a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDPB8KZSCNR1QX8Q9JQ4RMPY/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-30T15:00:00.000Z",
      "dateModified": "2025-12-30T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Turn on This Setting to Protect Your Privacy When Letting Someone Else Use Your iPhone",
    "url": "https://lifehacker.com/tech/lock-down-iphone-when-letting-someone-else-use-it?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KE7H3DN05JEN7QAZGJHT1NS5/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-05T18:00:11.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: lilgrapher / Shutterstock.com\n                            \n    Table o",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: lilgrapher / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Your phone is a one-stop shop for a lot of your personal information, from day-to-day activities logged in your calendar and email to financial data accessed via banking apps. If you let someone else use your device—whether you're showing a friend a collection of photos or allowing a stranger to make an emergency call—there's a lot you don't want them to be able to see. If you're an iPhone user, there are several features you can enable to prevent others from snooping around your device. Use Guided AccessIf you don't want someone using your device to see anything else on it, you can turn on Guided Access, which limits them to a single app (such as Phone or Photos). This essentially locks down your screen and prevents navigation outside of the specific features you make available. First, go to Settings > Accessibility > Guided Access and toggle the feature on. Tap Passcode Settings to set up a specific passcode or flip the Face ID toggle to use biometrics to end Guided Access sessions. To start a Guided Access session before handing over your phone, open the app and triple click the side button. You can circle specific areas of the screen you don't want to respond to touch (such as swipes through Photos). Tap Session Settings at the bottom to set a time limit, disable the keyboard, and manage button press options. Then tap Start. To end a Guided Access session, triple-click the side button and enter your passcode or double-click and authenticate with Face ID. \n            \n                What do you think so far?\n            \n        \nYou can also lock or hide specific appsSome mobile apps, like financial apps and password managers, already require you to log in or authenticate with your username and password combo or device biometrics every time you open them. You can also lock down other individual apps on iPhone so Face ID, Touch ID, or a passcode is required for access. To lock an app from your home screen, touch and hold the icon until the quick actions menu appears, then tap Require Face ID. Alternatively, you can hide apps so others cannot see them on your device (let alone open them) unless you authenticate using Face ID, Touch ID or a passcode. To hide an app, tap and hold the icon on the home screen and tap Require Face ID in the quick actions menu. Tap Hide and Require Face ID > Hide App. If you need to open a hidden app, swipe left on your home screen to reach your App Library, locate the Hidden folder at the bottom, and tap and authenticate to unlock the folder followed by the app. (Note that some native iOS apps, including Calculator, Camera, Clock, Contacts, Find My, Maps, Shortcuts, and Settings, cannot be locked, and system apps that come preinstalled cannot be hidden.)\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Turn on This Setting to Protect Your Privacy When Letting Someone Else Use Your iPhone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KE7H3DN05JEN7QAZGJHT1NS5/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-05T18:00:11.000Z",
      "dateModified": "2026-01-05T18:00:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This 'Gift Card Draining' Scam Wants to Steal Your Christmas Money",
    "url": "https://lifehacker.com/money/gift-card-draining-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDNNQDDQRV3PT352ZAP9NNQP/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-30T14:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Credit: Zooey Liao/Lifehacker/Getty Images\n                           ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            Bad websites claiming to show you your gift card balance are actually collecting that information for later.\n                                            Other scam sites may offer to pay you for gift cards that you don't want or won't use.\n                                            Always use the official gift card site listed on the back of your card, or call or visit the retailer directly.\n                                    \n            \n    Table of Contents\n    \n        \n        If you received gift cards over the holidays, don't throw them in a drawer and forget about them. While many gift card scams involve thieves demanding payments—for everything from taxes and fines owed to outstanding utility bills—via prepaid cards, there's a less obvious type of fraud known as gift card draining. How gift card draining scams workIf you forget how much money is on a gift card you received a while ago, you're likely to check the balance online. You'll typically need to enter your card number and PIN or security code, but some websites that claim to provide gift card balances are actually collecting that information to use it later. Always use the official site listed on the back of your card, or better yet, call or visit the retailer directly to confirm the balance. In another version of this scam, fraudsters have set up sites offering to pay you for gift cards you don't want or won't use. They may claim to purchase your $100 card for $90—which sounds better than no money at all—but are simply out to steal the card information and drain the funds, and you'll never actually see that cash. Sites promoting that type of deal are typically not legitimate. When you purchase or receive a gift card, keep the receipt, note the starting balance, and register it with the retailer or transfer the funds from the gift card to your existing account if those options are available. If possible, change the PIN, and spend the funds sooner rather than later. Gift card scams begin in the storeIf you're considering buying physical gift cards in the future, be sure to check for signs of a scam. Fraudsters will tamper with cards in stores by adding stickers over the barcode, so when you check out, the funds you pay go to their account rather than the card itself, which means the balance will be zero when the recipient goes to spend it. Scammers can also record the card number and activation PIN or security code, then reseal the packaging and replace the card on the rack—once the card is paid for or activated, they use the information to spend the funds. \n            \n                What do you think so far?\n            \n        \nInspect gift cards purchased in-store carefully for added stickers, damage to the packaging, or scratch-off coating that has been removed. You can avoid some risk by purchasing gift cards online directly from the merchant's website (as gift cards sold at steep discounts on social media or deal sites are often scams). And if you do end up with a scam card, you can file a report with the gift card issuer, though your mileage may vary in terms of recovering funds. The Federal Trade Commission (FTC) has a list of fraud contacts for some of the most popular card retailers, including American Express, Visa, and Amazon. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This 'Gift Card Draining' Scam Wants to Steal Your Christmas Money",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDNNQDDQRV3PT352ZAP9NNQP/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-30T14:00:00.000Z",
      "dateModified": "2025-12-30T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'GhostPairing' Attacks Are Taking Over WhatsApp Accounts",
    "url": "https://lifehacker.com/tech/ghostpairing-attacks-are-taking-over-whatsapp-accounts?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDNG01324DJGEC5DZVSBVB38/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-29T18:30:06.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Melnikov Dmitriy / Shutterstock.com\n                            \n    Table of C",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Melnikov Dmitriy / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        If you use WhatsApp, you may be targeted by scammers looking to take over your account by pairing their browser to your number. This scheme, dubbed GhostPairing by researchers, uses WhatsApp's device linking process to allow fraudsters to access all of your messages, impersonate you in chats, and perpetuate the scam to your contacts. Here's how threat actors are hijacking WhatsApp accounts—and how to defend yours. GhostPairing manipulates WhatsApp device linkingWhatsApp allows users to link their desktop or browser to their account without needing to enter login credentials in one of two ways: scanning a QR code and approving the session or confirming a numeric pairing code in the mobile app. While the GhostPairing scam could theoretically manipulate users in either approach, researchers found that the latter is much more common. The fraud begins with a short message sent from a contact with a link that purportedly goes to a Facebook photo or some type of Facebook content. If you click through, you'll be directed to a spoofed Facebook login page to enter your phone number—a familiar confirmation flow for Meta platforms. The next screen will likely show a numeric code with instructions to enter said code into WhatsApp to confirm the login (again, this may feel like a familiar two-step verification). If you're not paying attention, you may not realize that this didn't do anything on your end but instead registered the attacker's browser as a linked device to your account. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe danger in this scam is that everything will seem normal on your device and in your account, as attackers haven't hijacked your credentials to lock you out. However, they can do anything and everything in WhatsApp that you can, such as reading chats, receiving messages, viewing and downloading media, collecting information from your contacts, and forwarding the same phishing link. As they learn more about you and the people you know, they can potentially use that for ongoing scams. How to protect your WhatsApp accountAs always, be wary of links received via messaging platforms, even if they seem harmless or you think you know and can trust the sender. Threat actors frequently use social media and direct messaging to spread phishing lures. If you do click a link in WhatsApp (or any other communication), read all prompts carefully before providing or verifying any information to identify scams. \n            \n                What do you think so far?\n            \n        \nTo protect your WhatsApp account specifically, you can set up two-step verification, which will also prevent attackers from adding or changing a connected email address. Go to Settings > Account > Two-step verification > Turn on or Set up PIN and add an email address when prompted. You can also check to see if there are any suspicious devices paired with your account under Settings > Linked devices and remove any you don't recognize or regularly use.Finally, if you have been targeted by this scam, let your WhatsApp contacts know, as threat actors may spread the malicious link by making it look like it came from you. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'GhostPairing' Attacks Are Taking Over WhatsApp Accounts",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDNG01324DJGEC5DZVSBVB38/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-29T18:30:06.000Z",
      "dateModified": "2025-12-29T18:30:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: There's a Whole Windows PC in This HP Keyboard",
    "url": "https://lifehacker.com/tech/ces-2026-hp-windows-pc-inside-keyboard?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDTYM6CST1T1M71X4E76QBDY/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-06T03:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: HP\n                 ",
    "body": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: HP\n                            \n            \n                Key Takeaways\n                                            The HP EliteBoard G1a is a keyboard with a whole Windows PC inside it.\n                                            It's aimed at enterprise customers, but you will be able to buy it from HP.com.\n                                            It's up to you whether to include a battery with it.\n                                    \n            \n    Table of Contents\n    \n        \n        If you're anything like me, you spend 90% of your time using your laptop with it docked and plugged into a monitor (or two). And if you're at that point, you might be wondering why you even bother having a screen attached to your computer at all. If so, HP's got your back. Announced at this year's CES, the HP Eliteboard G1a looks like a normal keyboard on the outside, but on the inside, it's got a whole Windows PC.That's not exactly a new concept, but with the experimental days of Windows XP long behind us, it's mostly been reserved for less powerful, Linux-based single-board computers like the Raspberry Pi. That's great if you're a hacker or tinkerer, but not if you're just looking for a screenless, keyboard-equipped Mini PC to get you through the workday. The Eliteboard G1a, instead, comes equipped with the latest AMD Ryzen AI chips, up to 64GB of RAM, and up to 2TB of storage, so while you shouldn't expect to play the latest and greatest games on it, for internet browsers and lightweight productivity programs, it should really be able to hustle.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nIt's also a bit of a sleeper build. I've been able to go hands-on with it, and to all outside eyes, it really does look like a regular office keyboard, complete with black, low-profile chiclet keys, a function row, and a numpad. Ranging from 1.5 to 1.7 pounds based on how you spec it out, it's also pretty lightweight, and the right person might believe you if you said it was just a keyboard, with no computer inside whatsoever.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe catch? This baby is aimed at enterprise customers, rather than your typical consumer. That does come with a few bonuses, like a Kensington lock slot, some extra security software, and an optional fingerprint reader. But it also means you're not going to find it up for sale anywhere other than the HP store, and while pricing hasn't been announced yet, it'll probably be a bit more expensive if bought individually rather than as part of an office fleet. It can also only connect to monitors using DisplayPort, which is fine if you're an office manager that knows to buy displays that will work with it, but may not fit into everyone's home set-up.\n            \n                What do you think so far?\n            \n        \nThat's a shame, because I love unusual form factors, and this keyboard PC could make for a really clean desk in my home office. It's strong enough, uses a familiar operating system with wide app compatibility, and can even output to two 4K monitors at once. There are also two versions, one that always needs to be plugged in, and one with a battery and a detachable USB power cable for quickly moving between different workstations. That's great flexibility, since the battery version is a bit more portable, but is also heavier.Here's hoping this is just an early experiment for HP, because I'd love to buy a consumer version of this laptop at some point in the future. If you're willing to take the plunge on the enterprise model, though, HP says it's expected to launch on HP.com sometime in March.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: There's a Whole Windows PC in This HP Keyboard",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDTYM6CST1T1M71X4E76QBDY/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-06T03:30:00.000Z",
      "dateModified": "2026-01-06T03:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: Petkit's Yumshare Daily Feast Is an Automatic Wet Food Feeder for Your Cat",
    "url": "https://lifehacker.com/tech/petkits-yumshare-daily-feast-automatic-wet-food-feeder-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KE85J6Y0QWV86K484VQXJKJ9/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-06T00:10:56.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Lifehacker\n                            \n            \n                Key Takeaw",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Lifehacker\n                            \n            \n                Key Takeaways\n                                            At CES 2026, I spent some time with Petkit's Yumshare Daily Feast, which can automatically distribute wet food for cats.\n                                            The device is designed to hold up to seven pouches of wet food at once, distributing food as needed.\n                                            Each pouch is discarded 48 hours after opening, though the machine closes each pouch and sanitizes with ultraviolet light in between portions.\n                                    \n            \n    Table of Contents\n    \n        \n        I don't have a cat, but I do have a dog, and my dog can be a picky eater. After months of trial and error, the only way we could get him to consistently eat breakfast and dinner was with wet food. There is no scenario in which I or someone watching my dog can outsource the task of feeding him, but that's not the case for cat owners. I know that cats sometimes stay home alone for extended periods of time, where an automatic food dispenser becomes essential. I can only imagine, then, that cat owners who, like me, feed their pet wet food, now have a challenge: Someone has to be there to feed the cat.That's what intrigues me about Petkit's Yumshare Daily Feast, an automated cat feeder that specifically works with wet food. I covered the Yumshare briefly when Petkit first announced it last week, but I got some hands-on time with the product today on the CES show floor. And while the device I saw isn't going to market just yet, I was intrigued.The concept itself is pretty simple, but a bit more complex in execution. As you might expect, the feeder distributes portions of food for your cat to eat when you're not available—only here, that food is wet, not dry. To achieve this, Petkit outfitted the Yumshare with a chamber that can hold up to seven pouches of wet food at once. These pouches are designed for the Yumshare alone: Right now, the only company making pouches is Food Chain, which uses Petkit's proprietary design to fit the Yumshare, but it's possible more companies more jump on board in the future.\n    \n            \n            The food chamber that contains seven pouches of wet food.\n                                        Credit: Lifehacker\n                    \n    \nWhen the Yumshare first opens one of these pouches, it sets a timer: After 48 hours, the pouch is discarded. In the meantime, the machine can automatically dole out portions set by the user, into a cup, which is stored in a separate chamber in the device. Once the portion is distributed, the pouch is sealed until the next portion is needed. The machine also uses UVC ultraviolet light to sanitize the package, with the goal of eliminating bacteria.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe automation extends to the portion of wet food itself, as well. Whether your cat eats all of the food, some of the food, or none of the food, the Yumshare can discard what's left when it detects it's time to do so. That might be the AI camera identifying that the food has dried up, or an internal clock recognizing that too much time has passed for the food to be safe to eat. Either way, the food drops into a waste compartment, which can hold up to 15 cups at once. The stand remains empty until it's time to hand out another portion of food. \n            \n                What do you think so far?\n            \n        \nHow large or small each portion is, as well as how often portions are distributed, is up to you. Petkit showed me a mockup of the Yumshare's app, which lets you customize this feeding schedule. The app will also tell you how many portions have been distributed, and how many are left in the chamber. You can also take a look at a live video feed of your cat, via the 4K camera embedded in the device, or view a clip history of your cat's feeding habits. My only question is the lack of refrigeration: Petkit says that there is no need for it, since the pouches are all sealed until use, closed in between portions, and the chamber uses ultraviolet light to sterilize for bacteria. But I'd want to confirm there are no health risks to keeping an opened pouch unrefrigerated for up to two full days, even with that UVC light. Assuming that's true, I'm quite impressed with this prototype. If I were a cat owner that frequently needed to leave my pet alone at breakfast and dinner, this is something I'd have my eye on. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: Petkit's Yumshare Daily Feast Is an Automatic Wet Food Feeder for Your Cat",
      "image": [
        "https://lifehacker.com/imagery/articles/01KE85J6Y0QWV86K484VQXJKJ9/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-06T00:10:56.000Z",
      "dateModified": "2026-01-06T00:10:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: This Water Dispenser Uses Facial Recognition to Track Your Cats' Drinking Habits",
    "url": "https://lifehacker.com/tech/this-water-dispenser-uses-facial-recognition-to-track-your-cats-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KE8BFWDWJ01K18Q7K0GYBQ2R/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-06T01:08:37.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Lifehacker\n                            \n            \n                Key Takeaw",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Lifehacker\n                            \n            \n                Key Takeaways\n                                            Petkit's new water dispenser, the Eversweet Ultra, can track multiple cats' drinking habits using machine learning.\n                                            The Eversweet Ultra has a 1080p camera that can live stream and record clips of your cats drinking water, then track their drinking habits over time.\n                                            It features a five-liter water tank, and does not recycle the used water, instead allowing it to dump out into a separate chamber.\n                                    \n            \n    Table of Contents\n    \n        \n        I spent some time with Petkit on the show floor of CES on Monday, where I got to see the company's automatic wet food cat feeder, its newest smart litter box, as well as an AI-powered water dispenser. Of course, a water dispenser should ideally do one thing: dispense fresh water for your pet. The Eversweet Ultra water dispenser, however, adds a number of smart features to the mix, some of which actually seem particular useful for owners of multiple cats.The Eversweet's camera tracks your cats' drinking habits I first learned about this water dispenser last week when Petkit officially announced it, and some of the specs and features are the same on paper as they are in person: This smart dispenser comes with a five-liter tank, as well as a 1080p camera with a 140-degree-wide-angle view. That allows you to see your cat approach the dispenser, as well as monitor their drinking habits. You can either choose to tap into a live stream to watch them as they drink, or check out prerecorded clips saved to the app. Petkit tells me the app even chops up clips for you to post to your socials automatically—if you think your friends and family want close-ups of your cat taking a drink. One of Petkit's selling points here, however, is the health tracking. The clips aren't just for posting to stories; instead, the camera can track how your pet drinks over time, noting any discrepancies or changes. You can see daily, monthly, and even yearly drinking trends, so you know whether your cat is drinking an abnormal amount of water for January. I'd want to consult a veterinarian before definitively stating whether this type of tracking is effective, but I can imagine it might be useful to know whether your cat changes its behaviors—something you might not notice if you aren't diligently watching them drink. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThat doesn't change if you have multiple cats, either. The Eversweet's camera uses machine learning for facial recognition, and can identify individual cats in your home. That health tracking can apply to specific cats as they drink water, so you shouldn't have results mixed between your various pets. If you really want to know when one cat is drinking water over another, this should help you keep track.Eversweet's water featuresWhile some water dispensers recycle the water, the Eversweet disposes of the water after a set period of time. I knew about this from the press release, but it was fun seeing the machine dump the water in real time: The pump that serves to keep the water running cuts out, and the entire mechanism lifts up to reveal a drain. The water dumps out, and a spout refills the tank, only to dump the water again. This is an attempt to clean out the tray, and remove any bits of hair or debris that might've been left behind. \n            \n                What do you think so far?\n            \n        \nPetkit also made a point of showing me that the dispenser's pump is always running, which turns the Eversweet into a bit of a water feature—not that you should buy one just for decoration. The idea is, cats are a bit more attracted to the moving water than still water, which encourages them to drink. I don't have a cat, so I can't speak to that, but it's an added aesthetic perk—until the water dumps out, of course. Petkit says it's aiming for an April release for the Eversweet, which will be available on both Amazon as well as through Petkit's official site.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: This Water Dispenser Uses Facial Recognition to Track Your Cats' Drinking Habits",
      "image": [
        "https://lifehacker.com/imagery/articles/01KE8BFWDWJ01K18Q7K0GYBQ2R/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-06T01:08:37.000Z",
      "dateModified": "2026-01-06T01:08:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: Dell Is Bringing Back XPS, Just One Year After Killing It",
    "url": "https://lifehacker.com/tech/ces-2026-dell-bringing-back-xps-laptops?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDTKDVQVKRVDPJTASV9DQ3N7/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-05T23:00:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Michelle Ehrhardt\n                            \n            \n                Key",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            Dell is reviving the fan-favorite XPS line.\n                                            Laptops simply called \"Dell\" aren't going away, but they are being simplified.\n                                            2026's new XPS laptops have a more traditional design than the last iteration.\n                                    \n            \n    Table of Contents\n    \n        \n        During last year's CES, Dell killed the brand behind the very first laptop I ever owned, ditching its beloved XPS branding alongside other classic names like Inspiron and Precision. In its place, the company said all of its future (non-gaming) computers would now be known simply as \"Dell,\" either being Dell, Dell Pro, or Dell Pro Max devices. In addition to these, other monikers like Dell Plus and Dell Premium were also tossed into the mix—and with all those similar-sounding adjectives floating around, it was just a mess to know what you were actually buying. If you can tell me the difference between a Dell 14 Plus, a Dell 14 Premium, and a Dell 14 Pro Premium without looking at spec sheets, then all respect to you.Now, it seems, the company's realized its mistake. At CES 2026, Dell revealed that it's bringing the XPS brand back and massively simplifying everything else. Laptops simply branded as \"Dell\" won't be going away, but from now on, consumers will only have to make three choices when buying a Dell laptop.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nHow Dell's new laptop categories will workMore lightweight laptops for everyday consumers will continue to be called simply Dell, but all premium options will now be renamed to XPS, while all gaming computers will now fall under the Alienware brand that was previously limited to more powerful models. The Dell Pro name will technically continue to exist, but only for enterprise customers, and Dell made no mention of Dell Pro Max, Dell Plus, or Dell Premium at this CES.\"We've been a bit off course,\" Dell Vice Chairman and Chief Operating Officer Jeff Clarke said in a meeting with journalists. \"I owe you an apology. We didn't listen to you. You were right...we can be humble, and we can correct decisions that we've made in the past.\"All of this should come as a relief to confused buyers who might have been thrown off not just by the naming scheme, but by how many configuration options each of those Premium, Plus, and Pro models had on the Dell website at checkout. As someone who had to review and recommend these things, even I had trouble knowing whether a high-end Dell Plus was better than a low-end Dell Pro. But aside from naming, Dell also promised to bring back some favorite XPS design features alongside the brand next year.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n\n    \n            \n            Old Dell XPS design\n                                        Credit: Michelle Ehrhardt\n                    \n    \nShortly before it got rid of the XPS name, Dell made a couple of design overhauls to XPS that I was vocally opposed to, and these persisted into some of its post-XPS computers. They included using a touch bar for the function row rather than physical keys, much like Apple tried on some MacBook Pros between 2016 and 2020, and a touchpad that was flush with the computer, meaning you couldn't easily see where it began and ended. It was flashy, but as my colleague Alan Bradley pointed out in a review, it was more \"form over function.\"\n    \n            \n            New Dell XPS design\n                                        Credit: Michelle Ehrhardt\n                    \n    \nNow, the new XPS laptops for this year are back to using physical keys for the function row and have subtle etching on the sides of the touchpad so you know where it begins and ends. There are even a few new, but purely cosmetic premium touches, like a CNC-machined aluminum body. The new XPS machines are also a bit thinner and lighter, and the company promises \"the XPS 14 is now more compact than the MacBook Air 13, taking up less desk space while giving you more screen space.\"\n            \n                What do you think so far?\n            \n        \nOverall, the theme for next year seems to be \"return to form,\" and Dell's even going so far as to replace the Dell logo on the lid of its new XPS laptops with the XPS logo for the first time. 2025 was the first year where I didn't put a non-gaming Dell laptop on my best laptops of the year list, so I'm excited to see what the company's reinvestment in its history looks like when it comes out.\n    \n            \n            New Dell XPS 14 (left) and Dell XPS 16 (right)\n                                        Credit: Michelle Ehrhardt\n                    \n    \nDell's new XPS 14 and XPS 16 will launch with limited configurations starting Jan. 6, while an XPS 13 that's thinner than 13mm is set for sometime later this year. Launch configurations will have options for both LCD and OLED screens, although there are no builds with discrete graphics cards included at the moment.Pricing for the XPS 14 will begin at $1,650, while the XPS 16 will start at $1,850.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: Dell Is Bringing Back XPS, Just One Year After Killing It",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDTKDVQVKRVDPJTASV9DQ3N7/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-05T23:00:00.000Z",
      "dateModified": "2026-01-05T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why You Should Give Yourself ‘Crappy’ Rewards for Your Fitness Goals",
    "url": "https://lifehacker.com/best-rewards-for-fitness-goals?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GKXB2SF20KPDZ5RGWN7SM/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-30T19:00:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Shutterstock\n                            \n    Table of Contents\n    \n        \n ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Shutterstock\n                            \n    Table of Contents\n    \n        \n        Rewarding yourself can backfire. If you tell yourself, “I’ll only listen to my favorite podcast while I’m at the gym,” it takes just one moment of weakness to realize you can cheat and listen to it any time you want. Instead, try this: Reward yourself with something that has no enjoyment value whatsoever. Like a checkmark on your calendar. I first heard this tip from writer Tim Clare’s podcast. If you want to stay motivated, he says, the reward has to be so crappy that you’re not actually working for the reward. He said that he puts a checkmark on his calendar every day he writes, and at the end of the week enough checkmarks earn a gold star. The same approach has worked for me and for others. I have to admit: Buying myself a pack of stickers is embarrassingly motivating. Why stickers work better than \"real\" rewardsTim Clare likes the theory that this works because of cognitive dissonance: We have to change something major (our behavior) to earn something that's not valuable (a sticker), so we try to resolve that dissonance by deciding we value the behavior change. The crappy extrinsic reward strengthens our sense that the new habit is intrinsically valuable. And as my colleague Meredith Dietz has written, experts believe that the secret to lasting motivation lies in our intrinsic goals. Engaging in healthy behaviors like exercise only works if we're doing those behaviors for their own sake, not because we're enduring our gym time as a means to an end. Extrinsic rewards like streaks and badges can gamify this process so addictively that we lose sight of why we're actually doing it in the first place. Note that I'm not saying you should chase streaks; I'm thinking more like literal stickers on a piece of paper, or a note in your phone where you write down how many miles you ran this week. \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nAnother type of ineffective reward is the real-life splurge: promising you'll treat yourself to something (a dessert, a clothing purchase) once you hit a certain goal. Here's the problem: If you hate exercising so much that you need a bribe to do it at all, you're quickly going to find a way to have the reward without the work. There's nothing actually stopping you from listening to that \"gym only\" podcast at home, or ordering yourself the new outfit you had earmarked as a reward for when you make it through the couch to 5K program. \n            \n                What do you think so far?\n            \n        \nUsing a crappy reward works because it just reflects your existing motivation back on itself. You check off today's work, not because the checkmark is valuable in itself, but because the checkmark reminds you that you kept a promise to yourself. There's a thrill to closing that loop, and those little wins really build your self-efficacy. In self-efficacy theory, small wins boost your motivation to keep working toward bigger goals.  The best part of using stickers or checkmarks is that it’s pointless to cheat. What are you going to do—lie to yourself when you didn’t actually go to the gym? But building up that row of numbers or stickers becomes its own reward. You’re really just rewarding yourself with the satisfaction of having stuck to your habit.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why You Should Give Yourself ‘Crappy’ Rewards for Your Fitness Goals",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GKXB2SF20KPDZ5RGWN7SM/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-30T19:00:00.000Z",
      "dateModified": "2025-12-30T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Rally Orbital Massager Is My Tech Upgrade of the Week",
    "url": "https://lifehacker.com/health/rally-orbital-massager-upgrade-of-the-week?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDZVFBKF8SPAJETB9ZXVNDKS/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-02T18:30:57.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Meredith Di",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Meredith Dietz\n                            \n    \n            \n            \n        \n            We're highlighting the small changes—from useful new gadgets, to fresh productivity techniques, to efficient hacks—that are improving our lives on a weekly basis.\n        \n    \n    Table of Contents\n    \n        \n        There's something extra satisfying about starting a new year with an upgrade that actually makes a difference in your daily routine. After years of relying on my traditional percussive massage guns, I've made the switch to the Rally Orbital Massager. And one by one, my friends have started following in my footsteps to make the same move. Hey, there's something validating about watching people you trust independently come to the same conclusion. Why I love the Rally Orbital MassagerDon't get me wrong—my Theragun still serves me well. It's been a reliable companion after workouts, helping ease tension and speed up recovery. But with the Rally, the orbital motion technology sets it apart immediately. Instead of the percussive hammering that defines traditional massage guns, the Rally uses a circular, multi-directional approach that feels more like the hands of a skilled massage therapist. (Or like a car buffer, as the founders described it to me on a phone call.) I'm simply more likely to reach for a device that feels good to use, rather than one that hurts. It's a game-changer for consistency. With my old massage gun, I'd psyche myself out before sessions: \"Do I really need this? Can I handle the intensity right now?\" With the Rally, there's no mental barrier. I can use it while watching TV, during work breaks, or as part of my bedtime routine, without dreading the experience.At the same time, let me be upfront: At regularly $499 (and currently on sale for $399), the Rally Orbital Massager isn't cheap. It's a significant step up in price from most massage guns on the market, including the Theragun. It's probably not an impulse buy. Still, it's an investment that helps me maintain the active lifestyle I value. \n            \n                What do you think so far?\n            \n        \nThe bottom lineStarting 2026 with this upgrade feels right. My Theragun will still have a place in my recovery arsenal—it's way too useful to completely retire—but the Rally has quickly become my go-to device. The difference in how my muscles feel, the reduction in soreness, and the overall quality of the recovery experience have made it worth every penny.If you're serious about recovery and you're in a position to make the investment, I'd encourage you to at least try one. Based on my friend group's conversion rate, there's a good chance you'll be joining the Rally revolution too. Here's to a year of better recovery, less soreness, and smarter investments in our health.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Rally Orbital Massager Is My Tech Upgrade of the Week",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDZVFBKF8SPAJETB9ZXVNDKS/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-02T18:30:57.000Z",
      "dateModified": "2026-01-02T18:30:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Start Each Week With This Digital Decluttering Method",
    "url": "https://lifehacker.com/best-digital-decluttering-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2H6ND61Y2JAHPTZQJM2DSW/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-30T13:00:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Prathankarnpap - Shutterstock\n                            \n    Table of Content",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Prathankarnpap - Shutterstock\n                            \n    Table of Contents\n    \n        \n        It’s well-established that physical clutter impairs your productivity and focus, going as far as to make you exhausted, stressed, and burnt out, which is why decluttering your workspace is key component in a lot of productivity techniques. In this day and age, though, your \"workspace\" isn't always (or, in some cases, even) an office or desk. Your phone and computer are your workspace. That's where you spend most of your work day looking and interacting—and when it's cluttered, you can feel discombobulated, the same as you might with a messy cubicle. It's time to stop thinking only about decluttering the physical world and make a better plan to keep the digital one in good shape. Take stock of your desktop, your tabs, your inbox, and your home screen: How many different windows do you have open right now? They are not only bogging down your mental energy, but your device’s energy, too. Let's fix that—and find a solution that sticks.When to declutter your devicesAim to start each week with a digital decluttering. It doesn’t have to take more than 15 minutes, but you’ll be more productive when it’s done, so it’s a good investment of your time. Approaches like this work best when you actively take the time to schedule them out, so fall back on time boxing and time blocking, and consider using a specialized to-do list system like 3-3-3, then designating the weekly decluttering one of Monday's three small tasks. How to digitally declutter (easily)On your desktop, create folders that can store whatever you need, whether those are documents for work or screenshots for your side business. Each Monday, go through whatever docs or pics have accumulated on the desktop and stick them in their respective folders so the whole thing looks cleaner. Do the same thing with any new apps you’ve put on your phone. There’s no reason to scroll through pages and pages of apps to find the one you need when you can stash it in a folder and keep your home screen organized. Only keep the necessary, daily-use folders available on your desktop and home screen. The rest should be banished somewhere invisible, but searchable.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nClose all open windows you’re not using—and all the tabs left over from your last browsing session. If you genuinely need something available, bookmark it. Get in the habit of closing tabs whenever you’re done with them. (Check for minimized browser windows, too; I always have at least two that need to be closed, but I rarely realize they're running in the background.)\n            \n                What do you think so far?\n            \n        \nNext up is email. I've recommended the “one-touch” method of inbox management before, and an adaptation of it works great here: Open every email you’ve gotten in the last week and either delete it or archive it, depending on whether you anticipate needing it later. Anything you archive, be sure to set aside time to respond to later in the day or week. (Again, time box and time block this, plus add it to your to-do list so it's a real, scheduled task, not just a good idea you may or may not get around to.)Perhaps most importantly, delete as you go. This is the the one I struggle with most, but once you get in the habit, it's easy. If you downloaded an app for a single purpose and don’t use it anymore, delete it. If you have docs in your files from an old class or work project, delete them. Stick to doing this for the first 15 minutes every Monday (or whenever you start your week) to dramatically reduce your digital clutter and any related stress. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Start Each Week With This Digital Decluttering Method",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2H6ND61Y2JAHPTZQJM2DSW/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-30T13:00:00.000Z",
      "dateModified": "2025-12-30T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seven Clever Ways to Use C-Clamps Around the House",
    "url": "https://lifehacker.com/home/best-ways-to-use-c-clamps-around-the-house?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDR556NVN3TRJ6HQ29DQ3YNZ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-30T18:00:21.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Valery Orlov / Shutt",
    "body": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Valery Orlov / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        If you’ve been doing any kind of work around any kind of house for a while, you probably have a few trusty old-school C-Clamps on hand. The C-Clamp has been in use for thousands of years. It’s one of those dead-simple tools that just works. It’s also one of those tools you tend to collect multiple examples of, in different sizes.Typically, you use a C-Clamp to, uh, clamp stuff together, like two pieces of wood, or to clamp something into place while you work on it (I use them a lot to cut lumber so I can have both hands on the saw, as I am allergic to emergency rooms.) But the C-Clamp is actually a very versatile tool that can be deployed in a number of creative—but useful!—ways. Here are some of my favorite ways to repurpose those old C-Clamps.A carrying handleIf you need to carry something that’s bulky, heavy, and awkward, having some temporary handles always makes the job easier. If you have a few C-Clamps, you’re golden: Just clamp a couple onto whatever you’re transporting and you have instant handles to make the haul a little easier. They can also be used as handles for rolled-up materials, like rugs or mats—just thread the roll through a pair of C-Clamps, tighten them closed, and carry on.A quiet hammerIt’s happened to all of us: You need to drive a nail somewhere, but there’s no room to swing a hammer, or for some reason you’re reluctant to make a lot of banging noise. The solution is your trusty C-Clamp: Just place the clamp over the nail head and tighten. The clamping action will inexorably (and silently) drive that nail into place. This isn’t an efficient way to drive a lot of nails, of course, but in a tight spot, it’s brilliant.An emergency wrench\n            Never miss a story\n                Get the latest smart home news, trends, and advice from Lindsey and the team.\n            \n        \nNeed to tighten or loosen a connector, but you don’t have a wrench at hand? Tighten a C-Lamp around the bolt, cuff, or connection point so that it’s gripping tightly, then slowly turn it in the direction you need. Make sure the clamp is tight enough to prevent slippage, and you might want to use something (a handy piece of cloth works) to protect the connection from damage as you work.A cord organizerWhether it’s corralling all those extension and power cords on a workbench or work site, or organizing computer cables on your desk with an industrial vibe, C-Clamps can keep all those wires under control and out of your way in a pinch. Just gather the cords at the edge of the desk or table and clamp them down. This is a perfect temporary solution, as the cords can pass freely through the clamps without risk of damage, and the clamps can be removed when the job is done.\n            \n                What do you think so far?\n            \n        \nBookendsNeed a couple of bookends to hold stuff in place on a shelf? A pair of C-Clamps attached to the outer edge and clamped in as deep as possible will work. This could even be a permanent design choice if your taste runs toward the rustic or industrial.AnchorsC-Clamps are ideal devices when anchor points are needed, but you don’t want to attach anything permanent that would require fasteners and drilling into a structure. Need a clothesline to dry your laundry when the dryer breaks? Two C-Clamps and some rope or twine are all you need. Need to hang tools, clothes, or anything else? C-Clamps attached to a shelf of any kind, combined with a hook, will work a charm. Need to hold a tablecloth or other covering in place? Nothing clamps stuff down to a horizontal surface better than C-Clamps.Spool holderWhether you’re spooling filament to your 3D-printer or feeding twine or wire to yourself as you work on a project, sliding the spool over a C-Clamp and then clamping it into place gives you a sturdy holder that you can pull from. This means you won’t have to juggle your spool every time you need more slack, and you can easily unclamp and reposition the spool if you’re on the move as you work.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seven Clever Ways to Use C-Clamps Around the House",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDR556NVN3TRJ6HQ29DQ3YNZ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-30T18:00:21.000Z",
      "dateModified": "2025-12-30T18:00:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "So, I Tried an AI Shopping Cart",
    "url": "https://lifehacker.com/tech/what-it-is-like-to-use-an-ai-shopping-cart?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDNHTX3BKPDRC6QF6FCM0D8D/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-29T20:00:54.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    These fancy new shopping carts are popping up at grocery stores.\n            \n                        \n    \n                            \n        \n        \n        December 29, 2025\n            \n            \n                        Credit: René Ramos / Lifehacker / LumenSt / Urbanscape / Sashkin / Maina / Adobe Stock\n                            \n    \n        \n        The first supermarket, the Piggly Wiggly in Memphis, opened its doors in 1916. It was the first time people could wander around a store and pick their items from a shelf instead of handing a list to a clerk who would gather everything for them—typically without any choice of brand or style. Grocery shopping remains a daily or weekly ritual for most people, and it can be a real chore—especially if you’re shopping for a large family. My own grocery lists aren’t all that long, but I still find myself juggling my phone and a scrap of paper as I walk around the store, checking for digital coupons and trying to do quick math. So when I read that one of the local grocery stores (a ShopRite) was rolling out Smart Shopping Carts powered by artificial intelligence (AI), I was intrigued. I’m naturally dubious about a lot of AI tools, but grocery shopping seemed like a place where a little digital help might come in handy. So I headed out to see whether these fancy new carts would offer real benefits or just a lot of targeted advertisements.What are caper carts?The carts in question are Caper Carts, which is owned by Instacart. They’re pretty large and tank-like, and kind of heavy to push.\n\n    \n            \n            The Caper Carts are pretty big and heavy.\n                                        Credit: Jeff Somers\n                    \n    \nYou need to have an account with ShopRite in order to use these carts, as they use your phone number to track your purchases; you can choose to store a credit card or other form of payment in there for convenience, but it’s not required. When you walk in the store, the Caper Carts are right there in the entrance area. When you pull one out, the screen lets you enter your phone number, then offers you a (mercifully brief) tutorial.\n    \n            \n            The welcome screen on the AI shopping cart.\n                                        Credit: Jeff Somers\n                    \n    \n\n    \n            \n            The log-in screen\n                                        Credit: Jeff Somers\n                    \n    \nThe carts have barcode scanners mounted on both sides of the back of the cart, and the cart itself is a scale, which is both how it ensures you’ve scanned everything in the cart and how it calculates the cost of loose produce. If you’ve ever used a self-checkout in a grocery store, it’s kind of similar: You hold items up to the scanners and then drop them into your cart. For produce, you look up what you’re buying and then drop it into the cart, where it’s weighed and added to the total. Along the way, the cart will look for potential coupons or deals you might be interested in. The carts can import your shopping lists from the store’s app, if you want, and will keep track of your loyalty points and rewards as well.How to use a Caper CartThe first Caper Cart I selected didn’t work; nothing would scan no matter how I held things up to the scanners. This wasn’t a big deal—I let the store folks know, logged out of the cart, and grabbed another. The second cart worked perfectly.\n    \n            \n            The  Caper Cart screen while shopping\n                                        Credit: Jeff Somers\n                    \n    \nThese carts are pretty heavy, and the second cart I used had a loose wheel which made it rumble loudly as I walked the aisles—you aren’t going to be racing these carts and jumping on for a quick glide. When I dropped an item in the cart without scanning it, the cart politely showed me a video of me placing the item (creepy) and asked if I wanted to fess up to adding something to the cart. It did, however, give me the option to declare a “personal item,” which is a solid feature.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n\n    \n            \n            A video pops up if you try putting an un-scanned item in the cart\n                                        Credit: Jeff Somers\n                    \n    \nI forgot to put my shopping bags in the cart, because I am frequently dumb. You’re supposed to bag as you go, which saves you time; I had to bag after checkout, which did not save me time. On the other hand, I don’t always shop in bagging order, so bagging as I go might result in some of my items getting crushed under heavier groceries, or me having to re-arrange everything in the middle of the shopping experience. I kind of like bagging at the end, when I can make decisions about how to arrange everything optimally.If you change your mind about an item, you just remove it from the cart. The Caper system will notice and remove the item from your bill.\n            \n                What do you think so far?\n            \n        \nWhen you’re done, you just tap “Checkout” and head to the Checkout Area.\n    \n            \n            Checking out with a Caper Cart\n                                        Credit: Jeff Somers\n                    \n    \nThis will be different depending on the specific store you’re in—some stores don’t have checkout lanes for the Caper Carts, but this ShopRite did. There was only one lane for Caper Carts, and I had to wait behind someone as they checked themselves out. Then I scanned a barcode on my screen with a gun and tapped my card to pay while a security guard loomed nearby, presumably to discourage folks from making a run for it.\n    \n            \n            Barcode for checking out with a Caper Cart\n                                        Credit: Jeff Somers\n                    \n    \n\n    \n            \n            Scanning the checkout barcode on a Caper Cart\n                                        Credit: Jeff Somers\n                    \n    \nOverall, the AI shopping cart experience was a slight upgrade from typical grocery shopping. Bagging as you go is convenient, and checkout is a little easier because you scan a single barcode instead of two dozen. I didn’t receive many personalized coupons or recipe suggestions because this was my first time using the system, but I can see how that could become very useful if the cart is able to dig up coupons or offers that I missed.A few specific notes:The cart can accidentally scan a barcode if you get close to a shelf, which can cause confusion, though the cart will quickly delete it if the weight doesn’t change.As noted above, the carts are pretty heavy. If you’re going to be buying a lot of groceries all at once, this could become a real workout.Adding produce can be a little complicated: You have to locate the “price look up” (PLU) code for the specific produce you’re adding, then scan or type it into the screen before dropping it into the cart. That means sometimes hunting for those little stickers and tapping a bunch of numbers into your cart over and over again.Seeing your total spend add up in real time is useful, especially if you’re tracking costs. If an item costs more than expected, you see it immediately, and if the overall cost is more than anticipated you have time to adjust your selections before you hit the checkout.Because you have to go through a checkout lane as usual (and there was only one dedicated lane for Caper Carts), during busy times you might wind up waiting a long time to get out of the store, which kind of cancels out the convenience factor. Of course, as more people use these carts, ShopRite might add more dedicated Caper lanes.Depending on how you shop for groceries, these AI shopping carts might be worth a try—but don’t expect a revolutionary experience.\n            \n                        \n                \n            \n                    \n                                            \n                \n            \n                Jeff Somers\n                                \n                                            Jeff Somers is a freelancer who has been writing about writing, books, personal finance, and home maintenance since 2012.\n                                    \n                Read Jeff's full bio\n                            \n        \n                \n                                            \n    More by Jeff\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "So, I Tried an AI Shopping Cart",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDNHTX3BKPDRC6QF6FCM0D8D/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-29T20:00:54.000Z",
      "dateModified": "2025-12-29T20:00:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "When Clearing Out Your Inbox, Trying Sorting It by Sender",
    "url": "https://lifehacker.com/sort-email-by-sender-when-clearing-out-inbox?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GX8ANP37Z4CNPP28PZDKB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-23T13:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: verona studio - Shutterstock\n                            \n    Table of Contents",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: verona studio - Shutterstock\n                            \n    Table of Contents\n    \n        \n        There are a lot of methods to try in the never-ending quest for a way to sort through and slim down our bulging inboxes. They're different enough that there's certainly one out there that matches or comes close to matching your exact needs, but they do all have one thing in common: They rely on the chronology of when each email came in. Let’s try turning that approach on its head, and instead, sort by sender to weed through the mess.Why you should sort your inbox by senderWhen purging your messages, you probably have an organizational system you follow, like the 4Ds. You go through and decide what gets deleted, done, delegated, or deferred—but there’s not much pattern recognition if you’re just starting at the top and working your way down. Every day's demands or outreach might look different depending on what you have going on at that time. Sorting your inbox by sender instead of most recent helps you see whose (or what) messages you receive most. If it’s a newsletter or mailing list, you can delete them all in one go, but if it’s a specific person at work, you might get a signal that they tend to need a response from you. From there, you can prioritize their emails, maybe adding them as a favorite contact or paying special attention for new correspondence from them, since you know their messages are more consequential than others. Even if you're using the one- or two-touch methods, which call on you to open every single email the moment you get it, this can be helpful because you'll feel a sense of urgency around specific senders once you identify the patterns. So instead of deleting or delegating emails one by one, you can try nuking or dealing with entire batches from certain senders to make the sorting process faster. How to sort by sender in GmailIn Gmail, if you’ve already found a message from the person or entity whose emails you want to bundle up, you can right-click it from your inbox and hit “find emails from.” This brings you to an inbox only of messages from that sender. You can also access this inbox by typing “from:[their email address]” in the search bar, or clicking the advanced search button  and entering their name into the “from” field.\n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nUnfortunately, you can’t sort your entire Gmail inbox by sender, and instead can only make bundles sender by sender, but it still helps with batching them up.\n            \n                What do you think so far?\n            \n        \nHow to sort by sender in OutlookOutlook is better than Gmail for this method. In fact, it allows you to sort your entire inbox not only by sender, but by other recipients, size, and more.At the top of the inbox, hit “Filter,” then “Sort by.” Depending on what version you’re running, you may have to go into the “View” tab and hit “From” in the Arrangement group. The emails will line up in your inbox by sender, making them easy to bundle and delete.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "When Clearing Out Your Inbox, Trying Sorting It by Sender",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GX8ANP37Z4CNPP28PZDKB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-23T13:30:00.000Z",
      "dateModified": "2025-12-23T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Don't Fall for This 'Out of Stock' Purchase Scam",
    "url": "https://lifehacker.com/money/out-of-stock-purchase-scams?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KD13SDCX6KCTMZNT4Y30R6K1/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-22T15:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Ta",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Table of Contents\n    \n        \n        Scammers frequently target shoppers who are looking for a good deal or a rare find (or both). As holiday sale season winds down, the Better Business Bureau is warning buyers about a scheme in which fraudsters charge you for \"out of stock\" goods and fail to refund your money. The out-of-stock purchase scam is simple: After you buy a product online, scammers send you a notification that said item is no longer available, cancel your order, and tell you that you'll get your money back. Obviously, the refund never arrives, and no one ever responds to further inquiries. As the BBB points out, in most cases, the item you thought you bought probably never existed in the first place—rather, scammers are selling fake stock, charging customers, and vanishing in hopes you won't notice that you didn't receive your refund. Some consumers who submitted reports to the BBB Scam Tracker said that they did receive products, but items were of poor quality or not what they ordered, and no refund was ever issued. Spot out-of-stock purchase scamsThese fake purchase schemes may have the usual red flags, like prices that are too good to be true, especially those promoted on social media. Personalized items are ripe for scams, as are hard-to-find products or collectibles. If you find an amazing deal from a company or seller you don't recognize, search the name with \"scam\" and read reviews on Google and Reddit to identify patterns of suspicious activity (or poor-quality products). You should also be wary of websites that aren't secure—those that don't start with HTTPS or have a lock icon in the browser bar—as these are more vulnerable to hackers looking to intercept credit card info and other personal data. Legitimate vendors collect payment securely. \n            \n                What do you think so far?\n            \n        \nShop with a credit cardShopping scams are a good reason to use a credit card for online purchases, as they offer protection against fraudulent charges. If you don't receive a refund from a seller, you can file a chargeback—while this isn't as simple or swift a process, it is likely you'll get your money eventually.  Always keep receipts, order confirmations, and any communication with sellers in case you need to make a claim for a scam purchase. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Don't Fall for This 'Out of Stock' Purchase Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KD13SDCX6KCTMZNT4Y30R6K1/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-22T15:00:00.000Z",
      "dateModified": "2025-12-22T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]