[
  {
    "title": "CES 2026: Anker Launched These 2-in-1 Earbuds, and They’re Already on Sale",
    "url": "https://lifehacker.com/tech/anker-launched-these-2-in-1-earbuds-at-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEA53B9JCPQMZBE1YXV40VQB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-06T18:00:11.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Soundcore\n                            \n    Table of Contents\n    \n    ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Soundcore\n                            \n    Table of Contents\n    \n        \n        Anker launched a pair of \"2-in-1\" earbuds under its Soundcore brand at CES 2026, and it has a unique feature: They can be worn in two ways by adjusting the ear hooks. When you want active noise cancellation, you can wear it in-ear, and when you don't, you can adjust the hooks for an open-ear design. This quirky product is called the Soundcore Aerofit 2 Pro—and you can already buy it for $150, which includes a launch discount of $30.When it comes to CES announcements, I'm always wary of vaporware, aka products that are announced but never shipped. That's why I keep an eye out for products with a shorter launch window so you can actually get your hands on the things you're excited about. The Soundcore Aerofit 2 Pro is one of those products. As Anker itself admits on the product page, the Aerofit 2 Pro isn't for everyone. The biggest quirk of this product is its size. It's a lot bigger than most ANC earbuds, and the ear hooks go all the way around your ears, which isn't a fit that works for everyone. The charging case is also quite large, when compared with other ANC earbuds: It's 4.23 inches (11cm) wide, and it supports wireless charging. \n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Soundcore\n                    \n    \nMost noise-cancelling headphones let you switch to a listening mode that allows ambient sounds via software, but the Aerofit 2 Pro lets you do this by physically twisting the earbuds. This adjustment seems quite seamless based on the demo video on the product page, but I haven't tested it in-person, so I'll reserve my judgment until I do. There are five levels of adjustment for the ear hooks, with levels 1 and 2 reserved for open-ear listening, and 4 and 5 for noise cancellation. Level 3 maintains your previous listening mode to prevent accidentally switching to a different mode.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: Anker Launched These 2-in-1 Earbuds, and They’re Already on Sale",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEA53B9JCPQMZBE1YXV40VQB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-06T18:00:11.000Z",
      "dateModified": "2026-01-06T18:00:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Turn on This Setting to Protect Your Privacy When Letting Someone Else Use Your iPhone",
    "url": "https://lifehacker.com/tech/lock-down-iphone-when-letting-someone-else-use-it?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KE7H3DN05JEN7QAZGJHT1NS5/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-05T18:00:11.000Z",
    "description": "\n        \n        Your phone is a one-stop shop for a lot of your personal information, from day-to-day activities logged in your calendar and email t",
    "body": "\n        \n        Your phone is a one-stop shop for a lot of your personal information, from day-to-day activities logged in your calendar and email to financial data accessed via banking apps. If you let someone else use your device—whether you're showing a friend a collection of photos or allowing a stranger to make an emergency call—there's a lot you don't want them to be able to see. If you're an iPhone user, there are several features you can enable to prevent others from snooping around your device. Use Guided AccessIf you don't want someone using your device to see anything else on it, you can turn on Guided Access, which limits them to a single app (such as Phone or Photos). This essentially locks down your screen and prevents navigation outside of the specific features you make available. First, go to Settings > Accessibility > Guided Access and toggle the feature on. Tap Passcode Settings to set up a specific passcode or flip the Face ID toggle to use biometrics to end Guided Access sessions. To start a Guided Access session before handing over your phone, open the app and triple click the side button. You can circle specific areas of the screen you don't want to respond to touch (such as swipes through Photos). Tap Session Settings at the bottom to set a time limit, disable the keyboard, and manage button press options. Then tap Start. To end a Guided Access session, triple-click the side button and enter your passcode or double-click and authenticate with Face ID. \n            \n                What do you think so far?\n            \n        \nYou can also lock or hide specific appsSome mobile apps, like financial apps and password managers, already require you to log in or authenticate with your username and password combo or device biometrics every time you open them. You can also lock down other individual apps on iPhone so Face ID, Touch ID, or a passcode is required for access. To lock an app from your home screen, touch and hold the icon until the quick actions menu appears, then tap Require Face ID. Alternatively, you can hide apps so others cannot see them on your device (let alone open them) unless you authenticate using Face ID, Touch ID or a passcode. To hide an app, tap and hold the icon on the home screen and tap Require Face ID in the quick actions menu. Tap Hide and Require Face ID > Hide App. If you need to open a hidden app, swipe left on your home screen to reach your App Library, locate the Hidden folder at the bottom, and tap and authenticate to unlock the folder followed by the app. (Note that some native iOS apps, including Calculator, Camera, Clock, Contacts, Find My, Maps, Shortcuts, and Settings, cannot be locked, and system apps that come preinstalled cannot be hidden.)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Turn on This Setting to Protect Your Privacy When Letting Someone Else Use Your iPhone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KE7H3DN05JEN7QAZGJHT1NS5/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-05T18:00:11.000Z",
      "dateModified": "2026-01-05T18:00:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Is the Best Free Mac Cleanup Tool I've Found",
    "url": "https://lifehacker.com/tech/best-free-mac-cleanup-tool?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEAF3MW6Y26BSN0XD14M18A9/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-06T21:00:32.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n   ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        There are a lot of apps on the market that claim to \"clean up\" your Mac—for a price. Some offer subscriptions, some cost a lot up front, but for the most part, they offer the same few features—wiping things like caches and logs, completely uninstalling apps, and monitoring system health. These apps all tend to be a little on the bloated side, with a lot of animations and graphics.The free, open source, Terminal-based Mole is the opposite of those applications. Running entirely from the command line, Mole couldn't possibly look less flashy, but it combines a number of different tools that can free up hard drive space on your Mac while also keeping things running smoothly.To get started, you'll need to install Mole. The simplest way to do this is by using Homebrew, which any Mac user interested in a Terminal-based application should probably do anyway. There is, alternatively, a script you can use to install Mole on the download page.To use the application, just type \"mole\" in the Terminal and hit enter—you'll be presented with the five main tools offered: Clean, Uninstall, Optimize, Analyze, and Status. (You can, alternatively, type \"mole\" followed by the tool you want to use—more on that later.)\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThe first, Clean, scans your hard drive for caches and temporary files, then deletes them. The application explains what it's doing every step of the way, and you can always do a dry run using the command mole clean --dry-run if you'd like to see an overview before affecting any system files.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThe second tool, Uninstall, presents you with a list of applications installed on your computer and lets you know how much storage space they're using. You can select as many applications as you want with the spacebar, then hit enter in order to completely remove them. This doesn't just uninstall the application itself—it also removes all associated files, including settings.The third tool, Optimize, performs a number of routine maintenance tasks such as flushing the DNS cache, optimizing databases, and refreshing the Finder. I find this useful when my Mac is hanging for seemingly no reason.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThe fourth tool, Analyze, lets you see which folders are taking up the most space on your hard drive—useful if you're trying to free up disk space on your Mac. You'll see a list of folders alongside how much space they're taking up. Open a folder to see a breakdown of the folders and files inside it. I was able to find a number of large files using this tool, some of which I didn't need anymore.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThe final tool, Status, is a simple dashboard with stats including CPU, memory, and hard drive usage alongside an animated ascii-art cat. It's simple.It's all very straight forward to use, and there are generally instructions on the screen telling you what to do next. One thing I do want to point out is that you can run most of these tools directly from the Terminal, without the initial menu. You can, for example, type mole clean to run the cleaner or mole status to open the dashboard. You can read more on the project's Github page.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Is the Best Free Mac Cleanup Tool I've Found",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEAF3MW6Y26BSN0XD14M18A9/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-06T21:00:32.000Z",
      "dateModified": "2026-01-06T21:00:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Tool Deletes Your Info From Data Broker Sites (If You Live in One State)",
    "url": "https://lifehacker.com/tech/california-new-data-removal-tool?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KE84TTQFMPA7RY7YCJ7SKBA6/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-06T13:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Robert Harding Video/Shutterstock \n                            \n            \n  ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Robert Harding Video/Shutterstock \n                            \n            \n                Key Takeaways\n                                            California residents have gained more control over their personal data.\n                                            The Delete Requests and Opt-Out Platform (DROP) is now live, though brokers won't begin processing submissions until August.\n                                            If you don't reside in California, you can sign up for another service to submit data removal requests.\n                                    \n            \n    Table of Contents\n    \n        \n        There's very little privacy on the internet: Data brokers collect tons of information about you and your online activity and sell it to anyone interested in marketing to you. California residents have gained more control over their personal data than those in other states since the passage of the California Consumer Privacy Act (CCPA) in 2018, and they now have a one-stop shop for requesting that their information be removed from hundreds of data brokers registered with the state (and any that do so in the future). California isn't the only state to enact stronger consumer privacy laws in recent years, but its Delete Requests and Opt-Out Platform (DROP) is the first of its kind. The tool is live now, though brokers won't begin processing submissions until August. Here's what to do now if you live in California—and some options for removing your information from data brokers if you don't. How to sign up for California's data removal platformTo get started with DROP, you'll need to confirm that you are, in fact, a California resident by verifying personal information via California Identity Gateway or signing in with Login.gov credentials. To be eligible, you must either live in California or be domiciled in the state even if you live elsewhere temporarily. (This is based on the location of your primary residence, where you are registered to vote, and which state issued your driver's license.)You will then be able to create and submit a deletion request. You'll need to provide some personal data, which will be used to match your request with records held by data brokers. Data types include names, date of birth, zip codes, email addresses, phone numbers, Mobile Advertising IDs (MAIDs), and vehicle identification numbers (VINs). You can enter multiples of everything except your date of birth and update your request at a later time—if you get a new car or change your email, for example. While you can begin submitting requests now, know that data brokers won't actually begin processing them until August 2026 and could take up to 90 days from then to delete your data. If they find a match, they are required to delete all of the information they have about you, though there are some exceptions, such as data available through public records or provided directly to a business. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nOnce processing begins later this year, you'll be able to track the status of your request on the DROP platform. \n            \n                What do you think so far?\n            \n        \nAlternatives for deleting your dataIf you don't reside in California and qualify for DROP, all is not lost—though you will have to invest a bit more time and/or money to remove your information from data broker sites than simply mass deleting via a single request. To start opting out of data collection, download Consumer Reports' donation-based Permission Slip app, which tracks where your data can be found and follows up on removal requests. You can try to manually opt out by identifying data brokers and going directly to their sites, but this can be tedious, and there are a handful of other paid services that will do it for you. (None are perfect, nor do they guarantee 100% success.) We also have a guide to blocking companies from tracking your online activities, which can help mitigate the problem somewhat before it begins. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Tool Deletes Your Info From Data Broker Sites (If You Live in One State)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KE84TTQFMPA7RY7YCJ7SKBA6/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-06T13:30:00.000Z",
      "dateModified": "2026-01-06T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This 'Gift Card Draining' Scam Wants to Steal Your Christmas Money",
    "url": "https://lifehacker.com/money/gift-card-draining-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDNNQDDQRV3PT352ZAP9NNQP/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-30T14:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Credit: Zooey Liao/Lifehacker/Getty Images\n                           ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            Bad websites claiming to show you your gift card balance are actually collecting that information for later.\n                                            Other scam sites may offer to pay you for gift cards that you don't want or won't use.\n                                            Always use the official gift card site listed on the back of your card, or call or visit the retailer directly.\n                                    \n            \n    Table of Contents\n    \n        \n        If you received gift cards over the holidays, don't throw them in a drawer and forget about them. While many gift card scams involve thieves demanding payments—for everything from taxes and fines owed to outstanding utility bills—via prepaid cards, there's a less obvious type of fraud known as gift card draining. How gift card draining scams workIf you forget how much money is on a gift card you received a while ago, you're likely to check the balance online. You'll typically need to enter your card number and PIN or security code, but some websites that claim to provide gift card balances are actually collecting that information to use it later. Always use the official site listed on the back of your card, or better yet, call or visit the retailer directly to confirm the balance. In another version of this scam, fraudsters have set up sites offering to pay you for gift cards you don't want or won't use. They may claim to purchase your $100 card for $90—which sounds better than no money at all—but are simply out to steal the card information and drain the funds, and you'll never actually see that cash. Sites promoting that type of deal are typically not legitimate. When you purchase or receive a gift card, keep the receipt, note the starting balance, and register it with the retailer or transfer the funds from the gift card to your existing account if those options are available. If possible, change the PIN, and spend the funds sooner rather than later. Gift card scams begin in the storeIf you're considering buying physical gift cards in the future, be sure to check for signs of a scam. Fraudsters will tamper with cards in stores by adding stickers over the barcode, so when you check out, the funds you pay go to their account rather than the card itself, which means the balance will be zero when the recipient goes to spend it. Scammers can also record the card number and activation PIN or security code, then reseal the packaging and replace the card on the rack—once the card is paid for or activated, they use the information to spend the funds. \n            \n                What do you think so far?\n            \n        \nInspect gift cards purchased in-store carefully for added stickers, damage to the packaging, or scratch-off coating that has been removed. You can avoid some risk by purchasing gift cards online directly from the merchant's website (as gift cards sold at steep discounts on social media or deal sites are often scams). And if you do end up with a scam card, you can file a report with the gift card issuer, though your mileage may vary in terms of recovering funds. The Federal Trade Commission (FTC) has a list of fraud contacts for some of the most popular card retailers, including American Express, Visa, and Amazon. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This 'Gift Card Draining' Scam Wants to Steal Your Christmas Money",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDNNQDDQRV3PT352ZAP9NNQP/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-30T14:00:00.000Z",
      "dateModified": "2025-12-30T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Milwaukee Tools I Personally Use Are up to 50% Off Right Now",
    "url": "https://lifehacker.com/home/best-milwaukee-tool-set-sales-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEBKNE4WHFR9GH3XKBD6GX9G/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T15:00:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability sub",
    "body": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Home Depot/Lifehacker \n                            \n    Table of Contents\n    \n        \n        Tools can be a serious investment—so if you're looking to up your DIY game in 2026, a tool bundle is often a good solution. Because they come with batteries and chargers, they’re a great way to get everything you need to use a new tool set right away, and they can be more economical than buying each tool individually. Milwaukee tool sets are often more than $1,000, but you can get a few of these bundles for under $700 right now at Home Depot.Why I recommend Milwaukee toolsI’ve been using Milwaukee cordless tools for over a decade on a variety of professional and personal projects, including projects around the house as well as large scale decking installations. These tools tend to be reliable and the batteries routinely last more than ten years, even working on outdoor projects, exposed to rain and dirt. Durability is a big consideration when I buy tools; the longer they last, the more economical they are. Because all of the current tools are backwards-compatible with all of the 18-volt batteries I have, it's easy to add tools to my set as new ones come out that I want to try, and as my needs expand. Milwaukee tool bundles on saleThe Milwaukee 18-volt, nine-tool combo kit is on sale for $649, 46% off its regular price. It comes with a drill, a ¼-inch impact driver, a ½-inch impact wrench, a 6 ½-inch circular saw, a one-hand reciprocating saw, an angle grinder, an oscillating multitool, a mini blower, a work light, two 5-amp-hour batteries, a charger, and tool bag. This is a good set for larger projects, and it has many of the tools included that I used for building a large outdoor deck. Two larger capacity batteries is a good place to start, although if you plan on using multiple saw simultaneously, you’ll need to add another battery or two to keep a fresh battery ready on the charger.\n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \nThe Milwaukee 18-volt five-tool combo kit is on sale for $299, 50% off its regular price. This set includes a drill, a ¼-inch impact driver, a 6 ½-inch circular saw, a one-hand reciprocating saw, a work light, a five-amp-hour battery, a 1.5-amp-hour battery, a charger, and a tool bag. This set has everything you need to get started doing DIY projects, and it includes all the basic Milwaukee tools I use day-to-day for woodworking and smaller building projects like building shelves. This is a good starter set to build on, and it's very similar to the one I began with more than a decade ago.\n            \n                What do you think so far?\n            \n        \nThe Milwaukee 12-volt sub-compact drill and driver set is on sale for $199, 50% off its regular price. This set includes a 12-volt drill, an impact driver, a powered ratchet, two batteries, a charger, and a tool bag. While 12-volt batteries are often underpowered for larger projects, these smaller tools can be quite useful for projects like furniture assembly, putting up shelves, or doing appliance repair, as you often don’t need more than an hour or so of battery life to accomplish many of these tasks with your tools, and the smaller size makes them easier to fit into tight spaces.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Milwaukee Tools I Personally Use Are up to 50% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEBKNE4WHFR9GH3XKBD6GX9G/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T15:00:00.000Z",
      "dateModified": "2026-01-07T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: AMD Just Showed Off 'Helios,' the Hardware That Will Power the AI Content in Your Feeds",
    "url": "https://lifehacker.com/tech/amd-just-announced-helios-at-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KE8KYWR5P7GSGHGH8VZQSBQM/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-06T03:39:44.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: AMD/YouTube\n                            \n            \n                Key Takea",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: AMD/YouTube\n                            \n            \n                Key Takeaways\n                                            At CES, AMD unveiled Helios, its newest rack for AI compute.\n                                            This AI rack is extremely powerful, and will enable generations for all kinds of AI content.\n                                            The announcement comes as AI and AI data centers alike are under fire from critics for misinformation and impact on local communities.\n                                    \n            \n    Table of Contents\n    \n        \n        When you come across an AI video on Instagram, or watch ChatGPT respond to your query, do you ever think about how that content was generated? Beyond the actual programs and prompts, generative AI takes an enormous amount of compute to support, especially as it skyrockets in popularity. As such, AI companies are looking for more power than ever, which means, of course, turning to those that make the hardware. AMD calls Helios \"The world's best AI rack\" During a Monday evening keynote, AMD's CEO Dr. Lisa Su showed off the hardware that will soon power everything from ChatGPT to the AI videos overwhelming your feeds. Su introduced—against a backdrop of dramatic music—\"Helios,\" the company's upcoming AI rack, which packs a staggering amount of computing power into a rack that weighs nearly 7,000 pounds. Each \"cross-section\" of these racks is powered by four key AMD pieces of hardware: the company's new AMD Instinct MI455X GPU, the new AMD EPYC \"Veince\" CPU, the AMD Pensando \"Vulcano\" 800 AI NIC, and the AMD Pensando \"Salina\" 400 DPU. There are some staggering stats here: Helios is capable of 2.9 exaflops of AI compute, and comes with 31 TB of HBM4 memory. It offers 43 TB per second scale out bandwidth, and is developed with 2nm and 3nm architecture. The rack has 4,600 \"Zen 6\" CPU cores, and 18,000 GPU compute units. In other words, this isn't your average piece of hardware.Su's pitch is that the AI industry is in need of this additional compute power. She notes how the world used one ZettaFlop of computing power in 2022 on AI technology, compared to 100 ZettaFlops in 2025. (For the curious, one ZettaFlop has a value of 10 to the power of 21.) It's no surprise: AI is everywhere, and many of us are using it—whether we know it or not. Some of us are using it overtly, generating AI videos or running chatbots daily. But others are using AI quietly embedded in functions, like live translation.    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nSu welcomed reps from OpenAI, maker of ChatGPT, and Luma AI, which creates generative AI video content, to talk about how additional compute helps their programs. But during Luma AI's demonstration of its hyperrealistic video generations, all I could think about was how this type of content is already tricking people into thinking it's real, when it's entirely fabricated—not to mention the impact on human artists. AMD is optimistic about AI, and the data centers powering it, but critics have been pushing back, citing concerns with the impacts on the communities companies are building these data centers in. \n            \n                What do you think so far?\n            \n        \nHelios will likely be a major success for AMD, but it comes at an interesting time for tech, and AI in general. AI is more popular than ever, but it's also more controversial than ever. I see hardware like Helios only fueling the fire in both directions.  AMD Ryzen AI 400 seriesIn addition to Helios, Su announced the AMD Ryzen AI 400 series. These newest chips comes with either 12 \"Zen 5\" CPU cores and 24 threads, 16 RDNA 3.5 GPU cores, a 60 TOPS XDNA 2 NPU, and memory speeds of 8,533 MT/s. AMD says the Ryzen AI 400 series is 1.7 times faster at content creation and 1.3 times faster at multitasking when compared to Intel Core Ultra 9 288V. These new chips will ship soon in a number of major PC brands, including Acer, Asus, Dell, HP, Lenovo, Beelink, Colorful, Gigabyte, LG, Mechrevo, MSI, and NEC.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: AMD Just Showed Off 'Helios,' the Hardware That Will Power the AI Content in Your Feeds",
      "image": [
        "https://lifehacker.com/imagery/articles/01KE8KYWR5P7GSGHGH8VZQSBQM/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-06T03:39:44.000Z",
      "dateModified": "2026-01-06T03:39:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: There's a Whole Windows PC in This HP Keyboard",
    "url": "https://lifehacker.com/tech/ces-2026-hp-windows-pc-inside-keyboard?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDTYM6CST1T1M71X4E76QBDY/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-06T03:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: HP\n                 ",
    "body": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: HP\n                            \n            \n                Key Takeaways\n                                            The HP EliteBoard G1a is a keyboard with a whole Windows PC inside it.\n                                            It's aimed at enterprise customers, but you will be able to buy it from HP.com.\n                                            It's up to you whether to include a battery with it.\n                                    \n            \n    Table of Contents\n    \n        \n        If you're anything like me, you spend 90% of your time using your laptop with it docked and plugged into a monitor (or two). And if you're at that point, you might be wondering why you even bother having a screen attached to your computer at all. If so, HP's got your back. Announced at this year's CES, the HP Eliteboard G1a looks like a normal keyboard on the outside, but on the inside, it's got a whole Windows PC.That's not exactly a new concept, but with the experimental days of Windows XP long behind us, it's mostly been reserved for less powerful, Linux-based single-board computers like the Raspberry Pi. That's great if you're a hacker or tinkerer, but not if you're just looking for a screenless, keyboard-equipped Mini PC to get you through the workday. The Eliteboard G1a, instead, comes equipped with the latest AMD Ryzen AI chips, up to 64GB of RAM, and up to 2TB of storage, so while you shouldn't expect to play the latest and greatest games on it, for internet browsers and lightweight productivity programs, it should really be able to hustle.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nIt's also a bit of a sleeper build. I've been able to go hands-on with it, and to all outside eyes, it really does look like a regular office keyboard, complete with black, low-profile chiclet keys, a function row, and a numpad. Ranging from 1.5 to 1.7 pounds based on how you spec it out, it's also pretty lightweight, and the right person might believe you if you said it was just a keyboard, with no computer inside whatsoever.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe catch? This baby is aimed at enterprise customers, rather than your typical consumer. That does come with a few bonuses, like a Kensington lock slot, some extra security software, and an optional fingerprint reader. But it also means you're not going to find it up for sale anywhere other than the HP store, and while pricing hasn't been announced yet, it'll probably be a bit more expensive if bought individually rather than as part of an office fleet. It can also only connect to monitors using DisplayPort, which is fine if you're an office manager that knows to buy displays that will work with it, but may not fit into everyone's home set-up.\n            \n                What do you think so far?\n            \n        \nThat's a shame, because I love unusual form factors, and this keyboard PC could make for a really clean desk in my home office. It's strong enough, uses a familiar operating system with wide app compatibility, and can even output to two 4K monitors at once. There are also two versions, one that always needs to be plugged in, and one with a battery and a detachable USB power cable for quickly moving between different workstations. That's great flexibility, since the battery version is a bit more portable, but is also heavier.Here's hoping this is just an early experiment for HP, because I'd love to buy a consumer version of this laptop at some point in the future. If you're willing to take the plunge on the enterprise model, though, HP says it's expected to launch on HP.com sometime in March.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: There's a Whole Windows PC in This HP Keyboard",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDTYM6CST1T1M71X4E76QBDY/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-06T03:30:00.000Z",
      "dateModified": "2026-01-06T03:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'GhostPairing' Attacks Are Taking Over WhatsApp Accounts",
    "url": "https://lifehacker.com/tech/ghostpairing-attacks-are-taking-over-whatsapp-accounts?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDNG01324DJGEC5DZVSBVB38/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-29T18:30:06.000Z",
    "description": "\n        \n        If you use WhatsApp, you may be targeted by scammers looking to take over your account by pairing their browser to your number. This",
    "body": "\n        \n        If you use WhatsApp, you may be targeted by scammers looking to take over your account by pairing their browser to your number. This scheme, dubbed GhostPairing by researchers, uses WhatsApp's device linking process to allow fraudsters to access all of your messages, impersonate you in chats, and perpetuate the scam to your contacts. Here's how threat actors are hijacking WhatsApp accounts—and how to defend yours. GhostPairing manipulates WhatsApp device linkingWhatsApp allows users to link their desktop or browser to their account without needing to enter login credentials in one of two ways: scanning a QR code and approving the session or confirming a numeric pairing code in the mobile app. While the GhostPairing scam could theoretically manipulate users in either approach, researchers found that the latter is much more common. The fraud begins with a short message sent from a contact with a link that purportedly goes to a Facebook photo or some type of Facebook content. If you click through, you'll be directed to a spoofed Facebook login page to enter your phone number—a familiar confirmation flow for Meta platforms. The next screen will likely show a numeric code with instructions to enter said code into WhatsApp to confirm the login (again, this may feel like a familiar two-step verification). If you're not paying attention, you may not realize that this didn't do anything on your end but instead registered the attacker's browser as a linked device to your account. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe danger in this scam is that everything will seem normal on your device and in your account, as attackers haven't hijacked your credentials to lock you out. However, they can do anything and everything in WhatsApp that you can, such as reading chats, receiving messages, viewing and downloading media, collecting information from your contacts, and forwarding the same phishing link. As they learn more about you and the people you know, they can potentially use that for ongoing scams. How to protect your WhatsApp accountAs always, be wary of links received via messaging platforms, even if they seem harmless or you think you know and can trust the sender. Threat actors frequently use social media and direct messaging to spread phishing lures. If you do click a link in WhatsApp (or any other communication), read all prompts carefully before providing or verifying any information to identify scams. \n            \n                What do you think so far?\n            \n        \nTo protect your WhatsApp account specifically, you can set up two-step verification, which will also prevent attackers from adding or changing a connected email address. Go to Settings > Account > Two-step verification > Turn on or Set up PIN and add an email address when prompted. You can also check to see if there are any suspicious devices paired with your account under Settings > Linked devices and remove any you don't recognize or regularly use.Finally, if you have been targeted by this scam, let your WhatsApp contacts know, as threat actors may spread the malicious link by making it look like it came from you. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'GhostPairing' Attacks Are Taking Over WhatsApp Accounts",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDNG01324DJGEC5DZVSBVB38/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-29T18:30:06.000Z",
      "dateModified": "2025-12-29T18:30:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "That Grubhub Bitcoin Email Is a Scam",
    "url": "https://lifehacker.com/money/grubhub-bitcoin-email-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDPB8KZSCNR1QX8Q9JQ4RMPY/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-30T15:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: BestStockFoto/Shutterstock \n                            \n            \n",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: BestStockFoto/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Scammers are impersonating Grubhub to promote a crypto rewards scam.\n                                            Emails were sent from addresses on a legitimate Grubhub subdomain.\n                                            Grubhub is not actually doling out $10,000 in bitcoin.\n                                    \n            \n    Table of Contents\n    \n        \n        Some Grubhub users have received a tempting email offer from the food delivery service: Send $1,000 in bitcoin to a specified wallet, and get 10 times that amount back. Unfortunately, this is very much a scam.  As BleepingComputer reports, these promo emails were sent from addresses on b.grubhub.com, a legitimate Grubhub subdomain, so they appear verified in recipients' inboxes. Two examples of senders include [email protected] and [email protected]. Beyond that, there are some pretty clear red flags. The subject line reads \"30 minutes left - We'll 10x your Bitcoin!\" to promote a sense of urgency and an offer too good to be true (but also too good to ignore). The body includes the recipient's name and instructions on how to participate in Grubhub's \"Holiday Crypto Promotion\" with a bitcoin wallet address. While Grubhub has acknowledged the problem, they haven't released any details as to what facilitated attackers sending emails using a company address. The company did suffer a major security breach earlier this year, resulting in the leak of some user data (including names and email addresses). \n            \n                What do you think so far?\n            \n        \nThere are several varieties of the crypto reward scamThe Grubhub email promotion is a pretty typical example of a cryptocurrency scam. The Federal Trade Commission outlines several variants, including get-rich-quick schemes guaranteeing big returns on your investment and celebrity-promoted \"giveaways\" that claim to multiply any funds you send.If you fall for crypto fraud, there's no way to track or get your money back, and even if victims are few and far between, scammers can score big paydays. That's why you should be especially wary of anything and everything requiring a crypto transaction, especially if the offer sounds urgent or provokes a sense of either excitement or fear. And remember that no legitimate organization—government agency, law enforcement official, utility company, or prize promoter—will ever ask for payments in cryptocurrency.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "That Grubhub Bitcoin Email Is a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDPB8KZSCNR1QX8Q9JQ4RMPY/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-30T15:00:00.000Z",
      "dateModified": "2025-12-30T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: Amazon Just Launched Its Version of the Samsung ‘Frame' TV",
    "url": "https://lifehacker.com/tech/amazon-launches-its-own-version-of-frame-tv-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KE9YBFJPMTJ8139WN7AGK0BB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-06T16:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n       ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Not to be outdone by the likes of Samsung and TLC, Amazon is joining the picture frame TV space. At CES 2026, the company announced a new line of unobtrusive smart TVs, complete with a new brand name and a redesigned FireTV OS, which will also show up on other FireTV devices.Meet the Ember Artline TV series\n    \n            \n            \n                                        Credit: Amazon\n                    \n    \nAmazon is calling its new line of art TVs \"Ember Artline.\" They will ship in two sizes, 55 inches and 65 inches, with pricing starting at $899 for the base model—some $200 cheaper than the list price of Samsung's Frame TVs (though those models are regularly discounted on Amazon).The panels will offer 4K QLED screens with 450 nits of brightness. Because it's an art TV, there is a matte screen coating to reduce glare and make it look less like a standard TV. They also feature Dolby Vision, HDR10+, and Wi-Fi 6. Design-wise, they're incredibly thin, around 1.5 inches thick.Amazon's big selling point here is the Ember Artline offers 10 different frame options, all of which snap on the TV with magnets. You can choose between textures and colors like Walnut, Ash, Teak, Black Oak, Matte White, Midnight Blue, Fig, Pale Gold, Graphite, and Silver. In its art mode, the sets will cycle between 2,000 images of artworks, or your personal selection of photos. \"Omnisense technology\" will allow the display to turn on when anyone walks in the room, and turns off when they walk out, saving energy.And of course, this wouldn't be a CES 2026 product announcement without a bit of AI. Amazon is integrating Alexa+ into the FireTV OS on these sets, including an AI feature that will show art pieces on TV that match the decor and room that you're in (after you upload four photos taken from different angles). With an Amazon Photos connection, you can also ask Alexa+ to create slideshows from specific vacations, days, or events. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe Ember Artline lineup will start shipping sometime in spring, starting in the U.S., Canada, Germany, and the U.K.\n            \n                What do you think so far?\n            \n        \nThere's also a redesigned FireTV interface\n    \n            \n            \n                                        Credit: Amazon\n                    \n    \nAlong with the new art TVs, Amazon also showed off a redesigned FireTV interface—and it looks quite a bit like Google TV. That's not a bad thing from my point-of-view; one of my biggest issues with the FireTV OS is its slow and inconsistent home page. A refresh with better organization will certainly help, and visually, it looks a lot cleaner, with rounded corners, consistent typography, and much better spacing between elements. The home screen now has tabs above to quickly switch to movies, TV show, live games, and more. You can also press and hold the Home button to open a Control Center like menu, again similar to Google TV. You will also be able to pin more apps to the home screen. Previously you were limited to six large apps. The refreshed interface has space for up to 20 apps of your choosing. The refresh will begin rolling out next month in the U.S. to the Fire TV Stick 4K Plus, Fire TV Stick 4K Max 2nd Gen, and Fire TV Omni Mini-LED Series, and will be followed by more countries down the line. It will be available on the Ember TV series at launch.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: Amazon Just Launched Its Version of the Samsung ‘Frame' TV",
      "image": [
        "https://lifehacker.com/imagery/articles/01KE9YBFJPMTJ8139WN7AGK0BB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-06T16:30:00.000Z",
      "dateModified": "2026-01-06T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Petkit Just Announced Three New Smart Devices for Your Pets",
    "url": "https://lifehacker.com/tech/petkit-has-three-new-smart-devices-for-pets?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDZNMKJYZ90G9AE0E9FJG7FC/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-02T16:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Petkit\n                            \n            \n                Key Takeaways\n",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Petkit\n                            \n            \n                Key Takeaways\n                                            Petkit just announced three new AI-powered pet tech devices ahead of CES.\n                                            The company is launching a smart litter box, water dispenser, and an automated feeder that works with wet food.\n                                            While many companies advertise their products as \"AI-powered,\" Petkit's new products may give users some useful health insights into their pets.\n                                    \n            \n    Table of Contents\n    \n        \n        Petkit just announced three new smart pet tech products ahead of CES. Despite the conference not kicking off until Tuesday, the company shared details around its upcoming devices that are likely to launch this spring. Perhaps unsurprisingly, Petkit advertises all three pet devices as \"AI-powered,\" and while that's been a go-to gimmick for companies since 2023, there are some unique applications here—assuming the devices actually do what Petkit says they do. Purobot Crystal Duo litterboxPetkit says the Purobot Crystal Duo is the first AI-powered open-top litter box, and that the Purobot uses the tech for health detection. This device has an 720p AI-powered camera that monitors your cat's stools as well as their behavior when visiting the litter box. The Purobot looks at things like stool consistency and urine pH, as well as \"vocalizations,\" and noting all in the Petkit app. You can take any of those findings to your vet if you have concerns. Petkit says the Purobot uses crystal litter to absorb urine and dehydrate waste to manage odors. The company claims users can wait 30 days before needing to scoop the contents of the litter box, which also comes with disposable trays. The company plans to launch Purobot in July, on both Amazon as well as Petkit's official site. Eversweet Ultra water dispenser Petkit's new water dispenser also uses an AI-powered camera to track health habits, only this time through your pet's \"hydration habits.\" The device ships with a 1080p camera with a 140-degree wide-angle view that tracks your pet as they drink, even in the dark. The Eversweet supports facial recognition for multiple pets, which, in theory, allows it to track the habits of specific pets drinking from the same device.The dispenser comes with a five-liter tank, which Petkit claims supports two full weeks of drinking water for one pet. The device detects when the water is low, and refills the bowl when needed, passing through a \"antibacterial filter cube\" to prevent bacterial growth. Any \"waste\" water is not recirculated through the dispenser, and is instead separated, so pets should always have fresh water while the reservoir is full.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nPetkit says the Eversweet Ultra may launch in April, though that's only an estimate. It, too, will be available on both Amazon, as well as Petkit's official site.  Perhaps Petkit's biggest announcement is the Yumshare Daily Feast, an automatic feeder that works with wet food. This feeder can portion out fresh food for cats and dogs on a custom schedule, while tracking your pet's eating habits to build \"eating insights.\" Those insights are partially informed by the feeder's built-in 1080p AI-powered camera, with a 140-degree wide-angle view. It also supports facial recognition for multiple pets.\n            \n                What do you think so far?\n            \n        \nPetkit says the Yumshare Daily Feast supports up to seven days of fully automated wet meals—the keyword being \"automated.\" The machine opens each food pack itself, and each portion is \"kept within its freshness window.\" That means if your pet doesn't finish its meal, the device will take away the leftovers, and uses ultraviolet light (specifically UVC) to sanitize before delivering the next portion.  Petkit estimates it will release the Yumshare Daily Feast in April, both on Amazon as well as Petkit's official website. As with any new products, we'll have to wait until reviewers can perform hands-on testing before deciding whether these devices can actually achieve what they claim to. However, if Petkit's products are up to snuff, they could offer pet owners some legitimate benefits. The wet feeder really could be great for anyone who needs to leave their cat for long periods of time. The Purobot and Eversweet could also provide some essential health insights ahead of a vet visit: If you're seeing reports that your cat is crying while using the litter box, or isn't drinking as much water as they usually do, you could get ahead of a health problem by notifying your vet early.   \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Petkit Just Announced Three New Smart Devices for Your Pets",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDZNMKJYZ90G9AE0E9FJG7FC/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-02T16:30:00.000Z",
      "dateModified": "2026-01-02T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Choose the Right VPN for You",
    "url": "https://lifehacker.com/tech/how-to-choose-the-right-vpn-for-you?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEC6X19FDSW9A9CDGB0RG4B0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-07T14:30:00.000Z",
    "description": "\n        \n        There are many good reasons to get a VPN (Virtual Private Network) app installed on your phone or laptop: They make it harder for an",
    "body": "\n        \n        There are many good reasons to get a VPN (Virtual Private Network) app installed on your phone or laptop: They make it harder for anyone else to track your browsing, they keep your data safe when you're on public wifi networks, and they even let you spoof your location so you can access geolocation-locked content.You'll also find plenty of choice when it comes to VPNs. Our own guides to the best paid VPNs and the best free VPNs show the wealth of impressive apps out there, and even when you narrow down the criteria, you've still got lots of options to pick from—see our recommendations for the best free VPNs for Android.So what exactly should you be looking for when it comes to choosing the right VPN for you? These are the features and selling points that you'll see mentioned when you're browsing VPN comparisons, and what they mean (and once you've built up a shortlist from these criteria, then you can look at the prices and extras).Browsing speedOne of the downsides of loading up a VPN is that your browsing speed can suffer, while your data gets pinged around multiple servers across the globe. Ideally, you want all the protection that a VPN offers, without too much of a hit on download and upload rates (no matter how many other people are using the same VPN).Unfortunately, this isn't really something you can gauge just by looking at VPN listings and ads, as most VPNs will claim to be the fastest. Either read benchmark tests put together by publications and authors you trust (watch out for sponsored content), or make use of as many free trials as you can and do some testing yourself.Server locations\n    \n            \n            Even VPN service will tell you how many servers it has, and where they are.\n                                        Credit: ExpressVPN\n                    \n    \nYour VPN of choice needs to reroute your internet traffic somewhere, and how many servers a particular VPN has around the world can make a substantial difference to speed and availability. It's also going to determine where in the world you can pretend to be of course, if you want to jump to another country virtually.Broadly speaking, the more servers the better, though as with VPN speeds you may have to do some testing of your own to check reliability and transfer rates. Look for server locations close to you (for speed), and outside of heavily censored or surveilled countries (for privacy), and check any technical specs that are given for them.Split tunneling and kill switchesSomething else to look out for is split tunneling, or the ability to send only some of your internet traffic through a VPN. This means you get better speeds (and less security and privacy) on data that's not so important, if you're just reading the news or learning a language. It's a feature that many of the best VPNs now offer.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nAnother feature worth checking for is a kill switch. It sounds rather dramatic, but it's simply a feature that shuts down your internet connection if the data encryption somehow fails—cutting you off from the internet, but preventing your connection and data from being exposed. Again, this is now fairly common, but not every VPN offers it.No logs or zero logs\n    \n            \n            Mullvad VPN lets you pay by cash, if you don't want to enter payment info.\n                                        Credit: Mullvad VPN\n                    \n    \nYou should only consider VPNs that have clear no-logs policies (no browsing data is permanently retained) or zero-logs policies (supposedly even stricter, covering more data). Don't take the VPN's word for it. though: Look for third-party audits from independent security companies, carried out regularly, to verify these claims.If these logs are retained, they might be sold to data brokers, or pulled by law enforcement agencies—so check the individual privacy policies for details of what happens when you're connected to your VPN. Some VPNs go above and beyond when it comes to letting you stay anonymous: Mullvad VPN lets you pay by cash through the post, for example.\n            \n                What do you think so far?\n            \n        \nVPN protocolA VPN protocol is the way that the VPN connects to the internet at large: It makes a major difference to speed and security, and you'll often see it mentioned in VPN listings. However, as important as it is, it's not something that's easy to compare across different VPN services—most VPNs will simply say their protocol of choice is the best.Once you've got a shortlist of VPNs together, do some background reading on the protocols they use: Look for independent assessments of their security and transparency, technical benchmarks, and protocols that have been open sourced so they can be analyzed. OpenVPN and WireGuard are two well-regarded protocols, for example.Location and reputation\n    \n            \n            Where a VPN is based is important, as well as where it connects to.\n                                        Credit: Lifehacker\n                    \n    \nVPN companies are bound by the laws and regulations of the country that they're based in—so it's a good idea to look for ones based in places where surveillance regulation and government monitoring is less strict. If necessary, check the VPN's policies on how it deals with data requests from the authorities and law enforcement in its local region.It's also worth weighinga VPN company's reputation: How does it make money? What other services does it offer? What's its record with data breaches? This is much more important with a VPN than it is with your streaming music provider, for example, because you're trusting it with all of your online data while you're connected.Trials and money backGenerally speaking, it's worth paying for a VPN, as you're giving it so much responsibility in terms of your online access and security. The paid options are almost always going to give you a faster and more reliable service, and if you regularly make use of a VPN then the monthly fee is well worth the investment.It is, however, worth looking for services that offer free trials and your money back if you're not satisfied (usually after 30 days). Not only does it reflect well on the VPN company, it means you can see if the VPN suits your needs—and check how fast its servers are—before signing up for any kind of payment plan.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Choose the Right VPN for You",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEC6X19FDSW9A9CDGB0RG4B0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-07T14:30:00.000Z",
      "dateModified": "2026-01-07T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: Lenovo Just Quietly Announced the Most Powerful 'Steam Deck' Yet",
    "url": "https://lifehacker.com/tech/lenovo-just-quietly-announced-the-most-powerful-steam-deck-yet-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDRD3AACZJ6C32SY3A54WR5V/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-07T01:00:06.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Michelle Ehrhardt\n  ",
    "body": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            Lenovo's Legion Go 2 is getting refreshed with SteamOS.\n                                            The new model will retain the same specs and large, high-res OLED screen.\n                                            The Legion Go 2 with SteamOS is expected to launch in June.\n                                    \n            \n    Table of Contents\n    \n        \n        2025 was a great year for handheld gaming, with the Nintendo Switch finally getting a sequel and older handhelds like the Nintendo DS getting unofficial successors from companies like AYN and Ayaneo. Steam Deck fans did take a bit of a hit towards the end of the year, when Valve announced it was discontinuing the $400 Steam Deck LCD, but for gamers on the other side of the price spectrum, Lenovo just announced the most powerful SteamOS handheld yet.It's technically not a new device, but instead, a reissue of a handheld from last year. Called the Lenovo Legion Go 2, it packs up to an AMD Ryzen Z2 Extreme chip, up to 32GB of RAM, and up to 2TB of storage. It's also got detachable controllers like the Nintendo Switch, and uniquely, an 8.8-inch OLED display. And now, you can buy it with SteamOS officially installed out of the box (last year's release only came with Windows).If it's anything like the Legion Go S with SteamOS preinstalled, that means booting it up and navigating through your games will feel just like using a Steam Deck, which is great news for anyone who's a fan of Valve's lightweight and simple-to-use operating system, but is starting to feel like it might be showing its age. Not only should it prove easier to use than last year's Legion Go 2 with Windows installed on it, but the more powerful chip means the handheld will be able to play games much more smoothly and at higher resolutions than any other official SteamOS device yet. The hardware isn't made by Valve, but effectively, this is now a new, ultra-powerful Steam Deck sequel, and should be able to bump up your fps by up to dozens of frames in the right circumstances. For a measure of how transformative this can be, when the Legion Go S got SteamOS, it went from one of my least favorite handheld gaming PCs to my best pick for most people.Even those who already have the Windows version could see a performance increase, since SteamOS typically takes fewer resources to run than Windows, which can translate to smoother gameplay. You can see my review of the Legion Go 2 with Windows for more there, where I compare it to SteamOS devices. With this hardware combined with this operating system, this might be the most powerful handheld gaming PC you can buy right now, period.The only catch? This is still a bulky device, and while the SteamOS version of the Legion Go S saw a price cut over the Windows version (likely due to Valve not charging a licensing fee like Microsoft), the SteamOS version of the Legion Go 2 actually starts off more expensive than the Windows version, at $1,199 rather than $1,099. That could be due to shortages on key components like RAM, but it is disappointing to see an already high price tag get higher when the precedent for SteamOS versions of these devices is for prices to come down.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nStill, the cheapest Windows model for the Legion Go 2 is actually a bit hard to find anywhere other than Lenovo's official store right now anyway, so it's possible that model could face its own price bumps in the near future as supply dwindles. And above four figures, one could argue that quality matters more than an extra $100 on the price tag.\n            \n                What do you think so far?\n            \n        \nGranted, you could get a Windows version and install SteamOS on it yourself, but doing so is a bit arduous, and can result in some unintuitive button mapping. The version with SteamOS installed out of the box, meanwhile, has a dedicated Steam button set-up from the get go. You'll have fewer headaches and a more intuitive setup by going for it.Aside from that button and the operating system, everything else about the device is the same as the Windows version, but that's not a bad thing. I called it \"overkill\" in my review, but that large OLED screen is gorgeous, and perfect for gamers who want the best looking graphics possible on the go. The original Legion Go 2 was my favorite premium gaming handheld of last year, and the model with SteamOS installed on it is only set to make it better.Valve gamers who think the Steam Deck OLED or Legion Go S aren't quite ritzy enough for them should stay tuned for the official release date, currently expected for June. This could be the premium handheld gaming PC they've been waiting for, marrying SteamOS convenience with modern specs that even the similarly priced Xbox handheld can't match. Finally, there's a \"Steam Deck\" for the 1%.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: Lenovo Just Quietly Announced the Most Powerful 'Steam Deck' Yet",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDRD3AACZJ6C32SY3A54WR5V/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-07T01:00:06.000Z",
      "dateModified": "2026-01-07T01:00:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: This Tiny Computer Is like a Mac Mini for PC Users",
    "url": "https://lifehacker.com/tech/ces-2026-lenovo-yoga-mini-i?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDZY4YRMC1YYFS2P8EQFH0SD/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-07T01:00:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Michelle Ehrhardt\n  ",
    "body": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            The Lenovo Yoga Mini i is a tiny little Windows computer that feels a lot like a Mac Mini.\n                                            The power button is actually on the side of the computer, a benefit over Apple's Mini computer, and there's a built-in accelerometer.\n                                            The Yoga Mini is expected to release in June, starting for $700.\n                                    \n            \n    Table of Contents\n    \n        \n        Mini PCs are great for people who want minimal desk setups, but aside from the Mac Mini, they're not really something that appeals to the average user. Most are boring and still-slightly-chunky boxes, come from lesser-known companies like Geekom, and are built either for enterprise or thrifty gamers. What's a Windows user who doesn't want to swap to Apple to do? This year, Lenovo's launching a new Mini PC with some of that Apple sleekness, to try to fill that niche.Unveiled at CES, the Lenovo Yoga Mini i is a cute little circle that fits in the palm of your hand and weighs just about 1.3 pounds (with small variations depending on how you configure it). A slightly textured, silvery-gray paint job covers the entirety of the device, and ports are generous but stay in dedicated areas on either the rear or side of the device. The rear's got slots for an ethernet port, a USB-A cable, an HDMI cable, and three USB-C cables, with one set aside for power, one for Thunderbolt 4 accessories, and one for all the rest. The side has a 3.5mm headphone jack (thank goodness) and another Thunderbolt 4 port.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nIt's an overall attractive appearance, which is important when you're selling something based on form factor, but the kicker is that the power button is actually on the side of the device. It sounds simple, but that's bound to drive people who bought the latest Mac Mini, which has its power button underneath the computer, crazy with envy. Better yet? That power button also doubles as a fingerprint reader for easy sign-ins.\n    \n            \n            Lenovo Yoga Mini rear view (left) and power button view (right)\n                                        Credit: Lenovo\n                    \n    \nSpecs wise, it comes decked out with the latest Intel Core Ultra X series AI chips, up to 32GB of RAM, and up to 2TB of storage. It also features a WiFi 7 adapter, two speakers, and even a microphone built-in, for zippy internet connectivity and easy audio calls. That's more than enough performance for the average person, and probably even outclasses my years-old full-size desktop. Don't expect to play the latest games at max settings on it, but this should be roughly equivalent to a high-end productivity laptop if you go for its most powerful configuration options.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nTo push it over the edge, the Yoga Mini i also has its own \"one more thing.\" There's actually an accelerometer with a touch sensor inside this thing, so it can work with Lenovo's Smart Connect ecosystem. The company says you can use this to take calls by tapping on the PC, use certain touch gestures to adjust the Yoga Mini's performance mode, or use a customizable double tap to do other actions, like calling up an AI chatbot.\n            \n                What do you think so far?\n            \n        \nTaken all together, the smooth appearance, user-friendly design tweaks, and tiny size make for probably the closest thing I've seen to a Windows version of the Mac Mini yet—and that goes for the pricing, too. The Yoga Mini i will start at $700, which is $100 more than the base Mac Mini, but is still pretty affordable for those kind of specs in the middle of a memory shortage. Lenovo hasn't said how expensive it could get if you go for extra storage or RAM, too, and it's possible its mid-range configurations could come in at less expensive or around the same price as the Mac Mini's.Personally, I was seriously considering downsizing to a Mac Mini for my next computer, but with the Lenovo Yoga Mini i, maybe I'll stick to Windows for at least a little bit longer. If you're in the same boat, Lenovo expects to release the Yoga Mini i sometime this June.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: This Tiny Computer Is like a Mac Mini for PC Users",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDZY4YRMC1YYFS2P8EQFH0SD/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-07T01:00:00.000Z",
      "dateModified": "2026-01-07T01:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]