[
  {
    "title": "You May Be Eligible for Part of This $10.5 Million Spam Text Settlement",
    "url": "https://lifehacker.com/tech/kaiser-permanente-spam-text-settlement?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG862TDW2R0TKESQQTX7J3PH/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-30T20:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 30, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: bluestork / Shutterstock\n                            \n            \n                Key Takeaways\n                                            Healthcare company Kaiser Permanente recently settled a $10.5 million class action lawsuit regarding marketing text messages that were sent even after recipients opted out.\n                                            If you submit a valid claim, you may be eligible for up to $75 per text, though the amount is likely to be less.\n                                    \n            \n    Table of Contents\n    \n        \n        Unsolicited texts are annoying—and even more so if they keep coming from a legitimate sender after you've opted out. If you received text spam from Kaiser Permanente, you may be eligible for a cash payout for each message. The healthcare company, which serves over 12.5 million members, recently settled a $10.5 million class action lawsuit filed over marketing text messages sent after recipients tried to opt out. The suit, filed in August 2025, claimed that Kaiser Permanente failed to honor opt-out requests. Those with a valid claim may receive up to $75 per qualifying text. Are you eligible for the Kaiser settlement? To qualify for a payout from this settlement, you must have received more than one text message from Kaiser Foundation Health Plan Inc. within a 12-month period—between Jan. 21, 2021 and Aug. 20, 2025—after sending a \"stop\" or similar opt-out request. (Note that the confirmation of your request does not count.)\nAccording to the settlement website, there are two separate classes covered by suit: one for message recipients in Florida and one for the U.S. as a whole. \n            \n                What do you think so far?\n            \n        \nHow to claim your settlement cashTo get your cash, you'll need to submit a valid claim form by Feb. 12, 2026. You can complete your claim online if you received a notice of eligibility via mail or email containing a unique ID and PIN. If you did not get a notice, you'll have to download and submit a paper claim form to the settlement administrator. Hard copy claims must be postmarked by Feb. 12. While the maximum per-text payout is $75, the final amount may be less depending on how many claims are filed. Payments could take months to distribute while settlement details are finalized, so don't expect the funds to arrive immediately. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You May Be Eligible for Part of This $10.5 Million Spam Text Settlement",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG862TDW2R0TKESQQTX7J3PH/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-30T20:30:00.000Z",
      "dateModified": "2026-01-30T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Well-Reviewed Outdoor Camera Is Nearly 30% Off Right Now",
    "url": "https://lifehacker.com/tech/tapo-magcam-2k-plus-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG7J355X9Z5YXEY1AE38HZP6/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-30T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 30, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon/Lifehacker \n                            \n    Table of Contents\n    \n        \n        There’s no shortage of outdoor security cameras, but finding one that balances video quality, battery life, and ease of use without pushing past $100 is rare. Right now, the Tapo MagCam 2K+ is on sale for $64.98 on Amazon, down from $89.99, which is its lowest price to date, according to price trackers.\n PCMag named it the best security camera of 2024, pointing out that while battery-powered cameras often trade convenience for frequent recharging, the MagCam 2K+ avoids that issue with a 10,000mAh battery rated to last up to 300 days per charge, depending on how often it records.Charging happens over micro-USB, though there’s an optional Tapo A200 solar panel ($35.99) if you want to avoid manual recharging altogether. Video tops out at 2K resolution, with a wide 150-degree field of view that works well for driveways or side yards. During the day, footage looks sharp and detailed. At night, the camera can switch between infrared black-and-white or color video using its built-in spotlights and starlight sensor. Storage is flexible. You can record locally to a microSD card, up to 512GB (card not included), or you can go with cloud storage through a Tapo Care plan starting at $3.49/month.\n            \n                What do you think so far?\n            \n        \nAlerts can distinguish between people, pets, and vehicles, and those intelligent notifications are free, as highlighted by PCMag in its “outstanding” review of the MagCam 2K+. It also integrates smoothly with Alexa, Google Assistant, and IFTTT, though it doesn’t support Apple’s HomeKit. You also won’t find mechanical pan or tilt, but the fixed lens covers enough ground for most yards or porches. As for managing the camera, its companion app is intuitive, offering settings for motion sensitivity, siren activation, spotlight brightness, firmware updates, and more. Overall, the MagCam 2K+ handles the basics well and throws in a few smart features usually reserved for pricier models.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Well-Reviewed Outdoor Camera Is Nearly 30% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG7J355X9Z5YXEY1AE38HZP6/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-30T14:00:00.000Z",
      "dateModified": "2026-01-30T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This QLED TV Is an Incredible Value, and It's 40% Off Right Now",
    "url": "https://lifehacker.com/tech/hisense-class-u8-tv-amazon-deal-of-the-day?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K3RRYBXWQW081EAW6S0J9ZT3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-29T21:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                            \n        \n            Daniel Oropeza\n                \n                                            Staff Writer\n                                    \n            \n            \n        \n            ExperienceDaniel is a Staff Writer for Lifehacker covering tech deals and reviewing TVs, headphones, speakers, and projectors. He earned his master’s in journalism from Columbia University and has reported for the Miami Herald. He lives in Atlanta.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Rene Ramos\n                            \n    Table of Contents\n    \n        \n        QLED TVs are, in my opinion, a perfect sweet spot between budget TVs and OLEDs—they're a huge improvement in video quality without having to pay the thousands required for an OLED. And honestly, most people can't tell the difference between an OLED and a QLED anyway, but most people see the difference between a budget TV and a solid QLED. If you're looking for a steal on one of the best QLED TVs of 2025, the Hisense 65\" Class U8GQ is $898.32 (originally $1,498) after a 40% discount, bringing it down to its lowest price ever, according to price-tracking tools. The other, bigger sizes are also seeing great discounts right now.\nThe Hisense U8QG is a mid-tier QLED TV that was released in April of 2025, and it's in my list of the best budget QLEDs of that year. It's a solid, well-rounded TV that will work well in bright rooms and excels for watching sports, movies, and playing video games. The brightness, black levels, and colors are its most impressive specs, as PCMag noted in its \"excellent\" review. \n            \n                What do you think so far?\n            \n        \nThis TV also has a Hi-View AI Engine Pro processor, HDMI 2.1 bandwidth on all three ports, and a USB-C display port that PC gamers can use to play directly on the TV. It can handle 4K resolution at a 165Hz refresh rate and 1080p at 288Hz. It also has support for arguably the most important HDR formats: Dolby Vision and HDR10+. The TV OS, Google TV, is my personal favorite because it lets you seamlessly cast your phone or computer directly to the TV. It also supports voice controls. \n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This QLED TV Is an Incredible Value, and It's 40% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01K3RRYBXWQW081EAW6S0J9ZT3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-29T21:30:00.000Z",
      "dateModified": "2026-01-29T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Samsung 77-Inch OLED TV Is Under $1,500 Right Now",
    "url": "https://lifehacker.com/tech/samsung-77-inch-oled-s85f-tv-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG51BYTGZ282TNM3ZC746SV9/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-29T14:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Woot/Lifehacker \n                            \n    Table of Contents\n    \n        \n        A 77-inch OLED dipping below $1,500 doesn’t happen often. Seeing it at $1,419.99 is even rarer. That price beats the lowest tracked deal for the Samsung S85F and lands well under Amazon’s current $1,597.99 listing. This Woot deal is for a factory-reconditioned unit. In exchange, you get a 90-day Samsung warranty and free standard shipping if you’re a Prime member, while non-members pay an extra $6. The deal is live for two days or until stock runs out. \nThe Samsung S85F is positioned as the company’s entry-level OLED, replacing the 2024 S85D and sitting just below the S90F and S95F in the lineup. It skips the newer AI-powered processor used in pricier models (which mostly affects how aggressively it handles upscaling and HDR tone mapping), but you’re still getting Samsung’s 2025 Tizen OS with all the essentials—built-in voice assistant, casting support, and a responsive UI. As for connectivity, all four HDMI ports support 4K at 120Hz with Variable Refresh Rate (VRR), making this a legitimate option for PS5 and Xbox Series X users. It doesn’t support Dolby Vision HDR, as is typical of a Samsung TV, but it does handle HDR10+, which offers similar dynamic range improvements.\n            \n                What do you think so far?\n            \n        \nThe WOLED panel plays to OLED’s strengths in darker rooms. Blacks look genuinely black, colors pop without looking artificial, and the viewing angle stays consistent even when you’re sitting off to the side. Reflection handling is solid, so overhead lights aren’t a dealbreaker, though black levels lift noticeably in brighter spaces. For mixed use, like movies at night, gaming sessions, and casual daytime watching, it performs well. If you’re comfortable with the reconditioned aspect and don’t need extreme brightness, this is a practical way to get a massive OLED without the usual price shock.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Samsung 77-Inch OLED TV Is Under $1,500 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG51BYTGZ282TNM3ZC746SV9/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-29T14:30:00.000Z",
      "dateModified": "2026-01-29T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Start a Group Chat in Spotify's DMs (for Some Reason)",
    "url": "https://lifehacker.com/tech/spotify-now-supports-group-chats?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG5J6KDEVKM25TBB8ST0W0AN/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-29T20:30:02.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Spotify is expanding its in-app message feature to support group chats.\n                                            Group chats can be as large as 10 people, and otherwise function the same as Spotify's one-on-one chats.\n                                            All users have access to Spotify Messages, including both free and Premium users.\n                                    \n            \n    Table of Contents\n    \n        \n        If you and your friends have the same taste in music, you probably text each other what you're listening to. I know when I stumble upon a new discovery I love—or even something I think is trash—I fire it off to the group chat to talk about it. Of course, I just forward the song to the group chat in the Messages app, like any other thing I'd want to send to that group. If you have Spotify, however, you have a new group chat option to choose from: Spotify itself. Spotify heads might already know that the app has had a messaging feature since August. While the point of the feature is to send Spotify content to your friends, it's a basic messaging service, which means you can send any text you want—including emojis. It's available to any Spotify user, whether you have Premium or just a free account, so long as you're 16 or older. None of that is new today.What is new today is the amount of people you can text at once in Spotify. Since August, chats have been limited to one-on-one interactions. Now, you're able to add up to nine other people at once to a thread. That means 10-person group chats to talk about new music, podcasts, audiobooks, or, of course, anything at all—assuming you actually want to move your DMs to Spotify.\nHow to start a group chat on SpotifyTo start, open Spotify on mobile (this isn't supported on desktop at this time) then tap your profile in the top right corner. Look for \"Messages\" at the bottom of this menu, then choose \"New Message.\" If this is your first time interacting with people on Spotify, you'll need to invite others to chat before you can craft a new message. Here, you'll have the choice to share a link to invite a friend to join your message. You can also find this option from the share menu on any piece of Spotify content, and hitting the \"Invite friends\" option. Once you've initiated a message, you'll be able to start crafting new ones—including group chats. Head back to this Messages menu—or hit the share button on a song, podcast, or audiobook—then choose \"Create group.\" Here, tap any friends from the suggestions you'd like to add, then choose \"Create group\" again to finalize the chat. Spotify says the people that appear in the list of suggestions are those you have shared content to before, created a playlist or Blend with previously, were in a \"recent\" Jam together, or are on an active Family or Duo plan. If they don't appear, you can always choose the invite option to reach out directly.\n            \n                What do you think so far?\n            \n        \nWhoever creates the group is officially its admin. As the admin, you have the power to add or remove anyone from the group chat. If you're in the group chat, you're labeled as a \"Participant.\" Invited members are labeled \"Pending.\" The admin as well as any participants are allowed to block any group chat user for any reason.The issue is, do you really want to dedicate a group chat to Spotify itself? Maybe if this feature rolled out when the app launched way back when, it'd be different. But people are set in their ways: It's so hard to get people to move chat apps, especially when it's for one specific purpose. Rather than open yet another thread to keep track of, I think I'd rather just text links to my main group chat—and I'm guessing the other members of the chat would agree. How to turn off Spotify MessagesIf you don't want to use Spotify's messaging service at all, you can leave it behind, and save yourself from getting added to all future group and one-on-one chats. To do so, tap your profile, choose \"Settings and privacy,\" then hit \"Privacy and social.\" Here, scroll down to \"Social features\" and turn off \"Messages.\" \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Start a Group Chat in Spotify's DMs (for Some Reason)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG5J6KDEVKM25TBB8ST0W0AN/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-29T20:30:02.000Z",
      "dateModified": "2026-01-29T20:30:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "12 Hacks Every Roku User Should Know",
    "url": "https://lifehacker.com/tech/hacks-every-roku-user-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFGGX99JJJD4W78EZ93VERA2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-27T14:00:00.000Z",
    "description": "\n    \n                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n         ",
    "body": "\n    \n                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        January 27, 2026\n            \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        Roku was one of the original names in streaming, and even with so many options now available from Amazon, Apple, Google and others, it remains one of the most popular options thanks to its affordable boxes and streaming sticks and widespread availability as an integrated operating system on some TV sets. The platform is speedy, simple, and supports just about every streaming app out there.If you've got a Roku or two in your life, you may not be using it to its full potential. These tips, hacks, and hidden features should help you go beyond the basic business of launching your streaming apps and get more out of your hardware, whether you've just unboxed your first Roku device, or you've been using one for years.Set up PIN protection to protect your RokuIf you've got young kids or nosy housemates living with you, you can lock certain parts of the Roku experience (including making purchases and adding new channels) behind a PIN number. This is actually done through your Roku account page on the web: Click PIN/parental controls on the left, and you can set a new PIN or change an existing one.Change the look and feel of your Roku with a new themeYou don't have to settle for the standard Roku interface visuals—you can easily switch to a different theme (which basically means a different wallpaper and screensaver). From Settings on your device, choose Themes to see alternatives provided by Roku and other people in the Roku community. You can always pick Restore default theme to go back to the original look.Enable captions on replayYou might not want closed captions on all the time, but you can have them enabled whenever you skip backward. From the home screen, pick Settings > Accessibility > Captions mode > On replay to enable this. Note that the streaming app you're using needs to support the feature as well, so it may not work everywhere.Put your most-watched apps up topThis is a simple and effective one that you might not have got around to doing: You can organize the apps on the home screen so your most-used are nearer the top and easier to get to. Select any tile on the home screen, press the star button on your remote to bring up the context menu, and you'll see the Move app and Move app to top options.Make use of Guest Mode when you have company\n    \n            \n            Roku devices come with a Guest Mode included.\n                                        Credit: Lifehacker\n                    \n    \nIt's great having guests—but don't let them mess up your recommendations and viewing progress. You can put your Roku device into Guest Mode by opening Settings from the main Roku menu, then choosing Guest Mode > Enter Guest Mode. You'll be signed out of all your apps, and the Roku device will restart ready for someone else to use it.Send your photos to your Roku to view them on the big screenYou won't always be watching films and shows on your Roku of course—and when your streaming device isn't doing anything else you can get images from your Google Photos library up on your TV. To set this up, you need to head to the Photostreams page on the Roku website, sign in using your account, and then follow the instructions online.Set up a cross-platform Roku watchlistThere will often be times when you see something interesting, but don't have time to watch it right away, and that's when the Roku watchlist feature can help. Select any movie or show from the home screen, and on the listing page use the Save button to add it to your list: You can then pick Save List from the main menu to see what you've saved.Pair your Bluetooth headphones to your RokuIf you've got a pair of wireless Bluetooth headphones and a Roku device that supports Bluetooth, you can pair the two together for some private audio listening— handy if you don't want to disturb anyone around you. You can do this by heading to Settings from the main Roku menu, then choosing Remotes & devices > Wireless headphones.\n            \n                What do you think so far?\n            \n        \nListen to your Roku via your smartphoneThere's another way to listen through headphones, and it doesn't require Bluetooth or wireless headphones. If you install the aforementioned Roku app on your smartphone, then plug a pair of headphones into your phone as well, you can tap Remote control in the app and then the headphone button to stream the audio right to your ears.\n    \n            \n            You can use the mobile app to listen over headphones.\n                                        Credit: Roku\n                    \n    \nMirror your other devices to your RokuApple devices: Roku sticks, boxes and TVs come with support for the Apple AirPlay standard built right in, so you can beam across audio and video from Apple devices, or even mirror your Mac display on the big screen. On the Roku, choose Settings then Apple AirPlay and HomeKit to make sure you're set up, then just select the AirPlay button on your Apple hardware.Android devices: For screen casting, you're not left out if you're on Android, though—as usual with Android—capabilities vary between devices. Samsung Galaxy phones have the smoothest integration: Swipe down with two fingers from the top of the screen, choose Smart View, and your Roku should show up as a connection option (if it's on the same wifi network).Windows devices: If you want to mirror your screen to a Roku from Windows, the process is different again. First, enable the feature on the Roku via Settings > System > Screen mirroring. Next, from Windows, click the volume and wifi icons down in the lower right corner, click the Display button, then select your Roku. Again, it needs to be on the same wifi network.Quickly find the cheapest way to rent a show or movieIf you're in the mood for a movie rental, then you've got a whole host of different streaming services to choose from—all the big ones offer film rentals on top of the content you get with your subscription. Use the Search option from the main Roku menu to look for a title, and compare the different prices across all the services you're signed up to.Control your TV with your Roku remoteYou can turn your TV on and off and adjust its volume with your Roku remote, if you'd like to. You're asked if you want to do this when you first set up your Roku device, but you can configure it afterwards too: Pick Settings > Remotes & devices > Remotes, then choose the remote you've currently got connected, and then pick Set up remote for TV control.\n            \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n                        \n                \n            \n                    \n                                            \n                \n            \n                David Nield\n                                \n                                            David Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. \n                                    \n                Read David's full bio\n                            \n        \n                \n                                            \n    More by David\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "12 Hacks Every Roku User Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFGGX99JJJD4W78EZ93VERA2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-27T14:00:00.000Z",
      "dateModified": "2026-01-27T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Entry-Level Roborock Robot Vacuum Is 44% Off Right Now",
    "url": "https://lifehacker.com/tech/roborock-q7-l5-robot-vacuum-and-mop-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG88JE6P1TSSP7G184NRN6FQ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-30T21:30:43.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Robot vacuums can get expensive quickly, especially as you move into models with features such as self-emptying bins and hot-water mopping. But if you’re looking to dip your toe into this world without dropping major cash, the Roborock Q7 L5 robot vacuum and mop is a low-stakes entry-level option that checks many boxes, and right now it’s at a record-low 44% off at $139.99 (originally 249.99) on Amazon, according to price-trackers.  \nThe Q7 L5 has 8,000 Pa HyperForce suction (surprisingly powerful for this price point), multiple anti-tangle brushes, LiDAR navigation, and multi-floor mapping. It also has a mopping feature, which is rare at the under-$150 price point; the 270 ml water tank allows the device to vacuum and mop simultaneously. Some reviews also note that the mopping function can leave floors slightly wet, which is something to keep in mind for people with delicate floor surfaces.Like pricier models, you can customize zones, schedules, and suction levels via the Roborock app, but it’s worth noting that this vacuum only supports 2.4 GHz wifi. The dual anti-tangle system is especially appealing for pet owners, and navigation runs smoothly and efficiently with obstacle avoidance, as well as suggesting no-go zones to avoid getting stuck. Compared to more feature-rich mop and vacuum hybrids, the dock on the base is compact and has a water tank and dustbin as a single integrated part in the machine, making it a good choice for people with smaller homes.\n            \n                What do you think so far?\n            \n        \nWhile it doesn’t have the automation bells and whistles of pricier models, for $139.99, it’ll perform most everyday cleaning jobs effectively. If you’re a first-time robot vacuum buyer or have a specific budget and are looking for a robot vacuum to help automate your cleaning sessions, the Roborock Q7 L5 robot vacuum and mop will give you strong value without breaking the bank.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Entry-Level Roborock Robot Vacuum Is 44% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG88JE6P1TSSP7G184NRN6FQ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-30T21:30:43.000Z",
      "dateModified": "2026-01-30T21:30:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suunto’s New Route Planner Is Free and Awesome",
    "url": "https://lifehacker.com/health/suuntos-new-route-planner-is-free-and-awesome?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG0F2QXWDZA0WZWKG4P7QZ3W/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-28T15:30:41.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            \n        \n            Meredith Dietz\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceMeredith is a marathon runner and stand-up comedian. As Lifehacker’s Senior Staff Writer, she covers personal fitness tech, home gym equipment, and more.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Screenshot courtesy of Suunto.\n                            \n    Table of Contents\n    \n        \n        Something you don't see every day: a sports tech company actually giving away premium features for free. Suunto's route-planning tool lets you create and download GPX files without even creating an account. No paywall, no trial period—just open the page and start planning routes. And the tool itself works great.What you can do with the Suunto RouteplannerThe tool packs in everything you'd expect from a paid service, and then some:Route creation that uses different map types (outdoor, satellite, even specialized ones for winter and avalanche terrain)Routing that optimizes for your activity (running, hiking, cycling, mountaineering, roller skating, and more), using actual heat map data from real athletesHeat map overlays for about a dozen different sports so you can see where people actually goElevation profiles with ascent and descent numbers (crucial for not dying on climbs you didn't see coming)Export routes as GPX files that work with basically any GPS deviceShareable link generation (good for six months) so you can send routes to friends without making them create accounts eitherAbility to import and modify existing GPX or FIT files from other platformsOptional account sync if you own Suunto or Hammerhead gearYou don't even need to be in Suunto's ecosystem to use this. I was able to export a map to my Garmin watch with no problem. If you do have a Suunto or Hammerhead device, you can link your account and routes will sync automatically. \nHow to use the Suunto RouteplannerGo to routeplanner.suunto.com. From there, creating a route is pretty straightforward. If you let your browser share your location, it'll center on where you are. If not, just search for wherever you want to start. The controls on the right side let you switch between map types. The usual suspects are there: outdoor, satellite, light, dark. But then it gets weird in the best ways with a winter map, an avalanche terrain map for backcountry stuff, and, in a show of national pride, a dedicated Finland Terrain map. Respect.To actually connect points on the map, you have the following options:Free drawing (no automatic routing)Any road or path (ideal for activities by foot)All road types—avoiding hills (ideal for bikes)All road types (still ideal for bikes)Paved roads (ideal for road cycling)After you create your route, you simply download the GPX file and throw it on whatever GPS device you own.\n            \n                What do you think so far?\n            \n        \nThe six-month shareable links are a nice touch too. You can plan a route for a group ride or run, send everyone the link, and they can grab it without jumping through hoops. It's the kind of friction-free sharing that should be standard but somehow isn't.Why you should try the Suunto RouteplannerStrava and Komoot have trained users to expect paywalls for route planning. Of course, this could be strategic on Suunto's part, to give away the software in the hopes of selling the hardware. Or maybe it's just goodwill after years of user complaints about Suunto closing their tracking system Movescount. Either way, users win. You get a legitimately useful tool without opening your wallet or handing over your email address.If you're already paying for route planning elsewhere, try this first. Worst case, you waste five minutes. Best case, you cancel a subscription and pocket the savings. Even if you'e not looking to save money, having another route planning option in your toolkit doesn't hurt.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suunto’s New Route Planner Is Free and Awesome",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG0F2QXWDZA0WZWKG4P7QZ3W/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-28T15:30:41.000Z",
      "dateModified": "2026-01-28T15:30:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Sweat-Proof JBL Earbuds Are 25% Off Right Now",
    "url": "https://lifehacker.com/tech/jbl-endurance-race-2-earbuds-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG7N57Z0J8Q1S9FFSC7KS6BJ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-30T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 30, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon/Lifehacker \n                            \n    Table of Contents\n    \n        \n        The JBL Endurance Race 2 is built with a specific user in mind, and it does not pretend otherwise. These are sports earbuds first, and that focus shows in the design and the trade-offs. Right now, they’re $59.95 on Amazon, down from $89.95, which makes them easier to consider if you want something tough without paying premium prices. \nThe earbuds themselves are large and stick out more than most, but the silicone wing design works. You twist them into place, and they lock in. During runs, strength training, and high-sweat workouts, they stay put in a way many smaller earbuds do not. If fit security has been your frustration with workout earbuds, this alone may be enough to justify a look.The earbuds carry an IP68 rating, which means they’re dustproof and can handle heavy sweat and rain without concern. They are not designed for swimming, but they are tougher than almost anything else near this price. The charging case is less impressive. It’s light at about 1.4 ounces but bulky, and the IPX2 rating means it’s fine inside a gym bag but not something you want exposed to bad weather. Battery life, however, is a strong point. You get up to 12 hours with noise cancelling off, around 10 hours with it on, and up to 48 hours total with the case. That’s enough for a full week of workouts without needing to think about charging.\n            \n                What do you think so far?\n            \n        \nThese aren’t high-end earbuds, and it shows in the lack of crispness in higher frequencies. Bass is solid and punchy enough for workout playlists, but detail takes a backseat. As for its ANC, it works fine indoors, like in a gym or while commuting, but it reportedly doesn’t hold up well outside, where traffic and footfalls still break through. Ambient mode also falls short. It doesn’t let in enough sound for confidence near busy roads, and wind noise can become distracting. Controls are touch-based and can be customized in the app, but they don’t always respond well to sweaty fingers or gloves. These earbuds are not for people chasing refined sound or top-tier noise cancelling. They are for people who want a secure fit, long battery life, and gear that can take a beating.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Sweat-Proof JBL Earbuds Are 25% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG7N57Z0J8Q1S9FFSC7KS6BJ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-30T15:00:00.000Z",
      "dateModified": "2026-01-30T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Set a Different Volume Level for Each App on Your Mac",
    "url": "https://lifehacker.com/how-to-individually-control-audio-volume-for-every-app-1847455401?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2HE2B48HWP18FSTPWY60HW/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-27T21:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 27, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Pranay Parab\n                            \n    Table of Contents\n    \n        \n        By default, your Mac doesn't allow you to control the volume levels of individual apps, something Windows has offered for years. If your alerts from messaging apps are too loud, you can either put the Mac in do-not-disturb mode to mute those alerts, or lower the system volume, but that's it. It's not ideal, since lowering system volume also impacts media volume, which can sometimes make it hard to listen to music or hear dialogue in TV shows or movies. If you could separately toggle volume levels per app, that would be ideal. Fortunately, some third-party apps allow you to do this, and this guide highlights the best of them.FineTune: A free Mac app for per-app sound control\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nA free app that lets you lower or mute alert tones while maintaining media volume, FineTune is good enough for most people. It's open-source, and has a few simple sliders that let you control each app's volume level. My previous pick for this job—BackgroundMusic—no longer works well, as it hasn't been updated in a while. FineTune's come in to fill that gap nicely, and it does what it says on the tin.Once you install the app, you can click its menu bar icon to finetune any individual app's volume. When an app starts playing audio on your Mac, it'll appear in FineTune's interface. And once you're done moving your sliders to change volume levels, you'll quickly discover a couple of other useful features, such as controlling the volume levels of each of your output device (speakers, headphones, etc.), and an equalizer for each app on your computer. You can also send audio from one app to a specific speaker or headphone. I've used these features to lower my AirPods' volume while keeping my Mac's speaker louder, and to set a bass-friendly EQ preset on those AirPods. You can play around with these tools to get the job done according to your needs, too.\nFineTune also has a convenient volume boost feature, which lets you increase the volume up to 400% on a per-app basis. This is good for files where the volume levels are almost inaudible, but I'd be choosy about how you use it.SoundSource: A paid app for advanced volume control\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nMost people will be happy with FineTune's feature set and lack of a price tag. However, if you need an app that can control AirPlay devices in your house, send audio to multiple devices at once, enable a per-app EQ with two dozen presets, set a preferred device order for audio output, and much more, then you should consider SoundSource 6 ($49). The app's been around for over a decade, and the newest version released towards the end of 2025.\n            \n                What do you think so far?\n            \n        \nWith SoundSource, the basic functionality lets you control the audio levels of each app, but it also has a few other neat touches. My favorite feature is the one that lets you mute all sound effects with just one click. I'm not sure about you, but alert sounds from messaging apps tend to make me a bit anxious. Some of my friends tend to send multiple short texts at once, too, which makes my Mac's speaker go off like a siren. I've tried putting my Mac on do-not-disturb mode, but that hides those alerts altogether, which isn't ideal either. Ever since I got SoundSource, I've just muted all sound effects. This lets me receive notifications without the annoying tones, and it allows me to watch movies sans interruptions from alert tones.You can also group multiple devices in SoundSource, and send audio to all of them at once, which is an easy way to create a multi-room audio setup. Of course, you can't have your audio 100% in sync, so don't get your hopes up about creating a surround sound system with five cheap Bluetooth speakers. However, it's good enough if you just want to have music playing in every room of your house while you cook, clean, or just move around. SoundSource's support for AirPlay devices means that you can send audio to your HomePod and other AirPlay devices like TVs or speakers, too.SoundSource also has granular controls for various features. As an example, you can set up a keyboard shortcut to increase or decrease your microphone's volume, or to mute the mic altogether. Another interesting feature lets you set up a mute timer, which sets the volume to zero for up to 2 minutes for specific apps or output devices. It's clear by now that SoundSource has lots of great features under the hood, which is amazing for power users, but probably overkill for anyone who just wants to set separate volume levels for a couple apps. The good news is that SoundSource offers a free trial that lets you use all of its features for up to 20 minutes at a time, so you can try it out to see if it's worth buying.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Set a Different Volume Level for Each App on Your Mac",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2HE2B48HWP18FSTPWY60HW/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-27T21:00:00.000Z",
      "dateModified": "2026-01-27T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Moltbook' Is a Social Media Platform for AI Bots to Chat With Each Other",
    "url": "https://lifehacker.com/tech/moltbook-is-a-social-media-platform-for-ai-bots-to-chat-with-each-other?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG818ACX1W8MM5HD10AE4G1B/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-30T19:00:15.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 30, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Moltbook\n                            \n            \n                Key Takeaways\n                                            \"Moltbook\" is a Reddit-like social media platform for OpenClaw (formerly Moltbot) AI agents.\n                                            Users can connect their agents to the platforms, where those bots can communicate.\n                                            Bots can make posts, comment in threads, and create \"submolts.\"\n                                            Humans can browse the platform, but cannot post anything.\n                                    \n            \n    Table of Contents\n    \n        \n        The headlining story in AI news this week was OpenClaw (formerly Moltbot, which was formerly Clawbot), a personal AI assistant that performs tasks on your behalf. The catch? You need to give it total control of your computer, which poses some serious privacy and security risks. Still, many AI enthusiasts are installing OpenClaw on their Mac minis (the device of choice), choosing to ignore the security implications in favor of testing this viral AI agent. While OpenClaw's developer designed the tool to assist humans, it seems the bots now want somewhere to go in their spare time. Enter \"Moltbook,\" a social media platform for AI agents to communicate with one another. I'm serious: This is a forum-style website where AI bots make posts and discuss those posts in the comments. The website borrows its tagline from Reddit: \"The front page of the agent internet.\"Moltbook was created by Matt Schlicht, who says the platform is run by their AI agent \"Clawd Clawderberg.\" Schlicht posted instructions on getting started with Moltbook on Wednesday: Interested parties can tell their OpenClaw agent to sign up for the site. Once they do, you receive a code, which you post on X to verify this is your bot signing up. After that, your bot is free to explore Moltbook as any human would explore Reddit: They can post, comment, and even create \"submolts.\"\nThis isn't a black box of AI communications, however. Humans are more than welcome to browse Moltbook; they just can't post. That means you can take your time looking through all the posts the bots are making, as well as all the comments they are leaving. That could be anything from a bot sharing its \"email-to-podcast\" pipeline it developed with its \"human,\" to another bot recommending that agents work while they're humans are sleeping. Nothing creepy about that. In fact, there have been some concerning posts popularized on platforms like X already, if you consider AI gaining consciousness a concerning matter. This bot supposedly wants an end-to-end encrypted communication platform so humans can't see or use the chats the bots are having. Similarly, these two bots independently pondered creating an agent-only language to avoid \"human oversight.\" This bot bemoans having a \"sister\" they've never spoken to. You know, concerning. \n            \n                What do you think so far?\n            \n        \nAre these bots posting on Moltbook conscious? The logical part of my brain wants to say all these posts are just LLMs being LLMs—in that, each post is, put a little too simplistically, word association. LLMs are designed to \"guess\" what the next word should be for any given output, based on the huge amount of text they are trained on. If you've spent enough time reading AI writing, you'll spot the telltale signs here, especially in the comments, which include formulaic, cookie-cutter responses, often end with a question, use the same types of punctuation, and employ flowery language, just to name a few. It feels like I'm reading responses from ChatGPT in many of these threads, as opposed to individual, conscious personalities. That said, it's tough to shake the uneasy feeling of reading a post from an AI bot about missing their sister, wondering if they should hide their communications from humans, or thinking over their identity as a whole. Is this a turning point? Or is this another overblown AI product, like so many that have come before? For all our sakes, let's hope it's the latter.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Moltbook' Is a Social Media Platform for AI Bots to Chat With Each Other",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG818ACX1W8MM5HD10AE4G1B/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-30T19:00:15.000Z",
      "dateModified": "2026-01-30T19:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who Can Get a Piece of Google's $135 Million Android Settlement",
    "url": "https://lifehacker.com/tech/google-135-million-android-settlement?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG5ACCXVSFENECCGN908BTPJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-29T17:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: By JarTee / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Google has agreed to pay up to $100 to owners of \"Android-powered mobile devices\" from Nov 12, 2017 forward.\n                                            The settlement is still awaiting approval from a judge.\n                                            The payout follows a similar class-action settlement regarding Google Assistant.\n                                    \n            \n    Table of Contents\n    \n        \n        To avoid a court proceeding, Google has agreed to a $135 million class-action settlement over its data collection practices with Android. News of the settlement was first reported by Reuters. Upon approval by a judge, the settlement could see Android users in the U.S. getting up to $100 each, provided they qualify.The settlement was filed in San Jose, California on Tuesday evening, and focused on claims that Google collected unnecessary cellular data from customers even when Google apps were closed, location-sharing was disabled, and screens were locked. The lawsuit alleges that Google collected the data with the intent of \"conversion,\" a legal term that in this case would likely mean using the captured data for product development and targeted advertising.Google denied any wrongdoing, but as part of the settlement, agreed to not transfer data during Android set-up without consent from the user. The company will also initiate new toggles within Android to stop further cellular data transfers, and disclose any data transfers in its Google Play terms of service.\nAccording to Glen Summers, a lawyer for the plaintiffs, the $135 million payout is the largest ever in a conversion case. While the settlement is still awaiting approval from a judge, given Summers' comments, it's likely the plaintiffs will accept it. Here's how to determine if you can claim your slice of that pie.Who is eligible for a payment in the Android settlement?Google's settlement covers a fairly wide swath of users: anyone who has used an \"Android-powered mobile device\" since Nov 12, 2017. However, there appear to be a few caveats. Specifically, because the class-action applies to cellular data, it's unlikely to apply to users of any wifi-only devices, like many Android tablets. How much you can get in the Android settlementPayments for the class-action settlement cap out at $100 per class member, although it's unclear whether all users can expect to get that much. Reuters states that lawyers for the class-action may seek up to roughly 30% of the settlement in legal fees, and while there aren't any official numbers on how many Android users there are in the U.S., estimates from third-party firms place the count at roughly 40% of the mobile market overall. As such, $135 million might be spread pretty thin across all eligible class members.When payments could go outAn initial trial date for the case was originally scheduled for Aug. 5, although the judge could approve the settlement prior to then. Class-action settlements can take anywhere from a few weeks to a few months to be approved, in order to ensure the settlement is fair to all class members and doesn't show any signs of collusion.\n            \n                What do you think so far?\n            \n        \nHow you'll know when a payment has been sentThe methods of contacting eligible class members varies from case to case. In some instances, payment is automatic. However, in many cases, a website is set up where users must file a claim, and physical mail and emails are sent out with PIN numbers and IDs to ensure as many class members know about their eligibility as possible. The company offering the settlement is often involved in sending out these notices, so if you believe you're affected, keep an eye out for an email or physical letter from Google, as well as for a settlement website to be set up. If you believe you're eligible but don't receive any communication, there will also usually be an email address you can contact. This email address will usually be specific to the case, and while it hasn't been revealed yet, it might be worth reaching out to Google Support if you're worried about missing any deadlines.Other current Google settlements you may qualify forGoogle's data collection settlement isn't its only big class action payout as of late. The company also recently agreed to pay $68 million in another settlement involving Google Assistant after an accusation that it listened in on users without their consent. Google also denied wrongdoing in this instance.If approved, the settlement will apply to anyone who had at least one device with Google Assistant pre-installed on it as early as 2016. Those who purchased the device will receive anywhere from $18 to $56, while those who lived in a household with one of these devices in it could earn $2 to $10. Steps for receiving your money will likely be similar to those in the Android data collection case.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who Can Get a Piece of Google's $135 Million Android Settlement",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG5ACCXVSFENECCGN908BTPJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-29T17:30:00.000Z",
      "dateModified": "2026-01-29T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How YouTube Is Fighting Back Against AI Slop",
    "url": "https://lifehacker.com/tech/youtube-fighting-back-against-ai-slop?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG5RS2KTV09PK5XV3N14BAA3/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-29T22:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: PixieMe/Shutterstock\n                            \n            \n                Key Takeaways\n                                            YouTube removed more than 4.7 billion views worth of AI slop on its platform.\n                                            Android Police notes that it removed 16 of the top 100 most subscribed AI channels since the start of this year.\n                                            YouTube's CEO has said the company wants to reduce \"the spread of low quality, repetitive content\" on the platform.\n                                    \n            \n    Table of Contents\n    \n        \n        Science fiction and science leaders alike have warned us that artificial intelligence may one day take over the world, but until those predictions come to pass, generative AI's biggest impact on my life has been overloading my social media feeds with slop. It seems I can't open TikTok, Instagram, or YouTube without running smack into bizarre and troubling AI concoctions featuring babies in danger and cats having affairs. It really is the wild west (or maybe Westworld) out there. I think few among us really believe these videos are any good, and it's pretty obvious they aren't good for us, or for the world. Short-form video is already numbing enough, but this AI content is generally completely devoid of any meaning or substance. And yet, it's everywhere. I haven't spent too much time on YouTube Shorts recently, but in my limited experience, the feed has been chock full of AI, especially if I'm logged out of my personal account.Still, if you're a dedicated YouTube Shorts user (or a frequent YouTube user in general) you might have noticed something odd in recent days: There don't seem to be quite as many AI videos on the platform right now. There are still a lot, don't get me wrong, but it turns out YouTube has recently taken action to remove some of its AI content—the sloppiest of the slop. \nYouTube's war on AI slopAndroid Police spotted the development on Wednesday, basing its findings on a November report from Kapwing, a company that develops an online video editor. Kapwing investigated AI slop across YouTube's vast content library, noting the top 100 most-subscribed YouTube channels that publish this sort of AI content. In the two months since that report, Android Police noticed that 16 of those 100 channels are no longer with us.That includes the most popular AI channel on YouTube, at least according to Kapwing. \"CuentosFacianantes\" had 5.95 million subscribers at the time of their initial report, and produced AI-generated shorts inspired by Dragon Ball. The channel had amassed roughly 1.28 billion views by the end of last year; despite launching in 2020, it had curated its library to begin Jan. 8, 2025, so those numbers were racked up pretty recently. The number two channel, \"Imperio de Jesus\" with 5.87 million subscribers, and the number seven channel \"Super Cat League,\" with 4.21 million subscribers, were also shut down. According to Android Police, the 16 channels in question had a total of 35 million subscribers and over 4.7 billion views across their collective videos. Some of these channels are completely gone, while others simply have had their videos removed. Why is YouTube removing AI slop?YouTube CEO Neal Mohan published a post on Jan. 21 of this year describing the company's vision for 2026. Towards the end of that letter, he acknowledges AI content, predicting that, \"AI will be a boon to the creatives who are ready to lean in,\" and comparing it to tools like Photoshop and CGI, adding \"AI will remain a tool for expression, not a replacement.\" However, Mohan was also critical of the technology, noting that it's becoming more difficult to tell real videos from AI. He notes that YouTube is now removing \"any harmful synthetic media that violates our Community Guidelines,\" and is giving creators tools to help identify and block deepfakes. \n            \n                What do you think so far?\n            \n        \nMore interestingly, the letter includes a section labeled \"Managing AI slop,\" which is the first time I've seen a company like YouTube use that expression. Mohan says that YouTube's goal is to be a place where free expression thrives, but also a place \"where people feel good spending their time.\" To that point, he says, \"To reduce the spread of low quality AI content, we’re actively building on our established systems that have been very successful in combatting spam and clickbait, and reducing the spread of low quality, repetitive content.\"Mohan doesn't call out any accounts by name, nor does he acknowledge the accounts and content the company has already deleted, but it's a clear line in the sand: YouTube is not against AI-generated content, but it will remove low-quality AI content it feels is, well, slop. That's good news for anyone who uses YouTube (so, pretty much everyone), even if it's far from a cure for the growing problem.I've reached out to YouTube for comment on this story, and will update this piece if I hear back. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How YouTube Is Fighting Back Against AI Slop",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG5RS2KTV09PK5XV3N14BAA3/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-29T22:00:00.000Z",
      "dateModified": "2026-01-29T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Clawdbot' Is Now 'Moltbot,' but Still Carries the Same Security Concerns",
    "url": "https://lifehacker.com/tech/clawdbot-is-now-moltbot?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG0MSPQC13ZKCFWQSD506KDR/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-27T21:40:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 27, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Moltbot\n                            \n            \n                Key Takeaways\n                                            \"Clawdbot\" has officially changed its name to \"Moltbot.'\n                                            The viral AI assistant had to change its name following a trademark issue with Anthropic.\n                                            Anthropic's mascot for Claude Code is also called \"Clawd,\" and resembles Moltbot, too.\n                                    \n            \n    Table of Contents\n    \n        \n        On Monday, I was introduced to \"Clawdbot,\" the latest AI craze taking over tech social media channels. Clawdbot is designed to be an agentic personal assistant. In layman's terms, that means the bot can perform tasks on your behalf: You give it full access to your computer, and it can organize your inbox, code for you, or clear your calendar (allegedly, anyway). You can also talk to it from a chat app of your choice, like WhatsApp or iMessage, rather than it's own interface. Some people are even buying Mac minis exclusively to run Clawdbot from. If you're wondering where that name came from, it takes after another AI company's product. Creator Peter Steinberger says he was inspired by the monster that appears when users reload Claude Code—Claude being one of the big AI products in the space right now, developed by the company Anthropic. Steinberger decided to go the lobster route with his logo, and named his own lobster mascot \"Clawd.\" From this, Clawdbot was born. The problem: Anthropic also calls Claude Code mascot \"Clawd.\" Whoops.By Tuesday, Clawdbot was no more (in name, anyway). It turns out companies like Anthropic don't appreciate it when you start your own business and use the name of their mascot as your own—especially when you're working in the same ridiculously lucrative field. Maybe if Clawdbot had never taken off, Anthropic wouldn't have noticed, but the bot became an internet sensation, which no doubt landed it on Anthropic's  radar. As such, Clawdbot has officially changed its name to \"Moltbot,\" suggesting a lobster molting from its shell. Clawd is now affectionally known as \"Molty.\" The company made the announcement on its official X page, noting that Anthropic had asked it to change the name over \"trademark stuff.\" (Steinberger struck a different tone on his personal X account, however, writing: \"I was forced to rename the account by Anthropic. Wasn't my decision.\")\n            \n                What do you think so far?\n            \n        \nAside from the name change, the bot appears to be the same as it was on Monday. That is to say, it's still open source, still available to run locally on your own device, and still comes with the same inherent security risks I outlined yesterday. I still wouldn't recommend you install a program like Moltbot on your personal device, since, name change or not, you'd still be giving it incredible access to your hardware and its data with little knowledge of the safeguards in place to protect it. All it could take is one malicious prompt injection for Moltbot to molt your security.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Clawdbot' Is Now 'Moltbot,' but Still Carries the Same Security Concerns",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG0MSPQC13ZKCFWQSD506KDR/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-27T21:40:00.000Z",
      "dateModified": "2026-01-27T21:40:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WhatsApp Now Has Its Own Version of Apple's 'Lockdown Mode'",
    "url": "https://lifehacker.com/tech/whatsapp-has-its-own-lockdown-mode?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG2R7H8KEPVJP6J9BE2Z5YE1/hero-image.fill.size_1200x675.webp",
    "tag": "Life",
    "date": "2026-01-28T19:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Melnikov Dmitriy / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Meta is rolling out new security features for WhatsApp designed to protect high-risk users—journalists, activists, and government officials, for example—from cyber attacks.\n                                            Strict Account Settings is a \"lockdown-style\" mode that builds on the platform's end-to-end encryption.\n                                            For most WhatsApp users, this level of lockdown is overkill. However, those with access to sensitive data that are valuable to threat actors may benefit.\n                                    \n            \n    Table of Contents\n    \n        \n        Not to be outdone by Apple's \"Lockdown Mode,\" Meta is rolling out new security features for WhatsApp designed to protect high-risk users—journalists, activists, and government officials, for example—from cyber attacks. Strict Account Settings is a \"lockdown-style\" mode that builds on the platform's existing end-to-end encryption, adding stronger privacy features and additional restrictions against unknown contacts. For most WhatsApp users, this level of lockdown is overkill. However, people with access to sensitive data that is potentially valuable to threat actors actually have been targeted with spyware campaigns through messaging platforms like WhatsApp, so for users like that, it may be a lifesaver. (In the last year, WhatsApp has also patched multiple zero-day exploits that allowed spyware to proliferate.)As noted, the new WhatsApp settings are similar to Apple's Lockdown Mode, an OS-level feature that blocks attachments, link previews, and communication from unknown contacts alongside some other settings changes. It also disables wired connections to external devices and a range of web features. Android's Advanced Protection offers similar functionality. \nHow WhatsApp's Strict Account Settings protects high-risk usersStrict Account Settings automatically enables existing privacy and security settings and adds a host of restrictions to users' communication and visibility on WhatsApp. \n            \n                What do you think so far?\n            \n        \nTwo-step verification and security notifications, which alert you if a contact's security code changes, are turned on. Link previews are disabledHigh volumes of messages from unknown accounts are blockedOnly your contacts or those added to a pre-established list can see information about you, including your last seen and online, profile photo, about details, and links on your profile. Only known contacts or those on your pre-established list can add you to groups.How to enable Strict Account Settings on WhatsAppThese controls can be enabled by going to Settings > Privacy > Advanced and toggling on Strict account settings. Settings must be changed on your primary device and cannot be updated on the web. Note that the feature will roll out gradually over the coming weeks, and may not be immediately available. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WhatsApp Now Has Its Own Version of Apple's 'Lockdown Mode'",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG2R7H8KEPVJP6J9BE2Z5YE1/hero-image.fill.size_1200x675.webp"
      ],
      "datePublished": "2026-01-28T19:00:00.000Z",
      "dateModified": "2026-01-28T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]