[
  {
    "title": "The Google Play Store Is Making It Easy to Remotely Uninstall Apps From Your Other Android Devices",
    "url": "https://lifehacker.com/tech/google-play-remotely-uninstall-apps?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9ZDXFS11JMBTJ8JVRW4GY7E/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-13T22:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Google Play Store Is Making It Easy to Remotely Uninstall Apps From Your Other Android Devices",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9ZDXFS11JMBTJ8JVRW4GY7E/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-13T22:00:00.000Z",
      "dateModified": "2025-11-13T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This App Makes It Easy for Androids and Macs to Talk to Each Other",
    "url": "https://lifehacker.com/tech/airsync-app-mac-and-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9WSR67Y6EC2X1R3K54WVF30/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-13T14:30:00.000Z",
    "description": "\n        \n        I'm a former Android-Mac hybrid user. Laugh all you want—we exist.I enjoy having a polished operating system on my computer and an e",
    "body": "\n        \n        I'm a former Android-Mac hybrid user. Laugh all you want—we exist.I enjoy having a polished operating system on my computer and an endlessly hackable operating system on my phone, and the combination of Mac and Android gave me all of that. I only stopped using Android alongside my Mac a couple years ago, mostly because an iPhone SE was cheaper than most mid-range Android options at the time.When I think about switching back, though, I realize how much I'll miss the integrations. Using a Mac and an iPhone gives you access to all kinds of tricks. Among the ones I use the most are the shared notifications, the syncing clipboard, and the easy ways to sync files. There's also the ability to control your iPhone from your Mac. Android users can't do any of this on a Mac.\nThat's where AirSync comes in. The open source application, built by Sri Lanka based developer Sameera Sandakelum, integrates Android devices with macOS in all kinds of ways. Android notifications show up on your Mac. You can sync your clipboard. It's also easy to send files from Android to the Downloads folder on your Mac, or vice versa. And with a little bit of setup, you can even take control of your Android device from the comfort of your Mac.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nGetting started is straightforward. You need to download the app for Android and macOS and install them. You will be prompted on both devices to enable certain permissions, after which you can connect your devices to each other by scanning a QR code. (It's worth noting that you can only connect devices that are on the same wifi network.)After that, you should start seeing Android notifications on your Mac—they'll show up in the native Mac notifications, or you can review existing ones in the app itself. You can even trigger buttons, allowing you to do things like respond to text messages from the notifications on your Mac. Items copied on your clipboard on one device will sync to the other. And you will see controls for the media currently playing on your Mac on the lock screen of your Android device.It has lot of nice touches, and you can go a bit further by paying for AirSync+, which costs either $2.49/month or $50 one time. This paid version of the application lets you take control of your Android device, similar to iPhone Mirroring. I tried this feature out and enjoyed it, though you can set this up yourself using Scrcpy for free.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nOther features in the paid version include controlling your Android's music from your Mac, opening websites open on one device from another, and custom app icons.Even without these paid features, though, Airsync makes it a little bit easier to be a Mac/Android person. Not missing notifications, easier file sharing, and clipboard syncing are all big quality of life improvements, so check this app out if you're tired of macOS and Android not playing nicely together.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This App Makes It Easy for Androids and Macs to Talk to Each Other",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9WSR67Y6EC2X1R3K54WVF30/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-13T14:30:00.000Z",
      "dateModified": "2025-11-13T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Windows 11 Users Will Get a Major Start Menu Redesign This Week",
    "url": "https://lifehacker.com/tech/windows-11-users-will-get-a-major-start-menu-redesign-this-week?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9QA2127FBQPGRWB62MZ23GD/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-10T18:00:30.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Windows 11 Users Will Get a Major Start Menu Redesign This Week",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9QA2127FBQPGRWB62MZ23GD/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-10T18:00:30.000Z",
      "dateModified": "2025-11-10T18:00:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Maps' New Power Saving Mode Only Works on One Type of Phone, and That Stinks",
    "url": "https://lifehacker.com/tech/google-map-power-saving-mode-pixel-10?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9WB0DN3CWSZCC5N9JF6FT4W/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-12T16:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Unless you have a Pixel 10, you're not getting the feature—yet.\n    \n        \n    \n                                        \n        \n        \n        November 12, 2025\n    \n            Credit: Matthew Nichols1/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is rolling out a new Power Saving Mode to Google Maps, but only for the Pixel 10.\n                                            Pixel 10 users can enable the feature when in driving mode, which simplifies the UI to save up to four hours of battery life.\n                                            The feature is likely powered by Android's upcoming AOD Min Mode, which is currently in development.\n                                            It's possible Google will roll out Power Saving Mode to more devices in the future, but nothing is certain at this time.\n                                    \n            \n    Table of Contents\n    \n        \n        If you have a Pixel phone, there's good news, and bad news. The good news? Google is releasing a handful of new features for your device, via its November Pixel Drop. And among the new changes, like Google Photos' Nano Banana upgrade, is something genuinely useful: a new power saving mode for Google Maps. The bad news? Your Pixel probably doesn't support it. According to Google, the new Power Saving Mode is simple to use. Whenever you want to spare your battery some excess power consumption while using driving directions in Google Maps, you can tap a new power button in the app. Once you do, Google Maps will shift into a \"simplified layout\": From Google's press release image, this turns the map black and white, with no discernible elements other than the road, your driving arrow, ETA, and upcoming turns. The feature currently only works with driving directions, so you won't see the option for walking or biking directions, nor can you use it in landscape.\n    \n            \n            \n                                        Credit: Google\n                    \n    \nGoogle says this new layout can save your Pixel's battery life for up to four hours—though that depends on a number of factors, including the assumption that your phone is charged to 100% at the start, and that brightness is set at P90 and Adaptive Brightness is disabled. But if that's true, it could be huge: If you're on a road trip without power, that can keep your phone going much longer. You could either eke out another four hours of navigation time in the car, or actually have some battery to spare when you reach your destination.  \n        \n            You May Also Like\n        \n    \nWhy is this a Pixel 10 exclusive?But before all the Pixel owners of the world get too excited, the feature comes with disappointing fine print. Only Pixel 10 devices—meaning Pixel 10, Pixel 10 Pro, Pixel 10 Pro XL, and Pixel 10 Pro Fold—can use Power Saving Mode in Google Maps. Google: What gives?Google doesn't actually offer any explanation as to why Power Saving Mode is exclusive to its newest line of Pixels. As Android Central notes, the feature likely takes advantage of Android's upcoming AOD Min Mode, which lets apps use the device's Always-on Display to save power while running visually simplistic versions of their programs. AOD Min Mode isn't widely available to developers yet, and will likely arrive with Android 17, but it doesn't seem exclusive to Pixel 10—or Pixel, for that matter. Most Android phones these days have Always-on Displays, so AOD Min Mode should theoretically work with them—not just phones released this year.\n            \n                What do you think so far?\n            \n        \nIf I had to guess, Google won't keep this feature locked to the Pixel 10 line forever. The company is probably using this limited rollout as an opportunity to test out AOD Min Mode with a smaller pool of users. Since the Pixel 10 series is the company's newest set of devices, it'd be a prime candidate for a test. The company could then take the feedback and analytics from this beta, and use it to help developers better optimize their apps for this experience. Perhaps then, Google would expand support to more Pixel devices, or more Android devices in general. For now, however, only Pixel 10 users can try out Power Saving Mode in Google Maps. I don't have one of these newest Pixels, but if I did, I wouldn't be surprised if I just kept this mode on all the time. Frankly, it looks cool, and if it saves me battery at the same time, all the better.Google seems to be making battery life savings a priority. Starting next year, the company will start dinging apps that excessively wake the display, either by removing those apps from Play Store discovery pages, or by issuing a warning to users on the app's Play Store page itself.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Maps' New Power Saving Mode Only Works on One Type of Phone, and That Stinks",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9WB0DN3CWSZCC5N9JF6FT4W/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-12T16:30:00.000Z",
      "dateModified": "2025-11-12T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Spot a Paid Survey Scam",
    "url": "https://lifehacker.com/money/how-to-spot-a-paid-survey-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9WD2F0Y0K0XJWX1RSAJPXV3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-12T19:00:55.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Spot a Paid Survey Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9WD2F0Y0K0XJWX1RSAJPXV3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-12T19:00:55.000Z",
      "dateModified": "2025-11-12T19:00:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What People Are Getting Wrong This Week: Kim Kardashian Debunks Psychics",
    "url": "https://lifehacker.com/entertainment/kim-kardashian-debunks-psychics?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9TCCYXG80EQYAYJ9DEBN94T/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-11T22:30:51.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What People Are Getting Wrong This Week: Kim Kardashian Debunks Psychics",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9TCCYXG80EQYAYJ9DEBN94T/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-11T22:30:51.000Z",
      "dateModified": "2025-11-11T22:30:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Your Older Peloton Bike+ Seat Has Been Recalled",
    "url": "https://lifehacker.com/health/peloton-is-recalling-and-replacing-original-bike-plus-seats?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9FWCV2FEYA42G4AGNZ6BTC0/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-07T20:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Your Older Peloton Bike+ Seat Has Been Recalled",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9FWCV2FEYA42G4AGNZ6BTC0/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-07T20:30:00.000Z",
      "dateModified": "2025-11-07T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "All the New AI Features Coming Soon to Google Photos",
    "url": "https://lifehacker.com/tech/google-photos-is-rolling-out-new-ai-features-today?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9STERVG1DR6KMHKBE6K3XD3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-11T17:00:08.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                  ",
    "body": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Top 10 Tech Sales This Week\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Nano Banana is now available in the app.\n    \n        \n    \n                                        \n        \n        \n        November 11, 2025\n    \n            Credit: Google\n                            \n            \n                Key Takeaways\n                                            On Tuesday, Google announced a handful of new features coming soon to Google Photos.\n                                            That includes Nano Banana, the company's AI image editing model, along with additional natural language editing options.\n                                            You'll now also be able to ask the AI to make personalized edits, like requesting that one subject's eyes be open, or another to be smiling.\n                                    \n            \n    Table of Contents\n    \n        \n        Most of our apps these days continue to receive AI upgrades—whether or not we actually want them. That's no surprise from a company like Google, who is among those leading the AI charge right now. If you use Chrome, Android, or Google Workspace, you've likely dealt with Gemini in some capacity. The charge, as you might expect, continues to this day. On Tuesday, Google announced a set of new AI-powered features coming to Google Photos, for both iOS and Android users. Google doesn't yet have a definitive release date for these new features, but it seems they're rolling out soon. These are largely optional—you can keep using Photos as an image library, and avoid using the AI features if you wish. But if you have an interest, especially in AI image editing, here's what you can expect to see: Nano BananaNano Banana is Google's current \"big thing\" in AI imaging. The model allows you to generate or edit images with greater flexibility than previous models—specifically, you can use it to change a single photo in multiple ways, while keeping the subjects consistent across edits. You can ask Nano Banana to change hairdos, outfits, sceneries, image styles, add or remove elements, stack edits, and even combine different attributes of multiple photos. If you take Google's word for it, it's a big deal. \n        \n            You May Also Like\n        \n    \nNow, Google is making Nano Banana available in Google Photos' editor. You'll find the tool under the new \"Help me edit\" button when opening a photo in the app. Here, you'll be able to ask the app to make whatever changes you'd like. Google suggests prompts like turning you into the monarch on a deck of cards; transforming a picture into a tiled mosaic; or adding a winter theme to an image to make your family's holiday card. \n    \n            \n            \n                                        Credit: Google\n                    \n    \nWe will need to investigate whether Google Photos' Nano Banana editor stack up to the tool you've been able to use in Gemini. But the option is now there, should you choose to use it. Personalized editsWhat is a photo? You might think that's a simple one to answer: You point your camera at some, snap away, and boom: A picture is born. But companies like Google are changing the ways we take and edit photos, to the point where that question isn't so easy to answer. If you adjust the image itself to such a degree that much of the original data is no longer there, is that really a photo? Did that really capture reality? I'm not so sure. That's how I'm feeling about Google's new \"personalized edits\" for Google Photos. The company says you can fix \"minor flaws,\" such as blinks or sad faces, with the new \"Help me edit\" tool. If your kid had their eyes closed during the picture, for example, you can ask \"Help me edit\" to open their eyes. Google Photos then pulls data from other photos with your kid to generate a version of the photo with their eyes open. Again, I ask you: What is a photo?Google has used this tech before: Best Take, for example, can snap a series of photos at once, then use the best version of each subject's face to composite the \"best take.\" It's clever, but it's also strange, especially when the data is not pulled from a different version of the same scene, but from different images of that person from the past. \n            \n                What do you think so far?\n            \n        \nGoogle Photos for iPhone catches up to AndroidGoogle is also rolling out new previously Android-only features for iPhone users with the Google Photos app. First, the iOS app now support \"ask to edit,\" a feature that lets you use text or your voice to request edits from Google's AI. Now, of course, both apps use Nano Banana, but previously, only Android's app supported this natural language editing system. In addition, iPhone users will notice a redesigned photo editor. This is the same one Google announced back in May for Android users. The new editor includes edit suggestions (powered by AI, of course) that apply multiple effects at once to your photos. You can also tap on an area of your photo to receive suggested tools for making edits. Ask about your photosI feel like I'm saying \"ask\" a lot in this article, but that's the crux of Google's new features here. To wit, the last new feature Google announced for Photos is simply the ability to ask about the images themselves. You can ask about the content of the picture, request similar images in your library, or, if you want, ask for edits. It seems Nano Banana follows you around in multiple places in this update.Again, none of these new AI features are mandatory if you want to keep using Google Photos AI-free. You can still edit your images yourself; you'll just need to avoid the \"Help me edit\" button. You can look at your photo's metadata manually, instead of using the Ask button. But it does seem, for the foreseeable future, like Google is all-in on these AI features. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All the New AI Features Coming Soon to Google Photos",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9STERVG1DR6KMHKBE6K3XD3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-11T17:00:08.000Z",
      "dateModified": "2025-11-11T17:00:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chrome's New 'Split View' Is Now My Favorite Way to Use the Internet",
    "url": "https://lifehacker.com/tech/google-chromes-new-split-view?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9SE4KA3PZRN21EMFZ90D1S6/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-11T14:30:00.000Z",
    "description": "\n        \n        Having previously been tested as an experimental flag, Google Chrome's Split View feature is now rolling out in the stable version o",
    "body": "\n        \n        Having previously been tested as an experimental flag, Google Chrome's Split View feature is now rolling out in the stable version of the browser (version 142). It doesn't seem to be live for everyone at the same time, but some people are seeing it. (I've got it in Chrome on my Mac, but not yet on Windows.) To check you're on the latest version of Chrome, click the three dots (top right) in a browser tab, then choose Settings and About Chrome. If an update is available, it'll be downloaded, and you can restart your browser to apply it.If you're running the latest version of Chrome and still don't see Split View, you can either wait for the feature to reach you or switch the flag on. Type \"chrome://flags/#side-by-side\" into your browser address bar and hit Enter, then enable the feature and restart your browser. You should then have Split View.\nIt works exactly as you might guess from the name: Split View enables you to have two sites or apps open in the same tab, so you can, for example, dive deep into a Lifehacker article while also keeping an eye on social media. It works much better than just having two Chrome windows up side-by-side in Windows or macOS.How to create a Split ViewThere are a couple of ways to create a Split View. One is to right-click on a tab header and then choose Add tab to new split view from the menu that pops up: The selected tab takes up one half of the Chrome window, and in the other half you can choose another open tab (if there aren't any other open tabs, you'll see the New Tab page).The other method is to click and drag an open tab (using its header), or a web link, to the far left or far right of another tab—you should then see a small space open, with a Create split view label. Getting the dragging and positioning right can take a bit of practice, but once you get the hang of it, it's pretty straightforward.\n    \n            \n            Look for a new Split View feature in Chrome.\n                                        Credit: Lifehacker\n                    \n    \nAfter that, the split tab works more or less like any other normal tab. You can drag it into a different position or into a different window, and you can right-click on it to access the tab options (for muting or pinning, for example). The split view tab will have two small \"x\" icons on it, for closing either half of the tab separately—to close them both, right-click on the tab and choose Close.Whenever you're in a split tab, you'll see a new icon on the Chrome toolbar, which you can click to access related features: You can separate the two views, close the left or the right view, or swap the views over from this toolbar button. The same options are available if you right-click on the Split View tab header.How you can use Split ViewSplit view can help any time you need two webpages or web apps on screen at once. One of Google's own suggestions is keeping a document open while you're on a video call, so you can make notes more easily.It's going to work well for any kind of research or note-taking where you're looking something up and then having to write about it. It may also be less than ideal for our attention spans, because you can load up a video on one half of your Split View, and then scroll through social media on the other half.\n    \n            \n            Two sites open in Split View.\n                                        Credit: Lifehacker\n                    \n    \nYou can adjust the sizes of each pane by dragging the divider in the middle, though you are limited overall by the size of the Chrome window. You're also able to switch to different websites within a Split View by typing into the address bar as normal—just make sure you've selected the right half of the pane first.The same sort of effect has long been possible in Windows and macOS by snapping two Chrome windows to each side of the screen, but there's something more convenient and straightforward about having two pages up in the same tab. I can see this being something I make use of a lot, especially on an ultrawide monitor.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chrome's New 'Split View' Is Now My Favorite Way to Use the Internet",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9SE4KA3PZRN21EMFZ90D1S6/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-11T14:30:00.000Z",
      "dateModified": "2025-11-11T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Add Your Passport to Your iPhone",
    "url": "https://lifehacker.com/tech/you-can-now-add-your-passport-to-your-iphone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9WQQ9Y5AYNX2DW1KP53ME0A/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-12T22:30:28.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Don't expect to travel to another country with it, though.\n    \n        \n    \n                                        \n        \n        \n        November 12, 2025\n                    \n            Credit: Apple\n                            \n            \n                Key Takeaways\n                                            Apple announced \"Digital ID\" on Wednesday, a new feature that lets you add your passport to your iPhone's Wallet app.\n                                            The applications are limited, but you can use your Digital ID at over 250 TSA checkpoints starting today.\n                                            Apple says all ID data is encrypted and stored on-device, so only you have access to it.\n                                    \n            \n    Table of Contents\n    \n        \n        Back in 2021, Apple announced a new feature for the Wallet app, that allowed users to add their driver's licenses or state IDs to their iPhones. To me, it sounded like the beginning of the end for physical wallets. In reality, it was anything but: Not only are the applications limited, but even after all this time, only 12 states and Puerto Rico actually support the feature. While the rest of us wait for our respective states to get on board, many might have another option for these virtual documents. On Wednesday, Apple announced \"Digital ID,\" a new initiative that lets you create an ID in the Wallet app using your passport. This bypasses the waiting period for the 38 states that don't yet support these ID features: If you have a passport, you can try this feature out today. Even if your state supports driver's license and state ID uploads to the Wallet app, you'll miss out on features if you don't have a REAL ID. If you have a passport, however, you can use it instead, which opens up the wallet ID feature to even more users than before. Like previous attempts at virtual IDs, however, don't expect to be able to use this Digital ID just anywhere you'd normally show documentation. Right now, the main use for Digital ID is for flying: According to Apple, Digital ID is launching in beta at over 250 airports to be used at TSA checkpoints. Importantly, this feature only supports domestic flights, even though it uses your passport. As such, do not rely on your Digital ID when flying outside of the U.S. You'll still need your physical passport in order to validate your identity. In the future, however, Apple says you'll be able to use this Digital ID for other purposes, such as booking flights and hotels, as well as opening new accounts.  \n        \n            You May Also Like\n        \n    \nHow to add your passport to your iPhoneTo start, you'll need a valid U.S. passport, an iPhone 11 or later with iOS 26.1 or later, or an Apple Watch Series 6 or later with WatchOS 26.1. First, open the Wallet app on your iPhone, then tap the (+) at the top of the screen. Here, tap \"Digital ID\" under \"United States.\" Here, you'll see a pop-up which informs you about Digital ID. Tap \"Continue,\" then follow the on-screen instructions to scan different parts of your passport using your iPhone's camera. You'll next need to authenticate yourself by taking a Live Photo of your face. Once confirmed, you'll need to capture more angles of your face and head, which the Wallet app directs you through. Once validated, the ID will live in your Wallet app. You can open the Wallet app, or double-click the Side or Home button, then choose the ID whenever you need to present it. When in line at the TSA, for example, you can hold your iPhone with your ID activated near the reader: Once the two connect, the reader will take your photo, while your iPhone will show you all the information you'll be providing to TSA, which can include things like your legal name, date of birth, sex, nationality, ID number, ID photo, expiration date, the date the ID was added, and who verified the ID. You'll need to double-click the Side or Home button to confirm you want to share this data.\n    \n            \n            \n                                        Credit: Apple\n                    \n    \nIs Digital ID secure?Yes, at least according to Apple. The company says that any ID data you add to the Wallet app, be it a passport, driver's license, or state ID, is encrypted and stored on-device. That means that only you have access to this data—not even Apple can see it. In addition, Apple cannot see when you use your ID, nor can they see what data you shared at the time of identification. You also need to use Face ID or Touch ID to authenticate yourself through this process, so even if someone steals your iPhone, they won't be able to obtain that ID data. As stated above, you will see a list of data that will be shared when authenticating with Digital ID. If you aren't comfortable sharing this data with, say, TSA, you don't have to double-click the Side or Home button, and can instead choose another form of authentication. Plus, the way this feature is set up, you don't need to unlock your iPhone or physically hand it over to confirm your iPhone. By double-clicking the Side button or Home button, you can access the ID data without compromising your iPhone. I'm pretty privacy conscious, but this is a feature I'd be willing to try—assuming I fly out of an airport that supports it. I could see how this might be a bridge too far for some people, especially considering the amount of face scanning you need to do to validate the ID. But Apple says in its Wallet app that this data is used to validate your identity and prevent fraud, and is retained only until the issuing authority approves or denies your ID. In other words, whether or not setup is successful, Apple will delete your face scans once the process is over. Seeing as the rest of the data is encrypted, that might just be enough for me to be comfortable testing this out. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Add Your Passport to Your iPhone",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9WQQ9Y5AYNX2DW1KP53ME0A/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-12T22:30:28.000Z",
      "dateModified": "2025-11-12T22:30:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Can Now Robocall Stores for You to Ask If They Have What You Want",
    "url": "https://lifehacker.com/tech/google-ai-robocall-stores-product-availability?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9Z8NF0ADC0C7QZ1XAW72CY8/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-13T21:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Can Now Robocall Stores for You to Ask If They Have What You Want",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9Z8NF0ADC0C7QZ1XAW72CY8/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-13T21:30:00.000Z",
      "dateModified": "2025-11-13T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google's AI Shopping Push Is Better for Business Than It Is for You",
    "url": "https://lifehacker.com/tech/new-google-ai-shopping-features?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9ZHBTN2E5NDBA24VSQTFEBZ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-13T23:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                  ",
    "body": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Top 10 Tech Sales This Week\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Please, make it stop.\n    \n        \n    \n                                        \n        \n        \n        November 13, 2025\n    \n            Credit: Michelle Ehrhardt\n                            \n    Table of Contents\n    \n        \n        Today, Google announced three new AI shopping features, all centered around keeping you engaged with its AI throughout the entire shopping process. On the one hand, these features have the potential to make shopping more convenient—on the other hand, maybe lowering friction isn't the best idea when it comes to spending money. Beyond selling you on convenience, these features all share something else in common—helping businesses up their clickthrough rates.It starts with AI Mode and Gemini, which can now access all the same information as Google Search's shopping tab. That means you'll start to see product cards alongside your AI answers, which you can click on for a bunch of shopping links, or hit a checkmark to compare the selected products. They won't show up on every question, but on about half of the prompts I tried, I got the option to spend money right away.Then, if you're still not sure you want to buy yet, now you can have Google's AI robocall local businesses for you to check on product availability and pricing, as well as any deals or bundles you might not know about. There are a few caveats—businesses can opt out, and Google will avoid calling them at odd hours or too frequently—but the idea is that if you're on the fence, you can have an AI help you know which stores to go to.\n        \n            You May Also Like\n        \n    \nFinally, when it comes time to actually purchase whatever you're shopping for, you can have Google's AI check out for you. This feature is an extension of the existing price tracking feature, and will add a \"Buy for me\" button to any price tracking notifications you get from certain participating stores, like Wayfair, Chewy, Quince, or certain Shopify merchants. You'll get a link to the product you'd be buying from your notification, and the price will be pulled from that, so the company says you won't have to worry about the AI getting the price wrong. Instead, it's just supposed to remove any hesitation you might feel from having to enter your shipping or payment details into a checkout form.I won't deny that, when holiday shopping, I usually won't turn down assistance. But a continued refrain I had while hearing about these new features was \"Why?\"Personally, I'm mortified at the idea of sending employees at local businesses robocalls to deal with. And if I'm researching products, while it might be helpful to be able to involve an AI so I could ask specific question, I think I'd still prefer full access to all the filters and hundreds of links available in Google Shopping. The big thing for me, though, is agentic checkout. While I'm actually willing to trust Google that it won't make mistakes (and you do get a reference ID to hand to support in case it does), I'm also not sure why I'd want to go right from getting a price drop notification to having an AI spend money for me. It doesn't take long to fill out a checkout form, and while Google Shopping is a useful price tracking tool, it's not the only one around. I'd probably want to comparison shop a bit more before committing, at which point I might as well fill out the checkout form myself. But if you think about these features from the perspective of a business, the \"why\" behind all of this suddenly becomes a lot clearer. Turning people browsing web listings into actual paying customers has been a problem for about as long as the internet has existed, and all of these features introduce new opportunities for impulse purchases at every step of the buying process, while also erasing the opportunity for users to get caught up on a larger selection of options.\n            \n                What do you think so far?\n            \n        \nIt's not a conspiracy. Google charges companies for sponsored slots and ads, and the more people that buy products using a Google service, the more companies will want to pay for those. And for what it's worth, Lifehacker makes money on affiliate links. I won't deny that companies needs money, and that people need to buy gifts.What this does do, however, is reduce the friction that might pop up in between having an idle thought to buy something, and opening your wallet. While it plays at being a research buddy, it takes control out of your hands, obfuscates sources and other options, and instead encourages you to spend your money as quickly as possible, while discouraging skepticism.As someone who writes reviews and best-of lists, I like to think that my readers are a bit more savvy than that. Convenience is great, but taking the extra few minutes it takes to find an actual human opinion from someone who's used the product, or to double check that the price Google is serving you is really your best option, could save you from hours of pain down the line.Like most AI tools, there's potential here. But as much as AI will try to convince you that it's just some neutral buddy, remember that there are business motivations behind everything the companies behind these chatbots do. Keeping your whole shopping search in the same ecosystem as a company that's main profit still comes from ads and e-commerce probably isn't the best way to get your information.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google's AI Shopping Push Is Better for Business Than It Is for You",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9ZHBTN2E5NDBA24VSQTFEBZ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-13T23:00:00.000Z",
      "dateModified": "2025-11-13T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Try This Free Plex Alternative Client If You Hate the New Interface",
    "url": "https://lifehacker.com/tech/best-free-alternative-plex-client?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9FZPE8Y0DA878NT4T1VEJKP/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-10T13:00:03.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Try This Free Plex Alternative Client If You Hate the New Interface",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9FZPE8Y0DA878NT4T1VEJKP/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-10T13:00:03.000Z",
      "dateModified": "2025-11-10T13:00:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why I Use 'Albums' Instead of the Official Apple Music Mac App",
    "url": "https://lifehacker.com/tech/why-i-use-albums-instead-of-the-official-apple-music-mac-app?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9QASAWB14S3SP4RYAH4CQ7H/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-10T18:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                  ",
    "body": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Top 10 Tech Sales This Week\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Albums for Mac is a great Apple Music alternative.\n    \n        \n    \n                                        \n        \n        \n        November 10, 2025\n    \n            Credit: Pranay Parab\n                            \n    Table of Contents\n    \n        \n        Apple Music's selection is exceptional, but I've never enjoyed using its Mac app much. It's slow, buggy, and lacks the razor sharp focus on albums that I sometimes desire.On my iPhone, I often turn to the excellent Albums app to scratch that itch, which is why I'm excited to say that the same app has recently arrived on the Mac as well. I'm always looking for excuses to avoid opening the Music app on the Mac, and Albums has arrived at exactly the right time for me to make the switch. While I do enjoy listening to individual songs or playlists, I am going through an albums phase right now. For this, the Albums app is perfect. Its sole focus is on playing whole albums from your Apple Music library, rather than mixing and matching songs for you. It goes without saying that this app requires an active Apple Music subscription, but I far prefer it to the official Music app.Play whole albums from Apple Music\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nAlbums is available as a free download from the Mac App Store, but it does have a premium tier that unlocks some of its best features. On the free tier, you can search for and listen to albums. When you open the app, it shows a randomized grid containing all the albums in your Apple Music library. You can click any album to start playing it, and you can also queue other albums to play after the current one ends.\n        \n            You May Also Like\n        \n    \nAlbums Premium is available either as a subscription ($2/month or $19/year) or a one-time purchase ($90). If you join the premium tier, you get access to a whole bunch of power user features, such as listening stats, a release feed that tracks upcoming albums from artists in your library, and an \"Insights\" section for you to find curated lists of music albums you've listened to before. You only need to subscribe or purchase the app on one device to unlock it on your iPhone, iPad, and Mac.Stats and insights in Albums for Mac\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nThe Albums app's Insights section is a fascinating way to discover music. It gives you the choice to enter your date of birth and generates a full list of collections based on that. Some examples of these collections include \"High School,\" \"Late Teens/Early 20s,\" \"My 30s,\" and so on. If you open any of these collections, it shows you albums (from your Apple Music library) that were released during that stage of your life, which is a great way to take a walk down memory lane.Most collections in the Insights section don't require your personal information, though. Albums will also look at your Apple Music data, and create useful collections such as \"Only Listened Once,\" \"Never Played,\" etc. I also like the \"Today In History\" section here, which highlights albums released on the day you're listening on, but in previous years. Once you open a collection, you can either choose an album you want to play, or use the shuffle option to automatically queue other albums after the current one finishes playing. This is also a nice way to stick to the app's core principle of focusing on whole albums, while still including a \"shuffle\" feature. The Albums Premium tier also lets you create custom collections. You can create a collection of albums by a specific artist, music from a particular decade, or even albums of a particular runtime. For instance, if you're only in the mood for short albums, you can use the app's collection filters to group all albums under 15 minutes long. This is how I learned that the longest album in my Apple Music library is a 666-minute epic (Beethoven: Piano Sonatas, by Daniel Barenboim). I might actually play that start-to-finish when I start writing an epic fantasy novel.\n            \n                What do you think so far?\n            \n        \nPower user features in Albums\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nIf you're looking for different ways to discover and play albums, this app does a great job. It's also perfect for people who love customizing a UI. You can edit the sidebar to reorder various sections, add collections, or even opt for a minimalist look by picking just one element for each section in the sidebar. Albums also supports bulk actions that let you quickly add notes to a bunch of albums or add a set of albums to a new collection. And there are useful sorting options that let you order albums based on release date, title, time spent listening to them, etc. In fact, some of you may complain that Albums has too many customization options, since they can make the UI a bit confusing. For instance, I noticed three different gear icon buttons on the same screen in the app. One of them opens app settings, the second is for collection settings, and the third one is for now playing settings. Power users may enjoy this degree of customizability, but it can also be overwhelming for someone who's just looking for the right button to change their collection's sort order. I also spotted a minor UI bug that displays search results on top of sidebar elements, which makes both hard to read.Still, other than these minor complaints, Albums is a great app that brings some much-needed improvements to Apple Music. It is much faster than Apple Music's own Mac UI, loads songs flawlessly, and does its one job of curating all your albums very well. On the surface, Albums may look like a one-trick pony, but the moment you start exploring it, you'll realize that it has a lot of amazing features for you to enjoy.The developer is clearly is an album enthusiast, and it's nice to see such care still being put into listening to music in the order the artists intended.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why I Use 'Albums' Instead of the Official Apple Music Mac App",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9QASAWB14S3SP4RYAH4CQ7H/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-10T18:30:00.000Z",
      "dateModified": "2025-11-10T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use the '3-3-3' Method to Space Out Your Tasks and Get More Done",
    "url": "https://lifehacker.com/structure-your-day-with-the-3-3-3-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GMDKVR9M38J165PNYY8RH/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-12T14:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                  ",
    "body": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Top 10 Tech Sales This Week\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            This technique helps you maximize your productivity with proper prioritization.\n    \n        \n    \n                                        \n        \n        \n        November 12, 2025\n    \n    We may earn a commission from links on this page.\n    \n            Credit: fizkes - Shutterstock\n                            \n    Table of Contents\n    \n        \n        Sometimes, determining which projects you should devote your time and energy to first takes energy you don’t have to spare (which is why I have tips for how to do it). But even when you know what tasks need to be done, you still need to figure out how to prioritize them, so you can tackle them in the right order while giving each the amount of attention and resources they actually need. Here's where you can use the 3-3-3 method.What is the 3-3-3 method?This technique comes from Oliver Burkeman, author of Four Thousand Weeks: Time Management for Mortals. He advocates planning each workday around a 3-3-3 model:First devote three hours to deep work on your most important project. Next, complete three other urgent tasks that don’t require three hours of focus. Finally, do three “maintenance” tasks, like cleaning, answering emails, or scheduling other work. Other productivity techniques, like the pomodoro method, call for you to engage in deep work, or completely uninterrupted work with no distractions, so consider tapping into one of those first three hours if you want to make the most of a 3-3-3 approach.\n        \n            You May Also Like\n        \n    \nTo figure out which of the above categories a task fits into, I recommend a prioritization method like the Eisenhower matrix, which involves using a quadrant system to divvy up your responsibilities by urgency and importance. You'll want to consider not only how timely the things you need to do are, but also how many resources they'll consume. Remember not to overestimate the amount of time your tasks will take you—the longer you give yourself to work on something, the more you'll naturally drag out your work, which hampers productivity. Be firm with yourself when deciding how long to allot for a major, resource-heavy task.If you don't consider yourself a morning person and aren't sure you can jump into a heavy workload right away in the day, it's not necessarily a problem. I've written about the value of eating the frog—or, rather, tackling your biggest task of the day right away when you get up, which is a part of the traditional 3-3-3 structure—and though I've tried it myself, I'm just not that kind of person. It doesn't mean I can't work within a 3-3-3 framework, so don't feel like you can't, either. Play around with the technique, maybe by starting later in the morning and pushing your lunch back. I find this approach helpful because, truthfully, I really only buckle down around 10:30 every day. Because I am a slower person in the morning, I rearrange my 3-3-3s, tackling maintenance tasks earlier in the day, which keeps me feeling motivated and productive—getting things like answering emails out of the way clears my mind so I can focus on my bigger tasks more easily later.The key to succeeding with a technique like this isn't forcing yourself to fit a mold, but molding the method to your own best working habits, giving yourself a little extra structure, within reason. The goal here is to be discerning about what you take on in a day and work in the right order to maximize productivity, but you have a little wiggle room, so try a few approaches to your schedule to see what works.\n            \n                What do you think so far?\n            \n        \nWhy the 3-3-3 method worksWhat distinguishes this method from other productivity hacks are those three hours of deep work. Usually, jumping into them first means you’ll be fresh, focused, and more likely to be able to focus on a task without getting distracted. Regardless of if you stick to the traditional structure of doing three hours of deep work first in your day or mess with the 3-3-3 schedule, make sure to keep those three hours free of emails, texts, chit-chat, or other menial duties, to the best of your ability. Deep work yields major productivity, so you’ll get a lot accomplished if you commit to it, but you can’t stay in that mindset forever. You’ll top out after about three hours, so it’s best to have those three other, smaller tasks lined up and ready to go so you can stay productive even while downshifting into less demanding responsibilities. After three hours in the zone, you should find that those tasks are easier.Finally, your maintenance tasks give you a chance to get things done while giving your brain a rest. Use your maintenance time to prepare for the following day’s work, put finishing touches on whatever you were working on during those three hours of intense focus, or, like me, get the most boring things over with so you can think about something else.You can use this technique to tackle seven different tasks of varying urgency levels or to break one major project down into smaller chunks, depending on what your day needs. Just be sure to stick with the process.\n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use the '3-3-3' Method to Space Out Your Tasks and Get More Done",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GMDKVR9M38J165PNYY8RH/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-12T14:30:00.000Z",
      "dateModified": "2025-11-12T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]