[
  {
    "title": "Here's How to Preorder the Galaxy S26 Series",
    "url": "https://lifehacker.com/tech/how-to-preorder-the-galaxy-s26-series?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJB605JX25JV21FXMHCC8WSA/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-25T21:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 25, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Samsung\n                            \n            \n                Key Takeaways\n                                            Samsung just announced the Galaxy S26 series, including the S26, S26+, and S26 Ultra.\n                                            These phones are currently available for preorder from a number of stores, including Samsung, Amazon, Best Buy, and major carriers.\n                                            The phones officially go on sale Wednesday, March 11.\n                                    \n            \n    Table of Contents\n    \n        \n        The Galaxy S26 series is official, even if they're not quite officially here yet. Samsung announced the new smartphones at today's Unpacked 2026, touting their upgraded chips (Snapdragon 8 Elite Gen 5 for Galaxy), pro camera features, and new Galaxy AI capabilities. It might be a relatively quiet update, but an update's an update. If you're looking for the fastest Galaxy devices on the market, the choice just moved from the S25 to the S26. When is Samsung releasing the Galaxy S26?While the entire S26 lineup is currently available to preorder, they aren't yet available to purchase. Samsung is making users wait a bit—two weeks, to be exact. Preorders start today, Feb. 25, while the units themselves will be available in stores starting March 11. \nStill, even if you have two weeks to buy any of the S26 series, you might want to consider preordering them ahead of time if you want to secure your device. The newest smartphones from companies like Samsung tend to sell out on release, pushing shipping dates back further than the official release date. That's no guarantee it'll happen this time, but preorder sets your place in line if you're sure which model you want. How much does the Galaxy S26 cost?Three phones, three different starting prices:\n            \n                What do you think so far?\n            \n        \nthe Galaxy S26 is the smallest of the bunch, and costs the least, starting at $899.99the S26 Plus starts at $1,099.99the S26 Ultra starts at $1,299.99Those are just the entry prices, of course—for the base storage for each device. If you want more storage, you'll need to pay more, though you could save some money, depending on the preorder deal you choose. Where to preorder the Galaxy S26 series (and the best deals)There are a number of stores you can preorder the Galaxy S26 series from, but Samsung would obviously prefer you to buy direct. The company is running promotions for preorders, such as trade-in deals, to knock some money off the price tag, but the best reason to go through Samsung is if you want one of their exclusive colors: Silver Shadow and Pinkgold are only available on Samsung's official site. Here are the current preorder deals I'm seeing:Galaxy S26AT&T: As low as $0 per month with eligible trade-in. Amazon: Save $200 off the 512GB model, and get a free gift card.Best Buy: Save $200 off the 512GB model. Trade-in offers accepted.Boost Mobile: $3 per month on the Infinite Access for Galaxy $65 Plan  Samsung: Save up to $500 with eligible trade-in, plus $50 off through PayPal code. T-Mobile: As low as $0 per month with eligible trade-in or new line on the Experience Beyond plan. Verizon: As low as $0 per month with Unlimited Ultimate or Unlimited Plus plan. Galaxy S26 PlusAT&T: As low as $0 per month with eligible trade-in. Amazon: Save $200 off the 512GB model, and get a free gift card. Best Buy: Save $200 off the 512GB model. Boost Mobile: $8.33 per month with the Infinite Access for Galaxy $65 plan. Samsung: Save up to $500 with eligible trade-in, plus $50 off through PayPal code. T-Mobile: As low as $0 per month with eligible trade-in or new line on the Experience Beyond plan. Verizon: As low as $0 per month with Unlimited Ultimate or Unlimited Plus plan. Galaxy S26 UltraAT&T: As low as $0 per month with eligible trade-in. Amazon: Save $400 off the 512GB model, and get a free gift card.Best Buy: Save $200 off the 512GB model. Boost Mobile: $13.89 per month with the Infinite Access for Galaxy $64 plan. Samsung: Save up to $900 with eligible trade-in, plus $50 off through PayPal code. T-Mobile: As low as $0 per month with eligible trade-in or new line on the Experience Beyond plan. Verizon: Save up to $36.11 per month with the Unlimited Ultimate plan. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's How to Preorder the Galaxy S26 Series",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJB605JX25JV21FXMHCC8WSA/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-25T21:00:00.000Z",
      "dateModified": "2026-02-25T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two New Features in YouTube Premium Lite Just Made the Pricier Tier Unnecessary",
    "url": "https://lifehacker.com/entertainment/youtube-premium-lite-is-now-the-best-option-for-most-people?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ8EZBY79VVXD8P569FC2WR6/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-24T21:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 24, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Koshiro K / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        As Lifehacker has previously argued, YouTube Premium is probably the best streaming service for most people. Ads can eat into your free time faster than you might realize, and because YouTube's user-generated videos can be quite short, they're especially annoying there—and blocking them without a paid subscription is tough. YouTube Premium is also a bit pricey as streaming services go, at $14/month. Fortunately, the company also offers a \"Premium Lite\" plan that's much cheaper—and thanks to the recent addition of a few key features, it no longer pales in comparison to a full subscription. In fact, the $8/month YouTube Premium Lite may now be the best paid YouTube tier for most people.YouTube Premium Lite is getting two of the more expensive tier's best featuresStarting today, YouTube Premium Lite now offers both background play and download options on most videos, features that were previously exclusive to a full YouTube Premium plan. The update is currently rolling out, so it might take a little bit for it to reach you, but the change essentially gives you parity with a full YouTube Premium plan on the vast majority of YouTube content. According to YouTube, the company has \"heard feedback about wanting these additional features included in the service,\" which prompted the change.\nNow, for the same $8/month price, you can get most of the full YouTube Premium experience, normally a $14/month value. The only catch? You'll still get ads when streaming music and music videos, hence the \"most videos\" disclaimer. Ads also \"may appear when you search or browse,\" but as for interruptions while watching non-music content? You should be in the clear.\n    \n            \n            \n                                        Credit: YouTube\n                    \n    \nA full YouTube Premium account no longer makes sense for most usersEssentially, unless you're a big YouTube Music user, getting YouTube Premium Lite instead of a full-cost subscription is now a no-brainer. There are a few smaller bonuses you'll be leaving behind, like the ability to \"Jump Ahead\" (instantly skip frequently skipped parts of a video, usually ad reads), but your subscription will also be around half the price. You win some, you lose some.\n            \n                What do you think so far?\n            \n        \nThe only real gap now, at least for me, is for households with lots of different YouTube viewers YouTube Premium Lite still only applies to one profile at a time, so if everyone in your household wants to have their own separate algorithms instead of sharing a profile, you'll need to get YouTube Premium Family, which costs $23/month, giving six people in the same household the benefits of a full YouTube Premium subscription. My husband and I have pretty different viewing habits, so we're unlikely to switch to this cheaper tier any time soon. But if you live alone or you're OK sharing a profile, you might as well save yourself some moolah.Alternatively, you can also still get a YouTube Music Premium plan for $11/month. That removes ads and allows background play and downloads, but only for music and music videos. It's essentially the opposite of YouTube Premium Lite, and faces stiff competition from the likes of Spotify and Apple Music. Personally, I'd just pay the extra for a full YouTube Premium subscription, which has all the same benefits of YouTube Music Premium, but also works for non-music content and only costs $3/month more.Still, while adding new features to Premium Lite is ultimately a discount, it does follow a move from YouTube to block people from accessing background play for free. Perhaps this is Google's attempt at a compromise?\n            \n    \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from our expert team.\n            The Daily NewsletterReady to do everything better?\n                    Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two New Features in YouTube Premium Lite Just Made the Pricier Tier Unnecessary",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ8EZBY79VVXD8P569FC2WR6/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-24T21:00:00.000Z",
      "dateModified": "2026-02-24T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This App Will Detect People Wearing Smart Glasses Near You",
    "url": "https://lifehacker.com/tech/use-this-app-to-know-whether-someone-is-wearing-smart-glasses?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ87RSN7ZGQ29W6Q1ENFW1AK/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-24T17:11:56.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 24, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Getty Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            \"Nearby Glasses\" is a new app that tells you when someone is wearing smart glasses in your area.\n                                            The app looks for Bluetooth signatures of known smart glasses manufacturers, and sends a push notification when it spots one.\n                                            The app will think mixed reality headsets are smart glasses, so false positives can happen.\n                                            Nearby Glasses is available for Android, and the developer is working on an iOS port.\n                                    \n            \n    Table of Contents\n    \n        \n        Smart glasses aren't just the stuff of Hollywood anymore: You can buy a pair right now. Devices like Ray-Ban Metas come equipped with speakers, a microphone, embedded cameras, and connectivity to your smartphone—all in a package that largely looks like a normal pair of glasses. That's great for enthusiasts who want a hands-free smartphone experience when out and about, but not so great for anyone who dislikes the idea of invisible cameras everywhere.There are two sides to these privacy worries. One is the personal angle. Many of us don't want the people around us shoving their smartphone cameras in our faces when we're out in public, but at least then we'd know we're being recorded. These embedded cameras are tough to spot unless you know what you're looking for, which means there's a feeling of always being watched by anyone walking past wearing glasses. On the other hand, there's the larger privacy concern that comes with the territory of a huge company like Meta. Just last week, we learned the company plans to bring facial recognition tech to its Ray-Ban and Oakley smart glasses with a feature called \"Name Tag,\" which would give the wearer insights into the people they encounter using Meta AI. Taken together, smart glasses pose an unprecedented privacy and security risk for those of us living our lives, when both our neighbors and law enforcement have the accessibility to spy on us without our knowledge. Of course, what can you do? If these glasses are legal, and they're relatively inconspicuous, how can you protect yourself from the average Ray-Ban Meta-wearing Joe? By the time you get close enough to tell whether or not they're wearing smart glasses, you're already in view of the camera.\n\"Nearby Glasses\" tells you when someone is wearing smart glasses in your areaEnter \"Nearby Glasses,\" a new app that spills the beans on smart glasses wearers near your location. As reported by 404 Media, the app is made by developer Yves Jeanrenaud, and scans for smart glasses' \"distinctive Bluetooth signatures\" (also known as \"advertising frames\") to identify them in your immediate area. Jeanrenaud was able to use a directory of Bluetooth Low Energy (BLE) manufacturers to build a list of smart glasses the app can scan for, including devices from Meta, Luxottica Group S.p.A, and Snap. If the app spots one, it sends you a push notification.\n            \n                What do you think so far?\n            \n        \nThe app can't currently distinguish between smart glasses and mixed reality headsets, however. As such, you may get an alert saying there are smart glasses nearby, but because the app picked up the Bluetooth signals from a Meta Quest headset. That said, these are much easier to spot than smart glasses, and are far less likely to be worn inconspicuously in public spaces.    Nearby Glasses is available for Android today, on both the Play Store as well as Github. Jeanrenaud says an iOS port \"is in the making.\"\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This App Will Detect People Wearing Smart Glasses Near You",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ87RSN7ZGQ29W6Q1ENFW1AK/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-24T17:11:56.000Z",
      "dateModified": "2026-02-24T17:11:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samsung's February Security Patch Is Now Available on These Devices",
    "url": "https://lifehacker.com/tech/samsungs-february-security-patch-is-now-available-on-these-devices?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ8F5V78J9ZCJ51C59GGSJ6T/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-24T19:30:50.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 24, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: tinhkhuong/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Samsung's February security update comes with dozens of patches, and is now available for some Galaxy devices.\n                                            The update is rolling out now to the Galaxy S25 series, as well as the Galaxy Z Flip 7, Z Fold 7, and Z TriFold.\n                                            The update patches 37 flaws, though none of rated \"critical.\"\n                                    \n            \n    Table of Contents\n    \n        \n        This is going to be a big week for Samsung. The company is making some major announcements at Galaxy Unpacked 2026 on Wednesday, revealing the next generation Galaxy S Series devices (which almost assuredly means the Galaxy S26), as well as some new AI updates. In the lead up to this event, Samsung is also now rolling out its latest security updates for its Galaxy devices—at least, some of its devices. What's new with Samsung's February security updateSamsung's February security update contains 37 patches for issues the company discovered since the January update. This time, there are no critical patches, but there are plenty of fixes for \"High\" severity issues. According to SamMobile, 25 of these patches were provided by Google, which fix issues with Android in general, while the other 12 were specific to Samsung to patch issues within its own ecosystem. That includes issues for Emergency Sharing, Knox Guard Manager, Samsung Dialer, Samsung's Settings app, face and fingerprint authentication systems, and the PACM module—things that only apply to Samsung's own OS.     Not all Galaxy phones are getting this update right away. Samsung is kicking things off with its Galaxy S25 series, meaning the Galaxy S25, S25+, and S25 Ultra. It also appears to be rolling out to its latest foldable devices as well, including the Galaxy Z Fold 7, Z Flip 7, and Z TriFold. If you bought Samsung's latest and greatest—at least until the S26 series launches—you'll likely see the update in your Settings app imminently. If your Galaxy device is on the older side (or even one year older than the S25 series), you may need to wait a bit before the patches appear. \nSpeaking of waiting, Samsung started rolling this update out to Korean users first, so if you're in another region, you might not see it right away. But it does seem evident the patch is on its way, especially with Unpacked airing Wednesday.\n            \n                What do you think so far?\n            \n        \nHow to install Samsung's February security updateOnce the security update hits your device, open the Settings app, then choose either Software update or System updates. (This may differ depending on your device.) From here, depending on your carrier, tap either Download and install, Check for system updates, or Check for software updates. The latest update may begin downloading automatically, but if it doesn't, tap Download now. Finally, follow the on-screen instructions to install the update.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung's February Security Patch Is Now Available on These Devices",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ8F5V78J9ZCJ51C59GGSJ6T/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-24T19:30:50.000Z",
      "dateModified": "2026-02-24T19:30:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Just Announced Three New Gemini Upgrades for Galaxy S26 and Pixel 10",
    "url": "https://lifehacker.com/tech/three-new-gemini-upgrades-for-galaxy-s26-and-pixel-10?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJASHNTYJB301NNZX50YR0E0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-25T18:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 25, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Google\n                            \n            \n                Key Takeaways\n                                            Google is rolling three new Gemini AI upgrades for Android, starting with Pixel 10 and Galaxy S26 devices.\n                                            On these devices, Gemini will be able to run tasks on your behalf, such as booking a ride through Uber or reordering a favorite meal on DoorDash.\n                                            Circle to Search will also be able to search multiple items on screen at once, rather than focus on one item at a time.\n                                            Google is rolling out upgrades to its Scam Detection AI, to help detect scams in real-time.\n                                    \n            \n    Table of Contents\n    \n        \n        To coincide with the Samsung Galaxy S26 launch, Google announced three Gemini-related upgrades for Android, coming first to both the Galaxy S26 series and the Google Pixel 10 range. In fact, one of these new features seems like a significant step forward for AI on smartphones: the ability for Gemini to handle multi-step tasks on an Android phone. The examples Google gives are booking a ride through Uber or reordering a meal on DoorDash, where the AI takes care of everything in the background, leaving you free to worry about, well, whether it's going to work.Google wants Gemini to perform tasks on your behalf  \"When you're working on a repetitive daily task, it's easy to daydream about handing it off to someone else,\" explains Google in the announcement blog post. \"Now, we're showing an early preview of what's possible.\" Understandably, this has a \"beta\" label as well as an \"early preview\" label attached, and it's initially only going to be available on Galaxy S26 phones and Pixel 10 phones (the Pixel 10a misses out). It'll also be limited to the U.S. and South Korea to begin with.As per Google, the process will be tightly controlled: Automations begin with your voice command and end as soon as the task is finished. Live notifications will keep you updated throughout, and you can jump in and take manual control at any time. What's more, the app is run in a \"secure, virtual window\" on your phone, with restricted app access.\nIt's going to be interesting to see how well this works. If it works well, this feels like a notable moment in getting AI to actually do mobile tasks for us. It's not clear if Google needs third-party app permission for this, but for now the feature will be available \"for select apps\" in the food, grocery, and rideshare categories.Google is upgrading Circle to Search and Scam DetectionNext, Google is upgrading Circle to Search on Android, the feature that lets you circle anything on screen and run a search from it. Circle to Search can do everything from find you a lamp online to warn you about a phishing scam.Now, Circle to Search will be able to search multiple elements on screen at once. It might be different pieces of furniture in a room, or different items of clothing in an outfit. You don't actually make the selections yourself: You just circle the relevant area (or the entire screen), and Gemini picks out the various constituent parts.\n            \n                What do you think so far?\n            \n        \n\"We know that sometimes you aren't just looking for a single thing on your screen—you're looking for the whole thing,\" says Google. \"Whether you're curating a mood board, building an entire outfit or just satisfying your multi-layered curiosity...Circle to Search is getting a whole lot more helpful.\"\n    \n            \n            Circle to Search can now scan for multiple items in a search.\n                                        Credit: Google\n                    \n    \nGoogle is also embedding the ability to virtually try on clothes from your phone in the Circle to Search flow. It's similar to the Gemini multi-step process above, with the AI taking on several sequential tasks to (in theory) be even more useful—technically, Google calls it a query fan-out technique. Again, this will be exclusive to Galaxy S26 and Pixel 10 phones, with no word yet on this potentially expanding to other handsets.Finally, the last upgrade is more of a wider roll out than a new feature. The Scam Detection AI that Android uses to detect if you're being scammed in calls in real time is coming to the Galaxy S26 series for users in the U.S. It's already offered on multiple Pixel models in the U.S., the UK, Australia, Canada, India, and Ireland. The same technology is also currently available in Google Messages to catch text-based scams, and Google says it's \"enhancing\" how this works to recognize more varied scams, starting with Galaxy S26 and Pixel 10 devices. The new and improved tech will use on-device models to better spot techniques used by scammers.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Just Announced Three New Gemini Upgrades for Galaxy S26 and Pixel 10",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJASHNTYJB301NNZX50YR0E0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-25T18:00:00.000Z",
      "dateModified": "2026-02-25T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "All the Ways You Can Customize Notifications on Android Auto",
    "url": "https://lifehacker.com/tech/how-to-customize-notifications-on-android-auto?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ5H56V8DV16PKZJBTEP82X3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-23T16:00:06.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 23, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Vera Aksionava / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        If you're an Android Auto user, you may already know that setting up phone notifications while you're driving isn't as straightforward as it could be—though Google has recently made a settings tweak that should simplify things. On the one hand, you don't want to miss important messages or calls, but on the other you definitely don't want to put yourself and other road users at risk by getting distracted while driving. A careful balance is needed, and it's important to know what options are available on your phone.If you're a Pixel user, Do Not Disturb is handled by Modes, which you can find by tapping Modes in Settings. Pick Driving, and if you enable the While driving toggle switch, this mode is automatically enabled when you're in your car.\n    \n            \n            You can mute some or all of your phone's notifications when driving.\n                                        Credit: Lifehacker\n                    \n    \nTap the While driving text (not the toggle switch), and you can tell Android how it should determine whether or not you're driving. This is the setting that Google recently tweaked: You can now choose Use Bluetooth (so the mode is enabled when a car dashboard is detected), or Use motion and Bluetooth (which also takes readings from your phone's accelerometer into consideration). Previously, you had to rely solely on motion, which led to problems with automatic activation for both drivers and passengers—the addition of Bluetooth should mean a more reliable experience.\nIt's slightly different on Samsung Galaxy phones: You need to tap Modes and Routines from Settings, then you can access the Driving mode. Here, you can specifically set a connection to an Android Auto dashboard as the trigger for enabling the mode, rather than just any Bluetooth device—something Google should really add to standard Android.On both Pixel and Galaxy phones, you can tweak the driving mode to allow notifications from certain apps or from certain people, but again be wary of making your vehicle too distracting with pop-ups and pings.Other Android Auto notification settingsAs well as setting which apps and contacts can trigger phone notifications while you're driving, you can customize these modes further. From the Driving mode screen on a Pixel, tap Display settings to control whether or not the phone lights up when you get a notification. You can also dim the wallpaper, and switch to a grayscale look.When you're editing your Driving mode on a Galaxy phone, you'll see you can tap either Lock screen or Home screen to change the wallpaper and color palette specifically for this mode. Again, the idea is that your phone is a little less distracting visually.There are more notification options on the main Android Auto settings page: From Android Settings, tap Connected devices > Connection preferences > Android Auto (Pixel) or Connected devices > Android Auto (Galaxy).\n            \n                What do you think so far?\n            \n        \nUnder the Messaging header, you can turn off alerts for group conversations, or for messaging apps entirely. There's also a toggle switch here for showing or hiding the first line of the incoming message—you probably want to disable this if you want to spend more time with your eyes on the road.\n    \n            \n            You can control how messages appear on your dashboard.\n                                        Credit: Lifehacker\n                    \n    \nFinally, there's the option for having your incoming messages read out loud to you, which is another way you can reduce the temptation to stare at your vehicle's dashboard for an extended period of time, or to pick up and unlock your phone.It's worth reviewing all the other Android Auto settings here as well, to make sure your driving experience is set up exactly the way you want: You can reduce the number of apps available in Android Auto, for example, and enable taskbar widgets for easier app control, which can also make a difference to how distracted you are on the road.You should end up with an Android Auto notification system that's not going to overwhelm you with alerts while you're driving, but which also won't hide important messages from you by automatically enabling notification filters without you being aware.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All the Ways You Can Customize Notifications on Android Auto",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ5H56V8DV16PKZJBTEP82X3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-23T16:00:06.000Z",
      "dateModified": "2026-02-23T16:00:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch Out for This Phone Delivery Scam",
    "url": "https://lifehacker.com/money/watch-out-for-this-phone-delivery-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ8FCD85D7J1QQF3W610JF0D/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-25T14:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 25, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Table of Contents\n    \n        \n        If you order a new smartphone to be delivered to your home, you may be a target for scammers. Fraudsters are impersonating representatives from mobile carriers, calling customers and claiming that they've been sent the wrong device and need to return it. Obviously, if you follow through, scammers get to keep your phone—they may either to sell it or activate it using your information to perpetrate identity fraud. Scams centered on stealing high-value tech aren't anything new. In addition to regular porch pirating, thieves have been known to knock on doors, posing as couriers or company representatives attempting to recover a \"wrongly delivered\" item. Fraudsters have also used fake Find My alerts to gain access to lost or stolen iPhones. \nHow the phone return scam worksAs an editor at ZDNET experienced, the scam begins shortly after your new phone is delivered. You may receive a call from a spoofed number, and someone claiming to represent your carrier will have specific information like your name, address, and device model. They'll tell you that there's been a mix-up and you need to send your phone back so you can receive a replacement. They may give you instructions to scan a QR code, print a label, and take the package to a shipping drop-off point. In some cases, targets have been promised gift cards for the inconvenience. If you hesitate, scammers may employ a number of pressure tactics to get you to act. They'll tell you that delaying the return could cause issues with your device activation, billing, or warranty. They may continue to call with threats. Like many scams, this one relies on social engineering: it manipulates emotions and instincts to get you to act against your best interest. Fraudsters impersonate a trusted brand and use detailed information about you to make their story more believable. They use timing to their advantage and promote a sense of urgency. \n            \n                What do you think so far?\n            \n        \nThe phone return scam also has similarities to the brushing scam, in which victims receive a package containing merchandise they didn't order so that scammers can write a verified review or boost sales numbers or collect personally identifiable information once you scan a QR code (an added component known as quishing) to learn more about the item. What to do if you get a call about your new phoneThe solution here is to simply hang up. If you are concerned about your account or device, call your carrier directly (use the customer service number from a previous bill or go through the official app) and confirm the mix-up. Don't engage with QR codes or any instructions provided on unsolicited calls. It may be alarming that a scammer has specific details about your order and calls right after your new phone is delivered. Unfortunately, a lot of your personal information is out in the open and available to bad actors, whether as the result of a data breach or some other form of compromise (such as malware that can read notifications). This is a good reason to keep an eye out for other indicators of identity theft and act quickly if you find anything suspicious. \n            \n    \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from our expert team.\n            The Daily NewsletterReady to do everything better?\n                    Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch Out for This Phone Delivery Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ8FCD85D7J1QQF3W610JF0D/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-25T14:30:00.000Z",
      "dateModified": "2026-02-25T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Is Finally Making Texting Between iPhone and Android Secure",
    "url": "https://lifehacker.com/tech/apple-is-finally-making-texting-between-iphone-and-android-secure?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ87PX2KM57W75WTK5Q3NND1/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-24T17:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 24, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple finally support end-to-end encryption (E2EE) for RCS on iPhone—with a catch.\n                                            The company rolled out support for E2EE for RCS messaging with the second iOS 26.4 beta.\n                                            Beta testers can now take advantage of the encryption, assuming their Android friends are running the latest version of Google Messages.\n                                            Despite these updates, Apple has no plans to launch E2EE for RCS with the official release of iOS 26.4, and hasn't confirmed which version it will launch encryption with.\n                                    \n            \n    Table of Contents\n    \n        \n        Perhaps the best thing to happen to smartphones in the past five years was Apple's decision to start supporting RCS. Ever since, texting between iPhone and Android hasn't been a nightmare caused by SMS: Group chats function as they should, photos and videos can be sent in high quality, and you can even see when the other person is typing—though the messages are still green. While the experience is miles better than it used to be, it isn't perfect. There are still some key functions missing from RCS on iPhone. For instance, you can't unsend messages, reply to a thread, or edit iPhone messages. The latter can only happen on the Android side, while only iPhones can react with emojis right now. The biggest omission, however, is support for end-to-end encryption (E2EE). This is arguably the most important advantage RCS has over SMS. E2EE \"scrambles\" your messages, and only you and the recipient(s) have the \"keys\" to unscramble them. If a hacker were to remotely access your messages from an untrusted device, they wouldn't be able to read them: The only way to see these messages in plain text is to have access to the trusted device associated with them. If you have an Android device, and you text with other Android devices using Google Messages, you likely have this advantage. You may see a small lock icon next to your messages as you send them, indicating that texts are sent with E2EE. iPhones have this advantage when texting other iPhones, as iMessage is E2EE as well. But when you text from an iPhone to an Android, whether or not you're using RCS or SMS, those messages are not protected by encryption, which leaves you vulnerable to hacking. \nEnd-to-end encryption support for RCS is live in the iOS 26.4 betaThat's now changing. Apple is currently testing E2EE support for RCS on iPhone. Not only that, anyone can try it out right now—assuming you're fine taking on the risks of beta software. The change comes with the second beta for iOS 26.4, which Apple released on Monday. Apple's first beta for 26.4 added an initial layer of support, but only for iPhones texting each other with iMessage disabled. The second beta now supports E2EE for RCS communications with Android devices. As long as your Android friends are running the latest version of Google Messages, and you're running the second iOS 26.4 beta, you can rest easy knowing your messages are protected by end-to-end encryption. \n            \n                What do you think so far?\n            \n        \nHowever, this doesn't mean that those of us waiting for the official iOS 26.4 release will enjoy the same. While beta features are always subject to change, Apple explicitly says in its release notes that, \"This feature is not shipping in this release and will be available to customers in future iOS, iPadOS, macOS, and watchOS 26 releases.\" It seems the company is getting a jump on testing in anticipation of a future iOS 26.4.1, iOS 26.5, or maybe even an iOS 27 release. Don't install the iOS 26.4 beta without knowing the risksYou'll need to install the latest beta on your iPhone to give this encryption a try—but don't do that without thinking it through. Beta software is in testing, which means there may be bugs and other instabilities you aren't used to dealing with in iOS. If something goes wrong, and you need to uninstall the beta, you'll need to reset your iPhone entirely. Unless you have a full backup of iOS 26.3 on your computer, you could lose data. As such, I never recommend installing betas on your primary device. It's your choice, of course: Just understand the risks.If you do decide to try the beta, you'll also have access to other new features in iOS 26.4—namely, a new Apple Music experience with an AI playlist generator, fresh design, and the ability to add songs to multiple playlists at once. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Is Finally Making Texting Between iPhone and Android Secure",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ87PX2KM57W75WTK5Q3NND1/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-24T17:00:00.000Z",
      "dateModified": "2026-02-24T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Update Chrome ASAP to Patch This High-Severity Security Flaw",
    "url": "https://lifehacker.com/tech/update-chrome-asap-to-patch-the-latest-zero-day?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHPAYVF4J3DZ0GBWXFDNFH3N/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-17T21:30:01.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 17, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: aileenchik / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Google has issued a patch for a high-severity flaw that has been actively exploited in the wild—the first Chrome zero-day in 2026.\n                                            CVE-2026-2441 would allow a remote attacker to execute arbitrary code inside a sandbox via a crafted HTML page.\n                                            Chrome updates automatically when you close and reopen the browser, or you can apply pending updates when they appear.\n                                    \n            \n    Table of Contents\n    \n        \n        If you use Google Chrome, you should install the latest update ASAP. Google has issued a patch for a high-severity flaw that has been actively exploited in the wild—the first Chrome zero-day in 2026. What the Google Chrome patch fixesThe latest flaw, catalogued as CVE-2026-2441, is a use-after-free vulnerability in CSSFontFeatureValuesMap, Chrome's CSS font feature implementation. A use-after-free vulnerability is a flaw in which an application attempts to use memory after it has been released back to the system. This type of bug allows attackers to execute code, escalate privileges, cause app or system crashes, and leak sensitive data. CVE-2026-2441 would allow \"a remote attacker to execute arbitrary code inside a sandbox via a crafted HTML page.\" Essentially, this means malicious HTML content could run code inside a Chrome tab, extension, or plugin. As Malwarebytes explains, this is dangerous because attackers can see or modify whatever the isolated browser tab (sandbox) can access, allowing actions like credential harvesting and traffic rerouting—even if it cannot escape to impact the whole operating system. \nGoogle said that this vulnerability has been exploited in the wild but hasn't provided any specific details as to how. The discovery has been attributed to Shaheen Fazim.\n            \n                What do you think so far?\n            \n        \nWhat Chrome users need to doGoogle released a Stable channel update on Feb. 13 with a patch for this flaw. The latest versions of Chrome are 145.0.7632.75/76 for Windows and macOS and 144.0.7559.75 for Linux, so you'll want to ensure you are up to date. Go to the Chrome menu and select About Google Chrome to check which version you're on. Chrome updates automatically when you close and reopen the browser, but if you don't do that regularly, keep an eye out for pending updates in the top-right corner of your browser window. Apply these updates immediately by tapping the three dots and selecting the first menu item. Chrome will need to restart to complete the update. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Update Chrome ASAP to Patch This High-Severity Security Flaw",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHPAYVF4J3DZ0GBWXFDNFH3N/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-17T21:30:01.000Z",
      "dateModified": "2026-02-17T21:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Workout-Ready Beats Earbuds Are $90 Off Right Now",
    "url": "https://lifehacker.com/tech/beats-powerbeats-pro-2-sale-february-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ6WXYTNR13RAG0E9HMJNR6G/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-24T13:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 24, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Woot/Lifehacker \n                            \n    Table of Contents\n    \n        \n        The Beats Powerbeats Pro 2 were designed with workouts in mind, but their $249.99 list price has made them a harder sell unless you really value a locked-in fit. Right now, however, Grade-A refurbished pairs are $159.99 at Woot. For comparison, new units are listed at around $212 on Amazon, and used pairs are about $168. According to price trackers, the previous low was about $179.95, so this dip is roughly $20 below that mark. All told, that’s a $90 discount if you don’t mind a pre-owned device that has been tested and verified to work as intended. Prime members also get free shipping, while non-Prime customers pay a $6 fee. \nThe adjustable ear hooks of these earbuds keep them secure during runs, strength training, or high-impact workouts, and the IPX4 rating means sweat and light splashes won’t cause problems. The sound leans bold, with strong bass that keeps pace with hip-hop and electronic playlists. Active noise canceling reduces background noise at the gym, while transparency mode lets you hear traffic and announcements during outdoor runs. They also pair easily with Apple devices and support features similar to AirPods, though in a design that is more secure for exercise. For more on how these stack up in Apple’s ecosystem, see Senior Technology Editor Jake Peterson’s coverage of the Powerbeats Pro 2 fitness features in iOS 26.\n            \n                What do you think so far?\n            \n        \nSetup is simple, though if you need help with it, you can follow Lifehacker’s guide on how to configure every feature of your Powerbeats Pro 2. Battery life runs about eight to 10 hours per charge, and the case stretches total listening time to roughly 45 hours. That said, the built-in heart rate tracking is not flawless. Our Senior Health Editor, Beth Skwarecki, found it did not always sync reliably, especially when an iPhone was juggling workout apps and music at the same time. There is also no companion equalizer app, so you cannot tweak the sound profile beyond what Beats has tuned.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n            Add to Cart NewsletterShop smarter, save more money.\n                    Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Workout-Ready Beats Earbuds Are $90 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ6WXYTNR13RAG0E9HMJNR6G/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-24T13:30:00.000Z",
      "dateModified": "2026-02-24T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What's New on Netflix in March 2026",
    "url": "https://lifehacker.com/entertainment/whats-new-on-netflix-in-march-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJAR6SX6NF1ADPS4AT32BXKB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-25T17:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 25, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Netflix \n                            \n    Table of Contents\n    \n        \n        Netflix's March slate kicks off with the live stream of the 32nd annual Actors Awards hosted by Kristen Bell—red carpet coverage begins at 7 pm ET on March 1 followed by the show at 9 pm. Netflix will also be hosting a live performance from BTS as part of their comeback tour (March 21 at 7 am ET) as well as the MLB Opening Night matchup between the Yankees and the Giants (March 25 at 7 pm ET). Cillian Murphy reprises his role as British gangster Tommy Shelby in a new feature-length film. Peaky Blinders: The Immortal Man (March 20) is set a few years after the series finale and sees Shelby return to Birmingham when his estranged son (played by Barry Keoghan) gets involved in a Nazi plot. Netflix will also get all four seasons of The Man in the High Castle (March 11), the dystopian drama series—originally created for Amazon Prime Video—set in a parallel universe in which the Axis powers won World War II. The Dinosaurs (March 6) is a new docu-series from the team behind Our Planet that explores the rise and fall of the dinosaurs over the span of 150 million years. The series is executive produced by Steven Spielberg and narrated by Morgan Freeman.\nFinally, Love Is Blind: The Reunion from season 10 will premiere on March 11 at 9 pm ET. \n            \n                What do you think so far?\n            \n        \nHere's everything else coming to Netflix in March, and everything that's leaving.Available March 1The Actor Awards Presented by SAG-AFTRA—Netflix Live EventCasinoChefDeepwater HorizonDesperadoFifty Shades DarkerFifty Shades FreedFifty Shades of GreyThe Green KnightGoosebumpsJurassic WorldJurassic World: Fallen KingdomLegionThe Lego MovieMatildaMiseryRaySicarioStephen King's SleepwalkersThe Swan PrincessTrollsZombielandAvailable March 2Gabby's Dollhouse: Season 13—Netflix FamilyHotel MumbaiJurassic World: DominionAvailable March 3The Bling RingBruce Bruce: I Ain’t Playin’—Netflix Comedy SpecialAvailable March 4Blue Therapy—Netflix SeriesStreet Flow 3—Netflix FilmAvailable March 5A Friend, a Murderer—Netflix DocumentaryGinger & RosaVladimir—Netflix SeriesAvailable March 6A Man Called OveBoyfriend on Demand—Netflix SeriesThe Dinosaurs—Netflix DocumentaryHello Bachchon—Netflix SeriesStill Shining—Netflix SeriesStrangers in the Park—Netflix FilmThe TikTok Killer—Netflix DocumentaryWar Machine—Netflix FilmAvailable March 7BEASTARS FINAL SEASON Part2—Netflix SeriesDownton Abbey: The Grand FinaleNurembergAvailable March 9Clifford the Big Red DogSesame Street: Volume 2—Netflix FamilyAvailable March 10Derrick Stroup: Nostalgic—Netflix Comedy SpecialJobsONE PIECE: Season 2—Netflix SeriesAvailable March 11Age of Attraction—Netflix SeriesLouis Theroux: Inside the Manosphere—Netflix DocumentaryLove Is Blind: The Reunion—Netflix SeriesThe Man in the High Castle: Seasons 1-4Available March 12Love is Blind: Sweden: Season 3—Netflix SeriesMade in Korea—Netflix FilmVirgin River: Season 7—Netflix SeriesAvailable March 13Fatal Seduction: Season 3—Netflix SeriesThat Night—Netflix SeriesAvailable March 14Nobody 2Available March 16The Plastic Detox—Netflix DocumentaryAvailable March 17Mark Normand: None Too Pleased—Netflix Comedy SpecialThe Ricky Gervais Show: Seasons 1-3Available March 18Eva Lasting: Season 4—Netflix SeriesRadioactive Emergency—Netflix SeriesSeason 2: Furies: Resistance—Netflix SeriesAvailable March 19JigsawSawSaw IISaw IIISaw IVSaw VSaw VISaw XSaw: The Final ChapterSTEEL BALL RUN JoJo’s Bizarre Adventure—Netflix SeriesTyler Perry's Beauty in Black Season 2 Part 2—Netflix SeriesUnicorn Academy: Secrets Revealed: Chapter 1—Netflix FamilyAvailable March 20Peaky Blinders: The Immortal Man—Netflix FilmPokémon Horizons: Season 3—Rising Hope Part 2—Netflix FamilyThe Rise of the Red Hot Chili Peppers: Our Brother, Hillel—Netflix DocumentaryAvailable March 21The Bad Guys 2BTS THE COMEBACK LIVE | ARIRANG—Netflix Live EventAvailable March 23Anatomy of a FallInside: Season 3—Netflix SeriesMinions: The Rise of GruAvailable March 24Jeff Ross: Take a Banana for the Ride—Netflix Comedy SpecialReady or Not: Texas—Netflix SeriesAvailable March 25Heartbreak High: Season 3—Netflix SeriesHomicide: New York: Season 2—Netflix DocumentaryMLB Opening Night: Yankees vs. Giants—Netflix Live EventAvailable March 26CaterpillarThe Conners: Season 7Jo Nesbø's Detective Hole—Netflix SeriesMike & Molly: Seasons 1- 6The Prosecutor—Netflix DocumentaryThe Red Line—Netflix FilmSomething Very Bad Is Going to Happen—Netflix SeriesAvailable March 2753 Sundays—Netflix FilmBTS: THE RETURN—Netflix DocumentaryThe Parisian Agency: Exclusive Properties: Season 6—Netflix SeriesAvailable March 28AnemoneAvailable March 31Aaron Chen: Funny Garden—Netflix Comedy SpecialUntold: The Death & Life of Lamar Odom—Netflix DocumentaryWhat's leaving Netflix in March 2026Leaving March 1A League of Their OwnAce Ventura: Pet DetectiveAce Ventura: When Nature CallsThe Amazing Spider-ManThe Amazing Spider-Man 2As Good as It GetsBad TeacherBattlefield EarthBoyz n the HoodBram Stoker's DraculaBraveheartBrightburnDante's PeakFranklin & Bash: Seasons 1-4GodzillaI Know What You Did Last SummerLittle WomenPulp FictionStripesThis Is 40The Ugly TruthThe Wedding RingerThe Wolf of Wall StreetLeaving March 2The Hughleys: Seasons 1-4Leaving March 5Forrest GumpLeaving March 6Power RangersLeaving March 11Are You There God? It's Me, MargaretLeaving March 12House of GucciThe HustleLeaving March 13The Talented Mr. RipleyLeaving March 14Miracle in Cell No. 7Leaving March 16TitanicLeaving March 20Four BrothersLeaving March 25Wrath of ManLeaving March 31The Hurt Locker\n            \n    \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from our expert team.\n            The Daily NewsletterReady to do everything better?\n                    Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What's New on Netflix in March 2026",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJAR6SX6NF1ADPS4AT32BXKB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-25T17:00:00.000Z",
      "dateModified": "2026-02-25T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Award-Winning AR Smart Glasses Are at a Great Price Right Now",
    "url": "https://lifehacker.com/tech/xreal-one-pro-smart-glasses-deal-february-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ8C74HVHN71NY2Y1H6QNWVY/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-24T18:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Augmented reality (AR) glasses let you turn any space into a giant private TV screen, and the REAL One Pro AR glasses have one of the widest fields of view in their category, plus a bevy of features that helped earn them a 2025 PCMag Editors' Choice Award. And right now, the XReal One Pro AR glasses are at their lowest price ever: $598.99 (down from $769).\nOn the surface, these look like a regular pair of black sunglasses, housed within a thin, glossy frame with lenses that you can lighten or dim. The bridge features removable silicone nose pads as well as mounting points for perspective lens inserts. Compared to most AR glasses, which typically have a 30 to 50-degree field of view, the XReal One Pros come in at 57 degrees—even compared to its predecessor, the XReal One Pros, the picture is significantly more expansive. The XReal One Pros are compatible with any devices that output a DisplayPort signal over USB-C, meaning they’ll work with the majority of phones, tablets, and PCs (though not a Nintendo Switch or Switch 2). They offer the same AR tweaks as the previous model, including head-tracking capabilities, options to adjust the size and distance of the virutal screen, and different viewing modes, including ultra-wide and side-view. Built-in 3DOF motion tracking and Bose-designed speakers help make the experience more immersive. The glasses have 2GB of built-in storage that can be offloaded to the connected device via the glasses’ menu.\n            \n                What do you think so far?\n            \n        \nThe wide field of view is where these glasses really shine; PCMag describes it as “noticeably bigger than the XReal One’s and Rokid Max 2’s displays, and much larger than the Viture Pro’s,” and likens the experience to upgrading from a 55-inch TV to a 75-inch one. While spreading the pixels across a wider space means the image isn’t as sharp as pairs with a narrower field of view, these specs still deliver crisp visuals with easy-to-read text when being used as a wearable monitor. \n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n            Add to Cart NewsletterShop smarter, save more money.\n                    Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Award-Winning AR Smart Glasses Are at a Great Price Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ8C74HVHN71NY2Y1H6QNWVY/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-24T18:00:00.000Z",
      "dateModified": "2026-02-24T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WhatsApp Now Lets You Share Group Message History With New Members",
    "url": "https://lifehacker.com/tech/whatsapp-now-lets-you-share-group-message-history-with-new-members?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHXSKWWYE920PRBZMSCP5Z5Z/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-20T16:04:25.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 20, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: BigTunaOnline via Shutterstock\n                            \n            \n                Key Takeaways\n                                            WhatsApp will finally let new group chat members see old messages.\n                                            New members are limited to viewing up to 100 recent messages, which must be shared with them.\n                                            Admins and group members can share messages by default, but admins can turn the feature off for members.\n                                    \n            \n    Table of Contents\n    \n        \n        From coordinating pickups for road trips to helping organize yard sales, WhatsApp groups are at the center of all kinds of events in people's daily lives. As someone who's a member of far too many WhatsApp groups, I've always been very annoyed by the app's inability to show group chat history to new group chat members. In the lead up to my most recent meditation retreat, the admins ended up sending the same document seven (!) times, just because new members kept joining the group and they had no way to access attachments that were previously sent to the group chat. Thankfully, WhatsApp is finally changing that.WhatsApp is finally adding a feature called Group Message History, which means that group admins and members can now choose to share recent messages with new members. Now, when adding new members to a WhatsApp group, you'll be able to let them access up to 100 recent messages already sent to the rest of the group chat, which should good enough to stop people from spamming the group with the same messages as new people are added.Speaking personally, this will be a great quality of life upgrade. In order to help new group chat members feel less lost, I've previously done everything from forwarding all relevant messages to them via DMs to sending screenshots of all our previous messages. All of this is incredibly tedious, and thankfully, I won't have to do it for much longer.\n\n    \n            \n            \n                                        Credit: WhatsApp\n                    \n    \nI also like the idea of limiting new group members to 100 recent messages or less. Quite often, my WhatsApp groups start off with a small number of people who know each other extremely well, and then the group expands to add acquaintances. The dynamics of the group chat change significantly when newer members are added, and not everyone feels comfortable with the idea of an unknown person seeing messages that were sent with a more intimate group in mind. Limiting chat history is a great move that allows people to maintain some privacy, as opposed to sharing the group's entire chat history with every new member.Still, if 100 messages seems like too much of an invasion of privacy to you, WhatsApp also says that admins will have the option to disable this feature for regular members. This way, only the admin will be able to share chat history with new members.\n            \n                What do you think so far?\n            \n        \nThe company says that everyone in the group chat will be notified when a new member is granted access to chat history, so you won't be blindsided if your new group member starts referring to in-jokes from a few days ago.WhatsApp says it is gradually rolling out this feature across the world, so you can expect it to be available on your device in the coming weeks.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WhatsApp Now Lets You Share Group Message History With New Members",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHXSKWWYE920PRBZMSCP5Z5Z/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-20T16:04:25.000Z",
      "dateModified": "2026-02-20T16:04:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Made an iPhone Camera App That Might Be Even Better Than Apple’s",
    "url": "https://lifehacker.com/tech/google-made-an-iphone-camera-app-that-might-be-even-better-than-apples?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHXGWR48HM73430XWWNK6NXF/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-20T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 20, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: OpturaDesign/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google just updated Snapseed for iPhone, adding a built-in camera to the app.\n                                            Snapseed's camera comes with manual controls that Apple's default camera is missing, like ISO and shutter speed.\n                                            The new camera also comes with retro camera filters, and Snapseed's native editing suite.\n                                            Interestingly, Google did not update Snapseed for Android with this built-in camera.\n                                    \n            \n    Table of Contents\n    \n        \n        Google acquired the excellent photo editor Snapseed back in 2012—not long after Apple had crowned it one of its apps of the year—and despite having plenty to offer and being completely free to use, it remains one of Google's lesser-known apps. That might be about to change. Snapseed's latest update for iOS, version 3.15.0, comes with a full camera app inside—and there's a case to be made that it's better than Apple's default Camera app. It certainly offers more in the way of manual shooting controls, with the added benefit of an entire integrated suite of editing features.Using Snapseed's built-in camera on iPhoneOnce you've installed or updated Snapseed to the latest version, you'll see the new camera icon up in the top right corner. While you can start your session by opening up an existing image as always, you can also opt to capture a new one by tapping here:\n    \n            \n            Look out for the new camera button in Snapseed.\n                                        Credit: Lifehacker\n                    \n    \nIf you want an easier way to launch the camera, you can add it to the Lock Screen: Press and hold on your iPhone's display when it's locked, tap \"Customize,\" then pick a shortcut spot and choose \"Camera\" under \"Snapseed.\" There's also a Control Center shortcut you can make use of, if you prefer. \nOnce you've swiped through the introductory spiel and given Snapseed access to your iPhone's camera, you'll need to pick one of the classic camera film presets to get started, though you can adjust the look of your shots afterwards. There are 11 different film simulations available—emulating film from Kodak, Fuji, Agfa, Polaroid, and Technicolor—and each one gives you slightly different variations in terms of color, contrast, texture, and tone. You can tap the film selector at the bottom of the camera interface (designed to look like a rewind button) to change at any time.\n    \n            \n            You've got some classic film styles to choose from.\n                                        Credit: Lifehacker\n                    \n    \nYour saved looks and edits are also included in the film selector, and can be used as preset filters for the images you're capturing. In the main image editor, after you've applied whatever adjustments you want to a photo, you can tap Looks > Add look to save it and access it through the camera.Up in the top left corner of the camera interface, you'll find a Pro toggle switch, which gives you some controls the default iPhone camera does not. You get three new settings on screen, for ISO, shutter speed, and focus, and you can change any of them by selecting a setting and using the dial underneath. You've also got controls for flash (left) and zoom (right). Besides the big shutter button, you have a camera swap button (lower right), a button for going back to your photo library (lower left), and a camera capture screen theme button (upper right). Tap on this to pick a different color scheme for the screen.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            Pro controls can be called up in a couple of taps.\n                                        Credit: Lifehacker\n                    \n    \nYou're not stuck with the look of any of the photos you shoot through Snapseed: All of the changes applied by your film preset, from exposure to curves, can be changed later on. Select your picture from the main library screen, then use the Faves and Tools tabs to make changes.Most filters and effects are applied by adjusting a slider underneath your image. The layers button (two squares) at the top gives you access to the current editing stack, and there's also an undo button to the left. When you're happy with what you've made, you're able to save over your existing image or make a copy.It's an interesting new addition to the selection of superb third-party camera apps available for the iPhone, and yet another alternative to the Apple default. Meanwhile, Android users are within their rights to feel left out by all this: Snapseed for Android hasn't been updated since May 2024, and lacks both the camera feature and the most recent editing interface revamp that are now available on iPhones.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Made an iPhone Camera App That Might Be Even Better Than Apple’s",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHXGWR48HM73430XWWNK6NXF/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-20T15:00:00.000Z",
      "dateModified": "2026-02-20T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft Is Now Testing a 'Built-In' Network Speed Test Tool in Windows 11",
    "url": "https://lifehacker.com/tech/microsoft-is-now-testing-a-built-in-network-speed-test-tool-in-windows?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHVXC9AJAX4XBJRCJ3MGVEKF/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-19T23:30:20.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 19, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: sdx15/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Microsoft is now testing a network speed test tool within Windows 11.\n                                            The tool is available in the network icon in the taskbar, but actually opens the existing Speedtest tool inside Bing.\n                                            Users can try it out now by enrolling their PCs in the Windows Insider program.\n                                    \n            \n    Table of Contents\n    \n        \n        When your internet isn't as fast as it should be, it can be helpful to check a network speed test tool. If the results are slower than expected, you'll know it's your network that's acting up. If it's performing well, perhaps it's the website in question, your web browser, or the device itself that's in need of a tune up. You have plenty of options across the internet to choose from, of course, but if you have a PC, you're about to get one built right into the OS—at least, in theory.As part of the latest Release Preview Channel update for Windows 11 Insiders, Microsoft rolled out a network speed test tool, though \"shortcut\" might be a more appropriate word. This shortcut isn't its own app; rather, you access it directly from the taskbar. You right-click the network icon, choose the \"Perform speed test\" option, and, subsequently, Windows fires up your browser. You'll see Bing load up—even if you have another search engine of choice as your default—where a simplified \"Internet speed test\" tool appears. While I wouldn't blame you for assuming this tool was a Microsoft creation, it's actually made by Speedtest, of speedtest.net fame. (Disclosure: Lifehacker's parent company, Ziff Davis, owns Speedtest.) As Tom's Hardware highlights, the integration itself isn't actually new, as Speedtest first started running a network speed tool within Bing back in December of 2023. The news now, of course, is that this tool is available as a shortcut within the Windows taskbar itself.    \nIt's a neat addition to Windows, and makes sense to include within the network icon in the taskbar, but something that actually runs natively on your PC would certainly be better. Maybe the convenience of quickly right-clicking the network icon whenever my internet was slow would win out, but I imagine I'd rather head to the full Speedtest tool, especially to avoid using Bing. \n            \n                What do you think so far?\n            \n        \nOther new features in this Release Preview Channel updateThis shortcut isn't the only thing new here. Microsoft also added new settings options that let you pan and tilt connected cameras. There are new emojis on the way, including face with bags under eyes and harp, and the Widget settings menu now takes up a full page. You can also now set .webp files as your desktop background, so you don't need to convert these images ahead of time.  You can try these features out now if you enroll in the Windows Insider program. While you run the risk of unstable software by enrolling your PC here, the Release Preview Channel is much less risky than the Dev or Beta channels, since the Releaser Preview Channel issues updates that have gone through more testing.   \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft Is Now Testing a 'Built-In' Network Speed Test Tool in Windows 11",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHVXC9AJAX4XBJRCJ3MGVEKF/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-19T23:30:20.000Z",
      "dateModified": "2026-02-19T23:30:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]