[
  {
    "title": "Google's Getting Rid of a Way to Import Third-Party Accounts Into Gmail",
    "url": "https://lifehacker.com/tech/gmail-ending-pop3-support-email-importing?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFPNQA250RDQZVEXF1CWENH/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T21:30:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Ascannio / Shutterstock\n                            \n            \n    ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Ascannio / Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is removing support for the POP3 protocol, which allows users to sync emails from third-party accounts into Gmail.\n                                            POP3 is an older standard of syncing emails, so it's not surprising that Google's disallowing it.\n                                            There are a couple of other ways to make sure you can still import emails from other accounts into Gmail., such as email forwarding and IMAP.\n                                    \n            \n    Table of Contents\n    \n        \n        If you've been running several email accounts through your Gmail, you might want to double-check your settings this month—that's because Google is ending support for the POP3 protocol that can sync emails from third-party accounts. And while there are some other solutions, they don't work quite the same.POP3 is an older standard of syncing emails between multiple accounts that allowed users to import emails from a third-party account and manage them in one spot. It's also a less secure method of transferring emails, so it's not a total surprise that Google is phasing it out, but the company hasn't broadcast the change too loudly, so it might come as a surprise to some users.How to keep your third-party accounts working in GmailIf you're still using POP3 to fetch your emails from a third-party account, there are a couple of ways to fix it before Google pulls the plug:\nForward emails from your other accounts. Rather than having Gmail reach out to your third-party accounts, you can set up automatic forwarding on the other end. How to do this will depend on which email providers you use, so check your third-party account settings for forwarding options.Use IMAP to check your email from the Gmail apps. In the Gmail app for Android and iOS, you can log into third-party email accounts that support IMAP connections.The IMAP protocol works a bit differently than POP3. While POP3 would import messages into your Gmail but leave the original, IMAP syncs between your accounts. So if you use the Gmail app to check your email and delete some messages, they'll be gone if you check the original account later.\n            \n                What do you think so far?\n            \n        \nGoogle's support doc says this change will take effect \"Starting January 2026\" with no more specific time frame. At time of writing, POP3 support is still working on my own email accounts, so it's not disabled just yet, but it's a good idea to update your email setup sooner rather than later.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google's Getting Rid of a Way to Import Third-Party Accounts Into Gmail",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFPNQA250RDQZVEXF1CWENH/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T21:30:00.000Z",
      "dateModified": "2026-01-08T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Turn on 'App Pinning' Before Letting Someone Else Use Your Android",
    "url": "https://lifehacker.com/tech/turn-on-app-pinning-before-letting-someone-else-use-your-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEAM64MC29Q85Y03VTPCQXCV/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T20:30:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images / Shutterstock.com\n                            \n    Table ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        There are likely occasions in your day-to-day life in which you allow someone else to use your phone, whether it's letting your kid play a game or sharing content with a friend. You may do this without thinking about the privacy implications and what might happen if another person has access to everything on your device and—accidentally or on purpose—uses it to view your search history, scroll through your photos, or send messages to your contacts. If you're an Android user, you should enable app pinning to keep others from snooping around your device. This feature keeps the user in the pinned app until you enter your PIN, pattern, or password. (On iOS, you can achieve a similar effect with Guided Access, which also allows you to set time limits and disable the keyboard and touch input.)To pin apps, you'll need to enable the feature in your phone's Settings app. To do so, go to Security or Security & location > Advanced > App pinning and toggle on Use app pinning and Ask for PIN before unpinning. \nBefore handing your phone over, open to the app screen you want to pin, then swipe up to the middle of the screen and hold to open your Overview. Tap the app's icon, then tap Pin. This will keep the user locked into that app until you unpin (using your PIN, pattern, or password). \n            \n                What do you think so far?\n            \n        \nDepending on your device navigation settings, there are a few ways to unpin an app: Gesture navigation: Swipe up and hold2-button navigation: Touch and hold Back + Home3-button navigation: Touch and hold Back + OverviewNote that pinning won't prevent someone from using the app fully, such as swiping through your photos or typing in the search bar, as Android doesn't have the option to disable touch. Pinned apps can also open other apps. At the very least, though, it keeps someone from having access to anything and everything on your device. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Turn on 'App Pinning' Before Letting Someone Else Use Your Android",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEAM64MC29Q85Y03VTPCQXCV/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T20:30:00.000Z",
      "dateModified": "2026-01-07T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: Anker Launched These 2-in-1 Earbuds, and They’re Already on Sale",
    "url": "https://lifehacker.com/tech/anker-launched-these-2-in-1-earbuds-at-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEA53B9JCPQMZBE1YXV40VQB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-06T18:00:11.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Soundcore\n                            \n    Table of Contents\n    \n    ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Soundcore\n                            \n    Table of Contents\n    \n        \n        Anker launched a pair of \"2-in-1\" earbuds under its Soundcore brand at CES 2026, and it has a unique feature: They can be worn in two ways by adjusting the ear hooks. When you want active noise cancellation, you can wear it in-ear, and when you don't, you can adjust the hooks for an open-ear design. This quirky product is called the Soundcore Aerofit 2 Pro—and you can already buy it for $150, which includes a launch discount of $30.When it comes to CES announcements, I'm always wary of vaporware, aka products that are announced but never shipped. That's why I keep an eye out for products with a shorter launch window so you can actually get your hands on the things you're excited about. The Soundcore Aerofit 2 Pro is one of those products. As Anker itself admits on the product page, the Aerofit 2 Pro isn't for everyone. The biggest quirk of this product is its size. It's a lot bigger than most ANC earbuds, and the ear hooks go all the way around your ears, which isn't a fit that works for everyone. The charging case is also quite large, when compared with other ANC earbuds: It's 4.23 inches (11cm) wide, and it supports wireless charging. \n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Soundcore\n                    \n    \nMost noise-cancelling headphones let you switch to a listening mode that allows ambient sounds via software, but the Aerofit 2 Pro lets you do this by physically twisting the earbuds. This adjustment seems quite seamless based on the demo video on the product page, but I haven't tested it in-person, so I'll reserve my judgment until I do. There are five levels of adjustment for the ear hooks, with levels 1 and 2 reserved for open-ear listening, and 4 and 5 for noise cancellation. Level 3 maintains your previous listening mode to prevent accidentally switching to a different mode.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: Anker Launched These 2-in-1 Earbuds, and They’re Already on Sale",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEA53B9JCPQMZBE1YXV40VQB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-06T18:00:11.000Z",
      "dateModified": "2026-01-06T18:00:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Turn on This Setting to Protect Your Privacy When Letting Someone Else Use Your iPhone",
    "url": "https://lifehacker.com/tech/lock-down-iphone-when-letting-someone-else-use-it?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KE7H3DN05JEN7QAZGJHT1NS5/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-05T18:00:11.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: lilgrapher / Shutterstock.com\n                            \n    Table of Content",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: lilgrapher / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Your phone is a one-stop shop for a lot of your personal information, from day-to-day activities logged in your calendar and email to financial data accessed via banking apps. If you let someone else use your device—whether you're showing a friend a collection of photos or allowing a stranger to make an emergency call—there's a lot you don't want them to be able to see. If you're an iPhone user, there are several features you can enable to prevent others from snooping around your device. Use Guided AccessIf you don't want someone using your device to see anything else on it, you can turn on Guided Access, which limits them to a single app (such as Phone or Photos). This essentially locks down your screen and prevents navigation outside of the specific features you make available. \nFirst, go to Settings > Accessibility > Guided Access and toggle the feature on. Tap Passcode Settings to set up a specific passcode or flip the Face ID toggle to use biometrics to end Guided Access sessions. To start a Guided Access session before handing over your phone, open the app and triple click the side button. You can circle specific areas of the screen you don't want to respond to touch (such as swipes through Photos). Tap Session Settings at the bottom to set a time limit, disable the keyboard, and manage button press options. Then tap Start. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nTo end a Guided Access session, triple-click the side button and enter your passcode or double-click and authenticate with Face ID. \n            \n                What do you think so far?\n            \n        \nYou can also lock or hide specific appsSome mobile apps, like financial apps and password managers, already require you to log in or authenticate with your username and password combo or device biometrics every time you open them. You can also lock down other individual apps on iPhone so Face ID, Touch ID, or a passcode is required for access. To lock an app from your home screen, touch and hold the icon until the quick actions menu appears, then tap Require Face ID. Alternatively, you can hide apps so others cannot see them on your device (let alone open them) unless you authenticate using Face ID, Touch ID or a passcode. To hide an app, tap and hold the icon on the home screen and tap Require Face ID in the quick actions menu. Tap Hide and Require Face ID > Hide App. If you need to open a hidden app, swipe left on your home screen to reach your App Library, locate the Hidden folder at the bottom, and tap and authenticate to unlock the folder followed by the app. (Note that some native iOS apps, including Calculator, Camera, Clock, Contacts, Find My, Maps, Shortcuts, and Settings, cannot be locked, and system apps that come preinstalled cannot be hidden.)\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Turn on This Setting to Protect Your Privacy When Letting Someone Else Use Your iPhone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KE7H3DN05JEN7QAZGJHT1NS5/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-05T18:00:11.000Z",
      "dateModified": "2026-01-05T18:00:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why I Won't Be Giving ChatGPT Health My Medical Records",
    "url": "https://lifehacker.com/tech/dont-give-chatgpt-health-your-medical-records?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFGNJDCMT3JTWC4A7YNJXZ3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T20:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: OpenAI\n                            \n            \n                Key T",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: OpenAI\n                            \n            \n                Key Takeaways\n                                            ChatGPT Health is a sandboxed tab for conversations about your health, including medical records.\n                                            OpenAI says it's \"not intended for diagnosis or treatment.\"\n                                            LLMs' unreliability, as well as privacy and security concerns, mean using ChatGPT Health might be unwise.\n                                    \n            \n    Table of Contents\n    \n        \n        This week, OpenAI announced its new ChatGPT Health feature, which will let users upload their medical records and ask health related questions. However, I certainly won't be making use of it, it might not be the best idea for you to do it either, for both reliability and privacy reasons. The new ChatGPT Health feature will be a sandboxed tab inside the app that is isolated from your conversation history in other conversations with the chatbot. This tab also allows users to connect a variety of health-tracking apps like Apple Health, MyFitnessPal, and Peloton, as well as uploading medical records directly.\n    \n            \n            \n                                        Credit: OpenAI\n                    \n    \nIt's important to note that this is a lot of really personal information to hand over to any tech company—but especially one that isn't primarily focused on providing medical services. OpenAI says that the ChatGPT Health space operates with \"enhanced privacy to protect sensitive data,\" but it doesn't use end-to-end encryption to secure that data. And while the company says data collected via Health isn't used to train its foundation models, it's impossible to know whether that may change in the future. Security breaches can also occur (and have in the past), potentially leaving your medical records exposed.\nThere's also the question of whether the risk of uploading your data is worth it in the first place. According to OpenAI's own data, around 5% of all messages to ChatGPT are already users asking questions about their health, and ChatGPT (and other LLM tools) have a nasty habit of providing inaccurate diagnostic information. This is perhaps why OpenAI says that its new ChatGPT Health feature is \"not intended for diagnosis or treatment.\"\n            \n                What do you think so far?\n            \n        \nCurrently, there's a waitlist to sign up for ChatGPT Health, and over time it will roll out to all users. At the very least, that means that until the feature is available, it's probably a good idea not to ask the regular version of ChatGPT about your health concerns. At the very least, wait until the enhanced privacy sandbox is available. In the meantime, consider whether it makes more sense to just talk to your doctor directly if you have questions or concerns about your health.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why I Won't Be Giving ChatGPT Health My Medical Records",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFGNJDCMT3JTWC4A7YNJXZ3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T20:00:00.000Z",
      "dateModified": "2026-01-08T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Free Script Disables Every AI Feature in Windows 11",
    "url": "https://lifehacker.com/tech/this-script-disables-all-the-ai-features-in-windows-11?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KED0B1D345J0CD6WR4GPNT45/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T22:00:00.000Z",
    "description": "\n        \n        Some people love AI. If you're not one of them (or if you have a favorite AI tool that isn't baked into it), using Windows 11 can fe",
    "body": "\n        \n        Some people love AI. If you're not one of them (or if you have a favorite AI tool that isn't baked into it), using Windows 11 can feel increasingly hostile. It seems like every part of it now exists to push you into using Copilot—even notepad.exe has a prominent AI button in the user interface at this point.If you'd like your operating system to go back to being an operating system, check out RemoveWindowsAI. This free script changes various registry keys to disable AI features including Copilot, Recall, and the Copilot integrations in applications including Edge, Paint, and Notepad. Using various workarounds , it then configures Windows Update to not install those updates again (the documentation breaks the process down, if you're interested).How to run RemoveWindowsAI on your machineTo get started you need to open Microsoft PowerShell on your computer. Make sure you're using Windows PowerShell 5.1, and not the updated PowerShell 7 (this only really applies if you've intentionally installed PowerShell 7, so don't worry about this step if you didn't actively do that).\nTo start the script you will need to copy a command from the Github page for RemoveWindowsAI and paste it into your PowerShell window (I'm not including the command directly here in case it changes in the future). Once you do, the user interface will show up, allowing you to choose which AI features you want to disable. Make your choices and watch the changes take place in the PowerShell window.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nI tried this out, removing everything. I then opened Notepad—no Copilot icon in sight. The Copilot application was also gone, along with all reference to AI in the Settings application. It would be nice if Microsoft offered a way to do this without resorting to this sort of unofficial workaround, but that isn't the world we live in.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Free Script Disables Every AI Feature in Windows 11",
      "image": [
        "https://lifehacker.com/imagery/articles/01KED0B1D345J0CD6WR4GPNT45/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T22:00:00.000Z",
      "dateModified": "2026-01-07T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: WheelMove Turns Any Standard Wheelchair Into an Electric One",
    "url": "https://lifehacker.com/tech/wheelmove-turns-any-standard-wheelchair-into-an-electric-one-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KECWJ1KMA6BK7YYFE7P8M6FM/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T18:58:46.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: WheelMove\n                            \n            \n                Ke",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: WheelMove\n                            \n            \n                Key Takeaways\n                                            Standard wheelchairs are less capable than electric ones.\n                                            WheelMove is a portable wheelchair attachment that turns any standard wheelchair into an electric one.\n                                            WheelMove is a finalist for the official Best of CES 2026 awards.\n                                    \n            \n    Table of Contents\n    \n        \n        Wheelchairs are available at airports, hotels, resorts, theme parks, and on cruises, but standard wheelchairs require ongoing effort and can struggle through difficult terrain. Standard wheelchairs are simply less capable than electric ones. WheelMove wants to change that. WheelMove is a portable wheelchair attachment that turns any standard wheelchair into an electric one, allowing people to travel more easily wherever they are. It debuted at CES 2026, marking a significant leap in accessibility for wheelchair users who travel. When I found WheelMove at CES \"Unveiled,\" I thought back to a recent family trip just two weeks ago, where two of my older family members often rented wheelchairs. They don't use wheelchairs in their day-to-day lives, but walking through a theme park all day wasn't possible. They needed support navigating the park, and the rest of us gladly took shifts pushing their wheelchairs. With a portable attachment like WheelMove, though, wheelchair users can use less effort and enjoy more independence through the battery-powered, remote-controlled attachment. \n\n    \n            \n            \n                                        Credit: Iyaz Akhtar\n                    \n    \nRiders simply attach WheelMove to the front of any standard wheelchair, and the device lifts the wheelchair's smaller front wheels off the ground. Once attached, the rider controls the WheelMove through a basic remote control on their armrest, thigh, or wherever is most comfortable. The attachment weighs under 20 pounds, including its 10-inch wheel, 250W motor, and a battery that goes about 15 miles on a charge. Carrying an additional battery can double its range before needing to recharge, and it can navigate terrains including gravel, grass, and uneven surfaces like cobblestone. \n            \n                What do you think so far?\n            \n        \nWheelMove is an incredibly innovative assistive technology poised to broaden personal mobility for those who need it, and it's also one of the finalists for the official Best of CES 2026 awards for the travel category. Pre-orders are available in France where the start-up is based, but the founders plan to expand internationally later this year. It costs about €5,000 or $6,000. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: WheelMove Turns Any Standard Wheelchair Into an Electric One",
      "image": [
        "https://lifehacker.com/imagery/articles/01KECWJ1KMA6BK7YYFE7P8M6FM/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T18:58:46.000Z",
      "dateModified": "2026-01-07T18:58:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: 'Rescue Retriever' Wants to Help Firefighters Save Your Pets",
    "url": "https://lifehacker.com/tech/ces-2026-rescue-retriever-helps-firefighters-find-your-pets-in-a-fire?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEA2ETSJ8VCY2BJHDXNGDQC6/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-06T16:55:02.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Lifehacker\n         ",
    "body": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Lifehacker\n                            \n            \n                Key Takeaways\n                                            Rescue Retriever makes light-up devices to help firefighters locate your pets in the event of a fire.\n                                            The company's flagship product is a silent smoke detector with a strobe light that kicks in when it detects smoke.\n                                            Their upcoming product is a tag for your pet's collar that syncs with the smoke detector, and lights up in tandem.\n                                    \n            \n    Table of Contents\n    \n        \n        No pet owner wants to think about what might happen to their animal friend in the event of a fire. As a dog owner, I know I don't. But fires do happen, and pets can't follow your family fire plan. Rescue Retriever wants to change that. I spoke with the company during CES' Pepcom event, and learned how it's working to make it easier for firefighters to find your pets in the event of a fire. (Rescue Retriever first launched back in March of 2024. The company was started by two brothers—one of whom is a former firefighter.)During a fire, pets tend to run to where they feel safe—maybe that's under the bed, or somewhere tucked away in a room. That makes it difficult for firefighters to locate pets during an emergency: In a situation where seconds count, they don't have the ability to search every corner of a burning home. Unfortunately, as a result, pets sometimes don't make it out. Rescue Retriever wants to change that.Rescue Retriever's smoke detector is installed near your pet's safe spaceIn an attempt to solve that problem, Rescue Retriever's smoke detector works a bit differently. It isn't supposed to be placed where your current smoke detector is; rather, the idea is to place it where your pet is most likely to go when scared. If you know they like to hide under your bed, for example, you can place the detector there. Once the device detects smoke during a fire, a bright light begins to strobe inside, spread out by a mix of holes placed throughout the device. (Even under the bright lights of Pepcom, the strobe looked intense to me.) That way, firefighters can look out for the strobing lights when trying to locate pets in your home. There's even an accompanying sticker you can place on your home's window, so firefighters know you have a pet to look out for.\n\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe device is silent, so as to not scare your pets away from their hiding space. It wouldn't do any good to have a beacon for firefighters to locate your pet, only to have them scurry off because of an alarm. The Rescue Retriever Fire Tag lights up in an emergency\n    \n            \n            \n                                        Credit: Lifehacker\n                    \n    \nNew from the company this year is the Fire Tag, which brings the strobe light from the main unit to a small tag you can place on your pet's collar. The tag syncs up to the main unit using RFID. When the main unit detect smoke and starts strobing, the Fire Tag will pick up the signal and follow suit. \n            \n                What do you think so far?\n            \n        \nIt's great that the main unit doesn't make a noise to scare your dog, but that doesn't guarantee they will go to the spot where the smoke alarm is installed—maybe the house smoke alarm scares them again or they don't follow their usual pattern and hide somewhere away from where you placed the main unit. Having a Fire Tag on their collar would give firefighters a better shot at locating the pet, wherever they may be in the home. Rescue Retriever tells me these tags have a range of up to a quarter mile, so if your dog runs away from your house, their collar might still light up. Even still, the Fire Tag opens up, allowing you to place a tracker like an AirTag inside, so if your dog runs out of that quarter mile range, you can still track them if they come within Bluetooth range of a device within the Find My network.  Rescue Retriever says the Fire Tag is ready for production, and, when available, can be purchased either individually ($29.99), or as part of a larger bundle with the main Rescue Retriever unit ($89.99). The main unit can be purchased now for $39.99, but it also comes in bundles with accessories for varying prices.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: 'Rescue Retriever' Wants to Help Firefighters Save Your Pets",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEA2ETSJ8VCY2BJHDXNGDQC6/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-06T16:55:02.000Z",
      "dateModified": "2026-01-06T16:55:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: Hisense Just Announced the RGB MiniLED Evo",
    "url": "https://lifehacker.com/tech/hisense-announced-rgb-miniled-evo-at-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KE7HWMFH59T0AC4YAWS4WV97/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-05T19:19:03.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Lifehacker\n                            \n            \n                Key Takeaw",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Lifehacker\n                            \n            \n                Key Takeaways\n                                            Hisense's keynote for CES 2026 largely focused on RGB MiniLED evo, the company's latest RGB MiniLED technology.\n                                            RGB MiniLED evo can reproduce more accurate colors than RGB MiniLED, and displays shows and movies closer to the intent of the original creators.\n                                            These new displays can also be used as professional reference monitors, for users who also work with colors for film and TV.\n                                            In addition, Hisense announced a new projector, a new MicroLED TV, and integration with both Copilot and Xbox Cloud Gaming for its TVs.\n                                    \n            \n    Table of Contents\n    \n        \n        Hisense is all about TVs at this year's CES—specifically, how those TVs display color. If the company's keynote is any indication, Hisense is extremely invested in leading the charge in color reproduction. Though its tagline this year is \"Innovating a Brighter Life,\" the pitch is less on how bright their TVs are, and more on how true to life their colors are, especially when it comes to accurately displaying the filmmakers' original intent. Will consumers buy a TV because their favorite movie looks a bit more how the director intended it to be? I'm not sure. But that's largely the idea behind Hisense's new RGB MiniLED Evo.  \n    \n            \n            \n                                        Credit: Lifehacker\n                    \n    \nHisense's biggest announcement of the day is its RGB MiniLED Evo. This iteration of the company's RGB MiniLED technology comes with three key upgrades: First, there's the \"Chromagic\" precision backlight. The company says this technology helps avoid color bleeding and tint shifting when watching content. It also boosts the colors offered by existing RGB MiniLED technology: Hisense says this new standard can display 110% of the BT.2020 color gamut with four-primary colors (red, green, blue, and sky blue, or cyan), while RGB MiniLED can achieve 100% BT.2020 with the standard three primary colors. The company says Evo also comes with AI-powered RGB color dimming with \"134 bit precision.\"Second, RGB MiniLED Evo has a \"Hi-View AI engine,\" to sync color across the TV's backlight. This engine comes with a three-core RISC CPU and a 2TOPS NPU for AI processing. Hisense claims the chip provides a 40% boost in computing performance, a 70% improvement in scenario recognition computing power, and 100% upgrade in scenario adaption computing capability. The company says the RGB MiniLED Evo can help display shows and movies as the original creators intended them to look. Hisense compared it to OLED, which it says displays content with too little brightness, and QD MiniLED, which it says compromises the color by being too bright.\nHisense's RGB MiniLED—not necessarily just Evo—also supposedly cuts down on blue light. Hisense says its new display tech emits 60% \"less harmful\" blue light than QD OLED, though the science doesn't necessarily support the claims that blue light is any worse for you than other light colors. The company also says RGB MiniLED is 30% more energy-efficient than QD OLED, though it didn't include any references to back up those claims in the keynote. Finally, Evo comes with an AI calibration feature, which Hisense touts as a way for users to turn their TVs into professional reference monitors. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe company says RGB MiniLED evo is coming to its product lineup, including the U8, UX, U9, and U7 series, this year.\n            \n                What do you think so far?\n            \n        \nOther Hisense announcements at CES 2026\n    \n            \n            \n                                        Credit: Lifehacker\n                    \n    \nWhile the RGB MiniLED Evo was undoubtedly Hisense's biggest announcement this year, the company also ran through some other news at the keynote. First, there's the XR10, a new projector that can reach up to 300 inches. It comes with liquid cooling, lens shift supporting a 4K projection, and 6,000 lumens of brightness. Hisense also announced the MXS MicroLED TV, which can scale up to 163 inches. Despite devoting only a moment to the TV, the company says the MXS won an CES 2026 Innovation Award. Hisense also made some announcements about its TV OS, including features like weather, calendar, and integrations with other smart home devices. But perhaps most notably, Hisense announced a partnership with Microsoft to bring both Copilot and Xbox Cloud Gaming to its TVs. That's pretty big news.      Finally, if you're both a Hisense and a FIFA fan, you can buy products from the \"Hisense Elite Collection,\" which are designed specifically for the 2026 FIFA World Cup. I'm not sure how big that crossover is, nor do I think I'd buy a TV because it was made for one soccer event, but it was part of Hisense's announcement. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: Hisense Just Announced the RGB MiniLED Evo",
      "image": [
        "https://lifehacker.com/imagery/articles/01KE7HWMFH59T0AC4YAWS4WV97/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-05T19:19:03.000Z",
      "dateModified": "2026-01-05T19:19:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "That Grubhub Bitcoin Email Is a Scam",
    "url": "https://lifehacker.com/money/grubhub-bitcoin-email-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDPB8KZSCNR1QX8Q9JQ4RMPY/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-30T15:00:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: BestStockFoto/Shutterstock \n                            \n            \n         ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: BestStockFoto/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Scammers are impersonating Grubhub to promote a crypto rewards scam.\n                                            Emails were sent from addresses on a legitimate Grubhub subdomain.\n                                            Grubhub is not actually doling out $10,000 in bitcoin.\n                                    \n            \n    Table of Contents\n    \n        \n        Some Grubhub users have received a tempting email offer from the food delivery service: Send $1,000 in bitcoin to a specified wallet, and get 10 times that amount back. Unfortunately, this is very much a scam.  As BleepingComputer reports, these promo emails were sent from addresses on b.grubhub.com, a legitimate Grubhub subdomain, so they appear verified in recipients' inboxes. Two examples of senders include [email protected] and [email protected]. Beyond that, there are some pretty clear red flags. The subject line reads \"30 minutes left - We'll 10x your Bitcoin!\" to promote a sense of urgency and an offer too good to be true (but also too good to ignore). The body includes the recipient's name and instructions on how to participate in Grubhub's \"Holiday Crypto Promotion\" with a bitcoin wallet address. \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nWhile Grubhub has acknowledged the problem, they haven't released any details as to what facilitated attackers sending emails using a company address. The company did suffer a major security breach earlier this year, resulting in the leak of some user data (including names and email addresses). \n            \n                What do you think so far?\n            \n        \nThere are several varieties of the crypto reward scamThe Grubhub email promotion is a pretty typical example of a cryptocurrency scam. The Federal Trade Commission outlines several variants, including get-rich-quick schemes guaranteeing big returns on your investment and celebrity-promoted \"giveaways\" that claim to multiply any funds you send.If you fall for crypto fraud, there's no way to track or get your money back, and even if victims are few and far between, scammers can score big paydays. That's why you should be especially wary of anything and everything requiring a crypto transaction, especially if the offer sounds urgent or provokes a sense of either excitement or fear. And remember that no legitimate organization—government agency, law enforcement official, utility company, or prize promoter—will ever ask for payments in cryptocurrency.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "That Grubhub Bitcoin Email Is a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDPB8KZSCNR1QX8Q9JQ4RMPY/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-30T15:00:00.000Z",
      "dateModified": "2025-12-30T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gmail Is Getting AI-Powered Search and Proofreading Features",
    "url": "https://lifehacker.com/tech/gmail-is-getting-personalized-ai-features?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEF67A86X7T9DJ2P23DNQG6F/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T17:30:55.000Z",
    "description": "\n        \n        Google is adding a slate of AI features to Gmail that could save some of the hassle of searching for important information buried in",
    "body": "\n        \n        Google is adding a slate of AI features to Gmail that could save some of the hassle of searching for important information buried in messages and threads. Many users will soon see a more personalized inbox with AI-powered suggestions, summaries, and proofreading support. Plus, some AI functionality that was previously available only to paid subscribers will be rolling out to all Gmail users, including Help Me Write, AI Overviews for threaded emails, and Suggested Replies. See personalized, AI-powered snapshots Gmail users will soon have an AI Inbox view with two sections. \"Suggested to-dos\" will show immediate action items found in your inbox, such as bills to be paid and appointments to be confirmed. The task will be bolded and followed by a summary and a link to the relevant email or thread. Below that, \"Topics to catch up on\" includes items that are less urgent (but still important), such as order status and event updates.AI Inbox is an optional toggle in the Gmail side panel. You won't see it immediately, though—the feature is being made available to those in Google's Trusted Tester program before launching for users more broadly \"in the coming months.\" \nGet AI Overviews via Gmail searchGoogle AI Pro and Ultra subscribers will also be able to get AI Overviews from natural language questions typed into the Gmail search bar (just like a Google search). Instead of a running standard keyword search and clicking through multiple message threads, you'll be able to ask things like “Who was the plumber that gave me a quote for the bathroom renovation last year?” and get a detailed summary of information pulled from emails in your inbox. The response will also provide citations to specific threads. \n            \n                What do you think so far?\n            \n        \nAI will proofread your emailsFinally, Gmail will have a built-in, AI-powered proofreading feature that will check grammar, tone, and style and analyze your emails for clarity and structure. Similar to third-party tools like Grammarly, you'll see one-click suggestions for fixing typos, simplifying sentence structure, selecting improving word choice, and making writing more concise. Like AI Overviews, Proofread will be limited to paid subscribers. Note that these AI features are optional and can be disabled, and Google says it does not use personal information or content to train its AI models. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gmail Is Getting AI-Powered Search and Proofreading Features",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEF67A86X7T9DJ2P23DNQG6F/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T17:30:55.000Z",
      "dateModified": "2026-01-08T17:30:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: You Can Chain 100 of These Ikea Bluetooth Speakers Together",
    "url": "https://lifehacker.com/tech/ces-2026-chain-up-to-100-ikeas-bluetooth-speakers-together?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KECNBP0N5XH5CM568DVVBBVS/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T18:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Ikea\n                            \n            \n                Key Tak",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Ikea\n                            \n            \n                Key Takeaways\n                                            Ikea showed off the Kallsup Bluetooth speaker, which will cost just $10 in the U.S.\n                                            Ikea is claiming that you can chain up to 100 of them together.\n                                            This product is expected to ship in April 2026.\n                                    \n            \n    Table of Contents\n    \n        \n        At CES 2026, Swedish furniture giant Ikea showed off its new Kallsup Bluetooth speaker, which will cost just $10 in the U.S. Normally, I'd be skeptical of any speaker this cheap, but the Kallsup grabbed my attention for a few reasons—chief among them that Ikea says you can chain up to 100 of them together to create the multi-speaker setup of your dreams. That aside, the hardware seems pretty basic: The speaker has a USB-C port at the back, and two buttons up top (play/pause, and pair).Chaining together Bluetooth speakers is nothing new, but this is the first time I'm seeing the ability to pair as many as 100 of them. The only reason this use case is even remotely plausible is the pricing: As reported by The Verge, the Kallsup Bluetooth speaker will be priced at $10 in the U.S. and €5 (roughly $6) in Europe, which means you can buy 10 of them for the same price as one HomePod mini. The Verge also says  that once you pair one of them to your phone (the company promises Bluetooth 5.3 support), you can add more to the chain with a two-button sequence. \n            \n                What do you think so far?\n            \n        \nDesign-wise, the speakers are cubical and colorful, which I'm a fan of (at the moment, Ikea is showing them off  in white, green, and pink). But how do they sound? Well, Gizmodo says that while they are loud, they don't deliver much in the way of bass. I'd love to get a couple to judge for myself before committing to chaining a few dozen of them together, but I definitely  admire Ikea's big swing here. That said, while CES is the place to grab attention with out-there ideas, and I am struggling to find a use case for chaining 100 Bluetooth speakers together. Maybe if you're an amusement park owner and you want the cheapest possible audio setup for a haunted house? Likely most people will be content with a more reasonable number of them, spread around the house.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: You Can Chain 100 of These Ikea Bluetooth Speakers Together",
      "image": [
        "https://lifehacker.com/imagery/articles/01KECNBP0N5XH5CM568DVVBBVS/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T18:00:00.000Z",
      "dateModified": "2026-01-07T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use RICE to Prioritize Your To-Dos",
    "url": "https://lifehacker.com/work/rice-productivity-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFJR3ZWQH0A6B699J70YS00/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T20:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Kaspars Grinvalds / Shutterstock\n                            \n    Table of Cont",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Kaspars Grinvalds / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Whenever you have a bunch of looming tasks—as many of us do at the start of the new year, when everyone actually \"circles back\" on the things we've been putting off—having a structured to-do list is an essential part of getting everything done. Determining what goes on that list and in what order, though, is a task all its own. I've covered a lot of ways to do that, but if you're stuck with a high volume of important responsibilities, you need an approach that matches the complexity of what you're trying to do—and that's where the RICE method comes into play.What is the RICE method of prioritization?RICE, as you probably guessed, is an acronym. Here's what it stands for: Reach: How many people or parts of your life or project this task will impactImpact: How meaningful that impact will be if and when it's done correctlyConfidence: How sure you are about your estimates of the other three factorsEffort: The time, energy, knowledge, and resources requiredA unique combination of those factors is going to give you guidance on which tasks are the most crucial to prioritize, which is helpful when you're overloaded by information and dread, unable to think about when or where to get started. \nHow and when to use RICEI won't lie to you: This method is more convoluted than some of the others I've covered in the past. I might even recommend trying a simpler prioritization technique, like the Eisenhower matrix, before you try this one and only whip this out if Eisenhower or its peers aren't given you solid results. RICE takes a little time—and that's because you need to do some math. \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nStart by writing down all your tasks. Under each, you're assigning numbers. The Reach score will be the number of people or parts of your life or project that the task will impact and the Impact score is a 3 (massive impact), 2 (high), 1 (medium), .5 (low), or .25 (minimal impact). Confidence should be a 100, 80, or 50, to represent the percentage of confidence you feel in your estimates and abilities. You can use any number between 0 and 100, but falling back on those three just makes it easier. Most adherents of this method use a complicated math equation (determining \"person-months\") for Effort, but I'm going to simplify that for you. Score it the same way you scored Impact, with a 3 for multiple days or resources, 2 for a day, 1 for half a day, .5 for an hour, and .25 for a half an hour or less. You can also score Reach that way if you're working on a personal project and your results won't necessarily reach a big number of people. In that case, think about the different areas of your life or personal goals it will affect and use that 3-to-.25 scale. \n            \n                What do you think so far?\n            \n        \nThat part is all subjective, similar to using the ABCDE method to assign grades to your to-dos. It can't be avoided—you won't know the true resources required or reach of the project until it's done—but you can quantify it a bit. Next, you do math. It's R x I x C divided by E. You'll end up with a numerical score for each task. Rank the tasks in descending order, with the biggest numbers first. Obviously, you may find that some can't be completed until others are done, so use your discretion there, but for the most part, you've just created a clear outline of which things will have the biggest impact and reach and you can at least know where to start. Add each into your calendar using time boxing and time blocking, then get after it. Knowing you have a plan of attack is half the motivational battle.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use RICE to Prioritize Your To-Dos",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFJR3ZWQH0A6B699J70YS00/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T20:30:00.000Z",
      "dateModified": "2026-01-08T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Garmin Now Has Nutrition Tracking (for a Price)",
    "url": "https://lifehacker.com/health/ces-2026-garmin-nutrition-tracking?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEF6RVC50TV4SEERBJYE7S1E/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T17:00:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Beth Skawrecki\n     ",
    "body": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Beth Skawrecki\n                            \n            \n                Key Takeaways\n                                            Nutrition logging is now available in the Garmin Connect app, as a subscription feature.\n                                            You can log meals by photo, barcode, or search.\n                                            A watch app or widget can show your calories or allow quick logging from the wrist.\n                                    \n            \n    Table of Contents\n    \n        \n        Garmin, maker of fitness watches (among other things), announced this week that the subscription tier of the Garmin Connect app will now include nutrition tracking. According to the company, the app can identify foods based on a photo, and can set your calorie targets based on your activity data. Garmin announced this feature during CES 2026, although a new feature announcement isn't exactly traditional CES fare—I was hoping it would show off a new watch. Still, I did get a chance to try out the feature on my own phone (and watch), and thought it worked well. How Garmin Connect+'s nutrition logging works\n    \n            \n            \n                                        Credit: Screenshots by Beth Skawrecki\n                    \n    \nGarmin’s nutrition logging is pretty similar to the nutrition logging features on other apps, including my fave free app Cronometer. Identifying food items from a photo is a common feature, but it’s often locked behind a premium tier—which finally makes Garmin’s $6.99/month Connect+ subscription start to make sense. If you were going to pay for a premium nutrition app anyway, or if you already subscribe to one, you can consolidate those subscriptions by only paying for Garmin. \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nIf you currently have MyFitnessPal linked to Garmin, you may get a message saying that it’s been disabled. This connection still works, but you can’t use both that and the new nutrition feature—Garmin Connect needs to have one source for nutrition information. \n            \n                What do you think so far?\n            \n        \nOne nice thing about doing your nutrition in Garmin Connect rather than another app is that the setup process uses your activity history to help you pick a calorie target. This way you don’t have to guess whether you’re “moderately active” versus “lightly active.” Calorie estimates from fitness apps are never totally accurate, but they tend to be a pretty good starting place if you have no idea what number to pick. The nutrition feature also allows you to view your calories from your watch, and to log favorite or recent foods. (For a full search, you'll still need to use the app.) This watch feature is available natively on newer watches, and through a ConnectIQ app for slightly older watches—the Forerunner 255 and Fenix 6 are covered with the latter app.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Garmin Now Has Nutrition Tracking (for a Price)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEF6RVC50TV4SEERBJYE7S1E/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T17:00:00.000Z",
      "dateModified": "2026-01-08T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Radar-Equipped Stove Shutoff Is One of the Most Practical Things I Saw at CES",
    "url": "https://lifehacker.com/health/ces-2026-iguard?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEB8T7SSSYM9GPVDTEQ7MWC8/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-07T03:52:38.000Z",
    "description": "We may earn a commission from links on this page.\n    The iGuardStove is the little black box in the middle of the photo. It can connect to your regul",
    "body": "We may earn a commission from links on this page.\n    The iGuardStove is the little black box in the middle of the photo. It can connect to your regular stove, whether gas or electric.\n                                                    Credit: Beth Skwarecki\n                            \n        \n        Radar-based sensors seem to be having a moment at CES, especially in tech meant for people to keep tabs on their aging family members. One product in particular caught my eye because it’s focused on a single important function—preventing kitchen fires caused by a person wandering away from the stove. iGuard is essentially a smart shutoff for a stove or cooktop. Its new, radar-equipped version costs $399 and can work on gas or electric stoves. (For gas, you’ll need to have a plumber install a shutoff valve.) If you leave the kitchen while cooking, a five-minute timer starts. If you don’t return by the time it goes off, the device either cuts the power to your electric stove, or shuts off the supply line to your gas stove. It can also notify a caregiver that a shutoff event occurred.Why this is aging-in-place techA big theme in smart tech this year is aging-in-place. Most older adults would prefer to live at home as long as they can, but health challenges can make that difficult. When it comes to cooking or other activities that require a sharp mind, mental health issues like dementia come into play, as do medications that can have cognitive side effects. With all that in mind, caregivers often worry about a parent leaving the kitchen while cooking, forgetting that the stove is on. \nThe National Fire Protection Association reports that cooking fires are the top cause of home fires, the top cause of fire-related injuries, and the number three cause of fire-related deaths. Unattended cooking equipment causes half of those deaths. Older adults are overrepresented as fire casualties compared to younger and middle-aged people.The device has a five-minute timer, specifically, because that was a safety margin the company developed with safety organization UL, chief marketing officer Jon Landers told me. You can also override the five-minute timer if you’re roasting a turkey or preparing a slow-simmered sauce. In this case you tell the device how long the food is expected to cook, and it lets this cook time complete before resetting to the usual five-minute timer behavior.Why radar is involvedA previous version, called the iGuardStove, used motion detectors, but if you’ve ever worked in an office that had lights on motion sensors, you know why that wasn’t a great solution: sit still at a table for too long, and the lights go off. The older version of the device could potentially shut off while you're just waiting for your dinner to cook, and could be triggered by motion from pets. Radar solves those problems, since it can more accurately identify when a person is in the room.I’ve been seeing radar in a number of aging-in-place products at CES this year. The Silver Shield from PontoSense uses radar to monitor a person’s presence and movement in a room, reporting movement and potential falls to a caregiver’s app. Luna, a conversation and reminder device from Cairns Health, includes radar that can monitor heart rate and breathing (even through blankets!) when positioned near a person’s bed. The iGuard has some monitoring features in common with those devices, but it stays focused on its main task of ensuring stoves aren’t left running unattended. \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nRadar can “see” a lot, but it doesn’t feel quite as privacy-invading as a camera. Having a device in the kitchen is also a bit less intrusive than in a bedroom, for those who would feel creeped out knowing that a tech device is watching them sleep. \n            \n                What do you think so far?\n            \n        \nBesides shutting off the stove, the iGuard can report to a caregiver (via an app, of course) things like what time each day a person first enters the kitchen. It can catch nighttime wandering if the person visits the kitchen at night; it can also send an alert if the person doesn’t seem to be up and active at their usual time. For example, if your mom usually makes coffee around 9:00 every morning, you can ask the app to notify you if the kitchen is still empty at 10:00. Other monitoring and safety featuresBesides shutting off the stove and reporting on the presence of a person in the kitchen, the iGuard has a few other clever features. The version of the device made for gas stoves can detect unburned gas, in case somebody left it on without a burner running. The device can also be configured to keep the stove from being turned on by pets or children, or it can be locked to not allow cooking during certain hours or days (say, at night). The app can also alert a caregiver if temperatures get too hot or cold, prompting them to check in if a heat wave or a cold snap is bad enough to affect indoor temperatures.While a lot of products I’ve seen at CES are speculative or hopeful in their use cases—I often find myself asking “who would actually use this?”—the iGuard seems thoughtfully designed and has a concrete use case and benefit. I was impressed! The new device is expected to ship later this year.Update 1/7/2025 at 7:48 a.m. PST: Corrected to note that the new product is named iGuard, and the previous version with motion sensors was iGuardStove. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Radar-Equipped Stove Shutoff Is One of the Most Practical Things I Saw at CES",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEB8T7SSSYM9GPVDTEQ7MWC8/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-07T03:52:38.000Z",
      "dateModified": "2026-01-07T03:52:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]