[
  {
    "title": "This New Android Feature Protects You From a Scam Call While It's Happening",
    "url": "https://lifehacker.com/tech/this-new-android-feature-protects-you-from-a-scam-call-while-its-happening?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBN5YJXM3RYZVHHBB4D420Z3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-04T20:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Google / Hight Photography",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Google / Hight Photography / Shutterstock\n                            \n            \n                Key Takeaways\n                                            Android users in the U.S. will soon have extra protection against scams targeting their financial apps.\n                                            You'll get a pop-up warning that the call is likely a scam with a reminder not to make payments or share personal information and a button to end the call.\n                                            U.S. users will see these protections when trying to access Cash App and JPMorganChase.\n                                    \n            \n    Table of Contents\n    \n        \n        Bank impersonation is a popular scam tactic, and one I've written about a lot. Fraudsters prey on people's fear, confusion, and desire to protect their money, which may lead targets to hand over login credentials, make irreversible wire transfers, or provide other sensitive information without stopping to question their actions. Android users in the U.S. will soon have extra protection against scams targeting their financial apps, preventing threat actors impersonating bank representatives from accessing data on their devices. Google's in-call scam protection is designed to prevent users from sharing their screens with threat actors and help them avoid revealing their banking information. How Android in-call protection worksAndroid's scam protection kicks in if you are on a phone call with a number not saved in your contacts and attempt to open a participating financial app. You'll get a pop-up warning that the call is likely a scam with a reminder not to make payments or share personal information and a button to end the call (and stop screen sharing). There's also a 30-second delay on further action on your device, which Google says is designed to disrupt any sense of urgency. \nNote that financial institutions must opt into in this feature—at this time, Google has specifically named Cash App and JPMorganChase as partners, though it indicates expansion to other popular fintechs and banks. \n            \n                What do you think so far?\n            \n        \nGoogle initially rolled out in-call protections for banking apps to UK users earlier this year as part of a larger package of security features announced ahead of Google I/O. That launch also included real-time scam detection alerts for calls and texts, improved theft protection via remote lock and identity check, key verifier for Google Messages, and device-level Advanced Protection (in addition to account-level settings). Alongside the US pilot, in-call scam protections will now cover most major banks in the UK as well as financial apps in Brazil and India. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This New Android Feature Protects You From a Scam Call While It's Happening",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBN5YJXM3RYZVHHBB4D420Z3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-04T20:30:00.000Z",
      "dateModified": "2025-12-04T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This macOS App Makes It Easy to See (and Use) Your Keyboard Shortcuts",
    "url": "https://lifehacker.com/tech/learn-macos-app-shortcuts?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNBQ0H4F582WCTDJF7E7Z8H/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-05T15:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 5, 2025\n    \n            Credit: sergey causelove / Shutter",
    "body": "\n        \n    \n                                        \n        \n        \n        December 5, 2025\n    \n            Credit: sergey causelove / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Using keyboard shortcuts is a lot faster than clicking around in the menus, but only after you learn them. That's the hard part.You could look up the documentation for the application or explore the menu bar—but if you're on a Mac, you could also just install KeyClu. This free application shows an overlay with all the keyboard shortcuts for the currently open Mac application, which is very useful for anyone trying to become a more keyboard-savvy computer user.To get started, install the application. Then, you'll need to choose a trigger key (basically one of the modifier keys on your keyboard). By default, you will tap the key twice and hold on the second tap to trigger the overlay, but you can optionally set the application to simply press and hold the key if you prefer. I opted to press and hold Command.\nAfter that, you'll be asked to enable permissions so KeyClu can access the keyboard shortcuts for your applications. Then you can start using the application. I tend to ignore the application until I wonder whether a keyboard shortcut for a particular function exists. I trigger the application, look through the list of keyboard shortcuts, and see what's available. When I let go of the trigger key, the window disappears.This default floating window is useful, but you might want a window listing shortcuts to stay open even when you let go of the trigger. That's where the persistent panel comes in. This window, which you can trigger using the menu bar, stays open and always shows a list of keyboard shortcuts for the currently active application. You can add a separate keyboard shortcut for this window in the settings, if you like.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nIf you dig around in KeyClu's settings, you can configure the layout of both the pop-up and persistent panels, changing the size of the windows, how many columns shortcuts are sorted into, and which display the panels show up on.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nIt's a simple piece of software, but it's completely free and can help you get better at using your computer. And if you're reading Lifehacker, that's probably something you want. Speaking of keyboard shortcuts: here are a few keyboard shortcuts you should know. You can also check out our guide to creating your own macOS keyboard shortcuts.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This macOS App Makes It Easy to See (and Use) Your Keyboard Shortcuts",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNBQ0H4F582WCTDJF7E7Z8H/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-05T15:30:00.000Z",
      "dateModified": "2025-12-05T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft's Latest 'Patch Tuesday' Update Fixes These Three Zero-Days",
    "url": "https://lifehacker.com/tech/microsoft-patch-tuesday-update-december-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC352X3QRTYWNS7CP2G3NBYA/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-10T14:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Alex Photo Stock/Shutters",
    "body": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Alex Photo Stock/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Microsoft's Patch Tuesday for December addresses 56 flaws in total.\n                                            Windows users should ensure their machines are updated as soon as possible to fix three zero-day vulnerabilities.\n                                            One of the zero-days has been actively exploited, while the other two have been publicly disclosed.\n                                    \n            \n    Table of Contents\n    \n        \n        Microsoft's Patch Tuesday update for December is here, and Windows users should ensure their machines are updated as soon as possible to fix three zero-day vulnerabilities. These are security flaws that are actively exploited or publicly disclosed before the developer releases an official patch. As reported by Bleeping Computer, this month's update addresses 56 bugs in total: 28 elevation-of-privilege vulnerabilities, 19 remote-code-execution vulnerabilities, four information-disclosure vulnerabilities, three denial-of-service vulnerabilities, and two spoofing vulnerabilities. Three of the remote code execution flaws are labeled \"critical.\" Note that these figures do not include updates released for Microsoft Edge and Mariner. Patch Tuesday is typically released on the second Tuesday of every month around 10am PT, so you can anticipate security updates at that time. \nOne of the zero-days patched in December has been actively exploited in the wild, though Microsoft has not shared any details as to how. CVE-2025-62221 is an elevation-of-privilege vulnerability in the Windows Cloud Files Mini Filter Driver, and when exploited, give attackers SYSTEM privileges. The mini filter allows cloud applications, such as OneDrive, access to file system functions. \n            \n                What do you think so far?\n            \n        \nThe other two bugs fixed have been publicly disclosed: CVE-2025-64671 - GitHub Copilot for Jetbrains Remote Code Execution Vulnerability: This flaw, which can be exploited through a Cross Prompt Injection in untrusted files or MCP servers, allows attackers to execute commands locally. According to Krebs on Security, this could trick the LLM into adding malicious instructions in the user's auto-approve settings. CVE-2025-54100 - PowerShell Remote Code Execution Vulnerability: This bug could cause scripts embedded in a webpage to be executed when retrieved using Invoke-WebRequest. CVE-2025-62221 has been attributed to Microsoft Threat Intelligence Center (MSTIC) & Microsoft Security Response Center (MSRC). CVE-2025-64671 was disclosed by Ari Marzuk, while CVE-2025-54100 has been credited to multiple security researchers. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft's Latest 'Patch Tuesday' Update Fixes These Three Zero-Days",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC352X3QRTYWNS7CP2G3NBYA/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-10T14:30:00.000Z",
      "dateModified": "2025-12-10T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yep, Apple Music and Apple TV Are Down",
    "url": "https://lifehacker.com/tech/apple-music-and-apple-tv-are-down?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC51TK4KGMVS7CCNEJNV6HQQ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-10T21:36:56.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Matthew Nichols1/Shutters",
    "body": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Matthew Nichols1/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple is reporting that Apple Music, Apple TV, and Game Center are experiencing outages.\n                                            The outages appear to have started at 2:53 p.m. ET for all affected services.\n                                            The report says that \"some users are affected,\" so these services might not be down on your end.\n                                    \n            \n    Table of Contents\n    \n        \n        If you picked up your iPhone to round out your Apple Music Replay for the year, or turned on your TV to watch a show like Pluribus, you might have noticed something odd: Neither service is working. It's not just you: Apple Music, Apple TV, and Game Center are currently down. That's directly from Apple's \"System Status\" website, which tracks all of Apple's web-based services and identifies which ones may be experiencing problems. While most of Apple's services, like the App Store, Find My, and iMessage, are all \"Available,\" four of these services are experiencing an outage: Apple Music, Apple TV, Apple TV Channels, and Game Center.   If you click on each, you can see the service's full status report:\nApple Music - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Apple TV Channels - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Apple TV - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Game Center - 1 Outage, 1 Resolved IssueOutage: Today, 2:53 PM - ongoingSome users are affectedUsers may be experiencing a problem with this service. Resolved Issue: Today, 8:43 AM - 9:14 AMSome users were affectedUsers may have experienced a problem with this service.It's not clear what is causing the outages, though they all went down at 2:53 p.m.. (Apple doesn't specify, but I imagine that's ET.) This isn't the first time this has happened, of course. In fact, Apple Music was down earlier this year, though it was actually still working for me when Apple said the outage was active. \n            \n                What do you think so far?\n            \n        \nThat appears to be the situation today, as well. Each report says \"some users are affected,\" not all. As it happens, Apple Music is working on my Mac, and I'm able to stream the free pilot episode of Pluribus without issue. Apple will likely get these services back up and running for affected users. In the meantime, if your Apple Music or Apple TV won't cooperate, this is likely the cause. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yep, Apple Music and Apple TV Are Down",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC51TK4KGMVS7CCNEJNV6HQQ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-10T21:36:56.000Z",
      "dateModified": "2025-12-10T21:36:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NotebookLM Has a New Feature for Visual Learners",
    "url": "https://lifehacker.com/tech/how-to-use-notebooklms-new-infographics-generator-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC2C7Q7BC1AJG0759KMFJ476/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-09T20:30:49.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Google\n                   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Google\n                            \n    Table of Contents\n    \n        \n        Another day, another update to Google's NotebookLM, the versatile AI tool that functions like a personal assistant focused only on you and your needs. The latest update is for visual learners: You can turn your source materials into helpful infographics that give you a clear picture—literally—of what the PDFs, websites, videos, or other materials you're studying or organizing are about. How to use the new NotebookLM infographics featureTo use the new feature, open any of your NotebookLM Notebooks (the name given to folders full of specific materials you've uploaded) and navigate to the panel on the right side. It's the same panel where you find the other offerings like the video creator and flashcard maker.As with those tools, you just tap the associated button to generate the corresponding product, making sure the sources from your left panel that you want to include are all checked off. I tried it out this morning, first using the NotebookLM account associated with my personal Chrome profile and what I'm studying in my private life, then using the one I have set up for work, which has a tester notebook full of materials about how to study for the SAT. (I am strict about using different Chrome profiles for various parts of my life and am now up to seven.) \nIn my personal account, the button was labeled BETA—and it acted like it. After two failed attempts, NotebookLM could not produce an infographic based on my materials. In my work account, though, the beta label was missing and it performed the function just fine, spitting this out:\n    \n            \n            \n                                        Credit: Google\n                    \n    \nThis is rolling out in full functionality to accounts at different times, obviously, but I was glad to see one of mine had easy access because I thought the infographic was solid.\n            \n                What do you think so far?\n            \n        \nWho the infographics feature is helpful forI don't consider myself a visual learner and primarily use NotebookLM to refine ideas or generate educational audio clips I can listen to while I clean the house, so I wasn't expecting to like this. I don't like the mind map creator within NotebookLM at all, for instance; flowcharts just aren't how I learn best, and that's fine. But the infographic was concise, engaging, and just detailed enough to keep me interested and looking at it. It's unlikely I'll use this to study or refine my work often, but I can absolutely see how it would be useful to someone who learns more visually, especially if all the lines and boxes of a mind map can get too convoluted to be useful.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NotebookLM Has a New Feature for Visual Learners",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC2C7Q7BC1AJG0759KMFJ476/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-09T20:30:49.000Z",
      "dateModified": "2025-12-09T20:30:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Flying Without a REAL ID Is Soon Going to Cost You",
    "url": "https://lifehacker.com/travel/flying-without-a-real-id-payment-required?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC3B69KRCWXTHYDFCC80KA7Y/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-10T14:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit:  Ivan Marc/Shutterstock \n",
    "body": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit:  Ivan Marc/Shutterstock \n                            \n            \n                Key Takeaways\n                                            The TSA will soon start collecting a $45 fee for travelers who don't have REAL IDs.\n                                            There are other forms of ID that will help you comply with the requirements, such as a passport.\n                                            The $45 fee covers security checkpoint access for up to 10 days, after which you'll have to repeat the process and payment.\n                                    \n            \n    Table of Contents\n    \n        \n        If you don't yet have a REAL ID, you can continue to fly, but it's going to cost you. Beginning Feb. 1, 2026, the Transportation Security Administration (TSA) will start collecting a $45 fee from travelers using non-compliant forms of identification at airport security checkpoints. The agency previously proposed a fee of $18 to cover the administrative and IT costs of ID verification for those traveling without a REAL ID or passport but increased the total to $45 in an announcement released earlier this month. REAL ID requirementsThe 2005 REAL ID Act mandated the standardization of state-issued driver's licenses and identification cards. After multiple delays since 2008, the Department of Homeland Security earlier this year finally began requiring anyone age 18 and over to have a REAL ID-compliant license to clear airport security or enter certain federal buildings. \nTravelers can also comply with the regulations using a U.S. passport, U.S. passport card, DHS Trusted Traveler card, or state-issued Enhanced Driver's License (from Michigan, Minnesota, New York, Vermont, of Washington). Enhanced Tribal Cards, permanent resident and border crossing cards, Department of Defense IDs, and foreign passports are also accepted. \n            \n                What do you think so far?\n            \n        \nYou can still travel without a REAL IDThe vast majority of Americans—94 percent—already have a REAL ID or another accepted form of identification. Those who don't will have to complete an online verification process and pay the $45 fee before they are able to clear airport security. Travelers are being encouraged to do this in advance: If you arrive without approval, you'll be sent out of line to complete the process (which can take up to 30 minutes) before being allowed through. The $45 fee covers security checkpoint access for up to 10 days, after which you'll have to repeat the process and payment. Travelers whose REAL ID or passport has been lost or stolen also have to pay. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Flying Without a REAL ID Is Soon Going to Cost You",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC3B69KRCWXTHYDFCC80KA7Y/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-10T14:00:00.000Z",
      "dateModified": "2025-12-10T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Windows Update Pop-Up Is a Scam",
    "url": "https://lifehacker.com/tech/windows-update-pop-up-clickfix-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBK2SENEP0XTH9T90WPKGE98/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T17:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: rawf8/Shutterstock \n      ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: rawf8/Shutterstock \n                            \n    Table of Contents\n    \n        \n        The update screen is a normal occurrence on Windows machines, so of course hackers are now manipulating it to sneak malware onto devices. The scheme, a recent iteration of a ClickFix attack, is designed to trick you into executing a dangerous command under the guise of completing a \"critical security update.\" But what you're actually doing is installing an infostealer that hands data over to bad actors. When a Windows update pop-up is actually a ClickFix attackClickFix is a social engineering ploy that uses tactics like fake error messages, CAPTCHA forms, and command prompts to deliver malware to your device. As PCMag reports, the Windows update scam is a pop-up that looks like a standard Windows blue screen but is actually a full screen browser page being displayed from a malicious domain. The ClickFix element is a set of keystrokes—not part of the real update interface—that have the user paste and execute a malicious command, ultimately delivering malware to their device. These instructions have an air of urgency, which is a common element of a scam. \nResearchers at cybersecurity firm Huntress have detailed the exact mechanism behind this attack, including an iteration in which users are prompted to verify they are human (rather than complete a security update). As Bleeping Computer outlines, the malicious code is embedded into the pixel data of PNG images, and the final payload is one of two known infostealers.According to the Huntress analysis, following a recent law enforcement operation, fake Windows update pages continue to exist across multiple domains, but those domains no longer seem to host the malware payload. That doesn't mean, however, that this attack, or some version of it, won't pop up elsewhere. \n            \n                What do you think so far?\n            \n        \nHow to stay safe from this ClickFix attackIf you run Windows on your device, you've probably seen a blue or black update or error screen many times, and you may not be suspicious if your computer randomly begins an update or prompts you to take an extra step to confirm it. But while a legitimate update screen will have a progress indicator and instructions not to turn off your computer, you should never need to input manual commands. This is a red flag of a ClickFix attack and not something a trusted service will require.  Of course, it's important to keep your computer up to date. Microsoft releases security updates on the second Tuesday of the month, known as Patch Tuesday, and you can enable automatic updates on your machine to ensure you get fixes as soon as they're available. If you want to take additional steps to prevent ClickFix attacks on Windows, you can disable the Windows Run box to prevent unauthorized access to commands.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Windows Update Pop-Up Is a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBK2SENEP0XTH9T90WPKGE98/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T17:30:00.000Z",
      "dateModified": "2025-12-04T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple’s New iPhone Update Will Make Sure You’ll Never Miss a Reminder Again",
    "url": "https://lifehacker.com/tech/iphone-alarm-for-reminders?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC1HZPG712EAKM1NVA9T5DGC/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-09T15:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Khamosh Pathak\n           ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    \n        \n        Apple’s various apps and utilities are finally starting to talk to each other, and it’s great news for iPhone users. Last year, Apple added the ability to sync Reminders with Calendar, which added time-based reminders directly into your Calendar view—a feature I now regularly use. Now, with iOS 26.2, Apple is finally integrating Reminders with the Alarms app; you'll be able to set an accompanying alarm for any reminder. If, like me, you tend to be forgetful—if you need a reminder for your reminder—this will be a handy feature. The alarm will sound, taking up your entire screen until you dismiss it. And yes, you can snooze it.How to add an alarm to any reminder on your iPhoneTo get started, open the Reminder app, navigate to a task list, and either create a new reminder, or edit it. When you’re adding a date and time, you’ll see a new Urgent toggle. When you enable the Urgent mode, it will turn on an alarm that will go off when the reminder is due. The alarm will trigger even when your iPhone is in silent mode or in a Do Not Disturb Focus mode, so be careful when setting it up.\n\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nWhen you enable this for the first time, you’ll get a connection request for integrating Reminders with Alarms. Here, tap Allow. If you don’t see this popup, or if you’ve dismissed it before, go to Settings > Apps > Reminders, and in the \"Allow Reminders to Access\" section, enable the Alarms toggle.When the reminder is due, you’ll see a full-screen reminder interface, with the reminder up top, and an option to slide to stop (using Apple’s new sliding interface for dismissing alarms, which you can disable if you want). You’ll also see a big blue Snooze button. This will snooze the reminder for nine minutes.\n            \n                What do you think so far?\n            \n        \nWhether you hit the Snooze button or you use the slider to stop the alarm, Apple will add the Reminder to the top of the notifications list, as a Live Activity. You’ll see the reminder, with the snooze duration (if enabled), and the task. To actually complete the task, you’ll have to check it off from the Live Activity or the Reminders app.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nUnlike in the new alarm feature, there’s no way to edit the Snooze duration for reminders, or to disable the slider. If you don’t like the Snooze feature or the two-tap approach to completing reminders, you can switch it out for a Complete button instead. Go to Settings > Apps > Reminders and in the \"Urgent Reminders\" section, enable the Complete from Alarm feature. Now, when the alarm goes off, you’ll see two buttons instead: Slide to Stop and Complete. When you tap Complete, the alarm will disappear, and the task will be marked as Complete.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple’s New iPhone Update Will Make Sure You’ll Never Miss a Reminder Again",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC1HZPG712EAKM1NVA9T5DGC/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-09T15:30:00.000Z",
      "dateModified": "2025-12-09T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "One of the Mac's Best Productivity Apps Is Now on Windows",
    "url": "https://lifehacker.com/tech/raycast-is-finally-on-windows?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBN70EVQ6Y5Q9205YSR8ZV7J/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-04T20:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Raycast\n                  ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Raycast\n                            \n            \n                Key Takeaways\n                                            Raycast is finally available on Windows.\n                                            The previously Mac-exclusive app makes it easy to search for apps and files anywhere on your PC.\n                                            You can also use the tool for a number of tasks, including converting currencies and dimensions, managing your clipboard history, and emptying your recycle bin.\n                                    \n            \n    Table of Contents\n    \n        \n        Raycast is one of the best things to happen to Windows. It brings one of my favorite Mac apps to Microsoft's operating system. In fact, I've enjoyed using Raycast for Windows so much, I can't see myself going back to the non-Raycast life. This app is free to download and use, though there is an optional paid subscription for those who want certain additional features. What is Raycast?\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nAt its heart, Raycast is an app that lets you search for apps and files stored in your computer. It stays hidden until you press its keyboard shortcut (Alt-Space on Windows). Once you do, Raycast appears as a floating search bar on the desktop. You can type anything you want to locate in the search bar, and Raycast forages through your computer to find it. I primarily use it as an app launcher since I have way too many apps on my Mac (and PC). Raycast helps me find the right app quickly and open it.That's just the surface layer of Raycast, though. You can use Raycast to search for files on your computer, retrieve items you've copied to the clipboard, send queries to ChatGPT (or other AI tools), convert currencies and units, and much more. All of these features are available under the same simple floating search bar.\nSet up keyboard shortcuts in Raycast\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nRaycast is designed for people who love keyboard shortcuts. You can totally use it without them, but you'll enjoy it a lot more if you set up a few shortcuts of your own. As an example, if you open Raycast and press Tab, it switches to AI mode, and you can directly send your questions and requests to ChatGPT from Raycast.Whenever you search for anything in Raycast, you'll probably see a button called Record hotkey next to the results. This is your cue to set up a keyboard shortcut for that action, and doing so will allow you to get to it faster. You can also go to Raycast settings to find commonly used actions and record your preferred keyboard shortcuts for all of them.Note that the Raycast app is still in beta on Windows, and during this trial period, you can use these AI features for free. Expect that to change, though, once it's out of beta. If you want to keep using these features, the pro tier costs $8 per month for most AI models, but certain advanced AI models are only available in the $16 per month subscription tier.What I use Raycast for on Windows\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nI use Raycast for a lot more than just launching apps on Windows. As someone who lives outside the US, converting units and currencies is a big part of my work day. Raycast's workflow is quite seamless for this task. You can just type \"$499\" or any other number after the dollar sign, and Raycast automatically converts it to your local currency. You can also type something like \"EUR499 to USD\" and it'll convert euros to the US dollar. I really like the fact that you don't even have to press the Enter/Return key to see the converted currency. The moment you type a currency number, the result shows up without any further prompts.You can also try other unit conversions with Raycast, eg: \"100kg to lbs,\" \"800ml to fl oz,\" \"44 sqm to sqft,\" etc. This helps me a lot when I'm ordering things from international websites that don't always have dimensions, weight, or pricing available in units I'm used to.\n            \n                What do you think so far?\n            \n        \nBeyond this, I like using Raycast to store and view clipboard history. You can search for Clipboard in Raycast to access items you've copied, and the app even categorizes these items for you. You can search just for links, images, files, or email address you've copied, which makes it easy to quickly find specific items from your clipboard history.Raycast also supports many other things such as window management, emptying the recycle bin, restarting your computer, locking your PC, bookmarking links and opening them in specific browsers, and text snippets—which let you quickly create or copy bits of text or code. You can open Raycast, and press Ctrl-, (comma) to open its settings and explore all its features.The limitations of Raycast for Windows\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nRaycast only recently launched on Windows, which means there are a few things still missing from the macOS version. This includes the AI Chat feature (more advanced than the quick AI search available now), focus timers, the built-in notes feature, and support for more extensions. Many of its extensions were originally built only for macOS, so it's going to take some time to bring them to Windows. The feature that I miss the most is the ability to sync your snippets, notes, chats, and other data across devices. This feature is yet to come to the Windows app, and I hope the developers change that soon.Raycast is available on the Mac, iPhone, and now, Windows.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "One of the Mac's Best Productivity Apps Is Now on Windows",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBN70EVQ6Y5Q9205YSR8ZV7J/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-04T20:00:00.000Z",
      "dateModified": "2025-12-04T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pebble Is Releasing a $75 Ring, but It’s Not an Oura Competitor",
    "url": "https://lifehacker.com/tech/pebble-is-releasing-the-index-01-ring?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC2E547V2E9MXT03HQM9TRA3/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-09T21:30:40.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n    We may earn a commission from links on thi",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n    We may earn a commission from links on this page.\n    \n            Credit: Pebble\n                            \n            \n                Key Takeaways\n                                            Pebble's new ring is called the Index 01, and it costs $75 to pre-order.\n                                            The ring has a button and microphone, but no heart rate sensor.\n                                            It's intended to be a one-handed input for voice notes that are sent to your phone and/or Pebble watch.\n                                    \n            \n    Table of Contents\n    \n        \n        When I hear that a smartwatch company is launching a ring, I assume it’s going to be a smart ring. But Pebble went a different direction, instead creating what’s basically a remote microphone that can work with your phone and other devices. It's available for pre-order for $75, and will sell for $99 after launch.Pebble’s new ring is called the Index 01. It’s got a button you can click and hold, and a microphone that will listen to what you’re saying as you hold the button. The recording is then sent to your phone, where it’s processed on-device. That's it—no heart rate sensor, and no charging dock.The Index 01's specs and functionalityEric Migicovsky, Pebble’s founder, describes using the Index to capture short messages and send instructions to his Pebble watch via his phone. The idea is that you wear the Index on your index finger (get it?) and press the button with your thumb. The ring comes in three colors: matte black with a black button, polished gold with a blue button, and silver with a white button. \nThere is no battery to charge, just a built-in battery that lasts a total of 12 to 15 hours. Migicovsky writes: “On average, I use it 10-20 times per day to record 3-6 second thoughts. That’s up to 2 years of usage.” The ring doesn’t have a speaker and can’t vibrate for notifications; it’s just for input. Communication between the ring and your phone is encrypted, and the voice recordings are processed into text on your phone, without requiring an internet connection. The ring doesn’t talk directly to a Pebble watch, but it can talk to your phone and your phone can then display any output to the watch—for example, displaying the text of a reminder that you set. Who should buy an Index 01 ring?So far, Pebble users don’t seem to be nearly as excited about this product as Migicovsky is. A Reddit thread discussing the announcement has comments like “Cool idea, weird product,” and “Why would I want this if I already have a Pebble that has all the capability to take voice notes?” \n            \n                What do you think so far?\n            \n        \nMigicovsky explains in the company’s blog post that his goal was for the button to be operated with one hand, and gestures on the Pebble weren’t reliable enough. He also emphasizes the fact you don’t need to charge it, while some of the users seem to be more concerned that a device that can't be charged is basically disposable—\"manufactured e-waste.\" After about two years of use (or less, if you make longer recordings), the app will ask if you’d like to order another ring. The ring will cost $75 to pre-order, and $99 at its regular price. There hasn’t been any mention of a discounted rate for a replacement; it sounds like you’re supposed to buy a new $99 ring every two years. The ring’s functionality could be extended in the future. A double click-and-hold could signal the Pebble app to process the data in a different way (perhaps sending it to ChatGPT, Migicovsky suggests) and developers could connect the voice processing in the app to other services like calendar and weather apps. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pebble Is Releasing a $75 Ring, but It’s Not an Oura Competitor",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC2E547V2E9MXT03HQM9TRA3/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-09T21:30:40.000Z",
      "dateModified": "2025-12-09T21:30:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple and Google Are Making It Easier to Switch Between iPhone and Android",
    "url": "https://lifehacker.com/tech/google-and-apple-are-making-it-easier-to-switch-between-iphone-and-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBZW51YD9RTK9TT6NWP3RZ28/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-08T21:30:59.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: Mr.Mikla/Shutterstock\n    ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: Mr.Mikla/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple and Google are reportedly working together on a method to make switching between iPhone and Android easier.\n                                            Details are slim, though Google has started to roll out some of its work to the latest build of Android Canary.\n                                            These changes should make it easier to move from one platform to another, something that has traditionally been more difficult than it should be.\n                                    \n            \n    Table of Contents\n    \n        \n        When it's time to buy a new car, you don't necessarily need to stick with the one you had before. You don't lose your cloud-based photos by switching from Toyota to Subaru, nor will your friends yell at you for ruining the group chat by buying a Kia. That's not the case with smartphones: When you buy an iPhone, it's tough to switch away from it. The same goes for Android: While it's easy enough to switch within the Android ecosystem, such as between Pixel or Galaxy, moving from Android to iPhone can also be a pain. Tech companies tend to make it tempting to stick with their platform, and introduce friction when you try to leave. That, of course, is entirely business-based. Apple hasn't traditionally made it easy to move to Android, because, well, you might actually do it. It doesn't have to be this way, either. There's nothing inherent to smartphones that should make it so challenging to break out of any particular ecosystem. All it takes is some intentional design: If smartphones were made to be traded, you could migrate from one to another, without worrying about losing pictures, messages, or any other important data or processes. As it happens, that intentional design may be on the horizon. As reported by 9to5Google, Apple and Google are actually working together to make it easier to transfer data between iPhone and Androids, which would make switching between the two platforms more seamless. This isn't theoretical, either: Google has already released some of this progress as part of the latest Android Canary, the company's earliest pre-release software. All compatible Pixel devices can currently access this latest build, though it doesn't seem there are any user-facing features available to test. 9to5Google says that similar features will roll out to testers in a future iOS 26 beta. Perhaps at that time, Google will roll out its features to the Android beta as well, which has a much larger user base than Canary. \nWhile details are slim here, any cooperation between Apple and Google on this front is huge. Current migration tools do exist, but they can be problematic. By actually working together on a native transfer solution, it might actually be seamless to move between platforms. Apple and Google might not be motivated by charity, of course, as the EU has been cracking down on restrictive practices by tech companies in recent years. But while both companies may see this as a way to lose customers, it's also a way to gain them: Sure, some iPhone users may switch to Android if it's easier to do so, but some Android users may do the reverse for the same reasons.\n            \n                What do you think so far?\n            \n        \nMore choice is good for everyone—even if it doesn't guarantee exponential growth to shareholders.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple and Google Are Making It Easier to Switch Between iPhone and Android",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBZW51YD9RTK9TT6NWP3RZ28/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-08T21:30:59.000Z",
      "dateModified": "2025-12-08T21:30:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samsung's One UI 8.5 Beta Is Now Officially Available",
    "url": "https://lifehacker.com/tech/samsung-galaxy-one-ui-85-beta?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBZ8XK9WHPT7MZD5TPKDJ0RX/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-08T16:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: Framesira/Shutterstock\n   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: Framesira/Shutterstock\n                            \n            \n                Key Takeaways\n                                            One UI 8.5 is officially in beta, rolling out a handful of new features for Galaxy devices.\n                                            According to Samsung, the update rolls out upgrades to Photo Assist, Theft Protection, and Quick Share, as well as the ability to manage storage across Samsung devices.\n                                            The beta is currently limited to Galaxy S25 devices, though Samsung could expand that down the line.\n                                    \n            \n    Table of Contents\n    \n        \n        If you're getting bored with your Galaxy phone, there are changes on the horizon. Samsung announced One UI 8.5 on Monday, Dec. 8, the latest update for Galaxy devices. At present, this new update is only out in beta, but select Galaxy users can try it out right now. Here's what's new, according to Samsung. With One UI 8.5, Quick Share can automatically identify people in photos. While that sounds a bit creepy, the idea is to proactively offer sharing recommendations to the people who are featured in any given photo. Say you hit Quick Share on a family photo you took over the weekend. Rather than manually enter all of the contacts you'd like to share that image with, the feature can identify each, and automatically suggest sending the image to those contacts. It should speed up sharing pictures with groups of people after you take them, but, again, a little unsettling. Photo Assist updates\n    \n            \n            \n                                        Credit: Samsung\n                    \n    \nThe Gallery app's Photo Assist feature is getting some upgrades in One UI 8.5. As of this version, Photo Assist now supports \"uninterrupted editing.\" That means you can make your AI-generated edits without needing to save in between each change. Previously, each edit would produce an entirely new image, so this makes the feature a bit more like a traditional photo editor. In addition, you'll be able to view all of the AI images you made in your edit history, and choose the one you like the most. \nSide note: Samsung says Photo Assist's Generate Edit feature requires an internet connection as well as a Samsung Account login. The feature also places a watermark on the image, so other people will know it was manipulated or generated with AI.   Audio Broadcast\n    \n            \n            \n                                        Credit: Samsung\n                    \n    \nOne UI 8.5 now supports sharing audio to other devices via Auracast, following Google's wider support for the standard back in September. If you have any LE Audio-supported devices, like headphones or speakers, you can use Audio Broadcast to share media from your Galaxy. This isn't limited to music, podcasts, or audio from videos, either, as Samsung says you can also broadcast your Galaxy's microphone to LE Audio devices, too.  This feature is limited to Galaxy S25 devices, even after One UI 8.5 rolls out to other Galaxy phones. \n    \n            \n            \n                                        Credit: Samsung\n                    \n    \nIf you have a number of Samsung Galaxy devices, you might find Storage Share useful. This One UI 8.5 feature lets you manage your files across other devices, including tablets, PCs and even TVs, in the My Files app on your smartphone.   \n            \n                What do you think so far?\n            \n        \nEnhanced Security ControlsSamsung is also expanding One UI's security features with this latest beta. The company is rolling out updates to Theft Protection with One UI 8.5, an existing feature that can lock your device if it's lost or stolen. That way, whoever picks it up won't have access to your data, or won't be able to erase the device and set it up as their own. In that same vein, Samsung is also launching Failed Authentication Lock, which locks the display after too many failed verification attempts. If a thief tries too many PIN combinations, or the fingerprint scanner fails too many times, your screen will lock them out.  How to try the beta on your GalaxyWhile you can apply for the beta program today, first, consider the risks. Like all beta software, this version of One UI is currently in testing, which means there may be bugs and glitches that could interrupt your experience using your smartphone. If you understand these risks (and back up all important information ahead of time), here's what you need to know. First, this beta is only open for Galaxy S25 users in the U.S., Germany, India, Korea, Poland, and the UK. If you have an S24 or older, you'll need to wait for Samsung to roll out the One UI 8.5 beta more widely, or for the full release down the line. Next, you'll need to apply to join the beta from the Samsung Members app. If you don't have the app yet, download it from the Play Store, then follow the instructions to enroll in the beta.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung's One UI 8.5 Beta Is Now Officially Available",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBZ8XK9WHPT7MZD5TPKDJ0RX/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-08T16:00:00.000Z",
      "dateModified": "2025-12-08T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three Changes Coming to Your Apple Watch With watchOS 26.2",
    "url": "https://lifehacker.com/tech/apple-watchos-262-updates?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNMEX42ZBVNCHDQH53K9ACF/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T22:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: DenPhotos/Shutterstock\n   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: DenPhotos/Shutterstock\n                            \n            \n                Key Takeaways\n                                            watchOS 26.2 is bringing three new features and changes to your Apple Watch.\n                                            Apple is updating Sleep Score, which should now be a bit more accurate when calculating your overall score.\n                                            The update also fixes an annoying Music glitch and introduces Enhanced Safety Alerts.\n                                    \n            \n    Table of Contents\n    \n        \n        Yesterday, Apple unveiled release candidates (RCs) for its slate of upcoming updates. An RC, as the name implies, is the version of a software update Apple intends to release to the general public. Before it rolls out, though, Apple sends the update out to beta testers to see if there are any bugs or glitches that need addressing. If not, these are the updates that will hit your Apple devices sometime this month. That includes watchOS 26.2, Apple's latest OS for its line of smartwatches. While there aren't nearly as many new features and changes in this update as there were in watchOS 26 proper, there are still some key things to highlight in this RC. In fact, as noted by 9to5Mac, there are three:Updates to Sleep ScorewatchOS 26 introduced Sleep Score, a feature that was sorely missing on the Apple Watch. Sleep Score analyzes a host of data collected while you slept, including sleep duration, the time you actually went to bed, and any wake-ups you might have had during the night, and gives you an overall score. The idea is to glance at the score and see how you slept that night, so you can either take steps to improve your sleep going forward, or know you're on the right track. The total score is out of 100: Duration gets you up to 50 points, bedtime gets up to 30, and sleep interruptions go up to 20.  \nwatchOS 26.2 refines the feature, by adjusting the final Sleep Score metrics. The feature had a tendency to give you higher scores than you might have otherwise felt you earned: A mediocre night's sleep might have have scored \"High\" on your chart, which wouldn't have made much sense to you. Going forward, the scoring is a bit more conservative. Here's what you can expect, and how the scores changed from the last update:Very Low: 0–40 (previously 0–29)Low: 41–60 (previously 30–49)OK: 61–80 (previously 50–69)High: 81–95 (previously 70–89)Very High: 96–100 (previously 90–100) You'll also noticed Apple changed the \"Excellent\" score to \"Very High,\" which keeps the naming a bit more consistent.Music app glitch fixIf you've been using the Music app on your Apple Watch, but have been struggling to get your songs to actually, you know, play, good news: Apple says in the release notes for watchOS 26.2 RC that there is now a fix for an issue where the Music app doesn't move to the next song.\n            \n                What do you think so far?\n            \n        \nEnhanced Safety AlertsFinally, watchOS 26.2, along with other Apple updates, introduces Enhanced Safety Alerts. According to Apple, this feature will warn you about \"imminent threats,\" including floods, natural disasters, and other emergencies. The feature will also include data like maps and links to official safety advice. Apple has been positioning the Apple Watch to be an overall health and safety device, and this feature only seems to complement that. Recent Apple Watches have hypertension alerts, which can help you passively identify high blood pressure, while fall and crash protection can automatically call for help in emergencies when you can't reach the phone. When does watchOS 26.2 come out?Apple doesn't have a set date for watchOS 26.2, or iOS 26.2 and macOS 26.2 for that matter. However, now that the RCs are out, these updates are likely coming soon. As long as there aren't any glaring bugs or glitches in these RCs, Apple will likely ship the updates sometime this month.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three Changes Coming to Your Apple Watch With watchOS 26.2",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNMEX42ZBVNCHDQH53K9ACF/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T22:30:00.000Z",
      "dateModified": "2025-12-04T22:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Deleting Your Browsing History Doesn’t Always Delete Your Browsing History",
    "url": "https://lifehacker.com/tech/limits-of-deleting-your-browsing-history?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBQCYX4QG67P49TH4X8PTHA6/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-05T16:30:00.000Z",
    "description": "\n        \n        Manually or automatically wiping your browsing history is a well-established way of protecting your privacy and making sure the digi",
    "body": "\n        \n        Manually or automatically wiping your browsing history is a well-established way of protecting your privacy and making sure the digital trail you leave behind you is as short as possible—but it's important to be aware of the limitations of the process, and to understand why deleting your browsing history isn't always as comprehensive an act as you might think.In short, the records of where you've been aren't only kept on your local computer or on your phone, they're found in various other places too. This is why fully wiping away your browsing history is more difficult than it initially appears. Modern browsers typically sync your browsing historyJust about every modern browser can now sync your browsing history across devices, from laptop to mobile and back again. There are benefits to this—being able to continue your browsing on a different device, for example—but it means that deleting the list of websites you've visited on one device won't necessarily clear it everywhere.\nConsider Apple's Safari, which by default will sync your online history, bookmarks, and open tabs between all of the iPhones, iPads, and Macs using the same Apple account. You can manage this by selecting your account name and then iCloud in Settings on iOS/iPadOS or in System Settings on macOS.\n    \n            \n            Deleting browsing history in Safari.\n                                        Credit: Lifehacker\n                    \n    \nWhether or not Safari syncing is enabled through iCloud will affect how browsing history is deleted—when you try to delete this history on mobile or desktop, you'll see a message telling you what will happen on your other devices. In Safari on a Mac, choose History > Clear History; on an iPhone or iPad, choose Apps > Safari > Clear History and Website Data from Settings.Most other browsers work in the same way, with options for both syncing history and deleting history. In Chrome on the desktop, for example, open Settings via the three-dot menu (top right): You can manage syncing via You and Google > Sync and Google Services > Manage what you sync, and clearing your history via Privacy and security > Delete browsing data.The apps and sites you use are tracking youAside from all the history your actual web browser is collecting, you also need to think about the data being vacuumed up by the apps and websites you're using. If you log into Facebook, Meta will know about the comments you've left and the photos you've liked, no matter how much you scrub your history from Edge or Firefox.How much you can do about this really depends on the app or site. Amazon lets you clear your search history, for example: On the desktop site, click Browsing History on the toolbar at the top, then click the gear icon (top right). The next screen lets you delete all or some of your browsing history, and block future tracking—though you won't be able to reorder items as easily, and your recommendations will be affected.\n    \n            \n            Clearing data from a Google account.\n                                        Credit: Lifehacker\n                    \n    \nMeta lets you clear your Instagram and Facebook search history, at least: You can take care of both from the Meta Accounts Center page in a desktop browser. Click Your information and permissions then Search history to look back at what you've been searching for. The next screen gives you options for manually and automatically wiping your search history.\n            \n                What do you think so far?\n            \n        \nGoogle runs a whole host of online apps as well as a web browser. You can manage all your Google data from one central point from your desktop browser: Your Google Account page. Click Data and privacy to see everything Google has collected on you, and click through on any activity type to manually delete records or set them up to be automatically deleted after a certain period of time.Your internet provider always knows where you've beenThe final place there will be copies of your internet browsing history are on the servers of your internet service provider—that is, whichever company you're paying for access to the internet is keeping logs of the places you've been, for all kinds of purposes (from security to advertising). And yes, this includes sites that you open while in incognito mode.How this is handled varies from provider to provider. For example, AT&T's privacy notice states that the company will \"automatically collect a variety of information\", including \"website and IP addresses,\" \"videos watched,\" and \"search terms entered.\" The company says this data will be kept for, \"as long as we need it for business, tax, or legal purposes.\"\n    \n            \n            A VPN can hide your browsing from your internet provider.\n                                        Credit: Lifehacker\n                    \n    \nThere's not a whole lot you can do about this either—it's a trade-off you have to make if you want access to the web. Some providers, including AT&T, will let you opt out of certain types of information sharing if you get in touch with them directly, but you can't prevent the tracking from happening in the first place.What you can do is mask your browsing with a VPN (Lifehacker has previously picked the best paid VPNs and the best free VPNs for you to try out). As all your internet traffic will be routed through the VPN's servers, your internet provider will no longer be able to see what you're doing. Your VPN provider will, however—so find one that you can trust, and which has a no-logs policy that's been verified by a third-party security auditor.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Deleting Your Browsing History Doesn’t Always Delete Your Browsing History",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBQCYX4QG67P49TH4X8PTHA6/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-05T16:30:00.000Z",
      "dateModified": "2025-12-05T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "10 Hacks Every Chromebook Power User Should Know",
    "url": "https://lifehacker.com/tech/best-hacks-for-chromebook-power-users?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KB5TSHGD2RNF8N8Y056KS1NJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-10T18:30:00.000Z",
    "description": "\n        \n        If you've chosen a Chromebook as a laptop, then you know the main benefits that it brings: namely, speed, ease of use, and affordabi",
    "body": "\n        \n        If you've chosen a Chromebook as a laptop, then you know the main benefits that it brings: namely, speed, ease of use, and affordability. Despite the simplicity of ChromeOS, however, there's more that you can do with it than you might realize. You can use it offline, and you can sync files to and from local storage, for example. The operating system is a lot more powerful and versatile than it often gets credit for.These hacks are for power users who want to level up their Chromebook capabilities, and get extra value out of their laptop, beyond the standard use cases that everyone knows about. No matter how you use ChromeOS, there should be something here to help.Use your Chromebook offline\n    \n            \n            Google Drive can work offline.\n                                        Credit: Lifehacker\n                    \n    \nChromebooks are often criticized for being useless without wifi, but that's not actually the case: All of the Docs, Sheets, and Slides tools can be used offline, with changes syncing back when your internet connection is restored: From Google Drive, click the gear icon (top right), then choose Settings > General and check the option under the Offline heading.\nYou can use Gmail offline, too. You can't send or receive emails, obviously, but you can read through and organize your inbox, and draft emails ready to go once you get your internet back. From Gmail, click on the gear icon (top right), then pick See all settings > Offline. Check the Enable offline mail box and choose how much of your email you want to sync.This offline functionality extends to third-party streaming apps too, as ChromeOS supports Android apps. With apps such as Netflix and Spotify, you can sync content to your Chromebook to watch when you don't have a reliable internet connection—when you're on a long flight, for example, or traveling between countries.Talk to your Chromebook\n    \n            \n            Enable dictation through the Accessibility settings.\n                                        Credit: Lifehacker\n                    \n    \nTyping is all well and good, but sometimes talking is faster. Launch Settings, then choose Accessibility > Keyboard and text input > Dictation to enable the feature. You can then press the Launcher (G) button and D to start dictating in any app—whether you're composing emails or writing essays.Move local files to Google DriveOne of the pros of using a Chromebook is that everything is synced online pretty much instantly, if you're using one of Google's own online apps or something similar. However, there may be local files that accumulate on the laptop, including screenshots and downloads, and sometimes you'll want to get those synced to the cloud as well.You can see these files via the Files app that comes built into ChromeOS, and upload them manually via the Google Drive web interface. There's an easier way to get them into Google Drive, though: From the Files app, select all the local files you want to upload in the pane on the right, then drag them into My Drive under Google Drive in the left-hand menu bar.Set up virtual desktopsChromebooks don't always have the biggest or highest-resolution screens, but you can give yourself more room by managing multiple virtual desktops (which ChromeOS calls \"desks\"). Press the \"show windows\" key (it's the one with little rectangles on it, usually also labeled F3) to view open desks, switch between them, and create new ones.Enable guest accessAs ChromeOS is so tightly tied to your Google account, you don't necessarily want other people borrowing your laptop and being able to get into your Google apps. The solution is guest mode: Restart your Chromebook or sign out of your current user account, then click Browse as Guest to launch a Chrome window without any Google account attached.\n            \n                What do you think so far?\n            \n        \nMake full use of the clipboardChromeOS can sometimes feel limiting in that you can't quickly drag files to the desktop or to a temporary folder in the same way that you can on Windows or macOS. You might also see that as a benefit—it means less junk will be cluttering your system—but there could well be times that you just need to store something temporarily for transfer.That's where the ChromeOS clipboard comes in: It actually stores five items rather than one, so it's a useful (if rather hidden) way of moving images, text, and links between websites and apps. Use the usual Ctrl+C, Ctrl+X, and Ctrl+V shortcuts to copy, cut, and paste, then hold down the Launcher (G) button and V to see all the clipboard items.Open the ChromeOS Task Manager\n    \n            \n            ChromeOS comes with its own Task Manager.\n                                        Credit: Lifehacker\n                    \n    \nThe ChromeOS Task Manager is useful for everything from shutting down crashed apps to seeing exactly where all your RAM is going, and it can be a key tool in the power user's belt. Open it by pressing the Launcher (G) key and Esc: You'll see you can browse between individual tabs and system processes, or search for something specific on ChromeOS.Save an older laptopChromeOS isn't just for Chromebooks: You can give an older, struggling laptop a new lease of life by installing ChromeOS Flex on it (even old laptops can usually handle Chrome). Google has full instructions for what you need to do to get this working, and will guide you through the process of creating a bootable USB drive with the ChromeOS software on.Explore beta and dev channels\n    \n            \n            Switching up the channel on ChromeOS.\n                                        Credit: Lifehacker\n                    \n    \nAs with a lot of software, there are beta and dev channels of ChromeOS available as well as the stable one. If you want to get the newest Chromebook features before everyone else, and don't mind a few bugs along the way, then you can make the switch. It doesn't take long, and you can always switch back again, though a system reset is sometimes required.To change between ChromeOS channels, click on the time panel (bottom right), then click the gear icon to get to the main Settings page. Choose About ChromeOS > Additional details > Change channel, then choose whichever one you want to use. You'll keep getting over-the-air updates for your selected channel until you switch to a different one.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 Hacks Every Chromebook Power User Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KB5TSHGD2RNF8N8Y056KS1NJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-10T18:30:00.000Z",
      "dateModified": "2025-12-10T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]