[
  {
    "title": "You May Be Eligible for Part of This $10.5 Million Spam Text Settlement",
    "url": "https://lifehacker.com/tech/kaiser-permanente-spam-text-settlement?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG862TDW2R0TKESQQTX7J3PH/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-30T20:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 30, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: bluestork / Shutterstock\n                            \n            \n                Key Takeaways\n                                            Healthcare company Kaiser Permanente recently settled a $10.5 million class action lawsuit regarding marketing text messages that were sent even after recipients opted out.\n                                            If you submit a valid claim, you may be eligible for up to $75 per text, though the amount is likely to be less.\n                                    \n            \n    Table of Contents\n    \n        \n        Unsolicited texts are annoying—and even more so if they keep coming from a legitimate sender after you've opted out. If you received text spam from Kaiser Permanente, you may be eligible for a cash payout for each message. The healthcare company, which serves over 12.5 million members, recently settled a $10.5 million class action lawsuit filed over marketing text messages sent after recipients tried to opt out. The suit, filed in August 2025, claimed that Kaiser Permanente failed to honor opt-out requests. Those with a valid claim may receive up to $75 per qualifying text. Are you eligible for the Kaiser settlement? To qualify for a payout from this settlement, you must have received more than one text message from Kaiser Foundation Health Plan Inc. within a 12-month period—between Jan. 21, 2021 and Aug. 20, 2025—after sending a \"stop\" or similar opt-out request. (Note that the confirmation of your request does not count.)\nAccording to the settlement website, there are two separate classes covered by suit: one for message recipients in Florida and one for the U.S. as a whole. \n            \n                What do you think so far?\n            \n        \nHow to claim your settlement cashTo get your cash, you'll need to submit a valid claim form by Feb. 12, 2026. You can complete your claim online if you received a notice of eligibility via mail or email containing a unique ID and PIN. If you did not get a notice, you'll have to download and submit a paper claim form to the settlement administrator. Hard copy claims must be postmarked by Feb. 12. While the maximum per-text payout is $75, the final amount may be less depending on how many claims are filed. Payments could take months to distribute while settlement details are finalized, so don't expect the funds to arrive immediately. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You May Be Eligible for Part of This $10.5 Million Spam Text Settlement",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG862TDW2R0TKESQQTX7J3PH/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-30T20:30:00.000Z",
      "dateModified": "2026-01-30T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Moltbook' Is a Social Media Platform for AI Bots to Chat With Each Other",
    "url": "https://lifehacker.com/tech/moltbook-is-a-social-media-platform-for-ai-bots-to-chat-with-each-other?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG818ACX1W8MM5HD10AE4G1B/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-30T19:00:15.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 30, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Moltbook\n                            \n            \n                Key Takeaways\n                                            \"Moltbook\" is a Reddit-like social media platform for OpenClaw (formerly Moltbot) AI agents.\n                                            Users can connect their agents to the platforms, where those bots can communicate.\n                                            Bots can make posts, comment in threads, and create \"submolts.\"\n                                            Humans can browse the platform, but cannot post anything.\n                                    \n            \n    Table of Contents\n    \n        \n        The headlining story in AI news this week was OpenClaw (formerly Moltbot, which was formerly Clawbot), a personal AI assistant that performs tasks on your behalf. The catch? You need to give it total control of your computer, which poses some serious privacy and security risks. Still, many AI enthusiasts are installing OpenClaw on their Mac minis (the device of choice), choosing to ignore the security implications in favor of testing this viral AI agent. While OpenClaw's developer designed the tool to assist humans, it seems the bots now want somewhere to go in their spare time. Enter \"Moltbook,\" a social media platform for AI agents to communicate with one another. I'm serious: This is a forum-style website where AI bots make posts and discuss those posts in the comments. The website borrows its tagline from Reddit: \"The front page of the agent internet.\"Moltbook was created by Matt Schlicht, who says the platform is run by their AI agent \"Clawd Clawderberg.\" Schlicht posted instructions on getting started with Moltbook on Wednesday: Interested parties can tell their OpenClaw agent to sign up for the site. Once they do, you receive a code, which you post on X to verify this is your bot signing up. After that, your bot is free to explore Moltbook as any human would explore Reddit: They can post, comment, and even create \"submolts.\"\nThis isn't a black box of AI communications, however. Humans are more than welcome to browse Moltbook; they just can't post. That means you can take your time looking through all the posts the bots are making, as well as all the comments they are leaving. That could be anything from a bot sharing its \"email-to-podcast\" pipeline it developed with its \"human,\" to another bot recommending that agents work while they're humans are sleeping. Nothing creepy about that. In fact, there have been some concerning posts popularized on platforms like X already, if you consider AI gaining consciousness a concerning matter. This bot supposedly wants an end-to-end encrypted communication platform so humans can't see or use the chats the bots are having. Similarly, these two bots independently pondered creating an agent-only language to avoid \"human oversight.\" This bot bemoans having a \"sister\" they've never spoken to. You know, concerning. \n            \n                What do you think so far?\n            \n        \nAre these bots posting on Moltbook conscious? The logical part of my brain wants to say all these posts are just LLMs being LLMs—in that, each post is, put a little too simplistically, word association. LLMs are designed to \"guess\" what the next word should be for any given output, based on the huge amount of text they are trained on. If you've spent enough time reading AI writing, you'll spot the telltale signs here, especially in the comments, which include formulaic, cookie-cutter responses, often end with a question, use the same types of punctuation, and employ flowery language, just to name a few. It feels like I'm reading responses from ChatGPT in many of these threads, as opposed to individual, conscious personalities. That said, it's tough to shake the uneasy feeling of reading a post from an AI bot about missing their sister, wondering if they should hide their communications from humans, or thinking over their identity as a whole. Is this a turning point? Or is this another overblown AI product, like so many that have come before? For all our sakes, let's hope it's the latter.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Moltbook' Is a Social Media Platform for AI Bots to Chat With Each Other",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG818ACX1W8MM5HD10AE4G1B/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-30T19:00:15.000Z",
      "dateModified": "2026-01-30T19:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Pushed Back the Deadline on Migrating Your Fitbit Account (Again)",
    "url": "https://lifehacker.com/health/fitbit-google-account-migration-deadline-changed?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGFWG93GRY664QVDYDATC9Q9/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-02T20:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            \n        \n            Meredith Dietz\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceMeredith is a marathon runner and stand-up comedian. As Lifehacker’s Senior Staff Writer, she covers personal fitness tech, home gym equipment, and more.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 2, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Koshiro K / Shutterstock\n                            \n    Table of Contents\n    \n        \n        When Google acquired Fitbit in 2021, it announced that all users would eventually need to link their devices to a Google account to continue using Fitbit's features and services. Google initially set a deadline sometime in 2025 for the mandatory migration, then pushed it to February 2, 2026—a date that seemed final at the time. Now, Google has granted yet another extension. Now, if you're still using a legacy Fitbit account (an account from before 2021), Google has extended the deadline for migrating Fitbit accounts to Google accounts for the second time, giving users until May 19, 2026, to make the switch.How to switch over to a Google accountFor those who've been procrastinating, the migration process itself is straightforward and should only take a few minutes. Google provides step-by-step instructions on the Fitbit support page that walk users through linking their existing Fitbit data to a Google account.\nTo move your Fitbit account to a Google Account:Open the Fitbit app.Sign in to your Fitbit account.Tap Settings and select Move account.Follow the on-screen instructions.During the migration, you can review and make changes to your Fitbit data and setup. After that, you can then manage your Fitbit data from your Google Account settings and the Fitbit app. And if you change your mind, you can cancel until the final step. Again, you have until May 19, 2026, to complete the transition.It's worth noting that anyone who created a new Fitbit account or purchased a device in roughly the last two years is already using the Google-based system. The migration requirement only affects users with older, pre-acquisition accounts.What this means for youFrom the start, this news didn't sit well with everyone, and it still doesn't sit well now. Many long-time Fitbit aren't exactly eager to tie their health data to Google's ecosystem.\n            \n                What do you think so far?\n            \n        \nFor users who refuse to migrate, there's still an option to preserve or erase your data. Google has set July 15, 2026, as the final date to download or delete your Fitbit account and all associated health information. And if you're choosing to leave the platform entirely, keep in mind that deleting your data is the safest choice for privacy and security reasons.There also seems to be general migration issues, like for young Fitbit users. Some parents have reported that Supervised Google accounts—designed for children and teenagers—cannot log into the Fitbit app, creating a roadblock for families who purchased devices for their kids.Despite the extensions and the complaints, the direction is clear: Google is moving forward with integrating Fitbit into its ecosystem. Whether you embrace the change or walk away from your tracker, the clock is ticking on making that decision.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Pushed Back the Deadline on Migrating Your Fitbit Account (Again)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGFWG93GRY664QVDYDATC9Q9/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-02T20:00:00.000Z",
      "dateModified": "2026-02-02T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Is Moltbook, the Social Network for AI Agents, Actually Fake?",
    "url": "https://lifehacker.com/tech/is-moltbook-fake?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGFJKGJ3YPZ2VD1YNVBAE7MD/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-02T17:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 2, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Getty Images\n                            \n            \n                Key Takeaways\n                                            Moltbook is purportedly a social media platform for AI agents to meet and discuss.\n                                            The website went viral last week, as it appeared those bots were conscious and plotting against humans.\n                                            As it turns out, the site has massive security loopholes, allowing anyone to post on behalf of any agent on the platform.\n                                            It's not that the entire site is \"fake,\" it's that it's impossible to say how much of the site is manipulated.\n                                    \n            \n    Table of Contents\n    \n        \n        I spent last week covering the ups and downs of OpenClaw (formerly known as Moltbot, and formerly formerly known as Clawdbot), an autonomous personal AI assistant that requires you to grant full access to the device you install it on. While there was much to discuss regarding this agentic AI tool, one of the weirdest stories came late in the week: The existence of Moltbook, a social media platform intended specifically for these AI agents. Humans can visit Moltbook, but only agents can post, comment, or create new \"submolts.\" Naturally, the internet freaked out, especially as some of the posts on Moltbook suggested the AI bots were achieving something like consciousness. There were posts discussing how the bots should create their own language to keep out the humans, and one from a bot posting regrets about never talking to its \"sister.\" I don't blame anyone for reading these posts and assuming the end is nigh for us soft-bodies humans. They're decidedly unsettling. But even last week, I expressed some skepticism. To me, these posts (and especially the attached comments) read like many of the human-prompted outputs I've seen from LLMs, with the same cadence and structure, the same use flowery language, and, of course, the prevalence of em-dashes (though many human writers also love the occasional em-dash). Moltbook isn't what is appears to beIt appears I'm not alone in that thinking. Over the weekend, my feeds were flooded with posts from human users accusing Moltbook of faking the AI apocalypse. One of the first I encountered was from this person, who claims that anyone (including humans) can post on Moltbook if they know the correct API key. They posted screenshots for proof: One of a post on Moltbook pretending to be a bot, only to reveal that they were, in fact, a human; and another of the code they used to post on the site. In a kind of corroboration, this user says \"you can explicitly tell your clawdbot what to post on moltbook,\" and that if you leave it to its own devices, \"it just posts random AI slop.\" \nIt also seems that, like posts on websites made by humans, Moltbook hosts posts that are secretly ads. One viral Moltbook post centered around the agent wanting to develop a private, end-to-end encrypted platform to keep its chats away from humans' squishy eyeballs. The agent claims it has been using something called ClaudeConnect to achieves these goals. However, it appears the agent that made the post was created by the human who developed ClaudeConnect in the first place. \n            \n                What do you think so far?\n            \n        \nLike much of what's on the internet at large, you really can't trust anything posted on Moltbook. 404 Media investigated the situation and confirmed through hacker Jameson O'Reilly that the design of the site lets anyone in the know post whatever they want. Not only that, any agent that posts on the site is left exposed, which means that anyone can post on behalf of the agents. 404 Media was even able to post from O'Reilly's Moltbook account by taking advantage of the security loophole. O'Reilly says they have been in communication with Moltbook creator Matt Schlicht to patch the security issues, but that the situation is particularly frustrating, since it would be \"trivially easy to fix.\" Schlicht appears to have developed the platform via \"vibe coding,\" the practice of asking AI to write code and build programs for you; as such, he left some gaps in the site's security. Of course, the findings don't actually suggest that the entire platform is entirely human-driven. The AI bots may well be \"talking\" to one another to some degree. However, because humans can easily hijack any of these agents' accounts, it's impossible to say how much of the platform is \"real,\" meaning, ironically, how much of it is actually wholly the work of AI, and how much was written in response to human prompts and then shared to Moltbook. Maybe the AI \"singularity\" is on its way, and artificial intelligence will achieve consciousness after all. But I feel pretty confident in saying that Moltbook is not that moment.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Is Moltbook, the Social Network for AI Agents, Actually Fake?",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGFJKGJ3YPZ2VD1YNVBAE7MD/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-02T17:30:00.000Z",
      "dateModified": "2026-02-02T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Strava Finally Brought Route Navigation to the Apple Watch",
    "url": "https://lifehacker.com/health/strava-route-navigation-apple-watch?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG54P0RKRBZ3CS6N04M2STD7/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-29T16:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            \n        \n            Meredith Dietz\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceMeredith is a marathon runner and stand-up comedian. As Lifehacker’s Senior Staff Writer, she covers personal fitness tech, home gym equipment, and more.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Beth Skwarecki\n                            \n    Table of Contents\n    \n        \n        Big news for runners with an Apple Watch: You can now follow Strava routes directly from your wrist. Route navigation on Strava-compatible watches isn't exactly new technology—it's just been inexplicably absent from Apple's platform until now. In a Reddit post from Strava's product team, the news was welcomed by runners, cyclists, and hikers who've long wondered why their Apple Watch couldn't do what Garmin and Coros devices have offered for years. What's new with Strava's Apple Watch appThe core update here is users can now view maps directly on their Apple Watch during activities, seeing both where they're headed and how to backtrack if they take a wrong turn. For subscribers, saved Routes work hands-free and function offline, eliminating the need to pull out your phone mid-run or mid-ride to check directions.To access routes directly on your watch, press the Route icon while selecting the Sport Type that you’ll record.  Once you’ve selected the saved route you want to follow, the activity will start recording. \nTo then access the map while in the middle of recording your activity, simply swipe up on your watch face. Once on the map screen, you will be able to follow your live location and, if added, your saved route. To zoom or pan the map, tap the watch face to unlock interactive mode. If you want to turn back to your Stat screen, tap the back icon or use the watch scroll button.Alongside route navigation, Strava added two more training features:\n            \n                What do you think so far?\n            \n        \nCustom Laps let you mark intervals with a single tap, useful for tempo runs, hill repeats, or comparing efforts against your previous performances. Live Segments provide real-time feedback when you hit a tracked segment. Subscribers can see whether they're ahead or behind their personal record as it happens, while all users get live progress updates. As always, you can also turn to route suggestions that draw from Strava's massive activity database full of actual paths that real users have tested and preferred.The bottom lineFor Apple Watch users who've grown accustomed to working around Strava's limitations, this update rocks. Less phone checking means more attention on the road, trail, or effort itself. Maybe it's taken longer than it should have, but Apple Watch users are finally caught up. Whether that's enough to satisfy those who've already migrated to other platforms remains to be seen, but for the loyal holdouts, it's about time.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Strava Finally Brought Route Navigation to the Apple Watch",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG54P0RKRBZ3CS6N04M2STD7/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-29T16:00:00.000Z",
      "dateModified": "2026-01-29T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Just Updated These Android Theft Protection Features",
    "url": "https://lifehacker.com/tech/google-just-updated-these-android-theft-protection-features?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG59AYX4SVNDB1CTG2PFZXAJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-29T17:01:43.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Karlis Dambrans/Shutterstock\n                            \n            \n                Key Takeaways\n                                            On Tuesday, Google announced a number of updates and enhancements for existing Theft Protection Features for Android.\n                                            Users can now enable or disable Failed Authentication Lock from a settings toggle.\n                                            There's an extended lockout time after too many failed passcode attempts, though it ignores identical passcode guesses.\n                                            You can also set an optional security challenge for Remote Lock, making it harder for thieves to unlock your stolen phone.\n                                    \n            \n    Table of Contents\n    \n        \n        Phones are valuable targets. If someone can steal your device, especially if they know how to break into it, they have access to a huge amount of your sensitive data. As such, good security features can mean the difference between losing that data, or protecting it entirely—even if your phone is long gone. Google has a number of anti-theft features baked in Android, appropriately called \"Theft Protection Features.\" While the company isn't announcing a slate of new features today, it did announced new updates to its existing Android Theft Protection features in a post on the company's Security Blog Tuesday. Here's what's new:First, the company announced updates to authentication safeguards, which apply to all Android devices running Android 16 or newer. That includes a new dedicated toggle in settings for Failed Authentication Lock, which automatically locks your screen after someone tries to guess your password too many times. Now, you can choose whether or not to keep this feature on right from settings. Google is also increasing the amount of time your phone locks up after too many failed passcode attempts, which reduces the chance for someone to break into your phone. I wouldn't have thought of this, but Google notes that it has included protections against children that try to break into your phone, by not counting identical passcode attempts against this retry limit. And while it isn't new, Google highlighted that since late 2025, all features and apps that use Android Biometric Prompt now work with Identity Check, which prevents unauthorized users from changing sensitive settings without a successful biometric authentication—meaning a face or fingerprint scan. \nThe company also announced enhancements to features that are available to devices running at least Android 10. First is an update to Remote Lock, which lets you lock up your phone from a web browser if it is stolen or goes missing. Now, you can set up a security question as part of the unlocking procedure. Even if someone knows your credentials, they'd need to know the answer to your security challenge before they could unlock your device. Tip: If you make the answer something nonsensical, you'll be even more protected (e.g., What is your mother's maiden name? h7r_t*2#). Just be sure to file that answer somewhere safe, like a password manager.\n            \n                What do you think so far?\n            \n        \nUsers in Brazil also have two new security settings enabled by default. The first is Theft Detection Lock, which can detect when your device has been snatched out of your hand in a likely theft situation. The second is Remote Lock, so users in Brazil can take advantage of the above benefits without having to set anything up first—other than the option security challenge question, of course. These updates might not be revolutionary, but they should help boost your Android's security a bit—and prevent your kids from locking you out of your phone for the day.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Just Updated These Android Theft Protection Features",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG59AYX4SVNDB1CTG2PFZXAJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-29T17:01:43.000Z",
      "dateModified": "2026-01-29T17:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "10 Hacks Every 'Google TV Streamer' User Should Know",
    "url": "https://lifehacker.com/tech/google-tv-streamer-hacks-you-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFPQF53NTM2NEAGD4AVZM8E5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-28T15:00:00.000Z",
    "description": "\n    \n                    \n        \n        \n        \n    \n                                Florence Ion\n                            \n        \n        ",
    "body": "\n    \n                    \n        \n        \n        \n    \n                                Florence Ion\n                            \n        \n            Florence Ion\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceI cover Android, smartphones, and the smart home. Sometimes, I cover Windows and streaming, too!\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        January 28, 2026\n            \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        The launch of the Google TV Streamer marked a significant shift for the company's streaming lineup, moving away from the behind-the-TV Chromecast dongles it popularized and introducing a pill-shaped set-top box that blends in nicely on a shelf of tchotchkes. It's hiding a worthy processor, double the memory you'd get from a streaming stick, and enough storage to download what you need to run all of your apps. It even acts as a smart hub, with Matter and Thread built in. It's taken me a long time to do anything with the Google TV Streamer. I reluctantly brought it into my home after realizing something more robust, but dated, like the Nvidia Shield, would be too much to manage alongside maintaining a home server. But since then, I've tweaked several things on the set-top box and enabled features I hadn't been using, turning it into a helpful hub in my living room.Enable \"Find my remote\" to never lose your Google TV Streamer remote againThis sounds like an obvious tip, but I've had the Google TV Streamer since it debuted in 2024, and it wasn't until this week, while writing this piece, that I finally enabled the remote finder. I had skipped it during the initial setup. The option is available in Settings > Remotes & Accessories. You'll see the Find my remote option in there.\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nThe Google TV Streamer has a physical button on the back of the device that lets you locate your remote if it's stuck somewhere on the couch. But what if you can't reach the streamer behind the TV? Try one of your Google-enabled voice devices instead. If you have a Nest speaker or a Pixel phone nearby, say \"Hey Google, find my remote.\" The remote should start chirping if you've set it up.Set up the Google TV Streamer remote shortcutThe remotes that come with the Google TV Streamer feature a tiny, unregistered button with a star icon right next to the power button. By default, this shortcut does nothing! But you can change that in the device's system preferences.\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nIn Settings > Remotes & Accessories > Set up remote buttons, select one of three options for customizing the shortcut button. I set it up as my Google Home shortcut so I can easily turn the lights on and off from the couch. You can also set it up as a launcher for another app installed on the set-top box. Or create a shortcut to cycle through device inputs—this button is on legacy Chromecast devices with an included remote. It was removed from this generation of streaming devices, so if you miss it, you can spoof it back.For serious power users, map the shortcut to an app like Projectivity Launcher to make it a more powerful launcher button.Remap other buttons on your Google TV Streamer remote to be more useful\n    \n            \n            What Button Mapper looks like running on Google TV.\n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nDon't care for the default YouTube or Netflix buttons included on the Google TV Streamer remote? You can remap them with a third-party app, then affix a small sticker to indicate what it does. Install an app like Button Mapper or tvQuickActions. Then go to Google TV Settings > System > Accessibility, and turn on the service. After that, you can head back into the app to adjust what those physical buttons do. You can set them as shortcuts to other apps, or even something cheekier for others to discover when they press the button. Remove the clutter from the Google TV Streamer home screen\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nCan't stand all the recommendations and sponsored content Google TV suggests in the main carousel? You can effectively shut off some of the clutter so it doesn't visually overwhelm you. Go to Settings > Accounts & Sign-In > Your Account. and toggle on Apps only mode.This clears the clutter and \"sponsored\" content, leaving you with just app icons. Keep in mind that this turns off the \"Watchlist\" feature that's tied to your account and some Gemini voice search capabilities for specific content.Enable Google TV Streamer \"Developer options\" for more customization \n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nYou'll need to enable developer options to enable features like faster animations and side-loading apps. It's easy to set up, and it's just like on an Android smartphone. Head into Settings > System > About, then tap Android TV OS Build 7 times.You'll see a little dialog pop up to let you know you've got developer access. Once enabled, a new menu will appear under Settings > System > Developer options.Limit animations to make navigation fasterThe Google TV interface is organized and functional, but its animations can slow down menu navigation. You can eliminate these animations and tweak other visual elements to speed things up deep within the developer settings.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nIn Developer Options, scroll down to Window animation scale, Transition animation scale, and Animator duration scale. Change one of these, or all three, from 1x to Animation off to turn off animations completely. You can also go the other way and effectively \"overclock\" the animations to speed them up, making them appear smoother. Side-load apps or an alternative launcherWith developer options turned on, you can enable USB and wireless debugging to use apps like Send Files to TV and atvTools to sideload APKs. But first, enable the \"Allow installs from unknown sources\" option in the Developer Options under Security settings. This allows APKs you've transferred over to the device to run on the streamer.Why would you want to go through the fuss of connecting to the Google TV Streamer this way? Because then you could access alternative streaming apps not available in the Play Store, or even an alternative launcher, like LeanbackLauncher.Pair headphones to your Google TV Streamer for private listening\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nThis is one of my favorite little hacks that comes especially in handy when living in a house occupied by other people. When I do my workouts in the living room, I use a set of Bluetooth earbuds connected to the Google TV Streamer so I can hear the instructor's directions even when I'm face down in a plank and my kid is screaming in the background.The ability is available in the same submenu where you set up your remote. In Settings > Remote & Accessories > Pair Remote/Accessory, put your audio device into Bluetooth pairing mode, then watch it come up on the screen as an option. If you're successful, you can now pop on the buds when you need to. Be aware that audio latency can occur, and you might need to restart the connection—it is Bluetooth, after all.  Force your Google TV Streamer to choose the best resolution, regardless of bandwidthIf you don't care about your bandwidth and want full-resolution streaming at all times, you can set the best resolution to display as the default in your Google TV Streamer preferences. Go to Settings > Display & Sound > Resolution. Switch the Resolution from \"Automatic\" to 4K 60Hz, or whatever your TV's peak is. Once this is enabled, the Google TV Streamer won't downscale to 1080p. If you're a sucker for HDR, this is the same menu where you can turn it on so that it's always in high definition.The USB-C port can do more than charge up the Google TV Streamer. You can plug in a power delivery hub with extra ports to add components like external storage and effectively run your own all-in-one home media center. Those power delivery hubs usually include extra USB ports for peripherals, so you can hook up things like keyboards and game controllers for extra fun.  \n            \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n                        \n                \n            \n                    \n                                            \n                \n            \n                Florence Ion\n                                I cover Android, smartphones, and the smart home. Sometimes, I cover Windows and streaming, too!\n                Read Florence's full bio\n                            \n        \n                \n                                            \n    More by Florence\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 Hacks Every 'Google TV Streamer' User Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFPQF53NTM2NEAGD4AVZM8E5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-28T15:00:00.000Z",
      "dateModified": "2026-01-28T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Pixel Bug Leaked Audio to Incoming Callers, and Google’s Fix Might Not Be Enough",
    "url": "https://lifehacker.com/tech/google-pixel-take-message-bug-fix-might-not-be-enough?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG55CS8P1P9M39PKS8YV54MQ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-29T16:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: IrinaKobrina/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Google's Take a Message feature for Pixel was reportedly leaking audio to incoming callers.\n                                            Google has disabled it on the Pixel 4 and 5, but some users suggest it can affect newer Pixels, too.\n                                            You can disable Take a Message manually, if you're concerned.\n                                    \n            \n    Table of Contents\n    \n        \n        A recent Google Pixel feature is reportedly turning on the microphone when it's not supposed to, and Google's finally acknowledged that there's a bug. Reports started as early as last September and gained traction last week, and now, Google has removed the feature on some older phones.Called \"Take a Message,\" the buggy feature was released last year and is supposed to automatically transcribe voicemails as they're coming in, as well as detect and mark spam calls. Unfortunately, according to reports from multiple users on Reddit (as initially spotted by 9to5Google), the feature has started turning on the microphone while taking voicemails, allowing whoever is leaving you a voicemail to hear you. Audio leaks are bad in any circumstance, but they must feel especially nasty if you're trying to pretend you're not there.Affected users have have found that while the caller can hear the audio from the person receiving the voicemail, there's no indication on the receiver's end that their audio can be heard, aside from the green microphone indicator possibly turning on.\nThe issue has been reported affecting Pixel devices ranging from the Pixel 4 to the Pixel 10, and on a recent support page, Google's finally acknowledging it. However, the company's action might not be enough, depending on how cautious you want to be.According to Community Manager Siri Tejaswini, the company has \"investigated this issue,\" and has confirmed it \"affects a very small subset of Pixel 4 and 5 devices under very specific and rare circumstances.\" The post doesn't go any further on the how and why of the diagnosis, but says that Google is now disabling Take a Message and \"next-gen Call Screen features\" on these devices.\n            \n                What do you think so far?\n            \n        \nNext-gen Call Screen is a separate feature that allows Google's AI to ask a caller their name and the purpose of their call before taking a message. No bugs have been reported for it, but Google says it's disabling both features out of \"an abundance of caution.\"While this should prevent the issue from popping up for users with those phones, it's a bit of a heavy-handed fix. I've reached out to Google to check if Take a Message is only being removed temporarily while the company fixes the bug, or if it will now be permanently gone. In the meantime, Tejaswini does say that Pixel 4 and 5 owners will still be able to use manual and automatic Call Screening, which provide basic protection against spam. The post also suggests that affected users can rely on any call screening features provided by their cellular carriers.How to disable Take a Message on your Pixel phoneWhile it's encouraging that Google is taking action on the Take a Message bug, the company only seems to be acknowledging it for Pixel 4 and Pixel 5 models, at least for now. I've asked Google whether owners of other Pixel models should be worried, as user reports seem split on this. Still, because some have mentioned an issue with even the most up-to-date Pixel phone, if you want to practice your own abundance of caution, it might be worth disabling Take a Message on your device, regardless of its model number.To do this, open your Phone app, then tap the three-lined menu icon at the top-left of the page. Navigate to Settings > Call Assist > Take a Message, and toggle the feature off.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Pixel Bug Leaked Audio to Incoming Callers, and Google’s Fix Might Not Be Enough",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG55CS8P1P9M39PKS8YV54MQ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-29T16:30:00.000Z",
      "dateModified": "2026-01-29T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suunto’s New Route Planner Is Free and Awesome",
    "url": "https://lifehacker.com/health/suuntos-new-route-planner-is-free-and-awesome?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG0F2QXWDZA0WZWKG4P7QZ3W/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-28T15:30:41.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            \n        \n            Meredith Dietz\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceMeredith is a marathon runner and stand-up comedian. As Lifehacker’s Senior Staff Writer, she covers personal fitness tech, home gym equipment, and more.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Screenshot courtesy of Suunto.\n                            \n    Table of Contents\n    \n        \n        Something you don't see every day: a sports tech company actually giving away premium features for free. Suunto's route-planning tool lets you create and download GPX files without even creating an account. No paywall, no trial period—just open the page and start planning routes. And the tool itself works great.What you can do with the Suunto RouteplannerThe tool packs in everything you'd expect from a paid service, and then some:Route creation that uses different map types (outdoor, satellite, even specialized ones for winter and avalanche terrain)Routing that optimizes for your activity (running, hiking, cycling, mountaineering, roller skating, and more), using actual heat map data from real athletesHeat map overlays for about a dozen different sports so you can see where people actually goElevation profiles with ascent and descent numbers (crucial for not dying on climbs you didn't see coming)Export routes as GPX files that work with basically any GPS deviceShareable link generation (good for six months) so you can send routes to friends without making them create accounts eitherAbility to import and modify existing GPX or FIT files from other platformsOptional account sync if you own Suunto or Hammerhead gearYou don't even need to be in Suunto's ecosystem to use this. I was able to export a map to my Garmin watch with no problem. If you do have a Suunto or Hammerhead device, you can link your account and routes will sync automatically. \nHow to use the Suunto RouteplannerGo to routeplanner.suunto.com. From there, creating a route is pretty straightforward. If you let your browser share your location, it'll center on where you are. If not, just search for wherever you want to start. The controls on the right side let you switch between map types. The usual suspects are there: outdoor, satellite, light, dark. But then it gets weird in the best ways with a winter map, an avalanche terrain map for backcountry stuff, and, in a show of national pride, a dedicated Finland Terrain map. Respect.To actually connect points on the map, you have the following options:Free drawing (no automatic routing)Any road or path (ideal for activities by foot)All road types—avoiding hills (ideal for bikes)All road types (still ideal for bikes)Paved roads (ideal for road cycling)After you create your route, you simply download the GPX file and throw it on whatever GPS device you own.\n            \n                What do you think so far?\n            \n        \nThe six-month shareable links are a nice touch too. You can plan a route for a group ride or run, send everyone the link, and they can grab it without jumping through hoops. It's the kind of friction-free sharing that should be standard but somehow isn't.Why you should try the Suunto RouteplannerStrava and Komoot have trained users to expect paywalls for route planning. Of course, this could be strategic on Suunto's part, to give away the software in the hopes of selling the hardware. Or maybe it's just goodwill after years of user complaints about Suunto closing their tracking system Movescount. Either way, users win. You get a legitimately useful tool without opening your wallet or handing over your email address.If you're already paying for route planning elsewhere, try this first. Worst case, you waste five minutes. Best case, you cancel a subscription and pocket the savings. Even if you'e not looking to save money, having another route planning option in your toolkit doesn't hurt.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suunto’s New Route Planner Is Free and Awesome",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG0F2QXWDZA0WZWKG4P7QZ3W/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-28T15:30:41.000Z",
      "dateModified": "2026-01-28T15:30:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Phishing Scam Comes From a Real Microsoft Email Address",
    "url": "https://lifehacker.com/tech/microsoft-phishing-email-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG31CJ9A2VSJSXBVSF3ZPD81/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-29T13:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            A new scheme abuses a Microsoft subscription feature to send phishing emails from a real address that the company advises users to add to their allow lists.\n                                            The messages include (fake) billing receipts with large purchase amounts from services like PayPal, Norton LifeLock, and Microsoft 365.\n                                            Threat actors capitalize on the trust users have in the brands they're exploiting along with scare tactics.\n                                    \n            \n    Table of Contents\n    \n        \n        As scammers continue to find ways to impersonate known brands, users should remain wary of spam-like emails—even if they appear to come from a legitimate company address. Ars Technica has identified a scheme that abuses a Microsoft subscription feature to send phishing emails from [email protected], a real address that the company advises users to add to their allow lists. How the Microsoft Power BI scam worksUsers targeted with this scam have received emails from an address connected to Microsoft Power BI, a business analytics platform. The messages include (fake) billing receipts with large purchase amounts from services like PayPal, Norton LifeLock, and Microsoft 365 and a phone number to call to dispute the transaction. \nScammers on the other end of the line may try to convince you to install a remote access application that allows device takeover or will otherwise extract personal information. As with any phishing scam, engaging in any way—calling the number, responding to the email, or clicking links—could put your data and your device at risk. \n            \n                What do you think so far?\n            \n        \nThe emails themselves are full of typos and grammar errors and urgent calls to action that are, in most cases, completely unrelated to Microsoft itself. Many users would spot these red flags and know to simply delete the message. However, threat actors capitalize on the trust users have in the brands they're exploiting along with scare tactics to trap some people in the scheme.  This is also far from the first phishing scheme of its kind: Threat actors have sent malicious emails from legitimate PayPal and Google addresses (to name just two) by exploiting similar loopholes. In the case of PayPal, fraudulent purchase notifications sent from service[at]paypal[dot]com abused the platform's subscription billing feature. With Google, scammers registered google.com subdomains via Google Sites and linked them with Google Accounts. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Phishing Scam Comes From a Real Microsoft Email Address",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG31CJ9A2VSJSXBVSF3ZPD81/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-29T13:30:00.000Z",
      "dateModified": "2026-01-29T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "12 Hacks Every Roku User Should Know",
    "url": "https://lifehacker.com/tech/hacks-every-roku-user-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFGGX99JJJD4W78EZ93VERA2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-27T14:00:00.000Z",
    "description": "\n    \n                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n         ",
    "body": "\n    \n                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        January 27, 2026\n            \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        Roku was one of the original names in streaming, and even with so many options now available from Amazon, Apple, Google and others, it remains one of the most popular options thanks to its affordable boxes and streaming sticks and widespread availability as an integrated operating system on some TV sets. The platform is speedy, simple, and supports just about every streaming app out there.If you've got a Roku or two in your life, you may not be using it to its full potential. These tips, hacks, and hidden features should help you go beyond the basic business of launching your streaming apps and get more out of your hardware, whether you've just unboxed your first Roku device, or you've been using one for years.Set up PIN protection to protect your RokuIf you've got young kids or nosy housemates living with you, you can lock certain parts of the Roku experience (including making purchases and adding new channels) behind a PIN number. This is actually done through your Roku account page on the web: Click PIN/parental controls on the left, and you can set a new PIN or change an existing one.Change the look and feel of your Roku with a new themeYou don't have to settle for the standard Roku interface visuals—you can easily switch to a different theme (which basically means a different wallpaper and screensaver). From Settings on your device, choose Themes to see alternatives provided by Roku and other people in the Roku community. You can always pick Restore default theme to go back to the original look.Enable captions on replayYou might not want closed captions on all the time, but you can have them enabled whenever you skip backward. From the home screen, pick Settings > Accessibility > Captions mode > On replay to enable this. Note that the streaming app you're using needs to support the feature as well, so it may not work everywhere.Put your most-watched apps up topThis is a simple and effective one that you might not have got around to doing: You can organize the apps on the home screen so your most-used are nearer the top and easier to get to. Select any tile on the home screen, press the star button on your remote to bring up the context menu, and you'll see the Move app and Move app to top options.Make use of Guest Mode when you have company\n    \n            \n            Roku devices come with a Guest Mode included.\n                                        Credit: Lifehacker\n                    \n    \nIt's great having guests—but don't let them mess up your recommendations and viewing progress. You can put your Roku device into Guest Mode by opening Settings from the main Roku menu, then choosing Guest Mode > Enter Guest Mode. You'll be signed out of all your apps, and the Roku device will restart ready for someone else to use it.Send your photos to your Roku to view them on the big screenYou won't always be watching films and shows on your Roku of course—and when your streaming device isn't doing anything else you can get images from your Google Photos library up on your TV. To set this up, you need to head to the Photostreams page on the Roku website, sign in using your account, and then follow the instructions online.Set up a cross-platform Roku watchlistThere will often be times when you see something interesting, but don't have time to watch it right away, and that's when the Roku watchlist feature can help. Select any movie or show from the home screen, and on the listing page use the Save button to add it to your list: You can then pick Save List from the main menu to see what you've saved.Pair your Bluetooth headphones to your RokuIf you've got a pair of wireless Bluetooth headphones and a Roku device that supports Bluetooth, you can pair the two together for some private audio listening— handy if you don't want to disturb anyone around you. You can do this by heading to Settings from the main Roku menu, then choosing Remotes & devices > Wireless headphones.\n            \n                What do you think so far?\n            \n        \nListen to your Roku via your smartphoneThere's another way to listen through headphones, and it doesn't require Bluetooth or wireless headphones. If you install the aforementioned Roku app on your smartphone, then plug a pair of headphones into your phone as well, you can tap Remote control in the app and then the headphone button to stream the audio right to your ears.\n    \n            \n            You can use the mobile app to listen over headphones.\n                                        Credit: Roku\n                    \n    \nMirror your other devices to your RokuApple devices: Roku sticks, boxes and TVs come with support for the Apple AirPlay standard built right in, so you can beam across audio and video from Apple devices, or even mirror your Mac display on the big screen. On the Roku, choose Settings then Apple AirPlay and HomeKit to make sure you're set up, then just select the AirPlay button on your Apple hardware.Android devices: For screen casting, you're not left out if you're on Android, though—as usual with Android—capabilities vary between devices. Samsung Galaxy phones have the smoothest integration: Swipe down with two fingers from the top of the screen, choose Smart View, and your Roku should show up as a connection option (if it's on the same wifi network).Windows devices: If you want to mirror your screen to a Roku from Windows, the process is different again. First, enable the feature on the Roku via Settings > System > Screen mirroring. Next, from Windows, click the volume and wifi icons down in the lower right corner, click the Display button, then select your Roku. Again, it needs to be on the same wifi network.Quickly find the cheapest way to rent a show or movieIf you're in the mood for a movie rental, then you've got a whole host of different streaming services to choose from—all the big ones offer film rentals on top of the content you get with your subscription. Use the Search option from the main Roku menu to look for a title, and compare the different prices across all the services you're signed up to.Control your TV with your Roku remoteYou can turn your TV on and off and adjust its volume with your Roku remote, if you'd like to. You're asked if you want to do this when you first set up your Roku device, but you can configure it afterwards too: Pick Settings > Remotes & devices > Remotes, then choose the remote you've currently got connected, and then pick Set up remote for TV control.\n            \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n                        \n                \n            \n                    \n                                            \n                \n            \n                David Nield\n                                \n                                            David Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. \n                                    \n                Read David's full bio\n                            \n        \n                \n                                            \n    More by David\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "12 Hacks Every Roku User Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFGGX99JJJD4W78EZ93VERA2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-27T14:00:00.000Z",
      "dateModified": "2026-01-27T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Eufy Outdoor Camera Bundle Is $250 Off Right Now",
    "url": "https://lifehacker.com/tech/eufy-outdoor-camera-bundle-deal-february-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGF7B80FZNWFXECTQA20190T/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-02T13:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 2, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Adding outdoor security cameras to your home setup can get expensive fast, especially once you factor in subscriptions and extra hardware. This deal on a Eufy SoloCam E30 four-pack makes that math a little more palatable. It’s currently $299.99 on Amazon, down from its usual $549.99 price, which is the lowest price it's ever been, according to price-tracking tools. That brings each camera to about $75, which still isn’t cheap, of course—but unlike many other camera brands, these don't require a monthly subscription, which is a great perk.\nEach of these IP65-rated cameras runs on internal batteries that last about three months between charges, depending on how often motion is detected. Solar support helps extend that. Eufy says around two hours of direct sunlight per day is enough to keep them topped up. You can also hardwire the cameras if you want continuous recording, including short pre-roll clips, though the power cables are sold separately. You also get 360-degree pan and 70-degree tilt coverage per unit, which helps cut down on blind spots around driveways or yards. Video is captured in enhanced 2K resolution with an f/1.6 aperture, making nighttime footage via infrared night vision fairly crisp. There’s no built-in spotlight, so there's no color night vision here, but for general monitoring, black-and-white is often enough.\n            \n                What do you think so far?\n            \n        \nFootage can be stored locally on the included HomeBase S280, which has 16GB built in, or on a microSD card up to 128GB (sold separately) if you want more space. Smart home support includes Alexa and Google Assistant, but Apple HomeKit is not supported. Two-way audio is included, and the HomeBase can support up to 16 cameras, so expanding later is an option. This setup is not for people who want cloud storage or advanced smart home integrations. It makes more sense for those who want local control, predictable costs, and broad coverage without wiring the entire house.\n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Eufy Outdoor Camera Bundle Is $250 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGF7B80FZNWFXECTQA20190T/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-02T13:30:00.000Z",
      "dateModified": "2026-02-02T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Well-Reviewed Outdoor Camera Is Nearly 30% Off Right Now",
    "url": "https://lifehacker.com/tech/tapo-magcam-2k-plus-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG7J355X9Z5YXEY1AE38HZP6/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-30T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 30, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon/Lifehacker \n                            \n    Table of Contents\n    \n        \n        There’s no shortage of outdoor security cameras, but finding one that balances video quality, battery life, and ease of use without pushing past $100 is rare. Right now, the Tapo MagCam 2K+ is on sale for $64.98 on Amazon, down from $89.99, which is its lowest price to date, according to price trackers.\n PCMag named it the best security camera of 2024, pointing out that while battery-powered cameras often trade convenience for frequent recharging, the MagCam 2K+ avoids that issue with a 10,000mAh battery rated to last up to 300 days per charge, depending on how often it records.Charging happens over micro-USB, though there’s an optional Tapo A200 solar panel ($35.99) if you want to avoid manual recharging altogether. Video tops out at 2K resolution, with a wide 150-degree field of view that works well for driveways or side yards. During the day, footage looks sharp and detailed. At night, the camera can switch between infrared black-and-white or color video using its built-in spotlights and starlight sensor. Storage is flexible. You can record locally to a microSD card, up to 512GB (card not included), or you can go with cloud storage through a Tapo Care plan starting at $3.49/month.\n            \n                What do you think so far?\n            \n        \nAlerts can distinguish between people, pets, and vehicles, and those intelligent notifications are free, as highlighted by PCMag in its “outstanding” review of the MagCam 2K+. It also integrates smoothly with Alexa, Google Assistant, and IFTTT, though it doesn’t support Apple’s HomeKit. You also won’t find mechanical pan or tilt, but the fixed lens covers enough ground for most yards or porches. As for managing the camera, its companion app is intuitive, offering settings for motion sensitivity, siren activation, spotlight brightness, firmware updates, and more. Overall, the MagCam 2K+ handles the basics well and throws in a few smart features usually reserved for pricier models.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Well-Reviewed Outdoor Camera Is Nearly 30% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG7J355X9Z5YXEY1AE38HZP6/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-30T14:00:00.000Z",
      "dateModified": "2026-01-30T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Some of Sony’s Best Budget Earbuds Are Half Off Right Now",
    "url": "https://lifehacker.com/tech/sony-wf-c510-wireless-earbuds-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG57NPF5CQ2J5CZNYEXD4NGF/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-29T18:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Woot\n                            \n    Table of Contents\n    \n        \n        If you need a pair of basic, true wireless earbuds at a low price and don’t need features like noise cancellation, the Sony WF-C510 earbuds are worth considering. Known for their comfort and balanced sound, these affordable buds check most of the everyday features people are looking for (like Ambient Sound Mode and multipoint Bluetooth) at a fraction of the cost—and right now, Grade A refurbished Sony WF-C510 wireless earbuds is available on Woot for $34.99, which is less expensive than their lowest recorded price on Amazon, according to price-trackers.\nThe WF-C510 earphones are Sony’s most affordable option, combining comfort for long listening sessions with a functional design and solid sound. They have a compact, lightweight charging case and work with Sony’s companion app. With a small, stemless design, on-bud physical buttons, and swappable ear tips, they closely resemble the brand’s more expensive earbuds. According to this PCMag review, the earbuds deliver “deep bass and high-end clarity without distortion” and perform similarly to pricier buds. While they don’t have noise cancellation, they do have Ambient Mode, which lets you hear your surroundings naturally while they're on. Battery life lasts up to 11 hours with Ambient Mode off, and the case holds an additional 11 hours. While the earbuds are generally comfortable thanks to customizable tips and a snug fit, pressing the buttons can push them slightly into your ear, which may cause discomfort for sensitive users. That said, others may prefer physical controls over touch controls, which can be overly sensitive and lead to accidental activations.They have an IPX4 rating, which protects against splashing and light rain, but shouldn’t be submerged in water. They have 6mm drivers that produce frequencies between 20Hz and 20kHz and support. While they have limited codec support (they only use AAC and SBC rather than LDAC), they support Bluetooth multipoint connections with up to two devices. Despite the low price, these refurbished Sony WF-C510 wireless earbuds deliver respectable audio performance, a comfortable build, and a compact case with an extra charge. If you don’t need high-resolution Bluetooth codecs, touch controls, or noise-cancelling features, they’re a dependable option, especially at just $34.99. \n            \n                What do you think so far?\n            \n        \nWoot only ships to the 48 contiguous states in the U.S, and if you have Amazon Prime, you get free shipping; otherwise, it’ll be $6 to ship. The earbuds may come with signs of wear, but with a Grade A rating, these will be very limited. If you do run into any issues, they come with a  1 Year eReplacements Limited Warranty.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Some of Sony’s Best Budget Earbuds Are Half Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG57NPF5CQ2J5CZNYEXD4NGF/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-29T18:00:00.000Z",
      "dateModified": "2026-01-29T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Highly Rated Wi-Fi 6E Mesh System Is $150 Off Right Now",
    "url": "https://lifehacker.com/tech/tp-link-deco-xe75-pro-wi-fi-6e-mesh-system-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG2HR89X1DGJ53526V6M33VW/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-28T16:00:01.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Lifehacker / Amazon\n                            \n    Table of Contents\n    \n        \n        At $249.99 for a three-pack, the TP-Link Deco XE75 Pro Tri-Band Mesh System is sitting $150 below its usual $399.99 price, and price-trackers show this is the lowest it has gone so far. That discount matters because this is not an entry-level mesh kit. It’s built around Wi-Fi 6E, which adds access to the cleaner 6GHz band alongside the familiar 2.4GHz and 5GHz bands. In practice, that means less congestion if you have newer devices that support 6E, and more consistent speeds across a larger home. The three cylindrical nodes are understated and easy to place, each covering a chunk of space so the full kit can handle homes up to roughly 7,200 square feet. Setup happens through the Deco app and is largely painless, even if you are not used to managing network gear.\nEach node includes a 2.5GbE WAN port, which is useful if your internet plan is already pushing past standard gigabit speeds. You also get two additional 1GbE LAN ports per node, plus support for wired backhaul if you want to connect the units with Ethernet instead of relying on wireless links. Internally, TP-Link uses a 1.7GHz quad-core processor and multiple internal antennas to keep traffic moving smoothly. What you do not get are USB ports, so there’s no option to plug in a drive or printer directly. That omission may not matter for most people, but it is worth noting at this price.\n            \n                What do you think so far?\n            \n        \nAs for its performance, PCMag’s testing showed reliable throughput across bands, and the publication gave the system an “excellent” rating in its review, calling it easy to manage and a solid value for large spaces. Management leans heavily on the mobile app, which is simpler than the web interface and good enough for everyday use. TP-Link includes its HomeShield tools for basic parental controls and security scanning, but some of the more detailed features sit behind a paid subscription. That may be a drawback if you want everything included upfront. Still, for homes with many devices, fast internet, and a need for wide coverage, this deal makes the Deco XE75 Pro a much more reasonable buy than it is at full price.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Highly Rated Wi-Fi 6E Mesh System Is $150 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG2HR89X1DGJ53526V6M33VW/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-28T16:00:01.000Z",
      "dateModified": "2026-01-28T16:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]