[
  {
    "title": "What RCS Messaging Between iOS and Android Can and Can't Do (Yet)",
    "url": "https://lifehacker.com/tech/rcs-messaging-between-ios-and-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9YT0Y2W6ZZK770BZ581KAX0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-13T16:00:00.000Z",
    "description": "\n        \n        Apple brought RCS (Rich Communication Services) messaging to the iPhone with iOS 18 last year, giving green-bubble users access to m",
    "body": "\n        \n        Apple brought RCS (Rich Communication Services) messaging to the iPhone with iOS 18 last year, giving green-bubble users access to more features and functions. But what exactly is possible with RCS on the iPhone, and what is still exclusive to iMessage users? Are Android RCS users now fully integrated into chats in the iOS Messages app or not?I'll lay out exactly what you can do in RCS chats between iPhones and Android phones, and explain which features are still missing—and when you might be able to get them.  If you've got contacts on other mobile platforms, this should help you understand more about what the experience is like from their end.To use RCS, you must have a carrier that supports it (most now do). On an iPhone, open Settings, then choose Apps > Messages > RCS Messaging to enable it. In Google Messages on Android, tap your profile picture (top right), then choose Messages settings and RCS chats to turn on the feature.\nRCS on iOS and Android: what you can do Ever since iOS 18, RCS messaging has officially been supported in the iOS Messages app—specifically, via the RCS Universal Profile 2.4. This brings green bubble Android users closer to parity with iMessage users, though some features only work in one direction, and some features only work in one-to-one conversations and not group chats.One notable upgrade is support for high-resolution photos and videos, which should work seamlessly across all your RCS-enabled conversations, with no more issues around compression or transfer. Web links look better as well, because you'll get a proper preview shown on both Android and iOS, and you can share current locations too (though only as a static pin, not a live and updating one).\n    \n            \n            Web links now look much better between iOS and Android.\n                                        Credit: Lifehacker\n                    \n    \nTyping indicators and read receipts are supported in both directions, assuming you've got them enabled on your devices. However, they don't work in group chats—RCS users on Android can now join group chats, but the experience can be buggy based on reports, and you lose the typing indicators and the read receipts.Emoji reactions are now supported, up to a point—but based on my testing, these only work from iPhone to Android. If you try and send an emoji reaction in the other direction, iPhone users will just get a separate text showing the emoji (it won't appear as a bubble on top of the original message).\n            \n                What do you think so far?\n            \n        \nRCS on iOS and Android: what you can't do (yet)If you look at everything you can do in iMessage (with other iMessage users) and Google Messages (with other Android RCS users), you'll realize there's a long way to go when it comes to cross-platform support. For example, at the moment you can't unsend messages, or reply inline in a thread, either from Android to iPhone or iPhone to Android.You can edit messages, but only if you're an Android user messaging an iPhone user—and with the caveat that the iPhone user gets two texts (the original message and the edited message, which rather defeats the point). The ability to edit messages on an iPhone simply doesn't appear in an RCS conversation.\n    \n            \n            Message editing is something that doesn't quite work yet.\n                                        Credit: Lifehacker\n                    \n    \nAnother missing feature is end-to-end encryption for your chats and files shared in them. Apple has promised that support for this in RCS conversations is on the way, though it hasn't shown up yet—not even in iOS 26. This should give you pause when it comes to sharing sensitive information in these chats.Full end-to-end encryption is part of the RCS Universal Profile 3.0, which Google is testing in beta and which Apple has yet to adopt. Once this next update finally makes its way to iPhones and Android devices, interoperability will be leveled up again—it should, in theory, bring with it full support for message editing, emoji reactions, and inline replies. Until then, it's something of a half-baked implementation, especially for group chats.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What RCS Messaging Between iOS and Android Can and Can't Do (Yet)",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9YT0Y2W6ZZK770BZ581KAX0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-13T16:00:00.000Z",
      "dateModified": "2025-11-13T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Is Cautiously Experimenting With One of Apple’s Most Controversial AI Features",
    "url": "https://lifehacker.com/tech/ai-summaries-pixel?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9WK33ARD6SXXZP3APSN7Y1Z/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-12T20:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                  ",
    "body": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Top 10 Tech Sales This Week\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            The Pixel is getting AI notification summaries, but only for certain chats.\n    \n        \n    \n                                        \n        \n        \n        November 12, 2025\n    \n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            Google Pixel 9 and Pixel 10 are getting AI notification summaries.\n                                            The summaries only apply to chat apps for now.\n                                            You need to opt-in to the AI summaries to see them.\n                                    \n            \n    Table of Contents\n    \n        \n        Google is adding one of the iPhone's most controversial features to its latest Pixel phones, but it's promising to show a bit more restraint than Apple did. Yes, as part of the November 2025 Pixel feature drop, Pixel 9 and Pixel 10 phones (excluding the Pixel 9a) are getting AI notification summaries.The problem with AI notification summariesIf you're reeling back after reading that, I don't blame you. This is one of the few AI features Apple beat Google to the punch on, and when they came out during the iOS 18.3 beta, the summaries were quickly criticized for handling hard topics like breakups with a cold tone, as well as for misreporting the news.Apple quickly pulled news summaries (although they've since come back) and made it clearer when an AI was writing a notification, but it seems Google's still being a bit more cautious with its launch.\n        \n            You May Also Like\n        \n    \nHow AI Notification Summaries on Pixel work\n    \n            \n            \n                                        Credit: Google\n                    \n    \nRather than trying to organize every notification you might get, Google's AI Summaries are just starting off with popular chat apps for now, including its own Messages app and alternatives like WhatsApp. Additionally, they'll only kick in on \"longer chats,\" with the idea being to give you, \"digestible conversation recaps.\" That means you're going to see far fewer AI notifications than on the iPhone, which currently uses them for news, entertainment, chats, email, and more. That's probably a safer approach for Google, but it does mean the AI summaries are meant to be used more to get you quickly back up to speed, rather than for organization (although that will change in the future).As on the iPhone, AI notification summaries on the Pixel will be indicated by a small icon with a sparkle and a few lines below it, with the summary following. They'll also be italicized for additional visual distinction.How to turn on AI Notification Summaries on PixelGoogle is also exercising caution by making its AI notification summaries entirely opt-in. That means you'll need to manually turn them on before you start seeing them, which you can do under Settings > Notifications > Notification Summaries. While on this page, you'll also be able to exclude certain apps from sending AI notification summaries, by adding them to the \"Don't include these apps\" list.\n            \n                What do you think so far?\n            \n        \nIf you're still not seeing the summaries after enabling them, ensure your Android System Intelligence is enabled under Settings > Notifications > Privacy > Notification read, reply & control. Additionally, summaries will not be generated while your phone is in battery saver mode, or while you're actively using it (per Google, for them to kick in, \"the screen must be off for a moment\").When will my Pixel get AI Notification Summaries?AI Notification summaries start rolling out today, alongside the November system patch. However, they're not automatically included in the downloadable patch, so it might be a while before you see them (I don't have them yet).It's still not a bad idea to get your phone fully up-to-date in the meantime. To download the November 2025 Pixel update, either wait for a notification from Google, or head to Settings > System > Software updates to manually check if it's been rolled out to you yet.What's next for Pixel's AI Notification Summaries?While today's update is clearly just Google dipping its toes in the water, the company does have bigger plans for December, where some Pixels will also start automatically silencing \"lower-priority notifications\" and will start automatically sorting them into categories like \"News\" and \"Promotions.\" Hopefully, Google will have learned some lessons from Apple by the time those features go live.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Is Cautiously Experimenting With One of Apple’s Most Controversial AI Features",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9WK33ARD6SXXZP3APSN7Y1Z/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-12T20:00:00.000Z",
      "dateModified": "2025-11-12T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Try This Free Plex Alternative Client If You Hate the New Interface",
    "url": "https://lifehacker.com/tech/best-free-alternative-plex-client?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9FZPE8Y0DA878NT4T1VEJKP/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-10T13:00:03.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Try This Free Plex Alternative Client If You Hate the New Interface",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9FZPE8Y0DA878NT4T1VEJKP/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-10T13:00:03.000Z",
      "dateModified": "2025-11-10T13:00:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Update Windows ASAP to Patch Another Zero-Day Vulnerability",
    "url": "https://lifehacker.com/tech/update-windows-asap-to-patch-this-zero-day-vulnerability?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9T9J8GGSE82TAYECX2QQ5NK/hero-image.fill.size_1200x675.webp",
    "tag": "Life",
    "date": "2025-11-11T21:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Update Windows ASAP to Patch Another Zero-Day Vulnerability",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9T9J8GGSE82TAYECX2QQ5NK/hero-image.fill.size_1200x675.webp"
      ],
      "datePublished": "2025-11-11T21:30:00.000Z",
      "dateModified": "2025-11-11T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What People Are Getting Wrong This Week: Kim Kardashian Debunks Psychics",
    "url": "https://lifehacker.com/entertainment/kim-kardashian-debunks-psychics?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9TCCYXG80EQYAYJ9DEBN94T/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-11T22:30:51.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What People Are Getting Wrong This Week: Kim Kardashian Debunks Psychics",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9TCCYXG80EQYAYJ9DEBN94T/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-11T22:30:51.000Z",
      "dateModified": "2025-11-11T22:30:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Add Your Passport to Your iPhone",
    "url": "https://lifehacker.com/tech/you-can-now-add-your-passport-to-your-iphone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9WQQ9Y5AYNX2DW1KP53ME0A/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-12T22:30:28.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Don't expect to travel to another country with it, though.\n    \n        \n    \n                                        \n        \n        \n        November 12, 2025\n                    \n            Credit: Apple\n                            \n            \n                Key Takeaways\n                                            Apple announced \"Digital ID\" on Wednesday, a new feature that lets you add your passport to your iPhone's Wallet app.\n                                            The applications are limited, but you can use your Digital ID at over 250 TSA checkpoints starting today.\n                                            Apple says all ID data is encrypted and stored on-device, so only you have access to it.\n                                    \n            \n    Table of Contents\n    \n        \n        Back in 2021, Apple announced a new feature for the Wallet app, that allowed users to add their driver's licenses or state IDs to their iPhones. To me, it sounded like the beginning of the end for physical wallets. In reality, it was anything but: Not only are the applications limited, but even after all this time, only 12 states and Puerto Rico actually support the feature. While the rest of us wait for our respective states to get on board, many might have another option for these virtual documents. On Wednesday, Apple announced \"Digital ID,\" a new initiative that lets you create an ID in the Wallet app using your passport. This bypasses the waiting period for the 38 states that don't yet support these ID features: If you have a passport, you can try this feature out today. Even if your state supports driver's license and state ID uploads to the Wallet app, you'll miss out on features if you don't have a REAL ID. If you have a passport, however, you can use it instead, which opens up the wallet ID feature to even more users than before. Like previous attempts at virtual IDs, however, don't expect to be able to use this Digital ID just anywhere you'd normally show documentation. Right now, the main use for Digital ID is for flying: According to Apple, Digital ID is launching in beta at over 250 airports to be used at TSA checkpoints. Importantly, this feature only supports domestic flights, even though it uses your passport. As such, do not rely on your Digital ID when flying outside of the U.S. You'll still need your physical passport in order to validate your identity. In the future, however, Apple says you'll be able to use this Digital ID for other purposes, such as booking flights and hotels, as well as opening new accounts.  \n        \n            You May Also Like\n        \n    \nHow to add your passport to your iPhoneTo start, you'll need a valid U.S. passport, an iPhone 11 or later with iOS 26.1 or later, or an Apple Watch Series 6 or later with WatchOS 26.1. First, open the Wallet app on your iPhone, then tap the (+) at the top of the screen. Here, tap \"Digital ID\" under \"United States.\" Here, you'll see a pop-up which informs you about Digital ID. Tap \"Continue,\" then follow the on-screen instructions to scan different parts of your passport using your iPhone's camera. You'll next need to authenticate yourself by taking a Live Photo of your face. Once confirmed, you'll need to capture more angles of your face and head, which the Wallet app directs you through. Once validated, the ID will live in your Wallet app. You can open the Wallet app, or double-click the Side or Home button, then choose the ID whenever you need to present it. When in line at the TSA, for example, you can hold your iPhone with your ID activated near the reader: Once the two connect, the reader will take your photo, while your iPhone will show you all the information you'll be providing to TSA, which can include things like your legal name, date of birth, sex, nationality, ID number, ID photo, expiration date, the date the ID was added, and who verified the ID. You'll need to double-click the Side or Home button to confirm you want to share this data.\n    \n            \n            \n                                        Credit: Apple\n                    \n    \nIs Digital ID secure?Yes, at least according to Apple. The company says that any ID data you add to the Wallet app, be it a passport, driver's license, or state ID, is encrypted and stored on-device. That means that only you have access to this data—not even Apple can see it. In addition, Apple cannot see when you use your ID, nor can they see what data you shared at the time of identification. You also need to use Face ID or Touch ID to authenticate yourself through this process, so even if someone steals your iPhone, they won't be able to obtain that ID data. As stated above, you will see a list of data that will be shared when authenticating with Digital ID. If you aren't comfortable sharing this data with, say, TSA, you don't have to double-click the Side or Home button, and can instead choose another form of authentication. Plus, the way this feature is set up, you don't need to unlock your iPhone or physically hand it over to confirm your iPhone. By double-clicking the Side button or Home button, you can access the ID data without compromising your iPhone. I'm pretty privacy conscious, but this is a feature I'd be willing to try—assuming I fly out of an airport that supports it. I could see how this might be a bridge too far for some people, especially considering the amount of face scanning you need to do to validate the ID. But Apple says in its Wallet app that this data is used to validate your identity and prevent fraud, and is retained only until the issuing authority approves or denies your ID. In other words, whether or not setup is successful, Apple will delete your face scans once the process is over. Seeing as the rest of the data is encrypted, that might just be enough for me to be comfortable testing this out. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Add Your Passport to Your iPhone",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9WQQ9Y5AYNX2DW1KP53ME0A/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-12T22:30:28.000Z",
      "dateModified": "2025-11-12T22:30:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This New Hotel Reservation Scam Is Fooling People Who Use Sites Like Booking.com",
    "url": "https://lifehacker.com/money/hotel-reservation-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9WR83EFZHBAP8C5P8CRJPYM/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-13T15:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This New Hotel Reservation Scam Is Fooling People Who Use Sites Like Booking.com",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9WR83EFZHBAP8C5P8CRJPYM/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-13T15:30:00.000Z",
      "dateModified": "2025-11-13T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This App Makes It Easy for Androids and Macs to Talk to Each Other",
    "url": "https://lifehacker.com/tech/airsync-app-mac-and-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9WSR67Y6EC2X1R3K54WVF30/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-13T14:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This App Makes It Easy for Androids and Macs to Talk to Each Other",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9WSR67Y6EC2X1R3K54WVF30/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-13T14:30:00.000Z",
      "dateModified": "2025-11-13T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Maps' New Power Saving Mode Only Works on One Type of Phone, and That Stinks",
    "url": "https://lifehacker.com/tech/google-map-power-saving-mode-pixel-10?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9WB0DN3CWSZCC5N9JF6FT4W/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-12T16:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Unless you have a Pixel 10, you're not getting the feature—yet.\n    \n        \n    \n                                        \n        \n        \n        November 12, 2025\n                    \n            Credit: Matthew Nichols1/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is rolling out a new Power Saving Mode to Google Maps, but only for the Pixel 10.\n                                            Pixel 10 users can enable the feature when in driving mode, which simplifies the UI to save up to four hours of battery life.\n                                            The feature is likely powered by Android's upcoming AOD Min Mode, which is currently in development.\n                                            It's possible Google will roll out Power Saving Mode to more devices in the future, but nothing is certain at this time.\n                                    \n            \n    Table of Contents\n    \n        \n        If you have a Pixel phone, there's good news, and bad news. The good news? Google is releasing a handful of new features for your device, via its November Pixel Drop. And among the new changes, like Google Photos' Nano Banana upgrade, is something genuinely useful: a new power saving mode for Google Maps. The bad news? Your Pixel probably doesn't support it. According to Google, the new Power Saving Mode is simple to use. Whenever you want to spare your battery some excess power consumption while using driving directions in Google Maps, you can tap a new power button in the app. Once you do, Google Maps will shift into a \"simplified layout\": From Google's press release image, this turns the map black and white, with no discernible elements other than the road, your driving arrow, ETA, and upcoming turns. The feature currently only works with driving directions, so you won't see the option for walking or biking directions, nor can you use it in landscape.\n    \n            \n            \n                                        Credit: Google\n                    \n    \nGoogle says this new layout can save your Pixel's battery life for up to four hours—though that depends on a number of factors, including the assumption that your phone is charged to 100% at the start, and that brightness is set at P90 and Adaptive Brightness is disabled. But if that's true, it could be huge: If you're on a road trip without power, that can keep your phone going much longer. You could either eke out another four hours of navigation time in the car, or actually have some battery to spare when you reach your destination.  \n        \n            You May Also Like\n        \n    \nWhy is this a Pixel 10 exclusive?But before all the Pixel owners of the world get too excited, the feature comes with disappointing fine print. Only Pixel 10 devices—meaning Pixel 10, Pixel 10 Pro, Pixel 10 Pro XL, and Pixel 10 Pro Fold—can use Power Saving Mode in Google Maps. Google: What gives?Google doesn't actually offer any explanation as to why Power Saving Mode is exclusive to its newest line of Pixels. As Android Central notes, the feature likely takes advantage of Android's upcoming AOD Min Mode, which lets apps use the device's Always-on Display to save power while running visually simplistic versions of their programs. AOD Min Mode isn't widely available to developers yet, and will likely arrive with Android 17, but it doesn't seem exclusive to Pixel 10—or Pixel, for that matter. Most Android phones these days have Always-on Displays, so AOD Min Mode should theoretically work with them—not just phones released this year.If I had to guess, Google won't keep this feature locked to the Pixel 10 line forever. The company is probably using this limited rollout as an opportunity to test out AOD Min Mode with a smaller pool of users. Since the Pixel 10 series is the company's newest set of devices, it'd be a prime candidate for a test. The company could then take the feedback and analytics from this beta, and use it to help developers better optimize their apps for this experience. Perhaps then, Google would expand support to more Pixel devices, or more Android devices in general. For now, however, only Pixel 10 users can try out Power Saving Mode in Google Maps. I don't have one of these newest Pixels, but if I did, I wouldn't be surprised if I just kept this mode on all the time. Frankly, it looks cool, and if it saves me battery at the same time, all the better.Google seems to be making battery life savings a priority. Starting next year, the company will start dinging apps that excessively wake the display, either by removing those apps from Play Store discovery pages, or by issuing a warning to users on the app's Play Store page itself.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Maps' New Power Saving Mode Only Works on One Type of Phone, and That Stinks",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9WB0DN3CWSZCC5N9JF6FT4W/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-12T16:30:00.000Z",
      "dateModified": "2025-11-12T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Google Play Store Is Making It Easy to Remotely Uninstall Apps From Your Other Android Devices",
    "url": "https://lifehacker.com/tech/google-play-remotely-uninstall-apps?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9ZDXFS11JMBTJ8JVRW4GY7E/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-13T22:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Google Play Store Is Making It Easy to Remotely Uninstall Apps From Your Other Android Devices",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9ZDXFS11JMBTJ8JVRW4GY7E/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-13T22:00:00.000Z",
      "dateModified": "2025-11-13T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use Time-Blocking to Proactively Schedule Out Your Day",
    "url": "https://lifehacker.com/use-time-blocking-to-proactively-schedule-out-your-day?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GW66KJYRA09FYZG3XKR47/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-12T13:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                  ",
    "body": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Top 10 Tech Sales This Week\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            A more intense schedule is a more productive schedule.\n    \n        \n    \n                                        \n        \n        \n        November 12, 2025\n    \n            Credit: NicoElNino - Shutterstock\n                            \n    Table of Contents\n    \n        \n        There are many ways to set a schedule, from using a pen and paper planner to getting out some dry erase markers and scribbling on your clock. They range from tedious to totally archaic, but there's a technique for everyone. One method I have come to enjoy aims to work by giving you more insight into how you spend your time—and helping you manage your day down to the minute. It’s called time blocking.What is time blocking?Time blocking is the act of arranging your schedule so every activity you need to do in a day is accounted for visually. Ideally, you’ll do this using a digital calendar tool like Google Calendar or iCal, but it's possible with a planner and some highlighters. Even if you’re writing it all down by hand on a piece of paper, consider the way a Google Calendar looks before you start. Each day is represented by a column split up into 15-minute increments, from midnight until 11:59 p.m. When you add a meeting or appointment into the calendar, a box appears and fills up the space representing how much time the event will take out of your day.With time blocking, your goal is to fill the entire column with boxes, leaving no blank space. Even your rest periods should be marked as such (and yes, you need rest periods to be your most productive, so don't skip those). No activity—from having breakfast to running errands to calling your mom—is too small to add to the list. Then, you get to classify everything with a pretty color (when it comes to time management, you have to find your own fun).\n        \n            You May Also Like\n        \n    \nHow to create a time blocking scheduleStart by making a list of everything you’re going to do tomorrow. For instance, you might wake up, check the news, shower, make coffee, commute to work, grab breakfast, answer emails, attend a meeting, get lunch with an old friend, work on a project, commute home, take the kids to a baseball game, pick up dinner, eat that dinner, watch your favorite show, get ready for bed, lie awake thinking about climate change, and actually sleep. Get  granular here. At first blush, you might think your to-do list on a given day is just something like \"hit deadlines at work\" and \"make a doctor's appointment,\" but think of everything else in there, like packing your lunch, driving to the locations, stopping for gas, etc. Once you’ve written out the exhaustive list of your day’s tasks, mark down how long each might (or should) take. This part will take practice because we tend to give ourselves too much time for tasks—and that's bad for multiple reasons. First, you need a bit of urgency and stress (but not too much) to make you productive, so you need a limited amount of time. Second, the longer you give yourself to work, the more you'll drag out that work—and the less you'll get done. Give yourself a few weeks to get in the swing of cutting down the amount of time you estimate each task will take, but commit yourself to eventually shrinking those windows. Then, grab the paper (or open the software) you’re using to time block and enter every single event and responsibility in, according to the time you’ve allotted for it. If you want to see how you are splitting up your day, choose different colors to classify tasks, like blue for grooming/bathing, yellow for work, and green for meals. Be strategic about which tasks make the cut on a given day, though. Use a prioritization technique like the Eisenhower Matrix to determine which of your tasks are actually pressing and which can be bumped to another day. Then, use a to-do list organizing method like 1-2-3 to divvy up your daily time correctly. Remember, your time in a day is finite, so you can't do everything all at once. With 1-2-3, you select one major task, two medium-sized ones, and three smaller ones to do in a day. The smaller ones can be building blocks for the big one or can be simple maintenance activities like answering emails or picking up the dry cleaning.The trick after that is to treat each box the same way you’d treat a meeting: Don’t reschedule it. Don’t mess with it too much. Honor the time commitment it represents, commit to doing the task at the specified time, and do your best to get it done in the time you set aside to do it. This is called time boxing, a similar but slightly different concept that involves giving yourself a set amount of time to do something, only focusing on that task during that time, and stopping your work when the time is up. I've written more extensively on the similarities and differences between time boxing and time blocking, but all you need to know right now is that during the time you set aside to do something on your calendar, you should engage completely in deep work, avoid distractions, and turn all your energy toward the responsibility at hand. As with any pre-planned meeting or event, things will come up that disrupt the schedule, but in the absence of a major upheaval (the kind of thing you’d move a work meeting for), vow to stick with your time blocks.\n            \n                What do you think so far?\n            \n        \nIt's smart here to also implement some kind of time tracking, whether that involves writing down how long your tasks actually take you or using a software to monitor your work, so you can make adjustments to your time blocks as you get better at following the system. During the first week or two, you'll likely be guessing at how long each task will take you when you're building the schedule, but after a while, you should be able to identify if something takes a longer or shorter amount of time than you've been allotting, then adjust the schedule to match those needs going forward.The reason time blocking worksTime blocking is beloved by its adherents. As the Harvard Business Review points out, a regular to-do list gives you way too many choices and not enough structure. Adding in the time element helps you stay on task. Making a visual, color-coded representation of that time keeps you focused and helps you ensure you always know exactly what you're supposed to be doing. There is no more indecision paralysis. You look at your Google Calendar and simply know what to do and how long you have to do it. Plus, if you use a shared calendar with colleagues or your family, everyone else will also know when you're available and what you're doing. It also helps you meet deadlines and stay within your guidelines. If you know a certain project or task will take a combined 50 hours, time blocking helps you space those out and make room for them in your schedule, enabling you to get things done on a set timetable without having to guess whether you really have time for it. If you finish something ahead of schedule, great! Go ahead and add in a little block of time off.A final note on time blockingTime blocking is often confused with time boxing and a lot of productivity blogs and hacks will say \"time boxing\" when they mean time blocking. That Harvard Business Review article above does it, for instance. It's an easy mistake to make and, in fact, in a previous version of this post, I called time blocking time boxing. As long as you're sticking to the plan and making a detailed calendar, it doesn't matter what you're calling it, but this could cause some confusion while you read up on other guides, so just be warned. A complete rundown of the differences between the two can be found here.\n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use Time-Blocking to Proactively Schedule Out Your Day",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GW66KJYRA09FYZG3XKR47/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-12T13:00:00.000Z",
      "dateModified": "2025-11-12T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Windows 11 Users Will Get a Major Start Menu Redesign This Week",
    "url": "https://lifehacker.com/tech/windows-11-users-will-get-a-major-start-menu-redesign-this-week?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9QA2127FBQPGRWB62MZ23GD/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-10T18:00:30.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Windows 11 Users Will Get a Major Start Menu Redesign This Week",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9QA2127FBQPGRWB62MZ23GD/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-10T18:00:30.000Z",
      "dateModified": "2025-11-10T18:00:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Install the iOS 26.2 and macOS 26.2 Public Betas",
    "url": "https://lifehacker.com/tech/you-can-now-install-the-ios-262-and-macos-262-public-betas?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9FFY0B1J4NMX8EEWV21FP6F/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-07T16:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            If you're going to run a beta, now's the time.\n    \n        \n    \n                                        \n        \n        \n        November 7, 2025\n                    \n            Credit: Dontree_M/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple released the public betas for iOS 26.2 and macOS 26.2 on Thursday.\n                                            This follows the release of the first developer betas for these updates on Tuesday.\n                                            Developer betas are much more risky than public betas: If you're going to run a beta at all, I'd recommend installing the public version.\n                                            26.2 introduces new features like alarms for reminders and new metrics for Sleep Score on Apple Watch.\n                                    \n            \n    Table of Contents\n    \n        \n        On Tuesday, Apple dropped the first developer betas for iOS 26.2 and macOS 26.2. While these updates aren't as massive as iOS 26 or macOS 26 were, 26.2 includes a number of new features and changes, including the ability to add alarms to reminders, and changes to how Apple calculates the Apple Watch's new Sleep Score. Despite these fun adjustments, I couldn't recommend that users install the new updates on their personal devices. Three days later, I still don't recommend it, but I won't necessarily dissuade you from it either, as the public betas for both updates are now available. Developer vs. public betasBefore Apple releases any major software update to the general public, it first tests that software with smaller pools of users. This is known as beta testing. The company will first release a beta specifically designed for developers, which these devs can install on their devices to see how their apps perform with the upcoming update. They can then report any and all issues they encounter to Apple, who will fix those bugs with future beta updates.After a short period of developer-only testing, Apple then releases the public beta. This beta is meant for any Apple user who feels a bit daring and wants to try new features early. The trade-off is that the software is not yet finished, so those users may still run into problems, which they can then report to Apple. Based on that feedback, Apple continues to fine-tune the update, and once it appears to be stable, it releases it to the general public. \n        \n            You May Also Like\n        \n    \nIn the past, Apple locked the developer beta behind its paid developer program, which costs $99. If you didn't pay, you couldn't access the developer beta, so you were either stuck waiting for the slightly more stable public beta, or finding the dev beta file somewhere on the internet. That latter option opens users up to malware, which could be why Apple dropped the paid requirement for the dev beta. Now, anyone who registers their Apple Account as a developer—regardless of whether or not they've paid to be in the developer program—can download and install the developer beta.You've technically been able to run the 26.2 betas since Tuesday, if you wanted to go down that route. However, due to the nature of beta testing, the developer beta (and the first one at that) is the riskiest beta to install. It's Apple's first attempt at the beta, which means it's largely untested. You might run into device-breaking problems, and without a proper backup, you could lose valuable information. While all betas carry risk, the public beta is at least tested enough to root out any of those critical flaws. While I don't recommend you run any betas on your personal devices, most of us don't have spare iPhones and Mac lying around to run tests on. As such, if you're going to install a beta, now's the time to do it.How to install iOS and macOS 26.2Before you install a beta on your iPhone or Mac, make sure you've first properly backed up your important information. That means making a full backup of your iPhone on your Mac or PC, or a backup of your Mac information on a separate hard drive. If something goes wrong during beta testing, you'll need to downgrade back to iOS 26.1 or macOS 26.1—and if you don't have a proper backup, you'll need to restore your device to factory settings to do it. Again, there are real risks here. If you're okay with those risks, and you made the proper backups, enroll your Apple Account in the public beta program. Once you do, you should be able to access the betas from any connected Apple Accounts. From here, head to Settings > General > Software Update (iOS) or System Settings > General > Software Update (macOS) and choose \"Beta Updates.\" Choose \"iOS 26 Public Beta\" or \"macOS Tahoe 26 Public Beta,\" then go back one page. Allow the page to load, then download and install the beta like any other update.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Install the iOS 26.2 and macOS 26.2 Public Betas",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9FFY0B1J4NMX8EEWV21FP6F/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-07T16:30:00.000Z",
      "dateModified": "2025-11-07T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Is Rolling Out ‘Agentic Checkout’ to Make Your Purchases for You",
    "url": "https://lifehacker.com/tech/google-is-rolling-out-agentic-checkout?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9Z58M5Y42Y1VCK6P9H5S3YC/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-13T19:30:54.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Would you trust a robot to click \"buy\" for you?\n    \n        \n    \n                                        \n        \n        \n        November 13, 2025\n                    \n            Credit: Michelle Ehrhardt\n                            \n    Table of Contents\n    \n        \n        Shopping online? Google wants you to trust AI to click the buy button for you. Rolling out today, Google's new \"agentic checkout\" adds onto the company's existing price-tracking feature, so it's not something you'll see all the time. Instead, when you get a price drop notification on an object you've been tracking, you might now see a new \"buy for me\" button that will send all the necessary information to the store's website and make the final purchase for you.\n    \n            \n            \n                                        Credit: Google\n                    \n    \nGoogle says the AI will always ask your permission before starting agentic checkout, and will only go through with the purchase after you've confirmed all your shipping and payment details (which it will either pull from your Google Pay details, or directly ask you for). The price you'll see also isn't informed by AI, but rather by Google's Shopping Graph, the same information that powers Google Search's Shopping tab. That means it'll come directly from the store you'll be buying from, although while Google does promise it'll surface the most relevant offers for you, just trusting whatever the notification says will take away your ability to manually comparison shop. Once the AI has made your purchase for you, you should see all the usual confirmation emails hit whatever inbox you told the AI to link with your purchase. It all makes sense in theory—you're essentially being given a link to a product, and then telling the AI to go to that link and fill out the checkout form for you. That should cut down on hallucination concerns, assuming you're happy with the link you're buying from. The catch is that every website's checkout form is a little different, so Google's starting with just a few stores for now, to cut down on the chance for errors. That means you'll only be able to try agentic checkout when buying from Wayfair, Chewy, Quince, and \"select Shopify merchants\" for now, but Google says there will be \"many more [stores] coming soon.\"\n        \n            You May Also Like\n        \n    \nWhile agentic checkout does take what can be a lengthy process down to a single click for buyers, the real use case here might be for sellers. Ensuring people actually click through to your store from a price drop notification can be a pain, and letting customers buy straight from the notification with a single button could make impulse purchases a bit more likely. If you notice yourself about to buy something just because a shiny new button is there, maybe take a beat before tapping it and consider whether you still want it or if you want to check other options yourself first.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nIf you want to try out agentic checkout for yourself, you'll first need to start tracking a product's price, and ensure it's something Wayfair, Chewy, or another participating retailer would sell. To do this, head to the Google Shopping tab, search for either a specific product or a broader product category, and scroll until you find a product card you want to track. Click through and hit the \"Track price button.\" Here, choose a target price as well as options like size or color, and click \"Update\" in the bottom right corner. You'll now get a notification when a listing matches the parameters you set, and if the link Google found is from a participating store, you'll be able to use the \"Buy for me\" button. Click or tap it to ensure your details are correct, then tap \"Buy for me with GPay\" at the bottom of the screen. You'll get a progress bar showing when your purchase has been submitted and confirmed, and the page will tell you where to expect your confirmation email. You'll also get a Buy for me reference ID you can take to Google support, in case you run into any issues.\n    \n            \n            \n                                        Credit: Google\n                    \n    \nUnfortunately, it seems like there's still a few features Google needs to work on here before the AI can do everything a human can. A Google spokesperson told me that agentic checkout currently can't take factors like loyalty programs into account, so if you want to buy the product from a specific store account to get credit for it, you'll still need to make your purchase manually.If you're buying a lot, it could be a time saver, but as for now, those caveats and the limited selection of stores means you'll probably still have to complete checkout yourself on most purchases right now.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Is Rolling Out ‘Agentic Checkout’ to Make Your Purchases for You",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9Z58M5Y42Y1VCK6P9H5S3YC/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-13T19:30:54.000Z",
      "dateModified": "2025-11-13T19:30:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spotify's New AI-Powered Audiobook Recaps Will Remind You Where You Left Off",
    "url": "https://lifehacker.com/tech/spotify-will-use-ai-to-recap-where-you-left-off-in-audiobooks?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9ZDPWAFJH9MB3QS6CYP43MM/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-13T22:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                  ",
    "body": "\n    \n        \n            \n                \n            \n                \n    \n    \n\n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Top 10 Tech Sales This Week\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Is that an actually useful AI feature I see?\n    \n        \n    \n                                        \n        \n        \n        November 13, 2025\n    \n            Credit: Spotify\n                            \n            \n                Key Takeaways\n                                            Spotify is introducing AI Recaps to select English-Language audiobooks.\n                                            AI Recaps are included in Spotify Premium's Audiobook listening hours.\n                                            AI Recaps will not 'replicate narration' from the audiobook, so don't expect to hear actual clips.\n                                    \n            \n    Table of Contents\n    \n        \n        If you're anything like me, you'll come back to a book or TV show after pausing it for a few days or weeks, only to have to spend hours on a wiki reminding yourself of where you left off, while also trying to dodge spoilers. Spotify is doing its best to fix at least one of those problems, by testing AI recaps for some of its audiobooks.It's the first new AI-powered feature in a while that I would actually use. In fact, I've played a few video games with similar features (not powered by AI, admittedly), and it's always such a value-add that it makes me pine for it in pretty much every other piece of media I engage with.Here's how Spotify's new feature works: First, you unfortunately do need to be using the Spotify app for iOS, so Android, web, or desktop listeners are out of luck, at least during this beta test. Then, you'll need to have listened to a supported English language audiobook for at least 15-20 minutes. After that, you'll see a Recap button at the top of the page that will quickly generate a one- to two-minute-long summary of what's happened in the book so far, which Spotify promises will be spoiler-free for future plot events. \n        \n            You May Also Like\n        \n    \n\n    \n            \n            \n                                        Credit: Spotify\n                    \n    \nPreviously on [your book]Spotify's likening it to a \"previously on\" segment on a TV show, although it also says that, \"Recaps do not replicate narration or replace the original audiobook in any way,\" so don't expect to hear actual clips from the book, nor an AI voice trying to mimic the narrator. However, just as TV's \"previously on\" segments will change with new episodes, your AI Recap will be \"regularly updated to match your progress.\"As for any potential issues with the feature, the company says it is \"not using audiobook content for LLM training purposes or voice generation\" and that authors can opt out of having Recaps on their books. Still, there are a few caveats, including the fact that the Recap feature isn't free.On the plus side, it is included alongside the free audiobook hours you get with Spotify Premium, as well as any add-on hours you might buy. But otherwise, audiobooks on Spotify need to be bought on a per-book basis, so for users without Spotify Premium and with no audiobooks in their libraries (that's me), there's no way to try AI Recaps before you buy, which means it's maybe not a convincing reason to swap audiobook platforms just yet.Not all books will get RecapsSpotify's also not being upfront about which books have Recaps, so it could be a bit before you see the button pop up for you. So while I like the idea in theory, I'm probably not going to get to test it anytime soon. (I've reached out to Spotify to ask for a current list of books with Recaps enabled, and will update this article when I hear back.)\n            \n                What do you think so far?\n            \n        \nCould Recaps include hallucinations?Another potential issue with these Recaps: hallucinations. Spotify didn't address accuracy at all in its announcement, which I'd like to think implies the company is feeling pretty confident it won't be an issue. But there is still a potential for an AI to misreport specific details of your story, or accidentally slip a spoiler in regardless of what Spotify claims. One would hope your memory would be jogged enough by a general outline to catch inconsistencies, but still, it might be worth keeping a few notes while you read, just in case.How to get AI summaries for any book (without using Spotify)If you aren't a Spotify audiobook listener or just haven't gotten to try the beta, I'll give you a cheat: You can already ask other AI chatbots for book summaries for free. So long as you remember where you left off, just head over to your AI of choice and ask for a summary up to that point. Here's one for the opening chapters of The Lord of the Rings: The Fellowship of the Ring.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt (via ChatGPT)\n                    \n    \nI won't deny that there's real convenience in having a summary feature baked directly into your app, especially one that doesn't require you to cross reference where you left off lest you, I don't know, spoil the Red Wedding for yourself or something. But if you're like me (not a Spotify audiobook customer), at least you're not out of options.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spotify's New AI-Powered Audiobook Recaps Will Remind You Where You Left Off",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9ZDPWAFJH9MB3QS6CYP43MM/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-13T22:30:00.000Z",
      "dateModified": "2025-11-13T22:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]