[
  {
    "title": "10 Hacks Every Smart TV Owner Should Know",
    "url": "https://lifehacker.com/tech/hacks-every-smart-tv-owner-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFC9X77313438VK2EKKE03CT/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-27T18:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    Make your picture look better, reduce buffering, and keep your apps running smoothly.\n            \n                        \n    \n                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        January 27, 2026\n            \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        Whether you're a smart TV veteran or are somehow just now setting your first TV with an internet connection, there's a lot to learn. Modern TVs are basically computers, complete with their own operating systems and application ecosystems. That means you can tweak them to run better.—or just the way you want them to. Here are a few tips, tricks, and hacks that every smart TV owner should be aware of.Turn off motion smoothing on your smart TVWondering why every single TV show and movie you watch on your brand new TV looks like a soap opera or a cheap community theater production? It's probably because of motion smoothing.This \"feature\", which is the default on far too many TVs, artificially ups the frame rate from either 24 or 30 frames per second to 60 or 120 frames, or even higher. This effect can bring a real immediacy to live events like sports, but it's not great for regular old TV shows. Because where does the TV get those extra frames from? It makes them up, often creating an uncanny blurring effect reminiscent of old school videotape. I recommend turning this feature off basically the minute you set up your TV, and our friends at PCMag have a guide to disabling the feature covering all the major smart TV platforms.Hook up an ethernet cable to make your smart TV faster Streaming 4k takes up a lot of bandwidth. Modern wifi routers can usually handle without much of an issue, especially if your TV is close to your router. Even so, it's a good idea to physically connect your smart TV to your network with an ethernet cable if you have the option.There's a couple of reasons to do this. One, wired connections are more stable, mostly because they're not vulnerable to interference from neighboring wireless networks and other devices, so you'll be far less like to suffer through stuttering images or audio dropouts. Two, connecting your TV via ethernet frees up the wireless spectrum for all of your other devices, which is important if you live in a house with other internet users (not to mention other smart devices).Customize your smart TV's home screenSmart TVs tend to come pre-loaded with any number of apps, all of them prominently placed on the home screen. You can, and should, move the apps you actually use to the top instead. How to do this will vary depending on your operating system, but it generally means pressing and holding on the app you want was at the top of the list and then moving it around. Failing that, you may need to do some digging in the settings.Block ads on your smart TVTired of all the ads showing up on your TV? You might be able to block them using your router. Lifehacker has a guide to blocking ads on Samsung, LG, and Roku smart TVs that explains how to change your internet settings so that your TV can't access the ads in the interface anymore.Disable quick start to save energy and speed up your smart TVSmart TVs are basically computers, meaning they need to boot up when you turn them on. Most users don't want to wait every time they turn on the TV though, which is why smart TVs don't actually turn off—they suspend their functions, the same way your phone or laptop does. That's fine if you use your TV constantly, but a real waste of electricity for a TV that you only turn on occasionally. And shutting down your set completely could have another benefit: reducing bugginess. To reiterate, a smart TV is basically a computer, and every computer user knows that restarting your computer can fix random problems.Some TVs allow you to disable this feature—just look for a \"quick start\" option in the settings. Others, including Sony, suggest that you unplug TVs you won't be using for months at a time in order to shut them down completely.\n            \n                What do you think so far?\n            \n        \nUse an antenna to get free channelsStreaming television is great, but don't overlook traditional broadcast TV. Most major cultural events, from the Super Bowl, to the Oscars, to the World Series, are still free to watch on network TV, as are of the most popular shows. If you live in a major city, or even just close to one, there's a good chance you can watch network TV free of charge using nothing more than a small TV antenna. This can mean free access to stations like NBC, CBS, ABC, FOX, and PBS—no need to pay for cable or a pricey \"live tv\" streaming subscription. All you need to do is plug in an antenna, scan for channels, and you're good to go. (Lifehacker has a guide to the best digital TV antennas to help you get started.)Clear your smart TV's cacheNot to keep harping on this point, but a smart TV is a computer, and like a computer, it can build up all sorts of junk in its memory over time. If your smart TV is suddenly moving more slowly than you remember, or even crashing, it might be time to clear out its various caches. Get started with this guide to clearing the cache on every major smart TV brand.Enable security features on your smart TVYour smart TV is a potential security risk. It's a computer, like any other, and that means you need to keep it up to date, secure all accounts connected to it, and be mindful of any built-in microphones and cameras. Check out our guide to securing your smart TV for more on these tips and more.Disable \"automatic content recognition\" to stop your smart TV from spying on youI've written about why smart TVs are so cheap, and it turns out a big part of it is automatic content recognition, or ACR. Most brands of smart TVs are constantly monitoring what you're watching and using that to build a profile with your viewing habits that can be sold to third parties, a practice that nets the TV manufacturers are lot of money. If this concerns you, consider turning the feature off to protect your privacy. Lifehacker has a guide to disabling ACR on the major smart TV platforms.Install a different launcher for your smart TVIf you want your smart TV to have an entirely different look and feel, you may be able to install a different launcher, which will give you much more control. Google TV users, for example, can install Projectivy to completely replace the default launcher. This won't be an option for every model of smart TV, but it's worth considering if you're feeling stuck with the software that came preinstalled.\n            \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n                        \n                \n            \n                    \n                                            \n                \n            \n                Justin Pot\n                                \n                                            Justin Pot is a freelance journalist who helps people get more out of technology.\n                                    \n                Read Justin's full bio\n                            \n        \n                \n                                            \n    More by Justin\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 Hacks Every Smart TV Owner Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFC9X77313438VK2EKKE03CT/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-27T18:30:00.000Z",
      "dateModified": "2026-01-27T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "12 Hacks Every Roku User Should Know",
    "url": "https://lifehacker.com/tech/hacks-every-roku-user-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFGGX99JJJD4W78EZ93VERA2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-27T14:00:00.000Z",
    "description": "\n    \n                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n         ",
    "body": "\n    \n                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        January 27, 2026\n            \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        Roku was one of the original names in streaming, and even with so many options now available from Amazon, Apple, Google and others, it remains one of the most popular options thanks to its affordable boxes and streaming sticks and widespread availability as an integrated operating system on some TV sets. The platform is speedy, simple, and supports just about every streaming app out there.If you've got a Roku or two in your life, you may not be using it to its full potential. These tips, hacks, and hidden features should help you go beyond the basic business of launching your streaming apps and get more out of your hardware, whether you've just unboxed your first Roku device, or you've been using one for years.Set up PIN protection to protect your RokuIf you've got young kids or nosy housemates living with you, you can lock certain parts of the Roku experience (including making purchases and adding new channels) behind a PIN number. This is actually done through your Roku account page on the web: Click PIN/parental controls on the left, and you can set a new PIN or change an existing one.Change the look and feel of your Roku with a new themeYou don't have to settle for the standard Roku interface visuals—you can easily switch to a different theme (which basically means a different wallpaper and screensaver). From Settings on your device, choose Themes to see alternatives provided by Roku and other people in the Roku community. You can always pick Restore default theme to go back to the original look.Enable captions on replayYou might not want closed captions on all the time, but you can have them enabled whenever you skip backward. From the home screen, pick Settings > Accessibility > Captions mode > On replay to enable this. Note that the streaming app you're using needs to support the feature as well, so it may not work everywhere.Put your most-watched apps up topThis is a simple and effective one that you might not have got around to doing: You can organize the apps on the home screen so your most-used are nearer the top and easier to get to. Select any tile on the home screen, press the star button on your remote to bring up the context menu, and you'll see the Move app and Move app to top options.Make use of Guest Mode when you have company\n    \n            \n            Roku devices come with a Guest Mode included.\n                                        Credit: Lifehacker\n                    \n    \nIt's great having guests—but don't let them mess up your recommendations and viewing progress. You can put your Roku device into Guest Mode by opening Settings from the main Roku menu, then choosing Guest Mode > Enter Guest Mode. You'll be signed out of all your apps, and the Roku device will restart ready for someone else to use it.Send your photos to your Roku to view them on the big screenYou won't always be watching films and shows on your Roku of course—and when your streaming device isn't doing anything else you can get images from your Google Photos library up on your TV. To set this up, you need to head to the Photostreams page on the Roku website, sign in using your account, and then follow the instructions online.Set up a cross-platform Roku watchlistThere will often be times when you see something interesting, but don't have time to watch it right away, and that's when the Roku watchlist feature can help. Select any movie or show from the home screen, and on the listing page use the Save button to add it to your list: You can then pick Save List from the main menu to see what you've saved.Pair your Bluetooth headphones to your RokuIf you've got a pair of wireless Bluetooth headphones and a Roku device that supports Bluetooth, you can pair the two together for some private audio listening— handy if you don't want to disturb anyone around you. You can do this by heading to Settings from the main Roku menu, then choosing Remotes & devices > Wireless headphones.\n            \n                What do you think so far?\n            \n        \nListen to your Roku via your smartphoneThere's another way to listen through headphones, and it doesn't require Bluetooth or wireless headphones. If you install the aforementioned Roku app on your smartphone, then plug a pair of headphones into your phone as well, you can tap Remote control in the app and then the headphone button to stream the audio right to your ears.\n    \n            \n            You can use the mobile app to listen over headphones.\n                                        Credit: Roku\n                    \n    \nMirror your other devices to your RokuApple devices: Roku sticks, boxes and TVs come with support for the Apple AirPlay standard built right in, so you can beam across audio and video from Apple devices, or even mirror your Mac display on the big screen. On the Roku, choose Settings then Apple AirPlay and HomeKit to make sure you're set up, then just select the AirPlay button on your Apple hardware.Android devices: For screen casting, you're not left out if you're on Android, though—as usual with Android—capabilities vary between devices. Samsung Galaxy phones have the smoothest integration: Swipe down with two fingers from the top of the screen, choose Smart View, and your Roku should show up as a connection option (if it's on the same wifi network).Windows devices: If you want to mirror your screen to a Roku from Windows, the process is different again. First, enable the feature on the Roku via Settings > System > Screen mirroring. Next, from Windows, click the volume and wifi icons down in the lower right corner, click the Display button, then select your Roku. Again, it needs to be on the same wifi network.Quickly find the cheapest way to rent a show or movieIf you're in the mood for a movie rental, then you've got a whole host of different streaming services to choose from—all the big ones offer film rentals on top of the content you get with your subscription. Use the Search option from the main Roku menu to look for a title, and compare the different prices across all the services you're signed up to.Control your TV with your Roku remoteYou can turn your TV on and off and adjust its volume with your Roku remote, if you'd like to. You're asked if you want to do this when you first set up your Roku device, but you can configure it afterwards too: Pick Settings > Remotes & devices > Remotes, then choose the remote you've currently got connected, and then pick Set up remote for TV control.\n            \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n                        \n                \n            \n                    \n                                            \n                \n            \n                David Nield\n                                \n                                            David Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. \n                                    \n                Read David's full bio\n                            \n        \n                \n                                            \n    More by David\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "12 Hacks Every Roku User Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFGGX99JJJD4W78EZ93VERA2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-27T14:00:00.000Z",
      "dateModified": "2026-01-27T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How YouTube Is Fighting Back Against AI Slop",
    "url": "https://lifehacker.com/tech/youtube-fighting-back-against-ai-slop?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG5RS2KTV09PK5XV3N14BAA3/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-29T22:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: PixieMe/Shutterstock\n                            \n            \n                Key Takeaways\n                                            YouTube removed more than 4.7 billion views worth of AI slop on its platform.\n                                            Android Police notes that it removed 16 of the top 100 most subscribed AI channels since the start of this year.\n                                            YouTube's CEO has said the company wants to reduce \"the spread of low quality, repetitive content\" on the platform.\n                                    \n            \n    Table of Contents\n    \n        \n        Science fiction and science leaders alike have warned us that artificial intelligence may one day take over the world, but until those predictions come to pass, generative AI's biggest impact on my life has been overloading my social media feeds with slop. It seems I can't open TikTok, Instagram, or YouTube without running smack into bizarre and troubling AI concoctions featuring babies in danger and cats having affairs. It really is the wild west (or maybe Westworld) out there. I think few among us really believe these videos are any good, and it's pretty obvious they aren't good for us, or for the world. Short-form video is already numbing enough, but this AI content is generally completely devoid of any meaning or substance. And yet, it's everywhere. I haven't spent too much time on YouTube Shorts recently, but in my limited experience, the feed has been chock full of AI, especially if I'm logged out of my personal account.Still, if you're a dedicated YouTube Shorts user (or a frequent YouTube user in general) you might have noticed something odd in recent days: There don't seem to be quite as many AI videos on the platform right now. There are still a lot, don't get me wrong, but it turns out YouTube has recently taken action to remove some of its AI content—the sloppiest of the slop. \nYouTube's war on AI slopAndroid Police spotted the development on Wednesday, basing its findings on a November report from Kapwing, a company that develops an online video editor. Kapwing investigated AI slop across YouTube's vast content library, noting the top 100 most-subscribed YouTube channels that publish this sort of AI content. In the two months since that report, Android Police noticed that 16 of those 100 channels are no longer with us.That includes the most popular AI channel on YouTube, at least according to Kapwing. \"CuentosFacianantes\" had 5.95 million subscribers at the time of their initial report, and produced AI-generated shorts inspired by Dragon Ball. The channel had amassed roughly 1.28 billion views by the end of last year; despite launching in 2020, it had curated its library to begin Jan. 8, 2025, so those numbers were racked up pretty recently. The number two channel, \"Imperio de Jesus\" with 5.87 million subscribers, and the number seven channel \"Super Cat League,\" with 4.21 million subscribers, were also shut down. According to Android Police, the 16 channels in question had a total of 35 million subscribers and over 4.7 billion views across their collective videos. Some of these channels are completely gone, while others simply have had their videos removed. Why is YouTube removing AI slop?YouTube CEO Neal Mohan published a post on Jan. 21 of this year describing the company's vision for 2026. Towards the end of that letter, he acknowledges AI content, predicting that, \"AI will be a boon to the creatives who are ready to lean in,\" and comparing it to tools like Photoshop and CGI, adding \"AI will remain a tool for expression, not a replacement.\" However, Mohan was also critical of the technology, noting that it's becoming more difficult to tell real videos from AI. He notes that YouTube is now removing \"any harmful synthetic media that violates our Community Guidelines,\" and is giving creators tools to help identify and block deepfakes. \n            \n                What do you think so far?\n            \n        \nMore interestingly, the letter includes a section labeled \"Managing AI slop,\" which is the first time I've seen a company like YouTube use that expression. Mohan says that YouTube's goal is to be a place where free expression thrives, but also a place \"where people feel good spending their time.\" To that point, he says, \"To reduce the spread of low quality AI content, we’re actively building on our established systems that have been very successful in combatting spam and clickbait, and reducing the spread of low quality, repetitive content.\"Mohan doesn't call out any accounts by name, nor does he acknowledge the accounts and content the company has already deleted, but it's a clear line in the sand: YouTube is not against AI-generated content, but it will remove low-quality AI content it feels is, well, slop. That's good news for anyone who uses YouTube (so, pretty much everyone), even if it's far from a cure for the growing problem.I've reached out to YouTube for comment on this story, and will update this piece if I hear back. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How YouTube Is Fighting Back Against AI Slop",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG5RS2KTV09PK5XV3N14BAA3/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-29T22:00:00.000Z",
      "dateModified": "2026-01-29T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You May Be Eligible for Part of This $10.5 Million Spam Text Settlement",
    "url": "https://lifehacker.com/tech/kaiser-permanente-spam-text-settlement?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG862TDW2R0TKESQQTX7J3PH/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-30T20:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 30, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: bluestork / Shutterstock\n                            \n            \n                Key Takeaways\n                                            Healthcare company Kaiser Permanente recently settled a $10.5 million class action lawsuit regarding marketing text messages that were sent even after recipients opted out.\n                                            If you submit a valid claim, you may be eligible for up to $75 per text, though the amount is likely to be less.\n                                    \n            \n    Table of Contents\n    \n        \n        Unsolicited texts are annoying—and even more so if they keep coming from a legitimate sender after you've opted out. If you received text spam from Kaiser Permanente, you may be eligible for a cash payout for each message. The healthcare company, which serves over 12.5 million members, recently settled a $10.5 million class action lawsuit filed over marketing text messages sent after recipients tried to opt out. The suit, filed in August 2025, claimed that Kaiser Permanente failed to honor opt-out requests. Those with a valid claim may receive up to $75 per qualifying text. Are you eligible for the Kaiser settlement? To qualify for a payout from this settlement, you must have received more than one text message from Kaiser Foundation Health Plan Inc. within a 12-month period—between Jan. 21, 2021 and Aug. 20, 2025—after sending a \"stop\" or similar opt-out request. (Note that the confirmation of your request does not count.)\nAccording to the settlement website, there are two separate classes covered by suit: one for message recipients in Florida and one for the U.S. as a whole. \n            \n                What do you think so far?\n            \n        \nHow to claim your settlement cashTo get your cash, you'll need to submit a valid claim form by Feb. 12, 2026. You can complete your claim online if you received a notice of eligibility via mail or email containing a unique ID and PIN. If you did not get a notice, you'll have to download and submit a paper claim form to the settlement administrator. Hard copy claims must be postmarked by Feb. 12. While the maximum per-text payout is $75, the final amount may be less depending on how many claims are filed. Payments could take months to distribute while settlement details are finalized, so don't expect the funds to arrive immediately. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You May Be Eligible for Part of This $10.5 Million Spam Text Settlement",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG862TDW2R0TKESQQTX7J3PH/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-30T20:30:00.000Z",
      "dateModified": "2026-01-30T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nine Phone Settings to Change Before Attending a Protest",
    "url": "https://lifehacker.com/tech/phone-security-before-attending-protest?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG7ZG7VRY6P3X9FZV8YSTYA9/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-30T20:00:00.000Z",
    "description": "\n        \n        Before you head out to a protest, take some precautions to protect your privacy and both the physical and digital security of any de",
    "body": "\n        \n        Before you head out to a protest, take some precautions to protect your privacy and both the physical and digital security of any device you bring along. The most secure option, of course, is to leave your phone at home, but you can also lock things down to minimize the risk that your data will be accessible to law enforcement or someone who gets hold of your device. Thankfully, both iOS and Android have built-in device encryption if you're using a passcode, meaning that your device's data cannot be accessed when it is locked. (On Android, go to Settings > Security to ensure Encrypt Disk is enabled). You'll want to maximize this protection with the following privacy settings. Turn off face and fingerprint scanningAt an absolute minimum, you'll want to disable biometric access, such as face and fingerprint authentication, on your device in favor of a passcode or PIN. As the Electronic Frontier Foundation notes, this minimizes the risk of being physically forced to unlock your device and may provide stronger legal protections against compelled decryption. \nOn iOS, go to Settings > Face ID & Passcode and toggle off iPhone Unlock. You can also set up a stronger passcode—a custom numeric or alphanumeric code—under Change Passcode. On Android, you'll find the option to delete your fingerprint in favor of your PIN or screen lock pattern under Settings > Security & Privacy > Device Unlock > Fingerprint.Limit location trackingAgain, the best option to prevent your location from being tracked is to coordinate any details in advance and leave your phone at home. If you must bring it along, keep it off unless you absolutely need to use it. You can turn on Airplane Mode in advance, as well as disable Bluetooth, wifi, and location services, which keeps your device from transmitting your location. However, note that some apps may still be able to store GPS data and transmit it when an internet connection is available—so again, the safest bet is to keep your device off for the duration. Airplane Mode can be enabled (and wifi and Bluetooth disabled) in your device's settings or quick access menu. On Android, go to Settings > Location to disable location services and turn off Location History in your Google account. On iOS, head to Settings > Privacy & Security > Location Services to disable locations entirely. Turn off previews and notificationsTemporarily disable notifications and screen previews so that if someone gets your device, they won't be able to glean any information from your lock screen. You can adjust these options under Settings > Notifications on iOS and Settings > Apps & notifications > Notifications on Android. Adjust screen lock timeMinimize your screen lock time to as short a period as possible so that your screen turns off when you're not actively using it and will require authentication to reopen. On iOS, go to Settings > Display & Brightness > Auto-Lock and select 30 seconds. The exact path on Android may vary, but typically you'll find this under Settings > Display or Lock Screen. Know that most devices have camera access from the lock screen, so you can take photos or record video without actually unlocking your device. Enable app pinning or Guided AccessApp pinning (Android) and Guided Access (iOS) are features that prevent others from navigating through your phone beyond a specific app or screen. This allows you to use an essential feature on your device while locking the rest behind your PIN or passcode. You can enable this preemptively, and if someone grabs your device, they won't be able to snoop around. You can find this setting on Android under Security or Security & location > Advanced > App pinning and on iOS under Settings > Accessibility > Guided Access.\n            \n                What do you think so far?\n            \n        \nUse a SIM PINYou can also lock your SIM card to prevent unauthorized use of your device or SIM card, including access to two-factor authentication codes sent via SMS. This PIN will be required any time your phone restarts or if someone tries to use your SIM card in another device. On iOS, go to Settings > Cellular, select your SIM, and tap SIM PIN. On Android, you'll find this under Settings > Security > More security settings (the exact path varies by device). Sign out of, hide, or delete appsThis step will vary depending on what you keep on your phone and your risk tolerance, but you may want to consider signing out of your social media accounts and deleting apps that contain or allow access to sensitive data. On iOS, you can also lock or hide specific apps: the former requires an extra authentication step to open apps on your home screen, while the latter sends apps to a hidden folder that also requires authentication to unlock. Touch and hold an app icon to bring up the quick actions menu, then tap Require Face ID/Require Passcode.  On Android, you can set up a \"private space\" to lock apps behind your pattern, PIN, or password. Apps are hidden from the launcher and recent views as well as quick search. Go to Settings > Security & privacy > Private space, authenticate with your screen lock, and tap Set up > Got it. If necessary, turn on Lockdown Mode or Advanced ProtectionBoth iOS and Android have strict device-level security modes that significantly limit access to certain app and web features as well as blocking changes to settings. Both were designed with journalists, activists, and other users with access to sensitive data that may be targeted by cyber actors in mind. These settings are overkill for day-to-day use but add a potentially helpful layer of security in high-risk situations. Enable Lockdown Mode on iOS via Settings > Privacy & Security > Lockdown Mode. On Android, turn on Advanced Protection under Settings > Security & privacy > Advanced Protection.Protect your privacy after a protestWhile the above steps are largely about securing your data during a protest, you should also follow best practices for protecting privacy (yours and others') after the fact. If you plan to post photos or videos, utilize blurring tools to block faces and other unique identifying features, and scrub file metadata, which includes information like photo location. You can do this by taking a screenshot of the image to post or sending a copy to yourself in Signal, which automatically strips metadata. Signal also has a photo blurring tool, or you can blur in your device's default photo editing app. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nine Phone Settings to Change Before Attending a Protest",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG7ZG7VRY6P3X9FZV8YSTYA9/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-30T20:00:00.000Z",
      "dateModified": "2026-01-30T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Clawdbot' Is Now 'Moltbot,' but Still Carries the Same Security Concerns",
    "url": "https://lifehacker.com/tech/clawdbot-is-now-moltbot?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG0MSPQC13ZKCFWQSD506KDR/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-27T21:40:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 27, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Moltbot\n                            \n            \n                Key Takeaways\n                                            \"Clawdbot\" has officially changed its name to \"Moltbot.'\n                                            The viral AI assistant had to change its name following a trademark issue with Anthropic.\n                                            Anthropic's mascot for Claude Code is also called \"Clawd,\" and resembles Moltbot, too.\n                                    \n            \n    Table of Contents\n    \n        \n        On Monday, I was introduced to \"Clawdbot,\" the latest AI craze taking over tech social media channels. Clawdbot is designed to be an agentic personal assistant. In layman's terms, that means the bot can perform tasks on your behalf: You give it full access to your computer, and it can organize your inbox, code for you, or clear your calendar (allegedly, anyway). You can also talk to it from a chat app of your choice, like WhatsApp or iMessage, rather than it's own interface. Some people are even buying Mac minis exclusively to run Clawdbot from. If you're wondering where that name came from, it takes after another AI company's product. Creator Peter Steinberger says he was inspired by the monster that appears when users reload Claude Code—Claude being one of the big AI products in the space right now, developed by the company Anthropic. Steinberger decided to go the lobster route with his logo, and named his own lobster mascot \"Clawd.\" From this, Clawdbot was born. The problem: Anthropic also calls Claude Code mascot \"Clawd.\" Whoops.By Tuesday, Clawdbot was no more (in name, anyway). It turns out companies like Anthropic don't appreciate it when you start your own business and use the name of their mascot as your own—especially when you're working in the same ridiculously lucrative field. Maybe if Clawdbot had never taken off, Anthropic wouldn't have noticed, but the bot became an internet sensation, which no doubt landed it on Anthropic's  radar. As such, Clawdbot has officially changed its name to \"Moltbot,\" suggesting a lobster molting from its shell. Clawd is now affectionally known as \"Molty.\" The company made the announcement on its official X page, noting that Anthropic had asked it to change the name over \"trademark stuff.\" (Steinberger struck a different tone on his personal X account, however, writing: \"I was forced to rename the account by Anthropic. Wasn't my decision.\")\n            \n                What do you think so far?\n            \n        \nAside from the name change, the bot appears to be the same as it was on Monday. That is to say, it's still open source, still available to run locally on your own device, and still comes with the same inherent security risks I outlined yesterday. I still wouldn't recommend you install a program like Moltbot on your personal device, since, name change or not, you'd still be giving it incredible access to your hardware and its data with little knowledge of the safeguards in place to protect it. All it could take is one malicious prompt injection for Moltbot to molt your security.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Clawdbot' Is Now 'Moltbot,' but Still Carries the Same Security Concerns",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG0MSPQC13ZKCFWQSD506KDR/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-27T21:40:00.000Z",
      "dateModified": "2026-01-27T21:40:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WhatsApp Now Has Its Own Version of Apple's 'Lockdown Mode'",
    "url": "https://lifehacker.com/tech/whatsapp-has-its-own-lockdown-mode?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG2R7H8KEPVJP6J9BE2Z5YE1/hero-image.fill.size_1200x675.webp",
    "tag": "Life",
    "date": "2026-01-28T19:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Melnikov Dmitriy / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Meta is rolling out new security features for WhatsApp designed to protect high-risk users—journalists, activists, and government officials, for example—from cyber attacks.\n                                            Strict Account Settings is a \"lockdown-style\" mode that builds on the platform's end-to-end encryption.\n                                            For most WhatsApp users, this level of lockdown is overkill. However, those with access to sensitive data that are valuable to threat actors may benefit.\n                                    \n            \n    Table of Contents\n    \n        \n        Not to be outdone by Apple's \"Lockdown Mode,\" Meta is rolling out new security features for WhatsApp designed to protect high-risk users—journalists, activists, and government officials, for example—from cyber attacks. Strict Account Settings is a \"lockdown-style\" mode that builds on the platform's existing end-to-end encryption, adding stronger privacy features and additional restrictions against unknown contacts. For most WhatsApp users, this level of lockdown is overkill. However, people with access to sensitive data that is potentially valuable to threat actors actually have been targeted with spyware campaigns through messaging platforms like WhatsApp, so for users like that, it may be a lifesaver. (In the last year, WhatsApp has also patched multiple zero-day exploits that allowed spyware to proliferate.)As noted, the new WhatsApp settings are similar to Apple's Lockdown Mode, an OS-level feature that blocks attachments, link previews, and communication from unknown contacts alongside some other settings changes. It also disables wired connections to external devices and a range of web features. Android's Advanced Protection offers similar functionality. \nHow WhatsApp's Strict Account Settings protects high-risk usersStrict Account Settings automatically enables existing privacy and security settings and adds a host of restrictions to users' communication and visibility on WhatsApp. \n            \n                What do you think so far?\n            \n        \nTwo-step verification and security notifications, which alert you if a contact's security code changes, are turned on. Link previews are disabledHigh volumes of messages from unknown accounts are blockedOnly your contacts or those added to a pre-established list can see information about you, including your last seen and online, profile photo, about details, and links on your profile. Only known contacts or those on your pre-established list can add you to groups.How to enable Strict Account Settings on WhatsAppThese controls can be enabled by going to Settings > Privacy > Advanced and toggling on Strict account settings. Settings must be changed on your primary device and cannot be updated on the web. Note that the feature will roll out gradually over the coming weeks, and may not be immediately available. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WhatsApp Now Has Its Own Version of Apple's 'Lockdown Mode'",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG2R7H8KEPVJP6J9BE2Z5YE1/hero-image.fill.size_1200x675.webp"
      ],
      "datePublished": "2026-01-28T19:00:00.000Z",
      "dateModified": "2026-01-28T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Just Updated These Android Theft Protection Features",
    "url": "https://lifehacker.com/tech/google-just-updated-these-android-theft-protection-features?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG59AYX4SVNDB1CTG2PFZXAJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-29T17:01:43.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Karlis Dambrans/Shutterstock\n                            \n            \n                Key Takeaways\n                                            On Tuesday, Google announced a number of updates and enhancements for existing Theft Protection Features for Android.\n                                            Users can now enable or disable Failed Authentication Lock from a settings toggle.\n                                            There's an extended lockout time after too many failed passcode attempts, though it ignores identical passcode guesses.\n                                            You can also set an optional security challenge for Remote Lock, making it harder for thieves to unlock your stolen phone.\n                                    \n            \n    Table of Contents\n    \n        \n        Phones are valuable targets. If someone can steal your device, especially if they know how to break into it, they have access to a huge amount of your sensitive data. As such, good security features can mean the difference between losing that data, or protecting it entirely—even if your phone is long gone. Google has a number of anti-theft features baked in Android, appropriately called \"Theft Protection Features.\" While the company isn't announcing a slate of new features today, it did announced new updates to its existing Android Theft Protection features in a post on the company's Security Blog Tuesday. Here's what's new:First, the company announced updates to authentication safeguards, which apply to all Android devices running Android 16 or newer. That includes a new dedicated toggle in settings for Failed Authentication Lock, which automatically locks your screen after someone tries to guess your password too many times. Now, you can choose whether or not to keep this feature on right from settings. Google is also increasing the amount of time your phone locks up after too many failed passcode attempts, which reduces the chance for someone to break into your phone. I wouldn't have thought of this, but Google notes that it has included protections against children that try to break into your phone, by not counting identical passcode attempts against this retry limit. And while it isn't new, Google highlighted that since late 2025, all features and apps that use Android Biometric Prompt now work with Identity Check, which prevents unauthorized users from changing sensitive settings without a successful biometric authentication—meaning a face or fingerprint scan. \nThe company also announced enhancements to features that are available to devices running at least Android 10. First is an update to Remote Lock, which lets you lock up your phone from a web browser if it is stolen or goes missing. Now, you can set up a security question as part of the unlocking procedure. Even if someone knows your credentials, they'd need to know the answer to your security challenge before they could unlock your device. Tip: If you make the answer something nonsensical, you'll be even more protected (e.g., What is your mother's maiden name? h7r_t*2#). Just be sure to file that answer somewhere safe, like a password manager.\n            \n                What do you think so far?\n            \n        \nUsers in Brazil also have two new security settings enabled by default. The first is Theft Detection Lock, which can detect when your device has been snatched out of your hand in a likely theft situation. The second is Remote Lock, so users in Brazil can take advantage of the above benefits without having to set anything up first—other than the option security challenge question, of course. These updates might not be revolutionary, but they should help boost your Android's security a bit—and prevent your kids from locking you out of your phone for the day.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Just Updated These Android Theft Protection Features",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG59AYX4SVNDB1CTG2PFZXAJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-29T17:01:43.000Z",
      "dateModified": "2026-01-29T17:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "10 Hacks Every 'Google TV Streamer' User Should Know",
    "url": "https://lifehacker.com/tech/google-tv-streamer-hacks-you-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFPQF53NTM2NEAGD4AVZM8E5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-28T15:00:00.000Z",
    "description": "\n    \n                    \n        \n        \n        \n    \n                                Florence Ion\n                            \n        \n        ",
    "body": "\n    \n                    \n        \n        \n        \n    \n                                Florence Ion\n                            \n        \n            Florence Ion\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceI cover Android, smartphones, and the smart home. Sometimes, I cover Windows and streaming, too!\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        January 28, 2026\n            \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        The launch of the Google TV Streamer marked a significant shift for the company's streaming lineup, moving away from the behind-the-TV Chromecast dongles it popularized and introducing a pill-shaped set-top box that blends in nicely on a shelf of tchotchkes. It's hiding a worthy processor, double the memory you'd get from a streaming stick, and enough storage to download what you need to run all of your apps. It even acts as a smart hub, with Matter and Thread built in. It's taken me a long time to do anything with the Google TV Streamer. I reluctantly brought it into my home after realizing something more robust, but dated, like the Nvidia Shield, would be too much to manage alongside maintaining a home server. But since then, I've tweaked several things on the set-top box and enabled features I hadn't been using, turning it into a helpful hub in my living room.Enable \"Find my remote\" to never lose your Google TV Streamer remote againThis sounds like an obvious tip, but I've had the Google TV Streamer since it debuted in 2024, and it wasn't until this week, while writing this piece, that I finally enabled the remote finder. I had skipped it during the initial setup. The option is available in Settings > Remotes & Accessories. You'll see the Find my remote option in there.\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nThe Google TV Streamer has a physical button on the back of the device that lets you locate your remote if it's stuck somewhere on the couch. But what if you can't reach the streamer behind the TV? Try one of your Google-enabled voice devices instead. If you have a Nest speaker or a Pixel phone nearby, say \"Hey Google, find my remote.\" The remote should start chirping if you've set it up.Set up the Google TV Streamer remote shortcutThe remotes that come with the Google TV Streamer feature a tiny, unregistered button with a star icon right next to the power button. By default, this shortcut does nothing! But you can change that in the device's system preferences.\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nIn Settings > Remotes & Accessories > Set up remote buttons, select one of three options for customizing the shortcut button. I set it up as my Google Home shortcut so I can easily turn the lights on and off from the couch. You can also set it up as a launcher for another app installed on the set-top box. Or create a shortcut to cycle through device inputs—this button is on legacy Chromecast devices with an included remote. It was removed from this generation of streaming devices, so if you miss it, you can spoof it back.For serious power users, map the shortcut to an app like Projectivity Launcher to make it a more powerful launcher button.Remap other buttons on your Google TV Streamer remote to be more useful\n    \n            \n            What Button Mapper looks like running on Google TV.\n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nDon't care for the default YouTube or Netflix buttons included on the Google TV Streamer remote? You can remap them with a third-party app, then affix a small sticker to indicate what it does. Install an app like Button Mapper or tvQuickActions. Then go to Google TV Settings > System > Accessibility, and turn on the service. After that, you can head back into the app to adjust what those physical buttons do. You can set them as shortcuts to other apps, or even something cheekier for others to discover when they press the button. Remove the clutter from the Google TV Streamer home screen\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nCan't stand all the recommendations and sponsored content Google TV suggests in the main carousel? You can effectively shut off some of the clutter so it doesn't visually overwhelm you. Go to Settings > Accounts & Sign-In > Your Account. and toggle on Apps only mode.This clears the clutter and \"sponsored\" content, leaving you with just app icons. Keep in mind that this turns off the \"Watchlist\" feature that's tied to your account and some Gemini voice search capabilities for specific content.Enable Google TV Streamer \"Developer options\" for more customization \n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nYou'll need to enable developer options to enable features like faster animations and side-loading apps. It's easy to set up, and it's just like on an Android smartphone. Head into Settings > System > About, then tap Android TV OS Build 7 times.You'll see a little dialog pop up to let you know you've got developer access. Once enabled, a new menu will appear under Settings > System > Developer options.Limit animations to make navigation fasterThe Google TV interface is organized and functional, but its animations can slow down menu navigation. You can eliminate these animations and tweak other visual elements to speed things up deep within the developer settings.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nIn Developer Options, scroll down to Window animation scale, Transition animation scale, and Animator duration scale. Change one of these, or all three, from 1x to Animation off to turn off animations completely. You can also go the other way and effectively \"overclock\" the animations to speed them up, making them appear smoother. Side-load apps or an alternative launcherWith developer options turned on, you can enable USB and wireless debugging to use apps like Send Files to TV and atvTools to sideload APKs. But first, enable the \"Allow installs from unknown sources\" option in the Developer Options under Security settings. This allows APKs you've transferred over to the device to run on the streamer.Why would you want to go through the fuss of connecting to the Google TV Streamer this way? Because then you could access alternative streaming apps not available in the Play Store, or even an alternative launcher, like LeanbackLauncher.Pair headphones to your Google TV Streamer for private listening\n    \n            \n            \n                                        Credit: Florence Ion/Lifehacker\n                    \n    \nThis is one of my favorite little hacks that comes especially in handy when living in a house occupied by other people. When I do my workouts in the living room, I use a set of Bluetooth earbuds connected to the Google TV Streamer so I can hear the instructor's directions even when I'm face down in a plank and my kid is screaming in the background.The ability is available in the same submenu where you set up your remote. In Settings > Remote & Accessories > Pair Remote/Accessory, put your audio device into Bluetooth pairing mode, then watch it come up on the screen as an option. If you're successful, you can now pop on the buds when you need to. Be aware that audio latency can occur, and you might need to restart the connection—it is Bluetooth, after all.  Force your Google TV Streamer to choose the best resolution, regardless of bandwidthIf you don't care about your bandwidth and want full-resolution streaming at all times, you can set the best resolution to display as the default in your Google TV Streamer preferences. Go to Settings > Display & Sound > Resolution. Switch the Resolution from \"Automatic\" to 4K 60Hz, or whatever your TV's peak is. Once this is enabled, the Google TV Streamer won't downscale to 1080p. If you're a sucker for HDR, this is the same menu where you can turn it on so that it's always in high definition.The USB-C port can do more than charge up the Google TV Streamer. You can plug in a power delivery hub with extra ports to add components like external storage and effectively run your own all-in-one home media center. Those power delivery hubs usually include extra USB ports for peripherals, so you can hook up things like keyboards and game controllers for extra fun.  \n            \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n                        \n                \n            \n                    \n                                            \n                \n            \n                Florence Ion\n                                I cover Android, smartphones, and the smart home. Sometimes, I cover Windows and streaming, too!\n                Read Florence's full bio\n                            \n        \n                \n                                            \n    More by Florence\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 Hacks Every 'Google TV Streamer' User Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFPQF53NTM2NEAGD4AVZM8E5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-28T15:00:00.000Z",
      "dateModified": "2026-01-28T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Is 'UpScrolled,' and Why Are People Switching to It From TikTok?",
    "url": "https://lifehacker.com/tech/what-is-upscrolled?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG2PM5M3SA19B051H574E5T0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-28T18:30:12.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: UpScrolled\n                            \n            \n                Key Takeaways\n                                            A new social media platform UpScrolled is having a major moment.\n                                            The app advertises itself as a social media platform free from censorship or aggressive algorithms.\n                                            Frustrated TikTok users are flocking to the app, driving it to the second most popular app on the iOS App Store Wednesday morning.\n                                    \n            \n    Table of Contents\n    \n        \n        TikTok's having a rough 2026. The app recently switched ownership from the Chinese-based ByteDance to the new \"TikTok USDS Joint Venture,\" which, as the name implies, is a majority American-owned business entity. Any changing of the guard comes with the risk for disruptions and issues, but it seems TikTok's problems have gone beyond the usual rocky transition. First, the app itself went down, which the company attributed to a power outage at a data center. Then, users accused the platform of updating its terms of service with aggressive new tracking, blocking certain content types, and \"shadowbanning\" new posts from some users. It's still not clear exactly what's going on here, but users aren't waiting around for more explanation. In fact, many have made up their minds already, and believe the app is actively suppressing content, neutering algorithms, and invading privacy in a way it didn't under ByteDance. While there are other, popular social media platforms to jump to, many apparently have flocked to a relatively new one: UpScrolled. As of this article, it's now the second most popular free app on the iOS App Store, reminding me of when X users ran to Bluesky. UpScrolled, created by Issam Hijazi, is a social media platform that launched this past June. According to the company's \"About\" page, UpScrolled's mission is to allow all users to share their views without risk of bias, shadowbanning, or \"unfair\" algorithms. The company asserts it does not push agendas, and ensures that \"every post has a fair chance to be seen.\" If you believe TikTok's algorithm is now biased against your views, I could see how that pitch sounds enticing. \nThe company says it only restricts content that violates their guidelines. That means illegal activities, hate speech, bullying and harassment, explicit nudity, unlicensed copyrighted content, or anything \"intended to cause harm.\" UpScrolled will also never ban you without your knowledge. If the platform removes your videos or your account, it says it'll let you know why. One big difference between UpScrolled and other social media platforms is its algorithm. The app splits feeds into two: There's the Following Feed, which lists posts entirely in chronological order. The first posts are the newest from your followers, and you scroll through previous posts. If you want to find new posts from accounts you don't follow, you can use the Discover Feed. But unlike TikTok or Instagram, the Discover Feed does not employ some aggressive, personalized algorithm. Instead, it's based on likes, comments, and reshares. Popular posts from across the platform are shared with you  What I especially appreciate is UpScrolled's approach to data collection, in that they largely don't do it. The company says it doesn't sell user data to third-parties for marketing, tracking, or for profit. The only times they'll hand over user data is when compelled by law. That's in sharp contrast to many social media platforms, which seem to collect as much of your data as possible.I haven't spent much time with the app yet, though I did create an account this morning to see what the hullabaloo was all about. I don't recognize any of the users the app suggests I follow, which means I'll likely need to dig through the content types if I want to find accounts to start following. \n            \n                What do you think so far?\n            \n        \nThe Discover Feed is a mix of content types, but is heavy with content surrounding the current Israeli-Palestinian conflict. In fact, many users are choosing the platform as a space for pro-Palestinian content, in response to allegations that mainstream social media apps censor these types of posts. That said, the app advertises a host of different content types to follow, including sports, news, games, film, music, tech, and travel. As you might expect, some of the posts here are simply ripped from TikTok, which is a common practice I see on social media platforms that, well, aren't TikTok. Despite the current controversy, it's clear which platform still has the largest user share at this time, by a long shot. But it's not all short-form videos. The app also includes plenty of posts of static images as well, which reminds me more of Instagram than TikTok. Still, it seems former TikTok users don't care that this isn't a one-to-one replica of the TikTok formula, and care more about sending a message to the app they once loved being addicted to. I'm not sure my limited journey with UpScrolled this morning will keep me hooked, but it's an interesting take on a social media platform. We'll just need to see if the growth will continue, or if this is just a momentary blip before people return to TikTok. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Is 'UpScrolled,' and Why Are People Switching to It From TikTok?",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG2PM5M3SA19B051H574E5T0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-28T18:30:12.000Z",
      "dateModified": "2026-01-28T18:30:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Set a Different Volume Level for Each App on Your Mac",
    "url": "https://lifehacker.com/how-to-individually-control-audio-volume-for-every-app-1847455401?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2HE2B48HWP18FSTPWY60HW/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-27T21:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 27, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Pranay Parab\n                            \n    Table of Contents\n    \n        \n        By default, your Mac doesn't allow you to control the volume levels of individual apps, something Windows has offered for years. If your alerts from messaging apps are too loud, you can either put the Mac in do-not-disturb mode to mute those alerts, or lower the system volume, but that's it. It's not ideal, since lowering system volume also impacts media volume, which can sometimes make it hard to listen to music or hear dialogue in TV shows or movies. If you could separately toggle volume levels per app, that would be ideal. Fortunately, some third-party apps allow you to do this, and this guide highlights the best of them.FineTune: A free Mac app for per-app sound control\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nA free app that lets you lower or mute alert tones while maintaining media volume, FineTune is good enough for most people. It's open-source, and has a few simple sliders that let you control each app's volume level. My previous pick for this job—BackgroundMusic—no longer works well, as it hasn't been updated in a while. FineTune's come in to fill that gap nicely, and it does what it says on the tin.Once you install the app, you can click its menu bar icon to finetune any individual app's volume. When an app starts playing audio on your Mac, it'll appear in FineTune's interface. And once you're done moving your sliders to change volume levels, you'll quickly discover a couple of other useful features, such as controlling the volume levels of each of your output device (speakers, headphones, etc.), and an equalizer for each app on your computer. You can also send audio from one app to a specific speaker or headphone. I've used these features to lower my AirPods' volume while keeping my Mac's speaker louder, and to set a bass-friendly EQ preset on those AirPods. You can play around with these tools to get the job done according to your needs, too.\nFineTune also has a convenient volume boost feature, which lets you increase the volume up to 400% on a per-app basis. This is good for files where the volume levels are almost inaudible, but I'd be choosy about how you use it.SoundSource: A paid app for advanced volume control\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nMost people will be happy with FineTune's feature set and lack of a price tag. However, if you need an app that can control AirPlay devices in your house, send audio to multiple devices at once, enable a per-app EQ with two dozen presets, set a preferred device order for audio output, and much more, then you should consider SoundSource 6 ($49). The app's been around for over a decade, and the newest version released towards the end of 2025.\n            \n                What do you think so far?\n            \n        \nWith SoundSource, the basic functionality lets you control the audio levels of each app, but it also has a few other neat touches. My favorite feature is the one that lets you mute all sound effects with just one click. I'm not sure about you, but alert sounds from messaging apps tend to make me a bit anxious. Some of my friends tend to send multiple short texts at once, too, which makes my Mac's speaker go off like a siren. I've tried putting my Mac on do-not-disturb mode, but that hides those alerts altogether, which isn't ideal either. Ever since I got SoundSource, I've just muted all sound effects. This lets me receive notifications without the annoying tones, and it allows me to watch movies sans interruptions from alert tones.You can also group multiple devices in SoundSource, and send audio to all of them at once, which is an easy way to create a multi-room audio setup. Of course, you can't have your audio 100% in sync, so don't get your hopes up about creating a surround sound system with five cheap Bluetooth speakers. However, it's good enough if you just want to have music playing in every room of your house while you cook, clean, or just move around. SoundSource's support for AirPlay devices means that you can send audio to your HomePod and other AirPlay devices like TVs or speakers, too.SoundSource also has granular controls for various features. As an example, you can set up a keyboard shortcut to increase or decrease your microphone's volume, or to mute the mic altogether. Another interesting feature lets you set up a mute timer, which sets the volume to zero for up to 2 minutes for specific apps or output devices. It's clear by now that SoundSource has lots of great features under the hood, which is amazing for power users, but probably overkill for anyone who just wants to set separate volume levels for a couple apps. The good news is that SoundSource offers a free trial that lets you use all of its features for up to 20 minutes at a time, so you can try it out to see if it's worth buying.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Set a Different Volume Level for Each App on Your Mac",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2HE2B48HWP18FSTPWY60HW/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-27T21:00:00.000Z",
      "dateModified": "2026-01-27T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Finally Clean Up Your Mac’s Menu Bar (Without Using Third-Party Software)",
    "url": "https://lifehacker.com/tech/how-to-clean-up-your-mac-menu-bar?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG31Z06SPVDYTYVGVY444ZSE/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-28T22:00:19.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        The Mac menu bar is a bit of a mess. Way too many applications want to put icons in the top-right corner of the screen, and most users only want to see a fraction of those. This is a particular problem on recent MacBooks, where the camera notch blacks out a chunk of space right in the middle of the menu bar. This is why applications for cleaning up the Mac menu bar are so popular—the clutter can feel overwhelming.Here's the thing, though: You probably don't need to leave applications like that running constantly. You can hide icons in macOS' Settings, then use a free tool once to move all the icons closer together. Here's how.How to hide icons in Mac System SettingsTahoe, also known as macOS 26, gave users a lot to talk about, which meant a few features were broadly overlooked. One of them: the ability to hide any menu bar icon, no third party software required. To use this feature open System Settings and head to the Menu Bar section. You will see the ability to toggle system icons, like Siri and Spotlight, on and off. Keep scrolling, though, and you'll find the ability to hide icons for any of your installed applications. Just toggle off any application you'd rather not see in the menu bar and it will disappear.\nI've been using this to disable unwanted icons for months, and it's working well for me. Having said that, though, it isn't a perfect replacement. Applications like Bartender and Ice don't just hide icons—they give you access to a secondary tray where you can still occasionally access icons you hid. There's no quick way to do that using the macOS settings. Still: It's a free way to hide unwanted icons, and there's no need to keep third party software running.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nIf your menu bar still feels crowded, you can free up a bit more space by squeezing all of your icons together. A free application called Menu Bar Spacing lets you change the spacing in your menu bar. Just download the application, move the slider, and your icons will move closer together.\n            \n                What do you think so far?\n            \n        \nThe great thing about Menu Bar Spacing, as an application, is that it doesn't need to run constantly. You can launch it once, make the changes you like, and then delete it—your setting will still apply. This is because the application changes a few hidden macOS settings. You can make the changes yourself using the Terminal if you prefer not to use an app, but I think the app makes things a little bit easier.There's a bit of a caveat for macOS 26 users. Because of a bug, only Apple's own icons will move closer together at first. Your other applications will need to be restarted before they bunch closer together. That means you'll need to manually close and re-launch each application, or simply restart your Mac. It's annoying, but only relevant right after you change the settings. And you'll have a lot more space on your menu bar once you're done.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Finally Clean Up Your Mac’s Menu Bar (Without Using Third-Party Software)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG31Z06SPVDYTYVGVY444ZSE/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-28T22:00:19.000Z",
      "dateModified": "2026-01-28T22:00:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suunto’s New Route Planner Is Free and Awesome",
    "url": "https://lifehacker.com/health/suuntos-new-route-planner-is-free-and-awesome?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG0F2QXWDZA0WZWKG4P7QZ3W/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-28T15:30:41.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            \n        \n            Meredith Dietz\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceMeredith is a marathon runner and stand-up comedian. As Lifehacker’s Senior Staff Writer, she covers personal fitness tech, home gym equipment, and more.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Screenshot courtesy of Suunto.\n                            \n    Table of Contents\n    \n        \n        Something you don't see every day: a sports tech company actually giving away premium features for free. Suunto's route-planning tool lets you create and download GPX files without even creating an account. No paywall, no trial period—just open the page and start planning routes. And the tool itself works great.What you can do with the Suunto RouteplannerThe tool packs in everything you'd expect from a paid service, and then some:Route creation that uses different map types (outdoor, satellite, even specialized ones for winter and avalanche terrain)Routing that optimizes for your activity (running, hiking, cycling, mountaineering, roller skating, and more), using actual heat map data from real athletesHeat map overlays for about a dozen different sports so you can see where people actually goElevation profiles with ascent and descent numbers (crucial for not dying on climbs you didn't see coming)Export routes as GPX files that work with basically any GPS deviceShareable link generation (good for six months) so you can send routes to friends without making them create accounts eitherAbility to import and modify existing GPX or FIT files from other platformsOptional account sync if you own Suunto or Hammerhead gearYou don't even need to be in Suunto's ecosystem to use this. I was able to export a map to my Garmin watch with no problem. If you do have a Suunto or Hammerhead device, you can link your account and routes will sync automatically. \nHow to use the Suunto RouteplannerGo to routeplanner.suunto.com. From there, creating a route is pretty straightforward. If you let your browser share your location, it'll center on where you are. If not, just search for wherever you want to start. The controls on the right side let you switch between map types. The usual suspects are there: outdoor, satellite, light, dark. But then it gets weird in the best ways with a winter map, an avalanche terrain map for backcountry stuff, and, in a show of national pride, a dedicated Finland Terrain map. Respect.To actually connect points on the map, you have the following options:Free drawing (no automatic routing)Any road or path (ideal for activities by foot)All road types—avoiding hills (ideal for bikes)All road types (still ideal for bikes)Paved roads (ideal for road cycling)After you create your route, you simply download the GPX file and throw it on whatever GPS device you own.\n            \n                What do you think so far?\n            \n        \nThe six-month shareable links are a nice touch too. You can plan a route for a group ride or run, send everyone the link, and they can grab it without jumping through hoops. It's the kind of friction-free sharing that should be standard but somehow isn't.Why you should try the Suunto RouteplannerStrava and Komoot have trained users to expect paywalls for route planning. Of course, this could be strategic on Suunto's part, to give away the software in the hopes of selling the hardware. Or maybe it's just goodwill after years of user complaints about Suunto closing their tracking system Movescount. Either way, users win. You get a legitimately useful tool without opening your wallet or handing over your email address.If you're already paying for route planning elsewhere, try this first. Worst case, you waste five minutes. Best case, you cancel a subscription and pocket the savings. Even if you'e not looking to save money, having another route planning option in your toolkit doesn't hurt.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suunto’s New Route Planner Is Free and Awesome",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG0F2QXWDZA0WZWKG4P7QZ3W/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-28T15:30:41.000Z",
      "dateModified": "2026-01-28T15:30:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Moltbot (Formerly Clawdbot) Already Has a Malware Problem",
    "url": "https://lifehacker.com/tech/moltbot-already-has-a-malware-problem?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG2YVWPWBRZQY5TXPW97HBS9/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-28T20:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 28, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Moltbot\n                            \n            \n                Key Takeaways\n                                            Security researchers have discovered a malicious Microsoft Visual Studio Code extension designed for Moltbot.\n                                            The extension was hosted on the official Extension Marketplace before being taken down by Microsoft on Tuesday.\n                                            The extension allows bad actors to connect to your device via a remote desktop program, so they can take over the device.\n                                            Researchers have found other security issues with Moltbot.\n                                    \n            \n    Table of Contents\n    \n        \n        Moltbot (formerly known as Clawdbot) is the most viral AI product I've seen in a while. The personal AI assistant runs locally and connects via a chat app, like WhatsApp or iMessage. Once you give Moltbot access to your entire device, it can do things on that device for you. This the sort of thing that excites agentic AI pioneers, but worries privacy and security enthusiasts like myself. And indeed, I have significant concerns about the risks installing Moltbot on your personal machine. Since agentic AI will autonomously perform tasks based on prompts, bad actors can take advantage of the situation by surreptitiously feeding those bots malicious prompts of their own. This is called prompt injection, and it can impact any type of agentic AI system, whether an AI browser, or an AI assistant like Moltbot.      But it's not just prompt injection that presents an issue for Moltbot users.\nSomeone has already created a malicious Moltbot extension   As spotted by The Hacker News, Moltbot already has its first malicious extension, dubbed \"Clawdbot Agent - AI Coding Assistant\" (\"clawdbot.clawdbot-agent.\") It seems to have been developed before the bot's name change. This extension is designed for Visual Studio Code, Microsoft's open source AI code editor. What's worse, it was hosted on Microsoft's official Extension Marketplace, which no doubt gave it legitimacy to Moltbot users looking for a Visual Studio Code extension.    The extension advertised itself as a free AI coding assistant. When you install it, it executes a series of commands that ends up running a remote desktop program (The Hacker News says it's \"ConnectWise ScreenConnect\") on your device. It then connects to a link that lets the bad actor gain remote access to your device. By just installing this extension, you essentially give the hacker the tools to take over your computer from wherever they are.   Luckily, Microsoft has already taken action. The extension is no longer available on the marketplace as of Tuesday. Moltbot has no official Visual Studio Code extension, so assume any you see are illegitimate at best, and malicious at worst. If you did install the extension, researchers have detailed instructions for removing the malware and blocingk any of its processes from running on your device. Of course, to first thing to do is uninstall the extension from Visual Studio Code immediately.Moltbolt has more security issues tooThe Hacker News goes on to highlight findings from security researcher Jamieson O'Reilly, who discovered hundreds of unauthenticated Moltbot instances readily available on the internet. These instances reveal Moltbot users' configuration data, API keys, OAuth credentials, and even chat histories. \n            \n                What do you think so far?\n            \n        \nBad actors could use these instances for prompt injection: They could pretend to be a Moltbot user, and issue their own prompts to that user's Moltbot AI assistant, or manipulate existing prompts and responses. They could also upload malicious \"skills,\" or specific collections of context and knowledge, to MoltHub and use them to attack users and steal their data. Speaking to The Hacker News, security researcher Benjamin Marr explains that the core issue is how Moltbot is designed for \"ease of deployment\" over a \"secure-by-default\" set up. You can poke around with Moltbot and install sensitive programs without the bot ever warning you about the security risks. There should be firewalls, credential validation, and sandboxing in the mix, and without those things, the user is at greater risk.  To combat against this, The Hacker News recommends that all Moltbot users running with the default security configurations take the following steps: remove any connected service integrationscheck exposed credentialsset up network controlslook for any signs of attackOr, you could do what I'm doing, and avoid Moltbot altogether.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Moltbot (Formerly Clawdbot) Already Has a Malware Problem",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG2YVWPWBRZQY5TXPW97HBS9/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-28T20:30:00.000Z",
      "dateModified": "2026-01-28T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Start a Group Chat in Spotify's DMs (for Some Reason)",
    "url": "https://lifehacker.com/tech/spotify-now-supports-group-chats?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG5J6KDEVKM25TBB8ST0W0AN/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-29T20:30:02.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 29, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Spotify is expanding its in-app message feature to support group chats.\n                                            Group chats can be as large as 10 people, and otherwise function the same as Spotify's one-on-one chats.\n                                            All users have access to Spotify Messages, including both free and Premium users.\n                                    \n            \n    Table of Contents\n    \n        \n        If you and your friends have the same taste in music, you probably text each other what you're listening to. I know when I stumble upon a new discovery I love—or even something I think is trash—I fire it off to the group chat to talk about it. Of course, I just forward the song to the group chat in the Messages app, like any other thing I'd want to send to that group. If you have Spotify, however, you have a new group chat option to choose from: Spotify itself. Spotify heads might already know that the app has had a messaging feature since August. While the point of the feature is to send Spotify content to your friends, it's a basic messaging service, which means you can send any text you want—including emojis. It's available to any Spotify user, whether you have Premium or just a free account, so long as you're 16 or older. None of that is new today.What is new today is the amount of people you can text at once in Spotify. Since August, chats have been limited to one-on-one interactions. Now, you're able to add up to nine other people at once to a thread. That means 10-person group chats to talk about new music, podcasts, audiobooks, or, of course, anything at all—assuming you actually want to move your DMs to Spotify.\nHow to start a group chat on SpotifyTo start, open Spotify on mobile (this isn't supported on desktop at this time) then tap your profile in the top right corner. Look for \"Messages\" at the bottom of this menu, then choose \"New Message.\" If this is your first time interacting with people on Spotify, you'll need to invite others to chat before you can craft a new message. Here, you'll have the choice to share a link to invite a friend to join your message. You can also find this option from the share menu on any piece of Spotify content, and hitting the \"Invite friends\" option. Once you've initiated a message, you'll be able to start crafting new ones—including group chats. Head back to this Messages menu—or hit the share button on a song, podcast, or audiobook—then choose \"Create group.\" Here, tap any friends from the suggestions you'd like to add, then choose \"Create group\" again to finalize the chat. Spotify says the people that appear in the list of suggestions are those you have shared content to before, created a playlist or Blend with previously, were in a \"recent\" Jam together, or are on an active Family or Duo plan. If they don't appear, you can always choose the invite option to reach out directly.\n            \n                What do you think so far?\n            \n        \nWhoever creates the group is officially its admin. As the admin, you have the power to add or remove anyone from the group chat. If you're in the group chat, you're labeled as a \"Participant.\" Invited members are labeled \"Pending.\" The admin as well as any participants are allowed to block any group chat user for any reason.The issue is, do you really want to dedicate a group chat to Spotify itself? Maybe if this feature rolled out when the app launched way back when, it'd be different. But people are set in their ways: It's so hard to get people to move chat apps, especially when it's for one specific purpose. Rather than open yet another thread to keep track of, I think I'd rather just text links to my main group chat—and I'm guessing the other members of the chat would agree. How to turn off Spotify MessagesIf you don't want to use Spotify's messaging service at all, you can leave it behind, and save yourself from getting added to all future group and one-on-one chats. To do so, tap your profile, choose \"Settings and privacy,\" then hit \"Privacy and social.\" Here, scroll down to \"Social features\" and turn off \"Messages.\" \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Start a Group Chat in Spotify's DMs (for Some Reason)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG5J6KDEVKM25TBB8ST0W0AN/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-29T20:30:02.000Z",
      "dateModified": "2026-01-29T20:30:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]