[
  {
    "title": "You Can Get a Lifetime of AdGuard's Family Plan on Sale for Just $16 Right Now",
    "url": "https://lifehacker.com/tech/adguard-family-plan-stacksocial-sale-october-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K6FZHCGFJRJ42A8QBC540QX6/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-01T17:30:00.000Z",
    "description": "<div>\n        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                    <img src=\"https://lifehacker.com/images/",
    "body": "<div>\n        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                    <img src=\"https://lifehacker.com/images/lifehacker-logo.svg\" alt=\"Lifehacker Logo\" />\n                </a></p><p>Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                </p>\n                <div>\n                    <ul>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/our-mission\">Our Mission</a></li>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/our-team\">Our Team</a></li>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/newsletters\">Newsletter</a></li>\n                    </ul>\n                </div>\n            </div>\n        <div>\n                <p>© 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. <span>ALL RIGHTS RESERVED.</span></p>\n                <p>Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee <span>by that merchant.</span></p>\n            </div>\n    </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Get a Lifetime of AdGuard's Family Plan on Sale for Just $16 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01K6FZHCGFJRJ42A8QBC540QX6/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-01T17:30:00.000Z",
      "dateModified": "2025-10-01T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Speak With a Real Person at Best Buy Customer Service",
    "url": "https://lifehacker.com/money/how-to-speak-with-a-best-buy-customer-service-representative?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JD2S451XG1SC2B87GGRHZ1MW/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-09-25T17:30:00.000Z",
    "description": "<div>\n        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                    <img src=\"https://lifehacker.com/images/",
    "body": "<div>\n        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                    <img src=\"https://lifehacker.com/images/lifehacker-logo.svg\" alt=\"Lifehacker Logo\" />\n                </a></p><p>Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                </p>\n                <div>\n                    <ul>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/our-mission\">Our Mission</a></li>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/our-team\">Our Team</a></li>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/newsletters\">Newsletter</a></li>\n                    </ul>\n                </div>\n            </div>\n        <div>\n                <p>© 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. <span>ALL RIGHTS RESERVED.</span></p>\n                <p>Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee <span>by that merchant.</span></p>\n            </div>\n    </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Speak With a Real Person at Best Buy Customer Service",
      "image": [
        "https://lifehacker.com/imagery/articles/01JD2S451XG1SC2B87GGRHZ1MW/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-09-25T17:30:00.000Z",
      "dateModified": "2025-09-25T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Your Smart Home Might Not Be As Secure As You Think",
    "url": "https://lifehacker.com/tech/smart-home-security-issues?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K4ZP6JBCPPRFSTW9KQ03SPA2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-09-30T12:45:00.000Z",
    "description": "<div>\n    <div>\n        <div>\n            <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                <img src=\"https://lifehacker.com/image",
    "body": "<div>\n    <div>\n        <div>\n            <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                <img src=\"https://lifehacker.com/images/lifehacker-logo.svg\" alt=\"Lifehacker Logo\" />\n            </a></p>\n        </div>\n    </div>\n            <section>\n                                                    <div>\n                    <p>Your devices are vulnerable to attack, but you can mitigate the risks.</p>\n            </div>\n                        <section>\n    <div>\n                            <p>\n        <svg>\n        </svg>\n        September 30, 2025\n                </p>\n            </div>\n            <img src=\"https://lifehacker.com/imagery/articles/01K4ZP6JBCPPRFSTW9KQ03SPA2/hero-image.fill.size_1248x702.v1759166856.jpg\" alt=\"An illustration of a house with a giant lock floating over it in the air\" srcset=\"https://lifehacker.com/imagery/articles/01K4ZP6JBCPPRFSTW9KQ03SPA2/hero-image.fill.size_400x225.v1759166856.jpg 400w, https://lifehacker.com/imagery/articles/01K4ZP6JBCPPRFSTW9KQ03SPA2/hero-image.fill.size_800x450.v1759166856.jpg 800w, https://lifehacker.com/imagery/articles/01K4ZP6JBCPPRFSTW9KQ03SPA2/hero-image.fill.size_1248x702.v1759166856.jpg 1600w\" />\n                        <p><span>Credit: René Ramos/Lifehacker/Jason marz, Javier Zayas Photography/Moment, Violka08/iStock via Getty Images</span>\n                            </p>\n    <p><a target=\"_blank\" href=\"https://lifehacker.com/series/a-guide-to-automating-your-entire-home\">\n            <img src=\"https://lifehacker.com/imagery/series/01K6AS5E2V7HK0CRA1G69EK57T/logo.fill.size_2880x1060.v1759151044.jpg\" alt=\"A Guide to Automating Your Entire Home logo\" />\n            </a>\n        <span>\n            <p><em>In Lifehacker’s series, “A Guide to Automating Your Entire Home,” we’re highlighting all the ways you can power your home with autonomous technology, room by room. Whether you want to build a smart security system, turn a “dumb” device smart, or simply control your lights from your phone, this guide will help walk you through it.</em></p>\n        </span>\n    </p>\n    <article>\n        <hr />\n        <p>Smart home devices can streamline a lot of your day-to-day tasks. With an internet connection and some simple automations, you may never have to carry house keys, turn off the lights, or touch your thermostat again. But all of this convenience comes at a potential cost, as smart tech is vulnerable to attack by cyber actors, leaving your personal data and your privacy at risk. </p><p>Here's what you need to know to secure your smart home.</p><h2 id=\"is-your-smart-home-secure\">Is your smart home secure? </h2><p>The short answer: not by default. Smart homes have vulnerabilities at multiple levels, from the devices themselves, to your home network, to the physical endpoints, like your phone, that have access to and control over your Internet of Things (IoT). </p>\n<p>To start, IoT devices may have weak built-in security protocols or lack clear instructions to help users lock them down from factory settings, leaving them vulnerable to hackers, who may have to exert very little effort to access your data or spy on you. Wifi routers and smart home devices often have default credentials that are publicly available and therefore easy to get past—and  <a href=\"https://www.ibm.com/think/insights/router-reality-check-86-percent-default-passwords-have-never-been-changed\" target=\"_blank\" title=\"open in a new window\">data show</a> that the vast majority of users have never changed their router admin password or adjusted any factory settings. If your home network isn't secure, nothing connected to it can be considered secure either. </p><p>Smart devices can also be integrated into botnets, allowing threat actors to conduct malicious activity like account takeovers and malware distribution using your home network. A recent instance of this was <a href=\"https://lifehacker.com/tech/this-android-malware-is-attacking-smart-home-devices\" target=\"_blank\">a campaign known as BADBOX 2.0</a>, which targeted off-brand consumer electronics manufactured in China. </p><p>Bill Budington, a senior staff technologist at the <a href=\"https://www.eff.org/\" target=\"_blank\" title=\"open in a new window\">Electronic Frontier Foundation</a> (EFF), notes the digital divide may increase the risk for some consumers, who may seek out cheaper devices from low-cost manufacturers that have weaker security and far less to lose in terms of reputation if they are implicated in vulnerabilities as compared to major companies like Amazon. </p><p>Finally, security can be compromised if your physical devices fall into the wrong hands. For example, if you control your smart home using apps on your phone, a threat actor could gain access in the event said phone is lost, stolen, or hacked.  </p><h2 id=\"smart-homes-can-compromise-privacy\">Smart homes can compromise privacy</h2><p>Left unsecured, smart home devices can also put your privacy (and potentially your safety) at risk. Internet-connected cameras, from baby monitors to pet cams, <a href=\"https://lifehacker.com/tech/can-someone-spy-through-webcam-or-phone\" target=\"_blank\">are vulnerable to hacking</a>, and threat actors can use them to surveil you and your home. This may include snooping on and tracking your movements, \"shoulder surfing\" to collect sensitive personal information from your devices, recording audio and video footage of your private activities, and sharing or selling live feeds on the dark web. (In <a href=\"https://www.businessinsider.com/nest-baby-monitor-hacked-by-man-who-threatened-kidnapping-2018-12\" target=\"_blank\" title=\"open in a new window\">a particularly alarming incident in 2018</a>, a hacker reportedly issued verbal threats toward a four-month-old child through a Nest-branded baby monitor.)</p><p>Your smart tech is also likely collecting a lot of information about you in the course of its normal activities—all of which could be exploited. For example, your robot vacuum creates and utilizes a map of your home's physical layout to know where to go, and usage patterns from various automations can be used to track your movements and confirm when you're away from home. </p><p>There's also the possibility that your smart home devices are compromising your data in ways you aren't aware of and haven't actively consented to. A <a href=\"https://engineering.nyu.edu/news/new-research-reveals-alarming-privacy-and-security-threats-smart-homes\" target=\"_blank\" title=\"open in a new window\">2023 report from security experts</a>—led by the nonprofit IMDEA Networks and Northeastern University—shows that IoT devices may inadvertently expose personal information that can be harvested and sold to companies involved in surveillance capitalism. Researchers found that spyware apps and advertisers abuse local network protocols to access sensitive data, making it easier to profile users. </p><h2 id=\"no-security-standards-for-smart-homes\">No security standards for smart homes</h2><p>One of the biggest barriers to smart home security is that there isn't a single set of cybersecurity standards that companies have to follow, nor a centralized resource for users to research this information. Earlier this year—during the last few weeks of the Biden administration—the Federal Communications Commission launched the <a href=\"https://www.fcc.gov/CyberTrustMark\" target=\"_blank\" title=\"open in a new window\">U.S. Cyber Trust Mark</a> voluntary labeling program to incentivize device manufacturers to improve security and help consumers buy with confidence. However, under the Trump administration, the agency later <a href=\"https://www.cybersecuritydive.com/news/fcc-cyber-trust-mark-ul-investigation-delay/758507/\" target=\"_blank\" title=\"open in a new window\">launched an investigation</a> into the program, delaying its rollout. </p><p>For now, consumers are left to do their own due diligence. In 2017, the nonprofit Mozilla Foundation created a resource called <a href=\"https://www.mozillafoundation.org/en/privacynotincluded/categories/smart-home/\" target=\"_blank\" title=\"open in a new window\">*Privacy Not Included</a>, with reviews of products measured against \"minimum security standards\" and breakdowns of any privacy concerns. The site doesn't appear to have been updated in the last year, but you can still find detailed information about the privacy and security history of well-known smart home manufacturers like Amazon, Google, Wyze, and Ecobee. </p><p>Otherwise, Budington suggests simply searching the device you're considering (and the company that makes it) before buying, to see if researchers or users have reported any concerns. </p><div>\n            <p><span>\n                What do you think so far?\n            </span>\n        </p></div>\n<h2 id=\"how-to-improve-your-smart-home-security\">How to improve your smart home security</h2><p>Securing your smart home starts with securing your internet connection via your router. Lifehacker has assembled a whole <a href=\"https://lifehacker.com/home/how-to-make-your-home-security-system-and-wireless-network-safe\" target=\"_blank\">guide to protecting your home network</a>, but at the very least, you should change any default router settings—admin usernames, passwords, and network names—to something unique and not personally identifiable, and turn on encryption in your wireless security settings. Regularly check for updates, which provide patches for security flaws, and audit the devices connected to your network to identify anything suspicious and remove those you no longer use. </p><p>You can add another layer of security with a guest network set up specifically for your IoT devices. That way, if your smart devices are compromised, everything connected to your primary network (such as computers and phones with access to your personal and financial accounts) will be protected. </p><p>According to Budington, one way to further mitigate vulnerability is to reduce the number of devices with their own wireless connection, running them through a secure, centralized hub instead. Home Assistant is a <a href=\"https://lifehacker.com/tech/self-host-apps\" target=\"_blank\">self-hosted option</a> that can be installed on a Raspberry Pi or a traditional PC or used with the plug-and-play Home Assistant Green. Hubitat also gives you local control over your device data and integrates with a variety of products, including those compatible with the <a href=\"https://lifehacker.com/tech/your-most-important-smart-home-decision-is-the-ecosystem-you-choose\" target=\"_blank\">Zigbee, Z-Wave, and Matter standards</a>. </p><p>Once your network is secure, you'll want to <a href=\"https://consumer.ftc.gov/articles/securing-your-internet-connected-devices-home\" target=\"_blank\" title=\"open in a new window\">take similar steps</a> with each of your IoT devices. Change default usernames and passwords to unique, secure alternatives and enable all available security features, such as two-factor authentication and encryption, in the device settings. Ensure your devices (and any apps used to control them) receive automatic firmware updates. </p><p>You should also <a href=\"https://lifehacker.com/tech/how-to-protect-your-privacy-when-using-smart-home-tech\" target=\"_blank\">check your device's privacy settings</a>, removing permissions that aren't essential for it to function and disabling features you won't use. For example, you could turn off location tracking on your smart thermostat and disable voice control for devices other than your voice assistant. </p><p>Finally, while we've focused mostly on digital threats, your smart home isn't immune to physical compromise. Be aware of ways your devices can be accessed, such as those installed on the exterior of your house, and ensure phones and tablets and the apps on them that control IoT devices are secured with a PIN or biometric authentication.</p><p>Remember that, by nature, anything connected to the internet is at least somewhat vulnerable to attack. You'll have to consider your own risk tolerance and weigh the convenience of having a smart device against the potential for it to be compromised—and your privacy along with it. You may find that there are some things that you simply don't need to automate, and therefore you can stick with the \"dumb\" alternative. </p>\n            </article>\n    <div>\n    <div>\n        <p><span>The Download Newsletter</span>\n            <span>Never miss a tech story</span>\n        </p>\n        <p><img src=\"https://lifehacker.com/images/team/Jake.png\" alt=\"Jake Peterson portrait\" />\n            <span>Jake Peterson\n            </span>\n        </p>\n        <p><span>Get the latest tech news, <span></span>reviews, <span></span>and advice from Jake and the team.</span>\n    </p></div>\n    <div>\n        <p><span>The Download Newsletter</span>\n            <span><span>Never miss a tech story.</span> Get the latest tech news, <span></span>reviews, <span></span>and advice from Jake and the team.</span>\n        </p>\n    </div>\n</div>\n                        <div>\n                <div>\n                    <p><img src=\"https://lifehacker.com/imagery/authors/01HF2FBGBC5PWJAAJJJHG350CH/image.fill.size_150x150.v1737570988.png\" alt=\"Photo of Emily Long\" />\n                                            </p>\n                </div>\n                <div>\n                                            <div>\n    <p>More by Emily</p>\n        <hr />\n        </div>\n                        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/entertainment/wordle-nyt-hint-today-october-6-2025\">\n                    <img src=\"https://lifehacker.com/imagery/articles/01K6NDPMNVDG8VP9H60X546HEA/hero-image.fill.size_75x75.v1759508124.jpg\" alt=\"wordle art\" />\n                </a>\n            </p></div>\n        <hr />\n                    <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/entertainment/wordle-nyt-hint-today-october-5-2025\">\n                    <img src=\"https://lifehacker.com/imagery/articles/01K6NDGZ2QQ13JNXHP4D0WZTXM/hero-image.fill.size_75x75.v1759507938.jpg\" alt=\"wordle art\" />\n                </a>\n            </p></div>\n        <hr />\n                                        </div>\n            </div>\n                                </section>\n                                                </section>\n    </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Your Smart Home Might Not Be As Secure As You Think",
      "image": [
        "https://lifehacker.com/imagery/articles/01K4ZP6JBCPPRFSTW9KQ03SPA2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-09-30T12:45:00.000Z",
      "dateModified": "2025-09-30T12:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Get Microsoft Visual Studio Pro for Just $10 Right Now",
    "url": "https://lifehacker.com/tech/microsoft-visual-studio-stacksocial-sale-october-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K6G08NJCQRH0A9ME5T3B01N1/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-01T20:30:00.000Z",
    "description": "<div>\n        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                    <img src=\"https://lifehacker.com/images/",
    "body": "<div>\n        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                    <img src=\"https://lifehacker.com/images/lifehacker-logo.svg\" alt=\"Lifehacker Logo\" />\n                </a></p><p>Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                </p>\n                <div>\n                    <ul>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/our-mission\">Our Mission</a></li>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/our-team\">Our Team</a></li>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/newsletters\">Newsletter</a></li>\n                    </ul>\n                </div>\n            </div>\n        <div>\n                <p>© 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. <span>ALL RIGHTS RESERVED.</span></p>\n                <p>Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee <span>by that merchant.</span></p>\n            </div>\n    </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Get Microsoft Visual Studio Pro for Just $10 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01K6G08NJCQRH0A9ME5T3B01N1/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-01T20:30:00.000Z",
      "dateModified": "2025-10-01T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "All the Smart Gadgets You Need for a Self-Cleaning Home",
    "url": "https://lifehacker.com/home/all-the-smart-gadgets-for-a-self-cleaning-home?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-09-30T12:30:00.000Z",
    "description": "<div>\n    <div>\n        <div>\n            <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                <img src=\"https://lifehacker.com/image",
    "body": "<div>\n    <div>\n        <div>\n            <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                <img src=\"https://lifehacker.com/images/lifehacker-logo.svg\" alt=\"Lifehacker Logo\" />\n            </a></p>\n        </div>\n    </div>\n            <section>\n                                                    <div>\n                    <p>Offload your cleaning chores to the latest tech.</p>\n            </div>\n                        <section>\n    <div>\n                            <p>\n        <svg>\n        </svg>\n        September 30, 2025\n                </p>\n            </div>\n            <img src=\"https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/hero-image.fill.size_1248x702.v1759151725.jpg\" alt=\"A collage showing a smart vacuum with a robotic arm holding a slipper on a colorful illustrated background of a house\" srcset=\"https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/hero-image.fill.size_400x225.v1759151725.jpg 400w, https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/hero-image.fill.size_800x450.v1759151725.jpg 800w, https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/hero-image.fill.size_1248x702.v1759151725.jpg 1600w\" />\n                        <p><span>Credit: René Ramos/Lifehacker/NurPhoto, DaryaDanik/iStock via Getty Images</span>\n                            </p>\n    <p><a target=\"_blank\" href=\"https://lifehacker.com/series/a-guide-to-automating-your-entire-home\">\n            <img src=\"https://lifehacker.com/imagery/series/01K6AS5E2V7HK0CRA1G69EK57T/logo.fill.size_2880x1060.v1759151044.jpg\" alt=\"A Guide to Automating Your Entire Home logo\" />\n            </a>\n        <span>\n            <p><em>In Lifehacker’s series, “A Guide to Automating Your Entire Home,” we’re highlighting all the ways you can power your home with autonomous technology, room by room. Whether you want to build a smart security system, turn a “dumb” device smart, or simply control your lights from your phone, this guide will help walk you through it.</em></p>\n        </span>\n    </p>\n    <article>\n        <hr />\n        <p>Cleaning is one of those necessary chores that most of us don't have much enthusiasm for. It's often demanding and tedious work, and while you're taking care of it, you do so with the knowledge that you're going to have to do it all again next week.</p><p>There's some good news, though, for the cleaning-averse: Modern day tech can handle a lot of these jobs on your behalf, as smart cleaning gadgets continue to get better and better. In recent years, they've become more reliable and more effective, and you've got a host of different models to choose from.</p><p>This introduction to smart cleaning technology will bring you up to date on the products that are available, and what they can do for you. Yes, you can have a home that's neater and cleaner—with just a few button presses.</p>\n<h2 id=\"the-pros-and-cons-of-cleaning-tech\">The pros and cons of cleaning tech</h2><p>The big positive from investing in smart cleaning gadgets is, of course, that you won't have to do these jobs yourself, so the hours you save can be put towards doing something you actually enjoy.</p><p>These gadgets don't get tired, sick, or irritable, and will work at any time of the day or night—though you don't necessarily want a robot vacuum humming away at 4 a.m.. In many cases they can be operated remotely and work autonomously, so they can be taking care of the chores while you're out at work or on vacation.</p><div>\n    <p><img src=\"https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-1.fill.size_2000x1125.v1757951599.jpg\" alt=\"Ecovacs Winbot W2 Pro Omni\" srcset=\"https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-1.fill.size_800x450.v1757951599.jpg 800w, https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-1.fill.size_1400x788.v1757951599.jpg 1400w, https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-1.fill.size_2000x1125.v1757951599.jpg 2000w\" />\n            </p>\n            <p><span>You can get smart devices to wash your windows for you.</span>\n                                        <span>Credit: Ecovacs</span>\n                    </p>\n    </div>\n<p>You <em>are </em>going to have to make an initial investment in the technology, and, for some devices, a rather sizable one. The argument can be made that hiring someone to do your cleaning is a better option than getting robots to do it: They might do a more thorough job, depending on the person and the gadget you're comparing them to, and you can give them more specific instructions. However, getting cleaners in does involve giving someone else access to your home, and finding a mutually convenient time. It will also be an ongoing expense.</p><p>There are a few more cons to consider. One is that a certain amount of tidying up and preparation work is often required before the robots can take over. You may have to pick up toys and clothes, for example, so the robot vacuum can vacuum. By the time you've done that, you might think it makes more sense to just do the whole job yourself.</p><div>\n    <p><img src=\"https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-2.fill.size_2000x1125.v1757951599.jpg\" alt=\"Roomba app\" srcset=\"https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-2.fill.size_800x450.v1757951599.jpg 800w, https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-2.fill.size_1400x788.v1757951599.jpg 1400w, https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-2.fill.size_2000x1125.v1757951599.jpg 2000w\" />\n            </p>\n            <p><span>Many smart devices can be controlled via an app.</span>\n                                        <span>Credit: iRobot</span>\n                    </p>\n    </div>\n<p>What's more, these gadgets require a certain level of maintenance: Depending on the device, you need to empty them out, supply them with power, water, and cleaning products, and perhaps even clean parts of them yourself. Like any piece of hardware, they will experience wear and tear, and will eventually need to be replaced.</p><p>There's one other consideration to think about, which is that manual cleaning is a great way to exercise. <a href=\"https://bmcgeriatr.biomedcentral.com/articles/10.1186/s12877-023-04039-1\" target=\"_blank\" title=\"open in a new window\">Studies have shown</a> that domestic duties can give you enough of a workout to extend your lifespan and improve a host of different health markers, so you might want to use some of the time that these gadgets are saving you to head out for a run or for a session at the gym.</p><h2 id=\"the-best-smart-cleaning-gadgets-you-can-buy\">The best smart cleaning gadgets you can buy</h2><p>If you've decided that you want to transform your home into one that cleans itself, you can automate a number of different processes using a number of different devices. There's plenty of choice out there, so the usual rules apply: Take your time to research the various options and the features they're offering versus their price, and find as many reviews as you can from people who've used them.</p><h3>Robot vacuums and mops</h3><p>This is the obvious place to start, as these are the gadgets that usually come to mind when you think of smart cleaning tech. You can find single-purpose devices that only vacuum or only mop, or devices that combine both functions.</p><p>While early models had their issues with reliability and cleaning power, the robot vacuums you can buy today are generally more impressive in terms of how clean they can get your carpets and floors. You'll find features like LiDAR and camera-powered mapping and obstacle avoidance, self-emptying capabilities, and auto-adjustments depending on what surface is being cleaned. </p><p>Often, everything these machines do can be organized through a companion app, so you can set the cleaners to work on a specific schedule, as well as set zones or rooms that are off limits. We're even starting to see robot vacuums that can <a href=\"https://vacuumwars.com/eufy-marswalker-omni-s2-ifa-2025/\" target=\"_blank\" title=\"open in a new window\">climb up the stairs</a>, so they really can get your whole house vacuumed and mopped without an assist.</p><div>\n            <p><span>\n                What do you think so far?\n            </span>\n        </p></div>\n<div>\n    <p><img src=\"https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-3.fill.size_2000x1125.v1757951599.jpg\" alt=\"Roborock Saros 10R\" srcset=\"https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-3.fill.size_800x450.v1757951599.jpg 800w, https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-3.fill.size_1400x788.v1757951599.jpg 1400w, https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-3.fill.size_2000x1125.v1757951599.jpg 2000w\" />\n            </p>\n            <p><span>The Roborock Saros 10R comes with its own docking station.</span>\n                                        <span>Credit: Roborock</span>\n                    </p>\n    </div>\n<p>These cleaners can be a significant investment. The <a href=\"https://zdcs.link/av3rBq?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=Samsung%20Jet%20Bot%2B&short_url=av3rBq&u=https%3A%2F%2Flifehacker.com%2Fhome%2Fall-the-smart-gadgets-for-a-self-cleaning-home&event_label=Samsung%20Jet%20Bot%2B\" target=\"_blank\" title=\"open in a new window\">Samsung Jet Bot+</a> costs $600 and brings with it automatic emptying, LiDAR-based navigation around your rooms, smart suction adjustments, and an advanced 5-layer HEPA filtration system for trapping dust. If you've got more to spend, the <a href=\"https://zdcs.link/QqRpZq?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=Roborock%20Saros%2010R&short_url=QqRpZq&u=https%3A%2F%2Flifehacker.com%2Fhome%2Fall-the-smart-gadgets-for-a-self-cleaning-home&event_label=Roborock%20Saros%2010R\" target=\"_blank\" title=\"open in a new window\">Roborock Saros 10R</a> can be yours for $1,600, and offers top-tier suction, obstacle avoidance, corner and edge cleaning, and automatic emptying via the supplied dock.</p><h3>Smart window washers</h3><p>You can also put robots to work on your windows—although there are fewer models to choose from. Using suction to work their way across windows, cleaning and drying as they go, leaving you with window panes free of dust and grime. Again, these tools can be managed via an app, though a bit more manual setup is required to get them in position to start cleaning.</p><p>The Ecovacs Winbot series includes some of the best window cleaning options on the market at the moment. The <a href=\"https://zdcs.link/zEJl52?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=Ecovacs%20Winbot%20W2%20Pro%20Omni&short_url=zEJl52&u=https%3A%2F%2Flifehacker.com%2Fhome%2Fall-the-smart-gadgets-for-a-self-cleaning-home&event_label=Ecovacs%20Winbot%20W2%20Pro%20Omni\" target=\"_blank\" title=\"open in a new window\">Ecovacs Winbot W2 Pro Omni</a> costs $450, and can work while plugged in or via its built-in battery. It has a triple-nozzle system is combined with a cleaning cloth for effective performance as it methodically travels across windows of almost any size or type.</p><div>\n    <p><img src=\"https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-4.fill.size_2000x1125.v1757951599.jpg\" alt=\"LG WM6700HBA\" srcset=\"https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-4.fill.size_800x450.v1757951599.jpg 800w, https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-4.fill.size_1400x788.v1757951599.jpg 1400w, https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/images-4.fill.size_2000x1125.v1757951599.jpg 2000w\" />\n            </p>\n            <p><span>The LG WM6700HBA comes with AI settings.</span>\n                                        <span>Credit: LG</span>\n                    </p>\n    </div>\n<h3>Smart washers and dryers</h3><p>Then there are devices that add some extra smarts to existing appliances, such as <strong>smart washers and dryers</strong>. These pieces of hardware elevate clothes cleaning with a variety of useful and intelligent tricks, including the ability to adjust cleaning and drying cycles to the type and size of load, remote control via mobile apps, and a number of self-maintaining mechanisms.</p><p>A good example is the <a href=\"https://zdcs.link/9YMkVn?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=LG%20WM6700HBA&short_url=9YMkVn&u=https%3A%2F%2Flifehacker.com%2Fhome%2Fall-the-smart-gadgets-for-a-self-cleaning-home&event_label=LG%20WM6700HBA\" target=\"_blank\" title=\"open in a new window\">LG WM6700HBA</a>, which will set you back $1,250. There's on-board AI assistance to work out the best cycles for the clothes you're washing, an automatic dispenser for just the right amount of detergent and fabric softener to cut down on waste, and remote operations and monitoring via the LG ThinQ app.</p><h3>Smart dishwashers</h3><p>Finally we have <strong>smart dishwashers</strong>, which use automated technology to give your crockery and cutlery a better clean than standard appliances might. The features are similar to those you'll find on smart washers and dryers: Sensing technology for understanding what's been loaded in and adjusting the cleaning accordingly, remote app control and smart home integration, and as much automated maintenance and self-cleaning as possible.</p><p>Take a look at the <a href=\"https://zdcs.link/98PJqd?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=Bosch%20500%20Series&short_url=98PJqd&u=https%3A%2F%2Flifehacker.com%2Fhome%2Fall-the-smart-gadgets-for-a-self-cleaning-home&event_label=Bosch%20500%20Series\" target=\"_blank\" title=\"open in a new window\">Bosch 500 Series</a>, which is priced at $1,250 at the time of writing. It has intelligent sensors to check cleaning progress, an AutoAir feature that automatically pops the dishwasher door open when cleaning is finished to let air circulate, and the option of operating cleaning cycles and other dishwasher features from an app on your phone.</p>\n            </article>\n    <div>\n    <div>\n        <p><span>Smarter Home & Living <span>Newsletter</span></span>\n            <span>Never miss a story</span>\n        </p>\n        <p><img src=\"https://lifehacker.com/images/team/Lindsey.png\" alt=\"Lindsey Ellefson portrait\" />\n            <span>Lindsey Ellefson\n            </span>\n        </p>\n        <p><span><span>Get the latest smart home news, trends,</span> <span>and advice from Lindsey and the team.</span></span>\n    </p></div>\n    <div>\n        <p><span>Smarter Home & Living <span>Newsletter</span></span>\n            <span><span>Never miss a story.</span> <span>Get the latest smart home news, trends,</span> <span>and advice from Lindsey and the team.</span></span>\n        </p>\n    </div>\n</div>\n                        <div>\n                <div>\n            <div>\n                    <p><img src=\"https://lifehacker.com/imagery/authors/01HHFDBG3H1VSXE5XSDZ06W91C/image.fill.size_150x150.v1706808034.jpg\" alt=\"Photo of David Nield\" />\n                                            </p>\n                </div>\n            <div>\n                <p>David Nield</p>\n                                <div>\n                                            <p>David Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. </p>\n                                    </div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/author/david-nield\">Read David's full bio</a>\n                            </p></div>\n        </div>\n                <div>\n                                            <div>\n    <p>More by David</p>\n        <hr />\n        </div>\n                        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/home/best-smart-tech-cool-heat-home\">\n                    <img src=\"https://lifehacker.com/imagery/articles/01K59Q1VPXAQSK010BFW6ASQZT/hero-image.fill.size_75x75.v1759157072.jpg\" alt=\"person using smart thermostat\" />\n                </a>\n            </p></div>\n        <hr />\n                    <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/tech/how-to-watch-pornhub-even-if-its-blocked-in-your-state\">\n                    <img src=\"https://lifehacker.com/imagery/articles/01JWXSQX0KG9KBKARRSGFA13YP/hero-image.fill.size_75x75.v1749051765.jpg\" alt=\"Pornhub goes dark\" />\n                </a>\n            </p></div>\n        <hr />\n                                        </div>\n            </div>\n                                </section>\n                                                </section>\n    </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All the Smart Gadgets You Need for a Self-Cleaning Home",
      "image": [
        "https://lifehacker.com/imagery/articles/01K57198V3E3FABSSYCRSRWCH6/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-09-30T12:30:00.000Z",
      "dateModified": "2025-09-30T12:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A Lifetime Subscription to Babbel Is on Sale for a Huge Discount Right Now",
    "url": "https://lifehacker.com/tech/babbel-stacksocial-sale-october-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K6FYVEMANX9P15WBZTTCNK4J/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-01T14:00:00.000Z",
    "description": "<div>\n        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                    <img src=\"https://lifehacker.com/images/",
    "body": "<div>\n        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                    <img src=\"https://lifehacker.com/images/lifehacker-logo.svg\" alt=\"Lifehacker Logo\" />\n                </a></p><p>Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                </p>\n                <div>\n                    <ul>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/our-mission\">Our Mission</a></li>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/our-team\">Our Team</a></li>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/newsletters\">Newsletter</a></li>\n                    </ul>\n                </div>\n            </div>\n        <div>\n                <p>© 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. <span>ALL RIGHTS RESERVED.</span></p>\n                <p>Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee <span>by that merchant.</span></p>\n            </div>\n    </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A Lifetime Subscription to Babbel Is on Sale for a Huge Discount Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01K6FYVEMANX9P15WBZTTCNK4J/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-01T14:00:00.000Z",
      "dateModified": "2025-10-01T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Get Windows 11 Pro on Sale for Just $10 Right Now",
    "url": "https://lifehacker.com/tech/windows-11-pro-stacksocial-sale-october-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K6NKW33K0TD03SAK3P0A2HHA/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-03T18:30:00.000Z",
    "description": "<div>\n        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                    <img src=\"https://lifehacker.com/images/",
    "body": "<div>\n        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                    <img src=\"https://lifehacker.com/images/lifehacker-logo.svg\" alt=\"Lifehacker Logo\" />\n                </a></p><p>Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                </p>\n                <div>\n                    <ul>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/our-mission\">Our Mission</a></li>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/our-team\">Our Team</a></li>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/newsletters\">Newsletter</a></li>\n                    </ul>\n                </div>\n            </div>\n        <div>\n                <p>© 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. <span>ALL RIGHTS RESERVED.</span></p>\n                <p>Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee <span>by that merchant.</span></p>\n            </div>\n    </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Get Windows 11 Pro on Sale for Just $10 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01K6NKW33K0TD03SAK3P0A2HHA/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-03T18:30:00.000Z",
      "dateModified": "2025-10-03T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Just Released an Important Update to Solve Some iOS 26 Problems",
    "url": "https://lifehacker.com/tech/apple-releases-update-for-ios-26?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K6AXWQYZDCFYV4394NF1WJM0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-09-29T17:30:25.000Z",
    "description": "<div>\n        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                    <img src=\"https://lifehacker.com/images/",
    "body": "<div>\n        <div>\n                <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                    <img src=\"https://lifehacker.com/images/lifehacker-logo.svg\" alt=\"Lifehacker Logo\" />\n                </a></p><p>Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                </p>\n                <div>\n                    <ul>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/our-mission\">Our Mission</a></li>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/our-team\">Our Team</a></li>\n                        <li><a target=\"_blank\" href=\"https://lifehacker.com/newsletters\">Newsletter</a></li>\n                    </ul>\n                </div>\n            </div>\n        <div>\n                <p>© 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. <span>ALL RIGHTS RESERVED.</span></p>\n                <p>Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee <span>by that merchant.</span></p>\n            </div>\n    </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Just Released an Important Update to Solve Some iOS 26 Problems",
      "image": [
        "https://lifehacker.com/imagery/articles/01K6AXWQYZDCFYV4394NF1WJM0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-09-29T17:30:25.000Z",
      "dateModified": "2025-09-29T17:30:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Mac's Preview App Is Finally Available on iPhone",
    "url": "https://lifehacker.com/tech/preview-app-on-ios-and-ipad?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K615PT7RFQFS5DD7577XEYBM/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-09-25T21:00:00.000Z",
    "description": "<div>\n            <div>\n        <div>\n    <div>\n        <ul>\n            <li>\n                <a href=\"https://bsky.app/intent/compose?text=https%3A%2",
    "body": "<div>\n            <div>\n        <div>\n    <div>\n        <ul>\n            <li>\n                <a href=\"https://bsky.app/intent/compose?text=https%3A%2F%2Flifehacker.com%2Ftech%2Fpreview-app-on-ios-and-ipad\" title=\"Share on Bluesky (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://reddit.com/submit?url=https%3A%2F%2Flifehacker.com%2Ftech%2Fpreview-app-on-ios-and-ipad&title=The+Mac%27s+Preview+App+Is+Finally+Available+on+iPhone\" title=\"Share on Reddit (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://www.facebook.com/sharer.php?u=https%3A%2F%2Flifehacker.com%2Ftech%2Fpreview-app-on-ios-and-ipad\" title=\"Share on Facebook (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://twitter.com/intent/tweet?url=https%3A%2F%2Flifehacker.com%2Ftech%2Fpreview-app-on-ios-and-ipad&text=The+Mac%27s+Preview+App+Is+Finally+Available+on+iPhone\" title=\"Share on Twitter (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://lifehacker.com/cdn-cgi/l/email-protection#3b04484e59515e584f066f535e1e090b765a581e090c481e090b6b495e4d525e4c1e090b7a4b4b1e090b72481e090b7d52555a5757421e090b7a4d5a52575a59575e1e090b54551e090b526b5354555e1d5a564b0059545f4206534f4f4b481e087a1e097d1e097d57525d5e535a58505e49155854561e097d4f5e58531e097d4b495e4d525e4c165a4b4b16545516525448165a555f16524b5a5f1e087d4e4f5664565e5f524e561e087f48535a495e5d49545648524f5e1e090d4e4f566448544e49585e1e087f57525d5e535a58505e49645e565a5257\" title=\"Send link by email (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <span>Copied</span>\n            </li>\n        </ul>\n    </div>\n            <p>The app is also available for iPad.</p>\n    </div>\n        <div>\n    <div>\n                                        <p>\n        <svg>\n        </svg>\n        September 25, 2025\n    </p></div>\n            <p><img src=\"https://lifehacker.com/imagery/articles/01K615PT7RFQFS5DD7577XEYBM/hero-image.fill.size_1248x702.v1758831826.jpg\" alt=\"iphone showing the Preview app\" srcset=\"https://lifehacker.com/imagery/articles/01K615PT7RFQFS5DD7577XEYBM/hero-image.fill.size_400x225.v1758831826.jpg 400w, https://lifehacker.com/imagery/articles/01K615PT7RFQFS5DD7577XEYBM/hero-image.fill.size_800x450.v1758831826.jpg 800w, https://lifehacker.com/imagery/articles/01K615PT7RFQFS5DD7577XEYBM/hero-image.fill.size_1248x702.v1758831826.jpg 1600w\" /></p><p><span>Credit: aileenchik/Shutterstock</span>\n                            </p>\n            <div>\n                <p><span>Key Takeaways</span></p><ol>\n                                            <li>With iOS and iPadOS 26, Apple finally brings the Preview app to the iPhone and iPad.</li>\n                                            <li>The app works similarly to how it does on Mac, with the option to scan, edit, markup, and export documents.</li>\n                                            <li>There is definitely room for improvement, however.</li>\n                                    </ol>\n            </div>\n    <h2 id=\"toc\">Table of Contents</h2>\n    <article>\n        <hr />\n        <p>Your iPhone is essentially a computer that fits in your pocket, so it only makes sense for Apple to treat it as such. To that point, with <a href=\"https://lifehacker.com/tech/the-best-five-ios-26-features\" target=\"_blank\">iOS 26</a>, both the iPhone and the iPad get a new app that was a Mac exclusive for over 20 years: Preview. </p><h2 id=\"what-can-you-do-with-the-preview-app\">What can you do with the Preview app?</h2><p>Like on macOS, the Preview app for iOS and iPadOS is largely made for viewing PDFs and other documents. When you first open the app, you'll see the options to either create a new document or scan one with your iPhone's camera. </p><p>Most of the time, however, you probably you have an existing document you want to open using Preview. If so, you'll find those options in the bottom half of this starting page. This is Preview's integration with the Files app: You can browse your documents from Files and open any with Preview.</p><div>\n        <p><img src=\"https://lifehacker.com/images/short-lifehacker-logo.jpg\" alt=\"Lifehacker Logo\" /></p><div>\n            <p><span>You May Also Like</span></p>\n        </div>\n    </div>\n<p>Once you have a document loaded up, you're able to view, annotate, markup, and edit it. If you need to fill out a document with your information, you can use AutoFill to automatically enter contact info and other saved details. You can add your signature, and if you're on your iPad, you can use your Apple Pencil to draw on the document. Otherwise, you can use your finger to mark up the file. </p><p>You can also export documents from the Preview app. You can work with file types including HEIDC, JPEG, PDF, PNG, and TIFF. And as with Preview on macOS, there are a number of controls when exporting, such as resolution, embedding text, and saving images as JPEG.</p><p>While there's a lot you can do here, the biggest strength I see for this mobile Preview app is using it as a tool for legal documents. If you need to sign an important document, you can quickly scan it into the app, add your signature, fill out any information—perhaps automatically with AutoFill—then email the doc out, all without needing to jump to your computer.</p><h2 id=\"preview-on-ios-is-still-a-work-in-progress\">Preview on iOS is still a work in progress</h2><p>If you look at <a href=\"https://apps.apple.com/us/app/preview/id536344167?platform=iphone\" target=\"_blank\" title=\"open in a new window\">Preview's App Store page</a>, you'll notice some mixed reviews. After using the app for a bit, I understand why. Preview for iOS is definitely still a work in progress and in need of some key upgrades.</p><div>\n            <p><span>\n                What do you think so far?\n            </span>\n        </p></div>\n<p>The biggest quirks I noticed immediately: The main menu page is cluttered, with the Files integration looking more like a glitch than a dedicated window. Speaking of Files, Apple made the decision to have documents in Files open in Preview. At first, that sounds like a good idea, until you experience it in person on both iOS and iPadOS. Being dragged out of the Files app when you're not expecting it is jarring, especially when you're used to viewing your docs directly in the app. </p><p>The workaround here is to avoid Files for opening, well, files. Use the Files integration within Preview, so you stay in the same app. How intuitive. You could also choose to delete the Preview app, but that's a bit of a shame when it's such a major update for iOS and iPadOS 26.</p><p>Also, when you choose the Markup option, there's no clear way to exit without closing the whole app first. As far as I can tell, the only way to do so is to tap the three-dots in the top right, then tap Markup to exit this menu. The Markup button should really stay on screen as it does on macOS, so it's obvious how to dismiss it.    </p>\n            </article>\n    </div>\n<div>\n    <div>\n        <p><span>The Download Newsletter</span>\n            <span>Never miss a tech story</span>\n        </p>\n        <p><img src=\"https://lifehacker.com/images/team/Jake.png\" alt=\"Jake Peterson portrait\" />\n            <span>Jake Peterson\n            </span>\n            <span>Senior tech editor</span>\n        </p>\n        <p><span>Get the latest tech news, <span></span>reviews, <span></span>and advice from Jake and the team.</span>\n    </p></div>\n    <div>\n        <p><span>The Download Newsletter</span>\n            <span><span>Never miss a tech story.</span> Get the latest tech news, <span></span>reviews, <span></span>and advice from Jake and the team.</span>\n        </p>\n    </div>\n</div>\n    </div>\n            <div>\n                <p><span>\n                        Keep Scrolling for Next Article\n                    </span>\n                </p>\n            </div>\n        </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Mac's Preview App Is Finally Available on iPhone",
      "image": [
        "https://lifehacker.com/imagery/articles/01K615PT7RFQFS5DD7577XEYBM/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-09-25T21:00:00.000Z",
      "dateModified": "2025-09-25T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Safari Is More Private Than Ever in iOS 26",
    "url": "https://lifehacker.com/tech/safari-privacy-updates-ios-26?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K63MN4S69SSPV6ZSWYZQ9MGJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-09-26T21:00:00.000Z",
    "description": "<div>\n            <div>\n        <div>\n    <div>\n        <ul>\n            <li>\n                <a href=\"https://bsky.app/intent/compose?text=https%3A%2",
    "body": "<div>\n            <div>\n        <div>\n    <div>\n        <ul>\n            <li>\n                <a href=\"https://bsky.app/intent/compose?text=https%3A%2F%2Flifehacker.com%2Ftech%2Fsafari-privacy-updates-ios-26\" title=\"Share on Bluesky (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://reddit.com/submit?url=https%3A%2F%2Flifehacker.com%2Ftech%2Fsafari-privacy-updates-ios-26&title=Safari+Is+More+Private+Than+Ever+in+iOS+26\" title=\"Share on Reddit (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://www.facebook.com/sharer.php?u=https%3A%2F%2Flifehacker.com%2Ftech%2Fsafari-privacy-updates-ios-26\" title=\"Share on Facebook (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://twitter.com/intent/tweet?url=https%3A%2F%2Flifehacker.com%2Ftech%2Fsafari-privacy-updates-ios-26&text=Safari+Is+More+Private+Than+Ever+in+iOS+26\" title=\"Share on Twitter (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://lifehacker.com/cdn-cgi/l/email-protection#043b7771666e6167703957656265766d2136344d77213634496b766121363454766d72657061213634506c656a213634417261762136346d6a2136346d4b572136343632226569743f666b607d396c70707477213745213642213642686d62616c65676f61762a676b692136427061676c21364277656265766d2974766d7265677d2971746065706177296d6b772936322137427170695b6961606d7169213740776c65766162766b69776d70612136327170695b776b71766761213740686d62616c65676f61765b6169656d68\" title=\"Send link by email (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <span>Copied</span>\n            </li>\n        </ul>\n    </div>\n            <p>That's also true for Safari on your Mac.</p>\n    </div>\n        <div>\n    <div>\n                                        <p>\n        <svg>\n        </svg>\n        September 26, 2025\n    </p></div>\n            <p><img src=\"https://lifehacker.com/imagery/articles/01K63MN4S69SSPV6ZSWYZQ9MGJ/hero-image.fill.size_1248x702.v1758914028.jpg\" alt=\"an iphone against a pink background showing safari in the bottom app bar\" srcset=\"https://lifehacker.com/imagery/articles/01K63MN4S69SSPV6ZSWYZQ9MGJ/hero-image.fill.size_400x225.v1758914028.jpg 400w, https://lifehacker.com/imagery/articles/01K63MN4S69SSPV6ZSWYZQ9MGJ/hero-image.fill.size_800x450.v1758914028.jpg 800w, https://lifehacker.com/imagery/articles/01K63MN4S69SSPV6ZSWYZQ9MGJ/hero-image.fill.size_1248x702.v1758914028.jpg 1600w\" /></p><p><span>Credit: PixieMe/Shutterstock</span>\n                            </p>\n            <div>\n                <p><span>Key Takeaways</span></p><ol>\n                                            <li>iOS 26 and macOS Tahoe offer advanced fingerprinting and tracking protection in Safari by default.</li>\n                                            <li>Previously, these protections were only enabled by default in Private Browsing, and the setting was quite buried.</li>\n                                            <li>\"Fingerprinting\" involves building a profile of you based on your data, so companies can, among other things, deliver you targeted ads.</li>\n                                    </ol>\n            </div>\n    <h2 id=\"toc\">Table of Contents</h2>\n    <article>\n        <hr />\n        <p><em>Did you know you can customize Google to filter out garbage? <a href=\"https://lifehacker.com/tech/you-can-now-tell-google-which-websites-you-prefer-search-results\" target=\"_blank\">Take these steps</a></em><em> for better search results, <a href=\"https://www.google.com/preferences/source?q=lifehacker.com\" target=\"_blank\" title=\"open in a new window\">including adding my work at Lifehacker as a preferred source</a></em><em>.</em></p><hr /><p>The internet isn't private, but that doesn't mean you have to willingly give up all of your information to use it. By default, trackers steal a <em>lot</em> of your data while you browse the web, but simple settings can block a lot of those trackers from functioning. As it turns out, <a href=\"https://lifehacker.com/tech/the-best-five-ios-26-features\" target=\"_blank\">by updating to iOS 26</a>, your iPhone gets an upgraded tool against tracking.</p><p>The feature, called Advanced Tracking and Fingerprinting Protection, is an option in Safari that hides certain browser and device data trackers typically use to build a <a href=\"https://www.cnet.com/tech/services-and-software/enable-this-ios-26-privacy-feature-to-make-it-harder-for-others-to-track-you/\" target=\"_blank\" title=\"open in a new window\">digital \"fingerprint\" of users</a>. In this case, a fingerprint is a profile companies use to track your movements across the web. Your fingerprint may be made up of data like your device's IP address, the device itself, your browser, fonts, plug-ins, as well as its screen resolution. All of these data points come together to build a unique picture of who you are; the more unique your fingerprint, <a href=\"https://lifehacker.com/tech/cover-your-tracks-see-whos-following-you-online\" target=\"_blank\">the easier it is to track you</a>, since the odds of someone else with your exact same details is slim. </p><div>\n        <p><img src=\"https://lifehacker.com/images/short-lifehacker-logo.jpg\" alt=\"Lifehacker Logo\" /></p><div>\n            <p><span>You May Also Like</span></p>\n        </div>\n    </div>\n<p>Fingerprinting has a number of applications across the web, but perhaps the largest is for targeted advertising. The reason many of the ads you see are so relevant to your interests and browsing history is because of fingerprinting. Trackers know your internet habits, and can identify and deliver the advertisements you're most likely to click or tap on. Companies can also sell these fingerprinting profiles to brokers and advertisers, making money on both your engagement with ads, as well as your raw data.  </p><p>Advanced Tracking and Fingerprinting Protection simplifies each Safari user's data, so our fingerprints aren't quite so unique. By doing so, it's harder for trackers to identify individuals, and, as such, makes it possible to browser the web more privately. </p><p>This feature was already a thing on iPhone before iOS 26. However, it was limited to Private Browsing by default. If you didn't do all your browsing in a private tab, you likely lost some of these privacy protections, unless you knew to manually change the setting to cover all browsing. The same goes for iPadOS and macOS as well. Most of us probably didn't change the setting, since it's quite buried in each OS' respective settings.</p><div>\n            <p><span>\n                What do you think so far?\n            </span>\n        </p></div>\n<p>Once you update your iPhone, iPad, or Mac to the latest OS, however, your browsing gets these added tracking protections by default. Whether you browse in a private or a normal window, trackers will have a difficult time identifying your device. </p><h2 id=\"how-to-check-your-advanced-tracking-and-fingerprinting-protection-settings\">How to check your Advanced Tracking and Fingerprinting Protection settings </h2><p>This setting should be enabled by default when you update your device. But if you want to make sure it's on, here's where to find it. On your iPhone or iPad, open <strong>Settings</strong>, then head to <strong>Apps > Safari > Advanced</strong>. On your Mac, open Safari, press Command + , to pull up Safari's settings, then choose the <strong>Advanced</strong> tab.</p><p>From here, ensure Advanced Tracking and Fingerprinting Protection is set to \"All Browsing\" (iOS/iPadOS) or \"in all browsing\" (macOS).</p>\n            </article>\n    </div>\n<div>\n    <div>\n        <p><span>The Download Newsletter</span>\n            <span>Never miss a tech story</span>\n        </p>\n        <p><img src=\"https://lifehacker.com/images/team/Jake.png\" alt=\"Jake Peterson portrait\" />\n            <span>Jake Peterson\n            </span>\n            <span>Senior tech editor</span>\n        </p>\n        <p><span>Get the latest tech news, <span></span>reviews, <span></span>and advice from Jake and the team.</span>\n    </p></div>\n    <div>\n        <p><span>The Download Newsletter</span>\n            <span><span>Never miss a tech story.</span> Get the latest tech news, <span></span>reviews, <span></span>and advice from Jake and the team.</span>\n        </p>\n    </div>\n</div>\n    </div>\n            <div>\n                <p><span>\n                        Keep Scrolling for Next Article\n                    </span>\n                </p>\n            </div>\n        </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Safari Is More Private Than Ever in iOS 26",
      "image": [
        "https://lifehacker.com/imagery/articles/01K63MN4S69SSPV6ZSWYZQ9MGJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-09-26T21:00:00.000Z",
      "dateModified": "2025-09-26T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What HRV Is, and Why Your Fitness Watch Measures It",
    "url": "https://lifehacker.com/health/what-hrv-heart-rate-variability?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K6K5FV8AQXB2DZZVQFBY26N4/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-02T19:30:00.000Z",
    "description": "<article>\n        <hr />\n        <p><em>Did you know you can customize Google to filter out garbage? <a href=\"https://lifehacker.com/tech/you-can-now-",
    "body": "<article>\n        <hr />\n        <p><em>Did you know you can customize Google to filter out garbage? <a href=\"https://lifehacker.com/tech/you-can-now-tell-google-which-websites-you-prefer-search-results\" target=\"_blank\">Take these steps</a></em><em> for better search results, <a href=\"https://www.google.com/preferences/source?q=lifehacker.com\" target=\"_blank\" title=\"open in a new window\">including adding my work at Lifehacker as a preferred source</a></em><em>.</em></p><hr /><p>Besides measuring heart rate and other metrics like steps, pretty much every fitness tracker and smartwatch measures heart rate variability, abbreviated as HRV. This measurement is the basis for recovery scores and stress readings, and you can usually find it as a standalone measurement in the “vitals” section of your chosen app. So let’s break down what this number actually measures, and how to interpret yours. </p><h2 id=\"hrv-is-heart-rate-variability\">HRV is heart rate variability</h2><p>HRV stands for heart rate variability, but that doesn’t mean what you might think. HRV is <em>not</em> related to your heart rate changing throughout the day or during exercise. (Your heart beats faster when you’re exercising hard, which is what <a href=\"https://lifehacker.com/what-are-heart-rate-zones-and-how-can-you-find-yours-1848061616\" target=\"_blank\"><u>heart rate zones</u></a> measure. Totally different purpose.) </p>\n<p>Heart rate variability refers to <em>how rhythmically</em> your heart beats. If the time from one beat to the next is always the same (at a given heart rate), you have low HRV. But if some heartbeats come more closely together, and some are more spaced out, you have high HRV. </p><p>This may be surprising, but you actually <em>want</em> your heart rate to show some variation. High HRV is considered to be better than low HRV. Your fitness app will say you’re well recovered if your HRV was higher than usual last night, and it will say you’re stressed or not recovering well if your HRV was low. </p><p>That said, it’s of course possible to have a heart rate that is <em>too</em> variable. In a sense, that’s what an arrhythmia is. When I’m talking about HRV here—and when fitness apps report your HRV—they’re considering the teeny tiny differences from beat to beat in an otherwise normal(ish) healthy(ish) person. </p><p>These differences are measured in milliseconds, and you wouldn’t notice them if you didn’t have a watch sampling data while you sleep. If you ever notice anything wildly strange about the rhythm of your heart, ask your doctor (or seek emergency medical help, if appropriate). </p><h2 id=\"what-does-a-high-hrv-mean\">What does a high HRV mean? </h2><p>High heart rate variability (that is, high <em>for you</em>) tends to mean that you’re relatively relaxed and not too stressed. Fitness apps will bump up your readiness and recovery scores when your HRV measured during sleep is high. </p><p>The variation in beats is thought to come from the push and pull of two different body systems, the sympathetic (“fight or flight”) and parasympathetic (“rest and digest”) nervous systems. It’s normal for your brain and body to be balancing these needs, so this is considered a good, normal functioning. </p><h2 id=\"what-does-a-low-hrv-mean\">What does a low HRV mean? </h2><p>Low HRV tends to occur when your body is working on something—recovering from hard exercise, fighting off a cold, experiencing lots of stress. If your HRV measured during sleep is low, you’ll get lower readiness or recovery scores. I find my HRV tanks when I’m sick or when I’ve been through a rough time either physically or mentally. (The day after a race or a weightlifting competition is always a low HRV day for me.) </p><div>\n            <p><span>\n                What do you think so far?\n            </span>\n        </p></div>\n<h2 id=\"what-is-a-good-hrv-number\">What is a “good” HRV number? </h2><p>I’ll give you some numbers in a minute, but the most important thing to know is that HRV is most useful when you compare readings to <em>what is normal for you</em>. Your HRV can be higher than mine, but still low for you, or vice versa. </p><p>So please don’t go around asking whether an HRV of 50 is “good.” Is it higher than usual <em>for you</em>? Then it’s good. Is it lower than usual for you? Then maybe it’s indicating that your body is under stress. If your typical HRV readings range from 35 to 50 (for example), then 50 is high for you. </p><p>It doesn’t matter whether the average person your age has a HRV of 20 or of 100; those numbers are just fun facts about the population in general. They don’t apply to you. Studies tend to show that fitter people have higher HRV, but also that HRV declines as we age. The average man’s HRV is slightly higher than the average woman’s, but the full range of what’s “normal” for each gender almost fully overlaps.</p><p>There’s one more important caveat: when you look up HRV data, you’ll find that different studies and different devices each measure HRV differently. For example, <a href=\"https://doctaris.com/wp-content/uploads/2020/11/A_Quantitative_Systematic_Review_of_Normal_Values_.pdf\" target=\"_blank\" title=\"open in a new window\"><u>this meta-analysis</u></a> found the average HRV was 42, with a range of 19 to 75, when measured as rMSSD (root mean square of successive differences). </p><p>So—and remember this is just for fun, here are some graphs from two wearable companies that publish their data <em>and</em> they both use rMSSD:</p><ul><li><p><a href=\"https://www.whoop.com/us/en/thelocker/normal-hrv-range-age-gender/\" target=\"_blank\" title=\"open in a new window\"><u>Whoop’s breakdown of HRV data from their users</u></a> finds men have an average of 40 and women 37. They have graphs breaking down how this changes with age, and showing the variation for each group. </p></li><li><p><a href=\"https://ouraring.com/blog/average-hrv/\" target=\"_blank\" title=\"open in a new window\"><u>Oura’s breakdown of HRV from their users</u></a> finds an average of 41 across all users, and they also graph it by age and gender. </p></li></ul><p>As I’ve found <a href=\"https://lifehacker.com/health/best-fitness-tracker-measure-hrv\" target=\"_blank\"><u>when comparing multiple devices on HRV</u></a>, devices don’t always report the same HRV numbers, but usually you can follow similar trends on all of them. If you’re sick, they’ll all report low HRV. If you have a good day, they’ll all report high HRV. So pay more attention to the trend than the specifics.</p>\n            </article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What HRV Is, and Why Your Fitness Watch Measures It",
      "image": [
        "https://lifehacker.com/imagery/articles/01K6K5FV8AQXB2DZZVQFBY26N4/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-02T19:30:00.000Z",
      "dateModified": "2025-10-02T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple's Newest iPhone Charger Is Pricey but Versatile",
    "url": "https://lifehacker.com/tech/apples-newest-iphone-charger-is-pretty-versatile?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K6NDHAR0AYQVGDZF0KTJ4MAS/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-03T17:00:41.000Z",
    "description": "<div>\n            <div>\n        <div>\n    <div>\n        <ul>\n            <li>\n                <a href=\"https://bsky.app/intent/compose?text=https%3A%2",
    "body": "<div>\n            <div>\n        <div>\n    <div>\n        <ul>\n            <li>\n                <a href=\"https://bsky.app/intent/compose?text=https%3A%2F%2Flifehacker.com%2Ftech%2Fapples-newest-iphone-charger-is-pretty-versatile\" title=\"Share on Bluesky (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://reddit.com/submit?url=https%3A%2F%2Flifehacker.com%2Ftech%2Fapples-newest-iphone-charger-is-pretty-versatile&title=Apple%27s+Newest+iPhone+Charger+Is+Pricey+but+Versatile\" title=\"Share on Reddit (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://www.facebook.com/sharer.php?u=https%3A%2F%2Flifehacker.com%2Ftech%2Fapples-newest-iphone-charger-is-pretty-versatile\" title=\"Share on Facebook (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://twitter.com/intent/tweet?url=https%3A%2F%2Flifehacker.com%2Ftech%2Fapples-newest-iphone-charger-is-pretty-versatile&text=Apple%27s+Newest+iPhone+Charger+Is+Pricey+but+Versatile\" title=\"Share on Twitter (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://lifehacker.com/cdn-cgi/l/email-protection#dae5a9afb8b0bfb9aee79baaaab6bfffe8eda9ffe8ea94bfadbfa9aeffe8eab38ab2b5b4bfffe8ea99b2bba8bdbfa8ffe8ea93a9ffe8ea8aa8b3b9bfa3ffe8eab8afaeffe8ea8cbfa8a9bbaeb3b6bffcbbb7aae1b8b5bea3e7b2aeaeaaa9ffe99bffe89cffe89cb6b3bcbfb2bbb9b1bfa8f4b9b5b7ffe89caebfb9b2ffe89cbbaaaab6bfa9f7b4bfadbfa9aef7b3aab2b5b4bff7b9b2bba8bdbfa8f7b3a9f7aaa8bfaeaea3f7acbfa8a9bbaeb3b6bfffe99cafaeb785b7bfbeb3afb7ffe99ea9b2bba8bfbca8b5b7a9b3aebfffe8ecafaeb785a9b5afa8b9bfffe99eb6b3bcbfb2bbb9b1bfa885bfb7bbb3b6\" title=\"Send link by email (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <span>Copied</span>\n            </li>\n        </ul>\n    </div>\n            <p>This might be the only power adapter you need.</p>\n    </div>\n        <div>\n    <div>\n                                        <p>\n        <svg>\n        </svg>\n        October 3, 2025\n    </p></div>\n    <p><span>We may earn a commission from links on this page.</span>\n    </p>\n            <p><img src=\"https://lifehacker.com/imagery/articles/01K6NDHAR0AYQVGDZF0KTJ4MAS/hero-image.fill.size_1248x702.v1759510862.jpg\" alt=\"a usb-c cable connecting to iphone\" srcset=\"https://lifehacker.com/imagery/articles/01K6NDHAR0AYQVGDZF0KTJ4MAS/hero-image.fill.size_400x225.v1759510862.jpg 400w, https://lifehacker.com/imagery/articles/01K6NDHAR0AYQVGDZF0KTJ4MAS/hero-image.fill.size_800x450.v1759510862.jpg 800w, https://lifehacker.com/imagery/articles/01K6NDHAR0AYQVGDZF0KTJ4MAS/hero-image.fill.size_1248x702.v1759510862.jpg 1600w\" /></p><p><span>Credit: Yalcin Sonat/Shutterstock</span>\n                            </p>\n            <div>\n                <p><span>Key Takeaways</span></p><ol>\n                                            <li>Apple's newest iPhone power adapter is pretty expensive, but for a reason.</li>\n                                            <li>It's a dynamic power adapter, which means it can deliver an extra 20W of power for a short period of time.</li>\n                                            <li>This lets you charge an iPhone at top speed, while giving more power to a larger device, like a MacBook, when needed.</li>\n                                    </ol>\n            </div>\n    <h2 id=\"toc\">Table of Contents</h2>\n    <article>\n        <hr />\n        <p><em>Did you know you can customize Google to filter out garbage? <a href=\"https://lifehacker.com/tech/you-can-now-tell-google-which-websites-you-prefer-search-results\" target=\"_blank\">Take these steps</a></em><em> for better search results, <a href=\"https://www.google.com/preferences/source?q=lifehacker.com\" target=\"_blank\" title=\"open in a new window\">including adding my work at Lifehacker as a preferred source</a></em><em>.</em></p><hr /><p>When you're looking to top off your iPhone's battery, you might not think much about the actual plug you're using. The thing is, it actually matters quite a bit, especially if you care about charging speeds. But even knowing that, you might take a look at <a href=\"https://zdcs.link/zJrY5p?pageview_type=Standard&template=News&module=content_body&element=offer&item=text-link&element_label=Apple%27s%20newest%20power%20adapter&short_url=zJrY5p&u=https%3A%2F%2Flifehacker.com%2Ftech%2Fapples-newest-iphone-charger-is-pretty-versatile&event_label=Apple%27s%20newest%20power%20adapter\" target=\"_blank\" title=\"open in a new window\">Apple's newest power adapter</a> and think \"$40? Without a <em>cable</em>? No way.\" </p><p>It's certainly a steep price for a power adapter, especially as you can find other options for <a href=\"https://zdcs.link/aeKLgw?pageview_type=Standard&template=News&module=content_body&element=offer&item=text-link&element_label=literally%20half%20the%20price&short_url=aeKLgw&u=https%3A%2F%2Flifehacker.com%2Ftech%2Fapples-newest-iphone-charger-is-pretty-versatile&event_label=literally%20half%20the%20price\" target=\"_blank\" title=\"open in a new window\">literally half the price</a>. But there's something interesting about this particular charger. It might not necessarily be <em>worth</em> $40, but there's a reason it's not cheap: This thing might be the only power adapter you need in your tech tool box.</p><div>\n        <p><img src=\"https://lifehacker.com/images/short-lifehacker-logo.jpg\" alt=\"Lifehacker Logo\" /></p><div>\n            <p><span>You May Also Like</span></p>\n        </div>\n    </div>\n<h2 id=\"dynamic-power-output\">Dynamic power output</h2><p>As you can see from the product listing, Apple's power adapter is advertised as a 40W charger. However, it is <em>also</em> advertised as being able to deliver up to 60W. You don't typically see that from a power adapter, as the wattage you see is the wattage you usually get. </p><p><a href=\"https://www.cnet.com/tech/mobile/heres-what-makes-apples-new-40-watt-power-adapter-unique/\" target=\"_blank\" title=\"open in a new window\">As CNET's Bridget Carey explains</a>, this is made possible through some clever engineering. The power adapter will start by offering the maximum charging output your device in question can take in, up to 60W. iPhones can't accept 60W of charging, for example, but MacBooks can: So this 40W power adapter can actually deliver 60W of power when connected to something like your MacBook—at first. Since the power adapter isn't actually a true 60W charger, it can't sustain that power output for long periods of time. As such, it pulls back the power draw over time. </p><div>\n            <p><span>\n                What do you think so far?\n            </span>\n        </p></div>\n<p>In practical terms, it means you can get an initial 60W charge on a device that can accept it, which can help charge your larger devices faster at the start. Rather than bring a power adapter for your iPhone, and a larger one for your MacBook, or tote a huge power adapter for both, you get a compact power adapter that can offer the best of both worlds.</p><p>There's also a reason Apple chose 40W for this power adapter's \"standard\" output. The new iPhone 17 series <a href=\"https://lifehacker.com/tech/why-i-will-probably-upgrade-to-base-iphone-17\" target=\"_blank\">has the quickest charging speeds of any iPhone device so far</a>, charging up to 50% in just 20 minutes. (The exception is the iPhone 17 Air, which can charge to 50% in 30 minutes.) However, you need the right power adapter to take advantage of these charging speeds—at least 40W. (Again, the iPhone 17 Air is the exception, as it can charge to 50% in 30 minutes with 20W or higher.)</p><p>That's really the perk of this dynamic power adapter. It's powerful enough to offer the fastest charging speeds for your iPhone 17, while also offering a power boost to give something like a MacBook a faster charge, at least for a little while. That being said, there are plenty of power adapter options out there, <a href=\"https://zdcs.link/QGrYwE?pageview_type=Standard&template=News&module=content_body&element=offer&item=text-link&element_label=including%20ones%20that%20offer%20outputs%20in%20the%2060W%20range&short_url=QGrYwE&u=https%3A%2F%2Flifehacker.com%2Ftech%2Fapples-newest-iphone-charger-is-pretty-versatile&event_label=including%20ones%20that%20offer%20outputs%20in%20the%2060W%20range\" target=\"_blank\" title=\"open in a new window\">including ones that offer outputs in the 60W range</a>. No matter what power adapter you end up going with, just keep two things in mind: the maximum power output of the adapter itself, but also your charging cable. If your cable can't support the wattage, it doesn't matter how large the adapter is.</p>\n            </article>\n    </div>\n<div>\n    <div>\n        <p><span>The Download Newsletter</span>\n            <span>Never miss a tech story</span>\n        </p>\n        <p><img src=\"https://lifehacker.com/images/team/Jake.png\" alt=\"Jake Peterson portrait\" />\n            <span>Jake Peterson\n            </span>\n            <span>Senior tech editor</span>\n        </p>\n        <p><span>Get the latest tech news, <span></span>reviews, <span></span>and advice from Jake and the team.</span>\n    </p></div>\n    <div>\n        <p><span>The Download Newsletter</span>\n            <span><span>Never miss a tech story.</span> Get the latest tech news, <span></span>reviews, <span></span>and advice from Jake and the team.</span>\n        </p>\n    </div>\n</div>\n    </div>\n            <div>\n                <p><span>\n                        Keep Scrolling for Next Article\n                    </span>\n                </p>\n            </div>\n        </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple's Newest iPhone Charger Is Pricey but Versatile",
      "image": [
        "https://lifehacker.com/imagery/articles/01K6NDHAR0AYQVGDZF0KTJ4MAS/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-03T17:00:41.000Z",
      "dateModified": "2025-10-03T17:00:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Perplexity's AI Browser Is Now Available for Free for Everyone",
    "url": "https://lifehacker.com/tech/perplexitys-ai-comet-browser-free?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K6N6NT5BA2Z879ZAXQS7JZJD/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-03T15:30:00.000Z",
    "description": "<div>\n            <div>\n        <div>\n    <div>\n        <ul>\n            <li>\n                <a href=\"https://bsky.app/intent/compose?text=https%3A%2",
    "body": "<div>\n            <div>\n        <div>\n    <div>\n        <ul>\n            <li>\n                <a href=\"https://bsky.app/intent/compose?text=https%3A%2F%2Flifehacker.com%2Ftech%2Fperplexitys-ai-comet-browser-free\" title=\"Share on Bluesky (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://reddit.com/submit?url=https%3A%2F%2Flifehacker.com%2Ftech%2Fperplexitys-ai-comet-browser-free&title=Perplexity%27s+AI+Browser+Is+Now+Available+for+Free+for+Everyone\" title=\"Share on Reddit (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://www.facebook.com/sharer.php?u=https%3A%2F%2Flifehacker.com%2Ftech%2Fperplexitys-ai-comet-browser-free\" title=\"Share on Facebook (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://twitter.com/intent/tweet?url=https%3A%2F%2Flifehacker.com%2Ftech%2Fperplexitys-ai-comet-browser-free&text=Perplexity%27s+AI+Browser+Is+Now+Available+for+Free+for+Everyone\" title=\"Share on Twitter (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://lifehacker.com/cdn-cgi/l/email-protection#ae91dddbccc4cbcdda93fecbdcdec2cbd6c7dad78b9c99dd8b9c9eefe78b9c9eecdcc1d9ddcbdc8b9c9ee7dd8b9c9ee0c1d98b9c9eefd8cfc7c2cfccc2cb8b9c9ec8c1dc8b9c9ee8dccbcb8b9c9ec8c1dc8b9c9eebd8cbdcd7c1c0cb88cfc3de95ccc1cad793c6dadadedd8b9def8b9ce88b9ce8c2c7c8cbc6cfcdc5cbdc80cdc1c38b9ce8dacbcdc68b9ce8decbdcdec2cbd6c7dad7dd83cfc783cdc1c3cbda83ccdcc1d9ddcbdc83c8dccbcb8b9de8dbdac3f1c3cbcac7dbc38b9deaddc6cfdccbc8dcc1c3ddc7dacb8b9c98dbdac3f1ddc1dbdccdcb8b9deac2c7c8cbc6cfcdc5cbdcf1cbc3cfc7c2\" title=\"Send link by email (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <span>Copied</span>\n            </li>\n        </ul>\n    </div>\n            <p>You can try out Perplexity's much-hyped Comet browser—for free.</p>\n    </div>\n        <div>\n    <div>\n                                        <p>\n        <svg>\n        </svg>\n        October 3, 2025\n    </p></div>\n            <p><img src=\"https://lifehacker.com/imagery/articles/01K6N6NT5BA2Z879ZAXQS7JZJD/hero-image.fill.size_1248x702.v1759504199.jpg\" alt=\"comet web browser\" srcset=\"https://lifehacker.com/imagery/articles/01K6N6NT5BA2Z879ZAXQS7JZJD/hero-image.fill.size_400x225.v1759504199.jpg 400w, https://lifehacker.com/imagery/articles/01K6N6NT5BA2Z879ZAXQS7JZJD/hero-image.fill.size_800x450.v1759504199.jpg 800w, https://lifehacker.com/imagery/articles/01K6N6NT5BA2Z879ZAXQS7JZJD/hero-image.fill.size_1248x702.v1759504199.jpg 1600w\" /></p><p><span>Credit: Lifehacker</span>\n                            </p>\n            <div>\n                <p><span>Key Takeaways</span></p><ol>\n                                            <li>Comet, Perplexity's AI web browser, is now available to everyone for free for the first time.</li>\n                                            <li>The browser is easy to download, install, and set up, and does not require a Perplexity subscription or account.</li>\n                                            <li>The big feature here is the browser's agentic AI, which can do things on the internet on your behalf.</li>\n                                    </ol>\n            </div>\n    <h2 id=\"toc\">Table of Contents</h2>\n    <article>\n        <hr />\n        <p><em>Did you know you can customize Google to filter out garbage? <a href=\"https://lifehacker.com/tech/you-can-now-tell-google-which-websites-you-prefer-search-results\" target=\"_blank\">Take these steps</a></em><em> for better search results, <a href=\"https://www.google.com/preferences/source?q=lifehacker.com\" target=\"_blank\" title=\"open in a new window\">including adding my work at Lifehacker as a preferred source</a></em><em>.</em></p><hr /><p>Much has been said about Comet, Perplexity's web browser, not just because of its AI features, <a href=\"https://lifehacker.com/tech/try-comet-browser-free\" target=\"_blank\">but also because of its paywall</a>. Early access was initially reserved to a waitlist of Perplexity Max users, a subscription that costs $200 per <em>month</em>, before Perplexity opened up access to Perplexity Pro users, who only need to pay $20 per month. Still, seeing as most web browsers are free to use, I imagine most people still shied away from trying Comet because of the price.</p><p>If that sounds like you, there's good news. On Friday, Perplexity made Comet available to anyone who wants to try it for free. You don't need to subscribe to any Perplexity plan, nor do you even need a Perplexity account—though the company has some features tied to those who sign in. Comet is built on Chromium, so if you're coming from Chrome, or another Chromium browser like Edge, you'll be able to jump right in. </p><div>\n        <p><img src=\"https://lifehacker.com/images/short-lifehacker-logo.jpg\" alt=\"Lifehacker Logo\" /></p><div>\n            <p><span>You May Also Like</span></p>\n        </div>\n    </div>\n<p>Installing Comet is as easy as any other web browser: <a href=\"https://www.perplexity.ai/\" target=\"_blank\" title=\"open in a new window\">just head to Perplexity's website</a>, and choose \"Download Comet.\" Even setting up the browser feels familiar, as you can import another Chrome profile, choose a profile pic, and set a name. But of course, the real advertised advantage here is the AI assistant. Like other AI-powered browsers, Comet has a built-in chatbot you can talk to about whatever it is you want—particularly the web pages you happen to be browsing. But Comet's AI is agentic, which means you can ask the AI to do things for you. </p><p>If you ask it to take you to a specific website, it will (though I'm not sure that's any faster than simply typing in the site by hand). If you ask it to open a specific link on the page, you can see the bot take over the page, and choose the URL you asked for. For example, I asked the assistant to open Lifehacker, then asked it to click on our article \"<a href=\"https://lifehacker.com/tech/how-to-browse-the-dark-web\" target=\"_blank\">How to Browse the Dark Web</a>.\" It did both of these things, and even offered a summary of the dark web piece.  </p><div>\n            <p><span>\n                What do you think so far?\n            </span>\n        </p></div>\n<p>But Perplexity says you can also request more complex tasks: According to the company, the assistant can draft emails on your behalf, build websites, make purchases, create citations, add to your calendar. There's even a voice mode, as with other AI bots like <a href=\"https://lifehacker.com/tech/chatgpt-advanced-voice-mode-is-out-now\" target=\"_blank\">ChatGPT</a> or <a href=\"https://lifehacker.com/tech/gemini-live-is-now-available-to-all-android-users-for-free\" target=\"_blank\">Gemini</a>, so you can talk to the browser if you want to. </p><p>I'm still not sold on the idea that injecting agentic AI into my web browser is what I need to better experience the internet. Maybe I need to spend some time with Comet to experience that \"future.\" But seeing <a href=\"https://www.google.com/search?q=ai+hallucination+lifehacker&udm=14\" target=\"_blank\" title=\"open in a new window\">how often the tech still makes mistakes</a>—<a href=\"https://lifehacker.com/tech/prompt-injection-attacks-ai-browsers\" target=\"_blank\">not the mention the untapped security risks</a>—I'm not sure I want to hand off all of my browsing tasks to AI just yet. Still, if you're interested, you can give it a go without spending a dime.</p>\n            </article>\n    </div>\n<div>\n    <div>\n        <p><span>The Download Newsletter</span>\n            <span>Never miss a tech story</span>\n        </p>\n        <p><img src=\"https://lifehacker.com/images/team/Jake.png\" alt=\"Jake Peterson portrait\" />\n            <span>Jake Peterson\n            </span>\n            <span>Senior tech editor</span>\n        </p>\n        <p><span>Get the latest tech news, <span></span>reviews, <span></span>and advice from Jake and the team.</span>\n    </p></div>\n    <div>\n        <p><span>The Download Newsletter</span>\n            <span><span>Never miss a tech story.</span> Get the latest tech news, <span></span>reviews, <span></span>and advice from Jake and the team.</span>\n        </p>\n    </div>\n</div>\n    </div>\n            <div>\n                <p><span>\n                        Keep Scrolling for Next Article\n                    </span>\n                </p>\n            </div>\n        </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Perplexity's AI Browser Is Now Available for Free for Everyone",
      "image": [
        "https://lifehacker.com/imagery/articles/01K6N6NT5BA2Z879ZAXQS7JZJD/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-03T15:30:00.000Z",
      "dateModified": "2025-10-03T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here's Why AirPods Pro 3 Are 'Unrepairable'",
    "url": "https://lifehacker.com/tech/airpods-pro-3-are-unrepairable?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K6JZNV916CE6V1DQ50RPQM0K/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-02T18:30:00.000Z",
    "description": "<div>\n    <div>\n        <div>\n            <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                <img src=\"https://lifehacker.com/image",
    "body": "<div>\n    <div>\n        <div>\n            <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                <img src=\"https://lifehacker.com/images/lifehacker-logo.svg\" alt=\"Lifehacker Logo\" />\n            </a></p><div>\n                <ul>\n                    <li>\n                        <a href=\"https://bsky.app/profile/lifehacker.com\" target=\"_blank\">\n                            <svg>\n                            </svg>\n                            <span>View our Bluesky Page (Opens in a new tab)</span>\n                        </a>\n                    </li>\n                    <li>\n                        <a href=\"https://instagram.com/lifehackerdotcom\" target=\"_blank\">\n                            <svg>\n                            </svg>\n                            <span>View our Instagram Page (Opens in a new tab)</span>\n                        </a>\n                    </li>\n                    <li>\n                        <a href=\"https://facebook.com/lifehacker\" target=\"_blank\">\n                            <svg>\n                            </svg>\n                            <span>View on Facebook Page (Opens in a new tab)</span>\n                        </a>\n                    </li>\n                    <li>\n                        <a href=\"https://www.youtube.com/user/lifehacker\" target=\"_blank\">\n                            <svg>\n                            </svg>\n                            <span>View our Youtube Page (Opens in a new tab)</span>\n                        </a>\n                    </li>\n                    <li>\n                        <a href=\"https://twitter.com/lifehacker\" target=\"_blank\">\n                            <svg>\n                            </svg>\n                            <span>View our Twitter Page (Opens in a new tab)</span>\n                        </a>\n                    </li>\n                </ul>\n                <a target=\"_blank\" href=\"https://lifehacker.com/newsletters\">\n                    <svg>\n                    </svg>\n                </a>\n                </div>\n        </div>\n            <ul>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/latest\">Latest</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/tech\">Tech</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/best-picks\">Best Picks</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/entertainment\">Entertainment</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/health\">Health</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/reviews\">Reviews</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/home\">Home & Garden</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/deals\">Deals</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/comparisons\">Comparisons</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/hacks\">Hacks</a></li>\n                                    <li><a target=\"_blank\" href=\"https://lifehacker.com/money/best-deals-live-blog\">#Deals Live Blog: The Best Sales We’ve Found, All in One Place</a></li>\n            </ul>\n    </div>\n            <div>\n            <div>\n        <div>\n    <div>\n        <ul>\n            <li>\n                <a href=\"https://bsky.app/intent/compose?text=https%3A%2F%2Flifehacker.com%2Ftech%2Fairpods-pro-3-are-unrepairable\" title=\"Share on Bluesky (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://reddit.com/submit?url=https%3A%2F%2Flifehacker.com%2Ftech%2Fairpods-pro-3-are-unrepairable&title=Here%27s+Why+AirPods+Pro+3+Are+%27Unrepairable%27\" title=\"Share on Reddit (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://www.facebook.com/sharer.php?u=https%3A%2F%2Flifehacker.com%2Ftech%2Fairpods-pro-3-are-unrepairable\" title=\"Share on Facebook (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://twitter.com/intent/tweet?url=https%3A%2F%2Flifehacker.com%2Ftech%2Fairpods-pro-3-are-unrepairable&text=Here%27s+Why+AirPods+Pro+3+Are+%27Unrepairable%27\" title=\"Share on Twitter (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://lifehacker.com/cdn-cgi/l/email-protection#dce3afa9beb6b9bfa8e194b9aeb9f9eeebaff9eeec8bb4a5f9eeec9db5ae8cb3b8aff9eeec8caeb3f9eeeceff9eeec9daeb9f9eeecf9eeeb89b2aeb9acbdb5aebdbeb0b9f9eeebfabdb1ace7beb3b8a5e1b4a8a8acaff9ef9df9ee9af9ee9ab0b5bab9b4bdbfb7b9aef2bfb3b1f9ee9aa8b9bfb4f9ee9abdb5aeacb3b8aff1acaeb3f1eff1bdaeb9f1a9b2aeb9acbdb5aebdbeb0b9f9ef9aa9a8b183b1b9b8b5a9b1f9ef98afb4bdaeb9baaeb3b1afb5a8b9f9eeeaa9a8b183afb3a9aebfb9f9ef98b0b5bab9b4bdbfb7b9ae83b9b1bdb5b0\" title=\"Send link by email (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <span>Copied</span>\n            </li>\n        </ul>\n    </div>\n            <p>If you open up your AirPods, you're almost guaranteed to break them.</p>\n    </div>\n        <div>\n    <div>\n                                        <p>\n        <svg>\n        </svg>\n        October 2, 2025\n    </p></div>\n            <p><img src=\"https://lifehacker.com/imagery/articles/01K6JZNV916CE6V1DQ50RPQM0K/hero-image.fill.size_1248x702.v1759428570.jpg\" alt=\"airpods pro 3 being \"repaired\"\" srcset=\"https://lifehacker.com/imagery/articles/01K6JZNV916CE6V1DQ50RPQM0K/hero-image.fill.size_400x225.v1759428570.jpg 400w, https://lifehacker.com/imagery/articles/01K6JZNV916CE6V1DQ50RPQM0K/hero-image.fill.size_800x450.v1759428570.jpg 800w, https://lifehacker.com/imagery/articles/01K6JZNV916CE6V1DQ50RPQM0K/hero-image.fill.size_1248x702.v1759428570.jpg 1600w\" /></p><p><span>Credit: iFixit/YouTube</span>\n                            </p>\n            <div>\n                <p><span>Key Takeaways</span></p><ol>\n                                            <li>iFixit has declared Apple's AirPods Pro 3 \"unrepairable.\"</li>\n                                            <li>Apple's design makes it far too difficult to open and repair the AirPods without risking permanent damage.</li>\n                                            <li>All of Apple's AirPods earbuds have had the same problems, earning all models a zero out of 10 from iFixit.</li>\n                                            <li>There are earbuds out there that are repairable, such as options from Fairphone, Samsung, and Sony.</li>\n                                    </ol>\n            </div>\n    <h2 id=\"toc\">Table of Contents</h2>\n    <article>\n        <hr />\n        <p><em>Did you know you can customize Google to filter out garbage? <a href=\"https://lifehacker.com/tech/you-can-now-tell-google-which-websites-you-prefer-search-results\" target=\"_blank\">Take these steps</a></em><em> for better search results, <a href=\"https://www.google.com/preferences/source?q=lifehacker.com\" target=\"_blank\" title=\"open in a new window\">including adding my work at Lifehacker as a preferred source</a></em><em>.</em></p><hr /><p>If you're in the Apple ecosystem, there are few earbuds out there better suited for your devices than AirPods. AirPods sync between all your Apple devices, sound great, and ship with features like <a href=\"https://lifehacker.com/tech/you-dont-need-to-buy-airpods-pro-3-to-use-live-translation\" target=\"_blank\">Live Translate</a> and even a heart rate monitor. The problem comes, however, if something happens to your buds—especially when your battery starts to lose its capacity to hold a charge. Unlike your iPhone, whose battery is easily replaceable, AirPods aren't simple to repair. As it happens, they might not be repairable at all.  </p><p>It seems that hasn't changed with Apple's latest earbuds, the <a href=\"https://lifehacker.com/tech/airpods-pro-3-are-more-forgiving-for-the-tine-eared\" target=\"_blank\">AirPods Pro 3</a>. iFixit put the newest AirPods Pro through a teardown test to see how repairable they might be. The result? A whopping zero out of 10: totally unrepairable. </p><div>\n        <p><img src=\"https://lifehacker.com/images/short-lifehacker-logo.jpg\" alt=\"Lifehacker Logo\" /></p><div>\n            <p><span>You May Also Like</span></p>\n        </div>\n    </div>\n<h2 id=\"airpods-pro-3-cant-be-fixed\">AirPods Pro 3 can't be fixed</h2><p>There are a number of issues in the AirPods Pro 3's design that lead to iFixit's declaration here. Chief among them is that Apple chooses to seal the entire casing with strong glue. In order to open up the buds, you need to heat them to loosen that glue, then pry the buds open with sharp tools. You need to both avoid melting the plastic of the earbuds themselves, while also trying hard not to disfigure the case while slicing it open. It's a tough balancing act. </p><p>Once inside, however, the trouble only continues. The battery is also held down with strong glue, so, once again, you need to apply heat without melting the earbud itself. Even if you successfully remove the battery, it's extremely difficult to reassemble all of the elements here—or to, god forbid, attempt to <em>replace</em> one of those elements should they break. Apple has designed these earbuds to pack a ton of tech into a <em>tiny</em> package, with both glue and soldering, which means you run the risk of destroying crucial components when moving them around. It's all too easy to accidentally ruin the microphones or noise cancelling tech here.</p><p>The same goes for the stem of the buds, and even the AirPods Pro 3 case: Both are all glued up, and are too easy to destroy while attempting to open or fix a component. In fact, iFixit says these \"repairs\" are so difficult, many repair shops don't even bother. Between the need for special tools and the risk for failure, they simply forgo AirPods repair attempts.</p><p>This nothing new for AirPods. According to iFixit, all of Apple's previous Bluetooth earbuds have the same problem. As it happens, all AirPods models—save for the AirPods Max—have achieved a zero out of 10 on iFixit's scale. </p><div>\n            <p><span>\n                What do you think so far?\n            </span>\n        </p></div>\n<h2 id=\"are-there-repairable-earbuds\">Are there repairable earbuds?</h2><p>While many other earbud brands score better on the repairability scale, <a href=\"https://www.ifixit.com/repairability/wireless-earbud-repairability-scores\" target=\"_blank\" title=\"open in a new window\">many also don't fare much<em> </em>better</a> than AirPods. Scroll through iFixit's list, and you'll find other scores ranging from zero to three out of 10. It seems a lot of companies follow Apple's lead here and solder their batteries and components together with glue. </p><p>Still, there are some winners here, according to iFixit. The undeniable champ comes are the Fairphone Fairbuds, which scored a perfect 10 out of 10. The batteries in the earbuds are easy to replace, the case is modular and easy to disassemble, and Fairphone offers replacement parts and instructions. Samsung's Galaxy Buds Live are the runner-up with an eight out of 10: They're similarly repairable to the Fairbuds, but they don't have official repair instructions or parts, other than the batteries for the earbuds. Sony's WF-1000XM4 scored a respectable seven out of 10, as they also have easy to replace batteries with a modular case—though they don't include official parts or instructions.  </p><p>If your primary goal when buying earbuds is repairability, you do have options out there. If you want the best possible experience when using your Apple devices, AirPods are still where it's at. Just know that when something fails, such as the battery or another component, your Apple earbuds are kind of toast. </p>\n            </article>\n    </div>\n<div>\n    <div>\n        <p><span>The Download Newsletter</span>\n            <span>Never miss a tech story</span>\n        </p>\n        <p><img src=\"https://lifehacker.com/images/team/Jake.png\" alt=\"Jake Peterson portrait\" />\n            <span>Jake Peterson\n            </span>\n            <span>Senior tech editor</span>\n        </p>\n        <p><span>Get the latest tech news, <span></span>reviews, <span></span>and advice from Jake and the team.</span>\n    </p></div>\n    <div>\n        <p><span>The Download Newsletter</span>\n            <span><span>Never miss a tech story.</span> Get the latest tech news, <span></span>reviews, <span></span>and advice from Jake and the team.</span>\n        </p>\n    </div>\n</div>\n    </div>\n            <div>\n                <p><span>\n                        Keep Scrolling for Next Article\n                    </span>\n                </p>\n            </div>\n        </div>\n    </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's Why AirPods Pro 3 Are 'Unrepairable'",
      "image": [
        "https://lifehacker.com/imagery/articles/01K6JZNV916CE6V1DQ50RPQM0K/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-02T18:30:00.000Z",
      "dateModified": "2025-10-02T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The KWL Method Will Help You Remember What You Study",
    "url": "https://lifehacker.com/kwl-study-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2H3HH54QN4EWSY12ZPWC8V/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-09-30T14:00:00.000Z",
    "description": "<div>\n    <div>\n        <div>\n            <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                <img src=\"https://lifehacker.com/image",
    "body": "<div>\n    <div>\n        <div>\n            <p><a target=\"_blank\" href=\"https://lifehacker.com/\">\n                <img src=\"https://lifehacker.com/images/lifehacker-logo.svg\" alt=\"Lifehacker Logo\" />\n            </a></p><div>\n                <ul>\n                    <li>\n                        <a href=\"https://bsky.app/profile/lifehacker.com\" target=\"_blank\">\n                            <svg>\n                            </svg>\n                            <span>View our Bluesky Page (Opens in a new tab)</span>\n                        </a>\n                    </li>\n                    <li>\n                        <a href=\"https://instagram.com/lifehackerdotcom\" target=\"_blank\">\n                            <svg>\n                            </svg>\n                            <span>View our Instagram Page (Opens in a new tab)</span>\n                        </a>\n                    </li>\n                    <li>\n                        <a href=\"https://facebook.com/lifehacker\" target=\"_blank\">\n                            <svg>\n                            </svg>\n                            <span>View on Facebook Page (Opens in a new tab)</span>\n                        </a>\n                    </li>\n                    <li>\n                        <a href=\"https://www.youtube.com/user/lifehacker\" target=\"_blank\">\n                            <svg>\n                            </svg>\n                            <span>View our Youtube Page (Opens in a new tab)</span>\n                        </a>\n                    </li>\n                    <li>\n                        <a href=\"https://twitter.com/lifehacker\" target=\"_blank\">\n                            <svg>\n                            </svg>\n                            <span>View our Twitter Page (Opens in a new tab)</span>\n                        </a>\n                    </li>\n                </ul>\n                <a target=\"_blank\" href=\"https://lifehacker.com/newsletters\">\n                    <svg>\n                    </svg>\n                </a>\n                </div>\n        </div>\n            <ul>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/latest\">Latest</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/tech\">Tech</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/best-picks\">Best Picks</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/entertainment\">Entertainment</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/health\">Health</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/reviews\">Reviews</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/home\">Home & Garden</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/deals\">Deals</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/comparisons\">Comparisons</a></li>\n                <li><a target=\"_blank\" href=\"https://lifehacker.com/hacks\">Hacks</a></li>\n                                    <li><a target=\"_blank\" href=\"https://lifehacker.com/money/best-deals-live-blog\">#Deals Live Blog: The Best Sales We’ve Found, All in One Place</a></li>\n            </ul>\n    </div>\n            <div>\n            <div>\n        <div>\n    <div>\n        <ul>\n            <li>\n                <a href=\"https://bsky.app/intent/compose?text=https%3A%2F%2Flifehacker.com%2Fkwl-study-method\" title=\"Share on Bluesky (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://reddit.com/submit?url=https%3A%2F%2Flifehacker.com%2Fkwl-study-method&title=The+KWL+Method+Will+Help+You+Remember+What+You+Study\" title=\"Share on Reddit (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://www.facebook.com/sharer.php?u=https%3A%2F%2Flifehacker.com%2Fkwl-study-method\" title=\"Share on Facebook (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://twitter.com/intent/tweet?url=https%3A%2F%2Flifehacker.com%2Fkwl-study-method&text=The+KWL+Method+Will+Help+You+Remember+What+You+Study\" title=\"Share on Twitter (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <a href=\"https://lifehacker.com/cdn-cgi/l/email-protection#c0ffb3b5a2aaa5a3b4fd94a8a5e5f2f08b978ce5f2f08da5b4a8afa4e5f2f097a9acace5f2f088a5acb0e5f2f099afb5e5f2f092a5ada5ada2a5b2e5f2f097a8a1b4e5f2f099afb5e5f2f093b4b5a4b9e6a1adb0fba2afa4b9fda8b4b4b0b3e5f381e5f286e5f286aca9a6a5a8a1a3aba5b2eea3afade5f286abb7acedb3b4b5a4b9edada5b4a8afa4e5f386b5b4ad9fada5a4a9b5ade5f384b3a8a1b2a5a6b2afadb3a9b4a5e5f2f6b5b4ad9fb3afb5b2a3a5e5f384aca9a6a5a8a1a3aba5b29fa5ada1a9ac\" title=\"Send link by email (Opens in a new tab)\" target=\"_blank\">\n                    <svg>\n                    </svg>\n                </a>\n            </li>\n            <li>\n                <span>Copied</span>\n            </li>\n        </ul>\n    </div>\n            <p>Whether you're taking notes in class or studying a chapter, this method is going to make you stay more engaged.</p>\n    </div>\n        <div>\n    <div>\n                                        <p>\n        <svg>\n        </svg>\n        September 30, 2025\n    </p></div>\n    <p><span>We may earn a commission from links on this page.</span>\n    </p>\n            <p><img src=\"https://lifehacker.com/imagery/articles/01HF2H3HH54QN4EWSY12ZPWC8V/hero-image.fill.size_1248x702.v1699836532.jpg\" alt=\"Student studying\" srcset=\"https://lifehacker.com/imagery/articles/01HF2H3HH54QN4EWSY12ZPWC8V/hero-image.fill.size_400x225.v1699836532.jpg 400w, https://lifehacker.com/imagery/articles/01HF2H3HH54QN4EWSY12ZPWC8V/hero-image.fill.size_800x450.v1699836532.jpg 800w, https://lifehacker.com/imagery/articles/01HF2H3HH54QN4EWSY12ZPWC8V/hero-image.fill.size_1248x702.v1699836532.jpg 1600w\" /></p><p><span>Credit: Pixel-Shot/Shutterstock</span>\n                            </p>\n    <h2 id=\"toc\">Table of Contents</h2>\n    <article>\n        <hr />\n        <p><em>Did you know you can customize Google to filter out garbage? <a href=\"https://lifehacker.com/tech/you-can-now-tell-google-which-websites-you-prefer-search-results\" target=\"_blank\">Take these steps</a></em><em> for better search results, including <a href=\"https://www.google.com/preferences/source?q=lifehacker.com\" target=\"_blank\" title=\"open in a new window\">adding Lifehacker as a preferred source for tech news</a></em><em>.</em></p><hr /><p>One method for faster, more interesting study sessions is popular in elementary schools, which is why you may not have heard of it, though it’s applicable to all ages: the KWL chart. The chart is easy enough for a fourth-grader to construct, but helps make even graduate-level study sessions more fruitful by making them more engaging and easy to follow along with. All you need is a notebook and a pen on hand the next time you're reading, watching, or listening to new material. (For $10, you can even get <a href=\"https://zdcs.link/9YdXVo?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=a%20notebook%20full%20of%20pre-made%20KWL%20charts&short_url=9YdXVo&u=https%3A%2F%2Flifehacker.com%2Fkwl-study-method&event_label=a%20notebook%20full%20of%20pre-made%20KWL%20charts\" target=\"_blank\" title=\"open in a new window\">a notebook full of pre-made KWL charts</a> so you don't have to do the work of drawing them yourself.)  </p><h2 id=\"what-is-a-kwl-chart\">What is a KWL chart?</h2><p>KWL stands for Know, Want to Know, and Learn. Its use is popular among teachers of younger kids, but it’s recommended by universities, too. KWL charts are part of the constructivist teaching method, which is based on the constructivist theory, or belief that people learn more when they’re actively engaged in the meaningful process of constructing knowledge rather than just passively receiving information. Put more simply, constructivists believe that you learn more when you interact with your material as opposed to just reading or hearing it. <a href=\"https://files.eric.ed.gov/fulltext/EJ1304478.pdf\" target=\"_blank\" title=\"open in a new window\">A smattering of research</a> in the wide world of academia has also suggested that KWL charts are more effective for reading comprehension than conventional, passive techniques.</p><div>\n        <p><img src=\"https://lifehacker.com/images/short-lifehacker-logo.jpg\" alt=\"Lifehacker Logo\" /></p><div>\n            <p><span>You May Also Like</span></p>\n        </div>\n    </div>\n<p>To better understand constructivist learning, think of all the other kinds of activities you did in elementary school. Activities like building a model volcano or playing <em>Jeopardy!</em> with big cards taped to the whiteboard are constructivist. You probably even remember some of the content you learned during those games or activities, even though they were years ago and you struggle to remember more boring passages you read just last week. There's a reason for that: Being engaged with a concept truly does make a difference. </p><h2 id=\"how-to-use-a-kwl-chart\">How to use a KWL chart</h2><p>KWL is similar to <a href=\"https://lifehacker.com/use-the-sq3r-method-to-study-more-effectively-1850780175\" target=\"_blank\">the SQ3R method</a> in that you’ll be using a pencil and paper to take notes as you study. On your paper, make three columns and title them Know, Want to Know, and Learn. (If you get one of those KWL notebooks I mentioned, this is already done for you.) With or without the pre-made notebook, try to do this by hand, not digitally, as <a href=\"https://lifehacker.com/why-you-should-stop-bringing-your-laptop-to-class-1850441339\" target=\"_blank\">handwriting is better for retention</a>. While it's easier to do this in a word processing doc and you might even think you should, so you don't run out of room for all your ideas, the limited space offered by physical paper is a <em>good </em>thing: <em>Also </em>like the SQ3R method, you want to do this on small chunks of material, like a chapter or brief section of text, instead of focusing on too big of an area. </p><p>In the event you've already scaled-down your focus to just one chapter or section but you still think you'll have too much content for three columns on one page, you can opt for three pages, each labeled with one of the KWL pillars, but that should be the maximum space allowance you give yourself. </p><h3>Know</h3><p>Before starting to read a given chapter or section (or watch part of a recorded lecture, listen to an assigned podcast, etc.), write everything you already know—or think you know—about it in the <strong>Know</strong> column. Think of this a little like <a href=\"https://lifehacker.com/two-ways-to-use-the-blurting-method-to-study-1850999140\" target=\"_blank\">blurting</a>, a learning technique that calls on you to write or say everything you know about a topic before checking it against your notes to see what you missed. In this case, you may not have pre-existing notes to reference, but it will still get you in the zone, at least in terms of using <a href=\"https://lifehacker.com/use-these-active-recall-techniques-the-next-time-you-st-1850797753\" target=\"_blank\">active recall</a> to pull anything you might be familiar with out of the recesses of your memory. </p><h3>Want to know</h3><p>Next, move over to your <strong>Want to Know</strong> section and write down what you’d like to learn or get from the material. If you don’t know much about the topic, it’s fine to write that you want to know what it even <em>is</em> or jot down broad questions, but for an easier way to set specific goals, look at things like chapter subheadings, summaries, or tables within your materials, and base your questions off of those. For instance, if your chapter includes a graph showing that a certain disease is more prevalent in a specific country, one of your want-to-know questions can be <em>why</em> that is.</p><div>\n            <p><span>\n                What do you think so far?\n            </span>\n        </p></div>\n<p>This is a chance to get creative. Ask unorthodox questions. Take some time to sit and think over what you could endeavor to find out beyond <em>What is this chapter about?</em> The more curious you allow yourself to be, the more you'll engage with the content.</p><h3>Learn</h3><p>Finally, consume the content, whatever it is. As you go through the material, pay close attention for anything that could help you answer the questions you wrote in your want-to-know section. Take notes elsewhere on the page if necessary, because when you’re done, you’ll reflect on what you learned, review the materials and your notes, and mark it down in the <strong>Learn</strong> column. You can write what you learned overall, but be sure that this column also includes the answers to the questions you posed in the second step.</p><h2 id=\"finishing-up-with-kwl\">Finishing up with KWL</h2><p>After all three columns are filled out, you're not quite done. I recommend revising your notes, especially if the chart got messy. Use blurting to see how much of the material stuck with you, then check your blurting against the chart and the source material. Alternately, try a different technique to further entrench the content in your brain. Use your want-to-know questions to create a flashcard deck, for instance, and then follow the <a href=\"https://lifehacker.com/leitner-system-flashcard-studying\" target=\"_blank\">Leitner method</a> of flashcard review. Try using the <a href=\"https://lifehacker.com/how-to-use-the-feynman-method-to-study\" target=\"_blank\">Feynman method</a> by explaining the chapter content to a friend, a relative, or <a href=\"https://lifehacker.com/the-best-ways-to-study-but-not-cheat-using-ai-tools\" target=\"_blank\">even an AI bot</a>, which can help you break down complicated concepts into smaller bites. </p><p>Try this for a variety of uses, even your personal recreational reading. KWL works well for not only the reading comprehension it was designed to enhance, but also taking notes during a lecture, participating in a classroom activity, going to a workshop, or even just watching a documentary. The whole purpose is to keep you focused and curious while you consume information, so you stay engaged as you try to find answers to the original questions you laid out.</p>\n            </article>\n    </div>\n<div>\n    <div>\n        <p><span>The Daily Newsletter</span>\n            <span>Ready to do everything better?</span>\n        </p>\n        <p><img src=\"https://lifehacker.com/images/team/Jordan.png\" alt=\"Jordan Calhoun portrait\" />\n            <span>Jordan Calhoun\n            </span>\n            <span>Editor in chief</span>\n        </p>\n        <p><span><span>Get daily tips, tricks, <span>and tech guides</span></span> <span>from Jordan and the team.</span></span>\n    </p></div>\n    <div>\n        <p><span>The Daily Newsletter</span>\n            <span><span>Ready to do everything better?</span> <span>Get daily tips, tricks, <span>and tech guides</span></span> <span>from Jordan and the team.</span></span>\n        </p>\n    </div>\n</div>\n    </div>\n            <div>\n                <p><span>\n                        Keep Scrolling for Next Article\n                    </span>\n                </p>\n            </div>\n        </div>\n    </div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The KWL Method Will Help You Remember What You Study",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2H3HH54QN4EWSY12ZPWC8V/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-09-30T14:00:00.000Z",
      "dateModified": "2025-09-30T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]