[
  {
    "title": "What to Do If You're Hearing Static in Your AirPods Pro 3",
    "url": "https://lifehacker.com/tech/airpods-pro-3-static-reports?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8XKF2P6FH6NKQGV946D2XTM/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-31T19:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What to Do If You're Hearing Static in Your AirPods Pro 3",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8XKF2P6FH6NKQGV946D2XTM/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-31T19:00:00.000Z",
      "dateModified": "2025-10-31T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Tinymoose Pencil Pro Ultra Stylus Is On Sale for Just $40 Right Now",
    "url": "https://lifehacker.com/tech/tinymoose-pencil-pro-ultra-stacksocial-sale-october-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K5V4V6J6GB3PNAQBERQNZ9F5/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-30T20:15:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Tinymoose Pencil Pro Ultra Stylus Is On Sale for Just $40 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01K5V4V6J6GB3PNAQBERQNZ9F5/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-30T20:15:00.000Z",
      "dateModified": "2025-10-30T20:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Try 'Habit Stacking' to Make New Routines Stick",
    "url": "https://lifehacker.com/try-habit-stacking-to-be-more-productive-1850614842?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GT5S5TWFYBWDBFP4R2BWW/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-30T12:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Try 'Habit Stacking' to Make New Routines Stick",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GT5S5TWFYBWDBFP4R2BWW/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-30T12:00:00.000Z",
      "dateModified": "2025-10-30T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Apple Plans to Improve AI Image Editors",
    "url": "https://lifehacker.com/tech/apple-improving-ai-image-editors?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8XTR8CWDT0YXP7XMX9X5KHE/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-31T20:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Apple has been a bit behind in the AI race.\n    \n        \n    \n                                        \n        \n        \n        October 31, 2025\n                    \n            Credit: Kaspars Grinvalds/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple's AI researchers have released a dataset to help train AI image editors.\n                                            The dataset, Pico-Banana-400K, contains 400,000 images, as well as many successful and failed edits to help train other models.\n                                            The company used Google's Nano Banana model to develop this dataset, as well as Gemini-2.5.\n                                    \n            \n    Table of Contents\n    \n        \n        Apple might be dead last in the AI race—at least when you consider competition from companies like OpenAI, Google, and Meta—but that doesn't mean the company isn't working on the tech. In fact, it seems most of the work Apple does on AI is behind the scenes: While Apple Intelligence is, well, there, the company's researchers are working on other ways to improve AI models for everyone, not just Apple users. The latest project? Improving AI image editors based on text prompts. In a paper published last week, researchers introduced Pico-Banana-400K, a dataset of 400,000 \"text-guided\" images selected to improve AI-based image editing. Apple believes its image dataset improves upon existing sets by including higher quality images with more diversity: The researchers found that existing datasets either use images produced by AI models, or are not varied enough, which can hinder efforts to improve the models.Funnily enough, Pico-Banana-400K is designed to work with Nano Banana, Google's image editing model. Researchers say using Nano Banana, their dataset can generate 35 different types of edits, as well as tap into Gemini-2.5-Pro to asses quality the edits, and whether those edits should remain as part of the overall dataset.\n        \n            You May Also Like\n        \n    \nAs part of these 400,000 images, there are 258,000 samples of single edits (where Apple compares the original images to one with edits); 56,000 \"preference pairs,\" which distinguishes between failed and successful edit generations; and 72,000 \"multi-turn sequences,\" which walks through two to five edits.Researchers note that different functions had different success rates in this dataset. Global edits and stylization are \"easy,\" achieving the highest success rates; object semantics and scene context are \"moderate;\" while precise geometry, layout, and typography are \"hard.\" The highest performing function, \"strong artistic style transfer,\" which could include changing an image's style to \"Van Gogh\" or anime, has a 93% success rate. The lowest performing function, \"change font style or color of visible text if there is text,\" only succeeded 58% of the time. Other tested functions include \"add new text\" (67% success rate), \"zoom in\" (74% success rate), and \"add film grain or vintage filter\" (91% success rate).  Unlike many of Apple's products, which are typically closed to the company's own platforms, Pico-Banana-400K is open for all researchers and AI developers to use. It's cool to see Apple researchers contributing to open research like this, especially in an area Apple is generally behind in. Will we actually get an AI-powered Siri anytime soon? Unclear. But it is clear Apple is actively working on AI, perhaps just in its own way. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Apple Plans to Improve AI Image Editors",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8XTR8CWDT0YXP7XMX9X5KHE/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-31T20:30:00.000Z",
      "dateModified": "2025-10-31T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Use ‘Task Batching’ to Instantly Be More Productive",
    "url": "https://lifehacker.com/use-task-batching-to-instantly-be-more-productive?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2HBSWTNCXPVXHFZ00YPVZ0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-27T12:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Grouping similar tasks together helps you get more done.\n    \n        \n    \n                                        \n        \n        \n        October 27, 2025\n                    \n            Credit: TippaPatt - Shutterstock\n                            \n    Table of Contents\n    \n        \n        As someone who's read and written a lot about various approaches to increasing productivity, I can say with certainty that the majority of the methods out there are primarily focused on how to structure your tasks over the course of a single day. Techniques and plans that call for prioritizing your to-dos, for instance, generally expect you to prioritize your to-dos for that day. The best scheduling advice also typically revolves around how you designate and take on chunks of time throughout a single day. But sometimes—or often—you work on things that span a longer period of time, so you need productivity tips that are more expansive too. And while too much pre-planning can feel daunting, there's a method you can start using right away that can help you more effectively structure your time in the longer term. It's called \"task batching.\" What is task batching?At its most basic, task batching is the act of grouping similar tasks or responsibilities together and completing them around the same time. Ideally, you can work on all the tasks at once, somewhat multitasking but still staying in the same frame of mind for all the jobs. Your goal here is to avoid context switching, or changing mental energies between tasks. While it's true that multitasking makes you worse at everything—which is why I've sworn off it—this isn't the same thing.\n        \n            You May Also Like\n        \n    \nFor instance, instead of jumping from your inbox to paying bills to taking video meetings to washing dishes to cleaning, you can batch the emails and video calls together, batch the dishes and cleaning together, and save the bills for a different chunk of the day (or the week). Keeping yourself in the same mind frame will help you stay focused instead of allowing your thoughts to be pulled in a bunch of different directions.You already do task batching without thinking about it. When shopping for gifts, for example: Let's say you have to buy new shoes for your kid and your spouse, a gift for your bracelet-loving mother-in-law, one for your necklace-loving sister, and a candle for yourself. At the mall, you wouldn't pick one pair of shoes at Foot Locker, run to the jewelry store for your mother-in-law, head back to Foot Locker for the other shoes, circle back to the jewelry store for your sister's necklace, etc. You'd group these purchases together, getting everything you needed in each store you went into before moving to the next one. If one of the stores was in a different place altogether, you'd probably kick those purchases to a different day. That all just makes sense—and you can apply that same duh logic to your other to-dos.How to batch your tasks effectivelyAt the start of each week, start with your regular to-do list, but then group together the similar things and schedule those groups for specific days. For example, if you need to buy dog food, school supplies, and groceries, schedule a shopping trip for one day of the week. If you have dinner scheduled with a friend and also need to call your mom to ask how her book club went, try to do all those social check-ins on the same day. Writing-intensive work goes in a batch, no matter if it’s for school, work, or pleasure. Personal and professional emails all get handled in one batch. Household tasks go in a batch, whether they’re cleaning or unpacking from a trip.\n            \n                What do you think so far?\n            \n        \nIf you have a big party or event coming up, schedule the prep for a single day instead of picking up one necessity one day and another the next. Complete your similar tasks in one day so you can move on and focus on the next group the following day.One key step here is not just pre-scheduling your batches at the beginning of the week, but checking in on their progress as the week goes on. Deadlines can change (or be missed), and what was low-priority on Monday may suddenly be important on Wednesday. Task batching helps you to get more done in big chunks, which frees you up for the unexpected emergencies or responsibilities that might crop up. The reason this works is that it keeps you in \"the zone.\" Instead of getting pulled in a bunch of directions and constantly thinking about the gear-shift necessary in order to move to the next disjointed task, you remain in the flow. On email day, you move through your inbox more quickly because you remain focused on that one task the entire time. On cleaning day, each chore seems less individually daunting because you're crossing off a bunch of them in sequence. When you're in that kind of  flow state, things start to come easier and you can focus more deeply— plus, this strategy allows you to think ahead instead of constantly jumping from responsibility to responsibility. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Use ‘Task Batching’ to Instantly Be More Productive",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2HBSWTNCXPVXHFZ00YPVZ0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-27T12:00:00.000Z",
      "dateModified": "2025-10-27T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here's Why I Won't Install ChatGPT Atlas on My Mac",
    "url": "https://lifehacker.com/tech/what-to-know-about-openais-new-chatgpt-web-browser?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K86PZ6Z797NMX3THWRPX0VAK/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-27T20:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            \"ChatGPT Atlas\" is officially here. But should you use it?\n    \n        \n    \n                                        \n        \n        \n        October 27, 2025\n    \n            Credit: OpenAI\n                            \n            \n                Key Takeaways\n                                            ChatGPT Atlas, OpenAI's web browser, is officially here.\n                                            The browser comes with ChatGPT integration, including memory, assistance, and agent mode.\n                                            Agent mode can perform tasks on your behalf, but that poses risks to your security and privacy.\n                                    \n            \n    Table of Contents\n    \n        \n        OpenAI has officially entered the browser wars. Last week, the company announced ChatGPT Atlas, a new web browser with ChatGPT integration. At the moment, it's Mac-only, but I wouldn't recommend even my Apple friends jumping on board immediately—at least not without understanding the underlying risks. Atlas' AI web browsing\nIf you've already used other AI browsers, like Perplexity's Comet, Atlas is going to feel familiar. In fact, that's also likely true if you've used any web browser before: Atlas is built on Chromium, the engine that powers browsers like Google Chrome, Microsoft Edge, and Opera. That means the core mechanics of Atlas are fairly standard; there's nothing particularly revolutionary happening here when it comes to sorting tabs or the browsing experience itself. The same is true when it comes to some ChatGPT interactions. As with other AI browsers, ChatGPT is assigned to the sidebar of the browser window. You can call it up by clicking on the \"Ask ChatGPT\" button, where you can ask it questions about the content you're currently browsing. You can also ask ChatGPT for writing assistance any time you enter an open text field in the browser. \n        \n            You May Also Like\n        \n    \nLike Comet, Atlas has an agent mode, but the latter's is built off the existing ChatGPT agent. The idea is that you can task Atlas with performing functions on your behalf. So, rather than pulling up DoorDash's website and ordering yourself dinner, you could ask Atlas to order dinner for you. You can even watch Atlas get to work, and see its thinking behind each decision. OpenAI has other ideas for how to use Atlas' agent mode, including giving the browser a recipe to shop for, or asking the bot to run through team documents at work to generate a brief. Deeper ChatGPT integration is what might set Atlas apart from the competition. If you're a regular ChatGPT user, you'll probably appreciate it having that contextual awareness of your past conversations—if you've already asked ChatGPT about a topic, and you're currently researching it in a browser window, you can pick up the conversation and assume ChatGPT will remember what you've already talked about.        \n    \n            \n            \n                                        Credit: OpenAi\n                    \n    \nSimilarly, Atlas will track your browsing and activity history and call upon it in future sessions. Perhaps you'll open your browser to find personalized suggestions on which sites and topics to explore next. Does that sound creepy? Absolutely. But if you're someone who doesn't mind the privacy trade-off, there could be some benefits there. In OpenAI's announcement, it suggested asking Atlas to pull up all the job postings you looked at last week, and produce a summary of industry trends to use in interview prep. If you find that these memories are a bit too much for you, you can disable them from the browser settings. (OpenAI says deleting your browsing history also deletes associated browser memories, and the browser's incognito window logs you out of ChatGPT.)The company includes a setting called \"ChatGPT page visibility,\" which lets you control whether ChatGPT can actually see the webpage you're visiting. If you choose \"Not Allowed,\" you can block the bot from seeing what you're doing, which is good. But then again, doing that defeats the purpose of Atlas a bit. If you don't want ChatGPT seeing what you're doing, you might as well use a browser that doesn't have ChatGPT built right into it. (The company does promise it won't train ChatGPT on your browsing data unless you opt into it, but why would you do that?)Is Atlas safe to use?\n    \n            \n            \n                                        Credit: OpenAI\n                    \n    \nI'm of the opinion that if the safety of a browser is in question, it's best not to bother with. That's the case with Atlas, as well as other AI browsers, which is why I'm making it a bit of a personal rule from here on out to not download or use them on my personal computers.\n            \n                What do you think so far?\n            \n        \nThe main issue with browsers that incorporate AI agents is that they are susceptible to indirect prompt injection attacks. Brave has done a lot of research on this subject, particularly with Comet. In short, bad actors can potentially hide malicious instructions on websites that the AI agents see as no different from a typical user request. Because the browser is designed to act on your behalf, these malicious instructions can command the AI to do things you definitely don't want it to do. You might ask Atlas to summarize a webpage, but because a bad actor hid a command to do something involving your email, bank account, or corporate intranet on the site, it does that instead. To OpenAI's credit, the company has compiled a list of safeguards to mitigate risks with Atlas. Atlas cannot run code directly in the browser, nor can it download files or install extensions. The browser has no way to access other apps on your Mac, nor its file system. If agent mode needs to access sensitive sites, like your bank, it'll pause to make sure \"you're watching.\" To that point, you can use Atlas' agent in logged out mode, which limits its ability to access sensitive data or take actions \"as you\" on websites. But even OpenAI admits that after thousands of hours of testing, their safeguards \"will not stop every attack that emerges as AI agents grow in popularity.\" The company says it'll patch new vulnerabilities as it finds them, but if bad actors find them first, they might trick these AI agents into doing some terrible things.That assertion has already been proven right. Within Atlas' first few days available to the public, one researcher discovered the browser is susceptible to clipboard injection attacks, in which bad actors can lace elements of their website with code that would add malicious links to your clipboard when clicked. Since Atlas can act on your behalf, you might not even realize if it clicks on such a button, and, as such, you may accidentally paste the malicious link into your browser yourself. To me, the risks currently far outweigh the benefits. I don't yet see much reason to have a bot in my browser do things on my behalf, but even if I did, I wouldn't use it just yet. The risk that someone injects a website with a malicious command and derails my AI agent—and my digital life—is too great, especially when I can book those flights or order that delivery on my own without issue.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's Why I Won't Install ChatGPT Atlas on My Mac",
      "image": [
        "https://lifehacker.com/imagery/articles/01K86PZ6Z797NMX3THWRPX0VAK/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-27T20:30:00.000Z",
      "dateModified": "2025-10-27T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Pay to Generate More Sora AI Videos, and I'm Concerned",
    "url": "https://lifehacker.com/tech/you-can-now-pay-to-generate-more-sora-ai-videos?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8XB25H1WFASHB4B92CGG14G/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-31T16:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Pay to Generate More Sora AI Videos, and I'm Concerned",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8XB25H1WFASHB4B92CGG14G/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-31T16:00:00.000Z",
      "dateModified": "2025-10-31T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prioritize Your To-Do Lists With the ABC Method",
    "url": "https://lifehacker.com/prioritize-your-to-do-lists-with-the-abc-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GVT27NFHX1N9E99CMYG3K/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-31T13:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prioritize Your To-Do Lists With the ABC Method",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GVT27NFHX1N9E99CMYG3K/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-31T13:00:00.000Z",
      "dateModified": "2025-10-31T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Now Is the Best Time to Buy a Peloton With a Referral Code",
    "url": "https://lifehacker.com/health/why-you-should-use-or-give-a-peloton-referral-code?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8NZZC91GF99AF4D6ADK01YW/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-28T18:30:29.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Save a little cash on your Peloton purchase with a Member's referral code for the next few days.\n    \n        \n    \n                                        \n        \n        \n        October 28, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Peloton\n                            \n    Table of Contents\n    \n        \n        If you've been considering getting one of Peloton's new Bikes, Treads, or Rows, this might be the time—as long as you know someone who is already an All-Access Member. Until Nov. 11, referral codes from existing members get you more money off your hardware purchases. The discount detailsLast month, Peloton rolled out upgraded versions of its fleet, including the Bike, Bike+, Tread+, Tread+, and Row. The new devices are known as the Cross Training series and, as such, are named the Cross Training Bike, Crosstraining Tread+, etc. If you want to know how they differ from the old models, I wrote an explainer here, but the basic gist is that the proprietary touchscreens on which you follow guided classes now swivel around, making it easier to hop off your machine and do, say, a strength or yoga class. The Plus line also comes with a movement-tracking camera that uses AI to correct your form, suggest when it's time to add more weights or reps, and monitor your workouts. As you can assume, these are pricier than their predecessors, which is why the current referral promotion might be of interest to you. If you get a referral code from an existing All-Access Member, here's what you can get off at checkout: $300 (instead of the usual $250) off your cart when you purchase a new Peloton Cross Training Bike$700 off your cart (instead of $500) when you purchase a new Peloton Cross Training Bike+$500 off (instead of $300) when you get a Peloton Cross Training Tread$1,200 off (instead of $600) a purchase of a new Peloton Cross Training Tread+$200 off a new Peloton Cross Training Row+ All the discounts will return to normal after Nov. 11. (Note: This probably isn't the best time to get a Cross Training Row+, as the typical referral discount on that is $300.)Your referrer has to be an All Access Member, not someone who uses one of the less-expensive, app-only versions of Peloton's digital offerings. The referrer can't be renting their machine, their membership can't be paused, and they can't be a Peloton employee. Notice, too, that this specifically applies to new devices. That means you can't use the referral code to get money off a purchase on Peloton's resale platform, Repowered, although that's always a solid option if you're looking for equipment on a budget. You don't have to have the Cross Training series to get a good workout (although I enjoyed my demos of those devices); I have been using the same Peloton Bike for nearly five years and love it—I ride it every day. You can redeem your code on the Peloton website or at Peloton stores. Bear in mind, however, you have to be a new customer. \n            \n                What do you think so far?\n            \n        \nHow to find a referral codeIf you want to be the referrer, not the referee, here's how to generate the code that will get you some brownie points with your fitness-focused friends. The easiest way is to go to this link and log into your Peloton account. Otherwise, head to members.onepeloton.com and select the hamburger menu in the top right corner, then hit Refer friends. If you're not seeing that or the link above didn't work, you're not eligible to share a code. You can also do this on your mobile app by tapping the Community tab, then Add Friends on the upper right, then Refer Friends.Remember how I said you'll get brownie points with the people you refer? You get something else, too: You can give out up to $1,200 in referrals, but you also get a free month of your All Access Membership for every person you refer. Once someone makes a purchase with your code, you'll get en email containing a code of your own, plus instructions on how to redeem it, after three to five business days. The voucher codes are valid for three months after their issue date. \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n            Staff writer\n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Now Is the Best Time to Buy a Peloton With a Referral Code",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8NZZC91GF99AF4D6ADK01YW/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-28T18:30:29.000Z",
      "dateModified": "2025-10-28T18:30:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zillow Now Has DMs, and They Might Actually Be Useful",
    "url": "https://lifehacker.com/tech/zillow-now-has-dms?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8NNZE5RATDTD04X6A1DXYJR/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-28T16:00:29.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            \"I'll hit you up on Zillow.\"\n    \n        \n    \n                                        \n        \n        \n        October 28, 2025\n                    \n            Credit: PJ McDonnell/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Zillow, the app for finding houses for sale and rent, now has messaging.\n                                            The feature keeps you in the app to discuss listings, rather than sending houses to other chat apps.\n                                            Users can only chat with one other person at this time, and must invite the other person to start chatting.\n                                    \n            \n    Table of Contents\n    \n        \n        I'll say it: There are too many messaging apps out there. There's WhatsApp, Messenger, Snapchat, Discord, Signal, Telegram, and iMessage (if you're on iPhone), and that's just the dedicated chat apps. You might have to keep up with new messages on Instagram, TikTok, Threads, even Spotify. If I install one more app with a messaging feature, I'm going off the grid. As it happens, another non-chat app is joining this list. On Tuesday, Zillow—yes, Zillow—announced its app will also now support messaging. Starting today, you can send people messages in the app you use to look at houses you will most likely never actually buy. We live in interesting times, indeed. Of course, Zillow's goal here isn't to become the next WhatsApp. In fact, you can only choose to chat with one other person on Zillow—at least, that's the case for now. The idea of Zillow messaging is strictly to chat about listings you find through the app, without needing to leave Zillow to do so. The goal for most app developers is to keep users on the platform for as long as possible, so there's a cynical case to make here for Zillow trapping its users within the app. If you don't move to another chat app to talk about a listing, you're more likely to interact with additional houses on the app. \n        \n            You May Also Like\n        \n    \nBut I actually see the logic here: If you're in a housing market with a lot of listings, you're probably firing off a number of them every day to interested parties—namely, whoever you're buying the house with. Keeping those conversations in the same app as those listings could be a smart way to keep track of all those houses, instead of the usual routine of \"wait, which house was that? I can't find the text you sent me.\" And the fact that Zillow is limiting this experience to one chat partner at this time means you're not going to be DMing a number of people about houses in your area. This does seem designed for people who are trying to buy a house together to do so with a bit more convenience.How to try Zillow messagingThis feature is live as of this article. To get started, open Zillow on your smartphone or in your web browser. On the app, tap \"Inbox;\" on the web, click your profile in the top-right, then choose \"Inbox.\"  In order to start a chat, you need to invite the other person to join you. To do so, choose \"Invite now,\" which will pull up a pop-up about the feature. This screen explains the invite link is good for 24 hours, and that you can only invite one person for now. \n    \n            \n            \n                                        Credit: Lifehacker\n                    \n    \nChoose \"Share invitation,\" and Zillow will let you share it wherever you'd like. You can copy the link, and paste it in another chat app, or choose a destination for Zillow to share the link to directly.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zillow Now Has DMs, and They Might Actually Be Useful",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8NNZE5RATDTD04X6A1DXYJR/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-28T16:00:29.000Z",
      "dateModified": "2025-10-28T16:00:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WhatsApp Is Rolling Out Passkey Support for Encrypted Backups",
    "url": "https://lifehacker.com/tech/whatsapp-will-support-passkeys-for-encrypted-backups?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8TWG5PVSSMBYFE2P3F0A887/hero-image.fill.size_1200x675.webp",
    "tag": "Life",
    "date": "2025-10-30T16:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WhatsApp Is Rolling Out Passkey Support for Encrypted Backups",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8TWG5PVSSMBYFE2P3F0A887/hero-image.fill.size_1200x675.webp"
      ],
      "datePublished": "2025-10-30T16:30:00.000Z",
      "dateModified": "2025-10-30T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Would You Buy an iPhone With No Real Buttons?",
    "url": "https://lifehacker.com/tech/would-you-buy-an-iphone-with-no-buttons?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8V5P94R9KHSV3DYY1XZB81E/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-30T19:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Rumors suggest that's what you'll get with the 20th anniversary iPhone.\n    \n        \n    \n                                        \n        \n        \n        October 30, 2025\n                    \n            Credit: Drop of Light/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Rumors suggest Apple will replace all buttons on the iPhone 20 with haptic feedback.\n                                            These haptic buttons wouldn't actually move, and would use vibrations to simulate a button press.\n                                            It's the same idea behind the Home button on the iPhone 7 and iPhone 8, as well as the trackpad on MacBooks.\n                                    \n            \n    Table of Contents\n    \n        \n        Here's a question you've probably never considered before: Would you buy a new iPhone if it didn't have any physical buttons? Sure, the part of the phone you interact with most is the touchscreen, so maybe it doesn't seem like such a big deal. But think about it: The side button, volume buttons, Action button, and Camera Control button would no longer click. Could you live without the clutter? While Apple sells no such iPhone, and likely won't release one next year, it very well might roll out a buttonless iPhone in 2027—at least, physically buttonless.  That year will mark the 20th anniversary of the iPhone, and it'll come as no surprise that rumors suggest Apple is planning something special for the \"iPhone 20.\" And that something might include ditching all the mechanical buttons and replacing them with haptics.A truly buttonless iPhoneIf you owned an iPhone 7 or iPhone 8, you'll understand the idea here. Those iPhones replaced the mechanical Home button with a solid state haptic button. Essentially, Apple used clever haptic vibrations to create the illusion of a button press, but, in fact, the \"button\" doesn't move at all. You'll realize this if the phone is completely off: The once pressable Home button doesn't actually do anything. It's the same case with any MacBook released over the past decade: Your trackpad isn't actually a button, so when the computer is off, the glass doesn't move.  \n        \n            You May Also Like\n        \n    \nThe suggestion that the iPhone 20 will replace all of its buttons with this type of tech comes from leaker Instant Digital, who has previously claimed Apple intend to build a button-free iPhone. In the past, Instant Digital only confirmed vague plans by Apple to create such a phone sometime in the future, but this week, the leaker was more definitive: In a post on Weibo, Instant Digital asserted that Apple has \"completed functional verification\" for these haptic buttons, and is planning for \"mass production and application\" with the iPhone 20. All of the buttons, from the Side button to the Camera Control buttons, would adopt this technology. Interestingly, Instant Digital claims Apple will bridge the gap by simplifying the structure of the Camera Control button in next year's iPhone 18. Apple might remove the capacitive sensing layer of the button and keep just the pressure sensitivity. We'll have to see whether other rumors confirm this.Would you buy a buttonless iPhone 20?The iPhone 20 unveil is nearly two years away, and all rumors should be taken with a grain of salt. Apple might have big plans in store for this iPhone, but haptic buttons might not have anything to do with them. But let's assume for the sake of argument that Apple does exactly what Instant Digital suggests. Would you buy it?This would be a fundamentally different experience from any other iPhone, or really, any other smartphone. Even if you once had an iPhone with a haptic Home button, you've always had physical buttons to control the volume, to call up Siri, or to shut down your device. Those experiences would feel different, and could be more difficult to use just by feel alone, unless Apple makes each \"button\" physically obvious. It also calls into question how one would perform any hardware tasks that currently require physical buttons. Once Apple removed the physical Home button, you couldn't use it to reset the iPhone, so Apple gave the volume button that job instead. But if all buttons aren't really buttons anymore, how would you reset the iPhone if the screen becomes unresponsive? Plug it into a computer? Take it to an Apple Store? Say a prayer? My guess is Apple will have a solution, but at the moment, it's not clear what it would be. Personally, I don't think the change would influence my buying decision one way or the other. I'm hopelessly stuck in Apple's ecosystem, so I'll likely upgrade whenever my current iPhone bites the dust. If my options at that point include an iPhone without buttons, so be it, but I wonder if other iPhone users feel the same. (Plenty of you are still mourning the loss of the headphone jack.)\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Would You Buy an iPhone With No Real Buttons?",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8V5P94R9KHSV3DYY1XZB81E/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-30T19:30:00.000Z",
      "dateModified": "2025-10-30T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Says Androids Get 58% Fewer Scam Texts Than iPhones, but I Have Some Questions",
    "url": "https://lifehacker.com/tech/google-study-claims-android-gets-fewer-scam-texts-than-iphone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8VBNSD4JAYP5610157SQ6ZP/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-30T21:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Questions remain about how Google got those numbers.\n    \n        \n    \n                                        \n        \n        \n        October 30, 2025\n    \n            Credit: Tada Images / Shutterstock\n                            \n    Table of Contents\n    \n        \n        If you're getting more scam texts than your friends and family, it turns out it might be your mobile platform, at least going by a recent poll from Google and YouGov. According to Google, users on Android report receiving 58% fewer scam texts than those on iOS, and that number is even better on Pixel devices.\n    \n            \n            \n                                        Credit: Google\n                    \n    \nThat data comes from a survey Google and YouGov conducted of over 5,000 Android and iOS users across the U.S., India, and Brazil. The data says that Android users as a whole were \"58% more likely than iOS users\" to report that they had not received any scam texts in the week prior to the survey, and that iOS users were 65% more likely than Android users to report getting three or more scam texts in a week. On the whole, it also says that Android users were 20% more likely to describe their device's scam protection features as \"very effective\" or \"extremely effective.\"As for Pixel vs. iPhone specifically, the survey also found that Pixel users were 96% more likely to report zero scam texts than iPhone users, and that iPhone users were 136% more likely to say they had received \"a heavy volume of scam messages\" than Pixel users, as well as 150% more likely to say their device was \"not effective at all in stopping mobile fraud.\"\n        \n            You May Also Like\n        \n    \nThose numbers don't look good for Apple, although it's worth pointing out a few details before taking Google at its word.What is YouGov?First, to Google's credit, it didn't conduct this study alone. While the company didn't go into detail on how it partnered with YouGov here, YouGov itself is a respectable entity, widely cited in market research and even political news. The organization specializes in polls, and has been cited in everything from the New York Times to Lifehacker sister publication Mashable. It's also worth pointing out that YouGov wasn't the only independent entity Google worked with while putting together its report. The company also reached out to Counterpoint Research to evaluate its AI-powered anti-scam protections, and Leviathan Security Group to asses scam protection across four Android phones. The company used these studies to put together infographics depicting its security features vs. iPhone's, which you can see below.\n    \n            \n            \n                                        Credit: Google\n                    \n    \n\n    \n            \n            \n                                        Credit: Google\n                    \n    \nNote, however, how Google has put together the information here. Specifically, it implies that iPhone does not offer any scam protections in emails, while ignoring that many iPhone users access their email through the same Gmail app as on Android. It also doesn't mention Safari's ability to block pop-ups or the iPhone's ability to screen phone calls, which makes me think Google might be getting choosy with how its presenting the data here. As such, it's worth looking at its survey results with a critical eye as well.Questions about methodologyWhile Google's survey results are likely accurate to the polled audience, I do have a few questions about the methodology. First, there's the issue with this being a survey, rather than a more dispassionate look at texting inboxes. While helpful for getting insight into how users perceive their devices, surveys are susceptible to the word of those surveyed, which means that can be swayed by respondents misremembering details or misunderstanding questions.The bigger question to me, though, is sample size. While I commend Google for conducting its survey across three different regions, the company was not clear about how many of its respondents owned iPhones vs. Android devices. It's possible that iPhone users might have reported more scams simply because the iPhone is more popular in the U.S., for instance. To be fair, those numbers are reversed in India and Brazil, but without knowing a breakdown of how many people Google and YouGov interviewed where, it's hard to know if the data is being impacted by other factors.\n            \n                What do you think so far?\n            \n        \nFor instance, in addition to potentially being more numerous depending on a breakdown of the surveyed population, iPhone users might also be more susceptible to scam texts simply because scammers might want to target that user base more, as was once the case with viruses on Windows. The iPhone is known as a luxury device, which implies its user base might have extra money to spend, making it an alluring target.Can you believe Google's survey?So, can you take Google's polling at its word? Yes and no.With YouGov helping the company out, it's likely that the results presented are truthful, although they could still be misleading. The only way to know for sure would be to look at a detailed breakdown of the survey itself, but unlike the Counterpoint Research and Leviathan Security Group evaluations, there doesn't seem to be a way to look at the raw survey data at the moment, just Google's blog reporting on its findings.I've reached out to Google and YouGov independently with questions about their methodology, and did not immediately hear back. For good measure, I've also reached out to Apple for its take, and similarly am still waiting for a reply.In the meantime, I would take this survey with a grain of salt. It's almost certainly based in truth, but it's important to remember that it's still part of a larger advertising narrative.Google has made a big deal as of late about calling Apple's ecosystem a walled garden. If the company can convince users that it can offer them greater freedom while also upping their protection, that would be a big win. It does, however, coincide with Android's own efforts to close itself off in the name of security, so maybe the truth is both platforms aren't so different after all.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Says Androids Get 58% Fewer Scam Texts Than iPhones, but I Have Some Questions",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8VBNSD4JAYP5610157SQ6ZP/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-30T21:30:00.000Z",
      "dateModified": "2025-10-30T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Character.ai Will Soon Start Banning Kids From Using Its Chatbots",
    "url": "https://lifehacker.com/tech/characterai-banning-kids-from-chatbots?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8VHE84C64KDM1SC082PWSN2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-31T12:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Character.ai Will Soon Start Banning Kids From Using Its Chatbots",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8VHE84C64KDM1SC082PWSN2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-31T12:30:00.000Z",
      "dateModified": "2025-10-31T12:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fitbit Is Finally Fixing Its Cardio Load Problem",
    "url": "https://lifehacker.com/health/fitbit-fixing-cardio-load-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8RR0WJ03PE8VY50QF7XZNX5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-29T20:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fitbit Is Finally Fixing Its Cardio Load Problem",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8RR0WJ03PE8VY50QF7XZNX5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-29T20:00:00.000Z",
      "dateModified": "2025-10-29T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]