[
  {
    "title": "This App Will Detect People Wearing Smart Glasses Near You",
    "url": "https://lifehacker.com/tech/use-this-app-to-know-whether-someone-is-wearing-smart-glasses?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ87RSN7ZGQ29W6Q1ENFW1AK/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-24T17:11:56.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 24, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Getty Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            \"Nearby Glasses\" is a new app that tells you when someone is wearing smart glasses in your area.\n                                            The app looks for Bluetooth signatures of known smart glasses manufacturers, and sends a push notification when it spots one.\n                                            The app will think mixed reality headsets are smart glasses, so false positives can happen.\n                                            Nearby Glasses is available for Android, and the developer is working on an iOS port.\n                                    \n            \n    Table of Contents\n    \n        \n        Smart glasses aren't just the stuff of Hollywood anymore: You can buy a pair right now. Devices like Ray-Ban Metas come equipped with speakers, a microphone, embedded cameras, and connectivity to your smartphone—all in a package that largely looks like a normal pair of glasses. That's great for enthusiasts who want a hands-free smartphone experience when out and about, but not so great for anyone who dislikes the idea of invisible cameras everywhere.There are two sides to these privacy worries. One is the personal angle. Many of us don't want the people around us shoving their smartphone cameras in our faces when we're out in public, but at least then we'd know we're being recorded. These embedded cameras are tough to spot unless you know what you're looking for, which means there's a feeling of always being watched by anyone walking past wearing glasses. On the other hand, there's the larger privacy concern that comes with the territory of a huge company like Meta. Just last week, we learned the company plans to bring facial recognition tech to its Ray-Ban and Oakley smart glasses with a feature called \"Name Tag,\" which would give the wearer insights into the people they encounter using Meta AI. Taken together, smart glasses pose an unprecedented privacy and security risk for those of us living our lives, when both our neighbors and law enforcement have the accessibility to spy on us without our knowledge. Of course, what can you do? If these glasses are legal, and they're relatively inconspicuous, how can you protect yourself from the average Ray-Ban Meta-wearing Joe? By the time you get close enough to tell whether or not they're wearing smart glasses, you're already in view of the camera.\n\"Nearby Glasses\" tells you when someone is wearing smart glasses in your areaEnter \"Nearby Glasses,\" a new app that spills the beans on smart glasses wearers near your location. As reported by 404 Media, the app is made by developer Yves Jeanrenaud, and scans for smart glasses' \"distinctive Bluetooth signatures\" (also known as \"advertising frames\") to identify them in your immediate area. Jeanrenaud was able to use a directory of Bluetooth Low Energy (BLE) manufacturers to build a list of smart glasses the app can scan for, including devices from Meta, Luxottica Group S.p.A, and Snap. If the app spots one, it sends you a push notification.\n            \n                What do you think so far?\n            \n        \nThe app can't currently distinguish between smart glasses and mixed reality headsets, however. As such, you may get an alert saying there are smart glasses nearby, but because the app picked up the Bluetooth signals from a Meta Quest headset. That said, these are much easier to spot than smart glasses, and are far less likely to be worn inconspicuously in public spaces.    Nearby Glasses is available for Android today, on both the Play Store as well as Github. Jeanrenaud says an iOS port \"is in the making.\"\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This App Will Detect People Wearing Smart Glasses Near You",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ87RSN7ZGQ29W6Q1ENFW1AK/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-24T17:11:56.000Z",
      "dateModified": "2026-02-24T17:11:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Just Announced Three New Gemini Upgrades for Galaxy S26 and Pixel 10",
    "url": "https://lifehacker.com/tech/three-new-gemini-upgrades-for-galaxy-s26-and-pixel-10?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJASHNTYJB301NNZX50YR0E0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-25T18:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 25, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Google\n                            \n            \n                Key Takeaways\n                                            Google is rolling three new Gemini AI upgrades for Android, starting with Pixel 10 and Galaxy S26 devices.\n                                            On these devices, Gemini will be able to run tasks on your behalf, such as booking a ride through Uber or reordering a favorite meal on DoorDash.\n                                            Circle to Search will also be able to search multiple items on screen at once, rather than focus on one item at a time.\n                                            Google is rolling out upgrades to its Scam Detection AI, to help detect scams in real-time.\n                                    \n            \n    Table of Contents\n    \n        \n        To coincide with the Samsung Galaxy S26 launch, Google announced three Gemini-related upgrades for Android, coming first to both the Galaxy S26 series and the Google Pixel 10 range. In fact, one of these new features seems like a significant step forward for AI on smartphones: the ability for Gemini to handle multi-step tasks on an Android phone. The examples Google gives are booking a ride through Uber or reordering a meal on DoorDash, where the AI takes care of everything in the background, leaving you free to worry about, well, whether it's going to work.Google wants Gemini to perform tasks on your behalf  \"When you're working on a repetitive daily task, it's easy to daydream about handing it off to someone else,\" explains Google in the announcement blog post. \"Now, we're showing an early preview of what's possible.\" Understandably, this has a \"beta\" label as well as an \"early preview\" label attached, and it's initially only going to be available on Galaxy S26 phones and Pixel 10 phones (the Pixel 10a misses out). It'll also be limited to the U.S. and South Korea to begin with.As per Google, the process will be tightly controlled: Automations begin with your voice command and end as soon as the task is finished. Live notifications will keep you updated throughout, and you can jump in and take manual control at any time. What's more, the app is run in a \"secure, virtual window\" on your phone, with restricted app access.\nIt's going to be interesting to see how well this works. If it works well, this feels like a notable moment in getting AI to actually do mobile tasks for us. It's not clear if Google needs third-party app permission for this, but for now the feature will be available \"for select apps\" in the food, grocery, and rideshare categories.Google is upgrading Circle to Search and Scam DetectionNext, Google is upgrading Circle to Search on Android, the feature that lets you circle anything on screen and run a search from it. Circle to Search can do everything from find you a lamp online to warn you about a phishing scam.Now, Circle to Search will be able to search multiple elements on screen at once. It might be different pieces of furniture in a room, or different items of clothing in an outfit. You don't actually make the selections yourself: You just circle the relevant area (or the entire screen), and Gemini picks out the various constituent parts.\n            \n                What do you think so far?\n            \n        \n\"We know that sometimes you aren't just looking for a single thing on your screen—you're looking for the whole thing,\" says Google. \"Whether you're curating a mood board, building an entire outfit or just satisfying your multi-layered curiosity...Circle to Search is getting a whole lot more helpful.\"\n    \n            \n            Circle to Search can now scan for multiple items in a search.\n                                        Credit: Google\n                    \n    \nGoogle is also embedding the ability to virtually try on clothes from your phone in the Circle to Search flow. It's similar to the Gemini multi-step process above, with the AI taking on several sequential tasks to (in theory) be even more useful—technically, Google calls it a query fan-out technique. Again, this will be exclusive to Galaxy S26 and Pixel 10 phones, with no word yet on this potentially expanding to other handsets.Finally, the last upgrade is more of a wider roll out than a new feature. The Scam Detection AI that Android uses to detect if you're being scammed in calls in real time is coming to the Galaxy S26 series for users in the U.S. It's already offered on multiple Pixel models in the U.S., the UK, Australia, Canada, India, and Ireland. The same technology is also currently available in Google Messages to catch text-based scams, and Google says it's \"enhancing\" how this works to recognize more varied scams, starting with Galaxy S26 and Pixel 10 devices. The new and improved tech will use on-device models to better spot techniques used by scammers.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Just Announced Three New Gemini Upgrades for Galaxy S26 and Pixel 10",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJASHNTYJB301NNZX50YR0E0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-25T18:00:00.000Z",
      "dateModified": "2026-02-25T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "All the Ways You Can Customize Notifications on Android Auto",
    "url": "https://lifehacker.com/tech/how-to-customize-notifications-on-android-auto?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ5H56V8DV16PKZJBTEP82X3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-23T16:00:06.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 23, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Vera Aksionava / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        If you're an Android Auto user, you may already know that setting up phone notifications while you're driving isn't as straightforward as it could be—though Google has recently made a settings tweak that should simplify things. On the one hand, you don't want to miss important messages or calls, but on the other you definitely don't want to put yourself and other road users at risk by getting distracted while driving. A careful balance is needed, and it's important to know what options are available on your phone.If you're a Pixel user, Do Not Disturb is handled by Modes, which you can find by tapping Modes in Settings. Pick Driving, and if you enable the While driving toggle switch, this mode is automatically enabled when you're in your car.\n    \n            \n            You can mute some or all of your phone's notifications when driving.\n                                        Credit: Lifehacker\n                    \n    \nTap the While driving text (not the toggle switch), and you can tell Android how it should determine whether or not you're driving. This is the setting that Google recently tweaked: You can now choose Use Bluetooth (so the mode is enabled when a car dashboard is detected), or Use motion and Bluetooth (which also takes readings from your phone's accelerometer into consideration). Previously, you had to rely solely on motion, which led to problems with automatic activation for both drivers and passengers—the addition of Bluetooth should mean a more reliable experience.\nIt's slightly different on Samsung Galaxy phones: You need to tap Modes and Routines from Settings, then you can access the Driving mode. Here, you can specifically set a connection to an Android Auto dashboard as the trigger for enabling the mode, rather than just any Bluetooth device—something Google should really add to standard Android.On both Pixel and Galaxy phones, you can tweak the driving mode to allow notifications from certain apps or from certain people, but again be wary of making your vehicle too distracting with pop-ups and pings.Other Android Auto notification settingsAs well as setting which apps and contacts can trigger phone notifications while you're driving, you can customize these modes further. From the Driving mode screen on a Pixel, tap Display settings to control whether or not the phone lights up when you get a notification. You can also dim the wallpaper, and switch to a grayscale look.When you're editing your Driving mode on a Galaxy phone, you'll see you can tap either Lock screen or Home screen to change the wallpaper and color palette specifically for this mode. Again, the idea is that your phone is a little less distracting visually.There are more notification options on the main Android Auto settings page: From Android Settings, tap Connected devices > Connection preferences > Android Auto (Pixel) or Connected devices > Android Auto (Galaxy).\n            \n                What do you think so far?\n            \n        \nUnder the Messaging header, you can turn off alerts for group conversations, or for messaging apps entirely. There's also a toggle switch here for showing or hiding the first line of the incoming message—you probably want to disable this if you want to spend more time with your eyes on the road.\n    \n            \n            You can control how messages appear on your dashboard.\n                                        Credit: Lifehacker\n                    \n    \nFinally, there's the option for having your incoming messages read out loud to you, which is another way you can reduce the temptation to stare at your vehicle's dashboard for an extended period of time, or to pick up and unlock your phone.It's worth reviewing all the other Android Auto settings here as well, to make sure your driving experience is set up exactly the way you want: You can reduce the number of apps available in Android Auto, for example, and enable taskbar widgets for easier app control, which can also make a difference to how distracted you are on the road.You should end up with an Android Auto notification system that's not going to overwhelm you with alerts while you're driving, but which also won't hide important messages from you by automatically enabling notification filters without you being aware.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All the Ways You Can Customize Notifications on Android Auto",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ5H56V8DV16PKZJBTEP82X3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-23T16:00:06.000Z",
      "dateModified": "2026-02-23T16:00:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These 'Job Applications' Are Actually Scams",
    "url": "https://lifehacker.com/money/these-job-applications-are-actually-scams?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ3Q6S0TSZBE4VG31PM67Z6P/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-23T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 23, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Teacher Photo/Shutterstock\n                            \n    Table of Contents\n    \n        \n        If you receive a text from a random number offering you a job, it's almost certainly a scam, and you likely know to ignore and delete the message and move on with your life. But a message from a recruiter with a link to an employment application may give you pause—and fraudsters are hoping that you'll believe it just enough to hand over your personal information. Malwarebytes recently identified a phishing scam that uses fake Google Forms posing as job applications to harvest user account credentials.How the Google Forms job scam worksThis specific campaign involves a fake Google Forms site that impersonates the real thing. Links sent to scam targets—likely via email or LinkedIn—direct to forms.google.ss-o[.]com, which looks like a subdomain of the legitimate forms.google.com. (It isn't.) The \"ss-o\" may be a trust signal for \"single sign-on\" and fail to raise red flags for many users. Each target receives a personalized URL, which leads to a (fake) Google Form inviting the user to apply for a job. As Malwarebytes found, the fake page uses the standard Google Forms colors, header, and disclaimers. The form itself is greyed out behind a pop-up prompting users to \"sign in to continue.\" Again, this doesn't look particularly suspicious for a typical Google flow. But the sign-in button redirects to another domain that has been used in multiple phishing attacks to harvest credentials. \nFraudsters have long used Google apps to perpetuate phishing schemes. A 2025 campaign targeting students, faculty, and staff at U.S. colleges and universities used Google Forms that mimicked legitimate school communications to collect login credentials entered directly into the form itself. (Google warns you to never, ever do this.) And numerous attacks on Gmail users have leveraged shared Google Docs to direct victims to a fake sign-in page. How to avoid phishing attempts on your Google credentialsAs always, your first red flag for a scam is a link sent via an unsolicited job offer—even if that link goes to a seemingly legitimate site. Scammers have all kinds of tricks for spoofing URLs and using recognizable domains to gain your trust. Always hover over hyperlinks to see the actual destination before clicking, and look carefully for additions or misspellings in the URL. \n            \n                What do you think so far?\n            \n        \nPlus, you should probably be wary of any job application submitted via Google Forms. Do your due diligence in speaking with an actual human, and do not send sensitive personal information through Google Forms. This is also a good reason to use a password manager, which won't allow you to fill login credentials on a fake site. If your password manager gives you a warning or prevents you from using autofill, don't override it. \n            \n    \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from our expert team.\n            The Daily NewsletterReady to do everything better?\n                    Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These 'Job Applications' Are Actually Scams",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ3Q6S0TSZBE4VG31PM67Z6P/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-23T15:00:00.000Z",
      "dateModified": "2026-02-23T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Chrome Now Has Split View (and Two More New Productivity Features)",
    "url": "https://lifehacker.com/tech/google-chrome-now-has-split-view-and-two-more-productivity-upgrades?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHXYV6R728C1DZJRKCD7493Y/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-20T17:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 20, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Pranay Parab\n                            \n            \n                Key Takeaways\n                                            Google Chrome has three new productivity features on desktop.\n                                            The new features include a split view and better support for PDFs.\n                                            Google Chrome's new productivity features are available now, with no need to wait for a rollout.\n                                    \n            \n    Table of Contents\n    \n        \n        While I generally consider Chrome to be a mature, feature complete browser, it's great to see that Google is still making meaningful additions to it. With its latest update, Google Chrome for desktop now has three new productivity features: Split View, PDF annotations, and the ability to save downloads directly to Google Drive. These features are targeted at both regular and enterprise users, the company says, so you don't need to worry about Workspace exclusivity. Let's take a look at each new feature and how you can best use it.Split View lets you boost your productivity\n    \n            \n            \n                                        Credit: Google\n                    \n    \nOver the years, the internet browser has become a super app of sorts, since it has access to so many useful sites and web apps. In Chrome, I often find myself taking notes while attending meetings online, or keeping a second tab open for research while I write articles. For many people, a single Chrome tab or window is no longer enough, and with that in mind, Google's added Split View to the desktop version of its browser.Split View merges two tabs and displays them in the same window. You can think of it like the split-screen view in old school video games. You can use Split View by right-clicking any tab and selecting Add Tab to New Split View. For now, Chrome allows you to have a maximum of two tabs side by side in Split View, although I hope you'll eventually be able to add more in the future. In its current form, the feature is great for using Google Docs while watching an educational video, or similar two-tab use cases. Finally, no more opening single tabs in separate windows and then resizing them into your own, makeshift split view.\nYou can easily drag the slider in between the two tabs to give one tab more screen space than the other. Or for more control, you can click the Split View button to the left of the address bar and select the Arrange Split View menu (this is also available if you right click the merged tabs in your tab bar). This is an easy way to quickly reverse the order of the two tabs, separate them, or close just one of the tabs.\n            \n                What do you think so far?\n            \n        \nAnnotate PDFs in Chrome\n    \n            \n            \n                                        Credit: Google\n                    \n    \nLet's be honest: Chrome is probably the PDF viewer that most people use. No matter how many fancy PDF editing apps I or my colleagues recommend, for the most part, you're going to search for and open PDFs in your browser. Luckily, now you no longer have to use a different app for basic annotations. Chrome's desktop PDF Viewer now has tools for highlighting text, adding notes, and even making digital signatures. You're still going to need a different app for advanced PDF edits, but Chrome is now capable enough to handle the basics.Save PDF files directly to Google Drive\n    \n            \n            \n                                        Credit: Google\n                    \n    \nWhenever you download a PDF file using Google Chrome, it defaults to saving them to the Downloads folder on your computer, or to another location on your hard drive. On desktop, Google now lets you save these files directly to your Google Drive account. This can be very useful if you want to keep your local storage clear. When you open a PDF file in Chrome, you'll see a Google Drive icon in the toolbar, next to the download button. Clicking the Google Drive icon will automatically save it to the cloud storage service, in a new folder called \"Saved from Chrome.\"\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Chrome Now Has Split View (and Two More New Productivity Features)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHXYV6R728C1DZJRKCD7493Y/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-20T17:30:00.000Z",
      "dateModified": "2026-02-20T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Maps Now Makes You Log In to See These Key Features",
    "url": "https://lifehacker.com/tech/google-maps-hidden-features-when-logged-out?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHVS2XKWGQGY676C8ADR2S3V/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-19T22:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 19, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Google\n                            \n            \n                Key Takeaways\n                                            Google Maps now requires users to log in to see key items and features on the map.\n                                            Reviews, images, and other important data points are omitted from businesses and restaurants.\n                                            You'll also see far fewer businesses—including restaurants and hotels—on the map, as well as fewer street names.\n                                    \n            \n    Table of Contents\n    \n        \n        I use Google Maps to get from point A to point B, but I also use it for research. It's an essential tool for finding new restaurants to try, or for identifying well-reviewed hotels in a new area. While many use it with their Google account, others might like to keep some of their data out of Google's hands. Using Google Maps while signed out is a good way to do that: You can find new locations of interest without having Google know you're interested in those spots. However, if you like using Google Maps without an account, be warned: The experience is now much more limited. As reported by 9to5Google, Google is now limiting the amount of data visible when accessing Google Maps without an account. This change includes things like images, reviews, restaurants, businesses, hotels, parks—really, most labels on the map. From what I can tell, essential labels like city names and highway identifiers are left intact, but even some street names appear to be omitted when logged out.If you can find restaurants in limited view, you'll see some of the data points that you'd normally find, but you'll also notice a number missing as well. That could include labels noting whether the restaurants supports takeout or delivery, user reviews, popular times, photos and videos submitted by users, menus, as well as related locations. I tested it myself in an incognito window, scrolled randomly over Richmond, VA, and clicked the first (of few) restaurants to appear: Laura Lee's. While I could see the total star rating (4.6), I couldn't actually click through to any reviews. I could also only see the primary image of the restaurant. There's enough here to decide whether or not to call, but it's missing a ton of the data points you'd usually rely on to consider a spot for lunch or dinner.\n\n    \n            \n            \n                                        Credit: Jake Peterson\n                    \n    \nGoogle doesn't necessarily pin the limited view on you being logged out, however. If you check the \"Help\" pop-up that appears here, titled \"Seeing a limited view of Google Maps,\" the company explains that there are a few reasons you might be seeing this view. That could include issues with Google Maps itself, unusual traffic from your computer or network, or browser extensions that might be interfering with Google Maps. Only after it lists these reasons does Google suggest that signing in to Google Maps \"might help you avoid seeing this limited experience again.\"\n            \n                What do you think so far?\n            \n        \nOf course, logging in brings all this data back as you'd expect, and if you always use Google Maps with your Google account, you'll never notice the difference. But it's an interesting line in the sand for Google to draw. How many people who use Google Maps without an account will know this is the reason why their experience just got worse? Perhaps they'll flock to another option, though there aren't many. Apple users have Apple Maps, and there's always Waze—but, surprise, it's owned by Google too.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Maps Now Makes You Log In to See These Key Features",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHVS2XKWGQGY676C8ADR2S3V/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-19T22:30:00.000Z",
      "dateModified": "2026-02-19T22:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch Out for This Phone Delivery Scam",
    "url": "https://lifehacker.com/money/watch-out-for-this-phone-delivery-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ8FCD85D7J1QQF3W610JF0D/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-25T14:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 25, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Table of Contents\n    \n        \n        If you order a new smartphone to be delivered to your home, you may be a target for scammers. Fraudsters are impersonating representatives from mobile carriers, calling customers and claiming that they've been sent the wrong device and need to return it. Obviously, if you follow through, scammers get to keep your phone—they may either to sell it or activate it using your information to perpetrate identity fraud. Scams centered on stealing high-value tech aren't anything new. In addition to regular porch pirating, thieves have been known to knock on doors, posing as couriers or company representatives attempting to recover a \"wrongly delivered\" item. Fraudsters have also used fake Find My alerts to gain access to lost or stolen iPhones. \nHow the phone return scam worksAs an editor at ZDNET experienced, the scam begins shortly after your new phone is delivered. You may receive a call from a spoofed number, and someone claiming to represent your carrier will have specific information like your name, address, and device model. They'll tell you that there's been a mix-up and you need to send your phone back so you can receive a replacement. They may give you instructions to scan a QR code, print a label, and take the package to a shipping drop-off point. In some cases, targets have been promised gift cards for the inconvenience. If you hesitate, scammers may employ a number of pressure tactics to get you to act. They'll tell you that delaying the return could cause issues with your device activation, billing, or warranty. They may continue to call with threats. Like many scams, this one relies on social engineering: it manipulates emotions and instincts to get you to act against your best interest. Fraudsters impersonate a trusted brand and use detailed information about you to make their story more believable. They use timing to their advantage and promote a sense of urgency. \n            \n                What do you think so far?\n            \n        \nThe phone return scam also has similarities to the brushing scam, in which victims receive a package containing merchandise they didn't order so that scammers can write a verified review or boost sales numbers or collect personally identifiable information once you scan a QR code (an added component known as quishing) to learn more about the item. What to do if you get a call about your new phoneThe solution here is to simply hang up. If you are concerned about your account or device, call your carrier directly (use the customer service number from a previous bill or go through the official app) and confirm the mix-up. Don't engage with QR codes or any instructions provided on unsolicited calls. It may be alarming that a scammer has specific details about your order and calls right after your new phone is delivered. Unfortunately, a lot of your personal information is out in the open and available to bad actors, whether as the result of a data breach or some other form of compromise (such as malware that can read notifications). This is a good reason to keep an eye out for other indicators of identity theft and act quickly if you find anything suspicious. \n            \n    \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from our expert team.\n            The Daily NewsletterReady to do everything better?\n                    Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch Out for This Phone Delivery Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ8FCD85D7J1QQF3W610JF0D/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-25T14:30:00.000Z",
      "dateModified": "2026-02-25T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Instagram Will Now Alert Parents If Their Teen Searches for Self-Harm Content",
    "url": "https://lifehacker.com/tech/instagram-alert-parents-teen-self-harm-content?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJDB2XE7CEPX26J9W5S5183J/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-26T16:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Gabriele Maltinti/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Instagram will soon alert parents if their teen repeatedly searches for content related to suicide and self-harm on the platform.\n                                            Parents will receive alerts via email, text, or WhatsApp as well as an in-app notification.\n                                            To receive alerts, parental supervision must be enabled on your teen's account.\n                                    \n            \n    Table of Contents\n    \n        \n        Instagram will soon alert parents if their teen repeatedly searches for content related to suicide and self-harm on the platform. According to an announcement from Meta, these notifications will be available to parents in the U.S., UK, Australia, and Canada who supervise their teen's accounts starting next week. As TechCrunch reports, this feature is being rolled out amid numerous lawsuits over how Meta and other tech companies have failed to protect kids and teens across their platforms. How the new safety alerts workInstagram will use teens' search activity to generate alerts. Searches that are flagged include \"phrases promoting suicide or self-harm, phrases that suggest a teen wants to harm themselves, and terms like ‘suicide’ or ‘self-harm,'\" according to Meta. \nParents will receive alerts via email, text, or WhatsApp as well as an in-app notification. The message lets parents know that their teen has \"repeatedly searched\" for content related to suicide or self-harm and includes resources for supporting teens. Instagram already blocks searches associated with suicide and self-harm, directing users to resources instead. While users can post about their personal experiences, Meta's policies do not allow content that promotes or glorifies these topics, and Instagram hides related content from teens (even if it's from someone they follow). \n            \n                What do you think so far?\n            \n        \nEnable parental supervision on InstagramTo receive alerts, parental supervision must be enabled on your teen's account. Supervision allows parents to set app time limits, enable sleep mode, and monitor and manage things like account settings, followers, accounts followed, content topics searched, and app usage. Parental supervision is available for teens ages 13–17, and teens have to agree to participate. To send a supervision invite to your teen, open the More menu in the bottom-left and click Settings. Select Supervision > Create Invite, review the information, and hit Continue. From here, you can copy the invite to send via any messaging app. Note that teens can decline supervision requests—the feature is opt-in for both parties. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instagram Will Now Alert Parents If Their Teen Searches for Self-Harm Content",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJDB2XE7CEPX26J9W5S5183J/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-26T16:30:00.000Z",
      "dateModified": "2026-02-26T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I Can't Wait to Try Spotify's Newest Playlist Sorting Feature",
    "url": "https://lifehacker.com/tech/i-cant-wait-to-try-spotifys-newest-playlist-sorting-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJDF3VKYEWEM0CD3RYHRS529/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-26T18:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Spotify\n                            \n            \n                Key Takeaways\n                                            Spotify Premium members can now automatically reorder their playlists by BPM.\n                                            The feature is only available in regions where Spotify Mix has launched.\n                                            You might want to make a backup of your playlists before using Smart Reorder on them.\n                                    \n            \n    Table of Contents\n    \n        \n        Spotify's adding a new way to sort playlists for paying subscribers. The feature is called Smart Reorder, and it allows you to automatically sort your songs by BPM (beats per minute) and key. This is great for those who want to gradually bump up the intensity of the songs they listen to.It's worth noting that this feature only works for playlists you've created or those you've mixed using the Spotify Mix feature, which lets you add or customize song transitions like a DJ would. Also, because Smart Reorder is an extension of Spotify Mix, you can't have one without the other. Spotify Mix hasn't yet been launched in all markets where the streaming service is present, including where I live, and as such, Smart Reorder isn't available in those regions yet. It's a shame, because I'm really excited to try it.How to use Smart Reorder in SpotifyIf you're a Spotify Premium subscriber, using the Smart Reorder feature is easy. Just open any of the playlists you've created or mixed, and tap the Edit button above the first song. Scroll to the bottom and select Smart Reorder. Spotify will automatically rearrange your songs by BPM, and you can tap the Save button up top to confirm the changes.\nSmart Reorder should be a very useful feature for people like me, who prefer workout playlists that slowly bump up in intensity. I like to hear high BPM songs towards the end of my gym sessions or runs, but that might not be ideal for everyone. Some types of exercises, such as spin workouts, might be better off switching between high and low BPM songs as the intensity varies, and Smart Reorder wouldn't be great for those use cases. Some users on Reddit also suggested that you should create a copy of your playlists before using Smart Reorder on them, since you can't automatically restore playlists to their original order if you end up not liking the changes after saving them. To duplicate a Spotify playlist, open the playlist and tap the three-dots button above the list of songs. Select Add to other playlist > New playlist, then add a name for the copy and and tap Create. \n            \n                What do you think so far?\n            \n        \nThis is another example of Spotify doing more with its AI DJ feature than Apple Music, where the AutoMix AI DJ feature has been more of a mixed bag for me. At the moment, AutoMix just handles song transitions, and Apple hasn't added any kind of custom playlist reordering to it.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I Can't Wait to Try Spotify's Newest Playlist Sorting Feature",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJDF3VKYEWEM0CD3RYHRS529/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-26T18:30:00.000Z",
      "dateModified": "2026-02-26T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samsung's February Security Patch Is Now Available on These Devices",
    "url": "https://lifehacker.com/tech/samsungs-february-security-patch-is-now-available-on-these-devices?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ8F5V78J9ZCJ51C59GGSJ6T/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-24T19:30:50.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 24, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: tinhkhuong/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Samsung's February security update comes with dozens of patches, and is now available for some Galaxy devices.\n                                            The update is rolling out now to the Galaxy S25 series, as well as the Galaxy Z Flip 7, Z Fold 7, and Z TriFold.\n                                            The update patches 37 flaws, though none of rated \"critical.\"\n                                    \n            \n    Table of Contents\n    \n        \n        This is going to be a big week for Samsung. The company is making some major announcements at Galaxy Unpacked 2026 on Wednesday, revealing the next generation Galaxy S Series devices (which almost assuredly means the Galaxy S26), as well as some new AI updates. In the lead up to this event, Samsung is also now rolling out its latest security updates for its Galaxy devices—at least, some of its devices. What's new with Samsung's February security updateSamsung's February security update contains 37 patches for issues the company discovered since the January update. This time, there are no critical patches, but there are plenty of fixes for \"High\" severity issues. According to SamMobile, 25 of these patches were provided by Google, which fix issues with Android in general, while the other 12 were specific to Samsung to patch issues within its own ecosystem. That includes issues for Emergency Sharing, Knox Guard Manager, Samsung Dialer, Samsung's Settings app, face and fingerprint authentication systems, and the PACM module—things that only apply to Samsung's own OS.     Not all Galaxy phones are getting this update right away. Samsung is kicking things off with its Galaxy S25 series, meaning the Galaxy S25, S25+, and S25 Ultra. It also appears to be rolling out to its latest foldable devices as well, including the Galaxy Z Fold 7, Z Flip 7, and Z TriFold. If you bought Samsung's latest and greatest—at least until the S26 series launches—you'll likely see the update in your Settings app imminently. If your Galaxy device is on the older side (or even one year older than the S25 series), you may need to wait a bit before the patches appear. \nSpeaking of waiting, Samsung started rolling this update out to Korean users first, so if you're in another region, you might not see it right away. But it does seem evident the patch is on its way, especially with Unpacked airing Wednesday.\n            \n                What do you think so far?\n            \n        \nHow to install Samsung's February security updateOnce the security update hits your device, open the Settings app, then choose either Software update or System updates. (This may differ depending on your device.) From here, depending on your carrier, tap either Download and install, Check for system updates, or Check for software updates. The latest update may begin downloading automatically, but if it doesn't, tap Download now. Finally, follow the on-screen instructions to install the update.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung's February Security Patch Is Now Available on These Devices",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ8F5V78J9ZCJ51C59GGSJ6T/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-24T19:30:50.000Z",
      "dateModified": "2026-02-24T19:30:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What to Do When You Can't Feel a Muscle 'Working' While Exercising",
    "url": "https://lifehacker.com/what-to-do-when-you-cant-feel-a-muscle-working-while-exercising?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2H6K85W3TM7XC918QAQHME/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-27T13:00:00.000Z",
    "description": "\n        \n        You've probably heard that you should feel a certain muscle working when you do an exercise. Your biceps should burn a little when y",
    "body": "\n        \n        You've probably heard that you should feel a certain muscle working when you do an exercise. Your biceps should burn a little when you're doing bicep curls, your quads when you're doing squats, and so on. But this isn't an ironclad rule. Sometimes you can get a totally effective workout without feeling any specific muscle at all. So why do so many people tell you to pay attention to feeling the muscle working? Partly because it can be a useful teaching tool to make sure you're doing the exercise right—but that's only true for some exercises. And honestly, another big reason is the influence of bodybuilding lingo and techniques on gym culture in general. Bodybuilders who train for the stage operate with a piece-by-piece mindset: Make sure you're working this muscle and not that one. That's OK if you're trying to fine-tune your physique after years of training, but that approach isn't needed to build muscle in the first place. So here's what you need to know.You may not always feel a muscle, even if it’s workingHere’s the most important thing to know: you don’t have to feel a muscle for it to be working. Say you’re doing a barbell squat. A squat works your quads, your glutes, and a lot of other muscles besides. You may not feel every one of those because when you’re doing a heavy squat, your brain is processing a lot of information. It’s feeling the weight of the bar on your back. It’s remembering the technique cues that you’re trying to focus on. It’s paying attention to your balance as you descend to make sure you don’t tip over one way or another. It’s counting the number of the rep in your head. Maybe sometimes a muscle manages to pipe up with “hey, I’m your quads and I’m kind of hurting right now.” But your brain does not have time to listen to every muscle’s nonsense, any more than a mom making dinner has time to listen to her toddler’s every whine. Your brain is focused on the task at hand: making sure you complete the rep.\nI like to think of some muscles as being “louder” than others. If I’m doing kettlebell swings, I might be more focused on the fact that my forearms are burning (from holding onto the kettlebell) and not feel my glutes working at all. But after 100 swings, hoo boy, you can bet my butt will be feeling like jelly afterward. It just didn’t give me that burning sensation in the moment.When it matters whether you feel the burn, and when it doesn’tSo what should you do if you don’t feel the muscle working? You look for another way to be sure the muscle is working. In the case of the compound exercises mentioned above, the fact that you completed the exercise is all the information you need. Your pullups used your lats. Your kettlebell swings and your squats used your glutes. There’s simply no way around that. Does it ever matter whether you’re feeling the muscle? Yes, it can help if you’re doing isolation exercises. In these exercises, like a bicep curl or a leg extension, you’re trying to focus a movement on one muscle or a small muscle group. You're \"isolating\" that muscle. Your brain is a little more able to focus on the feeling from that one muscle, and isolations are the type of exercise where it may be possible to do a similar movement without working the target muscle. For example, let’s say you’re doing side-lying leg raises to work your hip adductors, particularly the gluteus medius. If you have your hips tilted or your legs angled slightly forward, you may feel the muscles toward the front of your hips working. But if you do the same exercise with your back to a wall, sliding your heel along the wall as your lift your leg, you’ll feel it a lot more in that glute you’re trying to isolate. \n            \n                What do you think so far?\n            \n        \nAs a general rule, for compound exercises (where many muscles are working at once), it doesn’t matter whether you feel the muscle. But if you are doing an isolation exercise, feeling the muscle is helpful feedback to make sure that you are isolating the right muscle.Don't reduce the amount of weight just to feel the muscle workThere’s a lot of bad advice out there, and I’d like to call out one thing specifically: the advice to reduce the amount of weight you’re lifting so that you can feel the muscles better. Sometimes people will say it’s important to build a “mind-muscle connection.” But you don’t have to forgo weight on the bar to build that connection. If you’d like to spend more time feeling the muscle, do some isolation work in your warmups. (These are sometimes called “activation” exercises.) You can also do extra isolation work at the end of your workout just to give those specific muscles a little more volume. It’s important to remember that different parts of your workout have different purposes. If you’re squatting heavy, you need to put some fucking weight on the bar to keep building your strength and your skill at squatting. Often the lifts that make it hardest to feel a muscle are the lifts where that muscle is working the most! So don’t give up on heavy, effective lifts just because you don’t “feel” them as well as isolations or warmups.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What to Do When You Can't Feel a Muscle 'Working' While Exercising",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2H6K85W3TM7XC918QAQHME/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-27T13:00:00.000Z",
      "dateModified": "2026-02-27T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Workout-Ready Beats Earbuds Are $90 Off Right Now",
    "url": "https://lifehacker.com/tech/beats-powerbeats-pro-2-sale-february-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ6WXYTNR13RAG0E9HMJNR6G/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-24T13:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 24, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Woot/Lifehacker \n                            \n    Table of Contents\n    \n        \n        The Beats Powerbeats Pro 2 were designed with workouts in mind, but their $249.99 list price has made them a harder sell unless you really value a locked-in fit. Right now, however, Grade-A refurbished pairs are $159.99 at Woot. For comparison, new units are listed at around $212 on Amazon, and used pairs are about $168. According to price trackers, the previous low was about $179.95, so this dip is roughly $20 below that mark. All told, that’s a $90 discount if you don’t mind a pre-owned device that has been tested and verified to work as intended. Prime members also get free shipping, while non-Prime customers pay a $6 fee. \nThe adjustable ear hooks of these earbuds keep them secure during runs, strength training, or high-impact workouts, and the IPX4 rating means sweat and light splashes won’t cause problems. The sound leans bold, with strong bass that keeps pace with hip-hop and electronic playlists. Active noise canceling reduces background noise at the gym, while transparency mode lets you hear traffic and announcements during outdoor runs. They also pair easily with Apple devices and support features similar to AirPods, though in a design that is more secure for exercise. For more on how these stack up in Apple’s ecosystem, see Senior Technology Editor Jake Peterson’s coverage of the Powerbeats Pro 2 fitness features in iOS 26.\n            \n                What do you think so far?\n            \n        \nSetup is simple, though if you need help with it, you can follow Lifehacker’s guide on how to configure every feature of your Powerbeats Pro 2. Battery life runs about eight to 10 hours per charge, and the case stretches total listening time to roughly 45 hours. That said, the built-in heart rate tracking is not flawless. Our Senior Health Editor, Beth Skwarecki, found it did not always sync reliably, especially when an iPhone was juggling workout apps and music at the same time. There is also no companion equalizer app, so you cannot tweak the sound profile beyond what Beats has tuned.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n            Add to Cart NewsletterShop smarter, save more money.\n                    Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Workout-Ready Beats Earbuds Are $90 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ6WXYTNR13RAG0E9HMJNR6G/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-24T13:30:00.000Z",
      "dateModified": "2026-02-24T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Massive Healthcare Data Breach Is Even Bigger Than Previously Reported",
    "url": "https://lifehacker.com/tech/conduent-healthcare-data-breach?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJAZV0H1A0JR6JGQ71DR88ME/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-26T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: IgorGolovniov/Shutterstock \n                            \n            \n                Key Takeaways\n                                            The data breach itself isn't new—it was initially disclosed in January 2025.\n                                            The breach is now believed to be larger in scale than previously reported.\n                                            It's possibly among the largest to affect healthcare.\n                                    \n            \n    Table of Contents\n    \n        \n        At least 25 million people have had their personal information stolen in a major hack on business services company Conduent. The data breach itself isn't new—it was initially disclosed in January 2025, and Conduent has already notified millions of individuals whose data was compromised in the incident. However, the breach is now believed to be larger in scale than previously reported, possibly among the largest to affect healthcare. Who is Conduent? Conduent is a New Jersey-based business processing outsourcing (BPO) company that provides services like printing, payment, and document and claims processing to state and federal government agencies as well as large commercial and transportation organizations. According to the company's 2025 annual report, these offerings include disbursement of benefits, such as food assistance and child support, and administration of government healthcare programs (like Medicaid). For large corporations, services include workplace and unemployment benefits management. Conduent was spun off from Xerox in 2017 and now employs around 51,000 people worldwide. \nWhat happened with the Conduent breach?In January 2025, Conduent suffered an outage that was later confirmed to be the result of a \"cybersecurity incident.\" The disruption lasted several days, during which agencies across the U.S. were unable to process some benefit payments. While the breach was discovered in January, hackers reportedly gained access to Conduent's systems months earlier on October 21, 2024. The Safepay ransomware gang later took credit for the attack. While Conduent confirmed in April 2025 that client information had been stolen in the breach, it didn't begin notifying affected individuals until October. According to those notices, the compromised data included names, Social Security numbers, dates of birth, health insurance policy information, and medical information. \n            \n                What do you think so far?\n            \n        \nHow many people were impacted by the breach? The scope of the breach continues to grow, but the total number of individuals affected currently sits around 25 million. The greatest impact appears to be in Texas and Oregon, though residents in California, Delaware, Maine, Massachusetts, New Hampshire, and New Mexico have also received notices. (For reference, the total number of users impacted by the 2024 ransomware attack on Change Healthcare is now estimated at 190 million.) What to do if you were affectedIf you receive a notice saying your information was compromised, you should take every precaution to secure your identity: At a minimum, ensure your credit is frozen, and set up a one-year fraud alert on your credit files to prevent someone from applying for credit using your information. None of the notices we've seen have offered any type of credit monitoring or identity theft protection services to affected individuals, but you could utilize these services as well. At this point—given the ubiquity of data breaches and information compromise—you should be keeping a close eye on your credit report and financial accounts at all times to quickly catch anything suspicious. If you do find fraudulent activity, report it to your bank and/or credit issuer immediately, and file an identity theft report. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Massive Healthcare Data Breach Is Even Bigger Than Previously Reported",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJAZV0H1A0JR6JGQ71DR88ME/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-26T15:00:00.000Z",
      "dateModified": "2026-02-26T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Samsung Gaming Monitor Is Nearly 50% Off Right Now",
    "url": "https://lifehacker.com/tech/samsung-odyssey-g50d-gaming-monitor-sale-february-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJCEYTS4D2KH0D0SBYW22KYK/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-26T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        The Samsung Odyssey G50D is currently down to $229.99 on Amazon, marked down from $429.99. That is a big drop, and according to price trackers, it is the lowest price this model has hit. For that money, you are getting a 32-inch screen with 1440p resolution, which is sharper than standard 1080p but not as demanding as 4K. It is designed mainly for gaming, and the headline feature is the 180Hz refresh rate. In simple terms, that means the screen can show up to 180 frames per second. If you play fast games like shooters or racing titles, movement looks smoother and feels more responsive compared to a regular 60Hz display.\nIn real use, it performs well for competitive gaming. Input lag is low, so your actions feel instant. It supports AMD FreeSync and is certified as G-SYNC compatible for NVIDIA graphics cards, which helps reduce screen tearing and stuttering. There is still a bit of blur in very fast scenes, but nothing unusual for a monitor in this price range. You can hit the full 180Hz over DisplayPort with an 8-bit signal. Over HDMI, you are capped at 144Hz. The monitor also does not get bright enough for highlights to stand out, and the local dimming system does little to improve contrast. If you mainly play RPGs or story-driven games in low light and care about deep contrast, this will not impress you. For daytime use or a well-lit room, brightness is strong enough to fight glare.\n            \n                What do you think so far?\n            \n        \nOne area where this monitor surprises is comfort. You can raise or lower it, tilt it, swivel it side to side, and even rotate it vertically. That makes it easy to adjust for long sessions or different desk setups. It also supports VESA mounting if you want to use a monitor arm. Viewing angles are decent, so the image does not wash out when you sit slightly off to the side. Overall, this is a practical gaming monitor. It focuses on speed and size rather than stunning picture quality. If you want smooth gameplay at 1440p without spending a lot, this deal makes sense. If you care more about deep contrast and cinematic visuals, you may want to look at higher-end options.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n            Add to Cart NewsletterShop smarter, save more money.\n                    Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Samsung Gaming Monitor Is Nearly 50% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJCEYTS4D2KH0D0SBYW22KYK/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-26T14:00:00.000Z",
      "dateModified": "2026-02-26T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two New Features in YouTube Premium Lite Just Made the Pricier Tier Unnecessary",
    "url": "https://lifehacker.com/entertainment/youtube-premium-lite-is-now-the-best-option-for-most-people?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KJ8EZBY79VVXD8P569FC2WR6/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-24T21:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 24, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Koshiro K / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        As Lifehacker has previously argued, YouTube Premium is probably the best streaming service for most people. Ads can eat into your free time faster than you might realize, and because YouTube's user-generated videos can be quite short, they're especially annoying there—and blocking them without a paid subscription is tough. YouTube Premium is also a bit pricey as streaming services go, at $14/month. Fortunately, the company also offers a \"Premium Lite\" plan that's much cheaper—and thanks to the recent addition of a few key features, it no longer pales in comparison to a full subscription. In fact, the $8/month YouTube Premium Lite may now be the best paid YouTube tier for most people.YouTube Premium Lite is getting two of the more expensive tier's best featuresStarting today, YouTube Premium Lite now offers both background play and download options on most videos, features that were previously exclusive to a full YouTube Premium plan. The update is currently rolling out, so it might take a little bit for it to reach you, but the change essentially gives you parity with a full YouTube Premium plan on the vast majority of YouTube content. According to YouTube, the company has \"heard feedback about wanting these additional features included in the service,\" which prompted the change.\nNow, for the same $8/month price, you can get most of the full YouTube Premium experience, normally a $14/month value. The only catch? You'll still get ads when streaming music and music videos, hence the \"most videos\" disclaimer. Ads also \"may appear when you search or browse,\" but as for interruptions while watching non-music content? You should be in the clear.\n    \n            \n            \n                                        Credit: YouTube\n                    \n    \nA full YouTube Premium account no longer makes sense for most usersEssentially, unless you're a big YouTube Music user, getting YouTube Premium Lite instead of a full-cost subscription is now a no-brainer. There are a few smaller bonuses you'll be leaving behind, like the ability to \"Jump Ahead\" (instantly skip frequently skipped parts of a video, usually ad reads), but your subscription will also be around half the price. You win some, you lose some.\n            \n                What do you think so far?\n            \n        \nThe only real gap now, at least for me, is for households with lots of different YouTube viewers YouTube Premium Lite still only applies to one profile at a time, so if everyone in your household wants to have their own separate algorithms instead of sharing a profile, you'll need to get YouTube Premium Family, which costs $23/month, giving six people in the same household the benefits of a full YouTube Premium subscription. My husband and I have pretty different viewing habits, so we're unlikely to switch to this cheaper tier any time soon. But if you live alone or you're OK sharing a profile, you might as well save yourself some moolah.Alternatively, you can also still get a YouTube Music Premium plan for $11/month. That removes ads and allows background play and downloads, but only for music and music videos. It's essentially the opposite of YouTube Premium Lite, and faces stiff competition from the likes of Spotify and Apple Music. Personally, I'd just pay the extra for a full YouTube Premium subscription, which has all the same benefits of YouTube Music Premium, but also works for non-music content and only costs $3/month more.Still, while adding new features to Premium Lite is ultimately a discount, it does follow a move from YouTube to block people from accessing background play for free. Perhaps this is Google's attempt at a compromise?\n            \n    \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from our expert team.\n            The Daily NewsletterReady to do everything better?\n                    Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two New Features in YouTube Premium Lite Just Made the Pricier Tier Unnecessary",
      "image": [
        "https://lifehacker.com/imagery/articles/01KJ8EZBY79VVXD8P569FC2WR6/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-24T21:00:00.000Z",
      "dateModified": "2026-02-24T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]