[
  {
    "title": "Yep, Apple Music and Apple TV Are Down",
    "url": "https://lifehacker.com/tech/apple-music-and-apple-tv-are-down?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC51TK4KGMVS7CCNEJNV6HQQ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-10T21:36:56.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Matthew Nichols1/Shutters",
    "body": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Matthew Nichols1/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple is reporting that Apple Music, Apple TV, and Game Center are experiencing outages.\n                                            The outages appear to have started at 2:53 p.m. ET for all affected services.\n                                            The report says that \"some users are affected,\" so these services might not be down on your end.\n                                    \n            \n    Table of Contents\n    \n        \n        If you picked up your iPhone to round out your Apple Music Replay for the year, or turned on your TV to watch a show like Pluribus, you might have noticed something odd: Neither service is working. It's not just you: Apple Music, Apple TV, and Game Center are currently down. That's directly from Apple's \"System Status\" website, which tracks all of Apple's web-based services and identifies which ones may be experiencing problems. While most of Apple's services, like the App Store, Find My, and iMessage, are all \"Available,\" four of these services are experiencing an outage: Apple Music, Apple TV, Apple TV Channels, and Game Center.   If you click on each, you can see the service's full status report:\nApple Music - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Apple TV Channels - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Apple TV - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Game Center - 1 Outage, 1 Resolved IssueOutage: Today, 2:53 PM - ongoingSome users are affectedUsers may be experiencing a problem with this service. Resolved Issue: Today, 8:43 AM - 9:14 AMSome users were affectedUsers may have experienced a problem with this service.It's not clear what is causing the outages, though they all went down at 2:53 p.m.. (Apple doesn't specify, but I imagine that's ET.) This isn't the first time this has happened, of course. In fact, Apple Music was down earlier this year, though it was actually still working for me when Apple said the outage was active. \n            \n                What do you think so far?\n            \n        \nThat appears to be the situation today, as well. Each report says \"some users are affected,\" not all. As it happens, Apple Music is working on my Mac, and I'm able to stream the free pilot episode of Pluribus without issue. Apple will likely get these services back up and running for affected users. In the meantime, if your Apple Music or Apple TV won't cooperate, this is likely the cause. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yep, Apple Music and Apple TV Are Down",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC51TK4KGMVS7CCNEJNV6HQQ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-10T21:36:56.000Z",
      "dateModified": "2025-12-10T21:36:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple’s New iPhone Update Will Make Sure You’ll Never Miss a Reminder Again",
    "url": "https://lifehacker.com/tech/iphone-alarm-for-reminders?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC1HZPG712EAKM1NVA9T5DGC/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-09T15:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Khamosh Pathak\n           ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    \n        \n        Apple’s various apps and utilities are finally starting to talk to each other, and it’s great news for iPhone users. Last year, Apple added the ability to sync Reminders with Calendar, which added time-based reminders directly into your Calendar view—a feature I now regularly use. Now, with iOS 26.2, Apple is finally integrating Reminders with the Alarms app; you'll be able to set an accompanying alarm for any reminder. If, like me, you tend to be forgetful—if you need a reminder for your reminder—this will be a handy feature. The alarm will sound, taking up your entire screen until you dismiss it. And yes, you can snooze it.How to add an alarm to any reminder on your iPhoneTo get started, open the Reminder app, navigate to a task list, and either create a new reminder, or edit it. When you’re adding a date and time, you’ll see a new Urgent toggle. When you enable the Urgent mode, it will turn on an alarm that will go off when the reminder is due. The alarm will trigger even when your iPhone is in silent mode or in a Do Not Disturb Focus mode, so be careful when setting it up.\n\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nWhen you enable this for the first time, you’ll get a connection request for integrating Reminders with Alarms. Here, tap Allow. If you don’t see this popup, or if you’ve dismissed it before, go to Settings > Apps > Reminders, and in the \"Allow Reminders to Access\" section, enable the Alarms toggle.When the reminder is due, you’ll see a full-screen reminder interface, with the reminder up top, and an option to slide to stop (using Apple’s new sliding interface for dismissing alarms, which you can disable if you want). You’ll also see a big blue Snooze button. This will snooze the reminder for nine minutes.\n            \n                What do you think so far?\n            \n        \nWhether you hit the Snooze button or you use the slider to stop the alarm, Apple will add the Reminder to the top of the notifications list, as a Live Activity. You’ll see the reminder, with the snooze duration (if enabled), and the task. To actually complete the task, you’ll have to check it off from the Live Activity or the Reminders app.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nUnlike in the new alarm feature, there’s no way to edit the Snooze duration for reminders, or to disable the slider. If you don’t like the Snooze feature or the two-tap approach to completing reminders, you can switch it out for a Complete button instead. Go to Settings > Apps > Reminders and in the \"Urgent Reminders\" section, enable the Complete from Alarm feature. Now, when the alarm goes off, you’ll see two buttons instead: Slide to Stop and Complete. When you tap Complete, the alarm will disappear, and the task will be marked as Complete.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple’s New iPhone Update Will Make Sure You’ll Never Miss a Reminder Again",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC1HZPG712EAKM1NVA9T5DGC/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-09T15:30:00.000Z",
      "dateModified": "2025-12-09T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This New Android Feature Protects You From a Scam Call While It's Happening",
    "url": "https://lifehacker.com/tech/this-new-android-feature-protects-you-from-a-scam-call-while-its-happening?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBN5YJXM3RYZVHHBB4D420Z3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-04T20:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Google / Hight Photography",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Google / Hight Photography / Shutterstock\n                            \n            \n                Key Takeaways\n                                            Android users in the U.S. will soon have extra protection against scams targeting their financial apps.\n                                            You'll get a pop-up warning that the call is likely a scam with a reminder not to make payments or share personal information and a button to end the call.\n                                            U.S. users will see these protections when trying to access Cash App and JPMorganChase.\n                                    \n            \n    Table of Contents\n    \n        \n        Bank impersonation is a popular scam tactic, and one I've written about a lot. Fraudsters prey on people's fear, confusion, and desire to protect their money, which may lead targets to hand over login credentials, make irreversible wire transfers, or provide other sensitive information without stopping to question their actions. Android users in the U.S. will soon have extra protection against scams targeting their financial apps, preventing threat actors impersonating bank representatives from accessing data on their devices. Google's in-call scam protection is designed to prevent users from sharing their screens with threat actors and help them avoid revealing their banking information. How Android in-call protection worksAndroid's scam protection kicks in if you are on a phone call with a number not saved in your contacts and attempt to open a participating financial app. You'll get a pop-up warning that the call is likely a scam with a reminder not to make payments or share personal information and a button to end the call (and stop screen sharing). There's also a 30-second delay on further action on your device, which Google says is designed to disrupt any sense of urgency. \nNote that financial institutions must opt into in this feature—at this time, Google has specifically named Cash App and JPMorganChase as partners, though it indicates expansion to other popular fintechs and banks. \n            \n                What do you think so far?\n            \n        \nGoogle initially rolled out in-call protections for banking apps to UK users earlier this year as part of a larger package of security features announced ahead of Google I/O. That launch also included real-time scam detection alerts for calls and texts, improved theft protection via remote lock and identity check, key verifier for Google Messages, and device-level Advanced Protection (in addition to account-level settings). Alongside the US pilot, in-call scam protections will now cover most major banks in the UK as well as financial apps in Brazil and India. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This New Android Feature Protects You From a Scam Call While It's Happening",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBN5YJXM3RYZVHHBB4D420Z3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-04T20:30:00.000Z",
      "dateModified": "2025-12-04T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Flying Without a REAL ID Is Soon Going to Cost You",
    "url": "https://lifehacker.com/travel/flying-without-a-real-id-payment-required?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC3B69KRCWXTHYDFCC80KA7Y/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-10T14:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit:  Ivan Marc/Shutterstock \n",
    "body": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit:  Ivan Marc/Shutterstock \n                            \n            \n                Key Takeaways\n                                            The TSA will soon start collecting a $45 fee for travelers who don't have REAL IDs.\n                                            There are other forms of ID that will help you comply with the requirements, such as a passport.\n                                            The $45 fee covers security checkpoint access for up to 10 days, after which you'll have to repeat the process and payment.\n                                    \n            \n    Table of Contents\n    \n        \n        If you don't yet have a REAL ID, you can continue to fly, but it's going to cost you. Beginning Feb. 1, 2026, the Transportation Security Administration (TSA) will start collecting a $45 fee from travelers using non-compliant forms of identification at airport security checkpoints. The agency previously proposed a fee of $18 to cover the administrative and IT costs of ID verification for those traveling without a REAL ID or passport but increased the total to $45 in an announcement released earlier this month. REAL ID requirementsThe 2005 REAL ID Act mandated the standardization of state-issued driver's licenses and identification cards. After multiple delays since 2008, the Department of Homeland Security earlier this year finally began requiring anyone age 18 and over to have a REAL ID-compliant license to clear airport security or enter certain federal buildings. \nTravelers can also comply with the regulations using a U.S. passport, U.S. passport card, DHS Trusted Traveler card, or state-issued Enhanced Driver's License (from Michigan, Minnesota, New York, Vermont, of Washington). Enhanced Tribal Cards, permanent resident and border crossing cards, Department of Defense IDs, and foreign passports are also accepted. \n            \n                What do you think so far?\n            \n        \nYou can still travel without a REAL IDThe vast majority of Americans—94 percent—already have a REAL ID or another accepted form of identification. Those who don't will have to complete an online verification process and pay the $45 fee before they are able to clear airport security. Travelers are being encouraged to do this in advance: If you arrive without approval, you'll be sent out of line to complete the process (which can take up to 30 minutes) before being allowed through. The $45 fee covers security checkpoint access for up to 10 days, after which you'll have to repeat the process and payment. Travelers whose REAL ID or passport has been lost or stolen also have to pay. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Flying Without a REAL ID Is Soon Going to Cost You",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC3B69KRCWXTHYDFCC80KA7Y/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-10T14:00:00.000Z",
      "dateModified": "2025-12-10T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft's Latest 'Patch Tuesday' Update Fixes These Three Zero-Days",
    "url": "https://lifehacker.com/tech/microsoft-patch-tuesday-update-december-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC352X3QRTYWNS7CP2G3NBYA/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-10T14:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Alex Photo Stock/Shutters",
    "body": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Alex Photo Stock/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Microsoft's Patch Tuesday for December addresses 56 flaws in total.\n                                            Windows users should ensure their machines are updated as soon as possible to fix three zero-day vulnerabilities.\n                                            One of the zero-days has been actively exploited, while the other two have been publicly disclosed.\n                                    \n            \n    Table of Contents\n    \n        \n        Microsoft's Patch Tuesday update for December is here, and Windows users should ensure their machines are updated as soon as possible to fix three zero-day vulnerabilities. These are security flaws that are actively exploited or publicly disclosed before the developer releases an official patch. As reported by Bleeping Computer, this month's update addresses 56 bugs in total: 28 elevation-of-privilege vulnerabilities, 19 remote-code-execution vulnerabilities, four information-disclosure vulnerabilities, three denial-of-service vulnerabilities, and two spoofing vulnerabilities. Three of the remote code execution flaws are labeled \"critical.\" Note that these figures do not include updates released for Microsoft Edge and Mariner. Patch Tuesday is typically released on the second Tuesday of every month around 10am PT, so you can anticipate security updates at that time. \nOne of the zero-days patched in December has been actively exploited in the wild, though Microsoft has not shared any details as to how. CVE-2025-62221 is an elevation-of-privilege vulnerability in the Windows Cloud Files Mini Filter Driver, and when exploited, give attackers SYSTEM privileges. The mini filter allows cloud applications, such as OneDrive, access to file system functions. \n            \n                What do you think so far?\n            \n        \nThe other two bugs fixed have been publicly disclosed: CVE-2025-64671 - GitHub Copilot for Jetbrains Remote Code Execution Vulnerability: This flaw, which can be exploited through a Cross Prompt Injection in untrusted files or MCP servers, allows attackers to execute commands locally. According to Krebs on Security, this could trick the LLM into adding malicious instructions in the user's auto-approve settings. CVE-2025-54100 - PowerShell Remote Code Execution Vulnerability: This bug could cause scripts embedded in a webpage to be executed when retrieved using Invoke-WebRequest. CVE-2025-62221 has been attributed to Microsoft Threat Intelligence Center (MSTIC) & Microsoft Security Response Center (MSRC). CVE-2025-64671 was disclosed by Ari Marzuk, while CVE-2025-54100 has been credited to multiple security researchers. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft's Latest 'Patch Tuesday' Update Fixes These Three Zero-Days",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC352X3QRTYWNS7CP2G3NBYA/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-10T14:30:00.000Z",
      "dateModified": "2025-12-10T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NotebookLM Has a New Feature for Visual Learners",
    "url": "https://lifehacker.com/tech/how-to-use-notebooklms-new-infographics-generator-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC2C7Q7BC1AJG0759KMFJ476/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-09T20:30:49.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Google\n                   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Google\n                            \n    Table of Contents\n    \n        \n        Another day, another update to Google's NotebookLM, the versatile AI tool that functions like a personal assistant focused only on you and your needs. The latest update is for visual learners: You can turn your source materials into helpful infographics that give you a clear picture—literally—of what the PDFs, websites, videos, or other materials you're studying or organizing are about. How to use the new NotebookLM infographics featureTo use the new feature, open any of your NotebookLM Notebooks (the name given to folders full of specific materials you've uploaded) and navigate to the panel on the right side. It's the same panel where you find the other offerings like the video creator and flashcard maker.As with those tools, you just tap the associated button to generate the corresponding product, making sure the sources from your left panel that you want to include are all checked off. I tried it out this morning, first using the NotebookLM account associated with my personal Chrome profile and what I'm studying in my private life, then using the one I have set up for work, which has a tester notebook full of materials about how to study for the SAT. (I am strict about using different Chrome profiles for various parts of my life and am now up to seven.) \nIn my personal account, the button was labeled BETA—and it acted like it. After two failed attempts, NotebookLM could not produce an infographic based on my materials. In my work account, though, the beta label was missing and it performed the function just fine, spitting this out:\n    \n            \n            \n                                        Credit: Google\n                    \n    \nThis is rolling out in full functionality to accounts at different times, obviously, but I was glad to see one of mine had easy access because I thought the infographic was solid.\n            \n                What do you think so far?\n            \n        \nWho the infographics feature is helpful forI don't consider myself a visual learner and primarily use NotebookLM to refine ideas or generate educational audio clips I can listen to while I clean the house, so I wasn't expecting to like this. I don't like the mind map creator within NotebookLM at all, for instance; flowcharts just aren't how I learn best, and that's fine. But the infographic was concise, engaging, and just detailed enough to keep me interested and looking at it. It's unlikely I'll use this to study or refine my work often, but I can absolutely see how it would be useful to someone who learns more visually, especially if all the lines and boxes of a mind map can get too convoluted to be useful.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NotebookLM Has a New Feature for Visual Learners",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC2C7Q7BC1AJG0759KMFJ476/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-09T20:30:49.000Z",
      "dateModified": "2025-12-09T20:30:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The AirPods Pro 3 Are Now Under $200 for the First Time",
    "url": "https://lifehacker.com/tech/airpods-pro-3-sale-december-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC7JV9CXW41K0CXPP1A8VSDF/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-11T21:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Rene Ramos.\n                            \n    Table of Contents\n    \n        \n        The latest AirPods Pro are a big step up from the first generation buds. The third (and newest) generation comes with OTA updates that the AirPods Pro 2 also got to enjoy—but considering the second and third generations are the same price right now, why not go with the newer version? If you want the latest Apple has to offer, this is a great time to do so. The AirPods Pro 3 are down to $199 (originally $249.99) for the first time since their September release—the lowest price yet, according to price tracking tools.\nThe AirPods Pro 3 improve on already great premium earbuds with new features (like a heart rate sensor) without increasing the list price. You'll get Personalized Spatial Audio (so you can hear sounds seemingly coming from different directions as you move your head) and the ability to use head gestures to tell Siri \"yes\" or \"no\" (this also works for answering or denying calls). Apple added a live translation feature to both the second- and third-generation AirPods Pro when iOS 26 rolled out earlier this year. You'll also get features like Conversation Awareness, which lowers your music volume when your AirPods detect that you're talking to someone; Transparency Mode, which lets you better hear your surroundings while your earbuds are in; and Adaptive Audio, which combines ANC and Transparency mode to adjust ANC levels based on the noise around you.\n            \n                What do you think so far?\n            \n        \nSince these are in-ear earbuds (as supposed to regular earbuds like the AirPods 4) the ANC is much better since it naturally blocks out the noise with a tight seal, but the ANC technology itself has also improved—as has the sound quality, thanks to the new H3 chip, as PCMag detailed in its \"exemplary\" review. You can expect about eight hours of juice, depending on your usage, and another 24 hours from the charging case. \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The AirPods Pro 3 Are Now Under $200 for the First Time",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC7JV9CXW41K0CXPP1A8VSDF/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-11T21:00:00.000Z",
      "dateModified": "2025-12-11T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney Will Now Let You Make AI Slop of Its Characters on Sora",
    "url": "https://lifehacker.com/tech/disney-and-openai-are-partnering-on-ai-slop?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC72R3XE3XTEEXZRCBF450S8/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-11T17:30:54.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n            Credit: Robert Way/Shutterstock\n ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n            Credit: Robert Way/Shutterstock\n                            \n            \n                Key Takeaways\n                                            OpenAI announced a partnership with Disney on Thursday that will let Sora users generate videos featuring more than 200 Disney characters.\n                                            Sora users will be able to make videos featuring characters like Mickey Mouse, Luke Skywalker, and Mufasa, without any copyright infringement.\n                                            Sora users have already made fake Disney videos that are wildly offensive, and this may only add fuel to the fire.\n                                    \n            \n    Table of Contents\n    \n        \n        If you've engaged in any sort of doomscrolling over the past year, you've no doubt encountered some wild AI-generated content. While there are plenty of AI video generators out there producing this stuff, one of the most prevalent is OpenAI's Sora, which is particularly adept at generating realistic short-form videos mimicking the content you might find on TikTok or Instagram Reels. These videos can be so convincing at first glance, that people often don't realize what they're seeing is 100% fake. That can be harmless when it's videos of cats playing instruments at midnight, but dangerous when impersonating real people or properties. It's that last point that I thought would offer some pushback to AI's seemingly exponential growth. These companies have trained their AI models on huge amounts of data, much of which is copyrighted, which means that people are able to generate images and videos of iconic characters like Pikachu, Superman, and Darth Vader. The big AI generators put guardrails on their platforms to try to prevent videos that infringe on copyright, but people find a way around them. As such, corporations have already started suing OpenAI, Google, and other AI companies over this blatant IP theft. (Disclosure: Lifehacker’s parent company, Ziff Davis, filed a lawsuit against OpenAI in April 2025, alleging it infringed Ziff Davis copyrights in training and operating its AI systems.)Disney is handing its characters over to Sora users  But it seems not all companies want to go down this path. Take Disney, as a prime example. On Thursday, OpenAI announced that it had made a three-year licensing agreement with the company behind Mickey Mouse. As part of the deal, Sora users can now generate videos featuring over 200 Disney, Marvel, Pixar, and Star Wars characters. The announcement names the following characters and movies specifically:\nMickey MouseMinnie MouseLiloStitch ArielBelleBeastCinderellaBaymaxSimbaMufasaBlack PantherCaptain AmericaDeadpoolGrootIron ManLokiThorThanosDarth VaderHan SoloLuke SkywalkerLeiaThe MandalorianStormtroopersYodaEncantoFrozenInside OutMoanaMonsters Inc.Toy StoryUp ZootopiaThat includes licensed costumes, props, vehicles, and environments. What's more, Disney+ will host a \"selection\" of these \"fan-inspired\" Sora videos. (I'll admit, that last point genuinely shocks me.) This does only apply to Disney's visual assets, however, as Sora users won't have access to voice acting. ChatGPT users will also be able to generate images with these characters, so this news doesn't just affect Sora users.You might think OpenAI is paying Disney a hefty licensing fee here, but it appears to be quite the opposite. Not only is Disney pledging to use OpenAI APIs to build \"products, tools, and experiences,\" it is rolling out ChatGPT to its employees as well. Oh, and the company is making a $1 billion equity investment in OpenAI. (Is that all?)\n            \n                What do you think so far?\n            \n        \nI know many companies are embracing AI, often in ways I disagree with. But this deal is something else entirely. I'm not sure any Disney executives actually searched for \"Sora Disney\" on the internet, because right now, you'll find fake AI trailers for Pixar movies filled with racism, sexual content, and generally offensive content—all generated using an app Disney just licensed all of its properties to. OpenAI asserts in its announcement that both companies are committed to preventing \"illegal or harmful\" content on the platform, but Sora users are already creating harmful content. What kind of content can we expect with carte blanch access to Disney's properties?Now that Disney's characters are fair game, I can't imagine the absolute slop that some users are going to make here. The only hope I have is in the fact that Disney+ is going to host some of these videos. Staff will have to weed through some garbage to find videos that are actually suitable for the platform. And maybe seeing the \"content\" that Sora users like to make with iconic characters will be enough for Disney to rethink its plans.     \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney Will Now Let You Make AI Slop of Its Characters on Sora",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC72R3XE3XTEEXZRCBF450S8/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-11T17:30:54.000Z",
      "dateModified": "2025-12-11T17:30:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The AirPods 4 With (and Without) ANC Are Under $100 Right Now",
    "url": "https://lifehacker.com/tech/anc-airpods-4-sale?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNBQGX6AE1DJEGPMS0JKN4E/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-11T19:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Zain Awais and product image courtesy of Amazon.\n                            \n    Table of Contents\n    \n        \n        The latest AirPods 4 have dropped to a record low price, according to price-tracking tools, and they've been selling out on Amazon consistently. But if you haven't had a chance to snag one up, Walmart has the AirPods 4 (without active noise cancelling, aka ANC) for $74 (originally $129.99), the cheapest they've ever been, and the ANC AirPods 4 for $99 (originally $179.99).\nThe AirPods 4 have updated USB-C charging. Both models (the ANC and non-ANC) are powered by Apple's H2 chip, so you'll get Personalized Spatial Audio (so you can hear sounds seemingly coming from different directions as you move your head) and the ability to use head gestures to tell Siri \"yes\" or \"no\" and answer calls. Apple added a live translation feature to the ANC model when iOS 26 rolled out earlier this year.The biggest difference if you choose to go with the non-ANC is that you'll miss out on the charging case with a built-in speaker, which you can use with Find My to locate it if you lose them. You'll also miss features like Conversation Awareness, which lowers your music volume when your AirPods detect that you're talking to someone; Transparency Mode, which lets you better hear your surroundings while your earbuds are in; and Adaptive Audio (combines ANC and Transparency mode to adjust ANC levels based on the noise around you).\n            \n                What do you think so far?\n            \n        \nBoth versions are rated IP54 for dust and water resistance, offer up to five hours of listening per charge (up to 30 hours with the charging case), and can handle automatic switching with your other Apple devices. You can read more about the non-ANC AirPods in PCMag's \"excellent\" review, and more about the ANC AirPods in PCMag's \"outstanding\" review.\n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The AirPods 4 With (and Without) ANC Are Under $100 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNBQGX6AE1DJEGPMS0JKN4E/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-11T19:30:00.000Z",
      "dateModified": "2025-12-11T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Maps Will Now Automatically Save Your Parking Spot on iPhone",
    "url": "https://lifehacker.com/tech/google-maps-can-automatically-save-your-parking-spot-on-iphone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC4PQH94245NM1ES0TAZG1CE/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-10T20:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: DenPhotos/Shutterstock\n  ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: DenPhotos/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google Maps can automatically save your parking location when you stop your car—if you have an iPhone.\n                                            This feature is being reported as new, when it appears some users have had it for \"years.\"\n                                            Whether or not the feature rolled out recently, it is only available on iOS: Android users still need to mark their parking locations manually.\n                                    \n            \n    Table of Contents\n    \n        \n        Forgetting where you parked your car isn't just a sitcom trope—though it does make for classic TV. Even in the age of the smartphone, it's all too easy to walk away from your car and retain zero memory of where you left it. As it happens, Google Maps has a solution—provided you have an iPhone. So long as you're running the app on an Apple device, Google Maps can automatically remember where you parked and display that information on the map. There's no need to mark the location yourself, tell the app to save your spot, or take a picture of the cross streets in case you forget: You can simply glance at the screen to find a \"You parked here\" label. The thing is, while some are reporting this feature is relatively new to them, others suggest it's been out for a while. What gives?   \nHow Google Maps automatically saves your parking location on iOSThis feature works if you connect your iPhone to your car, whether via Bluetooth, CarPlay, or a USB cable. When you disconnect your iPhone from your car, Google Maps will assume you've parked, and will automatically mark that location on the map. The feature will also work if you give Google Maps permission to access your Motion & Fitness data, which allows the app to tell when you've started and stopped driving. (You can check on this setting from Google Maps' in-app settings: Head to Navigation, then, under \"Automatically save parking,\" tap Let maps use your motion to save your parking.)You can also choose to set Google Maps' location permissions to \"Always,\" which gives the app persistent access to your location data, and also lets it figure out when you've stopped your car. You can change this option on your iPhone by navigating t0 Settings > Privacy & Security > Location Services > Google Maps.Is this feature actually new?This feature is genuinely great, and I'm happy Google Maps supports it—even if Android users are inexplicably being excluded for now. But you might also be wondering to yourself, wasn't this already a feature? It doesn't sound all that new. Yet you might have even seen a flurry articles like this one today, all reporting on this \"new\" Google Maps parking feature. As it turns out, the answer is a bit complicated. The coverage today all references this announcement on LinkedIn from Google Maps senior product manager Rio Akasaka—only that post is, according to LinkedIn, a month old. Some of the comments are more recent, but others appear to be from the original posting date. \n            \n                What do you think so far?\n            \n        \nPotentially adding to the confusion, other navigation apps, like Apple Maps, already support automatically saving your parking spot, and while Google Maps has also had an option to save your parking spot for some time, it previously wasn't automatic. If you wanted the app to remember where you stopped, you needed to tap your blue dot on the map and choose \"Save your parking.\" That's how it still is on Android, since the automatic feature only works on iOS. Looking through the comment sections on articles from outlets like The Verge or MacRumors, some users insist they've had this feature for some time—well before that month-old LinkedIn announcement. This commenter says they've had the feature for years, while this one claims they've had it for \"ages.\" So what gives? Have at least some iPhone users have had this feature for years? It is possible Google has been testing out the feature with smaller subsets of users and only recently rolled it out en masse, but whether or not that actually happened is unclear at this time. I've reached out to Google for clarification about the timeline of this feature's implementation, and I will update this article if I get an answer. Until then, I can only hope Google is actively working on rolling out the feature to Android, as that really would be something new.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Maps Will Now Automatically Save Your Parking Spot on iPhone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC4PQH94245NM1ES0TAZG1CE/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-10T20:30:00.000Z",
      "dateModified": "2025-12-10T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Harness the 'Hawthorne Effect' to Get More Done",
    "url": "https://lifehacker.com/work/use-hawthorne-effect-to-increase-productivity?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HSKHG1PRJX6PV8BV9H4VCFV9/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-10T13:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: bbernard / Shutterstock.c",
    "body": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: bbernard / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        There’s a fine line between being micromanaged and overly surveilled and being monitored enough that you get good work done. That line is actually called the Hawthorne Effect, and it’s a phenomenon in which people are more productive when they feel they’re being observed. If you’ve ever noticed you push yourself a little more when you’re working out in a full gym or group fitness class than when you’re working out alone, you already get the concept, but it can be applied to all kinds of scenarios to make you more productive—even if you’re not actually being observed. What is the Hawthorne Effect?This phenomenon is said to have been discovered during some research conducted at the Hawthorne Western Electric Plant, though there’s some debate on whether that’s true. What isn’t up for debate is the behavior trend itself: When someone is participating in an experiment, they may tend to work a little harder than normal, knowing they’re being watched. Even outside of experiments, an awareness of being observed or monitored can spur a little productivity boost. Researchers and social scientists have spent decades trying to figure out if the Hawthorne Effect, as described in early research, is real or not, but it’s still a concept that has been noted and studied for a long time—and to which you may relate. Consider your childhood: You probably cleaned your room a little more diligently when your mom was standing in the doorway glaring at you than if she just told you to go do it. Not everyone performs better under the watchful eye of someone else, but if you’ve found that you do better work when you have regular check-ins with a boss, stay more focused when you know your time is being monitored, become the master of your maps app when you and your friends are lost, or spring into action when colleagues are looking for a leader, you could benefit from tapping into the Hawthorne Effect. \n            \n                What do you think so far?\n            \n        \nPutting the Hawthorne Effect to useYou can’t really make yourself be observed, right? You can’t ask your boss to monitor you all the time, for instance, but there are a few ways you can create the feeling of being watched or checked in on and harness it to be more productive. If you want to try to incorporate some of the Hawthorne Effect into your own life, try these ideas:Request regular check-ins with your manager, even if they’re just weekly, 10-minute chats. Adding structured, scheduled conversations to your week will enhance the feeling that they’ll be expecting to hear about your recent work and results. Find an accountability partner. This could be a coworker, classmate, roommate, or anyone who is working on something similar to what you’re doing. Check in with them regularly, again on a set schedule, and always be prepared to update them on your progress.Use apps that can give you a feeling of being tracked, at least when it comes to your goals. Here’s a list of apps that can serve the purpose, whether you’re looking for a virtual accountability buddy or even one that acts as a demanding “boss,” sending you messages demanding proof of your progress. I use Finch, an app that forces me to check off to-do list items so I can buy little outfits for a pixelated bird avatar. Even the feeling that the app is monitoring me—which it is, by awarding me streaks and points when I complete tasks—motivates me. Whatever works!Work somewhere with other people around you, like a coffee shop or communal workspace, if you aren’t in the office. This actually works great for me, as I find it embarrassing to zone out or scroll social media if I’m working from a coffee shop. Logically, I realize no one there actually cares what I’m doing, but illogically, I still want to appear productive in front of strangers.Take group fitness classes. I teach spin classes and take my colleagues' various class formats multiple times per week in addition to working out on my own, and I know from experience that it is truly motivating to be surrounded by other people. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Harness the 'Hawthorne Effect' to Get More Done",
      "image": [
        "https://lifehacker.com/imagery/articles/01HSKHG1PRJX6PV8BV9H4VCFV9/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-10T13:30:00.000Z",
      "dateModified": "2025-12-10T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use the Pareto Principle to Prioritize Your To-Do List",
    "url": "https://lifehacker.com/work/what-is-the-pareto-principle?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HRQFZ84MZKSHF8S033MW3BFQ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-09T13:00:07.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Diego Cervo/Shutterstock\n ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Diego Cervo/Shutterstock\n                            \n    Table of Contents\n    \n        \n        It’s likely you’ve heard of the Pareto principle (maybe even while reading my tips on how to be more productive at work or study more effectively). But do you really know what the Pareto principle is? To be honest, I only just started to get a grip on it  fairly recently, because it's a lot easier to read about than put into practice. Also known as the 80/20 rule or the law of the vital few, it can be little confusing at first, but understanding and implementing it can truly transformative, helping you to better manage your time and get more done with less effort. Who doesn't want that?What is the Pareto principle?Basically, the Pareto principle states that 80% of your outcomes result from just 20% of your effort. The principle was coined by consultant Joseph M. Juran in the 1940s and he named it after a sociologist and economist named Vilfredo Pareto, who was famous for pointing out that 80% of the land in Italy was owned by 20% of the total amount of people. You’ll hear it described a number of ways: 80% of results come from 20% of the work, or 80% of effects come from 20% of the causes. No matter the wording, it all means the same thing; just focus on that 80/20 split.\nAn often-cited example of how this works for everyday people is learning the piano or guitar. You study individual notes, keys, time signatures, tempos, chords, rhythms, styles and so much else, including music theory. But when it’s time to jam, you’re probably falling back on a handful of the most common chords—and it sounds fine. In that way, a huge chunk of your actual playing is dependent on just a few small things you've mastered (although you do need that knowledge of keys and styles to make it come together). For another example, consider how a few truly excellent players tend to be responsible for the majority of points scored by your favorite sports team during a given game. Now think of how much you do in a day: You go to your job, work any side gigs you might have, do household chores, and devote time to hobbies, child-rearing, studying for classes, going to the gym, and seeing friends. You do a lot, but you only get paid for a small fraction of that work, which is why you might prioritize your job over some of the other things on the list—even side hustles, which typically generate less money. That's where the 80/20 rule comes in: It helps you prioritize your to-do list. \n            \n                What do you think so far?\n            \n        \nHow to use the Pareto principle to maximize your resultsYou can identify ways the general principle manifests in your work. For instance, if you work for a retail company, you might notice a major chunk of profits comes from a small but dedicated group of consistent buyers. It would make sense, then, to focus a majority of your work on appealing to them, or to bringing others into that group—maybe by strategic, data-based advertising. If the majority of would-be consumers ignore your email marketing, don't keep doing what you're doing. Instead, zero in on how you can add more people to that core group, or just go all-in on the core group itself. The real trick to using this principle is figuring out how it applies to your own day-to-day tasks. When you make your daily to-do list, use a prioritization technique, like the 1-3-5 list, Kanban, or Eisenhower Matrix. Right off the bat, this helps you figure out which of your necessary tasks for the day are important and which can be pushed off or delegated. Spend about two weeks working on your to-do lists every day as normal, but at the end of the day, write down what the direct results of each activity were. So, if you spent half an hour responding to emails and netted 10 new clients from that, write it down. If you dedicated an hour to compiling the data for a big meeting that got your project greenlit, mark it down. Over time, the basic functions that yield the biggest results will become apparent and you can start making those activities—the 20%-of-your-effort activities—a bigger priority, so you waste less time on the tasks that don’t produce as many results. Working backward and considering the effects, then identifying their causes, will help you prioritize and get more done, but it can also help you with non-work tasks. In a more abstract sense, a relatively small amount of effort is required to grab a coffee with a friend or help your kid with homework, but the 80% yield might be reenforcing and maintaining a friendship or helping your child feel safe and accomplished, which have longer-lasting impacts than the 30 minutes those tasks take. When you free up your working time through prioritization and an understanding of the Pareto principle, you have more opportunities to spread it around in other areas of your life and keep reaping the benefits. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use the Pareto Principle to Prioritize Your To-Do List",
      "image": [
        "https://lifehacker.com/imagery/articles/01HRQFZ84MZKSHF8S033MW3BFQ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-09T13:00:07.000Z",
      "dateModified": "2025-12-09T13:00:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Will Fix Your Pixel’s Broken Display for Free (If It Qualifies)",
    "url": "https://lifehacker.com/tech/google-will-fix-pixel-broken-display-for-free-if-it-qualifies?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC1X6QJ222BT0E57J35XZQXA/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-09T17:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Karlis Dambrans/Shuttersto",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Karlis Dambrans/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is launching a new Extended Repair Program for Pixel 9 Pro devices with specific display issues.\n                                            Pixel 9 Pro and 9 Pro XL units with a vertical line running from the top of the display to bottom qualify.\n                                            Your Pixel 9 Pro and 9 Pro XL device also qualifies if the display flickers.\n                                            The Pixel 9 Pro Fold has a repair program too, though Google does not specify what issues it covers.\n                                    \n            \n    Table of Contents\n    \n        \n        Smartphone display issues are nothing new. Most of us have dropped our phones the wrong way one time or another, and had to deal with the pain (and cost) of getting them fixed. But when your smartphone's screen starts acting up for no particular reason, it's pretty frustrating—especially if the manufacturer still holds you accountable for the repair fees. If that sounds like your experience with your Pixel 9 Pro, Pixel 9 Pro XL, or Pixel 9 Pro Fold, there's good news: Google is now launching an Extended Repair Program for the Pixel 9 Pro line. According to Google's announcement on Monday, the company has identified a \"limited number\" of Pixel 9 Pro and Pixel 9 Pro XL units that might exhibit display issues that impact the user's experience with the device. Should your Pixel 9 Pro's display show these symptoms, Google will fix the display at no cost to you.  What it takes for your Pixel 9 Pro to qualifyThat doesn't mean any and all display issues on your Pixel 9 Pro device qualify here. Google has identified two specific problems that this Extended Repair Program actually covers. The first is a vertical line present on the display. The line has to run from the bottom of the screen to the top, so partial lines won't quality. The second is display flicker. If you notice your Pixel 9 Pro's display quickly getting brighter and darker, as if someone was flicking a switch back and forth, you qualify for the repair program. \nThe Pixel 9 Fold is another story altogether. Like the 9 Pro and 9 Pro XL, Google is offering a free repair program for the 9 Pro Fold. However, unlike the other devices, there are no specific issues identified here. The problems may be display-related, but since the company won't specify, you could bring your 9 Pro Fold in for just about anything that's going wrong with it—as long as you didn't cause the issue yourself. In addition, Google won't actually fix your foldable, but will instead replace it entirely. The company is also being strict regarding the quality of the display outside of these issues across all Pixel 9 Pro devices. If your Pixel's display or cover-glass is cracked, that may disqualify you from the free repair. If Google finds liquid damage in your device, same story. In any of these cases, the company will still fix the display issues mentioned above, but they might charge you for it.    \n            \n                What do you think so far?\n            \n        \nHow to get your Pixel 9 Pro fixedAffected Pixel 9 Pro, 9 Pro XL, and 9 Pro Fold units qualify for repair as of Dec. 8, and coverage will last for three years after the original purchase date of the device. You will need to have your device inspected at a Google walk-in center, Google-authorized center, or an online repair store before the company can confirm eligibility. You can get started on your claim from Google's official repair site. This is good news for any Pixel 9 Pro users who have these specific issues—or any issues at all for Pixel 9 Pro Fold users. It joins a host of other Extended Repair Programs for Pixel devices, including the Pixel 4a battery program, the Pixel 6a battery program, the Pixel 7a repair program, and the Pixel 8 repair program, \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Will Fix Your Pixel’s Broken Display for Free (If It Qualifies)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC1X6QJ222BT0E57J35XZQXA/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-09T17:00:00.000Z",
      "dateModified": "2025-12-09T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Will Now Let You Virtually Try on Clothes With Just a Selfie",
    "url": "https://lifehacker.com/tech/google-virtually-try-on-clothes-with-selfie?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC7MXWH4N3KCDYTMB9DBREC0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-11T22:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n            Credit: Google/YouTube\n          ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n            Credit: Google/YouTube\n                            \n            \n                Key Takeaways\n                                            Google's feature that lets you try on clothes virtually now works with just a selfie.\n                                            The feature uses Google's AI image model, Nano Banana, to generate a full-length avatar from your photo.\n                                            There are guardrails in place to stop people from using selfies of celebrities or children, but not of selfies of other people.\n                                    \n            \n    Table of Contents\n    \n        \n        The pace of AI technology is so rapid, it's tough to keep up with everything. At Google I/O back in May, Google rolled out an AI-powered shopping feature that let you virtually try on clothes you find online. All you needed to do was upload a full-length photo of yourself, and Google's AI would be to dress you up in whatever article of clothing you liked. I still can't decide whether the feature sounds useful, creepy, or a little bit of both.  Google's virtual try on feature only needs a selfie to workWhat I can say, however, is that the feature is getting a little creepier. On Thursday, Google announced an update to its virtual try on feature, that takes advantage of the company's new AI image model, Nano Banana. Now, you don't need a full-length photo of yourself: just a selfie. With solely a photo of your face, Nano Banana will generate a full-length avatar in your likeness, which you can use to virtually try on your clothes.I'm not exactly sure who this particular update is for: Maybe there are some of us out there who want to use this virtual try-on feature, but don't have a full-length photo of ourselves to share. Personally, I wouldn't really want to send Google my photo—selfie or otherwise—but I don't think I'd prefer to have Google infer what I look like from a photo of my face alone. I'd rather just send it the full photo, and give it something to actually work off of.  \nHere's the other issue: While Google asks you to only upload images of yourself, it doesn't stop you if you upload an image of someone else. Talk about creepy: You can upload someone else's selfie and see how they look in various clothes. There is a system in place to stop you from uploading certain selfies, like celebrities, children, or otherwise \"unsafe\" items, but if the system fails, this feature could be used maliciously. I feel like Google could get around this by verifying the selfie against your Google Account, since you need to be signed in to use the feature anyway. \n            \n                What do you think so far?\n            \n        \nHow to upload a selfie to Google's virtual try on featureIf you are interested in trying the feature out—and, subsequently, trying on virtual clothes with your AI-generated avatar—you can head over to Google's try on feature, sign into your Google Account, and upload your selfie. When it processes, you choose one of four avatars, each dressed in a different fit, to proceed. Once through, you can virtually try on any clothes you see in the feed. Again, I see the potential usefulness of a feature that lets you see what you might look like in a certain piece of clothing before buying it. But, at the same time, I think I'd rather just order the item and try it on in the comfort (and privacy) of my own home.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Will Now Let You Virtually Try on Clothes With Just a Selfie",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC7MXWH4N3KCDYTMB9DBREC0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-11T22:00:00.000Z",
      "dateModified": "2025-12-11T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Happened to the iPhone 17 Pro’s Portrait Night Mode?",
    "url": "https://lifehacker.com/tech/iphone-17-pro-portrait-night-mode-missing?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNG47316RZ18KQCY4V2BFM8/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T22:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Hadrian/Shutterstock\n     ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Hadrian/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple's latest iPhone 17 Pro models are missing a feature found in the last five generations of Pro iPhones.\n                                            For some reason, you can no longer take Portrait mode shots with Night mode—though Night mode itself still works for standard shots.\n                                            Apple has not disclosed why this feature is missing.\n                                    \n            \n    Table of Contents\n    \n        \n        New products tend to add features, not take them away. That isn't always the case with Apple, however. The company has a long history of removing functions from one generation of devices to the next, whether that's removing the disc drive from its MacBooks back in 2012, or taking away the iPhone's Home button in 2017. Some of these changes are good, some are controversial, while others are undone altogether: MagSafe and HDMI both found their way back to MacBooks after all.It's not often I hear about Apple removing software features from one generation of product to the next, however. So, imagine my surprise when I saw a number of headlines this morning asserting that the iPhone 17 Pro, Apple's latest and greatest flagship, is missing a feature found in the last five generations of Pro iPhones—and nobody noticed for nearly three months. Night mode is missing from Portrait mode on the iPhone 17 Pro and 17 Pro Max. The short answer? We have no idea. This was not something Apple announced publicly, of course. In fact, Macworld spotted the change in an Apple support doc: If you scroll down to the section where it says \"On supported models, you can take Night mode photos with Portrait mode,\" and click the hyperlink on \"On supported models,\" you'll pull up a list of iPhones that, mysteriously, doesn't include the 17 Pro or 17 Pro Max. The list includes:\niPhone 12 ProiPhone 12 Pro MaxiPhone 13 ProiPhone 13 Pro MaxiPhone 14 ProiPhone 14 Pro MaxiPhone 15 ProiPhone 15 Pro MaxiPhone 16 ProiPhone 16 Pro Max For the uninitiated, Night mode and Portrait mode are technically two distinct features. Portrait mode was released first, all the way back on the iPhone 7 Plus, which utilized the dual-camera system to add a bokeh effect to shots of people. Those early shots were hit or miss, and were often no replacement for a true DSLR, but as Apple's tech and cameras have improved, so has Portrait mode. Part of the improvement was the introduction of Night mode. This feature, which Apple was a bit late to the game on, allowed you to take brighter images in low-light environments by lengthening the time the shutter stays engaged. Older iPhones without the feature would take images that were hard to see without the flash engaged, but Night mode could pull in details as long as there was just enough light present in the scene. Since the iPhone 12 Pro, Portrait mode came with the option of Night mode, as well. If you're trying to take a portrait shot in a dark environment, Night mode kicks in and gives the image a chance to turn out brighter and more detailed. But now, it seems, the 17 Pro and 17 Pro Max do not have this option. \n            \n                What do you think so far?\n            \n        \nTo be clear, these new iPhones still have Night mode: Per that previously mentioned support page, you can take brighter shots at night when taking standard photos, selfies, and time-lapse videos. It just seems Apple decided to remove the feature for Portrait mode shots on its latest Pros.Of course, this news started breaking on Dec. 3, nearly three months after the 17 Pros launched. If it took this long for someone to notice a missing feature, was it really all that important to begin with? I don't have a 17 Pro, so I really can't say, but I also can't say I take many Portrait mode shots in dark environments. I've reached out to Apple for comment, and will update this story if I hear back. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Happened to the iPhone 17 Pro’s Portrait Night Mode?",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNG47316RZ18KQCY4V2BFM8/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T22:00:00.000Z",
      "dateModified": "2025-12-04T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]