[
  {
    "title": "wBlock Is the Best Way to Block Ads on Safari",
    "url": "https://lifehacker.com/tech/wblock-ad-blocker-for-safari?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAKYB7B9MFSGKFGQQQY6FZD3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-21T21:00:51.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n            Credit: Justin Pot\n              ",
    "body": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        Want to block ads on your Mac, iPhone, or iPad? wBlock is quickly becoming my favorite solution: it's free, open source, fast, and customizable.Ad blocking is in a weird place. Google, the company that makes more money from advertising than any other on Earth, is actively working to make ad blockers worse on Chrome while it also makes it harder to block ads on YouTube. Basically, it's a good time to not use Chrome.So it's nice that Apple users have another choice: Safari. And, as luck would have it, Safari has an extremely efficient API for ad blocking built right in. The ad blocker wBlock uses this, and the result is ads are blocked in a way that doesn't slow down your browsing.\nI wrote a few months ago about uBlock Origin for Safari, which doesn't use Apple's native blocking feature. I enjoyed how effective that application was at blocking ads, but over time I've found it does impact the performance of my browser a little. After setting up wBlock, everything feels snappy.You can install wBlock from the App Store on your Mac, iPhone, or iPad. After doing so, you can choose which filter lists you want to use. Several are offered, or you can just stick with the defaults.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nYou will also be asked if you want to enable any userscripts. The ones offered bring back YouTube's old interface and bypass paywalls. You can also install custom userscripts, if you want, meaning you won't need a separate application for that functionality.After that, you'll need to open Safari, head to the settings, and turn on all the wBlock entries you see on the extensions page. Do that and you should be able to browse the web without any ads.If you're curious about how this extension works and how it compares to other Safari ad blockers, I recommend checking out the documentation on Github—it goes over how this tool works and how it differs from other applications. I also encourage you to think about the pros and cons of blocking ads overall.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "wBlock Is the Best Way to Block Ads on Safari",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAKYB7B9MFSGKFGQQQY6FZD3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-21T21:00:51.000Z",
      "dateModified": "2025-11-21T21:00:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Directly Import Apple Music Playlists to Spotify",
    "url": "https://lifehacker.com/tech/transfer-apple-music-playlists-spotify?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAKW6VSX2VJRC9Q8XKYBVB9A/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-21T20:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n            Credit: RAMAN SHAUNIA / Shutterst",
    "body": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n            Credit: RAMAN SHAUNIA / Shutterstock\n                            \n    Table of Contents\n    \n        \n        If you've spent years curating playlists in Apple Music or another streaming service, you can now easily transfer your playlist to your Spotify library without needing to start from scratch or pay for a third-party service. Playlist transfers are now built into Spotify thanks to a new integration with TuneMyMusic, which facilitates music syncing, sharing, transfers, and backups across platforms. To initiate a playlist transfer from Apple Music or another streaming service (YouTube Music, Amazon Music, SoundCloud, etc.), open the Spotify mobile app and tap Your Library. Scroll to the bottom of the page, tap Import your music > Get Started, and follow the on-screen prompts to connect with TuneMyMusic. You can choose which platform to transfer music from, and your playlists will populate in Spotify. Your playlists will remain on the original platform, as they are simply being copied into Spotify. (This feature is currently rolling out to users, so you may need to update your Spotify app.)Data portability across music streamers has been very limited, but it's getting better: TuneMyMusic was already compatible with Spotify, but users had to sign up for a free trial with the service and were capped at just 500 songs before needing to upgrade to a paid plan. (Other third-party playlist transfer tools include FreeYourMusic and Soundiiz.) \n            \n                What do you think so far?\n            \n        \nApple Music has a music transfer feature built into its iOS and iPadOS (under Settings > Apps > Music) as well as the Apple Music app for Android and via the web. YouTube Music supports playlist imports and exports but requires a third-party service for platforms that don't permit direct transfers. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Directly Import Apple Music Playlists to Spotify",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAKW6VSX2VJRC9Q8XKYBVB9A/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-21T20:30:00.000Z",
      "dateModified": "2025-11-21T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Some Americans Are Boycotting Black Friday This Year",
    "url": "https://lifehacker.com/money/why-some-americans-are-boycotting-black-friday-this-year?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAKMD91GB80PHT8JDZ4EWWAJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-24T18:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n            Credit: Zooey Liao/Lifehacker/Get",
    "body": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Table of Contents\n    \n        \n        This post-Thanksgiving weekend, a growing number of Americans have pledged that they won't be camping outside stores or refreshing their browsers for deals. Instead, they're participating in coordinated boycotts that aim to turn one of the biggest shopping events of the year into a statement about economic power, inequality, and corporate influence in American life.What are the Black Friday boycotts?Two major boycott campaigns are underway during the 2025 holiday shopping season. The first, called \"Mass Blackout,\" is a coalition effort involving grassroots groups including Blackout the System, The People's Sick Day, American Opposition, the Money Out of Politics Movement, and The Progressive Network. Running from Nov.25 through Dec. 2, this weeklong economic protest asks Americans to stop shopping at major retailers, halt their streaming service subscriptions, avoid nonessential travel, and even refrain from working if possible.“No spending. No work. No surrender. The system isn’t broken. It’s working exactly as designed—for the wealthy,” says the homepage of the Mass Blackout website. This isn't about hurting small business or communities, but targeting major corporations that \"that profit from injustice, fuel authoritarianism, and crush worker power.”\nThe second campaign, \"We Ain't Buying It,\" is spearheaded by organizations like Black Voters Matter, Indivisible, and Until Freedom. This effort specifically targets major retailers, including Amazon, Target, and Home Depot, during the crucial Black Friday through Cyber Monday period.Both campaigns share similar goals: to demonstrate that everyday consumers and workers hold real economic power, and to protest what organizers see as a political and economic system that serves billionaires and corporations rather than ordinary Americans.Why the Black Friday boycotts are happeningThe timing of these campaigns is no accident. The five-day period from Thanksgiving through Cyber Monday (also known as the \"Cyber Five\"), accounts for approximately 17% of all holiday season sales. It's when retailers are most vulnerable to consumer action—and when consumers have the potential to make the biggest impact.The movements are responding to what they see as an increasingly divided economy, one in which the gap between the richest and poorest Americans continues to widen. \"This isn't about left versus right,\" reads the Mass Blackout website, \"this is about people versus power.\" The goal is a collective refusal to participate in a system where special interests and billionaires shape policy, while working people are exploited and democratic norms are eroded. LaTosha Brown, co-founder of Black Voters Matter Fund, said on CNN that the effort isn't a mere boycott, but a consumer action: \"We're sending a message to companies that when they align with policies that harm us, we will not support them,\" she said. In other words, don't let the word \"boycott\" make you think this is solely an economic movement. It's a political and personal one, too. These aren't isolated protests either—nor are they as fruitless as they may seem to cynics. Throughout 2025, boycotts have proven effective in shifting corporate behavior. Target recently reported declining sales partially attributed to customer backlash over its rollback of diversity, equity, and inclusion initiatives. This points to the fact that consumer action really can impact even retail giants.How to meaningfully participate in a Black Friday boycottParticipating in these boycotts (or consumer actions) doesn't require taking dramatic action. The core principle is simple: pause unnecessary consumption during this period, and reconsider your relationship with shopping. It's not just about \"not spending,\" but actually rerouting that time and money back into your own community.If you're interested in participating, here's what organizers suggest you do:\n            \n                What do you think so far?\n            \n        \nAvoid major corporations. The boycotts specifically target large retailers that dominate the market. If you need to make purchases, support small, local, or independent businesses instead. Small Business Saturday on Nov. 30 is explicitly excluded from the boycott for this reason.Reduce digital consumption. Log off streaming platforms, cancel or pause subscriptions you're not using, and avoid ad-driven platforms unless you're using them for organizing. This removes your engagement from the attention economy that drives corporate profits.Consider a \"working strike.\" Remember \"quiet quitting?\" For those who can't take time off work, organizers suggest working to rule (doing only what's required), going slow, or simply showing up without extra effort. Stop impulse shopping. Black Friday has become synonymous with deals that create urgency, with \"limited time only\" sales designed to trigger immediate purchases. Before buying anything, ask yourself: Do I actually need this, or am I responding to marketing? Will I still want this item in a week? This pause alone can be powerful, and give you time to reconsider shopping at local businesses instead.If you're unable to join the economic shutdown directly, or if you're looking for a way to support those who are, you can take action by donating to mutual aid here. Apolitical reasons to consider participating in a Black Friday boycottEven if you're not politically motivated to participate in these boycotts, there are compelling personal reasons to step back from Black Friday shopping this year.First, most Black Friday \"deals\" aren't as good as they appear. Retailers often inflate original prices to make discounts look more impressive, or offer deals on older models and inferior products. Whatever sense of urgency you feel when shopping this week, remember it's by design. Even if you aren't compelled by the bigger political movements going on, it's worth taking a step back from Black Friday shopping for your own sanity (and wallet). Perhaps most importantly, participating in a boycott—even partially—is an opportunity to reclaim agency. In a consumer culture that constantly pushes us to buy more, choosing not to participate can be surprisingly liberating. It's a chance to align your spending with your values and to recognize that you have power in the economy.The bottom lineWhether or not these boycotts significantly impact retail sales remains to be seen. Economists note that short-term boycotts often face challenges because consumers simply shift their spending to other times. However, organizers argue that the act of participation itself matters—it demonstrates economic consciousness and solidarity that can build into long-term collective action.What is already clear is that these movements reflect growing frustration with economic inequality and corporate power. They're attempting to transform Black Friday from a celebration of consumerism into a moment of collective reckoning about who holds the power in the American economy.You don't have to join a political movement to benefit from stepping back this Black Friday. Simply pausing, questioning whether you really need to shop, and avoiding impulse purchases you'll regret later is a form of participation. Before you reach for your wallet or click \"add to cart,\" take a moment to consider: What if you just didn't? What if instead of shopping, you spent time with people you care about, engaged with your community, or simply rested? In a culture that equates shopping with happiness and consumption with success, sometimes the most radical thing you can do is nothing at all.\n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Some Americans Are Boycotting Black Friday This Year",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAKMD91GB80PHT8JDZ4EWWAJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-24T18:00:00.000Z",
      "dateModified": "2025-11-24T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Electric Hand-Sander Makes Large DIY Projects More Tolerable",
    "url": "https://lifehacker.com/home/this-bosch-electric-hand-sander-is-a-diy-upgrade?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAVCDQ3RD3ZT71RH94ZFAAS2/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-24T17:45:04.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on this page.\n    \n            Credit: Amazon/Lifehacker\n                            \n    Table of Contents\n    \n        \n        No one ever tells you how much of your adult life will be spent sanding things down. Drywall? Sanding. Every piece of wood you cut and install in a DIY project? Sanding. Want to repair or refinish your floors, or furniture? Yup, probably sanding. And there’s nothing worse than laboring over a large sanding project—you feel it in your arms and back for days, and your hand starts to cramp holding that buzzing hand sander for long periods of time. That is, until I picked up this palm sander from Bosch, which is so comfortably designed, I haven’t hated sanding since—and my Tylenol consumption has plummeted. If you use a hand sander frequently, this will definitely be an upgrade for you.\nThe wood stairs in my old house have a lot of character, which is a polite way of saying they are beat up. I’m not in the market to replace both staircases, though, so I try to keep them in good shape. I recently decided to sand them down and repaint them, and wasn’t looking forward to the process. I needed a new hand sander, so after a bit of research that praised the GSS20-40’s comfort, I picked one up for the job. It was a great experience.The first reason I love this hand sander is that it’s relatively quiet and doesn’t buzz as much as others—there’s a lot less vibration. That vibration can be very fatiguing over long periods of use, so cutting it down makes a huge difference both in how comfortable the tool is to use generally and how long you can tolerate it. And the longer you can tolerate using the tool, the more you can accomplish.\nThe GSS20-40 also has a very comfortable two-handed grip. You can use it one-handed, but I always wind up using two hands because I feel more in control of the tool. Normally, this is pretty awkward, because most hand sanders have pommels that are just a bit too small for two-handed operation, but with this model it works well.\n            \n                What do you think so far?\n            \n        \nThe sander is well-designed in general. The speed dial is on the back, and it’s easy to adjust depending on the material and results you’re getting. It’s a sheet sander, with sandpaper clamping into place over the pad. I’ve had trouble with shifting paper in previous sanders, but the Bosch held the sheets in place reliably.This is a corded tool—one of the few corded tools I still use, actually. I hate having to deal with extension cords like it’s 1995, but I think the comfort and performance make it well worth the extra trouble. If you’re going to be doing a lot of sanding at some point, definitely check this one out—your arms and back will thank you.\n            \n    \n\n    \n        Smarter Home & Living Newsletter\n            Never miss a story\n        \n        \n            Lindsey Ellefson\n            \n        \n        Get the latest smart home news, trends, and advice from Lindsey and the team.\n    \n    \n        Smarter Home & Living Newsletter\n            Never miss a story. Get the latest smart home news, trends, and advice from Lindsey and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Electric Hand-Sander Makes Large DIY Projects More Tolerable",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAVCDQ3RD3ZT71RH94ZFAAS2/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-24T17:45:04.000Z",
      "dateModified": "2025-11-24T17:45:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Get This Top-Rated iRobot Braava Mop on Sale for Over 70% Off Right Now",
    "url": "https://lifehacker.com/tech/irobot-braava-jet-m6-stacksocial-sale-black-friday-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KATNRBG82RJZCMDGPC5TAP2V/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-24T18:15:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: StackSocial\n                            \n    Table of Contents\n    \n        \n        Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over. Follow our live blog to stay up-to-date on the best sales we find.Browse our editors’ picks for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.Subscribe to our shopping newsletter, Add to Cart, for the best sales sent to your inbox.Sales are accurate at the time of publication, but prices and inventory are always subject to change. You can get the iRobot Braava Jet M6 Smart Robot Mop, currently on sale for $119.99 on StackSocial. PCMag gave it an “excellent” rating for good reason: it mops in straight, efficient rows, maps your home, and can be controlled via the app or Alexa.The m6 is ideal for homes with hardwood, tile, or stone floors and works well in open layouts or multi-room setups. It uses vSLAM navigation to create a smart map of your space, where you can also set “Keep Out Zones” to avoid dog bowls or play areas. The battery lasts for about 150 minutes, and it’ll automatically return to its dock and resume cleaning where it left off. You also get two cleaning modes (wet mopping and dry sweeping) and a 15-ounce water tank that handles most messes without frequent refills. The app lets you schedule cleanings, choose specific rooms, or just send it off to mop up a spill on command.Still, don’t expect miracles. While it does a solid job on everyday grime and dried spills, it won’t scrub out stubborn stains the way a human can. You’ll also need to buy the cleaning pads and solution separately. That said, at under $120 for a Grade “A” refurbished model with a one-year warranty, it offers a lot of functionality in a small, quiet package. It’s especially useful if you already own a Roomba vacuum—the two can work together to vacuum and mop your floors in a seamless sequence. For anyone looking to minimize daily maintenance without sacrificing clean floors, this robot mop makes a compelling case. It also comes in white.How long do Black Friday deals really last?Black Friday sales officially begin Friday, November 28, 2025, and run throughout “Cyber Week,” the five-day period that runs from Thanksgiving through Cyber Monday, December 1, 2025. But Black Friday and Cyber Monday dates have expanded as retailers compete for customers. You can get the same Black Friday sales early, and we expect sales to wind down by December 3, 2025. \n            \n                What do you think so far?\n            \n        \nWhat stores have the best sales on Black Friday?Nowadays, both large retailers and small businesses compete for Black Friday shoppers, so you can expect practically every store to run sales through Monday, December 1, 2025. The “best” sales depend on your needs, but in general, the biggest discounts tend to come from larger retailers who can afford lower prices: think places like Amazon, Walmart, Target, Best Buy, and Home Depot. You can find all the best sales from major retailers on our live blog. Are Black Friday deals worth it?In short, yes, Black Friday still offers discounts that can be rare throughout the rest of the year. If there’s something you want to buy, or you’re shopping for gifts, it’s a good time to look for discounts on what you need, especially tech sales, home improvement supplies, and fitness tech. Of course, if you need to save money, the best way to save is to not buy anything. Are Cyber Monday deals better than Black Friday?Black Friday used to be bigger for major retailers and more expensive tech and appliances, while Cyber Monday was for cheaper tech and gave smaller businesses a chance to compete online. Nowadays, though, distinction is almost meaningless. Every major retailer will offer sales on both days, and the smart move is to know what you want, use price trackers or refer to guides like our live blog that use price trackers for you, and don’t stress over finding the perfect timing.\n            \n                    Our Best Editor-Vetted Early Black Friday Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Get This Top-Rated iRobot Braava Mop on Sale for Over 70% Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KATNRBG82RJZCMDGPC5TAP2V/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-24T18:15:00.000Z",
      "dateModified": "2025-11-24T18:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Sonos Soundbar Is $150 Off for Black Friday",
    "url": "https://lifehacker.com/tech/sonos-beam-gen-2-soundbar-sale-black-friday-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAVEBW01EYB8K2CV7WFEVH3K/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-24T17:39:55.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over. Follow our live blog to stay up-to-date on the best sales we find.Browse our editors’ picks for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.Subscribe to our shopping newsletter, Add to Cart, for the best sales sent to your inbox.Sales are accurate at the time of publication, but prices and inventory are always subject to change.With Thanksgiving just around the corner, Black Friday deals are already dominating Amazon. In this Early Black Friday deal, the Sonos Beam Gen 2 Soundbar is $349 (originally $499), its lowest price ever, delivering a $150 discount on the premium audio accessory that doubles as a smart speaker.\nAn improvement to the brand’s 2018 Sonos Beam Gen 1, the updated version (released in 2021) is Dolby Atmos compatible and has an improved processor as well as NFC and eARC connectivity. The companion app also has new updates, including calibrating sound experience based on the environment. It has a clean, minimalist aesthetic and compatibility with multiple voice assistants, and the same drivers that made the Gen 1 model so popular. While the bass performs well, especially with Dolby Atmos refining it for all your media watching needs, it lacks a subwoofer, so it’s not as deep as it could be, according to this PCMag review. That said, the Dolby Atmos update is a major one, allowing for a more precise, accurate, and surprisingly big sound from a one-piece speaker system. If you’ve been on the fence about a new soundbar and have a small to moderately sized living room, this is the perfect time to pull the trigger on the Sonos Beam Gen 2 Soundbar with its current $150 discount, as it's a great pick for anyone looking to upgrade from TV speakers. However, if what you’re looking for is a more immersive home theater sound, you may want to increase your budget. \n            \n                What do you think so far?\n            \n        \nDoes Amazon have Black Friday deals?Yes, Amazon has Black Friday sales, but prices aren’t always what they seem. Use a price tracker to make sure you’re getting the best deal, or refer to guides like our live blog that use price trackers for you. And if you have an Amazon Prime membership, make the most of it.What stores have the best sales on Black Friday?Nowadays, both large retailers and small businesses compete for Black Friday shoppers, so you can expect practically every store to run sales through Monday, December 1, 2025. The “best” sales depend on your needs, but in general, the biggest discounts tend to come from larger retailers who can afford lower prices: think places like Amazon, Walmart, Target, Best Buy, and Home Depot. You can find all the best sales from major retailers on our live blog. Are Black Friday deals worth it?In short, yes, Black Friday still offers discounts that can be rare throughout the rest of the year. If there’s something you want to buy, or you’re shopping for gifts, it’s a good time to look for discounts on what you need, especially tech sales, home improvement supplies, and fitness tech. Of course, if you need to save money, the best way to save is to not buy anything. \n            \n                    Our Best Editor-Vetted Early Black Friday Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Sonos Soundbar Is $150 Off for Black Friday",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAVEBW01EYB8K2CV7WFEVH3K/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-24T17:39:55.000Z",
      "dateModified": "2025-11-24T17:39:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Ace Sonos Headphones Are 30% Off for Black Friday",
    "url": "https://lifehacker.com/tech/ace-sonos-headphones-sale-black-friday-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KATKTN3Q0YJ5F30Q7QPSZV0A/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-24T14:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon/Lifehacker \n                            \n    Table of Contents\n    \n        \n        The Sonos Ace headphones are finally seeing their first major price drop for Black Friday, down to $279 from their usual $399 on Amazon. That’s a solid $120 off, and yes, the lowest price tracked so far, according to price trackers. \nSonos is best known for its home speakers and soundbars, but the Ace is its first shot at premium over-ear headphones, and it’s a good one. These don’t feel like a first-generation experiment. The build is lightweight and durable; the ear cups are soft and comfortable for long use; and the physical buttons are easy to find and press, which is great if you're tired of finicky touch controls.You get around 30 hours of battery life with active noise cancellation or Aware mode turned on, and closer to 40 if you keep both off. That puts it right up there with other top-tier options like Sony’s WH-1000XM5s. The Ace also supports Bluetooth multipoint, meaning you can stay connected to your laptop and phone at the same time and switch without much delay. Sound quality is clean and well-balanced out of the box, but you can tweak it in the Sonos app if you want more bass or brightness, notes this PCMag review. The ANC and transparency (or Aware) modes are both excellent, letting you tune out or tune in to your surroundings without a jarring switch. \n            \n                What do you think so far?\n            \n        \nThat said, there are a couple of limitations worth knowing. Unlike Sonos speakers, the Ace doesn’t support wifi playback, so you can’t stream directly from services the way you might with other Sonos gear. Still, they can pair with Sonos soundbars over Bluetooth, which might be a bonus if you're already in the Sonos ecosystem. Compared to similarly priced models like the AirPods Max or Sony’s latest WH-1000XM6, the Ace holds its ground, especially at this discounted price. Whether you're replacing an old pair or trying premium noise-canceling headphones for the first time, this deal makes the Sonos Ace worth a serious look.\n            \n                    Our Best Editor-Vetted Early Black Friday Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Ace Sonos Headphones Are 30% Off for Black Friday",
      "image": [
        "https://lifehacker.com/imagery/articles/01KATKTN3Q0YJ5F30Q7QPSZV0A/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-24T14:00:00.000Z",
      "dateModified": "2025-11-24T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This New Scam Is Leaving Voicemails Saying You Owe $1,000",
    "url": "https://lifehacker.com/tech/this-new-scam-is-leaving-voicemails-saying-you-owe-a-thousand-dollars?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAKSREKTRKE98HF4M1845YNV/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-21T20:00:15.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n            Credit: Credit: Zooey Liao/Lifeha",
    "body": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n            Credit: Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            A new scam claims there's been a charge on your Amazon account for an expensive new iPhone.\n                                            The call will either say the charge is for $999 for an iPhone 16 Pro, or $1,099 for an iPhone 17 Pro.\n                                            If you receive this call, hang up or ignore it: It's a scam.\n                                    \n            \n    Table of Contents\n    \n        \n        Someone stealing your credit card information is the absolute worst. Opening your statement to see expensive charges you didn't make is stressful, and canceling your card—and dealing with all of your attached subscriptions—is a nightmare. So if you get a call about an unauthorized charge for a brand new iPhone, you're probably going to want to get to the bottom of it. Here's the thing: It's likely a scam. I speak from experience: My wife keeps getting calls from unknown numbers, all of which leave voicemails about charges for iPhones. The voicemail starts off with what sounds like standard holding music. Suddenly, a voice pops in, saying something to the affect of: \"This is Amazon. This call is to authorize the payment of $999 for the recent order of Apple iPhone 16 Pro on your account. If you do not authorize this payment, please press \"one\" to speak to our customer support representative.\" Your call may also be about, \"the payment of $1,099 for the recent order of Apple iPhone 17 Pro on your account.\" We are inundated with the calls, and besides the payment amount and the specific iPhone model, the rest of the message is identical. As you might expect, no such charges are actually present on either our Amazon account or in our credit card history. That's because no one bought an iPhone in our name, or by using our financial information: This was simply a scam.\nHad we answered the phone and pressed \"one\" to speak with a \"customer support representative,\" or called the number back after listening to the voicemail, this is what would have likely happened: The \"representative\" would have assured us that they would be able to dispute the charge, but of course they'd need some information from us first. Perhaps they would have needed us to confirm the credit card information, and would ask us to read our digits out loud. Maybe they'd need to make sure we actually owned the Amazon account in question, and would ask for our two-factor authentication code to \"confirm our identity.\" No matter what the case, the scammers would have been praying on our concern about the charge to extract some type of sensitive information from us, all for their own financial gain. Had we called back and complied, we would have almost assuredly handed the scammers the money we thought they were helping us get back.  What to do if you get this voicemailIf you get a voicemail like this, don't call them back. If you pick up the phone, and you get this message, don't press \"one;\" just hang up. You are definitely being scammed, and there's no risk in simply ignoring the caller completely. \n            \n                What do you think so far?\n            \n        \nIf you'd like to verify their claims, don't involve the caller at all. Instead, head to your Amazon account, and check your order history. You'll be able to see if any such iPhones were ordered under your account—and, if they were, you can cancel the order here. Similarly, check your credit card history: If you don't see a charge for an iPhone, there wasn't one. If you do see one, reach out to the credit card company directly through their official contact information.  Scammers rely on pressure tactics that stress you out, and make you feel like time is of the essence. It rarely ever is. While it might seem common practice for companies like Amazon to call customers about large charges, it really isn't. If you ever receive unsolicited communications from someone claiming to represent a company you belong to, you can always end the conversation, and reach out directly yourself. If you contact Amazon's official customer support, or the company that issues your credit card, they'll be able to confirm or deny the claim for you.  While you can block the number, it might not do much good. Each time we've received a call, it's been from a different number, so my guess is they're not reusing numbers when calling you back. Instead, you should strongly consider using one of Apple's built-in anti-spam tools. If you're running iOS 26, you can choose to have your iPhone screen calls from unknown numbers, and ask for information before sending the call your way. No matter which version of iOS you have, you can also choose to silence unknown callers en masse, so you're never interrupted by any caller that isn't in your contacts. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This New Scam Is Leaving Voicemails Saying You Owe $1,000",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAKSREKTRKE98HF4M1845YNV/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-21T20:00:15.000Z",
      "dateModified": "2025-11-21T20:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Says It Isn't Using Your Emails to Train Its AI",
    "url": "https://lifehacker.com/tech/google-says-it-isnt-using-your-emails-to-train-its-ai?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAVAHNKZTHHQZ5JJ6QRR0G4Q/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-24T17:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n            Credit: Tada Images/Shutterstock\n",
    "body": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Last week, claims spread across the internet that Google was secretly collecting users' private messages to train Gemini.\n                                            The claims center on the company's \"smart features\" settings, and suggest Google opted users into these settings to scrape their data.\n                                            Google denies this, pointing to the fact that \"smart features\" has existed for years, and is opt-in only.\n                                            Smart features also has no control over AI training, and is used for personal customization only.\n                                    \n            \n    Table of Contents\n    \n        \n        Last week, tech headlines were abuzz with a concerning claim: According to some on social media platforms, and even some news outlets, Google had secretly opted Gmail users into sharing their emails with Gemini. The goal? To train Google's AI. While this controversy set off quite a lot of noise, it appears much of the conversation kicked off with this inflammatory post on X, complete with select words in all caps: \n    \n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \n\nAccording to the poster, the only remedy for the situation is to disable a setting you've probably never heard of: \"smart features.\" The claims suggest \"smart features\" was switched on in two locations on your account: One that controls Gmail, Chat, and Meet, and another that enables it in the larger Google Workspace suite—assuming you have a Workspace account. The \"smoking gun\" is a small part of Google's privacy policy which says that the company does not use your Workspace data to train its AI models, without permission. Taken at face value, the assertion is that Google opted you into these settings, thus taking your \"permission\" to start using your data for this AI training. As of this morning, the post has nearly 150,000 likes on X, but the claims spread far and wide across the internet. Even Malwarebytes ran a story explaining the situation, and urging users to disable these settings to keep their messages out of Google's AI training. As it turns out, however, Google doesn't actually appear to be doing this. \nWhat are \"smart features?\" I reached out to Google on Friday to see if the company had any comment concerning these claims. In response, I received the following from a Google spokesperson:\"These reports are misleading—we have not changed anyone’s settings, Gmail Smart Features have existed for many years, and we do not use your Gmail content for training our Gemini AI model. Lastly, we are always transparent and clear if we make changes to our terms of service and policies.\"Indeed, \"smart features\" has existed for years. In fact, Lifehacker first covered the setting back in 2020, nearly three years before Google first launched Bard (now Gemini). To the claimants' credit, smart features does use your data to improve Google features, but not to train AI models en masse. Instead, smart features uses your data to customize your specific Google experience. In Gmail, that might mean learning how you write, to generate more relevant smart replies; in Search, that might mean suggesting keywords based on previous searches; in Maps, that might mean showing restaurant reservations; in Wallet, that might mean recommending tickets for shows based on your interests. Smart features also powers core Google features, like spam filters and categorization.That's not to say that you should necessarily be down for smart features: If you personally don't care for Google collecting your data to customize your personal experience, you can absolutely turn these features off. But it's important to understand what you're choosing to turn on or off: Just because someone claims that these features are doing something doesn't make it true. Turn off smart features if you want, but just know that it has no impact on how Google handles your private messages, or how it trains its AI models for everyone. Plus, it may impact how apps like Gmail function: You may not be able to sort your emails into categories, or stop certain spam from getting into your inbox. How to disable \"smart features\"If you do want to turn off smart features, it's easy to do. You'll find the settings in the Gmail web app: Click the settings gear, then choose \"See all settings.\" Here, scroll down, and disable the toggle next to \"Smart features.\" You'll need to agree to \"Turn off and reload\" Gmail in order to see the changes take effect. \n            \n                What do you think so far?\n            \n        \nIf you have a Workspace account, you have another settings page to manage. Click \"Manage Workspace smart features settings,\" then disable the toggles next to \"Smart features in Google Workspace\" and \"Smart features in other Google products.\" Finally, choose \"Save.\" Just remember: These settings control a number of smart features across your Google products. As such, you might notice certain features missing going forward. To revert your changes, return to these settings pages at any time and flip the toggles back on.  Google isn't in the clearThe dust has settled since controversy's peak last week. Malwarebytes issued a correct to its original article, sharing the same spokesperson statement I received. The site says that Google's vague rewrite of the smart features setting contributed to this confusion, but that it does appear the setting doesn't scrape users' private messages to train Gemini. However, that's not to say Google is entirely in the clear here. While this specific claim might not be true, a lawsuit claims the company improperly gave Gemini private user data from Gmail, Chat, and Meet without the permission of those users. Google as a whole doesn't have the best reputation when it comes to respecting users' privacy too, so it's not surprising that these claims took off the way they did.  Malwarebytes also makes the point that while Google says these settings are all opt-in, many users don't actually remember opting in themselves, further fueling confusion around smart features. To be candid, I definitely don't remember enabling smart features on either my personal or work Gmail accounts, though it's entirely possible I did. All I know is these settings are on now, and while I'm considering disabling them, I also don't know if I'd be willing to get rid of all smart features. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Says It Isn't Using Your Emails to Train Its AI",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAVAHNKZTHHQZ5JJ6QRR0G4Q/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-24T17:00:00.000Z",
      "dateModified": "2025-11-24T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Get This Nespresso Coffeemaker on Sale for Just $75 for Black Friday",
    "url": "https://lifehacker.com/tech/nespresso-vertuo-pop-plus-stacksocial-sale-black-friday-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KATNCMKQ025HXTEQV8TYTHYH/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-24T17:15:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: StackSocial\n                            \n    Table of Contents\n    \n        \n        Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over. Follow our live blog to stay up-to-date on the best sales we find.Browse our editors’ picks for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.Subscribe to our shopping newsletter, Add to Cart, for the best sales sent to your inbox.Sales are accurate at the time of publication, but prices and inventory are always subject to change. The Nespresso Vertuo Pop+ offers café-style coffee without leaving your kitchen or putting on pants, and it's currently on sale for $74.99 on StackSocial. It’s small enough to fit on even the most crowded countertops (about the size of a toaster), but still delivers that signature Vertuo crema with the push of a button. It's a refurbished model with a Grade A rating, meaning the machine comes in a near-mint condition with only minimal wear, and could be a solid pick for anyone who wants fast, customizable coffee without splurging on a brand-new machine.The coffeemaker heats up in just 30 seconds, so you can go from half-asleep to sipping something warm without much of a wait. Brewing is handled with a single button, and the Vertuo barcode system automatically adjusts for cup size and strength. Whether you're after a 1.35-ounce espresso or a 12-ounce coffee, it reads the pod and takes care of the rest. There's also a Coffee Creations Mode that activates with a quick double-tap, brewing a more concentrated shot that holds up better over ice, which is useful if you’re into iced coffee or milk drinks. It even has Bluetooth and wifi support, which won’t affect your coffee’s flavor but does help with maintenance alerts through the app, especially if you’re the type to ignore descaling until it's too late.That said, the Pop+ only works with Vertuo capsules, and none come in the box, so your first cup requires a separate purchase. These capsules also cost more than Nespresso’s Original line, though you get over 40 blends and seasonal editions to choose from. The machine also shuts off after two minutes to save energy, which is efficient but can feel a bit annoying if you step away between brews. Still, it's a compact, dependable, and easy-to-use coffeemaker, and the refurb rating removes most of the usual uncertainty that comes with secondhand appliances. If you want quick, varied cup sizes with little cleanup and don’t mind sticking to the Vertuo capsule system, this deal makes the Pop+ an easy machine to consider.How long do Black Friday deals really last?Black Friday sales officially begin Friday, November 28, 2025, and run throughout “Cyber Week,” the five-day period that runs from Thanksgiving through Cyber Monday, December 1, 2025. But Black Friday and Cyber Monday dates have expanded as retailers compete for customers. You can get the same Black Friday sales early, and we expect sales to wind down by December 3, 2025. \n            \n                What do you think so far?\n            \n        \nWhat stores have the best sales on Black Friday?Nowadays, both large retailers and small businesses compete for Black Friday shoppers, so you can expect practically every store to run sales through Monday, December 1, 2025. The “best” sales depend on your needs, but in general, the biggest discounts tend to come from larger retailers who can afford lower prices: think places like Amazon, Walmart, Target, Best Buy, and Home Depot. You can find all the best sales from major retailers on our live blog. Are Black Friday deals worth it?In short, yes, Black Friday still offers discounts that can be rare throughout the rest of the year. If there’s something you want to buy, or you’re shopping for gifts, it’s a good time to look for discounts on what you need, especially tech sales, home improvement supplies, and fitness tech. Of course, if you need to save money, the best way to save is to not buy anything. \n            \n                    Our Best Editor-Vetted Early Black Friday Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Get This Nespresso Coffeemaker on Sale for Just $75 for Black Friday",
      "image": [
        "https://lifehacker.com/imagery/articles/01KATNCMKQ025HXTEQV8TYTHYH/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-24T17:15:00.000Z",
      "dateModified": "2025-11-24T17:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Is the Best AirPods Pro Deal Ahead of Black Friday",
    "url": "https://lifehacker.com/tech/this-is-the-best-airpods-pro-deal-ahead-of-black-friday?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAEE0XXAAFCK1AD7HKDPF7A6/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-19T17:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 19, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 19, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Walmart/Lifehacker\n                            \n    Table of Contents\n    \n        \n        As someone who's still rocking an M1 MacBook Air, an iPhone 12 Pro Max, the Apple Watch SE (Gen 1), and the AirPods Pro (Gen 1), I can proudly say that using older devices is a great lifestyle decision. It saves me a lot of money and I still get access to premium products with almost all of the features I need. And now that the AirPods Pro 3 are out, it's a great time to start looking for deals on the older AirPods Pro 2 before stocks are cleared. This Walmart deal brings the AirPods Pro 2 to an all-time low price of $139 (which is $100 off the list price), and they're an absolutely fantastic piece technology for that price.\nAlthough the AirPods Pro 2 launched a few years ago, they've received enough software updates to make them far more capable than they were at launch. Now, the AirPods Pro 2 are also approved for use as a hearing aid in the US, and still offer excellent noise isolation with great sound quality. I live in a really noisy city and I cannot roam around without wearing my AirPods for fear of triggering my migraines. My AirPods Pro (Gen 1) do a good job at cutting out the noise, but the AirPods Pro 2 take the cancellation to another level. I've used and compared all three generations of AirPods, and the noise cancellation on the Pro 2 is solid. It's not as good as that on the Pro 3, but it's better than on the Pro 1, and the difference isn't big enough to spend nearly twice the price for the latest product.\n            \n                What do you think so far?\n            \n        \nThe AirPods Pro 2 are everything I need to keep migraines away. They block out the worst of the loud noises around me while being light and comfortable enough to wear all day. My city has extremely humid weather, which makes it near impossible to wear over-ear headphones outdoors. However, I feel quite comfortable with my AirPods, and I've been waiting for nearly four years to upgrade mine. While I was saving up for the AirPods Pro 3, this deal is too good to resist, and I may just get the Pro 2 instead and save the rest of my cash to upgrade my Apple Watch.\n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Is the Best AirPods Pro Deal Ahead of Black Friday",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAEE0XXAAFCK1AD7HKDPF7A6/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-19T17:30:00.000Z",
      "dateModified": "2025-11-19T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google's Desktop Search App Is Back (Kind Of)",
    "url": "https://lifehacker.com/tech/google-desktop-search-app-first-impressions?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAESHG5EXPJ0AJBXZAGQ61RN/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-19T20:00:00.000Z",
    "description": "\n        \n        Back in the Windows XP days, when the only search functionality was a cartoon dog in the sidebar of Windows Explorer (not a joke), G",
    "body": "\n        \n        Back in the Windows XP days, when the only search functionality was a cartoon dog in the sidebar of Windows Explorer (not a joke), Google released Google Desktop. If you installed the application, you could search the files on your computer the same way you could search the web. The application made finding your own documents quick—as a small town reporter in northern Alberta, I constantly used this service to dig through my old notes and previous articles.The service was shut down in 2011, announced via a blog post, which stated that the feature was no longer necessary in the cloud storage era. And that was the end of Google offering to search files on your computer—until now. Back in September, Google announced an experimental Windows-only application named \"Google App for Windows\" that, among other things, searches the files on your computer.Nostalgic person that I am, I couldn't help but wonder: was this going to be similar to the retro offering? So I gave it a shot. The installation requires opting in to an \"experiment\" using your Google account, then downloading and installing an application. After that, you can bring up a search by using the keyboard shortcut Alt+Space, which brings up a search bar. You can use this to search for files on your computer, your Google Drive, and information on the web.\nThe actual file search doesn't seem particularly sophisticated. While the retro Google Desktop could search the contents of files, the Google App for Windows seems to mostly only be aware of file names. That's disappointing—I liked being able to figure out which files I mentioned particular names, or try to find the source of a sentence I remember writing. This local search functionality honestly isn't much better than the search that comes with Windows.What this new app can do, though, is search your Google Drive. I was able to quickly find and open files I'd created in Google Docs, then open them in one click. The ability to search these cloud docs alongside my local ones in one place is a decent reason to give this application a chance.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nAnd there are also a few web-based features. If there are no files that match your search, you'll see Google search results—select any of those and you'll see an AI-generated blurb answering your question. If you'd prefer traditional Google search results, you can get those instead—just turn off \"AI mode\" by clicking your profile picture and turning off the AI Mode toggle.\n            \n                What do you think so far?\n            \n        \nFinally, this application can be used to take a screenshot of your computer and answer questions related to it. For example, I took a snap of my desktop wallpaper—a photo my wife took in New Zealand—and got an accurate description of the location.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThe feature is similar to those offered by the desktop application of ChatGPT and Claude, just powered by Google's AI instead of those tools. I'm not sure I'd find myself using this regularly, but it's an interesting idea.The Google App for Windows, sadly, isn't a resurrection of the long-dead Google Desktop, but it is an interesting tool that combines a simple local file search with results from your Google Drive and the web. It's worth playing around with if you're a dedicated Google user who still stores a lot of files on their computer.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google's Desktop Search App Is Back (Kind Of)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAESHG5EXPJ0AJBXZAGQ61RN/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-19T20:00:00.000Z",
      "dateModified": "2025-11-19T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "We Now Know What Caused the Cloudflare Outage Tuesday Morning",
    "url": "https://lifehacker.com/tech/here-is-what-caused-the-cloudflare-outage?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KABXRM3BE8CK7M8MV5YJ1R38/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-18T17:02:01.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 18, 2025\n    \n            Credit: Christopher Penler/Shutte",
    "body": "\n        \n    \n                                        \n        \n        \n        November 18, 2025\n    \n            Credit: Christopher Penler/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Cloudflare confirmed the cause of Tuesday's outage that took down many popular websites around the world.\n                                            The company asserts it was not the result of a cyberattack; rather a glitch in the system meant to manage threat traffic.\n                                            The root cause of the outage appears to be resolved, though some users may experience degraded performance in the immediate aftermath.\n                                    \n            \n    Table of Contents\n    \n        \n        Tuesday morning was a stark reminder of how fragile the global internet really is. Websites from X to ChatGPT went offline as Cloudflare, the company they rely on for web infrastructure services, experienced a massive outage. A huge number of sites and services across the world contract Cloudflare for cybersecurity protections, as well as to route traffic through servers local to each user, all in the name of performance and reliability. Ironic, of course, given today's events.When the public experiences such a massive internet outage, speculation runs awry. What caused this? Was it a simple bug on Cloudflare's part, or something malicious? Are bad actors attacking Cloudflare, and the sites that rely on it? But, as it turns out, the reason appears to be closer to the former than the latter.Cloudflare's outage was a glitchIn a statement to Mashable, Cloudflare confirmed that the company had identified the cause of the issue, and had rolled out a fix to patch it. In addition, Cloudflare is adamant there is no reason to believe a cyberattack caused this outage. This is the full statement: \n\"Many of Cloudflare's services experienced a significant outage today beginning around 11:20 UTC. It was fully resolved at 14:30 UTC. The root cause of the outage was a configuration file that is automatically generated to manage threat traffic. The file grew beyond an expected size of entries and triggered a crash in the software system that handles traffic for a number of Cloudflare's services.\n            \n                What do you think so far?\n            \n        \nTo be clear, there is no evidence that this was the result of an attack or caused by malicious activity. We expect that some Cloudflare services will be briefly degraded as traffic naturally spikes post incident but we expect all services to return to normal in the next few hours. A detailed explanation will be posted soon on blog.cloudflare.com. Given the importance of Cloudflare's services, any outage is unacceptable. We apologize to our customers and the Internet in general for letting you down today. We will learn from today's incident and improve.\" It seems the reason for the outage was a preventative measure meant to block a potential cyberattack. While that goal is obviously important, it shows how complex these systems really are: One glitch with one cybersecurity protocol spun out of control, and took down the network en masse.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We Now Know What Caused the Cloudflare Outage Tuesday Morning",
      "image": [
        "https://lifehacker.com/imagery/articles/01KABXRM3BE8CK7M8MV5YJ1R38/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-18T17:02:01.000Z",
      "dateModified": "2025-11-18T17:02:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Black Friday Deal Cuts 50% Off a Six-Month Apple TV Subscription",
    "url": "https://lifehacker.com/tech/apple-tv-subscription-black-friday-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAM4C48B0SF3W2CVDTATVXA6/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-21T21:32:18.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 21, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Apple TV\n                            \n    Table of Contents\n    \n        \n        Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over. Follow our live blog to stay up-to-date on the best sales we find.Browse our editors’ picks for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.Subscribe to our shopping newsletter, Add to Cart, for the best sales sent to your inbox.Sales are accurate at the time of publication, but prices and inventory are always subject to change. Black Friday deals aren't just on physical products. While you can find discounts on everything from fitness trackers to Kindles, subscriptions also have Black Friday sales, too. Case in point: Apple TV—not Apple TV+ anymore, mind you. Apple's own subscription service typically costs a relatively expensive $12.99 per month. But as of today, Nov. 21, new and returning Apple TV customers can snag a six-month subscription to Apple TV for $5.99 per month. That amounts to more than a 50% discount on each month (53.89%, to be precise). You have some time to claim this price cut. This is a Black Friday deal, after all, so you'll be able to sign up now through Dec. 1 at 8 p.m. PT (Cyber Monday). Once you do, you'll be set for six months, but just make sure to keep an eye on the calendar: Once those six months are up, Apple will go back to charging you the full $12.99. You'll also need to subscribe through a method where Apple bills you directly. You won't be able to take advantage of the discount if you sign up for Apple TV through a third party. Finally, you won't be eligible if your account qualifies for a free trial.If you haven't been tuned in to Apple TV, now's a great time to check it out. The platform has surprisingly great catalogue, including popular shows like Severance, Ted Lasso, and Shrinking. Plus, there are a number of shows airing new episodes right now, like Pluribus, The Morning Show, and The Last Frontier.     You can redeem the offer from any device that bills directly to Apple, or from Apple TV's official site.\n            \n                What do you think so far?\n            \n        \nDoes Apple do Black Friday?Yes, Apple participates in Black Friday, though you may want to compare its sales with other retailers like Best Buy and Walmart. Apple is offering an exclusive $250 gift card for eligible purchases, but so far, the best Black Friday sale on an Apple product is the M4 MacBook on sale for cheaper than ever.Are Black Friday deals worth it?In short, yes, Black Friday still offers discounts that can be rare throughout the rest of the year. If there’s something you want to buy, or you’re shopping for gifts, it’s a good time to look for discounts on what you need, especially tech sales, home improvement supplies, and fitness tech. Of course, if you need to save money, the best way to save is to not buy anything. Are Cyber Monday deals better than Black Friday?Black Friday used to be bigger for major retailers and more expensive tech and appliances, while Cyber Monday was for cheaper tech and gave smaller businesses a chance to compete online. Nowadays, though, distinction is almost meaningless. Every major retailer will offer sales on both days, and the smart move is to know what you want, use price trackers or refer to guides like our live blog that use price trackers for you, and don’t stress over finding the perfect timing.\n            \n                    Our Best Editor-Vetted Early Black Friday Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Black Friday Deal Cuts 50% Off a Six-Month Apple TV Subscription",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAM4C48B0SF3W2CVDTATVXA6/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-21T21:32:18.000Z",
      "dateModified": "2025-11-21T21:32:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Sonos Soundbar and Subwoofer Bundle Is 25% Off for Black Friday",
    "url": "https://lifehacker.com/tech/sonos-soundbar-and-subwoofer-bundle-sale-black-friday-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAVCND8V9XE95EHAVFCDVAS9/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-24T18:06:41.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n            Credit: Amazon/Lifehacker\n       ",
    "body": "\n        \n    \n                                        \n        \n        \n        November 24, 2025\n    \n            Credit: Amazon/Lifehacker\n                            \n    Table of Contents\n    \n        \n        Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over. Follow our live blog to stay up-to-date on the best sales we find.Browse our editors’ picks for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.Subscribe to our shopping newsletter, Add to Cart, for the best sales sent to your inbox.Sales are accurate at the time of publication, but prices and inventory are always subject to change.The Sonos Arc Ultra is our pick for the best soundbar overall, and you can get it bundled with the Sub 4 subwoofer for a record low price of $1,499 right now for Black Friday. At 25% off, that's the best deal we've seen on the combo, according to price-tracking tools. \nSonos dominates the soundbar space, with some of the best smart speakers and surround sound systems on the market. The Arc Ultra is the brand's latest flagship soundbar and comes with all the premium features you'd expect at this price point, like Bluetooth connectivity, Dolby Atmos support, spatial audio, voice assistant from Amazon Alexa, and Sonos Voice Control. It has excellent audio quality and impressive bass, and its minimalist design looks great on any TV stand or wall. PCMag gives the Sonos Arc Ultra an \"outstanding\" rating. The Arc Ultra alone performs better than most soundbar and subwoofer combos, but the deal currently available includes the also-excellent Sub 4 for an even more immersive experience. Note that the Arc Ultra is a large soundbar—measuring in at 2.95 by 46.38 by 4.35 inches and 13 pounds—so you'll need plenty of space for it. How long do Black Friday deals really last?Black Friday sales officially begin Friday, November 28, 2025, and run throughout “Cyber Week,” the five-day period that runs from Thanksgiving through Cyber Monday, December 1, 2025. But Black Friday and Cyber Monday dates have expanded as retailers compete for customers. You can get the same Black Friday sales early, and we expect sales to wind down by December 3, 2025.\n            \n                What do you think so far?\n            \n        \nWhat stores have the best sales on Black Friday?Nowadays, both large retailers and small businesses compete for Black Friday shoppers, so you can expect practically every store to run sales through Monday, December 1, 2025. The “best” sales depend on your needs, but in general, the biggest discounts tend to come from larger retailers who can afford lower prices: think places like Amazon, Walmart, Target, Best Buy, and Home Depot. You can find all the best sales from major retailers on our live blog. Are Black Friday deals worth it?In short, yes, Black Friday still offers discounts that can be rare throughout the rest of the year. If there’s something you want to buy, or you’re shopping for gifts, it’s a good time to look for discounts on what you need, especially tech sales, home improvement supplies, and fitness tech. Of course, if you need to save money, the best way to save is to not buy anything. Are Cyber Monday deals better than Black Friday?Black Friday used to be bigger for major retailers and more expensive tech and appliances, while Cyber Monday was for cheaper tech and gave smaller businesses a chance to compete online. Nowadays, though, distinction is almost meaningless. Every major retailer will offer sales on both days, and the smart move is to know what you want, use price trackers or refer to guides like our live blog that use price trackers for you, and don’t stress over finding the perfect timing.\n            Deals are selected by our commerce team\n                            \n        \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Sonos Soundbar and Subwoofer Bundle Is 25% Off for Black Friday",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAVCND8V9XE95EHAVFCDVAS9/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-24T18:06:41.000Z",
      "dateModified": "2025-11-24T18:06:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]