[
  {
    "title": "AI Chatbots Are Even Worse at Giving Medical Advice Than We Thought",
    "url": "https://lifehacker.com/health/ai-chatbots-are-even-worse-at-medical-advice-than-we-thought?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH4VNDPMV1RN3JEVQ4YTSPXQ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-12T15:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    Even when they have the “right” information, they can lead you astray.\n            \n                        \n    \n                    \n        \n        \n        \n    \n                                Beth Skwarecki\n                            \n        \n            Beth Skwarecki\n                \n                                            Senior Health Editor\n                                    \n            \n            \n        \n            ExperienceBeth Skwarecki is Lifehacker’s Senior Health Editor, and holds certifications as a personal trainer and weightlifting coach. She has been writing about health for over 10 years.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        February 12, 2026\n            \n            \n                        Credit: Jeffrey Hazelwood/Lifehacker/Getty Images\n                            \n    \n        \n        It’s tempting to think that an LLM chatbot can answer any question you pose it, including those about your health. After all, chatbots have been trained on plenty of medical information, and can regurgitate it if given the right prompts. But that doesn’t mean they will give you accurate medical advice, and a new study shows how easily AI’s supposed expertise breaks down. In short, they are even worse at it than I thought.In the study, researchers first quizzed several chatbots about medical information. In these carefully conducted tests, ChatGPT-4o, Llama 3, and Command R+ correctly diagnosed medical scenarios an impressive 94% of the time—though they were able to recommend the right treatment a much less impressive 56% of the time. But that wasn’t a real-world test for the chatbots medical utility. The researchers then gave medical scenarios to 1,298 people, and asked them to use an LLM to figure out what might be going on in that scenario, plus what they should do about it (for example, whether they should call an ambulance, follow up with their doctor when convenient, or take care of the issue on their own). The participants were recruited through an online platform that reported it verifies that research subjects are real humans and not bots themselves. Some participants were in a control group that was told to research the scenario on their own, and not using any AI tools. In the end, the no-AI control group did far better than the LLM-using group in correctly identifying medical conditions, including most serious “red flag” scenarios. How a chatbot with “correct” information can lead people astrayAs the researchers write, “Strong performance from the LLMs operating alone is not sufficient for strong performance with users.” Plenty of previous research has shown that chatbot output is sensitive to the exact phrasing people use when asking questions, and that chatbots seem to prioritize pleasing a user over giving correct information. Even if an LLM bot can correctly answer an objectively phrased question, that doesn’t mean it will give you good advice when you need it. That’s why it doesn’t really matter that ChatGPT can “pass” a modified medical licensing exam—success at answering formulaic multiple choice questions is not the same thing as telling you when you need to go to the hospital.  The researchers analyzed chat logs to figure out where things broke down. Here are some of the issues they identified:The users didn’t always give the bot all of the relevant information. As non-experts, the users certainly didn’t know what was most important to include. If you’ve been to a doctor about anything potentially serious, you know they’ll pepper you with questions to be sure you aren’t leaving out something important. The bots don’t necessarily do that. The bots “generated several types of misleading and incorrect information.” Sometimes they ignored important details to narrow in on something else; sometimes they recommended calling an emergency number but gave the wrong one (such as an Australian emergency number for U.K. users).Responses could be drastically different for similar prompts. In one example, two users gave nearly identical messages about a subarachnoid hemorrhage. One response told the user to seek emergency care; the other said to lie down in a dark room. People varied in how they conversed with the chatbot. For example, some asked specific questions to constrain the bot’s answers, but some let the bot take the lead. Either method could introduce unreliability into the LLM's output.Correct answers were often grouped with incorrect answers. On average, each LLM gave 2.21 answers for the user to choose from. People understandably did not always choose correctly from those options. Overall, people who didn't use LLMs were 1.76 times more likely to get the right diagnosis. (Both groups were similarly likely to figure out the right course of action, but that's not saying much—on average, they only got it right about 43% of the time.) The researchers described the control group as doing \"significantly better\" at the task. And this may represent a best-case scenario: the researchers point out that they provided clear examples of common conditions, and LLMs would likely do worse with rare conditions or more complicated medical scenarios. They conclude: “Despite strong performance from the LLMs alone, both on existing benchmarks and on our scenarios, medical expertise was insufficient for effective patient care.”\n            \n                What do you think so far?\n            \n        \nChatbots are a risk for doctors, tooPatients may not know how to talk to an LLM, or how to vet its output, but surely doctors would fare better, right? Unfortunately, people in the medical field are also using AI chatbots for medical information in ways that create risks to patient care. ECRI, a medical safety nonprofit, put the misuse of AI chatbots in the number one spot on its list of health technology hazards of 2026. While the AI hype machine is trying to convince you to give ChatGPT your medical information, ECRI correctly points out that it’s wrong to think of these chatbots as having human personalities or cognition: “While these models produce humanlike responses, they do so by predicting the next word based on large datasets, not through genuine comprehension of the information.”ECRI reports that physicians are, in fact, using generative AI tools for patient care, and that research has already shown the serious risks involved. Using LLMs does not improve doctors’ clinical reasoning. LLMs will elaborate confidently on incorrect details included in prompts. Google’s Med-Gemini model, created for medical use, made up a nonexistent body part whose name was a mashup of two unrelated real body parts; Google told a Verge reporter that the mistake was a “typo.”  ECRI argues that “because LLM responses often sound authoritative, the risk exists that clinicians may subconsciously factor AI-generated suggestions into their judgments without critical review.”Even in situations that don’t seem like life-and-death cases, consulting a chatbot can cause harm. ECRI asked four LLMs to recommend brands of gel that could be used with a certain ultrasound device on a patient with an indwelling catheter near the area being scanned. It’s important to use a sterile gel in this situation, because of the risk of infection. Only one of the four chatbots identified this issue and made appropriate suggestions; the others just recommended regular ultrasound gels. In other cases, ECRI’s tests resulted in chatbots giving unsafe advice on electrode placement and isolation gowns. Clearly, LLM chatbots are not ready to be trusted to keep people safe when seeking medical care, whether you’re the person who needs care, the doctor treating them, or even the staffer ordering supplies. But the services are already out there, being widely used and aggressively promoted. (Their makers are even fighting in the Super Bowl ads.) There’s no good way to be sure these chatbots aren’t involved in your care, but at the very least we can stick with good old Dr. Google—just make sure to disable AI-powered search results. \n            \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from our expert team.\n            The Daily NewsletterReady to do everything better?\n                    Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n                        \n                \n            \n                    \n                                            \n                \n            \n                Beth Skwarecki\n                                    Senior Health Editor\n                                \n                                            Covering health, fitness tech, home gym equipment, and more.\n                                    \n                Read Beth's full bio\n                            \n        \n                \n                                            \n    More by Beth\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI Chatbots Are Even Worse at Giving Medical Advice Than We Thought",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH4VNDPMV1RN3JEVQ4YTSPXQ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-12T15:00:00.000Z",
      "dateModified": "2026-02-12T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Dark Side of the Modern Male Body ‘Ideal’",
    "url": "https://lifehacker.com/health/the-dark-side-of-modern-male-body-ideal?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH1N9PACBBK9DHT2281X8KVN/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-09T18:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    Bro-speak makes dangerous behaviors sound like virtues.\n            \n                        \n    \n                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            \n        \n            Meredith Dietz\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceMeredith is a marathon runner and stand-up comedian. As Lifehacker’s Senior Staff Writer, she covers personal fitness tech, home gym equipment, and more.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        February 9, 2026\n            \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        When I asked real people why they post their workouts online, I received well over a hundred replies, many of them filled with venting about body image issues and unattainable beauty standards. That's didn't surprise me. What did surprise me was that the majority of these responses came from men. Carefully measured chicken and rice, obsessive tracking of macros, the guilt when a workout is missed: On social media, these behaviors are framed in the language of performance and strength. The same rituals that would be clear indications of disordered behavior for women are redefined as “discipline” and “optimization” for men. How many men suffer in silence because eating disorders are coded as a women's issue? How many cases go unrecognized when they're framed as \"clean eating\" or \"serious training\"? When eating disorders and body dysmorphia get rebranded as \"fitness goals,\" a lot of men are left struggling in plain sight. Men can have eating disorders, tooBoys and men now make up about a third of those diagnosed with eating disorders, and that figure likely understates the crisis. In particular, muscle dysmorphia—sometimes called \"bigorexia\"—is characterized by excessive and compulsive exercise, a persistent belief that one is insufficiently muscular, and an obsession with muscle mass, size, and leanness. Unfortunately, much of fitness culture allows men to engage in disordered behaviors by wrapping them in performance language. \"Bulking\" and \"shredding\" cycles can mask seriously problematic eating patterns. Without giving certain men in my life an armchair diagnosis, I can confidently say I’ve seen the mental fallout when someone’s extreme caloric restriction becomes \"cutting\" or compulsive exercise becomes \"staying on track.\"Unsurprisingly, social media amplifies these harmful messages. Mason Boudrye, who describes himself as \"someone known to post gratuitous thirst traps,\" shared with me the mental fallout of always trying to look a certain way. “Even if people don't admit that the obsessive tracking and strict adherence to diet qualifies as disordered eating, I know it’s true for me,” he says. The social media of it all makes these feelings even more public and persistent. We all scroll through feeds of chemically enhanced physiques presented as natural and achievable. This naturally breeds more self-scrutiny, more comparison, more perceived inadequacy. Matthew Singer, a yoga teacher, says most “fitspo” (fitness inspiration) “is as helpful for fitness as previous winning lottery numbers are for winning millions. Fitspo cannot take into account genetics, job and family circumstances, health history, or any of the other countless factors that influence health outcomes.\" Our bodies are treated like projects always in need of correction, devoid of much-needed context.What’s most troubling to me is the way men don’t get to call out disordered behaviors by name. There is both a misconception around who eating disorders affect, and a deep reluctance among affected men to seek help for a problem they've been socialized to handle alone. Society has constructed a masculine ideal that equates vulnerability with weakness, making it nearly impossible for some men to admit they're struggling with their relationship to food and their bodies.Unattainable beauty standards stay unattainableBotox injections in men may get called “Brotox,\" but a cheeky nickname shouldn't shroud the fact that unattainable beauty standards are leading men to take more extreme measures. Dr. Claudia Kim of New Look New Life Cosmetic Surgery says she's seen a rise in men turning to beauty treatments: jawline contouring, under-eye correction, hair restoration, skin rejuvenation.  “These approaches offer noticeable yet discreet results with little downtime,” says Kim, fitting neatly into lives that were never supposed to include these concerns.\n            \n                What do you think so far?\n            \n        \nWhat's telling, Kim adds, is that her male patients are usually entering the aesthetic realm for the first time. In this sense, men are catching up to beauty  regimens women have been undertaking for generations, and slowly learning what women have long understood: Namely, that appearance affects professional success, social capital, and romantic prospects—and the goalposts are always moving. At the same time, the masculine ideal demands stoic self-sufficiency, even as it requires costly and constant aesthetic labor. What does all this mean for the average person with an average budget? The treatments Kim describes—jawline contouring, hair restoration, aesthetic procedures—aren't cheap. Nor are supplements, meal prep services, personal trainers, specialized equipment, and so on. Beauty standards increasingly require you to spend more money, meaning your appearance is yet another health arena where class determines outcomes. And if they can’t afford to look the way they feel pressured to look, men are uniquely left behind to suffer in silence.As a woman, I’ve spent most of my life jealous of how men were allowed to age, or gain weight, or simply be in their bodies without constant intervention. Now I have a more sympathetic gaze, especially after hearing so many men admit they were never given the language to articulate aesthetic concerns without shame.The bottom lineThere’s a big difference between healthy self-care and the sense that your body is never good enough. Meticulously tracking every calorie, every rep, every perceived flaw—why should one woman’s obvious eating disorder be another man’s enviable achievement? Women have been battling body image issues and unattainable beauty standards since birth, but a lot of men were never taught how to fight this particular war. To me, the takeaway is that we all need to be on the same side. To fight this war, we need a more honest conversation about what we're doing to men's relationships with their bodies. Until we acknowledge that, all this talk of \"cutting\" and \"discipline\" will allow dangerous behaviors to keep hiding in plain sight.\n            \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from our expert team.\n            The Daily NewsletterReady to do everything better?\n                    Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n                        \n                \n            \n                    \n                                            \n                \n            \n                Meredith Dietz\n                                    Senior Staff Writer\n                                \n                                            Covering personal fitness tech, home gym equipment, and more.\n                                    \n                Read Meredith's full bio\n                            \n        \n                \n                                            \n    More by Meredith\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Dark Side of the Modern Male Body ‘Ideal’",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH1N9PACBBK9DHT2281X8KVN/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-09T18:00:00.000Z",
      "dateModified": "2026-02-09T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scammers Are Sending Fake Invites With Malware",
    "url": "https://lifehacker.com/tech/scammers-are-sending-fake-invites-with-malware?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGZ6YPTHD2KZC8JCB7KNJ83W/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-09T15:00:59.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Supapich Methaset / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        If you receive an event invitation via email, verify it's legit before you RSVP, as you may not actually be invited to anything. Malwarebytes Labs has identified a new scam in which threat actors are using party invites to trick users into installing a remote access tool (RAT) that gives them full control over infected devices. (This specific campaign seems to be limited to the UK, but similar tactics could easily spread.) These malicious invites contain a ScreenConnect installerThe scam starts with an innocuous-looking email invitation with an informal \"Save the Date\" vibe that may appear to come from a friend or acquaintance. The message contains a link to \"View Invitation\" for event details. If you click through, you'll end up on a landing page with a bold \"You're Invited\" header and a button to download your invitation, but you don't actually need to take any further action—your browser automatically triggers the download of a .msi file, which is not actually a party invitation or RSVP form but an installer. The MSI silently installs ScreenConnect Client, a legitimate IT support tool that allows remote access into the user's machine. Once this connection is established, attackers have the ability to see your screen, control your mouse and keyboard, and upload or download files—even if you restart your computer. All of this happens in the background with no obvious indicators that a remote access tool has been installed and is now running, so victims are unlikely to have cause for concern. \nYou should know these remote access red flagsAs Malwarebytes points out, this scheme is successful because it relies on normal human behavior around a seemingly low-risk situation: opening an event invitation. What's unusual is that there's little pressure or urgency in the initial message. Instead, the landing page has language like \"a friend has sent you an invitation\" and \"I opened mine and it was so easy,\" which is a form of social proof that guides users to take the desired action. You should always be alert to unsolicited invites sent via regular email with a link to an external site as well as any communication that prompts you to download or install software. These days, invitations are commonly delivered through apps and digital services like Partiful, Paperless Post, Evite, or Apple Invites, which are generally more trustworthy than random emails with hyperlinked text. If you're unsure whether the invite is real, verify with the sender through another channel before clicking or downloading anything. \n            \n                What do you think so far?\n            \n        \nAs mentioned, victims of this scam may not immediately notice that a RAT has been installed on their device. But there are some red flags, such as unexplained cursor movement or windows opening or closing on their own. You can check your machine for a file named \"RSVPPartyInvitationCard.msi\" or a service called ScreenConnect Client with additional random characters in the title.  If you've already downloaded ScreenConnect from a malicious invite, Malwarebytes recommends disconnecting from the internet and uninstalling the program immediately. Run a security scan to check your device for malware, and change important passwords from a separate device. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scammers Are Sending Fake Invites With Malware",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGZ6YPTHD2KZC8JCB7KNJ83W/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-09T15:00:59.000Z",
      "dateModified": "2026-02-09T15:00:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Update Chrome ASAP to Patch This High-Severity Security Flaw",
    "url": "https://lifehacker.com/tech/update-chrome-asap-to-patch-the-latest-zero-day?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHPAYVF4J3DZ0GBWXFDNFH3N/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-17T21:30:01.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 17, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: aileenchik / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Google has issued a patch for a high-severity flaw that has been actively exploited in the wild—the first Chrome zero-day in 2026.\n                                            CVE-2026-2441 would allow a remote attacker to execute arbitrary code inside a sandbox via a crafted HTML page.\n                                            Chrome updates automatically when you close and reopen the browser, or you can apply pending updates when they appear.\n                                    \n            \n    Table of Contents\n    \n        \n        If you use Google Chrome, you should install the latest update ASAP. Google has issued a patch for a high-severity flaw that has been actively exploited in the wild—the first Chrome zero-day in 2026. What the Google Chrome patch fixesThe latest flaw, catalogued as CVE-2026-2441, is a use-after-free vulnerability in CSSFontFeatureValuesMap, Chrome's CSS font feature implementation. A use-after-free vulnerability is a flaw in which an application attempts to use memory after it has been released back to the system. This type of bug allows attackers to execute code, escalate privileges, cause app or system crashes, and leak sensitive data. CVE-2026-2441 would allow \"a remote attacker to execute arbitrary code inside a sandbox via a crafted HTML page.\" Essentially, this means malicious HTML content could run code inside a Chrome tab, extension, or plugin. As Malwarebytes explains, this is dangerous because attackers can see or modify whatever the isolated browser tab (sandbox) can access, allowing actions like credential harvesting and traffic rerouting—even if it cannot escape to impact the whole operating system. \nGoogle said that this vulnerability has been exploited in the wild but hasn't provided any specific details as to how. The discovery has been attributed to Shaheen Fazim.\n            \n                What do you think so far?\n            \n        \nWhat Chrome users need to doGoogle released a Stable channel update on Feb. 13 with a patch for this flaw. The latest versions of Chrome are 145.0.7632.75/76 for Windows and macOS and 144.0.7559.75 for Linux, so you'll want to ensure you are up to date. Go to the Chrome menu and select About Google Chrome to check which version you're on. Chrome updates automatically when you close and reopen the browser, but if you don't do that regularly, keep an eye out for pending updates in the top-right corner of your browser window. Apply these updates immediately by tapping the three dots and selecting the first menu item. Chrome will need to restart to complete the update. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Update Chrome ASAP to Patch This High-Severity Security Flaw",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHPAYVF4J3DZ0GBWXFDNFH3N/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-17T21:30:01.000Z",
      "dateModified": "2026-02-17T21:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI Actually Shut Down GPT-4o",
    "url": "https://lifehacker.com/tech/openai-actually-shut-down-gpt-4o?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHC6XAVZ3AGTFBN2NPVGZF02/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-13T20:15:41.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Matthew Nichols1\n                            \n            \n                Key Takeaways\n                                            OpenAI finally deprecated its GPT-4o model on Friday, two weeks after announcing the news.\n                                            The company tried to shut down the model in August, but brought it back following intense user backlash.\n                                            4o is at the center of lawsuits accusing ChatGPT of encouraging delusional thinking, including, in some cases, suicide.\n                                    \n            \n    Table of Contents\n    \n        \n        They actually did it. OpenAI officially deprecated GPT-4o on Friday, despite the model's particularly passionate fan base. This news shouldn't have been such a surprise. In fact, the company announced that Feb. 13 would mark the end of GPT-4o—as well as models like GPT-4.1, GPT-4.1 mini, and o4-mini—just over two weeks ago. However, whether you're one of the many who are attached to this model, or you simply know how dedicated 4o's user base is, you might be surprised OpenAI actually killed its most agreeable AI. This isn't the first time the company depreciated the model, either. OpenAI previously shut down GPT-4o back in August, to coincide with the release of GPT-5. Users quickly revolted against the company, some because they felt GPT-5 was a poor upgrade compared to 4o, while others legitimately mourned connections they had developed with the model. The backlash was so strong that OpenAI relented, and rereleased the models it had deprecated, including 4o.   If you're a casual ChatGPT user, you might just use the app as-is, and assume the newest version tends to be the best, and wonder what all the hullabaloo surrounding these models is all about. After all, whether it's GPT-4o, or GPT-5.2, the model spits out generations that read like AI, complete with flowery word choices, awkward similes, and constant affirmations. 4o, however, does tend to lean even more into affirmations than other models, which is what some users love about it. But critics accuse it of being too agreeable: 4o is at the center of lawsuits accusing ChatGPT of enabling delusional thinking, and, in some cases, helping users take their own lives. As TechCrunch highlights, 4o is OpenAI's highest-scoring model for sycophancy.   \nI'm not sure where 4o's most devoted fans go from here, nor do I know how OpenAI is prepared to deal with the presumed backlash to this deprecation. But I know it's not a good sign that so many people feel this attached to an AI model. \n            \n                What do you think so far?\n            \n        \nDisclosure: Ziff Davis, Mashable’s parent company, in April 2025 filed a lawsuit against OpenAI, alleging it infringed Ziff Davis copyrights in training and operating its AI systems.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI Actually Shut Down GPT-4o",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHC6XAVZ3AGTFBN2NPVGZF02/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-13T20:15:41.000Z",
      "dateModified": "2026-02-13T20:15:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Three Claude Premium AI Features Are Now Available for Free",
    "url": "https://lifehacker.com/tech/claude-premium-ai-features-for-free-users?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHKHWF3SFWBAY3CB4Q84ESXG/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-17T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 17, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: miss.cabul/Shutterstock \n                            \n    Table of Contents\n    \n        \n        Anthropic's Claude is an AI bot that keeps up a steady pace when it comes to pushing out new features, and the latest upgrade of note sees three useful features make their way down to free users, having previously been exclusive to the paid-for plans.If you're choosing between AIs and comparing the features available on the free plans, then there's now more of a case to be made for choosing Claude over a competitor like ChatGPT or Gemini for your next batch of AI tasks.The three new features now available to free users on Claude are file creation, external plug-ins called Connectors, and bundles of instructions called Skills. Here's how you can make use of them.\nFile creation in ClaudeClaude's file creation capabilities let you create Word documents, PowerPoint slideshows, Excel spreadsheets, and PDFs from right inside a conversation. You can either supply the bot with all text, data, and other information you want included, get Claude to invent everything itself, or something in between.For example, if you've got a long list of names and scores, Claude can put them into a spreadsheet for you. If you've got a series of images, Claude can combine them into a PDF and describe them. You can get it to analyze and visualize data, produce presentations based on reports, and create summary documents.\n    \n            \n            A simple prompt can create a file in Claude.\n                                        Credit: Lifehacker\n                    \n    \nTo enable file creation for your account, click your profile icon (bottom left) in Claude on the web, then select Settings > Capabilities and enable Code execution and file creation. With that done, you just have to prompt Claude with the type of file you want to make and what you want included, supplying any information as needed (or telling the AI where to find it online).As usual with these AI bots, the more detail and specificity you can provide, the better—the end result is then more likely to be closer to what you were aiming for. I got it to quickly come up with the results of a fictional sports day race, and produce a spreadsheet from it. While it's not the most demanding of tasks, Claude completed it correctly.Claude ConnectorsConnectors can hook Claude up to a variety of other apps, sites, and services: So if you want to get it to design something for you in Canva, or manage your messages in Slack, or find some travel deals on Trivago, then Claude can do that for you. The full list of current Connectors gives you some idea of what's possible.To get to the Connectors from the Claude prompt box, click the small + (plus) icon in the lower left corner, then choose Add connectors. You can search through Connectors by name, and filter them by type and category. When you select one you like, you'll need to supply your account credentials and give Claude permission to access your account.\n    \n            \n            Use Connectors to connect Claude to other apps.\n                                        Credit: Lifehacker\n                    \n    \nYour Connectors of choice are then available from the same sub-menu in the prompt box: You can add more plug-ins and remove existing ones from there. You can either select an app, or specify the name of it in your prompt and Claude should understand what you mean. You can ask for outputs, run searches, and communicate through your connected services.\n            \n                What do you think so far?\n            \n        \nConnectors can give Claude some handy extra talents. With the Canvas Connector, for example, I was able to create a basic bit of artwork for a birthday party flyer—something that the AI wouldn't have been able to do on its own. I find that access was spotty, however, perhaps a sign of a lot of free users now making use of these tools.Claude SkillsWith Skills, you can \"teach Claude how to complete specific tasks in a repeatable way\" (in the words of the official support document). In old-school computer talk, they might be referred to as macros: batches of set instructions that Claude can repeat whenever you need something doing in a particular way.Templates are a good example, whether they're for emails or documents. Rather than just getting Claude to write an email for you, you can set down some basic parameters for the job that include guidelines on tone, length, and style, as well as crucial bits of information (such as your contact details) that always need to be included.\n    \n            \n            You've got three options for creating Skills.\n                                        Credit: Lifehacker\n                    \n    \nClick your account profile icon (bottom left) in Claude on the web, then choose Settings > Capabilities and click Add under Skills to get started. You can create a Skill through a Claude conversation, by writing out the instructions, or by uploading a Skills file (which is handy for including extra items such as code snippets, as described here).I took the Create with Claude route to put together a basic way of summarizing PDF reports, with specific guidelines on how many paragraphs and headings to use, and the tone of voice to apply. In the future, rather than typing out those instructions every time I need something summarized, I can just invoke the Skill.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Three Claude Premium AI Features Are Now Available for Free",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHKHWF3SFWBAY3CB4Q84ESXG/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-17T14:00:00.000Z",
      "dateModified": "2026-02-17T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Music Will Soon Let You Generate Playlists With AI",
    "url": "https://lifehacker.com/tech/apple-music-will-soon-let-you-generate-playlists-with-ai?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHP8M521BVVYXZQ0AG2D8V3G/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-17T18:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 17, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Matthew Nichols1/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple Music is testing a new AI playlist generator.\n                                            The feature, \"Playlist Playground,\" is currently available in the iOS 26.4 beta.\n                                            It is similar to AI playlist generators from other streaming services like Spotify and YouTube Music.\n                                    \n            \n    Table of Contents\n    \n        \n        Over the years, Apple Music has improved its algorithmic playlists. There's now an AI DJ, and you can use ChatGPT to generate playlists. With iOS 26.4, which is currently in beta, Apple wants you to make playlists with its own AI tech. The upcoming update includes a feature called \"Playlist Playground,\" which lets you generate AI playlists directly in the Apple Music app—as long as you're running iOS 26.4.How to download and install iOS 26.4I do not recommend installing and running beta versions of iOS on your primary iPhone. Beta software is unfinished, which means you could run into bugs and glitches that may impact how you use your iPhone, or even result in data loss. If you're itching to try out new features, it's best to ensure that you've taken a complete backup of your iPhone first. That way, you can always revert to an older installation in case something goes wrong. Even so, it's safer to run test software on a backup iPhone as opposed to your daily driver.With that said, if you're sure you want to go ahead and install iOS 26.4 right now, you can go to Settings > General > Software Update on your iPhone. Select Beta Updates > iOS 26 Developer Beta. Now, go back to the Software Update page and wait until you see iOS 26.4 Beta 1 appear. You can now download and install the update to try this new Apple Music feature.\nHow to create AI-generated playlists in Apple MusicOnce you're on iOS 26.4, you can open the Music app to get started with this feature. Tap the Library tab in the bottom bar, and then select the New Playlist button in the top-right corner. You should see the Playlist Playground feature here. (Note that this feature may not appear on devices that don't support Apple Intelligence, or if your Apple Account is from a region where Apple has restricted the rollout of AI features.)\n            \n                What do you think so far?\n            \n        \nOnce you activate the feature, you'll be able to generate playlists with AI. From here, you tell the AI what you want to listen to. You could get specific, with certain artists, songs, or genres, or ask for playlists that encompass a certain idea of mood. Apple has some pre-written prompts to get you started, such as \"hip-hop party songs,\" but you can use your own text prompts too. AI-generated playlists have 25 songs by default, and you do have the option to customize the playlist further after it's created. You'll also be able to edit the title, cover image, and the description of AI-generated playlists. These playlists can be shared with others or displayed on your Apple Music profile, just like other playlists you create on the streaming service. It's similar in concept to other AI playlist generators on platforms like Spotify or YouTube Music. Try AI-generated playlists without installing iOS 26.4While Apple Music's Playlist Playground feature is a good start, it's not yet available to those of us who are unwilling to install developer beta versions of iOS 26. If that's you, there are other options out there for AI generated Apple Music playlists. There's the aforementioned ChatGPT integration, of course, but you could also use a third-party app, like PlaylistAI. It has many prompts for you to get started with, and can even generate playlists from music festival posters. The app does prompt you to get a subscription, but you can skip that prompt and use the free tier to generate a playlist quickly.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Music Will Soon Let You Generate Playlists With AI",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHP8M521BVVYXZQ0AG2D8V3G/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-17T18:30:00.000Z",
      "dateModified": "2026-02-17T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Shortcut Solves the Biggest Issue With Finding Messages on Your iPhone",
    "url": "https://lifehacker.com/tech/this-shortcut-solves-the-biggest-issue-with-finding-messages-on-iphone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHP2PY9X2EFNP7W2ESBYJ8FW/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-17T16:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 17, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Pranay Parab\n                            \n    Table of Contents\n    \n        \n        I have always found it annoying to search for anything in Apple's Messages app. Admittedly, things have gotten better in recent years, especially as Messages allows you to use search filters now, but my biggest complaint still stands: searching in Messages can be both slow and complicated, particularly if you just want to find a specific text. If you have the same experience, I have good news: I've found a workaround that offers a massive improvement to Apple's built-in search function. The problem with searching in MessagesFor most people, the easiest way to search for texts on an iPhone involves opening the Messages app, tapping the search bar near the base of the screen, and typing in what you're looking for. You'll receive a variety of results, but that's the problem: It's too much information. When I search for a person's name, for example, Messages in iOS 26 shows a list of four chats where the name is mentioned, followed by two chat threads, pinned chats, shared notes, links, photos, locations, and documents. This is great when I want a more in-depth search, but when I'm just looking for a specific message, these extra details just get in the way.  \nThe fastest way to search for texts in iOS 26That's where our hack comes in. First, open the Shortcuts app on your iPhone, then install the Search and Open Messages shortcut. This shortcuts takes advantage of actions released in iOS 26, which allow you to look for text messages and open them in a single tap. Once the shortcut is installed, you can run it from the Shortcuts app, or add it to your iPhone's Home Screen for easier access.\n            \n                What do you think so far?\n            \n        \nThe shortcut will prompt you to type what you want to search for, and almost instantly, it'll list all the chats containing those words. In some cases, it even highlights the exact sentence containing those words. It'll find keywords in images you share, as well: These appears as \"blank\" entries in the search results, but if you tap through, you'll see the image the search identified. The moment you tap a result, the shortcut instantly takes you to the relevant part of the chat, and doesn't make you scroll through hundreds of results to find the right one. This is the kind of functionality Apple needs to add directly to Messages. But, for now, this shortcut workaround will have to do.  \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Shortcut Solves the Biggest Issue With Finding Messages on Your iPhone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHP2PY9X2EFNP7W2ESBYJ8FW/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-17T16:00:00.000Z",
      "dateModified": "2026-02-17T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Claude Has a Surprisingly Great Way to Add Multiple Appointments to Your Calendar at Once",
    "url": "https://lifehacker.com/tech/use-claude-create-ical-files?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH9WBZB32S8QG90GGBESCX4N/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-13T13:30:01.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Smith Collection/Gado / Contributor / Archive Photos via Getty Images\n                            \n    Table of Contents\n    \n        \n        I rely heavily on my digital calendar—as far as I'm concerned, if something isn't there, it doesn't exist. It's annoying, then, when someone hands me a piece of paper or even an email stating when multiple meetings are going to happen. I need to either manually add everything to my calendar—which is time consuming—or try to keep track of everything separately from my calendar.I've found a better way, though. As of this week, even the free version of Claude can create files for you, including iCal ones. These files are handy for quickly adding multiple appointments to the Apple, Google, and Microsoft calendar services.How Claude can create custom iCal files for youFor example, say you wanted every Olympic men's hockey game on your calendar (I'm Canadian—what else was I going to use as a demonstration?) All you need to do is take a screenshot of the schedule, upload that screenshot to Claude, and ask for it to create an iCal download using the information. I tried this and it worked perfectly.\nThe Olympics thing is just an example, though. Say you're at a conference and the staff gives you a paper schedule—you could take a photo, ask Claude for the iCal file, and add everything to your calendar at once.Note that you might need to inform Claude about time zones. In my example, the screenshot I had mentioned what time zone the events were happening in, and Claude worked it out. In other tests, I found I needed to mention any potential time zone complications before asking for the file.\n            \n                What do you think so far?\n            \n        \nHow to import Claude's iCal files to your calendarUsing these files on a Mac is easy: just open it and the Calendar app will ask you which calendar you want to add the appointments to. But it's also not hard on Google Calendar or Outlook.On Google Calendar, click the gear icon near the top-right corner, then click Settings and find the Import option in the left side bar. Click \"Select file from your computer\" and point it toward the file you downloaded from Claude.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThe steps for Microsoft Outlook are similar. In Outlook, click File, then Open & Export, then Import/Export, then select Import and iCalendar (.ics) or vCalendar (.vcs). Select which calendar you want to add the appointments to and you're done—the appointments will all show up.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Claude Has a Surprisingly Great Way to Add Multiple Appointments to Your Calendar at Once",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH9WBZB32S8QG90GGBESCX4N/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-13T13:30:01.000Z",
      "dateModified": "2026-02-13T13:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Four Ways to Recover Your 'Lost' Work in Microsoft Word",
    "url": "https://lifehacker.com/tech/recover-lost-work-in-microsoft-word?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHP2027W5DTEX9XP7T68W61V/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-17T15:00:00.000Z",
    "description": "\n        \n        There's little worse than losing an hour or two of hard work, just by clicking on the wrong button or pressing the wrong key in Micr",
    "body": "\n        \n        There's little worse than losing an hour or two of hard work, just by clicking on the wrong button or pressing the wrong key in Microsoft Word—a mistake that sees your well-crafted document (or a sizable portion of it) disappear before your eyes.A slip of the fingers isn't the only way you can potentially lose work, either. Maybe you just have the misfortune to be busy at your computer when a power outage happens—taking your desktop, Microsoft Word, and your unsaved work along with it.However, before you begin all over again, there are some tricks you can try to bring your work back. \nUse Undo (Ctrl+Z or Cmd+Z)\n    \n            \n            Word keeps an undo history.\n                                        Credit: Lifehacker\n                    \n    \nSometimes, all you need is the undo command—hit Ctrl+Z (Windows) or Cmd+Z (macOS) to undo your last action in Word. It might be enough to restore that table you accidentally deleted, or bring back that huge block of text you moved to the clipboard and have since lost track of.This won't save you from a power outage, and it doesn't include all actions (it won't bring back a file you've closed, for example). However, it'll work a lot of the time when you've made a mistake, and Word always keeps a record of your last 100 actions in the app, so you can go back a fair way.There's also an undo button up in the top left corner of the Word interface: Click on this to undo the last action, or click the arrow next to it to see a list of previous actions and choose where you want to go back to. To the right of the undo button is the redo button, which works the same way but in the opposite direction.Open previous file versions\n    \n            \n            Accessing previous versions in Word.\n                                        Credit: Lifehacker\n                    \n    \nWord also has a file version history feature you can utilize to bring back lost work: It essentially saves past versions of your document at regular intervals, so you can go back in time, and even all the way back to the file's creation. It's like a super undo, which works between app restarts as well.In Word for Windows, you can find these older incarnations of your document by heading to File > Info > Version History. If you're using Word on macOS, it's File > Browse Version History. A new sidebar opens on the right, showing all the available previous versions, and the date and time they were saved.There is a caveat to this, though, which is you have to have your document saved in the cloud (in OneDrive) for this to work. If you're working with a local file that's only saved on your computer and you try and access version history, you'll be prompted to save it to OneDrive instead (which will turn on version history).Find unsaved documents on your system\n    \n            \n            Unsaved documents are sometimes still available.\n                                        Credit: Lifehacker\n                    \n    \nWord actually saves files temporarily to your computer every so often, so if the program crashes without warning, you should see an autorecovery dialog pop up the next time you load Word, asking if you want to recover the old file. If not, you can see partially saved files by clicking Click File > Info > Manage Document > Recover Unsaved Documents.\n            \n                What do you think so far?\n            \n        \nThat's only for Windows, however—if you're on macOS, you're relying on the auto-recovery process. Word for both Windows and macOS lets you set how often auto-recovery files are saved: Head to File > Options > Save (Windows) or Word > Preferences > Save (macOS). The default is every 10 minutes, but you can adjust this if needed.If you're still not seeing your file, you can try checking the temporary cache folder manually. On Windows, check \"C:\\Users\\\\AppData\\Roaming\\Microsoft\\Word\" or \"C:\\Users\\\\AppData\\Local\\Microsoft\\Office\\UnsavedFiles.\" On macOS try \"/Users//Library/Containers/com.Microsoft/Data/Library/Preferences/AutoRecovery\"—adding in your own username where relevant.Save your work to the cloud\n    \n            \n            OneDrive gives you various extra options—including AutoSave.\n                                        Credit: Lifehacker\n                    \n    \nThese days, Microsoft Word will tend to push you to save your work in OneDrive in the cloud. There are multiple benefits for this, including the version history feature mentioned above, and the option to collaborate on documents with other people. It also enables another handy feature: AutoSave.This is exactly what it sounds like, and means that every time something is changed in your document, it quickly syncs to the cloud. You'll see the AutoSave button in the top left hand corner enabled when it's active, and the document name at the top of the app window will indicate when saves are in progress.Should Word or your PC crash, your work should be safe. AutoSave is enabled by default for files saved to OneDrive, but you can customize this behavior by heading to File > Options > Save on Windows) or Word > Preferences > Save on macOS.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Four Ways to Recover Your 'Lost' Work in Microsoft Word",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHP2027W5DTEX9XP7T68W61V/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-17T15:00:00.000Z",
      "dateModified": "2026-02-17T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ring Just Ended Its Controversial Partnership With Flock Safety",
    "url": "https://lifehacker.com/tech/ring-ended-controversial-partnership-with-flock-safety?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHBR0KCJS1YGKPFR454NNA8B/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-13T15:12:40.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: CC Photo Labs/Shutterstock\n                            \n            \n                Key Takeaways\n                                            In a blog post on Friday, Ring announced the end of its partnership with Flock Safety.\n                                            The announcement follows backlash to Ring's \"Search Party\" Super Bowl ad, which critics have seen as a slippery slope to infringing user privacy.\n                                            Ring says that the Flock Safety integration never went through, so no Ring footage was ever sent to the organization.\n                                    \n            \n    Table of Contents\n    \n        \n        Ring isn't having the week it probably thought it would have. The Amazon-owned company aired an ad on Super Bowl Sunday for \"Search Party,\" its new feature that turns a neighborhood's collective Ring cameras into one network, with the goal of locating lost dogs. Viewers, however, saw this as a major privacy violation—it doesn't take much to imagine using this type of surveillance tech to locate people, not pets.The backlash wasn't just isolated to the ad, however. The controversy reignited criticisms of the company's partnership with Flock Safety, a security company that sells security cameras that track vehicles, notably for license plate recognition. But the partnership with Ring wasn't about tracking vehicles: Instead, Flock Safety's role was to make it easier for law enforcement agencies that use Flock Safety software to request Ring camera footage from users. Agencies could put in a request to an area where a crime supposedly took place, and Ring users would be notified about the request. They didn't have to agree to share footage, however. Law enforcement could already request footage from Ring users, through the platform's existing \"Community Requests\" feature. But this partnership would let agencies make these requests directly through Flock Safety's software. If a user submitted footage following a request, Ring said that data would be \"securely packaged\" by Flock Safety and share to the agency through FlockOS or Flock Nova.\nThat partnership is officially over. On Friday, Ring published a blog post announcing the end of its relationship with Flock Safety. The company said, after a review, the integration \"would require significantly more time and resources than anticipated.\" As such, both parties have agree to cancel the partnership. \n            \n                What do you think so far?\n            \n        \nImportantly, Ring says that since the integration never actually launched, no user footage was ever sent to Flock Safety—despite the company announcing the partnership four months ago. Social media influencers had spread the false claim that Flock Safety was seeding Ring footage directly to law enforcement agencies, such as ICE. While those claims are inaccurate, they were likely fueled by reporting from 404 Media that ICE has been able to access Flock Safety's data in its investigations. Had Ring's partnership with Flock Safety gone ahead, there would be legitimate cause to believe that agencies like ICE could tap into the footage Ring users had shared—even if those users were under the impression they were only sharing footage with local agencies to solve specific cases.  While privacy advocates will likely celebrate this news, the cancelled partnership has no effect on Community Requests. Law enforcement agencies will still be able to request footage from Ring users, and those users will still have a say in whether or not they send that footage. Ring sees the feature as an objective good, allowing users to voluntarily share footage that could help law enforcement solve important cases. In its announcement on Friday, Ring cited the December 2025 Brown University shooting, in which seven users shared 168 video clips with law enforcement. According to Ring, one of those videos assisted police in identifying the suspect's car, which, in turn, solved the case.    \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ring Just Ended Its Controversial Partnership With Flock Safety",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHBR0KCJS1YGKPFR454NNA8B/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-13T15:12:40.000Z",
      "dateModified": "2026-02-13T15:12:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Did the FBI Get Nancy Guthrie's Nest Doorbell Footage?",
    "url": "https://lifehacker.com/tech/how-did-the-fbi-get-nancy-guthries-doorbell-footage?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH6Q5DQA53WPWW22X0XRZJ6F/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-11T17:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 11, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: CC Photo Labs/Shutterstock\n                            \n            \n                Key Takeaways\n                                            The FBI was able to produce footage from Nancy Guthrie's Nest doorbell, even though authorities previously said it was disconnected.\n                                            FBI Director Kash Patel says the video was recovered \"from residual data located in backend systems,\" but didn't share additional details.\n                                            It is possible that Guthrie's doorbell had saved videos or video data points from its event history, which the FBI could have used to piece together the full clips.\n                                    \n            \n    Table of Contents\n    \n        \n        Like millions of Americans, I've been watching the news of Nancy Guthrie's disappearance with concern—so I was somewhat relieved when the FBI announced they were releasing new footage of a suspect. Finally, the case had something to go on, even if it was only doorbell video of a masked stranger.When I saw the footage, I assumed this was something the FBI had in their possession since the beginning, and had finally decided to release to the public. But that's not what happened at all. If you have been following this case closely, you may know that law enforcement had previously confirmed that Guthrie's Google Nest camera was disconnected (presumably by the perpetrator), and that she did not have a subscription that would store video either on the doorbell or in the cloud. Yet despite the fact the doorbell should have been a dead end, the FBI has seemingly produced this video out of thin air.If you have a Google Nest device in or attached to your home, this might give you pause. Sure, it's one thing if law enforcement is able to obtain video from your subscription or from the device itself. But if you don't keep video records on your Nest, it seems it is still possible to retrieve the footage. How did the FBI do this, and what does it mean for the privacy of your Nest devices?   \nThe FBI likely pieced the video together from fragmentsThe short answer is that we don't really know for sure how the FBI got the footage, but there are a few leads. According to FBI Director Kash Patel, the Google Nest footage was recovered \"from residual data located in backend systems.\" That's pretty vague, though the FBI isn't necessarily known for its transparency.According to experts that spoke to NBC News, however, it is possible to obtain data from the \"complex infrastructure\" of cloud-based cameras, including Google Nest devices. Retired FBI agent Timothy Gallagher told NBC News that Guthrie's Nest camera might have sent images to Google's cloud service, or at least stored data points locally throughout the hardware of the device, even though she wasn't paying for a Nest subscription. The FBI could have obtained the footage from the cloud this way, or pieced together the video from those data points. Both possibilities track, based on how Nest cameras work without a subscription: While you need to pay Google in order to save video clips from your Nest cameras, some Nest devices record event histories and store them on-device. The third-gen wired Nest Doorbell can save up to 10 seconds of clips, while the first and second-gen wired doorbells can save up to three hours of event history, all without a subscription. They also support live video feeds when motion is detected, which could impact the video data points saved to the device or cloud.It's entirely possible the subject walking up to the camera triggered the doorbell to save an event history. But since it took the FBI so long to produce the footage, and since the director claims it was obtained from \"residual data,\" my guess is it wasn't readily available in Guthrie's Google Home app. Maybe the event history saved to the cloud, but it wasn't clear where it was located. Maybe it was overwritten, but the FBI was able to build it back up with recovered data points. My guess would learn toward the latter, as authorities did say the camera had been disconnected. Unfortunately, we don't have a definitive answer at this time, even if the theory is sound.    \n            \n                What do you think so far?\n            \n        \nI've reached out to Google for comment, and will update this piece if I hear back. Should you get rid of your Nest camera over privacy concerns?Based on what we know, it doesn't really seem like your Nest doorbell or camera is a fourth amendment disaster waiting to happen—but I don't blame anyone for being concerned. After all, if you don't have a Nest subscription, you might have been comforted by the thought that none of your footage was being saved anywhere, meaning law enforcement or other authorities would have nothing to seize if you somehow popped up on their radar. That doesn't necessarily appear to be the case. That said, without a subscription, you don't have access to a collection of all clips your Nest camera has ever recorded. You might have a limited event history saved, based on motion detection, but that will be limited to three hours of data. Your device might have data points that an organization like the FBI could theoretically use to restore footage, but that's likely true for any camera or smart doorbell system—not just Nest.Also, this is not a Ring situation—Google hasn't partnered with organizations like Flock to help law enforcement request footage from users. Nest also lacks Ring's \"Search Party\" feature, which can turn a neighborhood into a kind of surveillance state, and probably not just to search for lost dogs. I'm not dismissing every security and privacy concern, of course: By putting a commercially-available smart camera on your front door, you are placing your data in the hands of companies like Google or Amazon. If you want to eliminate the risk of the FBI obtaining your doorbell footage, you simply can't have a doorbell with a camera. But barring a warrant, or a Nancy Guthrie-level situation, the chances of your Nest doorbell footage actually being used against you seem rather slim. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Did the FBI Get Nancy Guthrie's Nest Doorbell Footage?",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH6Q5DQA53WPWW22X0XRZJ6F/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-11T17:30:00.000Z",
      "dateModified": "2026-02-11T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Telegram App Has a New Look, and a Weird New Feature",
    "url": "https://lifehacker.com/tech/telegram-has-a-new-look-and-some-new-features?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH7A5JFYZZTP9BVTRZ5KRK3A/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-11T22:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 11, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Ascannio/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Telegram announced some new changes and features to its iOS and Android app on Monday.\n                                            The biggest announcement is an overhauled UI for Android, with a new bottom navigation bar.\n                                            The iOS version gets new Liquid Glass UI elements, such as an updated media viewer.\n                                            There are also some new features, including one that lets you craft NFT-like \"collectibles.\"\n                                    \n            \n    Table of Contents\n    \n        \n        If your chat app of choice is Telegram, you have some changes to look forward to. The company announced a number of updates this week, chief among them a new look for its Android and iOS apps—the former is getting a total overhaul, but iPhone users will still note some new UI elements when chatting with friends on Telegram. There are also some new features, including one I find a little odd. There's a new look for Telegram on mobile\n    \n            \n            \n                                        Credit: Telegram\n                    \n    \nPer the announcement, the biggest changes come via UI updates, particularly on Android. Telegram says that its Android app has a \"fully redesigned interface\" intended to make navigating the app quicker and more intuitive—Telegram notes the interface code itself was entirely rebuilt to meet these goals. Changes include a new iOS-like bottom bar that lets you switch between your chats, settings, and profile, among other functionality. If you find the new interface effects to be too much, or too big a draw on your battery, Telegram says you can adjust them from Settings > Power Saving. The company also updated its iOS app, though not quite in the same way. Telegram says it added \"even more Liquid Glass\" to its iOS app, Apple's new design language for iOS 26, including a redesigned media viewer, sticker and emoji pack preview panels, and new context menus in profiles when choosing messages.\nYou can now transfer a Telegram group chat to a new admin\n    \n            \n            \n                                        Credit: Telegram\n                    \n    \nAs of this latest update, if the owner of a Telegram group chat leaves that conversation, the ownership of the group will transfer automatically to one of the group's admins after a week. However, the departing group owner can also choose their own admin if they want to, as Telegram now presets an option to appoint another admin when leaving the group. The company adds that admins can transfer ownership at any time, even if they don't leave.    Telegram bots are now more colorful\n    \n            \n            \n                                        Credit: Telegram\n                    \n    \nA small change, but if you develop bots for Telegram, you now have the option to add colors and emojis to those buttons. It's far from a radical update, but it could make it a bit easier to tell options apart at a glance. \n            \n                What do you think so far?\n            \n        \nThere's a new send message shortcut on the Telegram iPad appA small but noteworthy feature for any Telegram users on iPad: Now, you can send a message using the shortcut \"Command + Enter.\"You can now \"craft\" gifts in TelegramAnd here's that weird new feature: I don't usually expect my chat app to offer collectible gifts, but apparently Telegram does. It previously introduced the ability to send gifts to other people, and even upgrade those gifts to collectibles that can be auctioned on NFT marketplaces (which requires real money).Now, Telegram is reportedly expanding this gift system in the latest update with the ability to combine existing gifts in a new \"crafting\" system to create \"Uncommon, Rare, Epic or Legendary\" versions. You can combine up to four gifts at once, and adding multiple gifts with the same \"attributes\" raises the chance the crafted gift will have that attribute as well. Again, this is the last thing I'd expect or want from a chat app, but, as it's part of this update, so I'm telling you about it.  \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Telegram App Has a New Look, and a Weird New Feature",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH7A5JFYZZTP9BVTRZ5KRK3A/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-11T22:00:00.000Z",
      "dateModified": "2026-02-11T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Just Patched Its First Zero-Day Security Vulnerability of 2026",
    "url": "https://lifehacker.com/tech/apple-just-patched-its-first-zero-day-security-vulnerability-of-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH9B1B0Q2NK5PAYNYW5KKY8R/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-12T18:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple just released a whole host of security patches, including a fix for an actively exploited zero-day affecting iOS 26 and iPadOS 26.\n                                            The flaw could allow attackers with memory write capability to execute arbitrary code.\n                                            You can confirm that you're on the latest OS version under Settings > General > Software Update.\n                                    \n            \n    Table of Contents\n    \n        \n        It's once again time to update your Apple devices. The company just released a whole host of security patches, including a fix for an actively exploited zero-day affecting iOS 26, iPadOS 26, and macOS Tahoe. These updates arrived alongside the official release of iOS 26.3, which includes features like more seamless data transfer between iPhone and Android. Other security patches address bugs in Photos, VoiceOver, and Screenshots, to name a few.  iOS 26.3 patches a zero-day affecting dyldAccording to Apple's latest security bulletin, the zero-day—tracked as CVE-2026-20700—is a memory corruption issue in dyld, Apple's \"Dynamic Link Editor.\" The flaw could allow attackers with memory write capability to execute arbitrary code—or, in other words, run their own code on your device.Apple says that the vulnerability may have been exploited in an \"extremely sophisticated attack against specific targeted individuals\" in earlier versions of iOS alongside CVE-2025-14174 and CVE-2025-43529. Those at greatest risk with this bug are likely high-profile users with access to sensitive data—users who might be inclined to use Apple's Lockdown Mode—but everyone should install the update to patch the issue. \nThe patch for this flaw is available for the following iOS and iPadOS devices, in addition to all Macs that run macOS Tahoe:\n            \n                What do you think so far?\n            \n        \niPhone 11 and lateriPad Pro 12.9-inch 3rd generation and lateriPad Pro 11-inch 1st generation and lateriPad Air 3rd generation and lateriPad 8th generation and lateriPad mini 5th generation and laterHow to install the latest security update for iPhoneYou should have automatic updates enabled to ensure you receive critical security patches ASAP, but you can confirm that you're on the latest OS version under Settings > General > Software Update. As a reminder, Apple won't message you urging you to click links, download attachments, or install apps related to security updates. Always go through your device settings to receive official fixes. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Just Patched Its First Zero-Day Security Vulnerability of 2026",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH9B1B0Q2NK5PAYNYW5KKY8R/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-12T18:00:00.000Z",
      "dateModified": "2026-02-12T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft Just Patched a Major Security Vulnerability for This Popular Windows App",
    "url": "https://lifehacker.com/tech/microsoft-patched-major-security-vulnerability-in-notepad?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHPEBJE21VX2948H0YEVM1QR/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-17T20:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 17, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: aileenchik/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Microsoft patched a security flaw with Notepad that left users vulnerable to exploits.\n                                            Users could click a malicious link inside a Markdown file in Notepad that would allow attackers to run arbitrary code.\n                                            Microsoft's push to add AI features to its OS may be contributing to the rise in bugs and security flaws.\n                                            Users can protect themselves by installing Microsoft's latest security update, which includes the patch for this Notepad glitch.\n                                    \n            \n    Table of Contents\n    \n        \n        AI-related changes to Notepad—yes, that Notepad—allowed attackers to execute arbitrary code on your computer. The vulnerability was related to Markdown support, which was added last year. Markdown is a simple way to add formatting, including links, to plaintext documents—and links were the source of the vulnerability.\"An attacker could trick a user into clicking a malicious link inside a Markdown file opened in Notepad, causing the application to launch unverified protocols that load and execute remote files,\" according to the security response notice. Markdown has long been popular in certain parts of the internet—anyone who occasionally comments on Reddit or chats using Discord is likely at least a little familiar with it. But the markup language has become even more important in the age of AI—most documents are converted to plain text Markdown files to train models.\nMicrosoft is patching more bugs than ever in Windows 11Markdown support was added around the same time Copilot was integrated into Notepad, as part of a broader push to add AI to every corner of the operating system. And there's an argument to be made that all these AI additions are adding up to new vulnerabilities. Microsoft patched 1,129 bugs in 2025 according to Krebs on Security, a prominent cybersecurity blog. That's an 11.9% increase over the previous year, which was already unusually high. Microsoft itself admits that AI agents will open up new vulnerabilities, even as the company adds them to Windows.\n            \n                What do you think so far?\n            \n        \nThis is all to say that installing security updates is likely more important now than ever. Sure, you could disable all AI features in Windows, but that's unlikely to protect you from all the new vulnerabilities—installing Linux might, though.How to patch this Notepad vulnerability \n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nLuckily for Windows users, this vulnerability was fixed in Microsoft's February 2026 security update. To find out if you've installed it, open the Settings app, head to \"Windows Update,\" then check if an update labeled \"2026-02 Security Update\" is waiting to be installed. If so, click the \"Restart Now\" button to install the update. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft Just Patched a Major Security Vulnerability for This Popular Windows App",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHPEBJE21VX2948H0YEVM1QR/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-17T20:00:00.000Z",
      "dateModified": "2026-02-17T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]