[
  {
    "title": "Check This iPhone Setting to Make Texting Better for Everyone",
    "url": "https://lifehacker.com/tech/check-this-iphone-setting-to-make-texting-better-for-everyone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEWDA68BYW5KT04J8C7XHEHA/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-13T21:00:28.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: enesdigital / Shutterstock.com\n                            \n    Table ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: enesdigital / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Hey, would you mind doing me a favor real quick? If you're on an iPhone, can you double check that you've got RCS chat enabled for me? Thanks, I appreciate it. See, as an Android user, I don't get to use all the fun iMessage features, but RCS lets us share some of them. The only problem is, iPhones seem to sometimes disable RCS for some chats after an update. Or for no reason at all.RCS has been around for a while, but since it needs to be supported on both the carrier and device level, it's taken some time to reach ubiquity. Understandably, you might have seen some chat conversations between iOS and Android users that still default to the older SMS-style texting, and just gone about your day. However, these days, if you're chatting with your Android friends and you don't see read receipts, or your pictures and videos are coming through in potato quality, there's probably an easy fix.To check if RCS is enabled on your phone:\nOpen the Settings app on your iOS device, then go to Apps.Go to Messages > RCS MessagingEnable the RCS Messaging toggle.And that's it! If you text your contacts from multiple devices, it's also worth checking for RCS support on each of them. It might be a little annoying, but trust me, your Android friends will thank you.\n            \n                What do you think so far?\n            \n        \nIf you're the one using an Android phone, it can also be worth double-checking that RCS support is enabled, although it's less likely to be a problem. While iOS devices support both iMessage and RCS as robust texting options, Android only has RCS. Both platforms can fall back to SMS, but your Android phone probably reaches for RCS as a default. Still, it can't hurt to check. The specific directions will differ based on manufacturer, but generally you can go to your default messaging app's settings and look for an \"RCS Chats\" section to make sure the protocol is enabled on your end as well.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Check This iPhone Setting to Make Texting Better for Everyone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEWDA68BYW5KT04J8C7XHEHA/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-13T21:00:28.000Z",
      "dateModified": "2026-01-13T21:00:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "X Is Currently Down",
    "url": "https://lifehacker.com/tech/x-is-currently-down?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEVWYVYYQKQTCNE5T7S3T07G/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-13T14:53:51.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Lifehacker\n                            \n            \n                Key Takeaways\n                                            X is down, as of 9:30 a.m. ET on Jan. 13.\n                                            The website wouldn't load for me, and has tens of thousands of user reports on Downdetector.\n                                            It doesn't appear to be related to a cloud hosting service, like AWS or Cloudflare.\n                                    \n            \n    Table of Contents\n    \n        \n        It's not just you: X is down, and will not load. I discovered the issue myself just after 9:30 a.m. ET. I was scrolling on my feed, when all of a sudden, new posts wouldn't load, and I was greeted by an option to refresh. When I did, the site reloaded, but now without any posts—only the futile option to try reloading again.You can see a steep spike in user reports on Downdetector (which, for full disclosure, is owned by Lifehacker parent company Ziff Davis). At the time of writing, roughly 25,000 users had reported issues with X, I among them. There are a number of potential reasons why X won't load this morning, but it doesn't appear to be a larger issue with a cloud hosting service. Anytime a major website like X goes down, it harkens back to global outages, stemming from issues with cloud hosting services like AWS and Cloudflare. However, a quick check on Downdetector shows me that few other sites and services are having massive outage reports at the moment. That could change, but as of this article, it seems like X's issues are their own.\n            \n                What do you think so far?\n            \n        \nX will no doubt get things back up and running soon. In the meantime, maybe it's best for all of us to get off the site for a change.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "X Is Currently Down",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEVWYVYYQKQTCNE5T7S3T07G/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-13T14:53:51.000Z",
      "dateModified": "2026-01-13T14:53:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Visible Is Also Offering a Credit for This Week's Verizon Outage",
    "url": "https://lifehacker.com/tech/visible-is-also-offering-a-credit-for-the-verizon-outage?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF43JBJEEHSP9GRZDR2V79V7/hero-image.fill.size_1200x675.webp",
    "tag": "Life",
    "date": "2026-01-16T20:10:38.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle Ehrhardt is Lifehacker's Associate Tech Editor. She has a bachelor's degree in history from Earlham College, where she also double majored in theatre. She also holds an MFA in game design from NYU. Michelle's career as a journalist began at Out Magazine, where she covered games, music, film, and politics with an eye towards the LGBT perspective.Michelle is a member of the New York Video Games Critics Circle, where she sits on the Game Journalism Award committee. She has participated in panels and workshops at New York's DreamYard Program and has hosted both the Tom's Hardware Show and the Gadgettes podcast.Her work has been featured in outlets including Paste, The Atlantic, Tom's Hardware, Gizmodo, and The Advocate. Some of her favorite pieces include her annual CES recaps, her video game reviews, and her interviews with hardware makers and independent video game developers.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Sarah Tew/CNET\n                            \n            \n                Key Takeaways\n                                            Verizon's low cost spin-off carrier, Visible, is offering its users a credit to make up for the outage on Wednesday.\n                                            Users will be able to apply this credit while paying their next bill.\n                                            The payout is smaller than Verizon's, but represents a similar value when compared to Visible's smaller bills.\n                                    \n            \n    Table of Contents\n    \n        \n        After Verizon's unexpected nationwide outage Wednesday, the carrier came out yesterday to try to save face, saying it was offering a $20 credit to all accounts in the myVerizon app. Now, its low-cost offshoot carrier, Visible, is also trying to make its own amends.As spotted by 9to5Google, Visible is texting its customers with the following message, promising a $5 credit on their next bill as an apology for the outage:Yesterday we let you down and for that we are sorry. We are giving you a $5 credit towards your next month of service that can be redeemed after Jan 16 when paying with a credit card online. This credit isn’t meant to make up for what happened. But it’s a way of acknowledging your time and showing that this matters to us. If you’re still having trouble connecting, please restart your device (power down and power back on).The amount may be smaller, but it does seem to be a bit more convenient to claim, since it sounds like you can apply it while paying your bill (although I can't make any promises for people using auto pay). Like Verizon's offer, it also doesn't seem to be discriminating between those affected by the outage and those who weren't, as noted by a user on Reddit.\nSome comments from other Visible subscribers on Reddit did point out that they had yet to receive the text, although I'm assuming that's due to a slow rollout more than anything else, as textless users who reached out to customer service were able to confirm they were offered the $5 credit as well. I've reached out to Visible to confirm if the $5 credit applies to everyone, and will update this post when I hear back (I also asked if it would be applied to automatic payments).As for why the payment is so much smaller, it's probably due to the difference in cost between Verizon and Visible. Verizon said it based its $20 payout on the price for \"multiple days of service,\" and frankly, those same days cost much less on Visible.\n            \n                What do you think so far?\n            \n        \nWhile Visible uses the same network as Verizon, it sets itself apart by giving its users lower priority while connecting, which lets it offer unlimited plans starting at $20/month. Prices range to $33/month, but essentially, $5 goes a lot further on the low cost network, meaning it represents a similar value to $20 for a proper Verizon plan.Whether that's a fair price for an unexpected day of spotty connectivity, I'll leave up to you.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Visible Is Also Offering a Credit for This Week's Verizon Outage",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF43JBJEEHSP9GRZDR2V79V7/hero-image.fill.size_1200x675.webp"
      ],
      "datePublished": "2026-01-16T20:10:38.000Z",
      "dateModified": "2026-01-16T20:10:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "We Now Know What Caused the Verizon Outage",
    "url": "https://lifehacker.com/tech/we-now-know-what-caused-the-verizon-outage?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF1RXB8A4970TPAPWE5MHCC1/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-15T21:55:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 15, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: RAMAN SHAUNIA/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Verizon has finally confirmed what caused yesterday's nationwide outage.\n                                            The company shared a statement with Mashable, confirming the outage stemmed from a software issue.\n                                            Verizon specified the outage was not caused by a cyberattack.\n                                    \n            \n    Table of Contents\n    \n        \n        By now, you've no doubt heard about (or experienced yourself) yesterday's massive Verizon outage. For nearly all of Wednesday, roughly two million Verizon customers could not connect to the network, and had to rely on wifi to use their smartphones, which were otherwise stuck in SOS mode. Sure, they could call 911, but they couldn't do much else. It was an ordeal, one Verizon is literally paying for: The company committed to issuing $20 account credits to affected customers. It might not be as much as some of us think the company should offer, but it's something. And if the $20 isn't a comfort, the fact that the outage is over should be—even if you needed to restart your phone this morning to implement the fix.The weirdest part of the whole affair was that Verizon didn't initially offer any details about what caused the outage. The company posted throughout yesterday, issuing updates and responding to angry customers, but never shedding light on why their network was down for so many customers. Finally, a day and a half after the outages kicked off, the company has an answer, albeit a partial one. \nA software issue caused the Verizon outage, not a cyber attackAccording to a statement Verizon sent to our sister site Mashable, the cause of the outage was simply a problem with the company's software. \"This was a software issue and we are conducting a full review of what happened,\" the company said. \"As of now, there is no indication that this was a cyber security issue.\" That last bit is important, as some customers took the outage as evidence of some type of cyber attack. While those worries seem to be unfounded, considering the current state of the world, I understand those fears. \n            \n                What do you think so far?\n            \n        \nStill, while it's nice to have some sort of explanation, I could do with more details. This wasn't a minor, temporary outage affecting only a limited number of users; customers across the country couldn't connect to Verizon for most of the day. Software issues happen, but they usually don't take down one of the three major carriers in the United States. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We Now Know What Caused the Verizon Outage",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF1RXB8A4970TPAPWE5MHCC1/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-15T21:55:00.000Z",
      "dateModified": "2026-01-15T21:55:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'RageCheck' Points Out Manipulative Language in News Articles",
    "url": "https://lifehacker.com/tech/ragecheck-manipulative-language-news-articles?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF1W4B1JNSVX3RJ1FNN8CZW8/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-16T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 16, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        If you don't like how the internet makes you feel right now, you're not alone. The entire ecosystem seemingly exists to manipulate you, which can make finding clarity hard. I've written about how to avoid anxiety bait, which can be an important step toward healthy and productive engagement, but an important step is recognizing when you're being manipulated. RageCheck is a potentially useful tool here.Built using concepts from social science research, this website can analyze any link or screenshot. It points out examples of potentially manipulative language, from us-versus-them framing to emotionally loaded phrasing. \"The system analyzes text for linguistic patterns commonly associated with manipulative framing—language optimized to provoke high-arousal reactions over understanding,\" says the methodology page. \"It does not assess factual accuracy or political bias.\"Using the site is simple: just paste a link to an article and hit Enter. After a few moments, you'll see a statistical breakdown of the potentially manipulative language in the piece across five categories—emotional heat, us versus them, moral outrage, black-and-white thinking, and fight picking. The article is excerpted below, with examples of these tactics highlighted. In the left panel you'll see a \"Bait Score,\" which is an attempt to calculate how manipulative the article is being. Below that, you'll see a list of the potentially manipulative techniques employed in the article.\nNone of this is intended to be used as an alternative to fact checking or serve as some kind of truth-detecting machine. \"A high score means content uses manipulative framing—it doesn't mean the underlying claims are false,\" says the about page. \"Conversely, a low score doesn't mean content is true.\"\n            \n                What do you think so far?\n            \n        \nIt's worth pointing out that the techniques this tool detects also aren't necessarily bad. Some news stories really should inspire moral outrage, especially in the context of an opinion piece or editorial. Regardless, there's still value in identifying those techniques.Basically, this is a tool that can help you think critically about the media you're consuming, not do that critical thinking for you. Use it if you want to learn a little bit about the kinds of rhetorical tricks you might be vulnerable to.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'RageCheck' Points Out Manipulative Language in News Articles",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF1W4B1JNSVX3RJ1FNN8CZW8/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-16T14:00:00.000Z",
      "dateModified": "2026-01-16T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spotify Is Raising Prices Yet Again",
    "url": "https://lifehacker.com/entertainment/spotify-is-raising-prices-again?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KF1528KXYVYE2NFHBF575YW5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-15T16:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle Ehrhardt is Lifehacker's Associate Tech Editor. She has a bachelor's degree in history from Earlham College, where she also double majored in theatre. She also holds an MFA in game design from NYU. Michelle's career as a journalist began at Out Magazine, where she covered games, music, film, and politics with an eye towards the LGBT perspective.Michelle is a member of the New York Video Games Critics Circle, where she sits on the Game Journalism Award committee. She has participated in panels and workshops at New York's DreamYard Program and has hosted both the Tom's Hardware Show and the Gadgettes podcast.Her work has been featured in outlets including Paste, The Atlantic, Tom's Hardware, Gizmodo, and The Advocate. Some of her favorite pieces include her annual CES recaps, her video game reviews, and her interviews with hardware makers and independent video game developers.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 15, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Diego Thomazini/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Spotify is raising its U.S. subscription cost by $1 to $2, depending on your plan.\n                                            The price hike follows previous price increases in 2023 and 2024.\n                                            If you can find one near you, a Spotify gift card can help you snag a discounted annual rate.\n                                    \n            \n    Table of Contents\n    \n        \n        If you're subscribed to Spotify, start checking your inbox. The music streaming service is sending emails to customers letting them know about yet another price hike coming next month.To Spotify's credit, the price hike is pretty minor. But starting on whatever your February billing date is, individual premium plans will jump from $11.99/month to $12.99/month, while student plans will go from $5.99/month to $6.99/month. More extensive plans will see a slightly more costly jump. The Duo plan, which gives premium access to two people at the same address, is going from $16.99/month to $18.99/month. The Family plan, which gives premium access to up to six people at the same address, will also see a $2 increase, now costing $21.99/month rather than $19.99/month.\nThe price hikes are set to affect the U.S., Estonia, and Latvia, according to Spotify's announcement. The company's rationale for all this? According to the post, \"occasional updates to pricing across our markets reflect the value that Spotify delivers.\"Truthfully, $1 to $2 does seem like a pretty minor change, but the update follows another U.S. price hike in 2024, where Individual plans went up by $1, Duo plans went up by $2, and Family plans went up by $3. And that came after a price hike in 2023, where the Individual, Student, and Family plans went up by $1, while the Duo plan went up by $2. Certain subscribers outside of the U.S. also saw their own price increases in 2025. I can't help but feel like a frog in a slowly boiling pot.\n            \n                What do you think so far?\n            \n        \nThe continual barrage of price hikes is a bit of a disappointment for subscribers who had gotten used to a steady price for Spotify since its U.S. launch in 2011, as the service went for 12 years before its first price change. If all these price hikes are starting to get to you, you might be able to get around them. If you can find one at a store near you, you can pay upfront for a discounted annual subscription using a Spotify gift card, although it won't apply to Spotify's Family or Student plans. Unfortunately, Spotify does not have an annual subscription plan available on its website.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spotify Is Raising Prices Yet Again",
      "image": [
        "https://lifehacker.com/imagery/articles/01KF1528KXYVYE2NFHBF575YW5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-15T16:30:00.000Z",
      "dateModified": "2026-01-15T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Betterment Users Are Being Targeted in This Crypto Scam",
    "url": "https://lifehacker.com/money/betterment-users-are-being-targeted-in-this-crypto-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEX03B4475XYZ4N8PBFZWHRA/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-14T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            Customers of automated investment platform Betterment are being targeted with a cryptocurrency rewards scam.\n                                            Threat actors gained access to a third-party system and sent emails to some users from a legitimate Betterment subdomain.\n                                            Login credentials weren't compromised, but you should be wary of any communication about your Betterment account.\n                                    \n            \n    Table of Contents\n    \n        \n        Customers of automated investment platform Betterment are being targeted with a cryptocurrency rewards scam following a data breach that allowed threat actors to obtain some user data and send fake emails promising huge returns on Bitcoin and Ethereum deposits. According to a Jan. 12 security update posted on Betterment's website (and sent to users via email), hackers gained unauthorized access on Jan. 9 to a third-party platform used for marketing and operations. Following the breach, they sent fraudulent messages to some customers with offers to triple crypto investments. The scam emails were sent to Betterment users on Jan. 9, soon after the data breach, with subject lines like \"We'll triple your crypto!\" The message inside claimed that Betterment was \"giving back\" for a limited time and tripling Bitcoin and Ethereum deposits as large as $750,000 to specified wallets. Threat actors tried to create a sense of urgency with an expiration deadline for the promotion (a typical scam tactic). \nThe messages came from [email protected], which is a legitimate Betterment subdomain, allowing them to appear verified in users' inboxes. Note that this is the same email address Betterment used to send the security update to all of its customers. A nearly identical crypto scheme targeted Grubhub users in December with emails—also sent from a real Grubhub subdomain—promoting a 10x return on $1,000 in deposited bitcoin. \n            \n                What do you think so far?\n            \n        \nBetterment data hackedCybercriminals were able to steal some customer information from the compromised system, including names, email addresses, mailing addresses, phone numbers, and dates of birth. Betterment has said that no passwords or credentials were included in the breach, nor did threat actors gain access to user accounts. While few official details have been published, the company is reportedly being extorted as the target of the distributed denial-of-service (DDoS) attack. If you're a Betterment customer, be wary of any unsolicited communication in the coming days and weeks about your account. Scammers will use events like this as a phishing opportunity. Know that Betterment (and other legitimate companies) will not request your password or other personal information via email, text, or phone call. If you are concerned about your account or want to update your credentials or other data, go directly to the website or app and do so there—this is generally safer than clicking links in communication, even if messages from Betterment are (or seem) legitimate. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Betterment Users Are Being Targeted in This Crypto Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEX03B4475XYZ4N8PBFZWHRA/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-14T14:00:00.000Z",
      "dateModified": "2026-01-14T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This App Brings Some of My Favorite Windows Features to Mac",
    "url": "https://lifehacker.com/tech/this-app-brings-some-of-my-favorite-windows-features-to-mac?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEXSRGN5TZ31YRPCRT6TZGJD/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-14T15:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: aileenchik via Shutterstock\n                            \n    Table of Contents\n    \n        \n        As someone who regularly switches between the Mac and PC, I really can't live without the PowerToys app on Windows. It adds little missing features that I really like on the Mac, like a Spotlight Search alternative, auto dark mode, screen awake, on-screen OCR (which lets you pull text from images), and more.But the reverse is also true. When I'm on MacOS, I start to miss the little features and commands that I've been used to Windows having for decades now (I started using Windows in school, but was only exposed to macOS when I was in college).It's the little things, like not being able to cut and paste files in Finder. And why must I accidentally open the Music app every time I press the play button? This is just the beginning.\nEnter Supercharge, a utility from prolific indie developer Sindre Sorhus. Think of it not as a single app, but as a Swiss army knife for your menu bar—a collection of micro-utilities designed to patch the specific usability holes that Apple has left open, many of which Microsoft has already plugged. The app offers an unlimited free trial (with a prompt to upgrade every 12 hours), or you can buy it outright for $18. It's also available as part of a Setapp subscription. \n    \n            \n            \n                                        Credit: Supercharge\n                    \n    \nThe best Supercharge tweaks that you should enableThe Supercharge app works in two ways. The first is by giving you a set-and-forget settings menu. Secondly, it adds a menu bar app where you can quickly access small features on the fly.The tweaks part, to me, is a lot more interesting. Once the app is installed, open the menu bar app and go to Settings. Go to the Tweaks tab and take some time to customize your Mac's behavior.Make Finder work more like Windows File Explorer\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThe Finder is where Supercharge shines, fixing legacy behaviors that have frustrated Windows switchers for years. The first thing I enabled was the \"Cut and Paste\" functionality. Finally, you can use Cmd+X to cut a file and Cmd+V to move it, eliminating the awkward Cmd+C followed by Cmd+Option+V dance required by default.Beyond moving files, the app allows you to enable the Option+N shortcut to instantly create a new text file in your current folder—another Windows muscle memory I've had for decades. Additional tweaks include toggling the Enter key to open a file instead of renaming it, and an option to show hidden files by default.Mission Control featuresApple's Mission Control provides a bird's-eye view of all your windows, but it's hardly interactive. Supercharge changes that by adding window management buttons directly to the overlay. You can now add dedicated Close, Minimize, and Quit buttons for every window inside Mission Control, helping you clear cluttered app windows in seconds, and in a fairly visual way.Dock enhancementsSupercharge also brings much-needed flexibility to the Dock, making it more like the taskbar on Windows or Linux. Enable the Click-to-Hide feature, and you can minimize or hide an app simply by clicking on the app icon. My favorite, though, is the option to open folders directly in the Finder from the Dock. You can also set Supercharge to add spacers to the Dock, and quit apps using the middle-click mouse button.\n            \n                What do you think so far?\n            \n        \nThe Apple Music app fixPerhaps the most useful fix in the entire suite is the ability to stop Apple Music from launching automatically. This feature stops the app from popping up when you press Play on your keyboard or Bluetooth headphones. If you are a dedicated Spotify user or simply dislike it when your headphones accidentally wake up Apple Music, this feature alone makes a Supercharge installation worth it.Other useful featuresThe Supercharge app includes several other quality-of-life improvements. The Notification Nuke feature allows you to set a global hotkey to instantly clear all notifications from Notification Center, acting as a panic button for focus. To prevent accidents, you can also enable Accidental Quit Prevention, which requires a double-press or a Shift + Cmd + Q combo to actually quit an application.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThe second part of the equation here is the menu bar app. Here, you can add small missing features that usually require downloading separate apps. There are more than two dozen options. Go to Settings > General > Show Menu Items to see the whole list.Here, you can add options to quickly capture and copy any text from an image (or translate it). There are one-click options for hiding all windows, showing the desktop, quitting all apps except the current one, clearing all notifications, and more. There's also a simple Keep Awake feature that will keep your Mac active even when the screen is off. And there's also a simple default browser switcher built-in, though I prefer using Sindre's dedicated Default Browser app.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This App Brings Some of My Favorite Windows Features to Mac",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEXSRGN5TZ31YRPCRT6TZGJD/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-14T15:00:00.000Z",
      "dateModified": "2026-01-14T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Is Changing Its Account Policy About Minors Who Turn 13",
    "url": "https://lifehacker.com/tech/google-is-changing-its-account-policy-about-minors-who-turn-13?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEWH9AKZEB6DT0NMKSDJQ2A7/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-13T22:00:40.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: syartinolky/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is changing its policy for Family Accounts, and now requires a parent's permission to remove supervision on a teen's account.\n                                            Previously, Google allowed 13 year olds to disable supervision on their own, with no input from the parent required.\n                                            The change follows some pushback from parents, who believe Google shouldn't email minors about removing supervision from their accounts.\n                                    \n            \n    Table of Contents\n    \n        \n        If you have a Family Account through Google, you might assume you can control what your child can see or do on their device. You can, but, as it happens, only up to a certain point. When your kid turns 13, Google will send them an email, letting them know they can choose to disable your supervision over their account. You get an email too, but they don't need your permission to lock you out of their device. Once they decide they're ready for a relatively complete Google Account experience, it's their choice to make. Despite being Google's official policy, this situation was not common knowledge. Following a relatively viral LinkedIn post about the subject, parents were peeved at the notion of Google deciding that their 13 year old was ready to be unsupervised on the internet. Google's Family Account does allow kids to stay on supervised plans after they turn 13, but they can choose to remove the supervision at any point, which largely defeats the purpose. Unless your child really respects your rules, they likely won't keep their account locked down when they don't have to.  Parents can still supervise their 13 year olds' Google Accounts Luckily for parents, that's now changing. In a separate LinkedIn post, Google's Kate Charlet announced that under a planned policy update, minors will need to get their parents' permission before disabling supervision. (Charlet also referred to turning 13 as the \"age of digital consent,\" which seems to me to be an extremely strange way to say \"old enough to have an unsupervised Google Account.\") \nWhen I reached out to Google about the changes, the company told me that the policy should now be adjusted. As such, 13-year-olds shouldn't be able to remove supervision without permission. That said, Google's support documents have not yet been updated, so it might take some time to fully roll out. Speaking of Google's former support documents, the company notes that when kids did choose to remove permissions, their device would lock up temporarily. When I asked Google about this, I was told that due to the change in policy, device lock is no longer a feature. However, it's still unclear to me how this feature worked when kids could remove permissions on their own: Did parents have to manually unlock the device for their kids? Would devices unlock after a set period of time? I've reached back out to Google about these questions, though they might not matter once teens need their parents' permission. \n            \n                What do you think so far?\n            \n        \nWhat does this mean for my child's Google Account?As I explain in my post here, removing supervision takes a lot of controls away from parents, and gives teens a lot more responsibility. Parents can't control screen time, manage payment cards and transactions, and can't block standard YouTube in favor of YouTube Kids. In addition, kids can choose to stop sharing their location with you if they want to.But now that parents have the authority here, these controls can continue for your 13-year-old. If you want them to keep their location turned on, they won't have the option to turn it off; if you want to monitor their transactions, they can't stop you; if you don't want them having a credit card, they won't be able to add one—at least, until you manually disable supervision on your end. It's a good thing that Google is giving families more options, and it joins other big tech companies, like Meta, doing the same. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Is Changing Its Account Policy About Minors Who Turn 13",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEWH9AKZEB6DT0NMKSDJQ2A7/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-13T22:00:40.000Z",
      "dateModified": "2026-01-13T22:00:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft's Latest Patch Tuesday Fixes 114 Vulnerabilities",
    "url": "https://lifehacker.com/tech/microsoft-patch-tuesday-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEWSRKZ2BAFKD483MGAJ5048/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-14T13:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: ACHPF/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Microsoft's Patch Tuesday update for January addresses 114 vulnerabilities in total, including three zero-days.\n                                            Eight of the vulnerabilities are labeled as \"critical.\"\n                                            Ensure your Windows machine has updated and installed these security fixes.\n                                    \n            \n    Table of Contents\n    \n        \n        Microsoft has released its \"Patch Tuesday\" update for January, and you should ensure your computer receives these security fixes as soon as possible. This update addresses 114 vulnerabilities in total, including three zero-days (bugs that have been actively exploited or publicly disclosed before an official fix is available from the developer). As reported by BleepingComputer, security flaws were found across the following categories: 57 elevation-of-privilege vulnerabilities, three security feature bypass vulnerabilities, 22 remote code-execution vulnerabilities, 22 information disclosure vulnerabilities, two denial of service vulnerabilities, and five spoofing vulnerabilities. Six of the remote code execution vulnerabilities and two of the elevation of privilege vulnerabilities are considered \"critical.\" Your machine should receive security updates automatically when Patch Tuesday drops, which is around 10 am PT on the second Tuesday of the month. You can check to confirm by going to Start > Settings > Windows Update and selecting Check for Windows updates\nThree zero-days patched in JanuaryOne of the three zero-days fixed this month has been actively exploited in the wild. The flaw, labeled CVE-2026-20805, is an information disclosure vulnerability in the Desktop Windows Manager that allows attackers access to memory addresses from a remote ALPC port. Microsoft Threat Intelligence Center (MSTIC) & Microsoft Security Response Center (MSRC) have been credited with identifying this bug. \n            \n                What do you think so far?\n            \n        \nThe other two zero-days have been publicly disclosed. CVE-2026-21265 is a security bypass feature vulnerability that allows threat actors to bypass Secure Boot on systems that have not updated certificates issued in 2011 and nearing expiration. CVE-2023-31096 is an elevation of privilege vulnerability in third-party Agere Soft Modem drivers that ship with supported Windows operating systems installed. Microsoft has removed these drivers from Windows. Microsoft released other non-security updates today, as well as additional patches for Microsoft Edge and Mariner vulnerabilities earlier this month.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft's Latest Patch Tuesday Fixes 114 Vulnerabilities",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEWSRKZ2BAFKD483MGAJ5048/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-14T13:30:00.000Z",
      "dateModified": "2026-01-14T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Find Free Movies (Legally) With WikiFlix, a Database of Films in the Public Domain",
    "url": "https://lifehacker.com/tech/find-free-movies-legally-with-wikiflix-a-database-of-films-in-the-public?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEVNNV3VH06MZKWV4DHKQWP5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-13T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Lifehacker\n                            \n    Table of Contents\n    \n        \n        I love movies, and especially when I can watch them for free: And while streaming the latest Hollywood blockbusters might come at a price (at least for those wanting to stay on the right side of the law), there's an ever-growing collection of older films that you can get at online without paying a dime.The site WikiFlix (as spotted by the fine folks at Gizmodo) lists movies available to stream that are now in the public domain. The way that copyright works in the U.S. basically means that copyright expires on films after a period of 95 years—so with every year that passes, a batch of new flicks become available to view by anyone, free of charge.If you're looking for something classic for your next movie night, it's well worth a look. \n\n    \n            \n            There are plenty of categories to choose from.\n                                        Credit: Lifehacker\n                    \n    \nWikiFlix is straightforward to use, right from the homepage. It tracks films added to sites such as Wikimedia Commons, YouTube, and the Internet Archive, and whenever you click through on a movie, you can also see where it has come from. When you've made your pick, it streams right in your browser window.The home page is split up into categories that you can browse through—including female directions, animations, and biographical films, the last time I checked—and there's also a search button up in the top right corner if you know what you're looking for. Next to the search button is an account button, which enables you to sign up for a MediaWiki account if you want to be able to contribute to the site too.Hover over the main WikiFlix heading at the top of the page and a quick link to Movies by year pops up. This is a useful way of finding the most recent flicks added to WikiFlix, and digging back into the archive—not all of the movies here are in the public domain because their copyright has expired, and you will find more recent titles too.Click through on any thumbnail to get more information about each movie. You can typically get information on the director, cast, and running time, and a plot summary is included too. Some of the entries come with trailers (although you can also search for these separately on sites like YouTube).\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            Each movie comes with a cast list.\n                                        Credit: Lifehacker\n                    \n    \nStart streaming a movie, and the usual playback controls appear, though the interface does depend to some extent on the site that's hosting the movie. For films hosted on YouTube, for example, you can typically adjust the playback quality and speed. Some movies come with subtitles too.Obviously a site like this is going to skew towards older, classic movies, but there's plenty to explore here: Metropolis, It's a Wonderful Life, All Quiet on the Western Front, Nosferatu, Charlie Chaplin comedy The Gold Rush, and lots more.Free movie repositories aren't quite as rare online as you might think. We've written before about the best free and legal streaming services for movies and TV, featuring ad-supported streaming platforms such as Tubi and PlutoTV. Again, the emphasis is on older films, but there's a huge amount on offer at no charge.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Find Free Movies (Legally) With WikiFlix, a Database of Films in the Public Domain",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEVNNV3VH06MZKWV4DHKQWP5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-13T14:00:00.000Z",
      "dateModified": "2026-01-13T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Four Ways to Speed Up Your Hot Water (Without Installing a Tankless Water Heater)",
    "url": "https://lifehacker.com/home/how-to-speed-up-your-hot-water-without-a-tankless-water-heater?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KESNDX88GQA4F25ZZBKVYQ0Q/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-12T19:00:19.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jeff Somers\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jeff Somers\n                            \n        \n            Jeff Somers\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceJeff Somers is a freelancer who has been writing about writing, books, personal finance, and home maintenance since 2012.Jeff has published nine novels and more than 70 short stories; his story Ringing the Changes was selected for inclusion in The Best American Mystery Stories 2006. In 2018, Jeff published the book Writing Without Rules: How to Write & Sell a Novel Without Guidelines, Experts, or (Occasionally) Pants. He holds a bachelor’s degree in English and previously worked in medical publishing as a production editor. When not writing, Jeff spends his free time fixing up his old house. He has tackled a wide range of DIY projects, including remodeling a bathroom entirely on his own in two weeks, and building a roof deck that hasn't fallen down yet. You can find him on Bluesky.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Lensw0rId / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Despite all of the technological advances that have made our lives so comfortable and convenient, from on-demand movies to smart devices that can be controlled from a handheld computer in our pockets, there are still some primitive situations we have to endure. For example, that seemingly endless time spent shivering in the shower while you wait for the water to heat up. Or that painful moment when you go to wash your hands and water that feels like it’s being pumped directly from the Arctic splashes you.Waiting for the water to heat up is an age-old problem caused by simple laws of physics: Your water heater is far away from the tap or shower head, and it takes time to flush out the cold water in the pipes. But there are ways to speed up your hot water delivery. The easiest is to install a tankless water heater, but those can cost thousands of dollars to install, and require a lot of space your house may not have. If you want to speed up your hot water without taking on that much of an expense, you have a few more affordable choices.Install a recirculating pumpOne reason it takes a while for hot water to arrive is time: When you turn off the faucet, the hot water sitting in the pipes starts to cool off. The next time you turn on the tap, that cooled water has to be pushed out of the hot water pipes before the hot water can arrive.\nTo solve this, you can have a recirculating pump installed at a cost typically under $1,000. These pumps are installed on your existing water heater, and work by continuously circulating the water in the pipes so it never sits there, cooling off. Because it’s installed at the water heater, it speeds up hot water to your appliances, as well, including washing machines and dishwashers, which can help them operate more efficiently.Point-of-use tankless heatersWhile a whole-house tankless water heater can be a big and expensive project, what’s known as a “point-of-use” tankless water heater can be a more manageable and affordable solution. These are small enough to install under a sink, and are designed to provide hot water on demand just at that point of use. The heaters themselves typically run a few hundred bucks, with installation typically running less than $1,000. Because of their small size, it’s feasible to install one of these yourself if you’re comfortable with plumbing and electrical work, but they can require careful calibration, so hiring a professional plumber is probably your best move.\n            \n                What do you think so far?\n            \n        \nInsulateSince part of the problem with slow hot water is heat loss as the water sits in the pipes, you can sometimes improve the situation just by insulating your hot water pipes thoroughly. This is definitely a DIY job if you can identify and access your hot water pipes, and it’s not a terribly expensive job to hire out, costing as little as $350 on average. It’s just a matter of wrapping the pipes with insulating cuffs, then taping everything off so it’s sealed up nicely. This can help keep water hot while it sits, so the next time you turn on the faucet, you get the hot water you expect.Adjust restrictorsCold water has to drain out of your pipes for the hot water to hit your faucet or showerhead, so one possible way to speed things up is to remove any flow regulators/restrictors that have been installed. These simple devices do exactly what it sounds like: They restrict the flow of water, conserving energy and water and keeping your utility bills lower. But since they restrict flow, they also mean it can take longer for cold water to drain off and hot water to arrive, so removing or adjusting them can reduce the time it takes for that hot water to get to you.\n            \n    \n    \n            Never miss a story\n                Get the latest smart home news, trends, and advice from Lindsey and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Four Ways to Speed Up Your Hot Water (Without Installing a Tankless Water Heater)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KESNDX88GQA4F25ZZBKVYQ0Q/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-12T19:00:19.000Z",
      "dateModified": "2026-01-12T19:00:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Is Why You're Having Trouble Resizing Windows in macOS Tahoe",
    "url": "https://lifehacker.com/tech/this-is-why-you-are-having-trouble-with-windows-in-macos-tahoe?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KESFZJPJ0ZR692131HZW8APJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-12T18:30:57.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Apple/YouTube\n                            \n            \n                Key Takeaways\n                                            macOS Tahoe has an odd quirk when it comes to window resizing.\n                                            The latest update makes it more difficult to grab the corner of any given window, placing most of the target area outside the window itself.\n                                            This issue seems like something that would be easy for Apple to fix, but the company has not publicly acknowledged the issue at this time.\n                                    \n            \n    Table of Contents\n    \n        \n        Apple's latest crop of updates was met with a bit of a mixed reaction. While some users love the new Liquid Glass design across iPhone, iPad, and Mac, others decidedly do not—which is likely what led Apple to introduce a dedicated setting to control the intensity of the effect. I'm partial to it, but I understand for some users, it's a tad too much, especially if it makes certain UI elements more difficult to see. But Liquid Glass isn't the only thing Apple users have complained about, especially with regards to macOS Tahoe. Mac users reported various problems with performance and stability across macOS 26.0 and macOS 26.1, and have criticized design choices like overly rounded corners. Myself, I held out on updating my M3 Pro Mac until macOS 26.2, where many of these issues appeared to be fixed, but my M1 iMac is still on macOS Sequoia for the time being. All that to say, macOS 26 hasn't had the smoothest start compared to some of Apple's previous Mac updates. If you've been noticing, for example, that your Mac's window management isn't as cooperative as it's been in the past, you're not alone. In fact, there seems to be a clear explanation for what's behind the issues. The issue with windows on macOS TahoeAs with other versions of macOS, you can resize and adjust your Mac apps' windows by clicking and dragging from the bottom corners. The issue, however, is that as of Apple's newest update, it can be fairly difficult to grab the corner of the window. You might, instead, find you click on the bottom corner of the app or website instead, leading to unintended actions. Clicking the top right corner of Chrome, for example, will drag the whole app window, rather than resize it. Clicking the bottom left corner and dragging will start to highlight everything in the app window instead, perhaps sending you all around the screen as well. \nIf you slowly hover your cursor over the corner of the window, eventually you'll find a spot that turns your cursor into a resize icon, and you'll know you're good to click and drag to resize. But why is this so much more difficult to do quickly than it was in macOS Sequoia or beyond?Norbert Heger, a software developer, seemingly has an answer. In a blog post on Sunday, Heger explains that those rounded corners Apple designed for Tahoe are having a negative impact on the clickable area of the window. With a square corner, most of the clickable area—Heger says 62% of it—lies within the corner of the window itself. That gives users a relatively large area to click within the corner in order to grab onto the window, and a little bit of room outside the window to click, as well. But these new rounded corners don't seem to take that into consideration. Instead, they're relying on the same click area as before, but because there's less corner to work with now, the actual clickable area of the window is far less. Heger says about 75% of the clickable area now exists outside the window itself, giving users just 25% to work with in the actual corner of the window. \n            \n                What do you think so far?\n            \n        \nIf you're running macOS Tahoe, you can try this out for yourself right now: Move your cursor to the corner of the window, and wait for it to change into the resize icon. If you're hovering within the window itself, it won't change until you're just about to move outside the window. You can keep going a bit, and see you can get pretty darn far outside the window before the cursor changes back. \n    \n            \n            Why am I able to resize the window from outside the window, Apple?\n                                        Credit: Lifehacker\n                    \n    \nThis seems like a relatively easy fix on Apple's part, assuming they're aware of the issue. Maybe a patch will even make it into macOS 26.3. That said, the company has not publicly acknowledged the quirk, so it's anyone's guess. Until a potential fix, those of us on macOS Tahoe will just need to retrain our muscle memories around window resizing. For anyone who hasn't upgraded yet, you can simply carry on as usual. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Is Why You're Having Trouble Resizing Windows in macOS Tahoe",
      "image": [
        "https://lifehacker.com/imagery/articles/01KESFZJPJ0ZR692131HZW8APJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-12T18:30:57.000Z",
      "dateModified": "2026-01-12T18:30:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samsung's Flagship 4K QD-OLED Gaming Monitor Is $540 Off Right Now",
    "url": "https://lifehacker.com/tech/samsungs-4k-qd-oled-gaming-monitor-deal-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KERHNZ651ZVDHHQ3A7SJC3HF/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-12T14:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Samsung\n                            \n    Table of Contents\n    \n        \n        Among OLED gaming monitors, the Odyssey G8 is in the top tier, offering a 32-inch 4K QD-OLED panel with 3840 x 2160 resolution, a blistering 240Hz refresh rate, and near-instant 0.03 ms (GtG) response time. But previous models were held back because of its Tizen OS—while marketed as a monitor, Odyssey was really a TV in disguise. With the new G81SF model, Samsung has finally fixed it, returning the G8 to a proper monitor setup. And Woot is currently offering the 32-inch model at a deep discount: $769.99, $540 off the $1299.99 retail price.The removal of the Tizen OS means no software bloat, and no waiting for the TV menu to boot up before shifting to your desktop. You do lose out on the built-in speakers, but it's a worthy sacrifice.The monitor features an RGB ring at the back, with its CoreSync feature creating an ambient lighting effect by projecting the on-screen colors onto the wall behind the monitor. There's also fan-less cooling via a pulsating heat pump, which allows it to run completely silently and without a fan, while reducing burn-in risk. These are critical features in high-end QD-OLED displays. (You also get a large array of ports. Two HDMI 2.1 ports, one DisplayPort 1.4 port, USB-A hub, and a headphone jack.)\n            \n                What do you think so far?\n            \n        \nIn its review of the earlier model with the Tizen OS, PCMag gave it a 4-star \"Excellent\" rating, and the display panel and specs remain the same in the model currently on sale. According to PCMag's expert review, \"Rocking a full 4K resolution (3,840 by 2,160 pixels) at a maximum 240Hz refresh rate, the monitor looks fantastic and plays even better... [It] excels for gaming and does everything else to a very high standard too.\" It's a good buy, especially at this price.\n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung's Flagship 4K QD-OLED Gaming Monitor Is $540 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KERHNZ651ZVDHHQ3A7SJC3HF/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-12T14:30:00.000Z",
      "dateModified": "2026-01-12T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft Is Finally Working on a Worthy Answer to Apple's 'Handoff' Feature",
    "url": "https://lifehacker.com/tech/microsoft-finally-has-an-answer-to-apples-handoff-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KESTAKQ2JWRWQBA8J5GEV7TT/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-12T21:00:02.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Lucigerma/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Windows Resume might soon be a worthy alternative to Apple's Handoff feature.\n                                            Microsoft recently opened the feature up to more developers, which means new Android apps may support Resume.\n                                            If that happens, you'll be able to start using an app on your Android device, and pick up where you left off on your PC.\n                                    \n            \n    Table of Contents\n    \n        \n        Love it or hate it, the Apple ecosystem really does have its perks. Take \"Handoff,\" for example. With this feature, you can be working in one app on one of your devices, then continue on in the same app on one of your other devices. You can start an article in Safari on your iPhone, then finish it on your Mac, without needing to google the piece and scroll to find your spot. It isn't 100%, but when it works, it's pretty great. Microsoft actually offers a similar feature over on Windows, though it's so limited, you might not even know it exists. The feature is called Resume, and the idea is to allow you to pick up your place in an app from another device on your PC. For the most part, that means Android apps; so if you have a PC and an Android phone, Resume could offer the same benefits as someone with a Mac and an iPhone. However, so few apps actually work with Resume, that it's effectively useless. Microsoft's \"Handoff\" moment is coming   As spotted by Windows Latest, Microsoft is making some serious updates to Resume. The company recently updated the Resume support document, which confirms Microsoft is opening the feature up to more Android apps. \nThe support document doesn't specify what apps might be coming, but it doesn't necessarily have to for this news to be exciting; rather, the development alone implies that many more Android apps will likely be on the way—assuming their developers simply get on board. As Windows Latest explains, the reason Resume has been so limited is due to how restrictive Microsoft's API is. The only apps that can currently tap into Resume are ones that have access to the \"Link to Windows\" API. Many Android developers either don't know how to develop with this API, or simply can't, since their apps are not compatible. \n            \n                What do you think so far?\n            \n        \nThe latest update to Resume offers developers another option, however: Now, developers can use Windows Notification System (WNS), a built-in API that is far more common and supports far more apps. That said, developers can't just update their apps with the WNS and expect to be compatible with Resume. Microsoft tells Windows Latest that developers need to reach out to Microsoft directly for approval. That application needs to include the developer's WNS registration, the app's Package SID, a summary of what the app does, and screenshots of the app in action.  It's basically like signing up for TSA PreCheck: Most of us who apply will likely get approved, but they don't just let anyone decide to join. You need to provide proof you qualify and submit for screening before you get there. That will likely end up working well for anyone who's interested in using Resume: The apps that will be available will all be vetted by Microsoft, so there should only be legitimate and useful apps offering that linking capability. How to enable Resume on WindowsThese changes probably won't roll out for some time on Windows. However, you can set yourself up for success now by turning the feature on. To start, head to Settings > Apps, then scroll until you find \"Resume.\" Here, turn on the feature. Right now, you'll probably see the only app that is compatible is OneDrive. You can connect it if you wish, which will let you work on a document across both your Android device and your PC.  \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft Is Finally Working on a Worthy Answer to Apple's 'Handoff' Feature",
      "image": [
        "https://lifehacker.com/imagery/articles/01KESTAKQ2JWRWQBA8J5GEV7TT/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-12T21:00:02.000Z",
      "dateModified": "2026-01-12T21:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]