[
  {
    "title": "This Is the Best AirPods Pro Deal Ahead of Black Friday",
    "url": "https://lifehacker.com/tech/this-is-the-best-airpods-pro-deal-ahead-of-black-friday?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAEE0XXAAFCK1AD7HKDPF7A6/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-19T17:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 19, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 19, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Walmart/Lifehacker\n                            \n    Table of Contents\n    \n        \n        As someone who's still rocking an M1 MacBook Air, an iPhone 12 Pro Max, the Apple Watch SE (Gen 1), and the AirPods Pro (Gen 1), I can proudly say that using older devices is a great lifestyle decision. It saves me a lot of money and I still get access to premium products with almost all of the features I need. And now that the AirPods Pro 3 are out, it's a great time to start looking for deals on the older AirPods Pro 2 before stocks are cleared. This Walmart deal brings the AirPods Pro 2 to an all-time low price of $139 (which is $100 off the list price), and they're an absolutely fantastic piece technology for that price.\nAlthough the AirPods Pro 2 launched a few years ago, they've received enough software updates to make them far more capable than they were at launch. Now, the AirPods Pro 2 are also approved for use as a hearing aid in the US, and still offer excellent noise isolation with great sound quality. I live in a really noisy city and I cannot roam around without wearing my AirPods for fear of triggering my migraines. My AirPods Pro (Gen 1) do a good job at cutting out the noise, but the AirPods Pro 2 take the cancellation to another level. I've used and compared all three generations of AirPods, and the noise cancellation on the Pro 2 is solid. It's not as good as that on the Pro 3, but it's better than on the Pro 1, and the difference isn't big enough to spend nearly twice the price for the latest product.\n            \n                What do you think so far?\n            \n        \nThe AirPods Pro 2 are everything I need to keep migraines away. They block out the worst of the loud noises around me while being light and comfortable enough to wear all day. My city has extremely humid weather, which makes it near impossible to wear over-ear headphones outdoors. However, I feel quite comfortable with my AirPods, and I've been waiting for nearly four years to upgrade mine. While I was saving up for the AirPods Pro 3, this deal is too good to resist, and I may just get the Pro 2 instead and save the rest of my cash to upgrade my Apple Watch.\n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Is the Best AirPods Pro Deal Ahead of Black Friday",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAEE0XXAAFCK1AD7HKDPF7A6/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-19T17:30:00.000Z",
      "dateModified": "2025-11-19T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why I'm Not Using NotebookLM's 'Deep Research' Tool (and Why You Shouldn't Either)",
    "url": "https://lifehacker.com/tech/google-notebooklm-deep-research-tool?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAEX1Z2B86QFZYC25F0AJ7BA/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-19T21:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 19, 2025\n    \n            Credit: PJ McDonnell / Shuttersto",
    "body": "\n        \n    \n                                        \n        \n        \n        November 19, 2025\n    \n            Credit: PJ McDonnell / Shutterstock\n                            \n    Table of Contents\n    \n        \n        I am a frequent user of Google's NotebookLM, an AI tool that functions similarly to ChatGPT and other LLMs, but only pulls from sources and materials the user inputs. I noticed a few days ago that it has a new feature: A research function divided into \"fast research\" and \"deep research.\" After playing around with it a little, these new features seem to completely defeat the purpose of why I started using NotebookLM in the first place—with one big exception. What the new \"fast research\" and \"deep research\" options in NotebookLM doIn short, \"fast research\" and \"deep research\" make NotebookLM work a lot like other AI tools—they pull information in from the web on your behalf—and that's the primary reason I don't see myself using them.\nWhen you use the deep research tool, you enter in what you want to research as a topic in the left panel, where you also typically store all the PDFs, links, and other materials you manually inputted as the sources for NotebookLM to pull from. This is where it differs from the premise NotebookLM has basically been built on since it was launched: The software searches the internet for sources, broadening the selection of materials the generated quizzes, podcasts, summaries, and flashcards will pull from. Before this update, it was entirely on you to find and input your own sources. The fast research tool is similar. Instead of finding the sources and generating a long report, it just suggests a handful of new sources for you to consider. \n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Google\n                    \n    \nWhether using deep or fast research mode, you have the option to deselect sources if you don't like them, but it's tricky to review them. I tried it on a Notebook I have set up to study for my upcoming personal training certification exam. It spit out a selection of titles like \"Free NASM Practice Test,\" shown above on the left. I had to click the \"7 more links\" link to expand the panel, which then revealed where the sources were from and gave me the chance to open them in a new tab to review them before agreeing to import them (shown on the right). Finding and assessing sources on my own is a crucial first step in my learning and brainstorming process, so I don't see myself ever using this. The reason I love using NotebookLM is that it doesn't do the work for me. It's still my responsibility to go out and find all the sources I need, then input them so it can help me synthesize the contents. I use it for studying, for work, and to organize my personal projects. None of those things benefit much from random outside sourcing. And, as is a risk with all AI tools, there's no guarantee it will find sources that are credible (again, it found me a Reddit thread I could have easily found for myself). The one useful new feature in the NotebookLM updateWhen you're inputting the topic you want NotebookLM to research, you'll notice a dropdown menu. It's automatically set to \"Web,\" meaning it will pull sources from the internet, but you can also set it to go through your Google Drive instead. That is helpful. I keep everything related to all my projects in distinct Drive folders already. Using this feature can help me input all the relevant materials when I need them instead of having to add them in manually, one by one. That's the sort of utility I have been enjoying NotebookLM for over the past few months.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why I'm Not Using NotebookLM's 'Deep Research' Tool (and Why You Shouldn't Either)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAEX1Z2B86QFZYC25F0AJ7BA/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-19T21:00:00.000Z",
      "dateModified": "2025-11-19T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ChatGPT, X, and Other Sites Affected During the Cloudflare Outage",
    "url": "https://lifehacker.com/tech/sites-affected-during-cloudflare-outage?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KABNZPZPE66F5SMC7K5RAPN7/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-18T14:47:52.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 18, 2025\n    \n            Credit: Robert Way/Shutterstock\n ",
    "body": "\n        \n    \n                                        \n        \n        \n        November 18, 2025\n    \n            Credit: Robert Way/Shutterstock\n                            \n            \n                Key Takeaways\n                                            A large number of sites experienced issues during the Cloudflare outage on Tuesday morning.\n                                            These include X, ChatGPT, and Downdetector, among many others.\n                                            While there is no official list of all affected sites, we can look at Downdetector to see which sites users were having the most trouble with at the time of the outage.\n                                    \n            \n    Table of Contents\n    \n        \n        On Tuesday morning, much of the internet was inaccessible. If you tried to follow your feeds on X, or engage with ChatGPT, you were only met with error messages. Compare those error messages to one another, however, and you'd likely notice a similar name affixed to them all: Cloudflare. Cloudflare's massive Tuesday morning outage had sweeping implications for much of the web. While it's not clear what caused the outage at this time, we do know whether the outage was responsible for a website's downtime. (When an error page says \"Cloudflare: Error,\" it's not difficult to track down the source of the problem.) As Cloudflare offers web infrastructure services to a huge number of sites, the true list of affected sites is likely massive. As an example, I wanted to convert the timezone Cloudflare uses in its status reports, UTC, to ET, and the first website I clicked on in my Google search returned an error. While there's no central repository listing each and every affected website, we can look at the sites with the largest number of user reports indicating issues this morning through Downdetector. (Disclosure: Downdetector is owned by Ziff Davis, the same parent company as Lifehacker.) Ironically, Downdetector itself was down this morning—it too uses Cloudflare.\nDowndetector is not a service that investigates and reports websites that are down. Instead, users can self-report issues with sites on Downdetector. As such, it can be illuminating to see which sites visitors were having issues with during the period of time Cloudflare was down. At this time, that includes the following:\n            \n                What do you think so far?\n            \n        \nXCloudflareOpenAIChatGPTGrindrArchive of Our OwnAWSSpotifyLeague of LegendseClinicalWorksQuizletUberCharacter.aiCanvaClaudeVaroIndeedProcoreTruth SocialFanFictionArloDoorDashValorantRunescapeDayforceNJTransitSniffiesSquareGoogleZoomRoverCollegeBoardLetterboxd  Bet365MoneyLionDayZBetMGMYouTubeMicrosoftIKEASunoMicrosoft 365Canvas by InstructureMicrosoft TeamsAmazonGrokInstagramGeminiAgain, this list is not definitive, nor is it official. However, users had trouble accessing them at the same time Cloudflare was down.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ChatGPT, X, and Other Sites Affected During the Cloudflare Outage",
      "image": [
        "https://lifehacker.com/imagery/articles/01KABNZPZPE66F5SMC7K5RAPN7/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-18T14:47:52.000Z",
      "dateModified": "2025-11-18T14:47:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use This New TikTok Tool to Control How Much AI Is in Your Feed",
    "url": "https://lifehacker.com/tech/tool-to-remove-ai-content-from-your-tiktok-feed?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAEE7CPQXN6WDPTXHFTVT5YP/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-19T18:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 19, 2025\n                    \n            Credit: Primakov/",
    "body": "\n        \n    \n                                        \n        \n        \n        November 19, 2025\n                    \n            Credit: Primakov/Shutterstock\n                            \n    Table of Contents\n    \n        \n        TikTok's algorithm is infamously addicting. The app picks up on your interests quickly, and before you know it, you're falling down an hours-deep rabbit hole every time you launch it. But the algorithm doesn't always get it right: Sometimes, you end up seeing too much of one type of content, no matter how many times you hit \"Not Interested.\" With the rise of AI-generated content, this problem only gets more frustrating. AI video generators like Sora are empowering people to produce more hyperrealistic AI slop than ever, which means you've likely encountered it on your feeds—whether you know it or not. I've certainly laughed at some AI clips here and there, but for the most part, I can't stand coming across them in the wild. And they aren't just a nuisance, they can be legitimately dangerous—some have even tricked users into installing malware on their smartphones. As this content become more normalized, I worry for our collective ability to spot misinformation across our social media platforms, so whenever you can take a step to reducing or removing this content from your feeds, I encourage you to do so.  \nAnd as it happens, TikTok is now experimenting with a tool to help you control the AI slop on your For You Page. Per a Wednesday press release, the company says it will roll out the new option in the existing \"Manage topics\" menu of the app's settings page. Manage topics already lets you finely tune parts of your individual TikTok algorithm to show you more of one subject or less of another—you can manage things like creative arts, current affairs, dance, fashion and beauty, food and drinks, health and fitness, humor, lifestyle, nature, pets, sports, travel. Soon, the section will add a slider for AI-generated content as well, if the option isn't live for you already. How to limit AI slop in TikTokTikTok says this new option is rolling out \"in the coming weeks,\" which is unfortunately vague. I don't have the option, even after installing the latest version of TikTok. However, that also means it could hit your app at any time. When it does, here's how to use it:Open TikTok, then tap \"Profile\" in the bottom right.Tap the hamburger menu icon in the top right, then choose \"Settings and privacy.\" Under \"Content & Display,\" choose \"Content preferences,\" then choose \"Manage topics.\"When the option is available on your app, adjust the \"AI-generated content\" slider. Move it left to see less AI-generated content, or move it right to see more of this content. Unfortunately, there isn't a way to completely remove AI content from your TikTok feed. Hopefully with this slider in place, however, you'll greatly reduce the amount of AI content you see, to the point where it's effectively gone entirely. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use This New TikTok Tool to Control How Much AI Is in Your Feed",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAEE7CPQXN6WDPTXHFTVT5YP/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-19T18:00:00.000Z",
      "dateModified": "2025-11-19T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "We Now Know What Caused the Cloudflare Outage Tuesday Morning",
    "url": "https://lifehacker.com/tech/here-is-what-caused-the-cloudflare-outage?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KABXRM3BE8CK7M8MV5YJ1R38/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-18T17:02:01.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 18, 2025\n                    \n            Credit: Christoph",
    "body": "\n        \n    \n                                        \n        \n        \n        November 18, 2025\n                    \n            Credit: Christopher Penler/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Cloudflare confirmed the cause of Tuesday's outage that took down many popular websites around the world.\n                                            The company asserts it was not the result of a cyberattack; rather a glitch in the system meant to manage threat traffic.\n                                            The root cause of the outage appears to be resolved, though some users may experience degraded performance in the immediate aftermath.\n                                    \n            \n    Table of Contents\n    \n        \n        Tuesday morning was a stark reminder of how fragile the global internet really is. Websites from X to ChatGPT went offline as Cloudflare, the company they rely on for web infrastructure services, experienced a massive outage. A huge number of sites and services across the world contract Cloudflare for cybersecurity protections, as well as to route traffic through servers local to each user, all in the name of performance and reliability. Ironic, of course, given today's events.When the public experiences such a massive internet outage, speculation runs awry. What caused this? Was it a simple bug on Cloudflare's part, or something malicious? Are bad actors attacking Cloudflare, and the sites that rely on it? But, as it turns out, the reason appears to be closer to the former than the latter.Cloudflare's outage was a glitchIn a statement to Mashable, Cloudflare confirmed that the company had identified the cause of the issue, and had rolled out a fix to patch it. In addition, Cloudflare is adamant there is no reason to believe a cyberattack caused this outage. This is the full statement: \n\"Many of Cloudflare's services experienced a significant outage today beginning around 11:20 UTC. It was fully resolved at 14:30 UTC. The root cause of the outage was a configuration file that is automatically generated to manage threat traffic. The file grew beyond an expected size of entries and triggered a crash in the software system that handles traffic for a number of Cloudflare's services.To be clear, there is no evidence that this was the result of an attack or caused by malicious activity. We expect that some Cloudflare services will be briefly degraded as traffic naturally spikes post incident but we expect all services to return to normal in the next few hours. A detailed explanation will be posted soon on blog.cloudflare.com. Given the importance of Cloudflare's services, any outage is unacceptable. We apologize to our customers and the Internet in general for letting you down today. We will learn from today's incident and improve.\" It seems the reason for the outage was a preventative measure meant to block a potential cyberattack. While that goal is obviously important, it shows how complex these systems really are: One glitch with one cybersecurity protocol spun out of control, and took down the network en masse.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We Now Know What Caused the Cloudflare Outage Tuesday Morning",
      "image": [
        "https://lifehacker.com/imagery/articles/01KABXRM3BE8CK7M8MV5YJ1R38/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-18T17:02:01.000Z",
      "dateModified": "2025-11-18T17:02:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Your Free VPN App Might Be Spying on You",
    "url": "https://lifehacker.com/tech/your-free-vpn-app-might-be-spying-on-you?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KA9C1VJMFRC957YFKDBCJFE7/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-17T18:30:51.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 17, 2025\n                    \n            Credit: Supapich ",
    "body": "\n        \n    \n                                        \n        \n        \n        November 17, 2025\n                    \n            Credit: Supapich Methaset / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        You may be doing everything you can to protect your privacy online—using tools like multi-factor authentication, a secure password manager, and a VPN—but unfortunately, not all privacy-focused apps and services are actually doing what they promise. In its November fraud and scam advisory, Google is warning users about VPN apps and extensions that appear legitimate but are actually vectors for malware.VPNs may actually be spyware A VPN, or virtual private network, makes your internet activity much more difficult to track by routing your traffic through a different connection rather than your regular internet service provider (ISP). This allows you to hide your IP address and location, obscure your browsing data, and protect your information and devices from bad actors. According to Google, malicious VPNs (posing as real ones) are delivering infostealers, remote access trojans, and banking trojans to user devices once installed, allowing hackers to access sensitive personal data like browsing history, financial credentials, and cryptocurrency wallet information. This means that an app you rely on to keep your information private could be doing the exact opposite. Cybercriminals are capitalizing on user trust in these services, creating apps that look and feel like legitimate VPNs but are actually dangerous spyware. \nHow to ensure your VPN app is safeAs with any app or extension, only download or install a VPN from an official source like the Google Play store. While malicious programs do sometimes sneak through, it's typically safer and more reliable than sideloading through a messaging app or other unvetted site. In January 2025, Google launched a VPN verification process to help users identify trustworthy VPN apps in the Google Play store. To earn a \"verified\" badge, VPN apps have to undergo a Mobile Application Security Assessment (MASA) Level 2 validation and opt into independent security reviews. Badges are awarded only to VPNs that have been published for at least 90 days and reach 10,000 installs and 250 user reviews. Of course, this system isn't perfect either: As TechRadar reported earlier this year, a popular (free) Chrome VPN extension earned a badge and was later discovered to be spying on users. That's why you should rely on a reputable VPN service—which means you'll likely have to pay for it. Free VPNs are far more likely to a privacy nightmare, and any app that sounds too good to be true probably is. You aren't going to get unlimited traffic at no cost without sacrificing something. Finally, review VPN permissions carefully, and allow the minimum access possible for the app or extension to function. (You should do this with any app you download, and you should audit apps regularly to remove unnecessary permissions.) You can check your VPN service's support pages to find out which permissions are essential—this should not include access to your contacts, camera, microphone, or photos, for example. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Your Free VPN App Might Be Spying on You",
      "image": [
        "https://lifehacker.com/imagery/articles/01KA9C1VJMFRC957YFKDBCJFE7/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-17T18:30:51.000Z",
      "dateModified": "2025-11-17T18:30:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Google Play Store Is Making It Easy to Remotely Uninstall Apps From Your Other Android Devices",
    "url": "https://lifehacker.com/tech/google-play-remotely-uninstall-apps?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9ZDXFS11JMBTJ8JVRW4GY7E/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-13T22:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 13, 2025\n    \n            Credit: Tada Images/Shutterstock\n",
    "body": "\n        \n    \n                                        \n        \n        \n        November 13, 2025\n    \n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Version 48.8 of the Google Play Store is giving users an easy way to uninstall apps remotely from other devices.\n                                            Once you're running this version, and you visit an app on the Play Store, you'll see a list of other devices that you can either install or uninstall the app from.\n                                            The feature reduces the risk of leaving unwanted or malicious apps on other devices, after deleting them from your primary device.\n                                    \n            \n    Table of Contents\n    \n        \n        If you have multiple Android devices, you might like to keep the experience about the same across them. If you download an app that's useful on your phone, there's a good chance you'll also want that app on your tablet, or even your Chromebook. Likewise, if you no longer find an app useful on one device, you likely won't want to keep it on your other devices, either.It can be annoying, however, to uninstall the app from each of your devices individually. Maybe you're using the app on your smartphone and you decide to delete it, but forget to delete it on your other devices. It might live on your tablet or Chromebook for a while before you realize you want it gone. That's annoying, but, in extreme cases, it can also be risky: Maybe you're trying to delete an app that was later discovered to be malicious, but if it still lives on your other devices, it might end up causing you harm. While there has been a way to remotely uninstall apps on other devices, it's been buried in the \"Manage apps and device\" section, and isn't all that easy to execute.The latest update to the Play Store aims to fix that problem. As spotted by Android Authority, with version 48.8, the Play Store now lets you simply uninstall apps from your other devices using your smartphone. Once you're running this version of the Play Store (as well as future versions), you can visit an app's Play Store page and look for a new \"Available on more devices\" section. Here, you'll see all of your connected Android devices, with options to either \"Uninstall\" or \"Install\" the app on those devices. There's no longer the need to dig through your settings.\n            \n                What do you think so far?\n            \n        \nThis feature should make it easy to keep your Android ecosystem a bit more ordered and organized, but it's not the only improvement the Play Store is rolling out. Starting next year, Google will start penalizing apps that use too much battery power. The Play Store will either remove those apps from discoverability pages, or add an alert to the apps' Play Store pages, warning users these apps take up more battery than necessary.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Google Play Store Is Making It Easy to Remotely Uninstall Apps From Your Other Android Devices",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9ZDXFS11JMBTJ8JVRW4GY7E/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-13T22:00:00.000Z",
      "dateModified": "2025-11-13T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Older Pixel Devices Can Now Record Calls Directly in the Phone App",
    "url": "https://lifehacker.com/tech/older-pixel-phones-can-now-record-calls-directly-in-the-phone-app?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KA1ZHM8FPK5CYCDZACDNC8DM/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-14T21:00:25.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 14, 2025\n    \n            Credit: Tada Images/Shutterstock\n",
    "body": "\n        \n    \n                                        \n        \n        \n        November 14, 2025\n    \n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google now supports call recording on older Pixel devices—assuming you live in a region that allows it.\n                                            The feature is part of the latest update to the Phone app, and works with on Pixel 6 and newer, running Android 14 and newer.\n                                            If you live in a region that doesn't allow call recordings, you won't see this feature on your Pixel.\n                                    \n            \n    Table of Contents\n    \n        \n        Good news, Android users: It no longer matters whether or not you have one of Google's latest and greatest devices—at least when it comes to recording calls with Google's Phone app. As spotted by 9to5Google, Google just opened up call recording in its app to Pixel 6 and newer. You won't get access to the Phone app's latest AI features, but if all you want is a reliable way to record phone calls, you'll be set. Google announced this new rollout back in September, calling the ability to record calls a \"fundamentally useful feature,\" even without transcription or automatic note taking. That's certainly true: While the idea of recording phone calls might strike some as nefarious, there are many legitimate applications for recording phone calls, from journalists seeking a record of an phone interview, to patients calling their healthcare providers to make sure they keep track of all medical advice and instruction. Call recording on Android—especially on Google's Pixel devices—has had a turbulent past. While there was once a time you could download a third-party call recorder app without issue, Google started slowly taking away key functions from developers, like blocking access to recordings from microphones. In 2022, the company announced that was blocking access to Android's Accessibility API, the main workaround developers used for their apps—effectively killing the third-party call recorder market. If your phone's manufacturer supported call recording in their primary app, that was still OK, but if not, you basically lost this functionality. \nWith Pixel 9 and Pixel 10, Google offers a feature called Call Notes, which transcribes and summarizes your calls using Gemini. In addition to these AI enhancements, however, you still receive a recording of the phone call, making these two Pixel series the only ones with the capability. That's why this call recording expansion is so necessary.Call recording on Pixel isn't perfectThere are two key caveats to keep in mind with this feature, however. First, don't expect to record a call without the other party's permission. Even if you live in a region with one-party consent—meaning you don't need both parties to agree to the recording—Google's call recorder will announce that it is about to record the call. Unless the other party isn't paying attention, they will know you're recording—and could choose to hang up the line if they feel uncomfortable. Second, this feature won't be available to all Pixel users, even if you have the proper Pixel device. This feature will only work in regions where call recording is legal, and Google says it is rolling out the functionality to all countries that support it throughout the rest of this year. It seems as of this article, the United States and Canada have the feature, but many other countries do not. If you live somewhere where call recording is legal, but don't see this feature yet, sit tight: It's likely rolling out soon. \n            \n                What do you think so far?\n            \n        \nHow to set up call recording on PixelTo start, make sure you're using a Pixel 6 or newer, running at least Android 14, or a non-Pixel device running at least Android 9. Next, update your Phone app to the latest version.Now, open the Phone app's Settings, then head to Call Assist > Call Recording. Here, you can turn on the toggle next to \"Turn on Call Recording.\" You can also toggle on \"Automatically record calls with non-contacts,\" if you want the app to start recording whenever someone outside your contacts list calls, or \"Automatically record calls with these numbers\" to manually select contacts you'd like the Phone app to record conversations for. You can choose to automatically delete these recordings after seven, 14, or 30 days, or let them stay on your phone forever. You can skip those latter two options, however, if you'd rather make recordings a case-by-case basis. If so, whenever you're in a call, you can choose the Call Assist button to select \"Call Recording.\" (If this is your first recording, you'll need to download some audio files before you're able to record calls.) When you do, the Phone app will ask if you'd like to record the call, which you can agree to. There is then a short countdown before the system alerts everyone on the call that it will begin recording. You can stop the recording at any time from the Call Assist menu. You'll find your new recording in the Home tab.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Older Pixel Devices Can Now Record Calls Directly in the Phone App",
      "image": [
        "https://lifehacker.com/imagery/articles/01KA1ZHM8FPK5CYCDZACDNC8DM/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-14T21:00:25.000Z",
      "dateModified": "2025-11-14T21:00:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google's AI Shopping Push Is Better for Business Than It Is for You",
    "url": "https://lifehacker.com/tech/new-google-ai-shopping-features?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9ZHBTN2E5NDBA24VSQTFEBZ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-13T23:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 13, 2025\n                    \n            Credit: Michelle ",
    "body": "\n        \n    \n                                        \n        \n        \n        November 13, 2025\n                    \n            Credit: Michelle Ehrhardt\n                            \n    Table of Contents\n    \n        \n        Today, Google announced three new AI shopping features, all centered around keeping you engaged with its AI throughout the entire shopping process. On the one hand, these features have the potential to make shopping more convenient—on the other hand, maybe lowering friction isn't the best idea when it comes to spending money. Beyond selling you on convenience, these features all share something else in common—helping businesses up their clickthrough rates.It starts with AI Mode and Gemini, which can now access all the same information as Google Search's shopping tab. That means you'll start to see product cards alongside your AI answers, which you can click on for a bunch of shopping links, or hit a checkmark to compare the selected products. They won't show up on every question, but on about half of the prompts I tried, I got the option to spend money right away.Then, if you're still not sure you want to buy yet, now you can have Google's AI robocall local businesses for you to check on product availability and pricing, as well as any deals or bundles you might not know about. There are a few caveats—businesses can opt out, and Google will avoid calling them at odd hours or too frequently—but the idea is that if you're on the fence, you can have an AI help you know which stores to go to.\nFinally, when it comes time to actually purchase whatever you're shopping for, you can have Google's AI check out for you. This feature is an extension of the existing price tracking feature, and will add a \"Buy for me\" button to any price tracking notifications you get from certain participating stores, like Wayfair, Chewy, Quince, or certain Shopify merchants. You'll get a link to the product you'd be buying from your notification, and the price will be pulled from that, so the company says you won't have to worry about the AI getting the price wrong. Instead, it's just supposed to remove any hesitation you might feel from having to enter your shipping or payment details into a checkout form.I won't deny that, when holiday shopping, I usually won't turn down assistance. But a continued refrain I had while hearing about these new features was \"Why?\"Personally, I'm mortified at the idea of sending employees at local businesses robocalls to deal with. And if I'm researching products, while it might be helpful to be able to involve an AI so I could ask specific question, I think I'd still prefer full access to all the filters and hundreds of links available in Google Shopping. The big thing for me, though, is agentic checkout. While I'm actually willing to trust Google that it won't make mistakes (and you do get a reference ID to hand to support in case it does), I'm also not sure why I'd want to go right from getting a price drop notification to having an AI spend money for me. It doesn't take long to fill out a checkout form, and while Google Shopping is a useful price tracking tool, it's not the only one around. I'd probably want to comparison shop a bit more before committing, at which point I might as well fill out the checkout form myself. But if you think about these features from the perspective of a business, the \"why\" behind all of this suddenly becomes a lot clearer. Turning people browsing web listings into actual paying customers has been a problem for about as long as the internet has existed, and all of these features introduce new opportunities for impulse purchases at every step of the buying process, while also erasing the opportunity for users to get caught up on a larger selection of options.It's not a conspiracy. Google charges companies for sponsored slots and ads, and the more people that buy products using a Google service, the more companies will want to pay for those. And for what it's worth, Lifehacker makes money on affiliate links. I won't deny that companies needs money, and that people need to buy gifts.What this does do, however, is reduce the friction that might pop up in between having an idle thought to buy something, and opening your wallet. While it plays at being a research buddy, it takes control out of your hands, obfuscates sources and other options, and instead encourages you to spend your money as quickly as possible, while discouraging skepticism.As someone who writes reviews and best-of lists, I like to think that my readers are a bit more savvy than that. Convenience is great, but taking the extra few minutes it takes to find an actual human opinion from someone who's used the product, or to double check that the price Google is serving you is really your best option, could save you from hours of pain down the line.Like most AI tools, there's potential here. But as much as AI will try to convince you that it's just some neutral buddy, remember that there are business motivations behind everything the companies behind these chatbots do. Keeping your whole shopping search in the same ecosystem as a company that's main profit still comes from ads and e-commerce probably isn't the best way to get your information.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google's AI Shopping Push Is Better for Business Than It Is for You",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9ZHBTN2E5NDBA24VSQTFEBZ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-13T23:00:00.000Z",
      "dateModified": "2025-11-13T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google's Desktop Search App Is Back (Kind Of)",
    "url": "https://lifehacker.com/tech/google-desktop-search-app-first-impressions?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KAESHG5EXPJ0AJBXZAGQ61RN/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-19T20:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 19, 2025\n    \n            Credit: Justin Pot\n              ",
    "body": "\n        \n    \n                                        \n        \n        \n        November 19, 2025\n    \n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        Back in the Windows XP days, when the only search functionality was a cartoon dog in the sidebar of Windows Explorer (not a joke), Google released Google Desktop. If you installed the application, you could search the files on your computer the same way you could search the web. The application made finding your own documents quick—as a small town reporter in northern Alberta, I constantly used this service to dig through my old notes and previous articles.The service was shut down in 2011, announced via a blog post, which stated that the feature was no longer necessary in the cloud storage era. And that was the end of Google offering to search files on your computer—until now. Back in September, Google announced an experimental Windows-only application named \"Google App for Windows\" that, among other things, searches the files on your computer.Nostalgic person that I am, I couldn't help but wonder: was this going to be similar to the retro offering? So I gave it a shot. The installation requires opting in to an \"experiment\" using your Google account, then downloading and installing an application. After that, you can bring up a search by using the keyboard shortcut Alt+Space, which brings up a search bar. You can use this to search for files on your computer, your Google Drive, and information on the web.\nThe actual file search doesn't seem particularly sophisticated. While the retro Google Desktop could search the contents of files, the Google App for Windows seems to mostly only be aware of file names. That's disappointing—I liked being able to figure out which files I mentioned particular names, or try to find the source of a sentence I remember writing. This local search functionality honestly isn't much better than the search that comes with Windows.What this new app can do, though, is search your Google Drive. I was able to quickly find and open files I'd created in Google Docs, then open them in one click. The ability to search these cloud docs alongside my local ones in one place is a decent reason to give this application a chance.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nAnd there are also a few web-based features. If there are no files that match your search, you'll see Google search results—select any of those and you'll see an AI-generated blurb answering your question. If you'd prefer traditional Google search results, you can get those instead—just turn off \"AI mode\" by clicking your profile picture and turning off the AI Mode toggle.\n            \n                What do you think so far?\n            \n        \nFinally, this application can be used to take a screenshot of your computer and answer questions related to it. For example, I took a snap of my desktop wallpaper—a photo my wife took in New Zealand—and got an accurate description of the location.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThe feature is similar to those offered by the desktop application of ChatGPT and Claude, just powered by Google's AI instead of those tools. I'm not sure I'd find myself using this regularly, but it's an interesting idea.The Google App for Windows, sadly, isn't a resurrection of the long-dead Google Desktop, but it is an interesting tool that combines a simple local file search with results from your Google Drive and the web. It's worth playing around with if you're a dedicated Google user who still stores a lot of files on their computer.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google's Desktop Search App Is Back (Kind Of)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KAESHG5EXPJ0AJBXZAGQ61RN/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-19T20:00:00.000Z",
      "dateModified": "2025-11-19T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This App Makes It Easy for Androids and Macs to Talk to Each Other",
    "url": "https://lifehacker.com/tech/airsync-app-mac-and-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9WSR67Y6EC2X1R3K54WVF30/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-13T14:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 13, 2025\n                    \n            Credit: Justin Po",
    "body": "\n        \n    \n                                        \n        \n        \n        November 13, 2025\n                    \n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        I'm a former Android-Mac hybrid user. Laugh all you want—we exist.I enjoy having a polished operating system on my computer and an endlessly hackable operating system on my phone, and the combination of Mac and Android gave me all of that. I only stopped using Android alongside my Mac a couple years ago, mostly because an iPhone SE was cheaper than most mid-range Android options at the time.When I think about switching back, though, I realize how much I'll miss the integrations. Using a Mac and an iPhone gives you access to all kinds of tricks. Among the ones I use the most are the shared notifications, the syncing clipboard, and the easy ways to sync files. There's also the ability to control your iPhone from your Mac. Android users can't do any of this on a Mac.\nThat's where AirSync comes in. The open source application, built by Sri Lanka based developer Sameera Sandakelum, integrates Android devices with macOS in all kinds of ways. Android notifications show up on your Mac. You can sync your clipboard. It's also easy to send files from Android to the Downloads folder on your Mac, or vice versa. And with a little bit of setup, you can even take control of your Android device from the comfort of your Mac.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nGetting started is straightforward. You need to download the app for Android and macOS and install them. You will be prompted on both devices to enable certain permissions, after which you can connect your devices to each other by scanning a QR code. (It's worth noting that you can only connect devices that are on the same wifi network.)After that, you should start seeing Android notifications on your Mac—they'll show up in the native Mac notifications, or you can review existing ones in the app itself. You can even trigger buttons, allowing you to do things like respond to text messages from the notifications on your Mac. Items copied on your clipboard on one device will sync to the other. And you will see controls for the media currently playing on your Mac on the lock screen of your Android device.It has lot of nice touches, and you can go a bit further by paying for AirSync+, which costs either $2.49/month or $50 one time. This paid version of the application lets you take control of your Android device, similar to iPhone Mirroring. I tried this feature out and enjoyed it, though you can set this up yourself using Scrcpy for free.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nOther features in the paid version include controlling your Android's music from your Mac, opening websites open on one device from another, and custom app icons.Even without these paid features, though, Airsync makes it a little bit easier to be a Mac/Android person. Not missing notifications, easier file sharing, and clipboard syncing are all big quality of life improvements, so check this app out if you're tired of macOS and Android not playing nicely together.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This App Makes It Easy for Androids and Macs to Talk to Each Other",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9WSR67Y6EC2X1R3K54WVF30/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-13T14:30:00.000Z",
      "dateModified": "2025-11-13T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Four Unofficial Ways to Customize MacOS",
    "url": "https://lifehacker.com/tech/how-to-customize-macos?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9ZNFXNMVDM7AZQRCQY5J00W/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-14T14:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 14, 2025\n    \n            Credit: Justin Pot\n              ",
    "body": "\n        \n    \n                                        \n        \n        \n        November 14, 2025\n    \n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        MacOS is great in all kinds of ways, but it's far from the most customizable operating system out there. Sure, it's not locked down to the extent iOS and iPadOS are, but compared to Linux and even Windows, macOS really doesn't let you change the look and feel very much.But that isn't to say there's no room to tweak the operating system to make it the way you like—if you know where to look. Here are a few third-party tools that let you make macOS your own.Use a custom cursorIt's pretty easy to change how the mouse pointer looks on Windows and Linux—you just need to dig around in the settings. On macOS, you can only change the size of the pointer.\nUnless, that is, you install the free and open source Mousecape. This application lets you create a cursor, then use it in place of the default system ones. You can also install cursors made by others. There's no centralized collection of cursors for this, unfortunately, but I found a fun hand on Github, some Wii cursors, and a decent collection on DeviantArt. You could also try your hand at creating your own set.Note that Tahoe users will have to download an updated fork in order to use Mousecape—the main build doesn't work at the moment. You'll need to install a pre-release download as of this writing.Use any website as your wallpaper\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nSome great wallpapers, including dynamic ones, are included with macOS. There's also the option to use your own photos. But what macOS doesn't offer are custom, animated wallpapers.Enter Plash. This free application lets you turn any website into a macOS wallpaper, which opens up all kinds of interactive possibilities. A few sites included let you look out a random stranger's window, see real-time weather data, or take in some animated pixel art, but you can use any website you can think of. It's a lot of fun to play around with.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThe macOS menu bar is a bit of a mess. Windows makes it relatively easy to hide icons by dragging them to a secondary area. Apple hasn't offered anything like this until Tahoe, which added a way to disable any icon in the settings. The problem: it's all or nothing. Hide an icon in the settings and there's no quick way to access it other than going back into the settings and turning it back on.For that, you'll need a third party app. I personally recommend Ice, which is the best free app for cleaning up your menu bar. My coworker Pranay recommends Barbee, another great option. Both make it easy to hide menu bar icons in a secondary bar accessible by hitting an icon, similar to how it works on Windows. Every Mac user should install some sort of tool like this.Change your folder icons\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThis one isn't unofficial, exactly, but it's so buried it might as well be. You can change the icon for any folder, document, or even application by right-clicking it, clicking \"Get Info\", then dragging an image to the icon in the window that opens. Weird, right? But it works, meaning you can customize folders to look however you want. I talked about this in an article with more details.This gets really fun if you install Fancy Folders, a free application seen in the image above which allows you to create folder icons in the color of your choice, complete with either the text or icon of your choice. It's a lot of fun to play with, and can be very useful for visually keeping things organized.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Four Unofficial Ways to Customize MacOS",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9ZNFXNMVDM7AZQRCQY5J00W/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-14T14:30:00.000Z",
      "dateModified": "2025-11-14T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Four Best Paint Additives I've Used in My Own House (That You Should Try Too)",
    "url": "https://lifehacker.com/home/best-paint-additives-ive-used-in-my-house?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K9Z3F2FVM60ESGJDPSJBD7D4/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-13T21:00:54.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 13, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 13, 2025\n    \n    We may earn a commission from links on this page.\n    \n            Credit: Sannyday / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Paint can be a cheap way to transform and improve your house, covering up the wear and tear of daily life or bringing a pop of color into your home. The paint you pick up at your local hardware store is pretty powerful stuff, but if you’ve ever struggled to make a DIY paint job look professional, or tried to solve a specific problem with paint, you should know about paint additives.Paint additives are just what they sound like: Stuff you add to your paint to increase its usefulness or to make it easier to work with. They’re essentially chemicals that interact with the paint or the surface it coats to achieve a specific effect. Many additives are already included in the paint you buy, but you can purchase some specific additives on your own. I’ve used a few to great success—I’ve become a big believer in paint additives to make my DIY paint projects more effective and easier to clean up.These additives really work wonders, in my experience:\n            \n                What do you think so far?\n            \n        \nFloetrol. This is a paint conditioner for water-based paints. Paint conditioners essentially lubricate your paint, making it flow more smoothly off the brush and slowing down the drying time slightly, resulting in a smoother finish with fewer brush strokes. It really works! I used to be the King of Brush Strokes, and adding this to my paint has made a difference. There’s also Penetrol for oil-based paints, but I haven’t used an oil-based paint in a long time.Paint hardeners. There’s a reason every garage and basement in the world is filled with old, rusting paint cans filled with swampy, useless muck that used to be paint: It’s a pain to dispose of. A paint hardener is the secret: If you’ve got some old paint to get rid of, add some paint hardener to the can and it turns into a solid that you can safely (and legally) throw into the trash.Anti-mildew. If you’re painting a damp area—a bathroom, basement, or even a laundry room—I’ve found that including some anti-mildew additives, in conjunction with an anti-mildew primer, will stop mold and mildew in its tracks. Instead of having to clean and re-paint my bathroom ceiling every year, for example, I haven’t had a problem since using this additive.Anti-slip. I wrote about my famously slippery stairs in my old house before I discovered anti-slip additives for paint. Adding some to floor and patio paint creates a slightly textured, nonslip finish that has made my stairs safer—I haven’t seen my life flash before my eyes in months!Other useful additivesThere are other additives you can purchase for your paint projects. I haven’t personally used these, but they’re worth knowing about:Scent additives. A scent additive makes your paint smell nice and acts as a room freshener as well. They’re easy to use, and typically last a few months before the smell fades. People use them to mask the harsh smell of fresh paint or just for the temporary scent they bring to a room.Textures and flakes. If you want your walls to have a texture to them that mimics stone, sand, or stucco, you can buy an additive that will give that finish to any paint. You can also buy additives that will add glitter or other elements to your paint, if that’s something you’re into.Insecticides. You can add insecticides to your paint to kill off/repel bugs like ants, silverfish, or mosquitoes. They don’t last very long, so it’s not a permanent solution. But if you’re concerned about an invasion of bugs, this can be one more weapon in your efforts to keep your house or yard bug-free.\n            \n    \n\n    \n        Smarter Home & Living Newsletter\n            Never miss a story\n        \n        \n            Lindsey Ellefson\n            \n        \n        Get the latest smart home news, trends, and advice from Lindsey and the team.\n    \n    \n        Smarter Home & Living Newsletter\n            Never miss a story. Get the latest smart home news, trends, and advice from Lindsey and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Four Best Paint Additives I've Used in My Own House (That You Should Try Too)",
      "image": [
        "https://lifehacker.com/imagery/articles/01K9Z3F2FVM60ESGJDPSJBD7D4/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-13T21:00:54.000Z",
      "dateModified": "2025-11-13T21:00:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vine Is Back",
    "url": "https://lifehacker.com/tech/vine-is-back?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KA1HDKCC663PHG58YMF63KF9/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-14T17:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 14, 2025\n    \n            Credit: Twin Design/Shutterstock\n",
    "body": "\n        \n    \n                                        \n        \n        \n        November 14, 2025\n    \n            Credit: Twin Design/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Vine, the short-form video platform, is making a 2025 comeback.\n                                            The new app, Divine, includes an archive of as many as 200,000 original Vine videos.\n                                            Users can upload new six-second long clips as well, though there is no AI-generated content allowed.\n                                            The beta test is currently full, but you can check out the web app right now.\n                                    \n            \n    Table of Contents\n    \n        \n        Today, short-form videos dominate our free time (and our working time, at that)—but this wasn't always the case. Before the likes of TikTok and Instagram Reels, online video content was more long-form than not. It might have felt short by the standards of cable TV, but many of the videos  on platforms like YouTube were regularly anywhere from two to 10 minutes, if not longer. The first platform to really popularize short-form content as we think of it now was Vine. These videos were short—a maximum of six seconds at a time, which should have spelled the platform's doom. Who would want to watch these tiny videos back to back for hours at a time? A lot of us, apparently. Vine compilations garner millions (if not tens of millions) of views on YouTube. While the Twitter-owned platform only lasted about five years, it established itself as a true cultural phenomenon. Quote the first half of a popular vine to a group of young millennials or Gen Zs, and, chances are, they'll finish the line. For years, us Vine fans have longed for someone to bring the app back. Sure, short-form video has never been more addicting, but it's just not the same. Videos on Vine had a much different feel than most of the content you see on TikTok. Maybe it was the limited runtime; maybe it was the stripped-down recording interface. But to me, Vine feels like early YouTube: homemade, indie, and fun.\nDivine is the new VineIt seems that experience might actually be making a comeback. A new app, Divine, is trying to recreate the magic of those six-second loops. Divine, built by former Twitter employee Evan Henshaw-Plath and funded by Twitter co-founder Jack Dorsey, is meant to be a platform to share vines old and new. Of course, you can upload fresh six-second clips, but the app will also feature 150,000 to 200,000 \"archived\" vines from roughly 60,000 creators. You won't have to rely on those Vine compilations anymore—you can watch those classic clips directly on Divine. Those videos aren't scraped from YouTube compilations, either. According to TechCrunch, Vine's original library was stored by the organization \"Archive Team\" in a huge but largely inaccessible archive. Henshaw-Plath studied the library, extracting as much data as possible to build profiles for the original Vine accounts and display metrics like views and original comments. Though not all Vines were archived, including \"millions of K-pop-focused videos,\" Henshaw-Plath believes \"a good percentage\" are available on Divine. Vine creators can choose to either take down their videos from Divine or take over their profiles on the app, so long as they prove their identities. \n            \n                What do you think so far?\n            \n        \nDivine is also a decentralized social media platform running on the Nostr protocol. That means no one company owns it, which means your content is your content. When you post, your videos are tied to you via private keys, so you can always prove ownership. Plus, there are no user-specific algorithms. You have to choose what you want to watch, or jump into an algorithm created by the Divine community. My favorite part of this experiment, however? No AI. At a time when  other social media platforms are inundated with hyperrealistic videos from generators like Sora, Divine has a strict no-AI policy. Divine uses tech from the Guardian Project to confirm whether a video was filmed on a smartphone. If the system detects a video is artificial, it gets taken down. It's enough to make this tech editor shed a (joyful) tear. How to join DivineAs you might expect, there's a lot of demand to try Divine at launch. At this time, the company says its beta test is full. However, you can sign up for the waitlist to be notified when more spots open up. You can also browse clips on the platform's web app right now, even without an account, but I've found it to be a bit glitchy.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vine Is Back",
      "image": [
        "https://lifehacker.com/imagery/articles/01KA1HDKCC663PHG58YMF63KF9/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-14T17:30:00.000Z",
      "dateModified": "2025-11-14T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Try 'Pomodoro 2.0' to Focus on Deep Work",
    "url": "https://lifehacker.com/work/try-pomodoro-20-to-focus-on-deep-work?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JC3KE9V2X1HN2EB1EHCV46EB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-11-17T13:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 17, 2025\n                    \n            Credit: TippaPatt",
    "body": "\n        \n    \n                                        \n        \n        \n        November 17, 2025\n                    \n            Credit: TippaPatt/Shutterstock \n                            \n    Table of Contents\n    \n        \n        When it comes to productivity hacks, there are two things I love: the tried-and-true classics, like the Pomodoro method, and shaking them up with a few customizations. I've written before about other ways to mold Pomodoro to match what you need, but today's idea, Pomodoro 2.0, is one of the easiest and most effective adaptations. What do I mean by \"Pomodoro 2.0?\"First, a refresher on what the Pomodoro technique even is. When you're using this technique to focus and be productive, you set an alarm for 25 minutes, work for that time, then take a five-minute break. You complete that cycle four times, then give yourself a longer break at the end, up to half an hour, before starting again. That's it. It works because you spend those relatively short bursts concentrating on the task at hand, knowing a reprieve is coming. Since they're not too long, it doesn't feel insurmountable. It also works because those breaks play an important role. Taking periodic breaks can make you more productive, both because they give your brain a rest and because they stop you from toiling to the point that your output gets shoddy.\nI saw the idea of \"Pomodoro 2.0\" mentioned on a forum a while back and started Googling. What I found impressed me—it addresses one of the main critiques I have of the original, which is that 25 minutes isn't always enough time to get into a state of deep work, or work that is uninterrupted, purely focused, and effortless enough that time seems to be flowing by.Over at Beyond Productivity, Dr. Christian Poensgen recommends starting the Pomodoro session with a 30-minute work block, then adding more time to it after the break, tacking on between 15 or 60 minutes. I recommend doing this incrementally, adding 15 every time, so you work for 30, then 45, then 60, and finally 75 minutes before your big break. Adding too much too soon—or working in too-large chunks all the way through—defeats one of the main purposes of the technique, which is to not get overwhelmed, so taking it slower and easier while still adding on time is the best bet.If you're not sure how much time to add on, familiarize yourself with the concept of flowtime. Also known as \"flowmodoro,\" the idea here is that you should track how long you can work on a given task before you feel drained, track how long your breaks need to be to make you feel reenergized, and start creating custom, Pomodoro-esque work and rest blocks for every kind of task you do in a given day. It takes a bit of data collection and planning, but it can help you master the general technique while still prioritizing deep work and breaks.Why use Pomodoro 2.0?The Pomodoro technique shines (and has been so popular for so long) because it helps you ease into your work, motivated by the small work sprints and promise of rewards. It's absolutely true that you need to take breaks to keep your productivity up, so that part should never be altered or skipped, but sometimes, 25-minute grind sessions just aren't enough and five minutes to reset isn't, either. Getting into a state of deep work takes time. Repeatedly stopping yourself before you hit that point is counter-productive. Giving yourself more time to work on harder, more complex tasks is critical in some instances, just like taking breaks. Adding time to the work blocks in increments helps you settle in and get more done without overwhelming yourself. You should consider this alteration if you have a major project that demands a lot of resources or energy, letting yourself build up to the hard parts as you add minutes to your timer. If you're trying this out and not getting the results you want, you can shake it up another way, too. Remember the idea of \"eating the frog,\" or tackling your biggest to-do list item first thing in the morning? Consider eating the frog in Pomodoro 2.0, starting with your 75-minute block and working backward to 60, 45, and 30. Remember, none of these rules are hard and fast; you can make changes that match your needs and personal preferences. If you're someone who doesn't get overwhelmed and has the ability to jump in on long-term work, this structure could suit you, as the promise of shorter and shorter work sessions can feel like a motivator of its own. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Try 'Pomodoro 2.0' to Focus on Deep Work",
      "image": [
        "https://lifehacker.com/imagery/articles/01JC3KE9V2X1HN2EB1EHCV46EB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-11-17T13:30:00.000Z",
      "dateModified": "2025-11-17T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]