[
  {
    "title": "We Now Know What Caused the TikTok Outage",
    "url": "https://lifehacker.com/tech/tiktok-outage-cause?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFY3GDB84S524T0BHE3FZMSS/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T23:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: daily_creativity/Shutterstock\n                            \n            \n                Key Takeaways\n                                            TikTok experienced an outage on Sunday.\n                                            The company released a statement on Monday, attributing the issue to a power outage at a U.S. data center.\n                                            The app just experienced a change in ownership as the Chinese-based Bytedance officially divested its majority stake to U.S. companies.\n                                    \n            \n    Table of Contents\n    \n        \n        If you tried hopping on TikTok Sunday, you might have noticed something odd: the app wasn't working. Outages happen, of course, as anyone who has Verizon can attest. But in the moment, theories were flying left and right. TikTok had just officially moved into U.S. control, leading some to speculate that the outage had something to do with this change in ownership. As one user put it, \"TikTok being down days after the people they were forced to sell to take it over does not feel like a coincidence.\" As it happens, it does appear that the changing of the guard was responsible for the outage—just not in the way that some conspiracy theories might suggest. TikTok finally released a statement on X Monday morning, attributing the outage to issues at a U.S. data center. The statement is as follows: \"Since yesterday we’ve been working to restore our services following a power outage at a U.S. data center impacting TikTok and other apps we operate. We're working with our data center partner to stabilize our service. We're sorry for this disruption and hope to resolve it soon.\"   The outage might not be the only thing different about TikTokFor its part, TikTok is very much operational at the moment. If the issue really was just isolated to a power outage at this data center, that data center appears to have patched things up. But that doesn't mean the company's reputation is patched up. Users are accusing the app's new owners of changing the algorithm, complaining of reset For You Pages, irrelevant content in feeds, and AI-generated content. I've seen users accuse the app of blocking anti-Trump and anti-ICE content, while comedian Gianmarco Soresi says even some of his non-political TikToks have \"zero views,” which he attributes to the ineffectiveness of the people running the app. (I've reached out to TikTok for comment on user reports of changes to the algorithm and will update if I hear back.)\n            \n                What do you think so far?\n            \n        \nWe'll need more time to know whether or not there were serious changes made to TikTok's algorithm and user feeds in the wake of this sale. But the app is running—at least, for now.  \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We Now Know What Caused the TikTok Outage",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFY3GDB84S524T0BHE3FZMSS/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T23:00:00.000Z",
      "dateModified": "2026-01-26T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ten Brands Scammers Are Most Likely to Impersonate",
    "url": "https://lifehacker.com/money/brands-scammers-often-impersonate?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFXQYHY0R0EAF808M8JXPE40/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T22:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Table of Contents\n    \n        \n        Impersonation scams are everywhere: bad actors are constantly trying to convince you that they represent organizations like LinkedIn, PayPal, your bank, the FBI, the FTC, and the IRS as they look to steal your money and information. When it comes to phishing schemes, which typically try to trick you into handing over sensitive data or account credentials via malicious links, tech brands are (perhaps not surprisingly) among the most commonly spoofed.  A recent report from Check Point Research found that Microsoft was imitated in nearly a quarter of all branded phishing attempts in Q4 of last year—nearly double the next most-impersonated company. The most popular brands for phishing scamsAccording to researchers, tech companies and social networks are consistently among the most popular brands for impersonators running phishing scams, with the following share in the final quarter of last year: \nMicrosoft: 22%Google: 13%Amazon: 9%Apple: 8%Facebook (Meta): 3%PayPal: 2%Adobe: 2%Booking: 2%DHL: 1%LinkedIn: 1%While you should always be on guard for common phishing tactics, it's wise to be especially wary of unsolicited communication from any of the companies listed—especially if that communication is related to account security and/or urges you to click a link. We've covered at least one campaign involving nearly every brand here, all of which are known and largely trusted among users, making them prime targets for these types of scams. Check Point notes that stolen Microsoft and Google credentials are particularly valuable because they're widely used in day-to-day workflows. Common phishing tacticsBroadly speaking, a phishing scam starts with an email, text, or social media message that appears to be from a legitimate source. It likely asks you to update or verify personal information—often related to a payment or account security—with a link to what appears to be the company's website or login page. Of course, this link leads instead to a spoofed version of that site designed to harvest your credentials, credit card number, bank details, or other personal data, which scammers can then use for identity theft, account takeover, or purchase fraud. Note that while the above methods are among the most common, phishing can also happen via phone call, voicemail, and malicious browser pop-ups. \n            \n                What do you think so far?\n            \n        \nHow to protect against branded phishing attacksAs we mentioned, just because you generally trust a company doesn't mean you should blindly trust all communication from it. If you receive a message that is unprompted, sounds urgent, and is unrelated to any recent action on your part (such as a login attempt or bill payment), do not engage with it. Don't click any links, open any attachments, or respond directly. Look out for typos and other errors, including the original sender—though as scammers have found ways to appear verified, this isn't always an obvious red flag. If you're unsure about the contents of the message, go directly to the website or app and log in to see any legitimate alerts. A password manager offers an extra layer of security here, as it'll protect you from entering credentials on a spoofed page. Finally, enable a strong, phishing-resistant form of multi-factor authentication everywhere you can, and especially for high-use and high-value accounts like Microsoft and Google. If your credentials are compromised, threat actors won't have that additional factor to utilize them. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ten Brands Scammers Are Most Likely to Impersonate",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFXQYHY0R0EAF808M8JXPE40/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T22:00:00.000Z",
      "dateModified": "2026-01-26T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The JBL Charge 6 Speaker Is $70 Off Right Now",
    "url": "https://lifehacker.com/tech/jbl-charge-6-speaker-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFXKHND3KH2WBXHH9XFKXBZC/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-26T19:00:46.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Lifehacker / Amazon\n                            \n    Table of Contents\n    \n        \n        The JBL Charge 6 is waterproof, dust-proof, and drop-resistant—and it's selling right now for $129.95 on Woot—$70 off its usual $199.95 listing on Amazon. That deal runs for the next six days (or until it sells out), and Prime members get free shipping. It includes a 90-day limited warranty through Woot, which is shorter than JBL’s standard coverage but still decent. That said, it ships without a charging brick or USB-C cable, which feels like an oversight at this price.\nJBL didn’t overhaul the design here. The Charge 6 keeps the durable, travel-friendly build that made the Charge 5 so popular, with IP68 dust- and water-resistance and a new looped handle for better grip. Internally, the upgrade is real. A 2.1-by-3.7-inch woofer and 0.8-inch tweeter push out 45 watts of power, backed by those familiar side radiators that give it surprisingly strong bass for its size. It’s not going to rival a subwoofer, but for a pool party or small outdoor hang, it holds its own with clean, full sound that doesn’t distort at a high volume, according to this PCMag review.\n            \n                What do you think so far?\n            \n        \nBattery life is rated up to 24 hours depending on how hard you push it, and the speaker can even charge your phone using the USB-C port, which now also supports lossless audio when connected directly. Bluetooth 5.4 is on board, and JBL added support for Auracast—useful if you want to pair speakers or join public streams. The app offers a seven-band EQ for people who like to tinker, but codec support is limited to SBC and AAC, which means no aptX or LDAC if you care about high-res streaming. Still, this is a powerful speaker made for people who spend more time outdoors than in, and $129.95 is the lowest it’s been so far for a new-in-box unit, according to price-trackers.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The JBL Charge 6 Speaker Is $70 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFXKHND3KH2WBXHH9XFKXBZC/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-26T19:00:46.000Z",
      "dateModified": "2026-01-26T19:00:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oh Great, It Looks Like Android Is Doing 'Liquid Glass' Now Too",
    "url": "https://lifehacker.com/tech/it-looks-like-android-is-adding-liquid-glass-now-too?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFXGVH2G5Z7154JD70JH297K/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T18:30:43.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            Internal builds of Android 17 show blur is being added across the entire OS.\n                                            According to 9to5Google, the blur produces a transparency effect similar to Apple's Liquid Glass.\n                                            You can turn off blur in your Settings app.\n                                    \n            \n    Table of Contents\n    \n        \n        When Apple introduced Liquid Glass to the public in June of last year, it kicked off a saga that's still ongoing. The company's toned down the effect multiple times, and in November, it added controls for tinting it. Some have even found out ways to disable Liquid Glass entirely. It's not a quagmire I'd jump into willingly, but apparently, that's exactly what Android's about to do.According to \"images of internal builds\" seen by 9to5Google, Android's next update will add significant amounts of blur \"across Android 17.\"\"Throughout the OS, you can expect a system UI that switches from solid light or dark backgrounds to a blur effect that allows you to see what's immediately behind the component you're interacting with,\" writes 9to5Google's Abner Li.\nThat sounds a lot like Liquid Glass to me, and Li further confirms that elements like the volume bar and mode switcher will be translucent, allowing you to see your wallpaper and app icons in the background.\n    \n            \n            \n                                        Credit: Google\n                    \n    \nThis actually isn't Google's first time experimenting with transparency effects. In Android 16 QPR1, Google already added blur to the notification and quick settings panels. What's new is that we can now expect it in other parts of the OS as well, for a more cohesive look. So if it hasn't bothered you yet, you don't need to worry about opening your phone on Android 17's release date and seeing a brand new interface.Li also says that \"Compared to Liquid Glass on iOS, Android's new look is more subtle,\" although some are likely to be more sensitive to it than others.\n            \n                What do you think so far?\n            \n        \nPersonally, I haven't noticed the blur that's already there much, but even if you don't mind the aesthetic, the effect can be a slight drain on battery life. Luckily, even before it's been introduced across the OS at large, there's a way to turn off blur in Android.This came in Android QPR2, specifically as a response to the new effects (although it was technically available in developer options before then). To do this, open your Settings app, and then navigate to Accessibility > Color & Motion. From there, tap on Reduce blur effects. The change will take place immediately, so you'll be able to test then and there which look you prefer.Like other new Android features, the blur is likely to come to Pixels first, and because Google's branding it as part of its own Material 3 Expressive design language, it might not make the jump to Samsung Galaxy or other Android phones. The exception could be in Google-branded apps, although Li said \"it remains to be seen\" whether Google will add blur to its apps in addition to the OS.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oh Great, It Looks Like Android Is Doing 'Liquid Glass' Now Too",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFXGVH2G5Z7154JD70JH297K/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T18:30:43.000Z",
      "dateModified": "2026-01-26T18:30:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta Is Being Sued Over Whether WhatsApp Really Encrypts Your Messages",
    "url": "https://lifehacker.com/tech/meta-sued-whatsapp-encryption-claims?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFXEEGX9SV89M0M6GXJEH96N/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-26T16:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit:  miss.cabul / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            An international group of plaintiffs allege that WhatsApp's end-to-end encryption isn't actually private.\n                                            Meta denies the claims, calling the lawsuit 'frivolous.'\n                                            Lawyers are asking the court to certify a class-action.\n                                    \n            \n    Table of Contents\n    \n        \n        Shortly after Meta (then Facebook) bought WhatsApp in 2014, it promised to implement a surprisingly un-Facebooky feature: End-to-end encryption. The move was supposed to be a boon for privacy, ensuring nobody could see your messages aside from the recipient and yourself. Even now, WhatsApp's website claims, \"No one outside of the chat, not even WhatsApp, can read, listen to, or share [your messages].\" However, a new lawsuit filed in the U.S. District Court in San Francisco is now claiming that's not the case.According to reporting from Bloomberg, an international group of plaintiffs has sued Meta, saying that the app's claims of end-to-end encryption are a lie. The lawsuit alleges that Meta and WhatsApp \"store, analyze, and can access virtually all of WhatsApp user's purportedly 'private' communications.\"The plaintiffs include users from Australia, Brazil, India, Mexico, and South Africa, who are being represented by attorneys from several firms. The allegations cite \"whistleblowers\" who helped bring this information to light, but no more is known as of yet.\nWhen I reached out to Meta for comment, Meta strongly denied the allegations. The company called the lawsuit \"frivolous,\" assuring users that WhatsApp uses the open-source Signal protocol for encryption and adding that \"[a]ny claim that people's WhatsApp messages are not encrypted is categorically false and absurd.\"\n            \n                What do you think so far?\n            \n        \nIf the lawsuit succeeds, it could affect billions of users around the world. That's because the plaintiffs' lawyers are asking the court to certify a class-action lawsuit.In the meantime, WhatApp is far from the only option for encrypted messaging apps. While it's unclear how the lawsuit will proceed, those looking to jump ship might want to look at alternatives like Signal or Viber instead. Note that some apps, like Telegram, do offer end-to-end encryption, but don't enable it by default. (Personally I use Line, because of the anime stickers.)\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta Is Being Sued Over Whether WhatsApp Really Encrypts Your Messages",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFXEEGX9SV89M0M6GXJEH96N/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-26T16:30:00.000Z",
      "dateModified": "2026-01-26T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "All the Ways to File Your Taxes for Free in 2026",
    "url": "https://lifehacker.com/money/how-to-file-your-taxes-for-free?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JJMDMTGR2V2YW4G68G62DNK9/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-26T17:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Tax season is here again, which means it is time to start working on preparing your return (and paying any balance due) ahead of the April 15 filing deadline. As usual, many people will have the option to file their returns for free, but the options are more limited this year, as the short-lived IRS Direct File program, which provided no-cost filing to taxpayers in 25 states, is no more. If you want to avoid paying for the privilege of paying your taxes, here are the remaining ways to file for free in 2026. IRS Free File is one of several free filing options provided by the IRS. With Free File, you complete your tax return using guided software via a partner site, which then e-files it with the IRS. Most commonly used federal tax forms and schedules are available through Free File. However, your adjusted gross income must have been $89,000 or less in 2025 to be eligible for this option. \nIf you do qualify for Free File, go directly through the IRS website—you'll see a list of trusted third-party preparers with their eligibility criteria, or you can use the guided tool to find the best option for your situation. Note that some IRS partners will also file your state return for free, while others charge an additional fee. \n            \n                What do you think so far?\n            \n        \nOther ways to file your taxes for freeIf you make too much for IRS Free File, you may still be able to file your taxes for free. Free Fillable Forms: This option is just like it sounds. You enter your information into the IRS' fillable forms using the provided instructions and file the return yourself. There are no income limits for Free Fillable Forms, but it does have limited guidance, and state returns are not included. You will still need to create a Free File account. Commercial tax software: If your taxes are relatively simple, you can go through tax preparation companies like TurboTax and H&R Block without paying any fees. Cash App Taxes is another free option. Note that these companies also have paid services, so make sure you understand what you are signing up for. Volunteer tax prep help: The IRS offers free tax prep support for eligible taxpayers through the Volunteer Income Tax Assistance (VITA) and the Tax Counseling for the Elderly (TCE) programs. Taxpayers who make less than $69,000 per year, who have disabilities, or who have limited English proficiency qualify for VITA, while TCE supports those who are age 60 and older. Enter your zip code into the locator tool to find volunteer tax prep options in your area. MilTax: MilTax offers free tax preparation and filing for eligible military members, including up to three state returns. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All the Ways to File Your Taxes for Free in 2026",
      "image": [
        "https://lifehacker.com/imagery/articles/01JJMDMTGR2V2YW4G68G62DNK9/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-26T17:30:00.000Z",
      "dateModified": "2026-01-26T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Best Headphones I've Ever Tested Are $60 Off",
    "url": "https://lifehacker.com/tech/sony-xm6-headphones-deal-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFXV0SAQGA40GM2CFQ8BHWPS/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T19:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                            \n        \n            Daniel Oropeza\n                \n                                            Staff Writer\n                                    \n            \n            \n        \n            ExperienceDaniel is a Staff Writer for Lifehacker covering tech deals and reviewing TVs, headphones, speakers, and projectors. He earned his master’s in journalism from Columbia University and has reported for the Miami Herald. He lives in Atlanta.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Daniel Oropeza\n                            \n    Table of Contents\n    \n        \n        Sony's 1000X headphone series has been around since 2016—the WH-1000XM6s are the latest model, released in 2025, and they're the best over-ear headphones I tested that year (and ever, really). Right now, you can get the Sony WH-1000XM6 headphones for $398 (originally $459.99), their lowest price ever, according to price-tracking tools. \nThis newest model improves upon what were already excellent headphones. Sony upped the microphone count from eight to 12 when compared to the XM5, which improves more than just how well you sound to someone on a phone call. The microphones are used in almost all of its features, like ANC, Adaptive Sound Control, and the headphones' Ambient Sound mode. They hear your surroundings to adapt their features accordingly. If you switch from a noisy room to a quiet one, the XM6 can switch from ANC to aware mode.These headphones have a lot more features that you can nerd out on in the companion app, too. The sound is second to none, with LE Bluetooth Audio compatibility, which makes Bluetooth more efficient and improves audio quality. Spatial Audio upmixes the audio you're listening to and processes it to create a more immersive experience. There's also a fully customizable EQ giving you plenty of options to get the sound how you like it. I really like being able to see what codec you're listening to in the app's main menu. That way, there's no guessing if you're getting the best audio quality or not. These headphones will give you 30 hours of battery life with ANC on and 40 hours with ANC off. There's an AUX (3.5mm) jack for wired listening, which is a nice touch for audiophiles who still rock iPod Classics (or is that just me?). \n            \n                What do you think so far?\n            \n        \nThe XM6s are not just the best headphones of 2025, but are likely to be the best ones for years to come. For $398, you'll be securing the best for a record low price we likely won't see again for a while.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Best Headphones I've Ever Tested Are $60 Off",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFXV0SAQGA40GM2CFQ8BHWPS/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T19:30:00.000Z",
      "dateModified": "2026-01-26T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tesla Has Dropped This Basic Autopilot Feature, Forcing US Drivers Into Subscriptions",
    "url": "https://lifehacker.com/tech/tesla-dropped-basic-autopilot-forcing-us-drivers-into-subscriptions?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFNT5VGGSDV7RPZ6PP827F3M/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-23T18:00:34.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 23, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Mulevich / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Tesla is ditching its free basic Autopilot mode in North America.\n                                            The mode came with Traffic Aware Cruise Control and Autosteer, but Autosteer is now going away.\n                                            Buyers will need to subscribe to a $99 per month full self-driving subscription to get Autosteer back.\n                                    \n            \n    Table of Contents\n    \n        \n        If you're in the market for a new Tesla, your fancy new electric car is going to be a little less smart—unless you pony up for a subscription. According to reporting from Elektrek and buying experiences from drivers, the company is ditching the basic Autopilot mode that used to come standard in new vehicles, and is now pushing buyers to subscribe to Full Self-Driving instead.Before, Autopilot consisted of two minor but helpful driving assist features. The first was Traffic Aware Cruise Control, which automatically adjusts speed based on the speed limit and surrounding cars, and the second was Autosteer, which helps keep you in the center of your lane. The idea was that, while highway driving, you could turn on Autopilot and essentially let your car drive itself (while still remaining attentive and aware, of course).Now, though, Autosteer will only be available as part of a Full Self-Driving, or FSD, subscription. Traffic Aware Cruise Control will still come standard on new vehicles, but highway drivers who aren't paying Tesla a monthly fee will now need to make tiny corrections every once in a while to keep from veering into the wrong lane.\nMaking its cars dumber by default is an odd move for a company that wants to be seen as cutting-edge, although if removing Autopilot encourages more FSD subscriptions, that would see more users with Tesla's most-advanced self-driving tech on the road. Unfortunately, that goal will be pretty costly for consumers. A Full Self-Driving subscription currently costs $99 per month, although until Feb. 14, you are able to buy a lifetime FSD subscription for $8,000.Which features you'd get with an FSD sub depends on what's legally available in your area, but in addition to bringing back Autosteer, upgrading could also net you assistance with parking, pickups, and lane changes. However, if all you want is to get your basic functionality back, disgruntled drivers are pointing out that the discontinued features continue to be offered standard on lower-cost models from competing brands, like Toyota.\n            \n                What do you think so far?\n            \n        \nThe move to push Full Self-Driving subscriptions also comes alongside a promise from Tesla owner Elon Musk that pricing for the feature will go up as it improves, although the statement seemed to mostly focus on hopes of a future unsupervised FSD mode rather than more minor upgrades.At any rate, it's getting more expensive to buy a Tesla that lives up to the futuristic dreams the marketing promises. The company does still offer a slightly less expensive $6,000 \"Enhanced Autopilot\" add-on in some international regions, which combines the features from basic Autopilot with a few FSD features, but North American customers will now have no choice but to subscribe.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tesla Has Dropped This Basic Autopilot Feature, Forcing US Drivers Into Subscriptions",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFNT5VGGSDV7RPZ6PP827F3M/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-23T18:00:34.000Z",
      "dateModified": "2026-01-23T18:00:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What to Do to Prepare Your House for This Weekend's Historic Winter Storm",
    "url": "https://lifehacker.com/home/prepare-your-home-for-winter-storms?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JAG65KMPBS2GT5X9HQ6CRJ7P/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-23T15:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 23, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: ND700/Shutterstock\n                            \n    Table of Contents\n    \n        \n        Ideally, a winter storm is merely uncomfortable and annoying, but they can sometimes be dangerous for you and your home. This weekend, a potentially historic winter storm is bearing down on some 200 million Americans, who may face dangerously icy conditions and significant snowfall. It's important to know your area's risk and understand the meaning and potential impact of different weather terms (advisory, watch, and warning) so you can respond quickly in the event of an emergency. You should also use the next few days to take steps to prepare your home and lower the chances of damage and danger.Winter prep starts with a thorough inspection of your property, both inside and out and top to bottom. Look for everything from roof leaks to door gaps to clogged gutters—anything that could lead to damage from snow, ice, and freezing temperatures. Make a plan for repairs and winterization to ensure your safety and comfort—not just for the next storm, but for the entire season. Here's a quick summary of the most important tasks to take care of before the temperatures drop or the snow starts to fall. \nTest your smoke and carbon monoxide detectorsThis is something that should be part of your regular home maintenance, and it's especially important when you are using your furnace and fireplace regularly (considering both fire safety and indoor air quality). Follow the Environmental Protection Agency's guidelines for where to install CO detectors and how to inspect and maintain them; then check out the National Fire Protection Association's (NFPA) guidelines for smoke alarms. Make sure your fire extinguisher is handy and working as well. Install an easy-to-read thermometerAny thermostat will show you indoor temperature, and if you have a smart system like an Ecobee or Nest, you have real-time data at your fingertips. The CDC also recommends installing easy-to-read thermometers in locations where you'll see them frequently. This is especially important for older adults, as our sense of temperature changes as we age, increasing the risk of cold-related health issues. Fix drafty windows and doorsGaps around doors and windows keep your home drafty, which is uncomfortable and a waste of energy. Door sweeps, weatherstripping, and caulk can be used to fill spaces that allow cold air in. These are simple DIY fixes that go a long way toward lowering your heating bill and keeping your home warm. If your home has older windows, floor-to-ceiling thermal curtains can also help with insulation even if you lose heating. Winterize your outdoor faucets Before freezing temperatures arrive, make sure your outdoor plumbing is prepared—frozen pipes can burst, causing significant damage to your home. To winterize exterior faucets, remove and store hoses, shut off outdoor water, drain spigots, close them up, and insulate with covers.While you don't need to fully winterize your indoor plumbing unless your house will be vacant for an extended period of time, you should look for pipes that are uninsulated and in or near unheated spaces and consider applying insulation sleeves or heat tape. \n            \n                What do you think so far?\n            \n        \nCheck your furnaceTurn your furnace on and make sure it is working properly. Even if you don't need to heat your home right now, you don't want to scramble to schedule an emergency repair down the line when it's freezing outside. Look for common signs that your unit needs maintenance, such as unusual smells and noises, short cycling, and lack of actual heat. Replace your air filter as well. Inspect and clean your fireplaceYour fireplace or wood stove can provide heat in an emergency. Like your furnace, they need seasonal maintenance to avoid chemical buildup and ensure proper venting, both of which impact your indoor air quality and overall safety. The NFPA recommends annual cleaning, which you can do yourself. However, if it's been awhile since your fireplace was professionally inspected and cleaned, consider scheduling a chimney sweep before you start your first winter fire. You can find one online or ask your local fire department for a recommendation. Stock your snow suppliesIf you get snow in your area, make sure your shovels are accessible and restock your ice melt. If you use a snowblower, give it a thorough inspection, replace any worn or damaged parts, change the oil, top it off with fresh gas, and start it up to make sure it runs. Replenish your emergency kitYou should be prepared for storms during any season with a stock of disaster supplies so you and your family (and pets) can survive without outside aid for a few days if needed. We have a guide to creating an emergency kit if you don't have one already, but you should also check all supplies and replenish anything that has been used or is missing. For winter, be sure you also have sleeping bags, warm blankets, and climate-appropriate changes of clothes and shoes available.\n            \n    \n    \n            Never miss a story\n                Get the latest smart home news, trends, and advice from Jordan and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What to Do to Prepare Your House for This Weekend's Historic Winter Storm",
      "image": [
        "https://lifehacker.com/imagery/articles/01JAG65KMPBS2GT5X9HQ6CRJ7P/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-23T15:30:00.000Z",
      "dateModified": "2026-01-23T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Cold Is Too Cold to Run Outside?",
    "url": "https://lifehacker.com/how-cold-is-too-cold-to-run-outside?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GG4A4DBB0KW3QA3HF3PPR/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-23T17:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            \n        \n            Meredith Dietz\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceMeredith is a marathon runner and stand-up comedian. As Lifehacker’s Senior Staff Writer, she covers personal fitness tech, home gym equipment, and more.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 23, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Vladimir Razgulyaev / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Dedicated runners and winter athletes will tell you that exercising in the cold is not as tough as it looks. Personally, I'd rather risk frostbite over any treadmill run that lasts longer than 20 minutes. But is there a point where winter runs cross over from difficult to dangerous? There is no clear cut-offMost experts suggest that the danger zone begins around -18°F (-28° Celsius), particularly when factoring in wind chill. At these extreme temperatures, the risk of frostbite increases dramatically, and breathing frigid air can become uncomfortable or even harmful to your lungs and airways.But beyond the raw temperature, certain conditions should prompt you to choose the treadmill over the trail. Wind chill matters significantly more than the actual temperature—a 20°F day with 25 mph winds feels like -4°F and carries similar risks. Precipitation combined with cold is particularly dangerous, as wet clothing rapidly accelerates heat loss.\nIcy conditions create obvious fall risks, and a twisted ankle or other injury becomes far more serious when you're miles from home in subzero temperatures. If the footing is treacherous with ice or you're unable to adequately protect your extremities with the gear you have available, it's wise to skip the outdoor run. Trust your instincts: If the cold feels genuinely painful within the first few minutes rather than just uncomfortable, that's your body sending a clear message.Again, this threshold isn't absolute. Your personal cold tolerance, experience level, the gear you own, and specific weather conditions all play a role. I know I've managed runs in 10°F, mostly because it was plenty sunny, with no wind, and I was expertly bundled up. Here are some of things to do if you’re a brave soul heading out to run in the freezing cold.If you do venture out in very cold weather, preparation is everything. Dress in layers using moisture-wicking base layers, insulating middle layers, and windproof outer shells. Protect your extremities carefully with gloves or mittens, a hat or headband, and warm socks. A neck gaiter is a must-have to pull up over your nose and mouth to help warm the air before it reaches the lungs.Start your run into the wind so you'll have it at your back when you're sweaty and more vulnerable to heat loss on the return trip. Keep your runs shorter and stay close to home or in areas with bailout options. Let someone know your route and expected return time. It also helps to physically modify your route to accommodate layers. Plan a run where you can shed extra layers after the first mile and then pick them up on your way back.\n            \n                What do you think so far?\n            \n        \nPay attention to your body throughout the run. Any numbness, excessive pain, confusion, or severe shivering means it's time to get indoors immediately. Remember that you can always cut a run short—there's no shame in prioritizing your safety over a workout.Another tip, from plenty of personal experience: Be extra aware of mouth-breathing while running in cold, dry air. I recommend running with cough drops in order to help you practice breathing through your nose.The bottom lineI always tell myself that if something feels off after my first mile, I’m allowed to turn around and walk home. Grant yourself extra leniency in extreme weather conditions. If you really can’t bear missing any miles, consider a hybrid plan of running half of your route outdoors and half on a treadmill.You can run outside at quite chilly temperatures before you seriously risk frostbite or any other cold-weather consequences. For most runners, the practical limit for safe outdoor running falls somewhere between 0 and -20°F. As long as you’re prepared with protective gear, you can listen to your body to acclimate to cold temperatures as best as you personally can. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Cold Is Too Cold to Run Outside?",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GG4A4DBB0KW3QA3HF3PPR/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-23T17:30:00.000Z",
      "dateModified": "2026-01-23T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Finally Announced a New AirTag",
    "url": "https://lifehacker.com/tech/apple-new-airtag?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFXE93Z0SG6XQK14RECA9R5C/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T16:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Wachiwit/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple just announced a new AirTag.\n                                            The new AirTag comes with the latest Ultra Wideband chip, that boosts Precision Finding by 50%.\n                                            It also comes with a 50% louder speaker compared with the original AirTag.\n                                            Other than that, the new AirTag is about the same as the original, including in price.\n                                    \n            \n    Table of Contents\n    \n        \n        It's been nearly five years since Apple released the first—and only—AirTag, but that's not necessarily a surprise: These trackers aren't really the kind of product you expect to update every year or two. Unlike an iPhone, which gets new processors, cameras, and other hardware features every year, AirTags just ... track your stuff. The only thing that needs replacing annually are their batteries; otherwise, they do exactly what you expect them to. That said, Apple has made changes over the years. In response to initial criticism, the company made it much more difficult for someone to slip one of these AirTags in your bag or car and track you without your knowledge. Plus, there's plenty you can do with the current AirTag that wouldn't make you think you needed an upgraded one. Nonetheless, I suppose the original AirTag wasn't going to be the AirTag for all time. As such, Apple just announced a brand-new AirTag. It likely won't get you out to replace your existing Apple trackers, but these new features will come in handy if you decide to expand your AirTag collection.  What's new with the latest AirTagApple isn't really calling this new AirTag anything in particular: It's still just AirTag. I'm a bit surprised, since, even if Apple replaces the existing AirTag with this one, they'll have a difficult time distinguishing between the first and second gen models.\nBut that's a problem for Apple Store Geniuses, not us. The new AirTag comes with Apple's second-gen Ultra Wideband (UWB) chip. This is the UWB chip Apple uses with the iPhone 17 Line, as well as the iPhone Air, the Apple Watch Ultra 3, and Apple Watch Series 11. That new chip, plus the new Bluetooth chip, boosts Precision Finding's range by 50%. Precision Finding uses your iPhone to guide you to your AirTag, using haptics and visual and audio feedback to tell you when you're getting closer or further away. To be clear, the original AirTag also has a UWB chip that is compatible with Precision Finding, but this new UWB chip will make it easier to find an AirTag that isn't as close by.If you have an Apple Watch Series 9 or Apple Watch Ultra 2, the new AirTag marks the first time you'll be able to use Precision Finding. I'm not sure that's worth the upgrade, since you can always use Precision Finding with your iPhone, but it's certainly a nice perk if you happen to own one of these watches. Precision Finding is helpful for finding your AirTag's whereabouts, but it might not help you locate it if it's hiding, like if it's stuck under a cushion. That's what the speaker is for: You can make your AirTag chirp, so you can find it easier when you're within listening range. The new AirTag's speaker is 50% louder than the original, which should help when you really can't find your AirTag in your couch.  What isn't new with the latest AirTagThat's about all the updates Apple added to this newest AirTag—though you wouldn't know it from the press release. Apple sprinkles in existing AirTag features that might make you think they're fresh, but, really, these are just core features of all AirTags, both new and old. \n            \n                What do you think so far?\n            \n        \nThis AirTag, like all AirTags, works within the Find My network: There's no inherent internet connection to enable tracking. Instead, the AirTag passively connects to any and all internet-connected Apple devices that are also connected to Find My—often, that means iPhones, but it can mean other devices like iPads and Macs. That enables features like Share Item Location, which lets you share your AirTags location with a third-party, like an airline. In that example, the airline can use that info to help find your luggage. The new AirTag also carries over the same privacy and security features as the previous model. No data is stored on device, and all Find My communications are end-to-end encrypted. Whether you have this AirTag or the first, Apple can't see your AirTag, or any devices that connected it to the Find My network. How much does the latest AirTag cost?Apple also didn't change the price of the second-gen AirTag. One of these trackers runs you $29, while a four pack costs $99—a small savings if you want to buy that many. Unless you really need the newest ones, however, you might want to consider the previous gen, since you can pick up a four-pack for $69.99 on Amazon right now. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Finally Announced a New AirTag",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFXE93Z0SG6XQK14RECA9R5C/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T16:00:00.000Z",
      "dateModified": "2026-01-26T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "It's Not Just You, Microsoft 365 Is (Still) Down",
    "url": "https://lifehacker.com/tech/microsoft-365-is-down-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFGSCGZZ7Q0ZMYVDW6NWCC5S/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-22T19:53:30.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 22, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: aileenchik/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Microsoft is currently experiencing another outage with its services.\n                                            Users are reporting issues with Microsoft 365, Microsoft Teams, and Microsoft Outlook.\n                                            This is the second day in a row that Microsoft has experienced these downtimes.\n                                            If your apps are impacted, you'll need to wait for Microsoft to issue a patch.\n                                    \n            \n    Table of Contents\n    \n        \n        Heads up, workers of the world: Microsoft 365 is currently down. Microsoft's flagship work suite, which includes tools like Microsoft Teams and Microsoft Outlook, is currently experiencing issues impacting users. It's not yet clear exactly why these problems are occurring, but according to Downdetector (owned by Lifehacker parent company Ziff Davis) thousands of users are reporting issues.There are any number of causes that could trigger a widespread outage like this, and in all likelihood, Microsoft will have the issue isolated and fixed soon—especially considering how many companies and users rely on Microsoft 365 to function. But it does follow a number of high-profile outages this week. Yesterday, Yahoo! and AOL were both down. Last week, X experienced an outage, as did Verizon—quite famously, I might add. And this morning, Instagram was also down.\n            \n                What do you think so far?\n            \n        \nBut joining that list as well is none other than Microsoft itself. These services were all down yesterday, too, making this the second day in a row. Again, it's not clear why Microsoft is experiencing these issues, but while we wait for a fix, there's not much you can do on your end. If your Microsoft apps are acting up, you can try to work with any of the offline tools you have access to. If you have other means of communication other than Teams, run with that. There's nothing short of Microsoft issuing a patch on its end that will bring back online functionality here.     \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "It's Not Just You, Microsoft 365 Is (Still) Down",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFGSCGZZ7Q0ZMYVDW6NWCC5S/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-22T19:53:30.000Z",
      "dateModified": "2026-01-22T19:53:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Six Scams to Watch Out for During Tax Season",
    "url": "https://lifehacker.com/money/tax-season-scams-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFP221GCSVA7VZQ8VZ5NATG4/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-26T13:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 26, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: René Ramos / Lifehacker Composite / Adobe Stock\n                            \n    Table of Contents\n    \n        \n        The 2026 tax filing season—for 2025 returns—begins on Jan. 26, which means scammers are ramping up efforts to steal taxpayers' information and money. These are a few of the tax-related schemes to watch out for this year. 'Tax resolution' scamsThe Federal Trade Commission (FTC) is alerting consumers to a phone scam currently circulating in which callers claim to be from the “Tax Resolution Oversight Department,\" “Tax Mediation and Resolution Agency,” or some similar official-sounding (but fake) government organization. They will claim that you owe back taxes and say they will help you apply for an “IRS liability reduction program” (also fake). The scammers' aim here is to collect your Social Security number (SSN) and possibly an upfront payment for their services. They will likely pressure you and create a sense of urgency with lines like “this may be our only attempt to reach you.\" Don't fall for it. If you do actually owe back taxes, the IRS will send you a notice via mail, and you'll have options to settle that debt directly with the agency. \nA common type of tax scam is the fraudulent text or email that appears to be from the IRS but is actually a phishing campaign. The FTC's most recent alert reminds consumers that any message that asks you to verify your identity in order to receive your refund is a scam. You may get a text or email \"from\" the IRS or your state tax authority notifying you that they've processed your refund, and all you have to do is provide some information via the link provided in order to claim it. As with any phishing scam, doing so hands your information directly to bad actors. Neither the IRS nor your state tax office will contact you via text, email, or social media message, and you should never click links in unsolicited communication. IRS impersonation scamsNext, there's the general category of IRS impersonation scams. Both of the above could be included here, but there's also the fake IRS letter that—with great urgency—demands sensitive personal information or payment for taxes owed. Sometimes, these letters request said payment via gift card, which is always a red flag. Letters may also say something about an unclaimed refund and request photos of your identification.Scammers have also been known to call people about their tax bill or refund while claiming to represent the IRS or another agency that provides government benefits. They may also claim that your information is being used in some type of crime. If a caller threatens you or demands payment, hang up immediately. Tax prep scamsIf you're hiring a tax professional to help you with your return, you should vet them before handing over your information. At best, a tax preparer may lack the proper credentials and experience—at worst, they may falsify your return or pocket your refund. A \"ghost\" tax professional will scam you by not signing your return after they've prepared it. \n            \n                What do you think so far?\n            \n        \nYou are legally responsible for your taxes, so do your due diligence and review your return carefully before signing your own name. Don't pay for services in cash, and always get a receipt. Tax identity theft scamsThis scam typically involves a scammer filing a tax return using your name and SSN and pocketing the refund—and you may not realize that you're a victim until after you've filed your real return and received a notice from the IRS about the duplicate. To prevent this, set up an identity protection PIN with the IRS. This six-digit number changes every calendar year, and no one can file a return under your SSN or individual taxpayer identification number (ITIN) without it. Note that the IRS will never ask for your IP PIN, so any communication requesting it is (also) a scam. IRS support scamsFinally, scammers may contact you and offer paid services for something you can do for free. For example, you can easily create an IRS account online and do not need to pay someone to do it for you or hand over your personal information to a third party in the process. Anyone who offers unsolicited help to set up your account, negotiate your tax debt, or otherwise manage your return or refund (especially for a fee) is a scammer. How to protect yourself from tax scamsAs we've mentioned, stay vigilant to common scam tactics, such as unsolicited communication, a sense of urgency, and a demand for money or information. The IRS has specific ways of contacting taxpayers, and you should know how to verify that mailed notices and other forms of communication are real. You can always call the IRS directly to confirm if what you're being told is legitimate. Don't click links in texts, emails, or social media messages—instead, go directly to the IRS.gov website and access your account there. When it comes to your return, if you're not taking the DIY route, choose a qualified tax professional, and request an IP PIN to protect your SSN against fraudulent filing. Consider filing early and electronically, which will also get your refund processed sooner. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Six Scams to Watch Out for During Tax Season",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFP221GCSVA7VZQ8VZ5NATG4/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-26T13:00:00.000Z",
      "dateModified": "2026-01-26T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This 2-in-1 ASUS Chromebook Is Nearly $100 Off Right Now",
    "url": "https://lifehacker.com/tech/2-in-1-asus-chromebook-flip-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KFNNX24F52T2XTKPHA1TN9E2/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-23T16:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon/Lifehacker \n                            \n    Table of Contents\n    \n        \n        Two-in-one laptops are an adaptable tech essential for anyone who’s waffling between a laptop and a tablet—they’ve changed how people tackle workflows and consume entertainment, and are a more portable option for commuters or anyone who wants the perks of a touchscreen with their laptop. The 14-inch Asus Chromebook Flip CX1 is a sturdy, entry-level 2-in-1 for those on a budget, and according to price trackers, it’s at its lowest price ever—$279, down from $369.99.\nThis convertible laptop runs ChromeOS (which does security auto-updates) and features a touchscreen hinge that flips all the way back and an Intel Celeron N4500 processor with 8 GB RAM and 128 GB eMMC storage. It's designed for casual, everyday use, like work, video streaming, and multitasking, rather than heavy multitasking or more demanding tasks like video editing, serious gaming, or 3D rendering. The CX1 has a 13-inch full HD touchscreen with sharp vision and lasts up to 11 hours on a single charge, based on usage.\n            \n                What do you think so far?\n            \n        \nUsers get USB-C fast charging, fingerprint login, and a backlit keyboard. The laptop also features a 1080p webcam for calls and dual speakers, as it integrates well with Google services like Google Assistant voice control. It’s a no-frills, lightweight option (just over 3.5 lbs) that easily flips, and while it doesn’t have the fancy high-end specs and heavy performance capabilities of some Chromebooks, it’s a decent option that performs well and covers basics, which is more than generous for an under-$300 price tag. \n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This 2-in-1 ASUS Chromebook Is Nearly $100 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KFNNX24F52T2XTKPHA1TN9E2/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-23T16:00:00.000Z",
      "dateModified": "2026-01-23T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The AirPods Pro 3 Are $50 Off Right Now",
    "url": "https://lifehacker.com/tech/airpods-pro-3-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC7JV9CXW41K0CXPP1A8VSDF/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-23T22:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                            \n        \n            Daniel Oropeza\n                \n                                            Staff Writer\n                                    \n            \n            \n        \n            ExperienceDaniel is a Staff Writer for Lifehacker covering tech deals and reviewing TVs, headphones, speakers, and projectors. He earned his master’s in journalism from Columbia University and has reported for the Miami Herald. He lives in Atlanta.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 23, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Rene Ramos.\n                            \n    Table of Contents\n    \n        \n        The latest AirPods Pro are a big step up from the first-generation buds. The third (and newest) generation comes with OTA updates that the AirPods Pro 2 also get to enjoy—but considering the second and third generations are the same price right now, why not go with the newer version? If you want the latest Apple has to offer, this is a great time to do so. The AirPods Pro 3 are down to $199 (originally $249.99) for the first time since their September release—the lowest price yet, according to price tracking tools.\nThe AirPods Pro 3 improve on already great premium earbuds with new features (like a heart rate sensor) without increasing the list price. You'll get Personalized Spatial Audio (so you can hear sounds seemingly coming from different directions as you move your head) and the ability to use head gestures to tell Siri \"yes\" or \"no\" (this also works for answering or denying calls). Apple added a live translation feature to both the second- and third-generation AirPods Pro when iOS 26 rolled out earlier this year. You'll also get features like Conversation Awareness, which lowers your music volume when your AirPods detect that you're talking to someone; Transparency Mode, which lets you better hear your surroundings while your earbuds are in; and Adaptive Audio, which combines ANC and Transparency mode to adjust ANC levels based on the noise around you.\n            \n                What do you think so far?\n            \n        \nSince these are in-ear earbuds (as supposed to regular earbuds like the AirPods 4) the ANC is much better since it naturally blocks out the noise with a tight seal, but the ANC technology itself has also improved—as has the sound quality, thanks to the new H3 chip, as PCMag detailed in its \"exemplary\" review. You can expect about eight hours of juice, depending on your usage, and another 24 hours from the charging case. \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The AirPods Pro 3 Are $50 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC7JV9CXW41K0CXPP1A8VSDF/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-23T22:30:00.000Z",
      "dateModified": "2026-01-23T22:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]