[
  {
    "title": "Your Android Can Now Share Live Video to 911",
    "url": "https://lifehacker.com/tech/your-android-can-share-live-video-to-911?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC87Y7A3B2PQDPHH536D5D8E/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-12T15:30:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Skrypnykov Dmytro/Shutterstock \n                            \n         ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Skrypnykov Dmytro/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Live video sharing is rolling out now to U.S. users, as well as those in parts of Germany and Mexico.\n                                            The service is available for Android phones running Android 8 and up.\n                                            You don't need to do anything to set up Emergency Live Video.\n                                    \n            \n    Table of Contents\n    \n        \n        If you find yourself in an emergency or crisis situation, the more information you can give first responders, the better. Android users can now share a live stream of their surroundings with 911, allowing emergency services to assess and provide guidance in real time while you wait for help to arrive onsite.Emergency services on AndroidYour Android already shares some information with first responders via Emergency Location Services (unless you disable this feature). This built-in tool sends an accurate location as well as contextual information, such as language settings, when you call or text an emergency number. Now, that includes live video from your device's camera. You don't need to do anything to set up Emergency Live Video. Once available in your area, responders can send a request during an emergency call or text to securely share your camera's live video. You'll see a prompt on your screen to start sharing with one tap. \nAccording to Google, Emergency Live Video is encrypted by default. Users can choose whether to share their video from the prompt as well as stop the share at any time by clicking the onscreen Stop sharing button. \n            \n                What do you think so far?\n            \n        \nLive video sharing is rolling out now to U.S. users, as well as those in parts of Germany and Mexico, on Android phones running Android 8 and up. Google says they are partnering with public safety organizations to expand the feature to more users. Other Android safety featuresEmergency Live Video is the latest in Google's suite of safety features designed to make help more accessible—more quickly—in an emergency. Pixel users in Australia, North America, and several dozen countries across Europe now have access to Satellite SOS, which allows you to call emergency services even without a cellular or wifi connection. Car Crash Detection contacts emergency services and shares your location in the event of severe crash, while Fall Detection and Loss of Pulse Detection will call for help based on Pixel Watch sensor data. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Your Android Can Now Share Live Video to 911",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC87Y7A3B2PQDPHH536D5D8E/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-12T15:30:00.000Z",
      "dateModified": "2025-12-12T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Use Your MacBook's Display As a Ring Light",
    "url": "https://lifehacker.com/tech/macbook-update-edge-light-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCAADYAG0C2ZP6WS0CEA7K1E/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-15T14:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Apple\n                            \n    Table of Contents\n    \n        ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Apple\n                            \n    Table of Contents\n    \n        \n        Sometimes you need just a little bit more light during a video call, especially if you're in a dimly lit room. The latest macOS update (26.2) has a trick for this: you can use the edge of your screen as a ring light.The feature, which adds a rounded white rectangle to your screen, is called Edge Light. The rectangle takes up part of your screen but will become partially transparent if you move your mouse pointer into it, meaning you'll mostly be able to use your computer normally.You can use the feature by clicking the camera icon on the menu bar during a call and toggling on the Edge Light option. You can also adjust the brightness and the color of the edge light from here.\n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nI tried this in a well-lit room and didn't notice much of a difference, which makes sense. In a totally dark room, though, it proved extremely helpful. Here's how I looked without Edge Light:\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nAs you can see, I'm just barely lit by the laptop itself. Here's how I look with the feature turned on:\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nIt's a lot easier to make out my face, but whether that's a pro or a con is a matter of opinion. Try the feature out if you find yourself on a video call with the lights off. Note that it's only offered on devices with Apple Silicon.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Use Your MacBook's Display As a Ring Light",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCAADYAG0C2ZP6WS0CEA7K1E/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-15T14:00:00.000Z",
      "dateModified": "2025-12-15T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Use 'Circle to Search' to Identify Scams on Android",
    "url": "https://lifehacker.com/tech/circle-to-search-can-now-identify-scams-on-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC9SAFF9FGZWDBX4J2A5SMKB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-12T19:30:10.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n      ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            Circle to Search and Google Lens can now assess messages for scam red flags.\n                                            Circle the text or take a screenshot to scan for signs of fraud.\n                                            Google will provide recommendations for next steps.\n                                    \n            \n    Table of Contents\n    \n        \n        Android users are getting more tools to combat the seemingly endless stream of scam texts from bad actors looking to steal your data and your money. Circle to Search and Google Lens can now assess messages for scam red flags, and if possible fraud is detected, you'll get recommendations for what to do (or not do) next. Even if you think you know the telltale signs of a scam—a sense of urgency, a demand for money or personal information, a link to log in or pay—using these tools can confirm your suspicions, especially when you feel pressured to act. To activate Circle to Search, long press the home button or navigation bar on your device and circle the text you want to scan. Alternatively, you can take a screenshot, open Lens in the Google app (also available on iOS), and tap the screenshot. The feature works for text messages as well as communication on messaging apps and social media sites. Google says the capability is available \"when our systems have high confidence in the quality of the response.\" This is just the latest in the Google's suite of security features meant to protect against fraud. Pixel users have real-time, AI-powered scam detection, which identifies and alerts you to suspicious conversational patterns in Google Messages and Phone by Google. In-call protections for Android prevent you from taking certain actions, such as sideloading new apps and changing accessibility permission, on your device while on the phone with anyone not saved in your contacts. \n            \n                What do you think so far?\n            \n        \nEarlier this month, Google also expanded its in-call scam detection feature, meant to combat bank impersonation schemes, to U.S. users. If you are on a call with a number that's not in your contacts and try to open a participating financial app, you'll get a notification reminding you not to share information and a one-click option to stop screen-sharing and end the call. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Use 'Circle to Search' to Identify Scams on Android",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC9SAFF9FGZWDBX4J2A5SMKB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-12T19:30:10.000Z",
      "dateModified": "2025-12-12T19:30:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Attackers Are Spreading Malware Through ChatGPT",
    "url": "https://lifehacker.com/tech/chatgpt-grok-tech-advice-malware?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCFHKGX7QDA7SPFPM73VFFVJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-15T16:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: miss.cabul/Shutterstock \n                            \n    Table of Con",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: miss.cabul/Shutterstock \n                            \n    Table of Contents\n    \n        \n        You (hopefully) know by now that you can't take everything AI tells you at face value. Large language models (LLMs) sometimes provide incorrect information, and threat actors are now using paid search ads on Google to spread conversations with ChatGPT and Grok that appear to provide tech support instructions but actually direct macOS users to install an infostealing malware on their devices. The campaign is a variation on the ClickFix attack, which often uses CAPTCHA prompts or fake error messages to trick targets into executing malicious commands. But in this case, the instructions are disguised as helpful troubleshooting guides on legitimate AI platforms. How attackers are using ChatGPT Kaspersky details a campaign specific to installing Atlas for macOS. If a user searches \"chatgpt atlas\" to find a guide, the first sponsored result is a link to chatgpt.com with the page title \"ChatGPT™ Atlas for macOS – Download ChatGPT Atlas for Mac.\" If you click through, you'll land on the official ChatGPT site and find a series of instructions for (supposedly) installing Atlas. \nHowever, the page is a copy of a conversation between an anonymous user and the AI—which can be shared publicly—that is actually a malware installation guide. The chat directs you to copy, paste, and execute a command in your Mac's Terminal and grant all permissions, which hands over access to the AMOS (Atomic macOS Stealer) infostealer.A further investigation from Huntress showed similarly poisoned results via both ChatGPT and Grok using more general troubleshooting queries like \"how to delete system data on Mac\" and \"clear disk space on macOS.\" \n            \n                What do you think so far?\n            \n        \nAMOS targets macOS, gaining root-level privileges and allowing attackers to execute commands, log keystrokes, and deliver additional payloads. BleepingComputer notes that the infostealer also targets cryptocurrency wallets, browser data (including cookies, saved passwords, and autofill data), macOS Keychain data, and files on the filesystem. Don't trust every command AI generatesIf you're troubleshooting a tech issue, carefully vet any instructions you find online. Threat actors often use sponsored search results as well as social media platforms to spread instructions that are actually ClickFix attacks. Never follow any guidance that you don't understand, and know that if it asks you to execute commands on your device using PowerShell or Terminal to \"fix\" a problem, there's a high likelihood that it's malicious—even if it comes from a search engine or LLM you've used and trusted in the past. Of course, you can potentially turn the attack around by asking ChatGPT (in a new conversation) if the instructions are safe to follow. According to Kaspersky, the AI will tell you that they aren't. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Attackers Are Spreading Malware Through ChatGPT",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCFHKGX7QDA7SPFPM73VFFVJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-15T16:00:00.000Z",
      "dateModified": "2025-12-15T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The AirPods Pro 3 Are Now Under $200 for the First Time",
    "url": "https://lifehacker.com/tech/airpods-pro-3-sale-december-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC7JV9CXW41K0CXPP1A8VSDF/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-11T21:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Rene Ramos.\n                            \n    Table of Contents\n    \n        \n        The latest AirPods Pro are a big step up from the first generation buds. The third (and newest) generation comes with OTA updates that the AirPods Pro 2 also got to enjoy—but considering the second and third generations are the same price right now, why not go with the newer version? If you want the latest Apple has to offer, this is a great time to do so. The AirPods Pro 3 are down to $199 (originally $249.99) for the first time since their September release—the lowest price yet, according to price tracking tools.\nThe AirPods Pro 3 improve on already great premium earbuds with new features (like a heart rate sensor) without increasing the list price. You'll get Personalized Spatial Audio (so you can hear sounds seemingly coming from different directions as you move your head) and the ability to use head gestures to tell Siri \"yes\" or \"no\" (this also works for answering or denying calls). Apple added a live translation feature to both the second- and third-generation AirPods Pro when iOS 26 rolled out earlier this year. You'll also get features like Conversation Awareness, which lowers your music volume when your AirPods detect that you're talking to someone; Transparency Mode, which lets you better hear your surroundings while your earbuds are in; and Adaptive Audio, which combines ANC and Transparency mode to adjust ANC levels based on the noise around you.\n            \n                What do you think so far?\n            \n        \nSince these are in-ear earbuds (as supposed to regular earbuds like the AirPods 4) the ANC is much better since it naturally blocks out the noise with a tight seal, but the ANC technology itself has also improved—as has the sound quality, thanks to the new H3 chip, as PCMag detailed in its \"exemplary\" review. You can expect about eight hours of juice, depending on your usage, and another 24 hours from the charging case. \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The AirPods Pro 3 Are Now Under $200 for the First Time",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC7JV9CXW41K0CXPP1A8VSDF/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-11T21:00:00.000Z",
      "dateModified": "2025-12-11T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reading in Cars Makes Me Nauseous, but This App Helps",
    "url": "https://lifehacker.com/tech/motion-sickness-app-kinestop?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC7FNXVW0F2ARBX239E0AKH5/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-12T14:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n   ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        I get really carsick if I try to read in a moving vehicle. And there's a reason for that: my eyes and my sense of movement are out of sync.At least, that's according to the CDC, which states that motion sickness, \"happens when the movement you see is different from what your inner ear senses.\" Your inner ear is a sack of fluid that moves when you do, giving you an innate sense of movement. If you're in a car and watching the horizon, your senses are aligned. But if you're looking at your phone, your senses are confusing each other. It's similar to the reason VR games make some people feel sick.The free Android app KineStop aims to help. The application overlays a transparent horizon, and a number of transparent dots, across your entire screen. The accelerometer on your phone is used to move these reference points as your phone moves, helping to reduce the conflict between your eyes and your inner ear. You can turn the feature on manually in the application or, if you prefer, you can set it up to turn on automatically when you're in a moving car.\nI tried it out, wondering if it would help with my carsickness, and it did—surprisingly well. Normally I can't read for more than a few minutes without feeling sick, but the KineStop app helped me do so for longer, without discomfort. I'm still not going to be able to read novels during a long road trip, mind you, but I can look up the next restaurant on a road trip without vomiting, and I call that a win.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nKineStop is totally free, though there's a $3.50 pro version that adds themed overlays, including one that makes it look like your phone is a half-empty beer. It's great to support a developer, but I also think the free version will work fine for most everyone.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reading in Cars Makes Me Nauseous, but This App Helps",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC7FNXVW0F2ARBX239E0AKH5/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-12T14:00:00.000Z",
      "dateModified": "2025-12-12T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "10 Hacks Every Car Owner Should Know",
    "url": "https://lifehacker.com/home/car-hacks-everyone-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCPRBQJ27YHJAACCP2TPGW76/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-17T20:30:41.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    Make affording, maintaining, and driving your car a better experience.\n            \n                        \n    \n                            \n        \n        \n        December 17, 2025\n            \n    We may earn a commission from links on this page.\n    \n            \n                        Credit: René Ramos / Lifehacker / Rawf8 / Luca / Adobe Stock\n                            \n    \n        \n        America is a car-centric culture—more than 90% of U.S. households have at least one vehicle. There are a lot of different kinds of cars, from old classics being maintained with love, to snazzy new electric rides, or luxury cruisers filled with cutting-edge tech. Whichever kind you drive, getting the most out of your vehicle demands regular maintenance and sensible driving practices, but you can also goose just a bit more out of any vehicle with these universal car hacks.Throw some anti-seize lubricant in your trunkIf you’ve been driving for a while, you know that flat tires only come at the worst possible times. Sunny days when you have plenty of time? Those tires are infallible. Whiteout conditions and you’re racing to a job interview? Guaranteed flat—and you will discover that your lug nuts have fused and become absolutely impossible to shift.One way to prevent this is the judicious use of a little anti-seize lubricant, which is designed to prevent rust and other corrosion. Mechanics argue about this, to be fair—some professionals believe that using anti-seize on lug nuts changes the required torque, which can loosen them over time. But plenty of folks have used a small amount of anti-seize lubricant to make changing or rotating tires a lot easier without any adverse effects. The key is to use a very small amount—just enough to protect the threads.\nAdd silicone lubricant to your door gasketsThe seals around your car’s doors help to insulate the interior. Over time, these seals can become stiff and begin to fall apart, which makes your vehicle unattractive and less comfortable to ride in. You can prevent this with a simple hack: Grab some silicon lubricant and apply thin layer onto the rubber gaskets around your doors, trunk, and windows. It’ll save you a bit of frustrating maintenance in the future—and can prevent doors from freezing closed in winter. (An oft-repeated version of this hack is to use petroleum jelly, which is OK in a pinch, but it can cause rubber to degrade over time, which silicone lubricants won't.)Track your tire tread wear with a quarterTire tread is essential for the safe and efficient operation of your car. Bald tires not only make it more likely you’ll hydroplane or otherwise lose control of the vehicle, they also make your car burn more fuel to overcome their rolling resistance, lowering your vehicle’s fuel efficiency.Tire tread is measured in 32nds of an inch—new tires typically have a tread depth of 10/32” or 11/32”, and you should replace your tires when the tread is eroded to about 4/32” or less. You can track this easily with a quarter—find the most worn-down spot on your tire, slide an upside-down quarter into the tread. If you can see the top of Washington’s head, you should replace the tire. You can also use a penny to see if you can still see the top of Lincoln’s head, but this measures 2/32” of tire tread, which means you should replace the tire immediately. The quarter test warns you to replace your tire before it’s a dangerous situation.Prevent small window cracks from spreading with nail polishA cracked windshield is ugly, and even a tiny crack will probably spread, slowly but inexorably, until you have no choice but to replace the glass entirely. If you have a noticeable crack in your windshield, you should replace it—but if that’s not possible right away, there’s a short-term hack you can use: Nail polish.This isn’t a permanent repair, but it will buy you some time by slowing down the crack’s spread. Clean the damaged area thoroughly, then coat the exterior and interior of the cracked area with clear nail polish. Let it dry, and go about your business. You'll still eventually need to replace the windshield (or have a more permanent repair job done to it), but this hack will let you plan for the work instead of having to deal with it as an emergency.Stop stuff from falling between the seats with pipe insulationHave you ever lost your keys, phone, or anything else between the seats in your car? If so, you know it’s like Mission: Impossible to reclaim your property. Those spaces were just not designed for human beings to get into.An easy hack to prevent the situation from happening in the first place is to close off those gaps (this also prevents crumbs and other dirt from filling those spaces). Pipe insulation is the perfect material for this: Cut a piece to length and jam it between the seats (or the seats and the console), and never lose anything ever again. In a pinch, the ever-useful pool noodle could be used as well. Alternatively, you can buy storage organizers designed to fit in those gaps, which solve the problem while giving you some extra space for stuff.Use a plunger to fix minor dentsA dent in your car is annoying—and potentially expensive to fix. For minor cosmetic dents, you don’t need any special tools or professional help. All you need is a heat source and a common bathroom plunger.For the heat source, you can boil some water, pour it over the dent, then use the plunger to pull the dent out. You can also use a heat gun or a hair dryer, though the water might help the plunger get a nice seal on the car body.\n            \n                What do you think so far?\n            \n        \nPut socks on your wiper bladesNothing’s more fun than fighting your way through frigid cold to your car, only to discover that the wiper blades have frozen to your windshield. Sure, your car will eventually heat up enough to free the wipers, but if you’d prefer not to have to wait for that miracle to happen, keep an old pair of tube socks in the glove compartment. On cold nights when frozen wipers are a good probability, cover your wiper blades with the socks. This will protect them from damage as well as prevent them from freezing onto your windshield.Try to always turn right to save money on gasThis is one of those amazing tricks that people have difficulty believing, but it actually works: To save money on gas, always make right turns unless a left turn is absolutely necessary—yes, even if that makes your trip longer.UPS put this policy into its vehicle routing software, instructing their drivers to avoid left turns as much as algorithmically possible, and it claims to use about 10 million fewer gallons of gas every year as a result. In fact, our greatest repository of scientific knowledge, Mythbusters, once did a segment proving that they used about 3% less fuel by avoiding as many left turns as possible while driving a fake delivery truck.Note, this doesn’t mean never making a left turn. It means prioritizing right turns when planning your route, even if it makes your trip longer. Whether the extra time involved is worth saving a little gas money is a whole other decision.Use hand sanitizer on frozen locksAnother annoyance on cold winter mornings? Frozen car locks and doors. While most newer cars have keyless entry these days, you can still find yourself dealing with a frozen door, and if your battery has died due to the cold, you might need to use a physical key to gain entry to the car. When that happens, a simple hack is to whip out the hand sanitizer you probably have in your coat pocket. Squirt some into the lock (or coat your physical key before you insert it) or around the edge of the door. After a few seconds, the alcohol in the sanitizer will have melted the ice and you’ll be able to easily open everything up.Get a glovebox organizer to maximize your storage spaceNo one has used a car’s glovebox to store gloves in a long time. What most of us do is jam things in there on the theory that we might need them someday, then forget what’s in there and go a decade or two without actually opening it.Instead, hack that space with an organizer. You can find some molded plastic organizers designed to fit specific models (like this one for a Toyota Tacoma, or this one for Tesla Model 3s), or you can find wallet-style organizers that will keep your documentation and other items neatly stored, making the glove box actually useful for a change.\n            \n    \n    \n        Smarter Home & Living Newsletter\n            Never miss a story\n        \n        \n            Lindsey Ellefson\n            \n        \n        Get the latest smart home news, trends, and advice from Lindsey and the team.\n    \n    \n        Smarter Home & Living Newsletter\n            Never miss a story. Get the latest smart home news, trends, and advice from Lindsey and the team.\n        \n    \n\n                        \n                \n            \n                    \n                                            \n                \n            \n                Jeff Somers\n                                \n                                            Jeff Somers is a freelancer who has been writing about writing, books, personal finance, and home maintenance since 2012.\n                                    \n                Read Jeff's full bio\n                            \n        \n                \n                                            \n    More by Jeff\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 Hacks Every Car Owner Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCPRBQJ27YHJAACCP2TPGW76/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-17T20:30:41.000Z",
      "dateModified": "2025-12-17T20:30:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yep, Apple Music and Apple TV Are Down",
    "url": "https://lifehacker.com/tech/apple-music-and-apple-tv-are-down?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC51TK4KGMVS7CCNEJNV6HQQ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-10T21:36:56.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Matthew Nichols1/Shutterstock\n                            \n           ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Matthew Nichols1/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple is reporting that Apple Music, Apple TV, and Game Center are experiencing outages.\n                                            The outages appear to have started at 2:53 p.m. ET for all affected services.\n                                            The report says that \"some users are affected,\" so these services might not be down on your end.\n                                    \n            \n    Table of Contents\n    \n        \n        If you picked up your iPhone to round out your Apple Music Replay for the year, or turned on your TV to watch a show like Pluribus, you might have noticed something odd: Neither service is working. It's not just you: Apple Music, Apple TV, and Game Center are currently down. That's directly from Apple's \"System Status\" website, which tracks all of Apple's web-based services and identifies which ones may be experiencing problems. While most of Apple's services, like the App Store, Find My, and iMessage, are all \"Available,\" four of these services are experiencing an outage: Apple Music, Apple TV, Apple TV Channels, and Game Center.   If you click on each, you can see the service's full status report:\nApple Music - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Apple TV Channels - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Apple TV - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Game Center - 1 Outage, 1 Resolved IssueOutage: Today, 2:53 PM - ongoingSome users are affectedUsers may be experiencing a problem with this service. Resolved Issue: Today, 8:43 AM - 9:14 AMSome users were affectedUsers may have experienced a problem with this service.It's not clear what is causing the outages, though they all went down at 2:53 p.m.. (Apple doesn't specify, but I imagine that's ET.) This isn't the first time this has happened, of course. In fact, Apple Music was down earlier this year, though it was actually still working for me when Apple said the outage was active. \n            \n                What do you think so far?\n            \n        \nThat appears to be the situation today, as well. Each report says \"some users are affected,\" not all. As it happens, Apple Music is working on my Mac, and I'm able to stream the free pilot episode of Pluribus without issue. Apple will likely get these services back up and running for affected users. In the meantime, if your Apple Music or Apple TV won't cooperate, this is likely the cause. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yep, Apple Music and Apple TV Are Down",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC51TK4KGMVS7CCNEJNV6HQQ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-10T21:36:56.000Z",
      "dateModified": "2025-12-10T21:36:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Set Up Your Own Custom Focus Modes on iPhone",
    "url": "https://lifehacker.com/tech/how-to-set-up-custom-focus-modes-iphone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCH4MEZ2PD03NDC0ZXMK9CA5/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-15T18:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    \n        \n        The iPhone's Focus modes are perhaps its most underrated feature. Once customized, they can become incredibly powerful tools that put you in control of how your iPhone can grab your attention. They can take some time to set up, but it’s worth it. Once you've got everything squared away, you'll have timed boundaries from certain apps, people, and even your work, for that mythical work-life balance. Forget having a personal phone and a work phone—a couple of well-tuned Focus modes might be enough.Diving into Focus modes\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nWhat used to be Do Not Disturb on iPhone is now Focus mode, which comes with many more options. Open the Control Center and tap the Focus button to see a list of all available Focus modes. The familiar Do Not Disturb option will be up top, but you’ll also see helpful Focus modes premade by Apple, Sleep being a prominent example. If you have a device that supports Apple Intelligence, you’ll also see a mode called Reduce Interruptions, which automatically mutes all notifications except the really important ones. Other premade modes include Personal, Work, and Sleep, which you can all customize to your own liking.To get the most out of Focus Modes, you should set some Focus modes for yourself. One for work and one for personal time would be a great place to start. Go to Settings > Focus and tap the Plus button at the top. Here, choose the Custom mode option to get the most flexibility. Give it a name, icon, and tap Next. Then, tap Customize Focus.\n\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThis is where you'll do most of your work. First, tap Choose People and select if you want to allow notifications from only a couple of people, or if you want to silence notifications from particular folks. If you’re setting up a Focus mode for personal time, you might want to stop notifications only from your boss and colleagues. Choose the people to allow, and tap Next. Then, choose who is allowed to call you. You can limit it to just your Favorites, or only a handful of people.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThen, tap Choose Apps and follow the same process for apps as well, either allowing notifications from some apps, or only silencing notifications from particular apps. For example, if you’re setting up a Focus mode for personal time, you might want to disable notifications from work apps like Slack, Teams, Gmail, and more. Tap into the Options menu, and you can also choose to show silenced notifications on the Lock Screen, or to dim the lock screen every time that Focus mode is enabled.Next, take some time to customize what you see when a Focus mode is enabled. Apple will let you choose a distinct Lock screen, Home screen and even an Apple Watch watch face per Focus mode. For example, your work Focus can feature just your calendar and to do list. This will go a long way towards cementing the Focus state in your mind. For example, when I’m in my Writing Focus mode, my home screen is devoid of everything, including my tasks widget and communication apps.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThen, you’ll see a Set a Schedule section. Here, you can turn on a Smart Activation feature that will automatically enable a Focus mode depending on your location, app usage and so on. This has been hit or miss for me, so I would advise you to avoid it for the most reliable results. But you can definitely create a manual schedule using the Add Schedule button. Here, You can trigger a Focus mode to automatically start or stop at a certain time of day.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nYou can even use Focus Filters to further customize exactly what apps can show you when you’re in a Focus mode. For example, you can choose to only see your work calendar when you’re in your work Focus, but not your other calendars. These filters work for Apple’s apps and even third-party apps.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nLastly, you can choose to enable the Intelligent Breakthrough & Silencing feature that's found at the top of the Focus page. If you have an iPhone with Apple Intelligence enabled, you'll see this setting. It uses on-device intelligence to allow priority notifications to interrupt you even when you're in silent mode. This goes over all other customizations that you might've done. But, being an Apple Intelligence feature, its reliability can be a bit iffy. Based on personal experience, I would recommend you take the time to fully customize the Focus mode to your liking instead of handing some of that work over to Apple Intelligence, as it gets things wrong for me fairly often. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Set Up Your Own Custom Focus Modes on iPhone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCH4MEZ2PD03NDC0ZXMK9CA5/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-15T18:00:00.000Z",
      "dateModified": "2025-12-15T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Sonos Ace Headphones Are $120 Off Right Now",
    "url": "https://lifehacker.com/tech/sonos-ace-headphones-sale?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JSYMDW38TWQ2NQC0BKPWRDT4/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-12T21:30:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Zain Awais and product image courtesy of Amazon. \n                            \n    Table of Contents\n    \n        \n        You've probably heard of Sonos smart speakers and soundbars, which offer some of the best audio quality in the market. What you may not know, however, is that Sonos also makes the excellent Sonos Ace headphones, which were released last summer. Right now, they're on sale for $279 (originally $449), the lowest price they've ever been, according to price-tracking tools.\nThe Sonos Ace are soft, comfortable, and adaptable to different head sizes, thanks to their plastic design. You get actual buttons to control the headphones (as opposed to touch controls), which I personally consider a huge plus. The battery life is impressive, with about 30 hours with either the Active Noise Cancellation (ANC) or Aware Mode settings active, or about 40 hours with both of those off. The Bluetooth multipoint connectivity means you can connect up to two devices at once and switch seamlessly between them. The headphones perform well, according to PCMag's \"excellent\" review. The sound is balanced with an EQ adjuster in the app, and the ANC and Aware Mode are top-tier, competing with the best headphones on the market. Unfortunately, the Sonos Ace aren't wifi-enabled, meaning you can't stream media into them like you can with Sonos speakers, but then again, not many headphones are. However, you can connect to Sonos speakers through Bluetooth and listen to your media that way (if you own Sonos speakers). \n            \n                What do you think so far?\n            \n        \nAt their current price, the Sonos Ace are competitive with the best headphones for Apple users, the AirPods Max, and the best headphones for Android users, Sony's WH-1000XM6, and arguably offer a better value since they're much cheaper. If you care about transparency mode or have Sonos speakers at home, the Sonos Ace headphones are your best choice. \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Sonos Ace Headphones Are $120 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01JSYMDW38TWQ2NQC0BKPWRDT4/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-12T21:30:00.000Z",
      "dateModified": "2025-12-12T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "That PayPal 'Automatic Payment Status' Email Is a Scam",
    "url": "https://lifehacker.com/money/that-paypal-automatic-payment-email-is-a-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCPN6ZMFN6T43WKC8MY26QFR/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-17T18:00:55.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n      ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            Scammers are circulating fraudulent PayPal payment notifications.\n                                            The emails originate from a legitimate PayPal address, making them seem convincing.\n                                            Don't engage directly with messages about transactions or account security.\n                                    \n            \n    Table of Contents\n    \n        \n        Another PayPal phishing scam is circulating, this time with email notifications about recurring or automatic payments. The messages originate from a legitimate PayPal address, allowing them to evade some security filters and leave recipients worried that their accounts have been compromised—perhaps just enough to ignore the obvious red flags and call or email scammers back. I personally have been targeted by this scam with at least five separate emails, though all have gone straight to my spam folder. Here's how scammers are exploiting PayPal settings to land in your inbox. How the PayPal scam worksIf you're targeted by this campaign, you may receive an email with the subject line \"Your automatic payment status has changed\" or \"Recurring Payment Reactivated.\" The layout imitates a real PayPal notification and includes a message about a high-dollar payment being \"successfully processed\" along with a customer service email and phone number to contact PayPal support. \nThe email is full of red flags: It is addressed to a random name (or, in one of the messages I received, \"Hello Update Invoice\"), has poor spelling and wonky formatting, and simply doesn't make sense. You can easily spot oddities like bold text and Unicode characters, which BleepingComputer notes is a trick used to bypass spam filters and keyword detection. \n    \n            \n            \n                                        Credit: Emily Long\n                    \n    \nWhere the trick lies is in the sender field, as the email comes from service[at]paypal[dot]com, a legitimate PayPal address, and paypal.com is in the signed-by field. As Malwarebytes Labs describes, this is likely an abuse of PayPal's subscription billing feature. If a merchant pauses a customer subscription, the user will receive an automatic email from PayPal notifying them that their payment is no longer active. Scammers are likely setting up fake subscriber accounts using Google Workspace mailing lists, so automatic emails being generated are sent to everyone on those lists. If you look at the \"To:\" field, you'll see that the message isn't actually addressed to your email. \n            \n                What do you think so far?\n            \n        \nExploiting these types of loopholes to make phishing emails seem legit is a common tactic, and I've covered several similar PayPal phishing campaigns already this year. According to a statement provided to BleepingComputer, PayPal is working on mitigating this specific flaw. Ignore PayPal payment notificationsIf one of these PayPal messages lands in your inbox, don't engage with it. Scammers frequently use emails, texts, and calls about account security and financial transactions to scare you into action, and the impersonation of trusted institutions is often pretty convincing. If you are concerned about activity on your PayPal account, go directly to the app or website and log in to view alerts and check transactions. Do not use contact information or click any links in the original notification, as this increases the chances of compromising your information or downloading malware to your device. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "That PayPal 'Automatic Payment Status' Email Is a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCPN6ZMFN6T43WKC8MY26QFR/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-17T18:00:55.000Z",
      "dateModified": "2025-12-17T18:00:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use the ‘Five Whys’ to Get to the Root of Your Productivity Problems",
    "url": "https://lifehacker.com/work/the-5-whys-productivity-technique?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HRSX4GR86K8D93GH7RJK8S71/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-11T13:30:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: KhunYing/Shutterstock\n                            \n    Table of Conten",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: KhunYing/Shutterstock\n                            \n    Table of Contents\n    \n        \n        Planning is a key part of staying productive, but it has to be done right. To succeed, you need to understand why previous attempts at planning didn’t pan out. Conducting a personal after-action review is one way to assess your work and determine how to be more efficient, but to truly understand what went wrong and prepare for the future, you need to dig deep. Try the “Five Whys” technique to get to the bottom of things. What is the “Five Whys” technique?You should know, first of all, that this is yet another productivity protocol that springs from Japan’s famed factory system, like the 5S and 3M techniques. With this one, once you identify a problem, you’re going to ask, “Why?” five times, which will ultimately reveal the true root cause of the issue—and what you need to focus on fixing. How to use “Five Whys” for problem solvingSome variations of the technique call on you to assemble a team for brainstorming before doing this, but if you’re assessing a personal issue, that part isn't necessary. Your “team” can be the people posting on forums about the problem, for instance, or a group chat with your friends. If the issue is a household one, chat with your family. This doesn’t have to be super formal, but if the problem is one related to work and you do have coworkers involved, bring them into the discussion. In some cases, there may be no team at all—but that doesn't mean you can't use the Five Whys.\nWhether you’re consulting a team or not, the real work begins when you define the problem. State it clearly and concisely. Ideally, write it down. Let's say the problem is you didn’t get the dining room clean in time for dinner, so everyone had to eat at the counter. Simplify that to, “I didn’t clean the dining room on time.”Next, ask, “Why?” Write down the answer—maybe it's “I had to take a phone call from work.” Ask, “Why?” Write down the answer and ask again. Then again, again, and again, until you’ve asked five times. So, your paper might look like this: I didn’t get the dining room clean > I had to take a phone call from work > I didn’t finish the reports my boss wanted > I didn’t have the data I needed from the sales department > The sales department was not aware of my deadline. \n            \n                What do you think so far?\n            \n        \nWhen you’re finished digging into the problem, you can see how the answer to the last “Why?” caused a domino effect that led to the original issue. Fixing these more granular problems will ultimately help prevent bigger ones. So, in this case, write down, “I will communicate deadlines and needs with other departments at work early on when working on a project.” The next time you have a project to do, when you’re planning out your to-dos around it, be sure to include, “Communicate with the sales department about the deadline for the data.” There are plenty of productivity and scheduling apps that call on you to break your larger tasks down into smaller ones, like ABCDE or turning your responsibilities into \"bites,\" and it's likely that the solution to your fifth Why will be something small enough to easily slot into one of those. Make sure you prioritize whatever that small step is, however. Use an approach like the MIT technique to prioritize your to-dos around their impact on your life. In this case, letting the sales team know about your deadline is a small task with a big impact, as it could have cleared the way for you to clean the dining room and enjoy a nice meal with your family. Bear in mind that root causes aren’t always evident after five rounds of “Why?” For instance, maybe it’s not your job to communicate your deadline to the sales department. Maybe the person who was supposed to do that messed up or the people on that team didn’t check their emails. In that case, overhauling your protocols at work might be the answer. The “Five Whys” aren’t concrete; they’re a way to change your thinking around problems so you can easily identify their root causes and address those. Once you get in the habit of asking why and working backward, you’ll be able to do this quickly and alter your future plans more efficiently. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use the ‘Five Whys’ to Get to the Root of Your Productivity Problems",
      "image": [
        "https://lifehacker.com/imagery/articles/01HRSX4GR86K8D93GH7RJK8S71/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-11T13:30:00.000Z",
      "dateModified": "2025-12-11T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Adapt This Japanese Productivity Model to Get More Done",
    "url": "https://lifehacker.com/work/3-ms-productivity-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HPPPW6XZEX7VNKPMFPQ9Z988/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-17T13:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: DimaBerlin/Shutterstock\n                            \n    Table of Cont",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: DimaBerlin/Shutterstock\n                            \n    Table of Contents\n    \n        \n        So many great productivity hacks come from the Japanese manufacturing industry. The 5S technique helps you keep your workspace clean so you can get more done, kaizen helps you improve the processes and workflow of your job, and kanban helps you schedule your tasks in the most efficient way. These are helpful even if you’re not working within the famed Toyota Production System; they’re adaptable to fit all kinds of work scenarios, which is similarly true for the 3 Ms that originated there, too. The 3 Ms are kinds of waste you should identify and eliminate to keep your work running smoothly. Once you learn how to identify and get rid of them, you can be even more productive, whether you're using kanban, kaizen, or anything else. What are the 3 Ms?Lean process thinking, or lean manufacturing, is a production method that seeks to save time within the production process. The 5S technique is en elemental part of lean thinking, as are the 3 Ms. They are \"muda,\" \"mura,\" and \"muri,\" and they all refer to kinds of wasteful practices that slow you down and keep you from being productive. By identifying and eliminating them, you can streamline everything you need to do. To get them to work in your daily life, you need to adapt them a little, but once you get in the habit of recognizing where things are getting held up and making the appropriate changes, you’ll be breezing through your work. \nIdentifying and eliminating the 3 MsHere’s what each of the three Ms is all about:Muda translates from Japanese to mean “futility” or “uselessness.” It’s anything that doesn’t add value to the work you’re doing and it comes in two forms: Type 1 is non-value-added activities in your process that are still necessary for your end result, like safety checks, which don’t give the producers of physical goods any kind of financial reward, but do have a benefit for customers and eliminate financial risk for producers. You can’t really avoid Type 1, but you should focus on identifying and eliminating Type 2: Activities that add no value to the process or the end result. Mura is any kind of unevenness in your operation. Anything that isn’t uniform, regular, or scheduled is mura. Too much mura will result in muda. For instance, if you’re working on a bunch of tasks for a project at your job and your coworker is only working on one or two, it’s actually wasteful because you’ll be waiting around on them to keep moving forward with yours. Muri is any overburden on a tool or person. It can result from mura, as in the example above, but can also spring from overutilization. For your purposes, think of it referring to you. When you’re overwhelmed and overworked or lack resources, you’re not as productive. That’s muri. To eliminate muda, identify which unnecessary steps you’re taking in your work. Familiarize yourself with kaizen here, as it’s a process designed to get you to work efficiently. If you find that you’re often doing unnecessary tasks that don’t have much value in the end, like changing the colors and fonts on a presentation deck that’s already completed or constantly tweaking your emails before sending, consider that you might be giving yourself too much time to do them. Parkinson’s Law says that the more time you have to do something, the longer you’ll draw it out and complicate it. Reduce the amount of time you give yourself to complete certain tasks so the pressure of getting it done helps you focus only on the elements that are absolutely necessary. \n            \n                What do you think so far?\n            \n        \nTo eliminate mura, start tracking the process of your work and identify what’s holding you up. Is it waiting on client emails? Is it waiting for a coworker to finish their section of a project? Is it spending too much time in meetings and not enough time actually working? Is it a bad scheduling technique on your end? It might take a few weeks of  diligent time tracking, but eventually, the pattern will emerge. If you’re spending too much time waiting on client emails, develop a system whereby you send emails with questions for the next day’s work during the afternoon, giving them time to respond by the time you need to do it, for instance. If it’s your own poor scheduling, start making better to-do lists using kanban or the 1-3-5 method, which reduces your daily tasks to just nine and has you focus on the most essential ones in order of importance. Finally, to eliminate muri, assess your own burden at work. If you’re missing deadlines, feeling overwhelmed, not being given the right amount of resources, or having too much piled on you, you need to streamline what you’re working on so you don’t completely burn out. Try using the ABCDE method to give a ranking to all of your responsibilities. The A tasks are the most important, followed by the B tasks, but you’ll feel less overwhelmed once you realize the C tasks are optional, D stands for delegate, and E stands for eliminate. Delegate tasks to someone else if you’re overburdened—and don’t do unnecessary ones at all. Some burdens, like meetings, are unavoidable, but when possible, schedule yourself at least one day a week where you have no meetings. Remember to take regular breaks to stay productive, utilizing a method like the time-tested Pomodoro technique. If that method isn't working for you, try the MIT—or most important thing—technique, which helps you reframe your perception of your to-dos around the impact they'll have, not the amount of resources they'll take. Playing around with different approaches is a little time-consuming and might seem like its own kind of waste, but it's necessary to find a system that works for you. Training yourself to recognize and eliminate these different kinds of waste will streamline your work, reduce your burden, and keep things running more smoothly so you can actually be productive, whether you’re building a Camry or a new investor spreadsheet. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Adapt This Japanese Productivity Model to Get More Done",
      "image": [
        "https://lifehacker.com/imagery/articles/01HPPPW6XZEX7VNKPMFPQ9Z988/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-17T13:00:00.000Z",
      "dateModified": "2025-12-17T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Two New iPhone Features Are Coming to iOS 26.3",
    "url": "https://lifehacker.com/tech/two-new-iphone-features-coming-to-ios-263?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCJ0NQQVZR915DPJW3KB0JTZ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-15T23:30:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images/Shutterstock\n                            \n            \n   ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple released the first beta for iOS 26.3 on Monday, just three days after shipping iOS 26.2 to all compatible iPhones.\n                                            The update introduces notification forwarding to third-party devices, including smartwatches.\n                                            It also adds a new way to transfer data from iPhone to Android. The company partnered with Google to develop this new process.\n                                    \n            \n    Table of Contents\n    \n        \n        Just three days after Apple released iOS 26.2 to iPhones everywhere, the company is back at it with a new update. iOS 26.3 is official, though only for beta testers. Those brave enough to install Apple's unfinished software on their devices won't find an update packed to the brim with new features and changes, but they will stumble upon two key new features. The thing is, we already knew both of them were on the way. This isn't the end all be all for the update, however: Since iOS 26.3 is so new, it's possible testers will discover additional features hidden within the update. In addition, Apple may add new changes in subsequent beta versions. I'll continue to update this article to reflect any new features that reveal themselves, but, until then, here are the two new features we know about.Notification forwardingBack in September, we learned that Apple was quietly working on some type of notification forwarding feature, but other than that basic functionality, the details were left to speculation. At the time, the common assumption was that Apple intended the feature to be used to forward notifications to third-party devices, specifically smartwatches, in an attempt to open up the platform to wearables other than the Apple Watch. This wouldn't be Apple's choice, of course—left to its own devices, the company would keep as many features locked to Apple devices as possible. Instead, the motivation would come from the EU, which has compelled Apple to make its platforms more cooperative with third-party devices. \nAfter three months, we are now getting our first official look at this feature. In this first iOS 26.3 beta, there is now a \"Notification Forwarding\" option in Notification settings. While the option isn't live at this time, Apple does have a description for how the feature works, saying that notifications can be forwarded to one device at a time. Importantly, the description says that when notifications are forwarded to another device, they will not appear on your Apple Watch. Is that limitation really necessary, Apple?\n    \n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \n\nTransfer to AndroidKnowledge of iOS 26.3's second feature is not quite so old. In fact, we only learned about it last week. As it happens, Apple is working directly with Google on an official way to make transferring between an iPhone and an Android device more seamless.\n            \n                What do you think so far?\n            \n        \nAs of last week, Google had already rolled out its first test of the feature to Android Canary, but it was nowhere to be found in Apple's betas. Now, we know what to expect: In iOS' \"Transfer or Reset iPhone\" settings, there is now a new \"Transfer to Android\" option. Here, iOS instructs you to place your iPhone near your Android device, where you can choose to pass along data like photos, messages, notes, and apps. However, it seems not all data will transfer: Health data, devices paired with Bluetooth, and \"protected items\" like locked notes will not come along with this transfer feature.  \n    \n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \n\nBeware of running betas on your iPhoneThis isn't the flashiest beta Apple has ever shipped, but it is possible to install right now. Both the developer and public betas are now available, which means anyone interested can enroll their device in Apple's beta program to give 26.3 a try.  However, know the risks before you do. Unfinished software could come with bugs and glitches that could impact your experience using your iPhone. If the software is particularly glitchy, you could lose data when downgrading back to iOS 26.2. If you do decide to install the beta, make a complete backup of your iPhone to a Mac or PC before you do. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Two New iPhone Features Are Coming to iOS 26.3",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCJ0NQQVZR915DPJW3KB0JTZ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-15T23:30:00.000Z",
      "dateModified": "2025-12-15T23:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Instagram Reels May Be Coming to Your TV",
    "url": "https://lifehacker.com/tech/instagram-reels-for-tv-app?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCM1VRWW6TRJC31YHZHR8XPS/hero-image.fill.size_1200x675.webp",
    "tag": "Life",
    "date": "2025-12-16T18:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Meta\n                            \n            \n                Key Tak",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Meta\n                            \n            \n                Key Takeaways\n                                            Amazon Fire TV devices in the US can now download an Instagram for TV app.\n                                            Meta says the app will expand to other devices in the future.\n                                            If you don't have an Amazon Fire TV device, try screen mirroring instead.\n                                    \n            \n    Table of Contents\n    \n        \n        As I write this, I'm coming off a lunch break that lasted a little too long because I couldn't stop watching YouTube Shorts on my TV. And if Instagram Reels are your own vertical video poison—and you own an Amazon Fire TV device—you can now do the same. Starting today, you can download the new Instagram for TV app to watch Reels on your big screen via a dedicated interface that should be way more natural than simply casting the mobile app from your phone.Currently exclusive to Amazon devices, the Instagram for TV app supports up to five accounts and comes with full functionality for searching for Reels and profiles, as well as liking Reels and browsing comments or reactions (although text posts and photo posts are not included). Unlike on the standard mobile feed, Amazon says \"Reels are organized into channels tuned to your interests,\" which you can see from a horizontal home screen. These channels are somewhat similar to the YouTube Shorts interface that's baked into the standard YouTube TV app, showing you a small selection of shorts you can choose from based on a thumbnail. Examples include \"For you\" and \"Popular with Friends,\" but you're also still able to swipe past any Reel to your heart's content, and let the algorithm take you for a ride. A post from Meta also says channels could include Reels tailored to a specific topics that match your interests, like \"sports highlights\" or \"hidden travel gems,\" although the company hasn't provided any screenshots or videos showing this off quite yet.According to Meta, the new app is currently \"an early test.\" It's starting with U.S.-based Amazon devices, and the company says it will \"expand to more devices and countries\" as it learns more (Amazon also says it's the \"first\" company to get the app, implying others will get their own versions in the future). \nWhat devices support Instagram for TV?Currently, the Instagram for TV app is available in the Amazon Appstore for what Amazon tells me is a broad range of Fire TV devices, including partner devices like the Panasonic W70B LED 4K TV. While a full list is not available at the moment, the company's blog post announcing the app mentions support for the following devices in particular:Fire TV Stick HDFire TV Stick 4K PlusFire TV Stick 4K Max (1st and 2nd Gen)Fire TV 2-SeriesFire TV 4-SeriesFire TV Omni QLED SeriesIn addition to adding channels to the Reels experience, Meta says that future updates may also add ways to use your phone as a remote, share feeds with friends, and explore \"a more intuitive way to channel surf.\"Instagram for TV leaves TikTok as the last major short form video platform without a dedicated TV app, although The Information reported earlier this Summer that TikTok is looking to catch up soon.\n            \n                What do you think so far?\n            \n        \nHow to watch Instagram Reels on any smart TV or streaming deviceWhile official Instagram for TV support is currently limited to Amazon devices, that doesn't mean you're out of luck if you don't have a Fire TV stick or display. To watch Instagram Reels on your TV without using the Instagram for TV app, open Instagram Reels on your phone and start browsing. Next, pull up your phone's quick settings menu by swiping down from the top-right corner. On iOS, search for the screen mirroring button (which looks like two overlapping screens), and on Android, search for a button that says something like \"Cast\" (it will vary depending on your device). Tap it to see any compatible wireless screen mirroring devices nearby, which will let you view the mobile Instagram app on a TV screen, and even send audio over with it. It's not foolproof—my LG OLED TV works with iOS Screen Mirroring but not Pixel casting—but it's worth a shot.Update 12/16/2025: Updated with comment from Amazon confirming that the Instagram for TV app is available for additional devices beyond those mentioned in the company's announcement post.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instagram Reels May Be Coming to Your TV",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCM1VRWW6TRJC31YHZHR8XPS/hero-image.fill.size_1200x675.webp"
      ],
      "datePublished": "2025-12-16T18:00:00.000Z",
      "dateModified": "2025-12-16T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]