[
  {
    "title": "You Can Use 'Circle to Search' to Identify Scams on Android",
    "url": "https://lifehacker.com/tech/circle-to-search-can-now-identify-scams-on-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC9SAFF9FGZWDBX4J2A5SMKB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-12T19:30:10.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Zooey Liao/Lifehacker/Get",
    "body": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            Circle to Search and Google Lens can now assess messages for scam red flags.\n                                            Circle the text or take a screenshot to scan for signs of fraud.\n                                            Google will provide recommendations for next steps.\n                                    \n            \n    Table of Contents\n    \n        \n        Android users are getting more tools to combat the seemingly endless stream of scam texts from bad actors looking to steal your data and your money. Circle to Search and Google Lens can now assess messages for scam red flags, and if possible fraud is detected, you'll get recommendations for what to do (or not do) next. Even if you think you know the telltale signs of a scam—a sense of urgency, a demand for money or personal information, a link to log in or pay—using these tools can confirm your suspicions, especially when you feel pressured to act. To activate Circle to Search, long press the home button or navigation bar on your device and circle the text you want to scan. Alternatively, you can take a screenshot, open Lens in the Google app (also available on iOS), and tap the screenshot. The feature works for text messages as well as communication on messaging apps and social media sites. Google says the capability is available \"when our systems have high confidence in the quality of the response.\" This is just the latest in the Google's suite of security features meant to protect against fraud. Pixel users have real-time, AI-powered scam detection, which identifies and alerts you to suspicious conversational patterns in Google Messages and Phone by Google. In-call protections for Android prevent you from taking certain actions, such as sideloading new apps and changing accessibility permission, on your device while on the phone with anyone not saved in your contacts. \n            \n                What do you think so far?\n            \n        \nEarlier this month, Google also expanded its in-call scam detection feature, meant to combat bank impersonation schemes, to U.S. users. If you are on a call with a number that's not in your contacts and try to open a participating financial app, you'll get a notification reminding you not to share information and a one-click option to stop screen-sharing and end the call. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Use 'Circle to Search' to Identify Scams on Android",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC9SAFF9FGZWDBX4J2A5SMKB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-12T19:30:10.000Z",
      "dateModified": "2025-12-12T19:30:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Your Android Can Now Share Live Video to 911",
    "url": "https://lifehacker.com/tech/your-android-can-share-live-video-to-911?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC87Y7A3B2PQDPHH536D5D8E/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-12T15:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Skrypnykov Dmytro/Shutter",
    "body": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Skrypnykov Dmytro/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Live video sharing is rolling out now to U.S. users, as well as those in parts of Germany and Mexico.\n                                            The service is available for Android phones running Android 8 and up.\n                                            You don't need to do anything to set up Emergency Live Video.\n                                    \n            \n    Table of Contents\n    \n        \n        If you find yourself in an emergency or crisis situation, the more information you can give first responders, the better. Android users can now share a live stream of their surroundings with 911, allowing emergency services to assess and provide guidance in real time while you wait for help to arrive onsite.Emergency services on AndroidYour Android already shares some information with first responders via Emergency Location Services (unless you disable this feature). This built-in tool sends an accurate location as well as contextual information, such as language settings, when you call or text an emergency number. Now, that includes live video from your device's camera. You don't need to do anything to set up Emergency Live Video. Once available in your area, responders can send a request during an emergency call or text to securely share your camera's live video. You'll see a prompt on your screen to start sharing with one tap. \nAccording to Google, Emergency Live Video is encrypted by default. Users can choose whether to share their video from the prompt as well as stop the share at any time by clicking the onscreen Stop sharing button. \n            \n                What do you think so far?\n            \n        \nLive video sharing is rolling out now to U.S. users, as well as those in parts of Germany and Mexico, on Android phones running Android 8 and up. Google says they are partnering with public safety organizations to expand the feature to more users. Other Android safety featuresEmergency Live Video is the latest in Google's suite of safety features designed to make help more accessible—more quickly—in an emergency. Pixel users in Australia, North America, and several dozen countries across Europe now have access to Satellite SOS, which allows you to call emergency services even without a cellular or wifi connection. Car Crash Detection contacts emergency services and shares your location in the event of severe crash, while Fall Detection and Loss of Pulse Detection will call for help based on Pixel Watch sensor data. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Your Android Can Now Share Live Video to 911",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC87Y7A3B2PQDPHH536D5D8E/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-12T15:30:00.000Z",
      "dateModified": "2025-12-12T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yep, Apple Music and Apple TV Are Down",
    "url": "https://lifehacker.com/tech/apple-music-and-apple-tv-are-down?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC51TK4KGMVS7CCNEJNV6HQQ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-10T21:36:56.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Matthew Nichols1/Shutters",
    "body": "\n        \n    \n                                        \n        \n        \n        December 10, 2025\n    \n            Credit: Matthew Nichols1/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple is reporting that Apple Music, Apple TV, and Game Center are experiencing outages.\n                                            The outages appear to have started at 2:53 p.m. ET for all affected services.\n                                            The report says that \"some users are affected,\" so these services might not be down on your end.\n                                    \n            \n    Table of Contents\n    \n        \n        If you picked up your iPhone to round out your Apple Music Replay for the year, or turned on your TV to watch a show like Pluribus, you might have noticed something odd: Neither service is working. It's not just you: Apple Music, Apple TV, and Game Center are currently down. That's directly from Apple's \"System Status\" website, which tracks all of Apple's web-based services and identifies which ones may be experiencing problems. While most of Apple's services, like the App Store, Find My, and iMessage, are all \"Available,\" four of these services are experiencing an outage: Apple Music, Apple TV, Apple TV Channels, and Game Center.   If you click on each, you can see the service's full status report:\nApple Music - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Apple TV Channels - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Apple TV - OutageToday, 2:53 PM - ongoingSome users are affectedUsers may be experiencing intermittent issues with this service.Game Center - 1 Outage, 1 Resolved IssueOutage: Today, 2:53 PM - ongoingSome users are affectedUsers may be experiencing a problem with this service. Resolved Issue: Today, 8:43 AM - 9:14 AMSome users were affectedUsers may have experienced a problem with this service.It's not clear what is causing the outages, though they all went down at 2:53 p.m.. (Apple doesn't specify, but I imagine that's ET.) This isn't the first time this has happened, of course. In fact, Apple Music was down earlier this year, though it was actually still working for me when Apple said the outage was active. \n            \n                What do you think so far?\n            \n        \nThat appears to be the situation today, as well. Each report says \"some users are affected,\" not all. As it happens, Apple Music is working on my Mac, and I'm able to stream the free pilot episode of Pluribus without issue. Apple will likely get these services back up and running for affected users. In the meantime, if your Apple Music or Apple TV won't cooperate, this is likely the cause. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yep, Apple Music and Apple TV Are Down",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC51TK4KGMVS7CCNEJNV6HQQ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-10T21:36:56.000Z",
      "dateModified": "2025-12-10T21:36:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Easily Find FSA Eligible Items on Amazon",
    "url": "https://lifehacker.com/money/you-can-spend-down-your-fsa-with-your-amazon-account?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JGC4BPF5GCYEVY4QFKTVBRGJ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-12T21:00:00.000Z",
    "description": "\n                                                    \n                    Use it or lose it, with the help of Amazon, Target, Walgreens, and more.\n   ",
    "body": "\n                                                    \n                    Use it or lose it, with the help of Amazon, Target, Walgreens, and more.\n            \n                        \n    \n                            \n        \n        \n        December 12, 2025\n            \n            \n                        Credit: daily_creativity / Shutterstock\n                            \n    \n        \n        Your flexible spending account (FSA) funds expire soon, and if you don't use them, you lose them. In fact, roughly half of FSA holders in recent years have ended up forfeiting funds to their employers, according to the nonprofit Employee Benefit Research Institute (EBRI).First, make sure to double-check with your employer about your FSA's Dec. 31 deadline, along with any potential rollover or grace period. After that, it's time to scan your medicine cabinet, make a list of anything you need to stock up on, and click \"add to cart.\" The FSA store is an obvious choice for making the most of your remaining funds, but you can also turn to your go-to retail giants. Amazon, Target, Walgreens, and more all offer a dedicated FSA/HSA Shop to help you find eligible items quickly.\nHow to shop FSA-eligible items on AmazonHere's how you can take advantage of Amazon's FSA-eligible items before the end of the year.1. Visit Amazon's FSA Store at amazon.com/fsa2. Look for the \"FSA/HSA Eligible\" label on product listings3. Use the FSA/HSA filter in search results4. Pay with your FSA debit card at checkout\n            \n                What do you think so far?\n            \n        \nSimilarly, Target has an FSA filter in their healthcare section, and pharmacies like CVS and Walgreens have dedicated online FSA shops.What to buy with your remaining FSA fundsMany over-the-counter medications and health items are FSA-eligible, including pain relievers, cold medicine, bandages, dental care products, menstrual products, and more. But did you realize you can also snag these kinds of goodies:First aid suppliesContact lenses and solutionsReading glassesFancy sunscreenBlood pressure monitorsEpsom saltMassage gunsPimple patchesAn Oura ringA WHOOP bandA $229.99 water dental flosserAgain, most FSA plans require you to spend funds by Dec. 31, though some offer grace periods. Check with your plan administrator for specific deadlines. Just make sure to save receipts for all FSA purchases in case you need to verify eligibility with your plan administrator after paying.However you choose to spend your FSA funds, don’t let that money go to waste. After all, this money already came out of your paycheck.\n            \n    \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n                        \n                \n            \n                    \n                                            \n                \n            \n                Meredith Dietz\n                                    Senior Staff Writer\n                                \n                                            Covering personal fitness tech, home gym equipment, and more.\n                                    \n                Read Meredith's full bio\n                            \n        \n                \n                                            \n    More by Meredith\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Easily Find FSA Eligible Items on Amazon",
      "image": [
        "https://lifehacker.com/imagery/articles/01JGC4BPF5GCYEVY4QFKTVBRGJ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-12T21:00:00.000Z",
      "dateModified": "2025-12-12T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Use Your MacBook's Display As a Ring Light",
    "url": "https://lifehacker.com/tech/macbook-update-edge-light-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCAADYAG0C2ZP6WS0CEA7K1E/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-15T14:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 15, 2025\n    \n            Credit: Apple\n                   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 15, 2025\n    \n            Credit: Apple\n                            \n    Table of Contents\n    \n        \n        Sometimes you need just a little bit more light during a video call, especially if you're in a dimly lit room. The latest macOS update (26.2) has a trick for this: you can use the edge of your screen as a ring light.The feature, which adds a rounded white rectangle to your screen, is called Edge Light. The rectangle takes up part of your screen but will become partially transparent if you move your mouse pointer into it, meaning you'll mostly be able to use your computer normally.You can use the feature by clicking the camera icon on the menu bar during a call and toggling on the Edge Light option. You can also adjust the brightness and the color of the edge light from here.\n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nI tried this in a well-lit room and didn't notice much of a difference, which makes sense. In a totally dark room, though, it proved extremely helpful. Here's how I looked without Edge Light:\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nAs you can see, I'm just barely lit by the laptop itself. Here's how I look with the feature turned on:\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nIt's a lot easier to make out my face, but whether that's a pro or a con is a matter of opinion. Try the feature out if you find yourself on a video call with the lights off. Note that it's only offered on devices with Apple Silicon.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Use Your MacBook's Display As a Ring Light",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCAADYAG0C2ZP6WS0CEA7K1E/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-15T14:00:00.000Z",
      "dateModified": "2025-12-15T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reading in Cars Makes Me Nauseous, but This App Helps",
    "url": "https://lifehacker.com/tech/motion-sickness-app-kinestop?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC7FNXVW0F2ARBX239E0AKH5/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-12T14:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Justin Pot\n              ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        I get really carsick if I try to read in a moving vehicle. And there's a reason for that: my eyes and my sense of movement are out of sync.At least, that's according to the CDC, which states that motion sickness, \"happens when the movement you see is different from what your inner ear senses.\" Your inner ear is a sack of fluid that moves when you do, giving you an innate sense of movement. If you're in a car and watching the horizon, your senses are aligned. But if you're looking at your phone, your senses are confusing each other. It's similar to the reason VR games make some people feel sick.The free Android app KineStop aims to help. The application overlays a transparent horizon, and a number of transparent dots, across your entire screen. The accelerometer on your phone is used to move these reference points as your phone moves, helping to reduce the conflict between your eyes and your inner ear. You can turn the feature on manually in the application or, if you prefer, you can set it up to turn on automatically when you're in a moving car.\nI tried it out, wondering if it would help with my carsickness, and it did—surprisingly well. Normally I can't read for more than a few minutes without feeling sick, but the KineStop app helped me do so for longer, without discomfort. I'm still not going to be able to read novels during a long road trip, mind you, but I can look up the next restaurant on a road trip without vomiting, and I call that a win.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nKineStop is totally free, though there's a $3.50 pro version that adds themed overlays, including one that makes it look like your phone is a half-empty beer. It's great to support a developer, but I also think the free version will work fine for most everyone.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reading in Cars Makes Me Nauseous, but This App Helps",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC7FNXVW0F2ARBX239E0AKH5/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-12T14:00:00.000Z",
      "dateModified": "2025-12-12T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Spot a Browser-in-the-Browser Phishing Attack",
    "url": "https://lifehacker.com/tech/how-to-spot-a-browser-in-the-browser-phishing-attack?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCFE7N2QW7K0JC63SYERRXGX/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-15T15:30:40.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 15, 2025\n    \n            Credit: TippaPatt / Shutterstock.",
    "body": "\n        \n    \n                                        \n        \n        \n        December 15, 2025\n    \n            Credit: TippaPatt / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Between the sheer number and the increasing sophistication of phishing campaigns, seeing should not automatically be believing when browsing online. One particularly sneaky scam is a browser-in-the-browser (BitB) attack, in which threat actors create a fake browser window that looks like a trusted single sign-on (SSO) login page within a real browser session. Because we use SSO to access many of our online accounts, we may not think twice before entering usernames and passwords on these spoofed pages. Cybercriminals are counting on this to steal user credentials.Rather than redirecting users to a spoofed website, threat actors running a BitB attack create a fake pop-up within the page you're already on (which may either be set up for the attack or compromised in some way). Using HTML, CSS, and JavaScript, they're able to design a login window that looks exactly like the real one, right down to the lock icon and URL in the pop-up's address bar. \nThese fake login windows typically appear in a seamless fashion, such as after a click or redirect you're expecting to lead to SSO. Obviously, entering your credentials hands them directly to the attackers, who can either use or sell them. Fraudulent pop-ups often imitates SSO such as Google, Apple, and Microsoft, though they may exploit any login portal. Earlier this year, researchers at Silent Push identified a BitB phishing campaign targeting Steam users, specifically those playing Counter-Strike 2. Gamers saw a fake browser pop-up window displaying the URL of the real Steam portal, making them more likely to enter their credentials without suspicion. The attackers also featured the likenesses of eSports team NAVI to lend credibility. Signs of a BitB scamBecause threat actors are able to so closely imitate trusted sign-on pages, including using the real domain in the address bar, a visual inspection may not be enough to catch the fraud. Instead, you need to interact with the window in some way. \n            \n                What do you think so far?\n            \n        \nIn many cases, a genuine SSO pop-up can be dragged around and away from the browser page it appears on top of, so you can first try to move it elsewhere on your screen. However, some SSO dialogs are static, so if you can't drag it, try to highlight the URL or click the padlock icon to show certificate details. If these elements are fake, you won't be able to interact with them at all because the window itself is just an image. This is also an excellent reason to use a secure password manager to fill your credentials instead of entering them manually. A password manager will work only on the legitimate domain. If it doesn't autofill, don't automatically override it—check to ensure the pop-up is real. You should also have a strong form of multi-factor authentication (MFA) enabled wherever possible, so even if your username and password are somehow compromised, attackers won't have the additional factor needed to actually access your account. Note that hackers can still phish some forms of authentication—physical keys along with biometrics and passkeys are the most secure options. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Spot a Browser-in-the-Browser Phishing Attack",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCFE7N2QW7K0JC63SYERRXGX/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-15T15:30:40.000Z",
      "dateModified": "2025-12-15T15:30:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Attackers Are Spreading Malware Through ChatGPT",
    "url": "https://lifehacker.com/tech/chatgpt-grok-tech-advice-malware?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCFHKGX7QDA7SPFPM73VFFVJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-15T16:00:00.000Z",
    "description": "\n        \n        You (hopefully) know by now that you can't take everything AI tells you at face value. Large language models (LLMs) sometimes provid",
    "body": "\n        \n        You (hopefully) know by now that you can't take everything AI tells you at face value. Large language models (LLMs) sometimes provide incorrect information, and threat actors are now using paid search ads on Google to spread conversations with ChatGPT and Grok that appear to provide tech support instructions but actually direct macOS users to install an infostealing malware on their devices. The campaign is a variation on the ClickFix attack, which often uses CAPTCHA prompts or fake error messages to trick targets into executing malicious commands. But in this case, the instructions are disguised as helpful troubleshooting guides on legitimate AI platforms. How attackers are using ChatGPT Kaspersky details a campaign specific to installing Atlas for macOS. If a user searches \"chatgpt atlas\" to find a guide, the first sponsored result is a link to chatgpt.com with the page title \"ChatGPT™ Atlas for macOS – Download ChatGPT Atlas for Mac.\" If you click through, you'll land on the official ChatGPT site and find a series of instructions for (supposedly) installing Atlas. \nHowever, the page is a copy of a conversation between an anonymous user and the AI—which can be shared publicly—that is actually a malware installation guide. The chat directs you to copy, paste, and execute a command in your Mac's Terminal and grant all permissions, which hands over access to the AMOS (Atomic macOS Stealer) infostealer.A further investigation from Huntress showed similarly poisoned results via both ChatGPT and Grok using more general troubleshooting queries like \"how to delete system data on Mac\" and \"clear disk space on macOS.\" \n            \n                What do you think so far?\n            \n        \nAMOS targets macOS, gaining root-level privileges and allowing attackers to execute commands, log keystrokes, and deliver additional payloads. BleepingComputer notes that the infostealer also targets cryptocurrency wallets, browser data (including cookies, saved passwords, and autofill data), macOS Keychain data, and files on the filesystem. Don't trust every command AI generatesIf you're troubleshooting a tech issue, carefully vet any instructions you find online. Threat actors often use sponsored search results as well as social media platforms to spread instructions that are actually ClickFix attacks. Never follow any guidance that you don't understand, and know that if it asks you to execute commands on your device using PowerShell or Terminal to \"fix\" a problem, there's a high likelihood that it's malicious—even if it comes from a search engine or LLM you've used and trusted in the past. Of course, you can potentially turn the attack around by asking ChatGPT (in a new conversation) if the instructions are safe to follow. According to Kaspersky, the AI will tell you that they aren't. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Attackers Are Spreading Malware Through ChatGPT",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCFHKGX7QDA7SPFPM73VFFVJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-15T16:00:00.000Z",
      "dateModified": "2025-12-15T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three Changes Coming to Your Apple Watch With watchOS 26.2",
    "url": "https://lifehacker.com/tech/apple-watchos-262-updates?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNMEX42ZBVNCHDQH53K9ACF/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-12T18:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: DenPhotos/Shutterstock\n  ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: DenPhotos/Shutterstock\n                            \n            \n                Key Takeaways\n                                            watchOS 26.2 is bringing three new features and changes to your Apple Watch.\n                                            Apple is updating Sleep Score, which should now be a bit more accurate when calculating your overall score.\n                                            The update also fixes an annoying Music glitch and introduces Enhanced Safety Alerts.\n                                    \n            \n    Table of Contents\n    \n        \n        watchOS 26 wasn't a huge update, but it did introduce some new features. You now have a Workout Buddy to help you exercise—though it'll only work if you have the right iPhone—and there's now a helpful gesture to dismiss your notifications. Apple is back at it today with updates across its Apple products, including the Apple Watch: watchOS 26.2 is a minor update, even compared to watchOS 26 proper, but there are still some key things to highlight here. In fact, there are three:Updates to Sleep ScorewatchOS 26 introduced Sleep Score, a feature that was sorely missing on the Apple Watch. Sleep Score analyzes a host of data collected while you slept, including sleep duration, the time you actually went to bed, and any wake-ups you might have had during the night, and gives you an overall score. The idea is to glance at the score and see how you slept that night, so you can either take steps to improve your sleep going forward, or know you're on the right track. The total score is out of 100: Duration gets you up to 50 points, bedtime gets up to 30, and sleep interruptions go up to 20.  watchOS 26.2 refines the feature, by adjusting the final Sleep Score metrics. The feature had a tendency to give you higher scores than you might have otherwise felt you earned: A mediocre night's sleep might have have scored \"High\" on your chart, which wouldn't have made much sense to you. \nGoing forward, the scoring is a bit more conservative. Here's what you can expect, and how the scores changed from the last update:Very Low: 0–40 (previously 0–29)Low: 41–60 (previously 30–49)OK: 61–80 (previously 50–69)High: 81–95 (previously 70–89)Very High: 96–100 (previously 90–100) You'll also noticed Apple changed the \"Excellent\" score to \"Very High,\" which keeps the naming a bit more consistent.\n            \n                What do you think so far?\n            \n        \nMusic app glitch fixIf you've been using the Music app on your Apple Watch, but have been struggling to get your songs to actually, you know, play, good news: Apple says in the release notes for watchOS 26.2 that there is now a fix for an issue where the Music app doesn't move to the next song.Enhanced Safety AlertsFinally, watchOS 26.2, along with other Apple updates, introduces Enhanced Safety Alerts. According to Apple, this feature will warn you about \"imminent threats,\" including floods, natural disasters, and other emergencies. The feature will also include data like maps and links to official safety advice. Apple has been positioning the Apple Watch to be an overall health and safety device, and this feature only seems to complement that. Recent Apple Watches have hypertension alerts, which can help you passively identify high blood pressure, while fall and crash protection can automatically call for help in emergencies when you can't reach the phone. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three Changes Coming to Your Apple Watch With watchOS 26.2",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNMEX42ZBVNCHDQH53K9ACF/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-12T18:30:00.000Z",
      "dateModified": "2025-12-12T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WhatsApp Is Now Rolling Out Missed Call Messages",
    "url": "https://lifehacker.com/tech/whatsapp-is-now-rolling-out-missed-call-messages?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC9NA6G1X2AW6KZZK4MK0YQB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-12T17:30:41.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Melnikov Dmitriy/Shutters",
    "body": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Melnikov Dmitriy/Shutterstock\n                            \n            \n                Key Takeaways\n                                            WhatsApp officially rolled out missed call messages on Thursday, after about four months of beta testing.\n                                            When someone misses your call, WhatsApp will prompt you to leave a voice or video message.\n                                            The app joins others like FaceTime that offer something similar to traditional voicemail.\n                                    \n            \n    Table of Contents\n    \n        \n        They say no one actually uses their phones for phone calls anymore. That's not really true, though maybe the \"Phone\" app does get underused. Instead, many of us have turned to chat apps for our calls. FaceTime, WhatsApp, Messenger—these apps are now our go-to choices for getting in immediate touch with friends and family. (Not that I'm complaining: The call quality is usually better, anyway.) But one thing the Phone app—and traditional phone calls—have on these chat apps is voicemail. For decades, when you called someone and they didn't answer, you could \"leave a message after the tone.\" That way, when the person saw they had a missed call, they didn't need to guess what you wanted to say. If it was important, they'd hear about it, and call you back. If it wasn't, they could choose to call back when it was convenient. Voicemail isn't dead: You can still leave these messages if you call someone the old fashioned way. But since many of us choose to use our chat apps of choice, we've largely lost this practice. It's been wholly replaced with text messages and voice notes: If they don't answer the call, you can simply text them what you wanted to talk about, or record a voice note to achieve a similar end.    \nSome chat apps are trying to bring voicemails back, however. The first major player on my radar was FaceTime: Back in 2023, Apple made it possible to leave video and audio messages for people whenever they didn't pick up a FaceTime call. It's a small but logical feature: Sure, there are other ways to leave a message. But it just makes sense given the history of phone calls to present the option as soon as someone misses your call. How WhatsApp voicemails workNow, WhatsApp is getting in on the feature. The company first started testing missed call messages in August, before rolling out the option in full on Thursday. Now, when you try calling someone in WhatsApp and they miss it, you have the option to leave either a video or an audio message—depending on what type of call you started.\n            \n                What do you think so far?\n            \n        \nAgain, these are functions you could initiate already in the app itself: You could simply record a video saying what you want to say, and send it to the recipient, or record an audio note letting them know to call you back. But this built-in option isn't only convenient, it establishes voice messages as a standard for missed WhatsApp calls.  Interestingly, WhatsApp says this new feature \"will make voicemails a thing of the past.\" As it see it, it's actually keeping them alive. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WhatsApp Is Now Rolling Out Missed Call Messages",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC9NA6G1X2AW6KZZK4MK0YQB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-12T17:30:41.000Z",
      "dateModified": "2025-12-12T17:30:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple's Latest iOS Update Includes a New Way to Receive Notifications",
    "url": "https://lifehacker.com/tech/apple-update-iphone-display-light-up-notification?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCPHAV34XXTFHZAF7ZZ81NJC/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-17T17:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 17, 2025\n    \n            Credit: DenPhotos/Shutterstock\n  ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 17, 2025\n    \n            Credit: DenPhotos/Shutterstock\n                            \n            \n                Key Takeaways\n                                            iOS 26.2 includes a new option that will temporarily brighten your display whenever you have a new alert.\n                                            For years, Apple has included the option to light up the iPhone's camera flash for new alerts.\n                                            You can now choose to have both the LED flash and the display light up whenever you have a new alert, or just one or the other.\n                                    \n            \n    Table of Contents\n    \n        \n        There are fewer and fewer hardware differences between iPhones and Androids as the years go on, but back in the day, that was far from the case. At one point, many major Android devices came with dedicated LEDs that would shine whenever you received a notification. It was a passive way to know whether you had something on your phone to attend to, without having to actually wake up the display and risk getting unnecessarily sucked into your device. iPhones have never had this specific feature, but Apple included a workaround for anyone interested in a similar experience. For years, you've been able to dive into Accessibility settings to turn your iPhone's LED flash into a notification light. Any time you received a text, app notification, or call, your camera flash would go off, ensuring you didn't miss an important update. This can be helpful both those who are hard of hearing, and who wouldn't be able to rely on audible alerts, or anyone who keeps their phone on silent, but would like a visual cue that they have a new notification. For the first time in years, Apple is updating its flash alerts feature. With iOS 26.2, which the company released on Friday, you now have the option to have your iPhone's display itself flash for new alerts. You can choose to make the display the only light that flashes, or to use the feature in tandem with the LED flash, which I think makes the most sense for people who like this option. That way, it won't matter whether your iPhone is face up or face down: You'll always see a light flash for new alerts one way or another. \nDisplay flash doesn't work like you might expect, especially if you've used LED flashes before. I thought my iPhone would flash a bright light on and off again a few times, mimicking how LED flash alerts works. Instead, when you get a new notification, the screen instantly increases the brightness for a few seconds, before lowering it again. It works—you're bound to notice your display jump in brightness if it isn't already maxed out—but it doesn't quite grab your attention as well as the LED flash. How to set up Flash for Alerts on iPhoneTo start, open the Settings app on your iPhone, then head to Accessibility. Scroll down to Hearing, then choose Audio & Visual. Scroll to the bottom of this page, then tap Flash for Alerts.\n            \n                What do you think so far?\n            \n        \nIf you're running an older version of iOS, you'll only have the option to enable \"LED Flash.\" However, those running iOS 26.2 and newer will also see an option for \"Screen.\" Choose that option if you want the display to flash for new alerts, or \"Both\" to have both lights enabled. You'll also find two choices that affect when these flash alerts go off, no matter which of the above options you pick. First, you can choose whether your iPhone will use flash alerts while locked. If you disable this option, you'll only see these light alerts when your iPhone is unlocked. Second, you can choose whether to use flash alerts in Silent Mode. I'd keep that setting enabled, since it seems most useful when your iPhone has no other way to alert you to new notifications. It's also important to note that using an Apple Watch can complicate this feature a bit, at least in my experience. While giving this option a test, I had trouble getting alerts to come through on my locked phone without first going to my watch. If you have an Apple Watch, and its notifications mirror your iPhone's, you'll get the most out of this feature when your iPhone is unlocked. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple's Latest iOS Update Includes a New Way to Receive Notifications",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCPHAV34XXTFHZAF7ZZ81NJC/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-17T17:00:00.000Z",
      "dateModified": "2025-12-17T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Set Up Your Own Custom Focus Modes on iPhone",
    "url": "https://lifehacker.com/tech/how-to-set-up-custom-focus-modes-iphone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCH4MEZ2PD03NDC0ZXMK9CA5/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-15T18:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 15, 2025\n    \n            Credit: Khamosh Pathak\n          ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 15, 2025\n    \n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    \n        \n        The iPhone's Focus modes are perhaps its most underrated feature. Once customized, they can become incredibly powerful tools that put you in control of how your iPhone can grab your attention. They can take some time to set up, but it’s worth it. Once you've got everything squared away, you'll have timed boundaries from certain apps, people, and even your work, for that mythical work-life balance. Forget having a personal phone and a work phone—a couple of well-tuned Focus modes might be enough.Diving into Focus modes\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nWhat used to be Do Not Disturb on iPhone is now Focus mode, which comes with many more options. Open the Control Center and tap the Focus button to see a list of all available Focus modes. The familiar Do Not Disturb option will be up top, but you’ll also see helpful Focus modes premade by Apple, Sleep being a prominent example. If you have a device that supports Apple Intelligence, you’ll also see a mode called Reduce Interruptions, which automatically mutes all notifications except the really important ones. Other premade modes include Personal, Work, and Sleep, which you can all customize to your own liking.To get the most out of Focus Modes, you should set some Focus modes for yourself. One for work and one for personal time would be a great place to start. Go to Settings > Focus and tap the Plus button at the top. Here, choose the Custom mode option to get the most flexibility. Give it a name, icon, and tap Next. Then, tap Customize Focus.\n\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThis is where you'll do most of your work. First, tap Choose People and select if you want to allow notifications from only a couple of people, or if you want to silence notifications from particular folks. If you’re setting up a Focus mode for personal time, you might want to stop notifications only from your boss and colleagues. Choose the people to allow, and tap Next. Then, choose who is allowed to call you. You can limit it to just your Favorites, or only a handful of people.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThen, tap Choose Apps and follow the same process for apps as well, either allowing notifications from some apps, or only silencing notifications from particular apps. For example, if you’re setting up a Focus mode for personal time, you might want to disable notifications from work apps like Slack, Teams, Gmail, and more. Tap into the Options menu, and you can also choose to show silenced notifications on the Lock Screen, or to dim the lock screen every time that Focus mode is enabled.Next, take some time to customize what you see when a Focus mode is enabled. Apple will let you choose a distinct Lock screen, Home screen and even an Apple Watch watch face per Focus mode. For example, your work Focus can feature just your calendar and to do list. This will go a long way towards cementing the Focus state in your mind. For example, when I’m in my Writing Focus mode, my home screen is devoid of everything, including my tasks widget and communication apps.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThen, you’ll see a Set a Schedule section. Here, you can turn on a Smart Activation feature that will automatically enable a Focus mode depending on your location, app usage and so on. This has been hit or miss for me, so I would advise you to avoid it for the most reliable results. But you can definitely create a manual schedule using the Add Schedule button. Here, You can trigger a Focus mode to automatically start or stop at a certain time of day.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nYou can even use Focus Filters to further customize exactly what apps can show you when you’re in a Focus mode. For example, you can choose to only see your work calendar when you’re in your work Focus, but not your other calendars. These filters work for Apple’s apps and even third-party apps.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nLastly, you can choose to enable the Intelligent Breakthrough & Silencing feature that's found at the top of the Focus page. If you have an iPhone with Apple Intelligence enabled, you'll see this setting. It uses on-device intelligence to allow priority notifications to interrupt you even when you're in silent mode. This goes over all other customizations that you might've done. But, being an Apple Intelligence feature, its reliability can be a bit iffy. Based on personal experience, I would recommend you take the time to fully customize the Focus mode to your liking instead of handing some of that work over to Apple Intelligence, as it gets things wrong for me fairly often. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Set Up Your Own Custom Focus Modes on iPhone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCH4MEZ2PD03NDC0ZXMK9CA5/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-15T18:00:00.000Z",
      "dateModified": "2025-12-15T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "If Some Photos Are Inexplicably Turning Red on Your iPhone, There's a Fix",
    "url": "https://lifehacker.com/tech/how-to-fix-photos-turning-red-on-your-iphone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCHMR17GGG310W2F5CAXYV28/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-15T20:00:33.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 15, 2025\n    \n            Credit: Matthew Nichols1/Shutters",
    "body": "\n        \n    \n                                        \n        \n        \n        December 15, 2025\n    \n            Credit: Matthew Nichols1/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Some users are noticing photos taken on Android devices turning red when zoomed in on iPhone.\n                                            It's not clear what is causing the issue, but it's always an Android image displayed in the iOS Photos app.\n                                            Luckily, there is a fix for any affected images.\n                                    \n            \n    Table of Contents\n    \n        \n        If you open a picture in the Photos app on your iPhone, and it inexplicably starts turning red, I wouldn't blame you for being a bit concerned. After all, that's not supposed to happen, and out of all the colors your photos could randomly fade into, red is among the creepiest. While you contemplate what angry and vengeful god you might have crossed recently, understand that this isn't necessarily a problem affecting all, or even most, iPhone users and their photos. In fact, it doesn't appear to be affecting photos taken on iPhones at all. Rather, the users reporting this issue see it when zooming in on photos taken on Android devices. It seems a new hue has been added to the iPhone/Android divide: green bubbles, red pictures.If this isn't happening on your own iPhone, you can see the issue play out in this Reddit post. User djenki0119 posted a screen recording of themself browsing photos on their iPhone that they had originally taken on a Samsung Galaxy S24. At first, the pictures appears totally normal. But once djenki0119 zooms in on each, it quickly turns a deep shade of red—almost as if you were looking at film developing in a dark room. This user has the same issue, only they took their photo on a Motorola Razr. \nAt this time, it's unclear what is actually causing the issue to occur. It usually doesn't matter what type of device took any particular image: Once it's in the Photos app, it should display normally. But there must be something about Android files that the iOS Photos app isn't reading correctly, at least when users zoom in on the image. As 9to5Mac highlights, it appears that something is adding a red filter to these images in the Photos app. Since this issue is only popping up recently, my guess is there's a bug within iOS 26, though there could be an issue with Android instead.\n            \n                What do you think so far?\n            \n        \nFor what it's worth, I wasn't able to replicate the problem with photos I sent from my Pixel 8 Pro over to my iPhone. But perhaps there is some strange combination of hardware and software that results in this tinting: Maybe a photo taken on a certain type of Android device running a specific version of Android turns red on a certain iPhone model running a specific version of iOS. How to undo a photo that turned red on iPhoneLuckily, you don't have to wait for Apple, Google, Samsung, or Motorola to issue a fix, depending on where the actual issue is coming from. To return your image to its proper color scheme, open it in the Photos app, tap \"Edit,\" then choose \"Revert.\" This restores the image to its original state, and removes the red filter that was unnecessarily overlayed on top of it.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "If Some Photos Are Inexplicably Turning Red on Your iPhone, There's a Fix",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCHMR17GGG310W2F5CAXYV28/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-15T20:00:33.000Z",
      "dateModified": "2025-12-15T20:00:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Will Now Let You Virtually Try on Clothes With Just a Selfie",
    "url": "https://lifehacker.com/tech/google-virtually-try-on-clothes-with-selfie?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC7MXWH4N3KCDYTMB9DBREC0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-11T22:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n            Credit: Google/YouTube\n          ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 11, 2025\n    \n            Credit: Google/YouTube\n                            \n            \n                Key Takeaways\n                                            Google's feature that lets you try on clothes virtually now works with just a selfie.\n                                            The feature uses Google's AI image model, Nano Banana, to generate a full-length avatar from your photo.\n                                            There are guardrails in place to stop people from using selfies of celebrities or children, but not of selfies of other people.\n                                    \n            \n    Table of Contents\n    \n        \n        The pace of AI technology is so rapid, it's tough to keep up with everything. At Google I/O back in May, Google rolled out an AI-powered shopping feature that let you virtually try on clothes you find online. All you needed to do was upload a full-length photo of yourself, and Google's AI would be to dress you up in whatever article of clothing you liked. I still can't decide whether the feature sounds useful, creepy, or a little bit of both.  Google's virtual try on feature only needs a selfie to workWhat I can say, however, is that the feature is getting a little creepier. On Thursday, Google announced an update to its virtual try on feature, that takes advantage of the company's new AI image model, Nano Banana. Now, you don't need a full-length photo of yourself: just a selfie. With solely a photo of your face, Nano Banana will generate a full-length avatar in your likeness, which you can use to virtually try on your clothes.I'm not exactly sure who this particular update is for: Maybe there are some of us out there who want to use this virtual try-on feature, but don't have a full-length photo of ourselves to share. Personally, I wouldn't really want to send Google my photo—selfie or otherwise—but I don't think I'd prefer to have Google infer what I look like from a photo of my face alone. I'd rather just send it the full photo, and give it something to actually work off of.  \nHere's the other issue: While Google asks you to only upload images of yourself, it doesn't stop you if you upload an image of someone else. Talk about creepy: You can upload someone else's selfie and see how they look in various clothes. There is a system in place to stop you from uploading certain selfies, like celebrities, children, or otherwise \"unsafe\" items, but if the system fails, this feature could be used maliciously. I feel like Google could get around this by verifying the selfie against your Google Account, since you need to be signed in to use the feature anyway. \n            \n                What do you think so far?\n            \n        \nHow to upload a selfie to Google's virtual try on featureIf you are interested in trying the feature out—and, subsequently, trying on virtual clothes with your AI-generated avatar—you can head over to Google's try on feature, sign into your Google Account, and upload your selfie. When it processes, you choose one of four avatars, each dressed in a different fit, to proceed. Once through, you can virtually try on any clothes you see in the feed. Again, I see the potential usefulness of a feature that lets you see what you might look like in a certain piece of clothing before buying it. But, at the same time, I think I'd rather just order the item and try it on in the comfort (and privacy) of my own home.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Will Now Let You Virtually Try on Clothes With Just a Selfie",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC7MXWH4N3KCDYTMB9DBREC0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-11T22:00:00.000Z",
      "dateModified": "2025-12-11T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Kid-Friendly Websites Put a Modern-Day Twist on 'the Quiet Game'",
    "url": "https://lifehacker.com/tech/websites-that-motivate-kids-to-stay-quiet?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC9YZ6HF088HJM1WFSY6HP2Y/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-12T22:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Justin Pot\n              ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 12, 2025\n    \n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        Whether you're a teacher, a parent, or just someone with a big family, you know how difficult it can be to keep a room full of kids quiet for any amount of time.One trick I've used is offering to time how long kids can stay quiet. For reasons I don't understand, kids love it when something is being timed. But that only work a few times at the most, so it's good to have as many other tricks on hand as possible. That's why I was fascinated to learn there are multiple websites that use the microphone on your laptop to motivate kids to be quiet. Some put children's curiosity to work, having animated characters show up if the group is quiet for long enough. Others combine animation with good old-fashioned timers.Here are a few you can check out—all of them are completely free and don't require anything more than your browser.\nSilent Forest: Animals emerge if the room is quiet\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nSilent Forest shows a simple animated forest with a volume indicator. Stay silent for a bit and a cat shows up. A bit longer and a bear shows up. Who else might join? There's only one way to find out. Make too much noise, though, and you'll scare the animals, meaning you have to start over if you ever want to see everyone. The idea is that the kids will be curious to see which animals will show up next and keep quiet—and, ideally, pressure each other into staying quiet.Bouncy Balls: Noise will disrupt the balls\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nBouncy Balls fills your screen with balls—options include colored balls, emojis, numbered balls, eyeballs, and even bubbles. The balls are constantly vibrating, threatening to explode with a bit of noise—which they do. There's a risk of this backfiring—it's sincerely very fun to see the balls bounce—which you can mitigate by enabling a shushing or beeping sound after any violation.\n            \n                What do you think so far?\n            \n        \nClassroom Zen: Don't interrupt Ruby or Milo\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nClassroom Zen offers a few different tools for keeping the room quiet. Two feature Ruby, a cartoon who is meditating in either the mountains or the desert. If the room gets too loud, her eyes will start opening—keep going and she'll ask the room to be quiet. Another features Milo, a three-eyed monster who is trying to sleep.The secret sauce here, though, is the timer at the top of the screen. This means you can tell the kids they need to be quiet for a certain amount of time and have a timer to enforce that.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Kid-Friendly Websites Put a Modern-Day Twist on 'the Quiet Game'",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC9YZ6HF088HJM1WFSY6HP2Y/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-12T22:30:00.000Z",
      "dateModified": "2025-12-12T22:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]