[
  {
    "title": "That Political 'Call to Action' Might Actually Be a Scam",
    "url": "https://lifehacker.com/tech/political-call-to-action-might-be-a-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG65AQZT1BGJW2MP7E11RTHY/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-06T19:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    No, SendGrid isn't adding a \"Support ICE\" link to your company's emails.\n            \n                        \n    \n                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        February 6, 2026\n            \n            \n                        Credit: Ian Moore/Lifehacker/Adobe Stock\n                            \n    \n        \n        I'm just a humble immigrant, but as a mere (legal!) guest in the U.S., I can't help but notice that the country is rather, shall we say, politically divided these days (sorry if pointing that out seems rude). It seems international scammers have also noticed—and are taking advantage in subtle ways.Recently, investor Fred Benenson blogged about a sophisticated phishing campaign targeting SendGrid users. Phishers sent emails claiming the company was going to add a large \"Support ICE\" button at the bottom of every outgoing email unless users opted out. The emails also featured a large blue button promising to help you disable the message, which, when clicked, naturally led to a fake version of SendGrid that would allow the scammers to steal login information.As scams go, it's not a bad play: Phishing emails work best when they induce a sense of panic—that way you're less likely to think critically about them, and just act. It's not hard to imagine this particular email being effective, given the political climate right now. Say you're running a fair trade coffee company—you wouldn't want a giant \"Support ICE\" button below your signature at this moment in history.But the trick didn't just target left-wing organizations: Variations on the theme claimed the company was going to add pro-LGBT+ and Black Lives Matter banners as well. The differing political messages aren't really the point of the scam, you see—the point is to get business owners to panic about projecting the \"wrong\" values so that they will click the link and give away their login information. Scammers rely on psychological tricks to rope in their victims, all of them designed to get you to stop thinking rationally. Exploiting America's political divide seems to be an excellent way to do that.Political phishing schemes are nothing newThis is just the latest example of a scam that uses politics as a tool. Back in 2020, a fake Black Lives Matter voting campaign spread malware by pretending to be from a county official looking for feedback on the then-exploding political movement. People on both side of the partisan divide ended up clicking through and getting infected.And then there are the campaigns where people pretend to be politicians and beg for donations: Back in 2024 Lifehacker reported on a rash of political donation scams that popped up during the presidential election cycle. That trend is still growing, according to Stacey Wood, a fraud expert writing for Psychology Today. \"What is especially challenging for consumers and voters is that legitimate campaign operatives use many of the same common persuasion techniques employed by scammers,\" she writes.\n            \n                What do you think so far?\n            \n        \nAll of which is to say that international scammers have equal access to American media outlets, are aware of our political divides, and are effective at using them to exploit your emotions in order to steal your money.How to spot a political phishing scamWhat can you do to protect yourself? First, be aware of the tricks that scammers use, and always approach your email inbox with skepticism. Before you click any link from an unfamiliar sender or in an unsolicited email, hover over it to see if it's going to a website that looks legit. Even better: Avoid clicking links altogether, and head to the website for a given service directly by typing it into your browser.Remember, it's easier to fall for a scam than you think, so it pays to be skeptical, especially when you encounter a call to action designed to get you to react in a panic.\n            \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n                        \n                \n            \n                    \n                                            \n                \n            \n                Justin Pot\n                                \n                                            Justin Pot is a freelance journalist who helps people get more out of technology.\n                                    \n                Read Justin's full bio\n                            \n        \n                \n                                            \n    More by Justin\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "That Political 'Call to Action' Might Actually Be a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG65AQZT1BGJW2MP7E11RTHY/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-06T19:00:00.000Z",
      "dateModified": "2026-02-06T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ring Just Ended Its Controversial Partnership With Flock Safety",
    "url": "https://lifehacker.com/tech/ring-ended-controversial-partnership-with-flock-safety?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHBR0KCJS1YGKPFR454NNA8B/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-13T15:12:40.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: CC Photo Labs/Shutterstock\n                            \n            \n                Key Takeaways\n                                            In a blog post on Friday, Ring announced the end of its partnership with Flock Safety.\n                                            The announcement follows backlash to Ring's \"Search Party\" Super Bowl ad, which critics have seen as a slippery slope to infringing user privacy.\n                                            Ring says that the Flock Safety integration never went through, so no Ring footage was ever sent to the organization.\n                                    \n            \n    Table of Contents\n    \n        \n        Ring isn't having the week it probably thought it would have. The Amazon-owned company aired an ad on Super Bowl Sunday for \"Search Party,\" its new feature that turns a neighborhood's collective Ring cameras into one network, with the goal of locating lost dogs. Viewers, however, saw this as a major privacy violation—it doesn't take much to imagine using this type of surveillance tech to locate people, not pets.The backlash wasn't just isolated to the ad, however. The controversy reignited criticisms of the company's partnership with Flock Safety, a security company that sells security cameras that track vehicles, notably for license plate recognition. But the partnership with Ring wasn't about tracking vehicles: Instead, Flock Safety's role was to make it easier for law enforcement agencies that use Flock Safety software to request Ring camera footage from users. Agencies could put in a request to an area where a crime supposedly took place, and Ring users would be notified about the request. They didn't have to agree to share footage, however. Law enforcement could already request footage from Ring users, through the platform's existing \"Community Requests\" feature. But this partnership would let agencies make these requests directly through Flock Safety's software. If a user submitted footage following a request, Ring said that data would be \"securely packaged\" by Flock Safety and share to the agency through FlockOS or Flock Nova.\nThat partnership is officially over. On Friday, Ring published a blog post announcing the end of its relationship with Flock Safety. The company said, after a review, the integration \"would require significantly more time and resources than anticipated.\" As such, both parties have agree to cancel the partnership. \n            \n                What do you think so far?\n            \n        \nImportantly, Ring says that since the integration never actually launched, no user footage was ever sent to Flock Safety—despite the company announcing the partnership four months ago. Social media influencers had spread the false claim that Flock Safety was seeding Ring footage directly to law enforcement agencies, such as ICE. While those claims are inaccurate, they were likely fueled by reporting from 404 Media that ICE has been able to access Flock Safety's data in its investigations. Had Ring's partnership with Flock Safety gone ahead, there would be legitimate cause to believe that agencies like ICE could tap into the footage Ring users had shared—even if those users were under the impression they were only sharing footage with local agencies to solve specific cases.  While privacy advocates will likely celebrate this news, the cancelled partnership has no effect on Community Requests. Law enforcement agencies will still be able to request footage from Ring users, and those users will still have a say in whether or not they send that footage. Ring sees the feature as an objective good, allowing users to voluntarily share footage that could help law enforcement solve important cases. In its announcement on Friday, Ring cited the December 2025 Brown University shooting, in which seven users shared 168 video clips with law enforcement. According to Ring, one of those videos assisted police in identifying the suspect's car, which, in turn, solved the case.    \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ring Just Ended Its Controversial Partnership With Flock Safety",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHBR0KCJS1YGKPFR454NNA8B/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-13T15:12:40.000Z",
      "dateModified": "2026-02-13T15:12:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple and Google Just Made It Easier to Switch Between iPhone and Android",
    "url": "https://lifehacker.com/tech/apple-and-google-just-made-it-easier-to-switch-between-iphone-and-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBZW51YD9RTK9TT6NWP3RZ28/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-12T19:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Mr.Mikla / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Apple and Google actually worked together on a method to make switching between iPhone and Android easier.\n                                            With iOS 26.3, iPhone users can access the tool to simplify the process of transferring data like photos, messages, contacts and more.\n                                            However, Apple says health data, devices paired with Bluetooth, and \"protected items\" cannot be transferred.\n                                    \n            \n    Table of Contents\n    \n        \n        When it's time to buy a new car, you don't necessarily need to stick with the one you had before. You don't lose your cloud-based photos by switching from Toyota to Subaru, nor will your friends yell at you for ruining the group chat by buying a Kia. That's not the case with smartphones: When you buy an iPhone, it's tough to switch away from it. The same goes for Android: While it's easy enough to switch within the Android ecosystem, such as between Pixel or Galaxy, moving from Android to iPhone can also be a pain. Tech companies tend to make it tempting to stick with their platform, and introduce friction when you try to leave. That, of course, is entirely business-based. Apple hasn't traditionally made it easy to move to Android, because, well, you might actually do it. It doesn't have to be this way, either. There's nothing inherent to smartphones that should make it so challenging to break out of any particular ecosystem. All it takes is some intentional design: If smartphones were made to be traded, you could migrate from one to another, without worrying about losing pictures, messages, or any other important data or processes. As it happens, that intentional design is here. Apple and Google actually worked together to make it easier to transfer data between iPhone and Androids, which makes switching between the two platforms more seamless. \nNews first broke about this partnership back in December, and, at that time, Google released some of this progress as part of the latest Android Canary, the company's earliest pre-release software. Shortly after, Apple released the first beta for iOS 26.3, which featured the transfer tool. Now, iOS 26.3 is here, and with it, an easier way to switch from iPhone to a device made by Google, Samsung, or any other Android OEM.   How to use the new iPhone-to-Android option in iOS 26.3The feature seems easy enough to use. Once you update your iPhone to iOS 26.3, you can head to Settings > General, then scroll down to \"Transfer or Reset iPhone.\" Tap this option, then choose \"Transfer to Android.\" Here, iOS will present a pop-up, telling you to place your iPhone next to your new Android device, where you can transfer photos, messages, and apps, among other data points. (That said, health data, devices paired with Bluetooth, and \"protected items\" cannot be transferred.)You'll need to make sure both devices are running the latest updates, are connected to wifi, and have Bluetooth enabled. However, Apple also says your Android device should be in the \"setup process,\" which means you likely won't be able to use this feature if your Android phone is already set up. From here, your iPhone will ask you to scan a QR code that should appear on your Android device. Alternatively, you'll be able to tap \"Other Options\" on your iPhone to enter the Session ID and Pairing Code that should appear on your Android.    \n            \n                What do you think so far?\n            \n        \nNow, you can choose the data you want to transfer, including photos, contacts, calendars, call history, and messages. Tap \"Continue\" once complete, then choose to transfer your eSIM, if applicable. (You'll need to double-click the side of your iPhone when prompted to complete the eSIM transfer.) This works in the other direction too, though Apple says you do still need to use the Move to iOS app on Android—at least until Google sets up a similar protocol on its end.  More flexibility from Apple and Google is better for everyone Apple and Google might not be motivated by charity, of course, as the EU has been cracking down on restrictive practices by tech companies in recent years. But while both companies may see this as a way to lose customers, it's also a way to gain them: Sure, some iPhone users may switch to Android if it's easier to do so, but some Android users may do the reverse for the same reasons.More choice is good for everyone—even if it doesn't guarantee exponential growth to shareholders.  \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple and Google Just Made It Easier to Switch Between iPhone and Android",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBZW51YD9RTK9TT6NWP3RZ28/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-12T19:30:00.000Z",
      "dateModified": "2026-02-12T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube Finally Released an App for the Apple Vision Pro",
    "url": "https://lifehacker.com/tech/youtube-app-for-apple-vision-pro?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH9SVASV7VEXA78TP418XENK/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-12T21:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Stephen Johnson\n                  ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Stephen Johnson\n                            \n        \n            Stephen Johnson\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceStephen Johnson is a senior staff writer at Lifehacker covering pop culture and technology, including the columns “The Out-of-Touch Adults’ Guide to Kid Culture” and “What People Are Getting Wrong This Week.”\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: YouTube\n                            \n            \n                Key Takeaways\n                                            A YouTube app is now available for Apple Vision Pro.\n                                            Users can stream every video on YouTube, even 8K video.\n                                            The standalone YouTube app was designed with Vision's spatial computing in mind.\n                                    \n            \n    Table of Contents\n    \n        \n        YouTube has finally come to Apple Vision Pro. YouTube for Vision OS is a free, standalone app that lets users log into their existing YouTube accounts through their Vision headsets and stream videos like they would expect to, including standard videos, 180° videos, 360° videos, and YouTube Shorts. Vision Pro M5 users can stream 8K videos, and premium YouTube members can download videos directly to their headsets, a must for long flights.  Google, YouTube's parent company, has apparently been working on the app for a while. In 2024, a spokesperson confirmed that a standalone Vision Pro app was \"on our roadmap,\" but until today, the only way Vision users could watch YouTube on their headsets was through the Safari web browser. The new YouTube app is designed to fit into Vision's spatial computing environments. \"Rather than just responding to different screen sizes, we needed something that responds to different spaces, volumes and use cases,\" YouTube's senior UX designer Brendan Polley told Apple. \"We built an entirely new design system that isolated core elements—comments, the play button, 'like' and 'dislike'—to fit any layout.\"\n            \n                What do you think so far?\n            \n        \nHaving downloaded the app, it works exactly as intended. If you're looking for something that demonstrates Vision Pro's immersive video capabilities, you should check out the just-released 360° videos from the Milano Cortina winter Olympics on NBC's channel. Immersive luge is terrifying! \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube Finally Released an App for the Apple Vision Pro",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH9SVASV7VEXA78TP418XENK/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-12T21:30:00.000Z",
      "dateModified": "2026-02-12T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft's February Patch Tuesday Update Fixes Six Zero-Day Exploits",
    "url": "https://lifehacker.com/tech/microsofts-february-patch-tuesday-update?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH5ESZQAD4AGMV8N9G6S3Y5P/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-11T17:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 11, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Daniel Chetroni / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            The latest \"Patch Tuesday\" fixes 58 vulnerabilities in total, six of which are zero-day flaws.\n                                            Three of the six actively exploited zero-days fixed in February are security feature bypass vulnerabilities.\n                                            Machines receive updates automatically, but you can check your settings to be sure.\n                                    \n            \n    Table of Contents\n    \n        \n        Microsoft's February security update is a big one. This latest \"Patch Tuesday\" fixes 58 vulnerabilities in total, six of which are zero-day flaws. As a reminder, a zero-day is a vulnerability that has been either actively exploited in the wild or publicly disclosed before an official fix is released by the developer. As BleepingComputer reports, security flaws were found in the following categories: 25 elevation-of-privilege vulnerabilities, five security feature bypass vulnerabilities, 12 remote code-execution vulnerabilities, six information disclosure vulnerabilities, three denial of service vulnerabilities, and seven spoofing vulnerabilities. Three of the elevation of privilege vulnerabilities and two of the information disclosure vulnerabilities are considered \"critical.\" (These numbers do not include the three Microsoft Edge vulnerabilities patched earlier in February.)Patch Tuesday updates are typically released around 10 am PT on the second Tuesday of every month, and your device should receive them automatically. BleepingComputer reports that this month's release also includes Secure Boot certificate updates for 2011 certificates that are expiring in June. \nSix zero-days patched in FebruaryThree of the six actively exploited zero-days fixed in February are security feature bypass vulnerabilities: CVE-2026-21510: This is a flaw the Windows Shell that allows an attacker to execute content without warning or gaining user consent, though the user does need to open a malicious link or shortcut file. CVE-2026-21513: This MSHTML Framework vulnerability allows an unauthorized attacker to bypass a security feature over a network. Microsoft has not released details on how this flaw was exploited. CVE-2026-21514: This vulnerability in Microsoft Word allows an attacker to bypasses OLE mitigations in Microsoft 365 and Microsoft Office once a user has opened a malicious Office file. All three of the above flaws have been attributed to Microsoft Threat Intelligence Center (MSTIC), Microsoft Security Response Center (MSRC), Office Product Group Security Team, and Google Threat Intelligence Group along with an anonymous researcher for CVE-2026-21510 and CVE-2026-21514.\n            \n                What do you think so far?\n            \n        \nTwo of the zero-days are elevation of privilege vulnerabilities. CVE-2026-21519 is a Desktop Windows Manager flaw that allows an attacker to gain SYSTEM privileges, while CVE-2026-21533 is a Windows Remote Desktop Services flaw that allows an attacker to elevate privileges locally. The former has been attributed to MSTIC and MSRC, while the latter was discovered by the Advanced Research Team at CrowdStrike.Finally, CVE-2026-21525 is a denial of service vulnerability in the Windows Remote Access Connection Manager that allows an unauthorized attacker to deny service locally. This flaw was discovered by the ACROS Security team with 0patch—it was reportedly found in a public malware repository in December 2025. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft's February Patch Tuesday Update Fixes Six Zero-Day Exploits",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH5ESZQAD4AGMV8N9G6S3Y5P/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-11T17:00:00.000Z",
      "dateModified": "2026-02-11T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Claude Has a Surprisingly Great Way to Add Multiple Appointments to Your Calendar at Once",
    "url": "https://lifehacker.com/tech/use-claude-create-ical-files?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH9WBZB32S8QG90GGBESCX4N/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-13T13:30:01.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Smith Collection/Gado / Contributor / Archive Photos via Getty Images\n                            \n    Table of Contents\n    \n        \n        I rely heavily on my digital calendar—as far as I'm concerned, if something isn't there, it doesn't exist. It's annoying, then, when someone hands me a piece of paper or even an email stating when multiple meetings are going to happen. I need to either manually add everything to my calendar—which is time consuming—or try to keep track of everything separately from my calendar.I've found a better way, though. As of this week, even the free version of Claude can create files for you, including iCal ones. These files are handy for quickly adding multiple appointments to the Apple, Google, and Microsoft calendar services.How Claude can create custom iCal files for youFor example, say you wanted every Olympic men's hockey game on your calendar (I'm Canadian—what else was I going to use as a demonstration?) All you need to do is take a screenshot of the schedule, upload that screenshot to Claude, and ask for it to create an iCal download using the information. I tried this and it worked perfectly.\nThe Olympics thing is just an example, though. Say you're at a conference and the staff gives you a paper schedule—you could take a photo, ask Claude for the iCal file, and add everything to your calendar at once.Note that you might need to inform Claude about time zones. In my example, the screenshot I had mentioned what time zone the events were happening in, and Claude worked it out. In other tests, I found I needed to mention any potential time zone complications before asking for the file.\n            \n                What do you think so far?\n            \n        \nHow to import Claude's iCal files to your calendarUsing these files on a Mac is easy: just open it and the Calendar app will ask you which calendar you want to add the appointments to. But it's also not hard on Google Calendar or Outlook.On Google Calendar, click the gear icon near the top-right corner, then click Settings and find the Import option in the left side bar. Click \"Select file from your computer\" and point it toward the file you downloaded from Claude.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThe steps for Microsoft Outlook are similar. In Outlook, click File, then Open & Export, then Import/Export, then select Import and iCalendar (.ics) or vCalendar (.vcs). Select which calendar you want to add the appointments to and you're done—the appointments will all show up.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Claude Has a Surprisingly Great Way to Add Multiple Appointments to Your Calendar at Once",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH9WBZB32S8QG90GGBESCX4N/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-13T13:30:01.000Z",
      "dateModified": "2026-02-13T13:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Aggressive Spyware Is Targeting Both Android and iOS Devices",
    "url": "https://lifehacker.com/tech/aggressive-spyware-targeting-android-ios-devices?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH6WXXANC515RHZS40RVFH01/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-11T19:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 11, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            A new spyware platform known as ZeroDayRAT is reportedly being sold on Telegram, complete with customer support and updates.\n                                            Once deployed, it allows everything from user profiling and location tracking to live surveillance and financial theft.\n                                            ZeroDayRAT can infect your device only if a malicious binary—an APK on Android or iOS payload—is downloaded and installed.\n                                    \n            \n    Table of Contents\n    \n        \n        Threat actors don't have to work that hard to obtain sophisticated malware to deploy against unsuspecting targets. A new spyware platform known as ZeroDayRAT is reportedly being sold on Telegram, complete with customer support and updates. According to mobile security company iVerify, this aggressive spyware grants full remote control over devices running Android 15 through 16 and iOS versions up to iOS 26. Once deployed, it allows everything from user profiling and location tracking to live surveillance and financial theft. What ZeroDayRAT can gather from your deviceThis spyware has wide-ranging capabilities that, according to iVerify, have traditionally been found on platforms sponsored by state actors. Here's a look at what ZeroDayRAT can do: \nCollect information about the device, such as model, OS, battery, country, lock status, SIM and carrier info, app usage, live activity, and SMS message previews. This allows threat actors to develop user profiles for further targeting.Pull GPS coordinates, capture notifications from apps and systems, and harvest account information, such as usernames and emails. Send SMS messages and receive verification codes to bypass two-factor authentication. Log keystrokes (including biometric unlocks, gestures, and app launches), access the camera and microphone, and screen record.  Log crypto wallet addresses and target banking and payment app credentials via overlay attacks. How to protect against spywareZeroDayRAT can infect your device only if a malicious binary—an APK on Android or iOS payload—is downloaded and installed. These may be distributed through phishing, such as links sent via emails, texts, or messaging platforms, as well as in fake app stores. \n            \n                What do you think so far?\n            \n        \nAll standard guidance for avoiding scams and malware applies: never click links in unsolicited communication, including conversations in apps like Telegram and WhatsApp, and only download apps and extensions from official, trusted sources. Users at high risk of being targeted and anyone who wants an extra layer of security can consider enabling Lockdown Mode (iOS) or Advanced Protection (Android). \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Aggressive Spyware Is Targeting Both Android and iOS Devices",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH6WXXANC515RHZS40RVFH01/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-11T19:00:00.000Z",
      "dateModified": "2026-02-11T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple Just Patched Its First Zero-Day Security Vulnerability of 2026",
    "url": "https://lifehacker.com/tech/apple-just-patched-its-first-zero-day-security-vulnerability-of-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH9B1B0Q2NK5PAYNYW5KKY8R/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-12T18:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple just released a whole host of security patches, including a fix for an actively exploited zero-day affecting iOS 26 and iPadOS 26.\n                                            The flaw could allow attackers with memory write capability to execute arbitrary code.\n                                            You can confirm that you're on the latest OS version under Settings > General > Software Update.\n                                    \n            \n    Table of Contents\n    \n        \n        It's once again time to update your Apple devices. The company just released a whole host of security patches, including a fix for an actively exploited zero-day affecting iOS 26, iPadOS 26, and macOS Tahoe. These updates arrived alongside the official release of iOS 26.3, which includes features like more seamless data transfer between iPhone and Android. Other security patches address bugs in Photos, VoiceOver, and Screenshots, to name a few.  iOS 26.3 patches a zero-day affecting dyldAccording to Apple's latest security bulletin, the zero-day—tracked as CVE-2026-20700—is a memory corruption issue in dyld, Apple's \"Dynamic Link Editor.\" The flaw could allow attackers with memory write capability to execute arbitrary code—or, in other words, run their own code on your device.Apple says that the vulnerability may have been exploited in an \"extremely sophisticated attack against specific targeted individuals\" in earlier versions of iOS alongside CVE-2025-14174 and CVE-2025-43529. Those at greatest risk with this bug are likely high-profile users with access to sensitive data—users who might be inclined to use Apple's Lockdown Mode—but everyone should install the update to patch the issue. \nThe patch for this flaw is available for the following iOS and iPadOS devices, in addition to all Macs that run macOS Tahoe:\n            \n                What do you think so far?\n            \n        \niPhone 11 and lateriPad Pro 12.9-inch 3rd generation and lateriPad Pro 11-inch 1st generation and lateriPad Air 3rd generation and lateriPad 8th generation and lateriPad mini 5th generation and laterHow to install the latest security update for iPhoneYou should have automatic updates enabled to ensure you receive critical security patches ASAP, but you can confirm that you're on the latest OS version under Settings > General > Software Update. As a reminder, Apple won't message you urging you to click links, download attachments, or install apps related to security updates. Always go through your device settings to receive official fixes. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple Just Patched Its First Zero-Day Security Vulnerability of 2026",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH9B1B0Q2NK5PAYNYW5KKY8R/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-12T18:00:00.000Z",
      "dateModified": "2026-02-12T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Malicious AI Assistants in Chrome Are Stealing User Credentials",
    "url": "https://lifehacker.com/tech/malicious-ai-assistants-google-chrome?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHC36S2FS26DJCSZWGYRZHGX/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-13T20:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            AI-powered browser extensions continue to be a popular vector for threat actors looking to harvest user information.\n                                            In the latest campaign—dubbed AiFrame—threat actors have pushed approximately 30 Chrome add-ons that impersonate well-known AI assistants.\n                                            Always vet extensions carefully—don't just rely on a familiar name like ChatGPT.\n                                    \n            \n    Table of Contents\n    \n        \n        AI-powered browser extensions continue to be a popular vector for threat actors looking to harvest user information. Researchers at security firm LayerX have analyzed multiple campaigns in recent months involving malicious browser extensions, including the widespread GhostPoster scheme targeting Chrome, Firefox, and Edge. In the latest one—dubbed AiFrame—threat actors have pushed approximately 30 Chrome add-ons that impersonate well-known AI assistants, including Claude, ChatGPT, Gemini, Grok, and \"AI Gmail.\" Collectively, these fakes have more than 300,000 installs. Fake Chrome extensions look like popular AI assistantsThe Chrome extensions identified as part of AiFrame look like legitimate AI tools commonly used for summarizing, chat, writing, and Gmail assistance. But once installed, they grant attackers wide-ranging remote access to the user's browser. Some of the capabilities observed include voice recognition, pixel tracking, and email content readability. Researchers note that extensions are broadly capable of harvesting data and monitoring user behavior. Though the extensions analyzed by LayerX used a variety of names and branding, all 30 were found to have the same internal structure, logic, permissions, and backend infrastructure. Instead of implementing functionality locally on the user's device, they render a full-screen iframe that loads remote content as the extension's interface. This allows attackers to push changes silently at any time without a requiring Chrome Web Store update. \nLayerX has a complete list of the names and extension IDs to refer to. Because threat actors use familiar and/or generic branding, such as \"Gemini AI Sidebar\" and \"ChatGPT Translate,\" you may not be able to identify fakes at first glance. If you have an AI assistant installed in Chrome, go to chrome://extensions, toggle on Developer mode in the top-right corner, and search for the ID below the extension name. Remove any malicious add-ons and reset passwords. \n            \n                What do you think so far?\n            \n        \nAs BleepingComputer reports, some of the malicious extensions have already been removed from the Chrome Web Store, but others remain. Several have received the \"Featured\" badge, adding to their legitimacy. Threat actors have also been able to quickly republish add-ons under new names using the existing infrastructure, so this campaign and others like it may persist. Always vet extensions carefully—don't just rely on a familiar name like ChatGPT—and note that even AI-powered add-ons from trusted sources can be highly invasive. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Malicious AI Assistants in Chrome Are Stealing User Credentials",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHC36S2FS26DJCSZWGYRZHGX/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-13T20:00:00.000Z",
      "dateModified": "2026-02-13T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI Actually Shut Down GPT-4o",
    "url": "https://lifehacker.com/tech/openai-actually-shut-down-gpt-4o?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHC6XAVZ3AGTFBN2NPVGZF02/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-13T20:15:41.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Matthew Nichols1\n                            \n            \n                Key Takeaways\n                                            OpenAI finally deprecated its GPT-4o model on Friday, two weeks after announcing the news.\n                                            The company tried to shut down the model in August, but brought it back following intense user backlash.\n                                            4o is at the center of lawsuits accusing ChatGPT of encouraging delusional thinking, including, in some cases, suicide.\n                                    \n            \n    Table of Contents\n    \n        \n        They actually did it. OpenAI officially deprecated GPT-4o on Friday, despite the model's particularly passionate fan base. This news shouldn't have been such a surprise. In fact, the company announced that Feb. 13 would mark the end of GPT-4o—as well as models like GPT-4.1, GPT-4.1 mini, and o4-mini—just over two weeks ago. However, whether you're one of the many who are attached to this model, or you simply know how dedicated 4o's user base is, you might be surprised OpenAI actually killed its most agreeable AI. This isn't the first time the company depreciated the model, either. OpenAI previously shut down GPT-4o back in August, to coincide with the release of GPT-5. Users quickly revolted against the company, some because they felt GPT-5 was a poor upgrade compared to 4o, while others legitimately mourned connections they had developed with the model. The backlash was so strong that OpenAI relented, and rereleased the models it had deprecated, including 4o.   If you're a casual ChatGPT user, you might just use the app as-is, and assume the newest version tends to be the best, and wonder what all the hullabaloo surrounding these models is all about. After all, whether it's GPT-4o, or GPT-5.2, the model spits out generations that read like AI, complete with flowery word choices, awkward similes, and constant affirmations. 4o, however, does tend to lean even more into affirmations than other models, which is what some users love about it. But critics accuse it of being too agreeable: 4o is at the center of lawsuits accusing ChatGPT of enabling delusional thinking, and, in some cases, helping users take their own lives. As TechCrunch highlights, 4o is OpenAI's highest-scoring model for sycophancy.   \nI'm not sure where 4o's most devoted fans go from here, nor do I know how OpenAI is prepared to deal with the presumed backlash to this deprecation. But I know it's not a good sign that so many people feel this attached to an AI model. \n            \n                What do you think so far?\n            \n        \nDisclosure: Ziff Davis, Mashable’s parent company, in April 2025 filed a lawsuit against OpenAI, alleging it infringed Ziff Davis copyrights in training and operating its AI systems.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI Actually Shut Down GPT-4o",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHC6XAVZ3AGTFBN2NPVGZF02/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-13T20:15:41.000Z",
      "dateModified": "2026-02-13T20:15:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Get Access to T-Mobile’s Free Live Translation Beta",
    "url": "https://lifehacker.com/tech/access-t-mobiles-free-live-translation-beta?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH6N41NQC10E1QB6PYD8M8K8/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-11T16:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 11, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: OleksSH / Shutterstick.com\n                            \n            \n                Key Takeaways\n                                            T-Mobile is adding server-side live translation to its 5G and 4G networks.\n                                            The feature will work across any cellular device connected to the network.\n                                            Access to live translation will be free during the beta, but might come with a paywall after the official release.\n                                    \n            \n    Table of Contents\n    \n        \n        Live translation is probably the most genuinely useful thing to come out of the AI boom, but if you want to use it during a phone call, you usually need to use a specific device or a separate app. T-Mobile is looking to change that. The carrier announced today that it will soon introduce live translation to all phones connected to its 5G or 4G networks, and to get in on the action, you're going to want to sign up for the beta now.According to a press release sent to journalists today, the new feature will kick in for you automatically once you're selected for it, no matter what phone app or device you use. All you'll need to do to access it is type in \"87\" on the keypad during a phone call. Which means that, yes, it will also be compatible with feature phones, aka classic-style flip phones with physical buttons. The device you use doesn't matter because all of the computing for the translation will happen on T-Mobile's end, rather than on your device. The downside is that you won't get to pick which AI model the translation uses, and T-Mobile hasn't yet to provide any indication of which one it will use. You'll also just have to trust T-Mobile's servers with any audio recorded from your conversation. T-Mobile spokesperson Mason Miller told Lifehacker's sister site PCMag via email that, \"[T-Mobile does] not save call recordings or transcripts,\" but the company will certainly ave to run your data through its servers at some point to make the feature work. By comparison, competing translation apps often rely on downloaded language packs and on-device models.\nStill, I see where T-Mobile is coming from with this offering: When live translation is limited to specific devices or apps, it vastly impacts its usability, since both callers need to have a compatible device for it to work. Processing translation over the cloud makes it more likely you'll be able to use it exactly when you need it—and as a bonus, only one caller will actually need to be on T-Mobile's 5G or 4G network to pull this trick off.While T-Mobile's press release focuses on 5G, the carrier confirmed availability for the feature on 4G to The Verge earlier today. The Verge also reports that, in addition to dialing 87, beta participants will eventually be able to trigger live translation by saying \"Hey T-Mobile\" instead.\n            \n                What do you think so far?\n            \n        \nWhen T-Mobile live translations will go liveTesting for T-Mobile's live translation will begin \"for selected users\" this spring, with more general availability planned for \"later this year.\" The feature will be free during the beta, although a surcharge might be added after it goes into wide release. \"We will share more on pricing and plan details closer to commercial launch,\" Miller told PCMag.To sign up for the beta and put your hat in the ring for selection, head over to t-mobile.com/benefits/live-translation.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Get Access to T-Mobile’s Free Live Translation Beta",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH6N41NQC10E1QB6PYD8M8K8/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-11T16:30:00.000Z",
      "dateModified": "2026-02-11T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Is Rolling Out Two New Ways to Remove Your Sensitive Data From Search",
    "url": "https://lifehacker.com/tech/google-is-rolling-out-two-ways-to-remove-sensitive-data-from-search?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH27C4ZZ1PTDF491RFHTWZ7P/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-10T14:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 10, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Galeh Nur Wihantara/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is rolling out two new tools to request to remove sensitive data from Search.\n                                            The first lets you tell Google to remove government ID numbers like driver's licenses, passports, and Social Security numbers from Search.\n                                            The second makes it easier to request the removal of non-consensual explicit images.\n                                            These tools won't remove this content from the internet, but Google can remove them from Search results.\n                                    \n            \n    Table of Contents\n    \n        \n        Google announced two new ways for users to remove their sensitive information from the web Tuesday morning—or, at least, remove that data from Google Search. The first lets users request that Google remove sensitive government ID information from Search, while the second gives users new tools to request the same for non-consensual explicit images. Google's \"Results about you\" tool is getting an update\n    \n            \n            \n                                        Credit: Google\n                    \n    \nFirst, Google is updating its existing \"Results about you\" tool, which helps users scour the internet for their personal information. Before today, this tool could already locate data points like your name, phone number, email addresses, and home addresses. Following the update, you can now find and request the deletion of search results containing highly sensitive information, including your driver's license, passport, or Social Security number.To launch this tool, click here. If you've never used \"Results about you\" before, you'll need to set it up to tell Google what to look out for. Once you do, you'll be able to add government ID numbers, such as your driver's license, passport, and Social Security number. If Google finds a match, the company will let you know. You can receive an alert from the Google app on your smartphone, which takes you to a summary of what data was found and where. From here, you can choose from \"Request to remove,\" or \"Mark as reviewed.\"  \nUnfortunately, this tool won't remove the data from the websites that are hosting it, but it will eventually remove the search results—sharply reducing the chance that someone will find your data on their own. Google says these changes will roll out in the U.S. over the \"coming days,\" while it is working on bringing them to other countries in the future.  \n            \n                What do you think so far?\n            \n        \nGoogle's simpler way to remove explicit images from Search\n    \n            \n            \n                                        Credit: Google\n                    \n    \nIn addition to these changes, Google is now rolling out a simpler tool for users to request the remove of non-consensual explicit images (NCEI) from Search. If you find such an image on Search, you can tap the three dots on that image, choose \"remove result,\" then \"it shows a sexual image of me.\" You'll have the choice to report whether the photo is real, or is artificially generated, as well, and you can report multiple images at once, if needed. Your requests will all appear in the Results about you hub, so you can track the progress of each.The tool lets you opt-in to an option that will filter additional explicit results in other searches. Google says it will also share links to \"emotional and legal support\" after you submit a request.  \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Is Rolling Out Two New Ways to Remove Your Sensitive Data From Search",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH27C4ZZ1PTDF491RFHTWZ7P/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-10T14:00:00.000Z",
      "dateModified": "2026-02-10T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Samsung Galaxy S25 FE Is $200 Off Right Now",
    "url": "https://lifehacker.com/tech/samsung-galaxy-s25-fe-sale-february-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH8QKF55CNTYD2G733H0GCV2/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-12T13:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n               ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Samsung’s fan editions are meant to give you most of the flagship experience without the flagship price—and the Samsung Galaxy S25 FE does just that. Right now, it’s down to $509.99 from $709.99; a price drop that, according to price tracking tools, marks its lowest price yet. That puts it well below the regular Galaxy S25 while keeping much of the same look and software. \nPCMag rated it “excellent,” and after looking at what it offers, that tracks. Its 6.7-inch AMOLED screen is big, bright, and responsive, with smooth 120Hz scrolling and enough brightness to hold its own in most settings, though you might catch some glare under direct sunlight.It includes Samsung’s full Galaxy AI feature set, the same tools found on its pricier siblings. In practice, that means features like live translation, AI photo editing, and writing help are all here. The battery’s a solid performer too, clocking in at 17 hours of video playback in PCMag’s testing. Charging’s fast enough at 45W wired, and you get wireless and reverse wireless charging (handy for earbuds) as well. On the connectivity side, it supports 5G, along with Wi‑Fi 6, Bluetooth 5.4, and NFC for contactless payments. You can use one physical SIM and one eSIM, or go fully digital with dual eSIMs.\n            \n                What do you think so far?\n            \n        \nThe camera setup sticks close to its more expensive siblings with a 50MP main sensor (with OIS), a 12MP ultra-wide, and an 8MP telephoto lens offering 3x zoom. Photos are sharp from the main lens, with Samsung’s typical slightly saturated colors, and the ultra-wide and telephoto lenses are good for social media, though fine detail reportedly falls off when you zoom or crop in. Audio is decent through the stereo speakers, but you’ll want Bluetooth headphones or earbuds for better sound. There’s no headphone jack or microSD card slot, and storage is capped at 256GB—but for the price, that’s not unreasonable. If you want to be in the Samsung ecosystem and try out its newest AI features without spending $800 or more, this is one of the better deals going right now.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n            Add to Cart NewsletterShop smarter, save more money.\n                    Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Samsung Galaxy S25 FE Is $200 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH8QKF55CNTYD2G733H0GCV2/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-12T13:30:00.000Z",
      "dateModified": "2026-02-12T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Telegram App Has a New Look, and a Weird New Feature",
    "url": "https://lifehacker.com/tech/telegram-has-a-new-look-and-some-new-features?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH7A5JFYZZTP9BVTRZ5KRK3A/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-11T22:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 11, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Ascannio/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Telegram announced some new changes and features to its iOS and Android app on Monday.\n                                            The biggest announcement is an overhauled UI for Android, with a new bottom navigation bar.\n                                            The iOS version gets new Liquid Glass UI elements, such as an updated media viewer.\n                                            There are also some new features, including one that lets you craft NFT-like \"collectibles.\"\n                                    \n            \n    Table of Contents\n    \n        \n        If your chat app of choice is Telegram, you have some changes to look forward to. The company announced a number of updates this week, chief among them a new look for its Android and iOS apps—the former is getting a total overhaul, but iPhone users will still note some new UI elements when chatting with friends on Telegram. There are also some new features, including one I find a little odd. There's a new look for Telegram on mobile\n    \n            \n            \n                                        Credit: Telegram\n                    \n    \nPer the announcement, the biggest changes come via UI updates, particularly on Android. Telegram says that its Android app has a \"fully redesigned interface\" intended to make navigating the app quicker and more intuitive—Telegram notes the interface code itself was entirely rebuilt to meet these goals. Changes include a new iOS-like bottom bar that lets you switch between your chats, settings, and profile, among other functionality. If you find the new interface effects to be too much, or too big a draw on your battery, Telegram says you can adjust them from Settings > Power Saving. The company also updated its iOS app, though not quite in the same way. Telegram says it added \"even more Liquid Glass\" to its iOS app, Apple's new design language for iOS 26, including a redesigned media viewer, sticker and emoji pack preview panels, and new context menus in profiles when choosing messages.\nYou can now transfer a Telegram group chat to a new admin\n    \n            \n            \n                                        Credit: Telegram\n                    \n    \nAs of this latest update, if the owner of a Telegram group chat leaves that conversation, the ownership of the group will transfer automatically to one of the group's admins after a week. However, the departing group owner can also choose their own admin if they want to, as Telegram now presets an option to appoint another admin when leaving the group. The company adds that admins can transfer ownership at any time, even if they don't leave.    Telegram bots are now more colorful\n    \n            \n            \n                                        Credit: Telegram\n                    \n    \nA small change, but if you develop bots for Telegram, you now have the option to add colors and emojis to those buttons. It's far from a radical update, but it could make it a bit easier to tell options apart at a glance. \n            \n                What do you think so far?\n            \n        \nThere's a new send message shortcut on the Telegram iPad appA small but noteworthy feature for any Telegram users on iPad: Now, you can send a message using the shortcut \"Command + Enter.\"You can now \"craft\" gifts in TelegramAnd here's that weird new feature: I don't usually expect my chat app to offer collectible gifts, but apparently Telegram does. It previously introduced the ability to send gifts to other people, and even upgrade those gifts to collectibles that can be auctioned on NFT marketplaces (which requires real money).Now, Telegram is reportedly expanding this gift system in the latest update with the ability to combine existing gifts in a new \"crafting\" system to create \"Uncommon, Rare, Epic or Legendary\" versions. You can combine up to four gifts at once, and adding multiple gifts with the same \"attributes\" raises the chance the crafted gift will have that attribute as well. Again, this is the last thing I'd expect or want from a chat app, but, as it's part of this update, so I'm telling you about it.  \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Telegram App Has a New Look, and a Weird New Feature",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH7A5JFYZZTP9BVTRZ5KRK3A/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-11T22:00:00.000Z",
      "dateModified": "2026-02-11T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Easiest (and Cheapest) Ways to Turn Your Attic Into Useful Storage Space",
    "url": "https://lifehacker.com/home/cheap-and-easy-upgrades-attic-storage?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KHC32Y3N8P0PB8SE657KB3E8/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-13T18:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jeff Somers\n                      ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jeff Somers\n                            \n        \n            Jeff Somers\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceJeff Somers is a freelancer who has been writing about writing, books, personal finance, and home maintenance since 2012.Jeff has published nine novels and more than 70 short stories; his story Ringing the Changes was selected for inclusion in The Best American Mystery Stories 2006. In 2018, Jeff published the book Writing Without Rules: How to Write & Sell a Novel Without Guidelines, Experts, or (Occasionally) Pants. He holds a bachelor’s degree in English and previously worked in medical publishing as a production editor. When not writing, Jeff spends his free time fixing up his old house. He has tackled a wide range of DIY projects, including remodeling a bathroom entirely on his own in two weeks, and building a roof deck that hasn't fallen down yet. You can find him on Bluesky.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: ronstik / Shutterstock\n                            \n    Table of Contents\n    \n        \n        If you own a home with an unfinished attic, you’ve probably thought about all that precious space and how you might make it more useful. Your attic already serves an important purpose in temperature and moisture regulation in the house, of course, but that doesn’t mean it can’t do more. If you’ve got the budget, you can transform an attic into a bedroom or office space, or a crisp, well-lit storage option.If you don’t have the budget to really build out your attic, though, you can still make it into a more useful space, even if it’s small or slightly scary. With just a few modest purchases (and possibly some sweat equity), you can make your attic an ideal storage space.Install easy, modular flooring on the attic's floorYour first step towards making your attic useful is to make it safe to walk around. Even if your attic is shallow and standing up straight is impossible, having a stable surface will reduce your chances of falling through the ceiling.Putting down plywood or oriented strand board (OSB) is a cheap and relatively easy option, but it’s also labor-intensive and pretty permanent. If you want a faster solution, floor panels like these from Attic Dek are sized to fit most standard joist spacings and are designed to just snap together, allowing you to quickly drop a floor into place without needing to cut them. They come with screws, and it’s a good idea to secure them in place, but if you just need a temporary floor that can bear weight (up to 250 pounds) you can just click them into place and bolt them down later.Add no-wiring lights to the attic's ceilingIf your attic isn’t wired up or lacks light fixtures, you don’t need to hire an electrician and spend a mountain of cash. Just pick up one or two of these rechargeable ceiling lights and stick them to the ceiling or overhead joist (literally—you place a magnetic sticker on the ceiling and that holds the light in place—no screws required). It’s motion-activated, so every time you haul yourself up into the attic, the light will come on and save you from stumbling about in the dark.\n            \n                What do you think so far?\n            \n        \nInstall adjustable storage that fits the spaceOnce you have a sturdy, safe floor in your attic, you can start installing storage options. You could, of course, just pile up some boxes or bins and call it a day, but you can do a lot better than that without breaking the bank:Installing some hanging rods designed for slanted surfaces (like an attic ceiling or rafters) will give you the option of hanging clothing or storage bags without cluttering up the floor.A few cheap, adjustable shelving units like this one can add all the shelf space you need to keep bins of stuff organized and off the floor, making it easy to store or retrieve items.If your attic is tight and trusses make it difficult to store anything, you can install some truss-friendly shelving. This can be a relatively easy DIY job involving screwing some support brackets into the trusses (as seen here). If you don’t have a floor in your attic, you have to avoid placing heavy storage boxes or bins directly on insulation—compressed insulation isn’t very effective. You can purchase some truss brackets that support plastic bins or other storage boxes off the floor.Install a way to transport your stuff into the atticOnce you’ve got storage, you need a way to get stuff up into the attic, which can be more challenging than you expect. Carrying awkward, heavy boxes up flimsy, pull-down attic stairs is a recipe for accidents, so consider rigging up some mechanical assistance. You can spend a fair amount of money on a fancy lift system that will make bringing stuff up to your attic pretty easy, but if that’s too rich for your blood, you could opt for a simpler winch system that will allow you to haul up to 440lbs of stuff up there at a time. If that’s still a little too much, you could also opt for a classic pulley system, using good old-fashioned mechanical advantage to get your stuff up into the attic.\n            \n    \n    \n        Smarter Home & Living Newsletter\n            Never miss a story\n        \n        \n            Jordan Calhoun\n            \n        \n        Get the latest smart home news, trends, and advice from Jordan and the team.\n            Smarter Home & Living NewsletterNever miss a story.\n                    Get the latest smart home news, trends, and advice from Jordan and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Easiest (and Cheapest) Ways to Turn Your Attic Into Useful Storage Space",
      "image": [
        "https://lifehacker.com/imagery/articles/01KHC32Y3N8P0PB8SE657KB3E8/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-13T18:30:00.000Z",
      "dateModified": "2026-02-13T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]