[
  {
    "title": "This Upcoming Google Photos Feature Turns Your Selfies Into Memes",
    "url": "https://lifehacker.com/tech/google-ai-meme-generator-from-selfies?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K894008RZ7X8M2CYX18MBCC9/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-23T19:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Upcoming Google Photos Feature Turns Your Selfies Into Memes",
      "image": [
        "https://lifehacker.com/imagery/articles/01K894008RZ7X8M2CYX18MBCC9/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-23T19:00:00.000Z",
      "dateModified": "2025-10-23T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "HBO Max Prices Have Officially Gone Up",
    "url": "https://lifehacker.com/tech/hbo-max-prices-are-going-up?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K83J4Z6G4YY2MKBJD7MWC6SB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-21T16:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Some HBO Max plans now cost more than Netflix.\n    \n        \n    \n                                        \n        \n        \n        October 21, 2025\n                    \n            Credit: Warner Bros. Discovery\n                            \n            \n                Key Takeaways\n                                            HBO Max is raising its prices for all three subscription tiers.\n                                            Basic With Ads is $1 more per month, Standard is $1.50 more per month, and Premium is $2 more per month.\n                                            Annual plans are also increasing in prices, though customers will only see those increases when their subscriptions are up for renewal.\n                                    \n            \n    Table of Contents\n    \n        \n        It's now more expensive than ever to stream shows like House of the Dragon and Hacks. On Tuesday, Oct. 21, Warner Bros. Discovery announced that all HBO Max subscription prices will increase, effective immediately. In fact, for some plans, it is now more expensive to subscribe to HBO Max than it is to subscribe to Netflix.Here's the deal: Prices are going up across all three of HBO Max's subscription tiers. That includes the following: HBO Max Basic With Ads: $10.99 per month (was $9.99 per month), or $109.99 per year (was $99.99 per year)HBO Max Standard: $18.49 per month (was $16.99 per month), or $184.99 per year (was $169.99 per year)HBO Max Premium: $22.99 per month (was $20.99 per month), or $229.99 per year (was $209.99 per year)These price points are now in effect for all new subscribers. Current monthly subscribers will be notified of the price hike, and will see increases on their next billing cycle, on or after Nov. 20, 2025. Similarly, annual subscribers will not see a price increase until their plans are up for renewal. If you signed up for an annual Premium subscription yesterday, for example, you're locked into that $209.99 price until next year. If your annual Premium plan renews next month, however, you'll be charged that extra $20. \n        \n            You May Also Like\n        \n    \nThis is, of course, the most expensive HBO Max has ever cost, and will be especially felt by any subscribers that pay for extra member accounts. In fact, HBO Max Basic With Ads and HBO Max Standard now costs more than Netflix with Ads and Netflix Standard, by quite a bit. Netflix with Ads is only $7.99 at this time, while Netflix Standard is $17.99. It costs $.50 more to subscribe to HBO Max Standard than Netflix Standard, and $3 more to subscribe to deal with HBO's ads over Netflix's. The only edge HBO Max still has is in the Premium category, as Netflix charges $24.99 for the privilege of 4K content with four concurrent streams at once. If you're looking at these price points, and are committed to only one streaming service at a time, you might be convinced to take the Netflix route. As such, Warner Bros. Discovery might be banking on the demand for its content over the dollar and cents here: Between series like The Last of Us, The Gilded Age, The Penguin, and The White Lotus, and content like Weapons and Peacemaker, HBO Max is host to some of the most talked-about shows. Maybe that will convince people to stick with the service even through these price hikes, especially as the Game of Thrones spinoff A Knight of the Seven Kingdoms is on the horizon.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "HBO Max Prices Have Officially Gone Up",
      "image": [
        "https://lifehacker.com/imagery/articles/01K83J4Z6G4YY2MKBJD7MWC6SB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-21T16:30:00.000Z",
      "dateModified": "2025-10-21T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube Has a New Look on Mobile",
    "url": "https://lifehacker.com/tech/youtube-has-a-new-look-on-mobile?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BHERH2G90G7G5XZK8Z480G/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T19:30:05.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            And there's not a lot you can do about it.\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n    \n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            YouTube has a new UI on mobile.\n                                            Buttons are bigger and chunkier, and there are some new animations.\n                                            There are extensions for desktop to reverse some of these changes, but not much you can do on mobile.\n                                    \n            \n    Table of Contents\n    \n        \n        Last week, YouTube started rolling out a new look across both the web and its various apps, promising a \"more expressive and intuitive interface.\" In reality, the reaction has been mixed. The TV app, for instance, no longer automatically rewinds or fast forwards when you press back or forward, instead navigating between buttons including \"like\" or \"subscribe.\" More than once while on TV, I've accidentally subscribed to a channel without meaning to, before realizing that I now need to press up first to get to the progress bar.Now, the changes have reached the YouTube mobile app, as first spotted by 9to5Google. While they're a bit more mild than you'll see on TV, there's still a few changes to get used to.Bigger, chunkier icons\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nBy far, the most noticeable new change is YouTube's new suite of icons, which all look like they've been hit with a \"Ctrl + B.\" Compared to the old look, the play, fast forward, and other buttons all look larger and bolder, with the idea being to make them more prominent.\n        \n            You May Also Like\n        \n    \nSome of the buttons have also been consolidated. When watching a video in landscape, buttons that don't affect playback (like, dislike, comment, etc.) all now appear together in a pill in the bottom-left corner, rather than as separate elements.New animationsNew buttons aren't the only change YouTube has in store for you. Seeking videos also has a new animation now, and on some videos, liking now comes with a bit of extra personality.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nThe first is a pretty minor change. Now, when you double tap the screen to either go forward or back 10 seconds, the video will just automatically jump to the new spot and display a big \"-10\" or \"+10,\" rather than showing a quick animation of three arrows disappearing into each other with a smaller \"-10 seconds\" or \"+10 seconds\" below them.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nThe second is a bit cuter. On certain videos, tapping the \"like\" button will now play a custom animation, rather than simply putting some sparkles around a thumbs up. For instance, on a music video, you'll now briefly see a musical note replacing the thumbs up.Pausing no longer darkens your backgroundIt used to be that pausing a video would darken the background until you unpaused it, kind of like lights being lowered on a stage. That's no longer the case. While you'll still see the lights go slightly down while you have controls open, a paused video will now display as normal if you tap again to dismiss the controls. It's a small tweak, but could prove useful for taking screenshots. At the same time, though, I do worry that it might make it easy to think a video has frozen, if you're not paying attention.Nested comments and easier bookmarksFinally, Google has removed a few steps to saving and commenting on videos. Now, hitting the bookmark icon to save a video to a playlist has fewer steps, no longer requiring you to navigate multiple pages. Instead, it'll just pause the video and open a list of your playlists for you, where you can quickly tap the playlist you want to save your video to.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nAdditionally, comments are threaded now, easily showing who is replying to which comment. It's a great way to keep track of the flow of the conversation, although it does make each comment take up a bit of extra space.Can you get rid of the new YouTube UI?Ultimately, I'm a little torn on the new YouTube app. Certain new features, like threaded comments, just make sense to me. But the chunkier buttons do feel like they get in the way a bit to me, and I can't help but think of Fisher-Price when I see them.Unfortunately, there's not a lot you can do if you don't like the new YouTube mobile interface. It's still rolling out, so it's possible you might not see every change yet. But because it's server-side, once it hits you, that's it. Even the web player is getting these changes, so leaving the app behind isn't a viable option.That said, if you're on desktop, users on both Reddit and YouTube itself are putting together extension lists that you can mix and match to customize your experience. Technically, there are browsers for mobile that will allow you to play with these as well, with Firefox being the big one these days. However, I found that most of the suggested extensions no longer worked for me or weren't available for mobile. In that case, if you're sick of how YouTube looks now, you might want to consider an alternate player app instead, like Play. It still relies on embedded videos, so it won't save you from every change, but its overall minimalist style could offer welcome relief from YouTube's increasingly busy design language.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube Has a New Look on Mobile",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BHERH2G90G7G5XZK8Z480G/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T19:30:05.000Z",
      "dateModified": "2025-10-24T19:30:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Use Your iPhone As an ID in These 12 States",
    "url": "https://lifehacker.com/you-can-use-your-iphone-as-an-id-in-these-states?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2HAA4EPN6RTQFW5EHG8HX0/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T15:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Can I please stop carrying my driver's license everywhere I go?\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n    \n            Credit: Tada Images / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Why do I still carry a wallet? My iPhone can handle just about anything you used to need a traditional wallet for. Most (if not all) of my purchases are made via Apple Pay or QR code, my phone holds all of my pictures, and most of my receipts go straight to my email. Basically the only I keep my wallet around is to carry my ID. Once my state starts supporting Apple’s digital ID feature, however, things will change between me and my wallet—provided that support ever comes.Since iOS 15.4, Apple has allowed you to add a driver’s license or other state ID to your iPhone’s digital wallet. That doesn’t mean you’ve been needlessly carrying your ID around since then—states have been slow to roll out their own support for the feature, and most have yet to sign on at all. When I first covered this feature in 2022, only two states actively allowed you to add your ID to your iPhone, while 10 more (plus Puerto Rico) had confirmed plans to offer the option eventually, on a loose timeline of “soon.” Fast forward three years, and just 9 states and one territory now officially allow you to add IDs to Wallet.\n        \n            You May Also Like\n        \n    \nThese states support digital ID nowHere’s the full list as it stands in June 2025:ArizonaCaliforniaColoradoGeorgiaHawaiiIowaMarylandMontanaNew MexicoNorth DakotaOhioPuerto RicoWest VirginiaSupport is still \"coming soon\" in these statesThese states had originally pledged that support was \"coming soon,\" but after nearly three years, still haven't committed:ConnecticutKentuckyMississippiOklahoma UtahAirports where you can use a digital ID in Apple WalletNow, be warned: You can't simply hand a cop your iPhone when you get pulled over. There are specific, limited use cases for this feature. Right now, that means identifying yourself at the airport, as well as at select businesses. Apple worked with the TSA to make this happen, and while it used to maintain an active list of supported airpots, it seems to have taken it down. This is the list as it was last updated:Baltimore/Washington International Thurgood Marshall Airport (BWI)Cincinnati/Northern Kentucky Airport (CVG)Daniel K. Inouye International Airport (HNL)Denver International Airport (DEN)Des Moines International Airport (DSM)Eastern Iowa Airport (CID)Hartsfield-Jackson Atlanta International Airport (ATL)John Glenn Columbus International Airport (CMH)Los Angeles International (LAX)Luis Muñoz Marín International Airport (SJU)Ronald Reagan Washington National Airport (DCA)Phoenix Sky Harbor International Airport (PHX)San Francisco International Airport (SFO)San Jose Mineta International (SJC)Missoula International Airport (MSO)Great Falls International Airport (GTF)Bozeman Yellowstone International Airport (BZN)Billings Logan International Airport (BIL)Lea County Regional Airport (HOB)Albuquerque International Sunport (ABQ)This feature will also work with participating businesses to verify your age, including bars, restaurants, liquor stores, festivals, concerts, and certain age-restricted apps. However, there is no list of venues that support this feature.\n            \n                What do you think so far?\n            \n        \nHow to add a digital ID to your iPhoneIf you do live in a supported state, setting up the feature is simple. Open Wallet, then, tap the (+) in the top right, then choose “Driver’s License and ID Cards.” Choose your state, then choose whether to add the ID to your iPhone 8 or newer, as well as your Apple Watch Series 4 or newer. (There are caveats here: California requires an iPhone XS or later running iOS 17.5 or newer, or an Apple Watch Series 4 running at least watchOS 10. Puerto Rico requires an iPhone XS or later running iOS 18.1 or newer, or an Apple Watch Series 6 or later running watchOS 11 or newer.)   Either way, you’ll need to scan your ID with your iPhone’s camera, then scan your face to prove your identity. Once complete, send all information to your state to confirm. If you live in North Dakota, you will need to pay a $5 fee to use this feature.  \n    \n            \n            \n                                        Credit: Lifehacker\n                    \n    \nThe next time you fly from a participating airport, you can unlock your iPhone and place it next to the ID scanner. You’ll see your digital ID appear, complete with all information you will be sharing with the TSA if you approve (name, date of birth, sex, issuing authority, and issue and expiration dates).\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Use Your iPhone As an ID in These 12 States",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2HAA4EPN6RTQFW5EHG8HX0/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T15:30:00.000Z",
      "dateModified": "2025-10-24T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Check This Database to See If Your Email Credentials Have Been Leaked",
    "url": "https://lifehacker.com/tech/leaked-email-credentials-in-database?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K88R3FXB3Z4XKH73YQ5B9HV5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-23T15:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Check This Database to See If Your Email Credentials Have Been Leaked",
      "image": [
        "https://lifehacker.com/imagery/articles/01K88R3FXB3Z4XKH73YQ5B9HV5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-23T15:00:00.000Z",
      "dateModified": "2025-10-23T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why an AWS Outage Can Break the Internet",
    "url": "https://lifehacker.com/tech/what-is-aws?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K81QYSWSW78HM2TJY1ZEFF85/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-20T22:00:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            What is AWS, anyway, and why does it matter so much?\n    \n        \n    \n                                        \n        \n        \n        October 20, 2025\n                    \n            Credit: Sundry Photography/Shutterstock\n                            \n            \n                Key Takeaways\n                                            AWS had a global outage on Monday that resulted in interruptions for many sites and services.\n                                            AWS is short for Amazon Web Services, and offers cloud computing products for companies.\n                                            The company is the largest cloud-based hosting service in the world, with over four million physical businesses relying on it.\n                                    \n            \n    Table of Contents\n    \n        \n        If you used the internet at all on Monday, you probably noticed a lot of things weren't working all that well. Sites and services around the world experienced interruptions, including the likes of Facebook, McDonald's, and even Fortnite. You might have heard by now that the issues were caused by an AWS outage. If you don't know what AWS is, however, that explanation might not be all that clear. \"Amazon Web Services\" runs the internetAWS is an Amazon subsidiary, short for Amazon Web Services. The company offers over 200 cloud-based products to customers, including applications for all of the following:Accessing AWS servicesAnalyticsApplication integrationBlockchainBusiness applicationsCloud Financial ManagementComputeCustomer enablementContainersDatabasesDeveloper toolsEnd user computingFrontend web and mobile servicesGame techIoTMachine learning and AIManagement and governanceMediaMigration and transferNetworking and content deliveryQuantum technologiesSatelliteSecurity, identity, and complianceStorageMore than this list, it's important to understand why AWS matters. The service replaces the need for companies to purchase their own hardware for their data storage, networking, and computing requirements. Instead, companies can choose to outsource these needs to AWS, and adjust those services as those needs change. As such, a company can start out hiring AWS to handle a small amount of their processing, but as the company grows, they can choose to add more servers to their plan—rather than invest in additional hardware to handle the processing. This is known as cloud computing. \n        \n            You May Also Like\n        \n    \nIn order to keep up with a global demand, AWS relies on a large number of physical server locations spread out throughout the world. Amazon says AWS has 120 \"Availability Zones\" across 38 global regions—physical locations that contain at least one data center with \"redundant power, networking, and connectivity.\" The idea is, having these physical data centers across continents means your cloud compute is easier to expand and is better protected from failure—which is a little ironic, given today's events. How much of the internet runs on AWS?In theory, there are a lot of advantages to cloud computing. It can be much simpler and cost efficient for a company to rent AWS servers and technology to power their applications, store their data, or handle their traffic. As such, a lot of the world runs on AWS. According to HG Insights, as of 2025, 4.19 million businesses with a physical address use AWS. (There doesn't appear to be data on customers without a physical address, so this number could be much higher.) In addition, AWS is the largest cloud computing company in the market at this time: That same report found AWS has 30% of the market, while competitors like Microsoft Azure and Google Cloud make up 20% and 12%, respectively. Why an AWS outage is such a big dealWhen so many companies rely on your cloud computing to run their internet-based services, the risk for failure is great. That's what we saw on Monday: AWS' outages resulted in issues with many sites and services. If the HG Insights is correct, as many as 30% of businesses that use some type of cloud computing services could have been impacted today. One analyst thinks the impacts of the outage may be billions of dollars in lost revenue. It's not clear what the solution is, but it's clear that there's a jeopardy in so much of the internet relying on one cloud hosting service.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why an AWS Outage Can Break the Internet",
      "image": [
        "https://lifehacker.com/imagery/articles/01K81QYSWSW78HM2TJY1ZEFF85/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-20T22:00:00.000Z",
      "dateModified": "2025-10-20T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple TV Subscribers Can Soon Add Peacock for $2 More",
    "url": "https://lifehacker.com/entertainment/apple-tv-peacock-bundle-offer?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7Q6SJMCKM035G4ZFZA375R2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-16T20:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple TV Subscribers Can Soon Add Peacock for $2 More",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7Q6SJMCKM035G4ZFZA375R2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-16T20:00:00.000Z",
      "dateModified": "2025-10-16T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What the Science Says About Red Light Therapy for Athletic Recovery (so Far)",
    "url": "https://lifehacker.com/health/red-light-therapy-athletic-recovery?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BHWBM12R5Z32D6YASH0Z2Z/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T20:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Forget younger-looking skin—what about a back that doesn't hurt?\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n                    \n            Credit: Microgen / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Red light therapy devices are everywhere—from lamps, to full-body mats, to those glowing face masks flooding my social media feed. I usually see red light therapy advertised for \"younger-looking skin,\" but I'm not interested in these devices as a means to slow down aging—I'm interested in them as a recovery-obsessed athlete with very sore muscles.These gadgets promise to boost athletic performance, speed muscle recovery, and reduce inflammation, all by bathing your body in specific wavelengths of red and near-infrared light. But do these trendy tools live up to the hype, especially for muscle recovery?What red light therapy advocates claimRed light therapy devices typically emit light in the red (620-670 nanometers) and near-infrared (800-850 nanometers) spectrum. Manufacturers claim these wavelengths penetrate the skin to stimulate cellular activity, specifically targeting the mitochondria (the energy-producing powerhouses inside our cells). The purported benefits include enhanced muscle recovery, reduced inflammation, improved circulation, decreased muscle soreness, and even performance gains.\n        \n            You May Also Like\n        \n    \nIt all sounds scientific enough: the light supposedly helps mitochondria produce more ATP (cellular energy) and triggers the release of beneficial compounds like nitric oxide, which improves blood flow and activates repair processes throughout the body. But let's dig into what these gadgets can actually do.What the science actually saysSurprise, surprise: The science is more nuanced than marketing materials suggest. According to Dr. Wesley Buckle, a licensed naturopathic doctor, \"the data on red light therapy is not definitive. Some studies show that it can help with delayed onset muscle soreness and muscle recovery. However, the evidence is mixed. Most of the studies that have found a positive benefit are small, short-term ones.\"While the research shows potential, there's a significant gap between what manufacturers claim and what the evidence actually supports, Buckle says he's seen \"claims of enhanced performance, improved circulation, and muscle recovery\" that are ultimately overblown. \"The evidence supports mild improvements in muscle fatigue. It doesn't support dramatic claims of large gains and strength or performance boosts.\"This is a crucial distinction. If you're expecting red light therapy to transform your performance or replace proper training, you'll be disappointed. The benefits appear to be modest and supportive rather than revolutionary.Another critical factor is device quality. McCall McPherson, a physician associate and founder at Modern Thyroid Clinic and Modern Weight Loss, says that \"not all devices are created equal. The effectiveness depends heavily on the wavelengths used, power output, and build quality of the device.\" It's important to distinguish between medical-grade panels built with specific, researched wavelengths and all the cheaper consumer devices that may not deliver the necessary light intensity or correct wavelengths to produce biological effects.There's certainly promising research, but this research is based on specific wavelengths (typically 620-670 nm for red light and 800-850 nm for near-infrared) and specific energy doses. Many budget-friendly devices don't meet these parameters, which means they're unlikely to produce the results seen in clinical studies.Should you consider red light therapy?For the average athlete, red light therapy could be a useful addition to a recovery routine—but with important caveats. Buckle advises prioritizing the fundamentals: \"Sleep, nutrition, and proper training are all extremely important. Without these things, red light therapy won't help. It can't replace these practices...Red light therapy could be a good supportive recovery tool for most people. However, it's best to focus on the basics first, such as proper training.\"McPherson is more enthusiastic, saying, \"I really do think red light therapy can be a great recovery tool for casual athletes when used correctly.\" She notes that for best results, athletes should look for quality medical-grade devices and use them consistently right before or after workouts on the specific muscles trained. \"It's not magic,\" says McPherson, \"but it's one of the most well-researched, noninvasive tools we have for reducing soreness and speeding up recovery between workouts.\"The bottom lineRed light therapy for muscle recovery isn't pure snake oil; there's legitimate science supporting its use as a supportive recovery tool. However, the benefits appear to be modest improvements in muscle soreness and recovery rather than dramatic performance enhancements. The evidence is still evolving, with many studies being small and short-term.If you're considering adding red light therapy to your recovery arsenal, remember these key points: First, nail the basics. No amount of red light will compensate for poor sleep, inadequate nutrition, or improper training. Second, invest in quality. If you decide to try red light therapy, choose a medical-grade device with the correct wavelengths and power output rather than the cheapest option on Amazon. Third, be consistent. The research shows benefits with regular use, not occasional experimentation.Finally, manage your expectations. Think of red light therapy as a potentially helpful tool for reducing soreness and supporting recovery—not a miracle device that will dramatically transform your athletic performance. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What the Science Says About Red Light Therapy for Athletic Recovery (so Far)",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BHWBM12R5Z32D6YASH0Z2Z/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T20:00:00.000Z",
      "dateModified": "2025-10-24T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How ‘Parkinson’s Law’ Is Making You Unproductive, and What to Do About It",
    "url": "https://lifehacker.com/how-parkinsons-law-is-making-you-unproductive-and-what-to-do-about-it?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GMC15VMJWNQ6QNJ4C0CE3/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-22T12:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Never give yourself two hours for a task you can finish it one hour, or it will take two hours.\n    \n        \n    \n                                        \n        \n        \n        October 22, 2025\n    \n            Credit: Lazy_Bear - Shutterstock\n                            \n    Table of Contents\n    \n        \n        One of the best ways to maximize your productivity and output is to plan out what you need to do in advance, which you can do with a brain dump, a ruthlessly curated daily schedule, a collection of planning tools, or any other number of methods. Unfortunately, even the best practices come with a dark side if you take them too far. In this case, that dark side is Parkinson’s Law, an observation that suggests the longer you give yourself to do something, the longer you’ll take to actually get it done. The truth of the matter is that you can schedule, plan, and fret your way right into accomplishing nothing. It’s always better to get difficult things done as soon as possible, so let’s consider the pitfalls of Parkinson’s Law, and how you can overcome them.What is Parkinson’s law?The origins of the axiom are a little delightful: Cyril Northcote Parkinson described the phenomenon in a 1955 humorous essay in The Economist, and it’s been credited to him ever since. You can read the entire essay, but its main point is this: \"Work expands so as to fill the time available for its completion.\"\n        \n            You May Also Like\n        \n    \nThough it had a funny start, the idea grew until it was being studied in more serious capacities. Researchers published their findings on Parkinson’s law in the Psychonomic Bulletin & Review in 1999, finding that people tend to consider how much time is available to complete a task rather than considering how little time it might actually take. Basically, we give our future selves a little too much wiggle room when planning our schedule, then our future selves graciously accept all that extra time that could be spent doing something else. After all, our past selves, wise as they were, carved out that time for one task, and who are we to challenge that? You can probably find examples of this in your own life. If your boss gives you an easy task but sets a deadline for the following week, are you likely to get the work done immediately? Parkinson's Law gets me, more often than I'd like to admit, especially when I'm getting ready in the morning. When I used to give myself an hour to get out of the house, I'd spend it dawdling, scrolling on my phone, or generally loafing, so I started giving myself half an hour instead, with an added goal of grabbing coffee. Essentially, I started the \"getting ready\" process at the same time each day, but with an earlier deadline and an extra task. I found I still made it to where I needed to be on time, even after stopping to treat myself. Set shorter deadlines—and stick to themConsider the example of having a week to do a simple task at work. Instead of setting a week from now as the goal date and letting the task hang over you, pick a day to get it all done—ideally, one or two days before the due date, so it’s fresh in your mind if you have to discuss or explain it afterward. Schedule a block of time to do whatever needs to be done, but give yourself less time than you normally would. If you think distractions or other issues might crop up during your work time, take steps (like indicating you’re busy) to mitigate them instead of accommodating them with a time buffer.This approach is useful because it prompts you toget things done sooner and without overthinking them. It also gives you a bit of a failsafe: If you submit your work early and discover there are issues with it, you have all that saved time to address those problems and resubmit while still meeting your original deadline. (This is why I always recommend setting two deadlines for any big project.) \n            \n                What do you think so far?\n            \n        \nGive yourself less time to complete tasks, not moreAs you can see by now, to defeat Parkinson’s Law, you need to give yourself less time to complete your tasks. Consider the Yerkes-Dodson Law, which says that to be your most productive, you have to have just the right amount of stress—not too little and not too much. When you have too much time to devote to something, you don’t have enough stress to motivate you.To test this out, spend a few weeks shaving some time off your allotments for different responsibilities. Use timeboxing to schedule your entire day down to the minute, using blocks of time in your calendar. If you think it will take you 30 minutes to answer all your emails in the morning, give yourself 20. If you think it will take an hour to compile reports for a big project, give yourself 45 minutes. When you cut that time down and know you only have limited space to finish a task, you will hopefully find yourself locking into a state of deep work, where you're totally focused on the task and can move through it systemically. That feeling of urgency is key.\n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How ‘Parkinson’s Law’ Is Making You Unproductive, and What to Do About It",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GMC15VMJWNQ6QNJ4C0CE3/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-22T12:00:00.000Z",
      "dateModified": "2025-10-22T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta’s Upcoming AI Parental Controls Are Too Little, Too Late",
    "url": "https://lifehacker.com/tech/meta-ai-parental-controls-too-little-too-late?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7SXX823924BX5S4K387CJGH/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-17T21:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta’s Upcoming AI Parental Controls Are Too Little, Too Late",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7SXX823924BX5S4K387CJGH/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-17T21:30:00.000Z",
      "dateModified": "2025-10-17T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Sign Up to Test Oura’s Upcoming Blood Pressure Feature",
    "url": "https://lifehacker.com/health/oura-is-testing-a-blood-pressure-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K819QHZ8QMG4WZW6JZJMKJM1/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-20T18:00:36.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Sign Up to Test Oura’s Upcoming Blood Pressure Feature",
      "image": [
        "https://lifehacker.com/imagery/articles/01K819QHZ8QMG4WZW6JZJMKJM1/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-20T18:00:36.000Z",
      "dateModified": "2025-10-20T18:00:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I Tried the At-Home Flu Vaccine, and It Was Great",
    "url": "https://lifehacker.com/health/how-to-order-flu-mist-at-home-flu-vaccine?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01J8FS01VYQM1PSDQ1GTRMM0ZY/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-23T16:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            You can order FluMist to be delivered right to your home.\n    \n        \n    \n                                        \n        \n        \n        October 23, 2025\n                    \n            Credit: Beth Skawrecki\n                            \n    Table of Contents\n    \n        \n        If I ever skip my flu shot, or fail to get one for my kids, it's because I didn't find time to get to the pharmacy during flu shot season. That's why I've been excited for FluMist's home delivery ever since I read about its FDA approval last year. My shots arrived this week (in nasal spray form), and I found the whole experience blessedly painless.The FluMist vaccine is a nasal spray, not an injection. It's available for people aged 2 to 49 (with some exceptions) and I try to get it for my kids when it's available. My youngest hates needles, and I sometimes have to call multiple pharmacies to find one that has it in stock. So when home delivery became available, I placed my order right away. How can you get the at-home flu vaccine? The nasal spray vaccine, called FluMist, still needs to be prescribed by a medical provider. But since nearly everyone aged 2 through 49 is eligible, FluMist’s maker (AstraZeneca) has a created a telehealth website that bundles the provider's approval with an order to an online pharmacy. The process takes about five minutes on average, the company says, and I found that to be accurate. \n        \n            You May Also Like\n        \n    \nI had already gotten a flu shot, so I ordered just for my kids. The website allowed me to add multiple people to the same order, so I filled out the questionnaire for each child, giving their names, ages, allergies, and so on. The website then reached into some big data cloud out there and told me it already knew their insurance information (existentially frightening, yet convenient!) and presented me with my bill: an $8.99 fee, which included $2.50 for physician evaluation and $6.49 for shipping and processing. Insurance covers the cost of the vaccine itself. Who can use the at-home flu vaccine? The at-home vaccine is the same as regular FluMist, which is approved for ages 2 through 49. That means babies and older adults will still need to visit a provider for the regular, injectable flu vaccine. Children can get flu shots starting at the age of six months.FluMist uses a live, weakened virus. It can't give you the actual flu, but it can cause some respiratory symptoms in people with weakened immune systems. So it's not recommended for people who are pregnant, have certain medical conditions, or are immunocompromised or have close contact with an immunocompromised person. If that's you, talk to a provider about your best options. You may be advised to get the regular injectable type, which doesn't include any live virus. What happens when the at-home flu vaccine arrivesWhen I placed the order, I had to choose a delivery date (to be sure I'd be home and ready to receive it). It arrived via FedEx, with multiple texts ahead of time letting me know it was on its way. The vaccine needs to stay at refrigerator temperature, so you don't want it sitting out on your porch all weekend. I thought I would have to refrigerate it immediately—the instructions say as much—but it can actually be unrefrigerated for up to 12 hours before administration. So the box arrived, insulated and with the vaccine packages surrounded by cold packs. There was a \"TiveTag\" sticker on the interior box, so I followed the instructions to download the TiveTag app from a QR code on the package. It installed quickly, and then I just had to hold the phone up to the RFID sticker on the box. A screen told me that the box had stayed at an appropriate temperature the whole time, so I was good to go. How do you give yourself the at-home flu vaccine? Giving the vaccine is simple. To give you a sense: an at-home COVID test is about ten times more complicated. All you have to do here is take off the rubber cap, squirt the vaccine into one nostril, then take off the little spacer around the plunger and squirt into the second nostril. (The spacer makes sure that you get half the vaccine into each nostril.) If you've gotten a FluMist at a pharmacy, it's the same idea. Adults can administer it to themselves, and children will need an adult to do it for them. Instructions are, of course, provided. After I gave it to my kids, I clicked a link in a text message to \"report vaccination,\" which updates their health records in, again, some big ol' data cloud. (I will also let their doctor know at their next appointment.) After you administer the vaccine, there is a prepaid envelope you can use to return the sprayers for disposal. The paper packages and inserts obviously could be recycled. That left me with the cardboard box, its insulated foam liner, and six liquid cold packs that the FluMist site says are filled with \"non-toxic water\" and can be either poured out and recycled, or reused as ice packs if I'd like. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n            Editor in chief\n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I Tried the At-Home Flu Vaccine, and It Was Great",
      "image": [
        "https://lifehacker.com/imagery/articles/01J8FS01VYQM1PSDQ1GTRMM0ZY/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-23T16:00:00.000Z",
      "dateModified": "2025-10-23T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here’s When You’ll Be Able to Buy the M5 MacBook Air",
    "url": "https://lifehacker.com/tech/heres-when-you-can-expect-an-m5-macbook-air?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7SDN2HBG96655HCVKQA31H0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-17T17:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Apple may also be working on a MacBook Pro with a touchscreen.\n    \n        \n    \n                                        \n        \n        \n        October 17, 2025\n    \n            Credit: aapsky/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Bloomberg's Mark Gurman has the scoop on Apple's upcoming Macs, including the M5 MacBook Air and a MacBook Pro with a touchscreen.\n                                            The M5 MacBook Air will likely arrive next spring, alongside other M5 Macs and Mac accessories.\n                                            Apple is also reportedly working on a MacBook Pro with a touchscreen, due out late 2026 or early 2027.\n                                    \n            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.Apple officially entered its M5 era on Wednesday. The company not only announced the new M5 chip, placing a major emphasis on its AI processing power, but also the first batch of new devices that will ship alongside it. If you're interested in buying an Apple device with the company's latest and greatest hardware, it's all just around the corner. That said, the list of product announcements was limited. While Apple revealed M5 versions of the iPad Pro and Vision Pro will be available starting on Oct. 22, it only showed off one M5 Mac: the 14-inch MacBook Pro. The 13- and 15-inch MacBook Airs are still stuck on M4 for now, as are the Pro and Max versions of the 14-inch and 16-inch MacBook Pros. But a few days later, we know when that might change.\n        \n            You May Also Like\n        \n    \nMore M5 Macs are on the horizon If you're holding out on buying one of the current M4 laptops in the hope that Apple will soon upgrade them with M5 chips, you're going to be waiting a little while longer. As Bloomberg's typically reliabe Mark Gurman reports, Apple doesn't plan to refresh its MacBook Air line until next spring. That goes for a host of other Mac products as well, including M5 versions of the Mac Studio and Mac mini, in addition to new Mac monitors. It's a similar story for the M5 Pro and M5 Max MacBook Pros. While Gurman doesn't specify whether these laptops are also coming in the spring, he does report Apple is planning on refreshing the 14- and 16-inch MacBook Pros with the new chips in \"early 2026.\" Gurman says the new MacBook Pros will recycle Apple's current design, and I'd imagine the same will hold true for the M5 MacBook Airs. The M5 14-inch MacBook Pro looks identical to its M4 counterpart, after all, with the only notable changes (other than the M5 chip) being a boosted 24 hour battery life and faster SSD.  If you're currently holding out on buying a new MacBook, I don't think there's much reason to wait for the M5, unless you just really want the newest hardware Apple has to offer. The current M4 machines are excellent, and, in the case of the MacBook Air, can be bought for a very reasonable price—especially when they go on sale. During October Prime Day, stores offered the 13-inch M4 MacBook Air for only $799, which is an excellent value. \n            \n                What do you think so far?\n            \n        \nApple is also working on a touchscreen MacBook ProIn this same report, Gurman discusses Apple's current plans for a MacBook Pro with a touchscreen, which would be a dramatic refresh—no Mac has ever shipped with a touchscreen, unless you count the controversial Touch Bar (RIP), which only added a touch-based strip to the top of the keyboard. According to Gurman, these touchscreens will be OLED, which the company already uses in its iPad Pros and iPhones. You'll still have the standard keyboard and trackpad, so you could ignore the touchscreen entirely, though Apple is considering replacing Touch ID with Face ID, again mirroring its iPads and iPhones. To that point, the \"notch\" (the large camera cutout at the top of the screen) may be replaced by a smaller hole-punch design, reminiscent of the iPhone's Dynamic Island. Alongside the touchscreen, Apple may update the design of these MacBook Pros to be thinner and lighter, and they may run on the M6 chip, rather than a version of the M5. They may also include a new hinge and lid design to compensate for the force of touching the display. Remember, this would be a new design challenge for the MacBook line, which has never had to deal with users purposely touching the display before.Gurman says the touchscreen MacBook Pro won't debut until late 2026 or even early 2027. When it does arrive, it will likely come with an increased price tag of at least \"a few hundreds dollars more than current versions.\" Right now, the M4 Pro MacBook Pros start at $1,999 for the 14-inch model, and $2,499 for the 16-inch model. Apple would be upgrading the hardware here considerably, so the increased price tag isn't without merit. But if you're looking for the best value Mac possible, it's challenging to beat the current M4 MacBook Air—especially when it's on sale.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here’s When You’ll Be Able to Buy the M5 MacBook Air",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7SDN2HBG96655HCVKQA31H0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-17T17:00:00.000Z",
      "dateModified": "2025-10-17T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Samsung's Galaxy XR Headset Compares to the Apple Vision Pro and Meta Quest 3",
    "url": "https://lifehacker.com/tech/samsungs-galaxy-xr-headset-available-to-order?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K86QW5YTDNXN6FFMM80C7S1G/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-22T20:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Samsung's Galaxy XR Headset Compares to the Apple Vision Pro and Meta Quest 3",
      "image": [
        "https://lifehacker.com/imagery/articles/01K86QW5YTDNXN6FFMM80C7S1G/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-22T20:30:00.000Z",
      "dateModified": "2025-10-22T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tinder Is Using Face Scans to Make Catfishing More Difficult",
    "url": "https://lifehacker.com/tech/tinder-facial-scans-to-fight-bots?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8944MWRSPRM6C5WWMDHCE17/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-23T19:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Face scanning is now required for new users in seven countries, plus California.\n    \n        \n    \n                                        \n        \n        \n        October 23, 2025\n    \n            Credit: Tinder\n                            \n            \n                Key Takeaways\n                                            Tinder is now requiring new accounts in certain areas to scan their faces during setup.\n                                            The new feature is now live in California and in seven countries across the globe.\n                                            Tinder says it will not keep your video selfie, but it does retain a \"non-reversible, encrypted face map.\"\n                                    \n            \n    Table of Contents\n    \n        \n        It's about to get a whole lot harder for catfishers on Tinder. Starting today, new users in California will have to scan their faces while setting up their accounts to ensure that they're both real and that they match their profile photos. Called Face Check, the new mandatory feature is the first step in a new initiative from Tinder's parent company Match Group, which says the goal is to help reduce \"spam, scam attempts, or [bots] operating automated fake profiles.\" When signing up, users will need to complete a \"liveness check,\" during which they'll take a video selfie from various angles. After that, the app will compare the selfie to profile pictures also uploaded during setup, and if it determines that they match, the user will get a \"Photo Verified badge\" and they'll be able to finish making their account. Tinder also says the system can determine if a picture has been used across multiple accounts to help prevent impersonation.While Face Check is new to the United States, it's already been launched abroad in Colombia, Canada, Australia, India, and \"several countries across Southeast Asia.\" According to Tinder, \"when coupled with other recent safety initiatives,\" Face Check has led to an over 60% decrease in users exposed to \"bad actors,\" and an over 40% decrease in reports of bad actors.\n        \n            You May Also Like\n        \n    \nFace Check's debut also coincides with the rise of AI image generators, and while the company's announcement post doesn't explicitly call out AI, it's not hard to see how it could prove handy against bots using generated photos to pretend to be someone who doesn't even exist. Traditional catfishing methods, such as using stock photos, can be detected with diligent reverse image searching, but AI's ability to quickly create novel, believable, and specifically tailored results has made it harder than ever to know whether you're speaking to a genuine human online.At the same time, as other apps begin to collect personal information like government IDs, there is a privacy concern. Tinder says that Face Check only uses your video selfie to complete the verification process, and deletes it shortly after review, although it does generate a \"non-reversible, encrypted face map\" that is stored to \"help verify new photos, detect fraud, and prevent duplicate accounts.\"\n            \n                What do you think so far?\n            \n        \nAs someone who met my husband on Twitter (RIP), I'll leave it up to you whether that's worth it. Have you tried just getting real good at posting instead?For now, though, you might have to wait a bit until Face Check actually makes its way to you. First, Tinder is not forcing existing accounts to use Face Check, which is why I assume it's using a badge to indicate the accounts that have gone through Face Check, even though it's mandatory during setup. Second, Face Check is rolling out slowly. Tinder says that it will come to additional states \"in the coming months,\" although the company did not provide an exact timeline.As for other apps, Match Group (which also owns OKCupid, Hinge, and Plenty of Fish, among others) says it will extend Face Check to additional platforms in 2026.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tinder Is Using Face Scans to Make Catfishing More Difficult",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8944MWRSPRM6C5WWMDHCE17/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-23T19:30:00.000Z",
      "dateModified": "2025-10-23T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]