[
  {
    "title": "Four Easy Ways to Clean Up Your Mac's Menu Bar",
    "url": "https://lifehacker.com/tech/four-easy-ways-to-clean-up-mac-menu-bar?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBG0ZXFR5XVAS47Y78MNP0Z5/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-02T18:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Pranay Parab\n             ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Pranay Parab\n                            \n    Table of Contents\n    \n        \n        When I switched to a Mac about a decade ago, I immediately fell in love with my MacBook's menu bar, and especially the various icons in its top-right corner. I've always enjoyed keeping useful menu bar apps there, such as clipboard managers, app launchers, or apps that update other apps. But unfortunately, if you've installed more than a few third-party apps on your MacBook, your menu bar might be pretty cluttered. It's nothing a quick clean-up can't fix, though, and now macOS ships with a few ways to help fix your messy menu bar.\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nJust as you'd remove unwanted items from your desk, you should periodically declutter the menu bar by removing apps that don't need to be there. This doesn't uninstall those apps, but it does free up some space in your menu bar. I do this for menu bar icons I never end up clicking. macOS 26 Tahoe has an easy way to remove apps from the menu bar. Follow these steps to do it:Click the Apple logo in the top-left corner of your Mac's screen.Go to System Settings > Menu Bar.In the right pane, navigate to the section called Allow in the Menu Bar.You'll see a list of apps that have a menu bar icon. You can uncheck any app you want to remove.Some apps also offer a way to remove their icons from the menu bar. Try checking your apps' settings to see if they let you remove their menu bar icons.\nNote that removing a menu bar icon for an app can sometimes cause the app to become \"headless,\" which means that it'll be running in the background but its icon won't show up in either the menu bar or the dock. This is fine for apps that you only need to configure once, but it can become a problem if you want to use the app regularly. In such cases, you can use a Spotlight search (Cmd + Space, or the magnifying glass icon in the menu bar) or alternatives such as Alfred or Raycast to search for the app's name and open it.\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nI'm sure you've noticed that the menu bar has more than just app icons. It's also home to the clock, wifi, volume controls, and more. You can easily add or remove these controls from the menu bar, as long as you're running macOS Tahoe. Here's how:\n            \n                What do you think so far?\n            \n        \nGo to System Settings > Menu Bar.Head over to the Menu Bar Controls section.Uncheck any control you want to remove from the menu bar.You cannot entirely remove the clock from the menu bar, but you can click Clock Options… and switch to Analog to make its icon a lot smaller.Drag and drop icons to rearrange the menu bar\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nYou also have the option of dragging and dropping your app icons around the menu bar, or using drag-and-drop to remove them from the menu bar. Just hold the Command key and drag any menu bar icon to a different position within the menu bar to rearrange it. To remove icons from the menu bar using drag-and-drop, hold Command and drag-and-drop them outside the menu bar.\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nTo tame the chaos at the top of your Mac's screen, I strongly recommend using a menu bar manager app. These apps will automatically show or hide menu bar icons based on triggers (eg: the battery icon will only show up when your MacBook's charge is below 25%), or add a second row of icons that's visible only when you click the menu bar. You'll need to try a couple of menu bar managers to decide which one works best for you. I've been using Barbee for some time, and its my current favorite.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Four Easy Ways to Clean Up Your Mac's Menu Bar",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBG0ZXFR5XVAS47Y78MNP0Z5/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-02T18:30:00.000Z",
      "dateModified": "2025-12-02T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "5 Little-Known Extensions That Make Safari Even Better",
    "url": "https://lifehacker.com/tech/little-known-safari-extensions?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBJWSH2Q396WMNPK4A15GW74/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-03T20:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n            Credit: miss.cabul / Shutterstock\n",
    "body": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n            Credit: miss.cabul / Shutterstock\n                            \n    Table of Contents\n    \n        \n        I've said it before and I'll say it again: Safari is better than Chrome. Apple's default browser runs faster, is less cluttered, offers privacy features Google would never contemplate, and doesn't try to cram AI down your throat.But that doesn't mean Safari is perfect. Like all browsers, it works better if you install the right extensions. Here are a few I've found in the past year or so that make the best browser even better.Block ads and other clutter\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nThe internet is increasingly useless without a good ad blocker, and the best ad blocker for Safari—which works on both macOS and mobile devices—is wBlock. This extension uses the built-in ad blocking functionality offered by Safari, which is much faster than the workarounds that extensions on browsers like Chrome need to use. It also supports a number of popular blocklists, with automatic updating. Or you can go even further and install Userscripts. Best of all, it's completely free. Try it out if you're not happy with your current ad blocker.\nAdd a dark mode to sites that don't have one\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nWe can argue endlessly about whether dark or light mode are better (and I have), but we can all agree it's annoying to be using dark mode only for the websites you're browsing to be white as snow. That's where Noir comes in. This extension forces Dark Mode in Safari on websites that otherwise don't offer the feature. It's a must-have for dark mode enthusiasts.Automatically open picture in picture when you switch tabsSafari, on mobile, will keep playing videos using picture-in-picture mode if you switch to another application or tab. The desktop version of Safari doesn't do this, which is a shame. Autopip is a Safari extension for Mac that adds this feature. The result: you can keep watching a video in the background while you're working in another tab or application. It's perfect if you're the sort of person who leaves a video playing while you're working on something else.\n            \n                What do you think so far?\n            \n        \nQuickly copy the URL for the current site\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nArc, the browser, is dead, and if I'm honest I only miss one feature: the ability to copy the URL of the current website using the keyboard shortcut Command-Shift-C. Yes, it's a very specific thing to miss, but I can't overstate how much of a habit this became for me. And I can keep the habit thanks to Supercopy, a Safari extension that adds the keyboard shortcut to Safari. Yes: that's all it does. I use it dozens of times every day, though, so for me it's well worth keeping around.Filter Reddit to be less rage inducing\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nI'd love it if I spent less time on Reddit and I'm sure I'm not alone. The problem: there's a mix of useful and rage-inducing stuff on that website. The good news is Protego lets you filter Reddit to be less infuriating. The idea is to pick a few subreddits you know, in your heart of hearts, you shouldn't be looking at. Do that and you'll be able to use Reddit without ending up down rabbit holes of rage and disgust. You can also filter out posts using keywords and hide promoted content. Trust me: you'll be happier.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "5 Little-Known Extensions That Make Safari Even Better",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBJWSH2Q396WMNPK4A15GW74/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-03T20:30:00.000Z",
      "dateModified": "2025-12-03T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google's December Security Update Fixes Two Zero-Day Exploits (and 105 Others)",
    "url": "https://lifehacker.com/tech/googles-december-security-update-fixes-107-vulnerabilities?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBFXJ9XJ5SF2EE3X0HJ7KDAM/hero-image.fill.size_1200x675.webp",
    "tag": "Life",
    "date": "2025-12-02T19:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: pcperle / Shutterstock\n   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: pcperle / Shutterstock\n                            \n            \n                Key Takeaways\n                                            The Android Security Bulletin for December patches 107 vulnerabilities.\n                                            Two of the flaws are zero-days that may have been exploited in the wild.\n                                            Android users should install security updates as soon as they are made available.\n                                    \n            \n    Table of Contents\n    \n        \n        In its Android Security Bulletin for December, Google is pushing an especially large number of updates to address vulnerabilities across different components—and two of the flaws may have been exploited in the wild. The December patch covers 107 bugs across Android Kernel, System, and Framework as well as Qualcomm, MediaTek, Arm, Unisoc, and Imagination Technologies components. The high-severity vulnerabilities include denial of service, elevation of privilege, and information disclosure flaws. There are also a handful of bugs labeled as \"critical.\" Two active exploitsTwo of the vulnerabilities addressed in the December update are zero-days, which are flaws that have been actively exploited or publicly disclosed before the developer makes a patch available. Google notes that both may be under \"limited, targeted exploitation.\" \nCVE-2025-48633 is an information disclosure vulnerability, while CVE-2025-48572 is an elevation of privilege flaw. Both affect the Android Framework in versions 13 through 16. Google hasn't disclosed any additional information about the flaws and how they may have been exploited (or by whom). However, as Bleeping Computer reports, similar bugs have been targeted in the past by commercial spyware operations and nation-state campaigns. \n            \n                What do you think so far?\n            \n        \nEnsure your Android device is up to dateYou should always implement security patches as soon as they're available, so if you see a notification to update, go ahead and follow the prompts to download and install it. You can also check for updates via a path like Settings > Security & privacy > System & updates > Security update. Note that this may be slightly different depending on your device, and you can always search \"update\" to locate it. This month's patches apply to Android Open Source Project (AOSP) versions 13, 14, 15, and 16 and are dated 2025-12-01 and 2025-12-05—the latter fixes all known issues. Pixel users (and the core AOSP code) receive patches from Google, and those on other Android devices from Huawei, LGE, Samsung, Motorola, and Nokia should see updates from their respective manufacturers around the same time. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google's December Security Update Fixes Two Zero-Day Exploits (and 105 Others)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBFXJ9XJ5SF2EE3X0HJ7KDAM/hero-image.fill.size_1200x675.webp"
      ],
      "datePublished": "2025-12-02T19:00:00.000Z",
      "dateModified": "2025-12-02T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Black Friday Cuts the Price of This Skullcandy Portable Speaker to Just $33",
    "url": "https://lifehacker.com/tech/skullcandy-terrain-mini-stacksocial-sale-black-friday-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K77J8707P2DN4PVQR5WQVMC1/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-28T21:25:12.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 28, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 28, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Skullcandy / StackSocial\n                            \n    Table of Contents\n    \n        \n        Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over. Follow our live blog to stay up-to-date on the best sales we find.Browse our editors’ picks for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.Subscribe to our shopping newsletter, Add to Cart, for the best sales sent to your inbox.Sales are accurate at the time of publication, but prices and inventory are always subject to change. If you’ve ever tried dragging a too-large speaker—or worse, relied on your phone’s tiny audio for sound projection—you should appreciate this sale on the Skullcandy Terrain Mini: It's palm-sized, no-frills, and currently on sale for $32.99 on StackSocial for Black Friday, with free shipping in the U.S. For under $35, you’re looking at an IPX7-rated waterproof speaker that won’t be damaged if it's dropped or gets wet. The sale runs through Cyber Monday.The Skullcandy Terrain Mini features Bluetooth 5.3, ensuring a stable connection within a 33-foot range. The battery is said to offer 14 hours of playtime, which should cover most day-long adventures or at least a solid workday playlist without needing a recharge. When the battery dies, it can be charged using a USB-C port, which is included, so you won’t need to dig through old cords. It also comes with a wrist strap that you can clip to a bag or swing around like a lanyard when you’re on the move. As far as sound quality goes, it's decent on its own, but the True Wireless Stereo feature allows you to pair it with a second unit for true stereo separation. You can also use Skullcandy’s Multi-Link to chain together up to 99 of these. Realistically, you’ll probably never do that, but the option’s there if you ever want to DJ a flash mob.\n            \n                What do you think so far?\n            \n        \nThat said, this speaker doesn’t punch far above its size. It’s built more for casual, portable listening than booming bass or high-volume precision. The fabric mesh helps with durability and sound clarity, but it won't replace your home speaker setup. If you’re in the market for a rugged little speaker that’s waterproof, rechargeable, and easy to toss in a bag, the Skullcandy Terrain Mini fits.\n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Black Friday Cuts the Price of This Skullcandy Portable Speaker to Just $33",
      "image": [
        "https://lifehacker.com/imagery/articles/01K77J8707P2DN4PVQR5WQVMC1/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-28T21:25:12.000Z",
      "dateModified": "2025-11-28T21:25:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I Bought a Smart Toilet for Black Friday, and It Has Been Revolutionary",
    "url": "https://lifehacker.com/tech/loniko-smart-toilet-deal-december-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBJY11ZSBYFGBBVAAPFBDC8Z/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-03T21:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n    We may earn a commission from links on thi",
    "body": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Daniel Oropeza\n                            \n    Table of Contents\n    \n        \n        Ever since I visited Japan in 2019, I've been converted into a loyal bidet user. I started with a basic bidet added onto a standard toilet, but I always knew the time would come when I would make a big upgrade. That time was this Black Friday when I pulled the trigger on the Loniko Smart Toilet, and I'm so glad I did. It's $444.99 (originally $549.99) after using the additional $30 on-page coupon, and it's worth every penny.\nMy first experience with the Loniko Smart Toilet was over Thanksgiving, which I spent at my parents house; they were very excited for my brothers and me to try their new splurge in their guest bathroom: the toilet. The lid opened when I walked into the bathroom, welcoming me to sit on its heated seat. As I said, I've been using bidets in my home for years, but never one like the Loniko. The toilet comes with a remote you can prop on your wall for easy access. You can control the bidet's stream and direction, turn on the dryer, which was surprisingly effective and gentle, and do all the things the toilet does automatically, like opening and closing the lid, flushing, etc. After realizing that most decent bidets cost upwards of $300, I decided to snatch this toilet when it went on sale during Black Friday.Being able to control the temperature of the water in the stream is a huge deal for me, especially in the winter when the water in my home is extremely cold. Cleaning the toilet is also pretty easy. It has a skirted design, so there are no nooks and crannies near the base where dirt can get trapped. The toilet also automatically cleans itself after each flush. \n            \n                What do you think so far?\n            \n        \nKeep in mind you'll need an outlet close by to enable all its fancy features. You can also choose to get a tankless model, which results in quieter flushes, saves water and energy, and looks more modern, but it's harder to install (I went with the regular tank toilet and it flushes quietly enough for me).\n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I Bought a Smart Toilet for Black Friday, and It Has Been Revolutionary",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBJY11ZSBYFGBBVAAPFBDC8Z/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-03T21:00:00.000Z",
      "dateModified": "2025-12-03T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here's When You Can Buy Samsung's New 'TriFold' Smartphone",
    "url": "https://lifehacker.com/tech/heres-when-you-can-buy-samsungs-new-trifold-smartphone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBG4BS2N3EY41B7XK370C1HJ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-02T21:42:30.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Samsung\n                  ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Samsung\n                            \n            \n                Key Takeaways\n                                            Samsung announced the Galaxy Z TriFold on Monday, its first foldable with three displays.\n                                            The foldable has a 6.5-inch display on the front, but unfolds twice to reveal a 10-inch display.\n                                            The device will launch first in South Korea this month, and will ship in the U.S. in the first quarter of 2026.\n                                    \n            \n    Table of Contents\n    \n        \n        There was once a time when foldable smartphones seemed like some futuristic idea. The concept of unfolding a smartphone to reveal a tablet-sized display was simply too cool to be possible. Of course, not only are foldables a reality today, there are a number of models out there to choose from. Samsung released its first Galaxy Z Fold back in 2019, and while the foldable market isn't nearly as hot as traditional smartphones, they are very much an option for anyone who isn't afraid of the inflated MSRP.   On Monday, Samsung unveiled its latest foldable smartphone: the Galaxy Z TriFold. Unlike the Z Fold, however, this new device doesn't have two displays: It has three. The appropriately named TriFold unfolds twice to reveal \"one\" large 10-inch display. That's an additional two inches when compared to the Galaxy Z Fold 7's unfolded display size. \n    \n            \n            \n                                        Credit: Samsung\n                    \n    \nSamsung claims when the TriFold is fully open, it performs on par to three 6.5-inch smartphones lined up in a row. The company has some examples of how you can take advantage of that screen real estate: You could have three windows open at once, all the same uniform design; two windows, one smaller and one larger; or one huge window with multiple on-screen elements of its own. You can also watch videos on platforms like YouTube while reading comments at the same time. \nPlus, the TriFold acts as its own Samsung DeX workstation. You can treat it like a small personal computer, saving up to four workspaces that can each run five apps at once. That means you can switch between as many as 20 apps all running at the same time, across four preset workspaces. You can also connect the TriFold to an external monitor, plus pair the foldable with a mouse and keyboard for a more traditional computing experience.  TriFold Samsung says the TriFold uses a \"refined\" version of its Armor FlexHinge to support the new triad displays. It uses two hinges of different sizes to stabilize folding and to reduce the gap between them, and adds a thin piece of metal to protect the folding mechanism. The design prevents the displays from actually touching each other when closed, which should reduce the chance of cracks or damage.Galaxy Z TriFold specsWhile we haven't seen much of the phone in action yet, we do have the device's on-paper specs. Here's what you can expect:\n            \n                What do you think so far?\n            \n        \nMain screen: 2160 x 1584 10-inch AMOLED, 120 Hz refresh rate, 1600 nits of peak brightnessCover screen: 2520 x 1080 6.5-inch AMOLED, 120 Hz refresh rate, 2600 nits of peak brightnessDimensions: 159.2 x 75.0 x 12.9 mm (folded); 159.2 x 214.1 x 3.9 mm (unfolded) Weight: 309gProcessor: Snapdragon 8 Elite Mobile Platform for GalaxyRear cameras: 12MP, Dual Pixel AF, F2.2 (Ultra-wide); 200MP Quad Pixel AF, optical image stabilization (OIS), F1.7, 2x optical zoom (Wide); 10MP, OIS, F2.4, 3x optical zoom, 30x digital zoom (Tele)Front cameras: 10MP selfie camera, F2.2 (cover screen); 10MP main camera, F2.2 (main screen)Memory and storage: 16GB RAM, with either 512GB or 1TB of internal storageBattery: 5,600 mAhCharging: Super-Fast Charging 2.0 (45W); Wired charging up to 50% in 30 minutes (45W); Fast Wireless Charging 2.0 (15W)Water resistance: IP48Network and connectivity: 5G, LTE, Wi-Fi 7, Bluetooth 5.4  When is the Galaxy Z TriFold available?Again, this isn't a concept or prototype: The TriFold is just about ready for launch. Customers in South Korea are the first to get a chance to try the TriFold, as Samsung is planning on a Dec. 12 release.This is the only firm release date that Samsung currently has for the TriFold, but that doesn't mean the rest of the world is in the dark. Samsung says users in China, Taiwan, Singapore, and the UAE will have access shortly after that Dec. 12 release, while those of us in the U.S. will have our shot in the first quarter of 2026.Release dates can change, but if Samsung sticks to this plan, we should be able to check out the TriFold here by the end of March. We don't know the U.S. price at this time, but we do know the Korean price: KRW 3,590,400. That converts to just shy of $2,450. For reference, the Z Fold 7 lists for $1,999.99. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's When You Can Buy Samsung's New 'TriFold' Smartphone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBG4BS2N3EY41B7XK370C1HJ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-02T21:42:30.000Z",
      "dateModified": "2025-12-02T21:42:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Your Apple Music Replay 2025 Is Live",
    "url": "https://lifehacker.com/tech/your-2025-apple-music-replay-is-live?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JE6J21FWJFV1ZH8WHWBSQXDC/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-02T16:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Lifehacker\n               ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Lifehacker\n                            \n            \n                Key Takeaways\n                                            Apple Music Replay 2025 is now live.\n                                            You can access your Replay from the Apple Music app on iPhone and iPad, or from the web app on your computer.\n                                            Like Spotify Wrapped, Replay features a number of your listening statistics over the past year, including stats from years prior.\n                                    \n            \n    Table of Contents\n    \n        \n        2025 was another big year for music. We had new albums from Taylor Swift, Sabrina Carpenter, Tyler the Creator, and, of course, Huntrix (of KPop Demon Hunters fame), just to name a few. You may have listened to any number of new albums that came out this year, mixed in with music that released any time over the last century. You might not even remember what you were listening to back in January. But Apple Music remembers, and will serve in up to you in your 2025 Apple Music Replay. Like last year, your Replay is available in your Apple Music app. If you're relatively new to the streaming service, that might sound obvious—especially if you've previously used a service like Spotify that offers a similar annual wrap-up. But this wasn't always the case: For much of Apple Music Replay's brief history, you had to visit a separate website, music.apple.com/us/replay, and log into your Apple Music account in order to access your recap. It seemed silly, considering Spotify Wrapped is very much an in-app experience, but it took Apple until 2024 to get with the program.That said, it seems Apple has made additional improvements this year. In 2024, the experience was essentially contained in an in-app browser, where it loaded your Apple Music Replay with the same UI as the website. This year, Replay is a native function of the Apple Music app, at least on iOS. \nHow to access your 2025 Apple Music Replay \n    \n            \n            \n                                        Credit: Lifehacker\n                    \n    \nYou can still access your Replay from the official website, but the easiest way to review it is from the app on your iPhone or iPad. Open the app on your device of choice. Make your way to the Home tab if the app doesn't open there automatically, then tap or click on the large Replay option, which should appear at the top left. (This option also shows up in the Music app for Mac, but it will automatically direct you to the website in your browser.) Whichever way you access it, you'll be able to see all of your Replay months here (excluding December, of course, since the month just started), but let's focus on 2025 as a whole.Unpacking your Apple Music ReplayAt the top, you'll find a Replay your year in music tile. Tap Play Your Highlight Reel and Apple Music will walk you through your year. Here's what you can expect, at least based on my results: \n            \n                What do you think so far?\n            \n        \nFirst, you'll see your total listening minutes, complete with both a collage of the albums you listened to most, and one of your top-played songs playing in the background. Next, you'll see your top artist of the year, with a collage of their images and a relevant song playing in the background. The following slide is a breakdown of your top artist by monthThe next will show if any artist was your number one for multiple months. Next, you'll see the number of songs you listened to, complete with your top song of the year. Then you'll see the number of albums you listened to, and which one was your top choice. Second to last, Apple Music tells you your top genres of the year, including the one you listened to mostOne final slide summarizes the whole year.You don't have to watch the highlight reel to see these stats: Once out of the reel, you can scroll through the Replay page to see everything covered in the slides, plus additional stats. Mine shows top artists, songs, and albums by month—so I can see which artist defined March (Will Stratton), which song I listened to most in August  (\"The Subway\" by Chappel Roan), and which album I played on repeat in May (\"Tunnel Vision\" by Beach Bunny). I also see top playlists of the year; different listening milestones, like Minutes Listened, Artists Played, and Songs Played; stats from last year's Replay; and a playlist of my top songs of the year. Many of these stats, both in and out of the highlight reel, are easily sharable. You'll see a share icon next to any stat you can export, which makes it simple to share fun graphics with friends or on social media. I've already blown up the group chat with some of my stats here, and I expect many of you to do the same. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Your Apple Music Replay 2025 Is Live",
      "image": [
        "https://lifehacker.com/imagery/articles/01JE6J21FWJFV1ZH8WHWBSQXDC/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-02T16:30:00.000Z",
      "dateModified": "2025-12-02T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Red Dead Redemption' Is Available on Mobile for the First Time Ever, but There's a Catch",
    "url": "https://lifehacker.com/tech/red-dead-redemption-available-on-mobile-for-first-time?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBJEBGJ5W2VJA4G5JZ84WXN1/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-03T16:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n    We may earn a commission from links on thi",
    "body": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n    We may earn a commission from links on this page.\n    \n            Credit: Rockstar Games\n                            \n            \n                Key Takeaways\n                                            \"Red Dead Redemption\" is finally playable on mobile devices for the first time in 15 years.\n                                            Rockstar announced the news on Tuesday, alongside free upgrades to the PS5, Xbox Series X|S, and Switch 2 versions of the game.\n                                            Mobile players will have the choice of paying $39.99 for the game, or playing for free—assuming they have an active Netflix subscription.\n                                    \n            \n    Table of Contents\n    \n        \n        Rockstar fans might be all-in on waiting for GTA VI, but Grand Theft Auto is far from the only big title the company makes. One of Rockstar's most impactful games, Red Dead Redemption, turned 15 in May. All these years later, it's still very much worth your time—if critics and fans have anything to say about it. On Tuesday, Rockstar announced some big news for the first Red Dead: First, anyone who owns a copy of the game for PS4, Xbox One, and Nintendo Switch, can now upgrade to the PS5, Xbox Series X|S, or Nintendo Switch 2 versions for free. That includes upgrades like 60 fps, upgraded visuals, support for HDR, and 4K resolution—at least on PlayStation and Xbox. But console gamers aren't the only ones impacted here. Rockstar also revealed that Red Dead Redemption is now available on mobile for the first time ever. This could open the game up to a whole new market of players who don't own a console—if your primary gaming device is your smartphone or tablet, you can now check out Red Dead Redemption in its entirety. Depending on your device, you may even have access to a \"performance mode\" that boosts the frame rate of the game. Otherwise, it appears locked to 30 fps—though that might not be as noticeable on mobile as it would on a TV.  \nRed Dead on mobile is either free, or very expensiveHowever, there's a bit of a catch here. Depending on your current subscriptions, Red Dead Redemption's mobile port can either be completely free, or quite expensive. If you look at the listings for the game on the Google Play Store and iOS App Store, you'll see the game currently costs $39.99. That's pricey for a mobile game, even a console port. While there aren't many games as large as Red Dead with mobile versions, the ones that are aren't quite this expensive. Stardew Valley is $4.99; Minecraft is $6.99; GTA: San Andreas is $6.99 (though the \"Definitive\" edition is $19.99); Hitman: Absolution is $14.99. $39.99, by comparison, is steep.I'm not saying Red Dead isn't worth $40, but you need to be sure you want to commit to the mobile port of the game—especially if you have other means of playing it. The PS4 version is currently $29.99 at Best Buy: If you have either a PS4 or PS5, you can enjoy the game on your TV for $10 less. Plus, PS5 owners can upgrade to the higher-performing version for free.\n            \n                What do you think so far?\n            \n        \nSpeaking of free, however, there is a way to play Red Dead Redemption on the go without spending anything—or, at least, anything extra. If you have an active Netflix subscription, you can download the Netflix version on your iPhone or Android free of charge. It's the same game, just validated through your Netflix account—so if you have a Netflix subscription, I highly recommend you download this version before you spend money on the game.  If it sounds weird that Netflix is offering Red Dead for free, I don't blame you. However, this isn't really something new for the company. Netflix has been offering free games for subscribers for four years now, and while some of them are Netflix-owned, others are major titles the company licenses. That includes games like Into the Breach, Moonlighter, Heads Up!, and, of course, Red Dead Redemption. Netflix doesn't even require you to have a specific subscription to access these games: All subs, including its cheapest \"With Ads\" plan, can play.If you've never played Red Dead Redemption, the cheapest way to experience the game right now is to subscribe to Netflix for a month. You could pay $7.99 for the company's least expensive plan, and after catching up on Stranger Things, you could play through all of Red Dead. Not a bad deal. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Red Dead Redemption' Is Available on Mobile for the First Time Ever, but There's a Catch",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBJEBGJ5W2VJA4G5JZ84WXN1/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-03T16:30:00.000Z",
      "dateModified": "2025-12-03T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "It's Easier to Fall for a Bank Fraud Scam Than You Think",
    "url": "https://lifehacker.com/money/bank-fraud-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBGJT85Y2K9RYW909X3WDXDV/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-03T14:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n            Credit: BreizhAtao/Shutterstock \n ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n            Credit: BreizhAtao/Shutterstock \n                            \n            \n                Key Takeaways\n                                            The FBI's Internet Crime Complaint Center (IC3) is warning consumers about a type of fraud in which threat actors pretend to be from trusted financial institutions.\n                                            Most account takeover scams use social engineering: a series of tactics designed to manipulate you.\n                                            Don't blindly trust someone claiming to be from your bank, and never hand over your credentials.\n                                    \n            \n    Table of Contents\n    \n        \n        The FBI's Internet Crime Complaint Center (IC3) is warning consumers about a type of fraud in which threat actors pretend to be from trusted financial institutions in order to obtain login credentials and gain access to financial and personal data. The consequences are high: With stolen credentials, scammers can gain full control of your accounts and your money. According to the FBI advisory, criminals will quickly wire funds from your bank to cryptocurrency wallets, making the money nearly impossible to trace and recover, and lock you out of your account in the process. Here's how account takeover scams work—and how to avoid becoming a victim. \nAccount takeover scams may impersonate your bankMost account takeover scams use social engineering: a series of tactics designed to manipulate you into giving up personal information, downloading malware, or paying money to bad actors. Scammers impersonate financial institution employees as well as customer support and technical support staff and reach out to targets via text, call, or email to say that their account has been compromised in some way.They may tell you that there have been fraudulent charges on your account and send you a link to report the fraud—but this is actually a phishing site designed to harvest your login credentials. They may ask directly for your username, password, or multi-factor authentication (MFA) code over the phone. In some cases, they may even claim that your information was used to buy firearms and pass you off to a second scammer impersonating law enforcement. They're counting on you to feel fear and confusion and act quickly to \"resolve\" the issue by handing over your information. The FBI has also identified a version of account takeover using search engine optimization (SEO) poisoning, in which scammers buy ads that appear to be for legitimate businesses but actually allow them to place malicious links to spoofed bank websites higher in search results. How to avoid falling for account takeover scamsWhile being targeted for an account takeover may be unavoidable, there are a few red flags that can help you identify the fraud before it goes south. \n            \n                What do you think so far?\n            \n        \nFirst, you should always be wary of calls, texts, emails, and other communication (such as social media messages) from someone claiming to be from your bank or creditor, especially if they ask for personal information like your username, password, or time-based one-time password (TOTP). Reputable institutions will not contact you to request your credentials or other sensitive data—so these are almost certainly phishing attempts. You should also be wary of trusting websites that look like they belong to your financial institution, especially if you click to them from a browser search. Cybercriminals can easily build convincing (but spoofed) websites and place the malicious links at the top of search results. Bookmark the trusted link rather than going through a search engine, or use the verified app on your mobile device. Always avoid clicking directly from unsolicited communication, and check URLs and email addresses carefully, as scammers can also use homographs to hide malicious links.  Finally, protect your personal information. Use complex, unique passwords stored securely (such as in a password manager), enable a stronger form of MFA (and never give away codes), and limit what you share online. Scammers may use what you've posted—like your date of birth, pet's name, or information about family members—to get past your security questions, guess your password, or make an impersonation attempt sound more convincing. The IC3 also recommends monitoring your financial accounts for irregularities, such as unauthorized withdrawals or transfers, which may be a sign of an account takeover. Consider setting up transaction alerts with your financial institutions to be notified immediately of any suspicious activity. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "It's Easier to Fall for a Bank Fraud Scam Than You Think",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBGJT85Y2K9RYW909X3WDXDV/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-03T14:00:00.000Z",
      "dateModified": "2025-12-03T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I Let Android AI Summarize My Notifications for a Day, and Here's What Happened",
    "url": "https://lifehacker.com/tech/android-ai-notification-summaries?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBJ5NWQR0BXRDNFD9BQ7R1GS/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-03T14:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n            Credit: Google\n                   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n            Credit: Google\n                            \n    Table of Contents\n    \n        \n        AI is everywhere! Writing essays, editing photos, producing social-media slop, doing your browsing for you, making plenty of mistakes—and now, if you've installed the latest Android 16 update (currently rolling out to Pixel phones), summarizing your notifications so you have less text and fewer alerts to wade through.The new summarization feature, as per Google, will \"help you cut through the clutter and stay focused,\" and give you \"quick understanding and context at a glance.\" I'm all for cutting through the clutter, so as soon as the update landed on my own Pixel device, I decided to enable the feature and see how useful it really is.How AI summaries work, and how to turn them on\n    \n            \n            Enabling the feature on an Android phone.\n                                        Credit: Lifehacker\n                    \n    \nAI notification summaries won't automatically take over your phone, after the update—you need to enable them manually. From Settings, head to Notifications, then tap Notification summaries to turn this on. The same screen lets you choose which apps you want notifications summarized for.\nThere are actually two parts to the new update: the actual notification summaries, and what Google is calling a \"notification organizer.\" This organizer is designed to group and silence lower-priority notifications (including social alerts and promotional messages), though there doesn't appear to be a separate toggle switch for this.Of course, other Android phone makers will be able to implement this in whatever way they choose. It looks as though Samsung is testing the feature with the One UI 8.5, which should be launching in beta any day now. A full release of the software is expected early next year, alongside the Galaxy S26 phones.Using AI notification summaries for 24 hoursReady to banish notification clutter from my life, I turned on AI summaries for all my apps to see exactly how this worked. For a start, it doesn't apply to all apps, at least not yet: My Snapchat and Instagram alerts remained the same as always, so further updates will be needed from Google and app developers before this is something you see everywhere.The apps I saw summaries for most often were Google Chat, WhatsApp, and Slack—almost always in group conversations, and some of the time for single messages (the length of the message seems to affect this somehow). And the summaries were ... mostly okay. They tended to catch the gist of who had said what, and in that sense were an accurate recap of what I was missing by not actually opening these apps.\n    \n            \n            The summaries work, up to a point.\n                                        Credit: Lifehacker\n                    \n    \nThese summaries did update as more messages were added, but the summary preview window is only a couple of lines long—so once multiple people start piling into a group chat, the summary isn't going to be able to cover everything. From the lock screen and pull-down notification shade, it's possible to expand notifications to see full messages (as usual), and then minimize them back to the summary view again.\n            \n                What do you think so far?\n            \n        \nThere was one occasion when the AI notification summaries got confused by the Lifehacker slack and by the various @mentions included—attributing a message to the person who had been tagged in a message, rather than the person who had sent it. On the whole, though, there were no obvious mistakes, just certain details left out from summaries of longer chats that I would've liked to have known about.Now I've tested this out, I'm going to turn it off again, for a couple of reasons—and inaccuracy isn't really one of them (though that might certainly creep in). First, given the small size of the preview window, I'm not sure an AI summary is any more useful than the first couple of lines of text you get as standard anyway. That's usually enough for me to tell whether or not a message is important before opening it.\n    \n            \n            This Slack summary wasn't fully accurate—and Snapchat alerts weren't affected.\n                                        Credit: Lifehacker\n                    \n    \nSecond, I'm not sure I really want my messages and group chats summarized—at least not the important ones. If a friend, family member, or work colleague has something to tell me, I'd like to know exactly what it is, rather than reading a précis. It feels like AI is being used just for the sake of it—and not for the first time.I didn't see any evidence of the notification organizer in action, by the way, perhaps because of the way I've got my Android notifications set up—there are now a host of granular options for alerts in Android, for silencing and dismissing notifications. This feature sounds vaguely useful, but again, I'm not sure I'm ready to hand over the job of judging how important notifications are over to AI just yet.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I Let Android AI Summarize My Notifications for a Day, and Here's What Happened",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBJ5NWQR0BXRDNFD9BQ7R1GS/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-03T14:30:00.000Z",
      "dateModified": "2025-12-03T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube Has a New Annual Recap",
    "url": "https://lifehacker.com/tech/youtube-introduces-recaps?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBFTH1GHZ9H6P0HEEM55KYJ8/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-02T17:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: YouTube\n                  ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: YouTube\n                            \n            \n                Key Takeaways\n                                            YouTube is introducing a Spotify Wrapped-style recap for videos you watched in 2025.\n                                            You can view your recap in the mobile app or on desktop.\n                                            There's also lists for 2025's overall trending topics and creators.\n                                    \n            \n    Table of Contents\n    \n        \n        Taking a cue from YouTube Music and YouTube Gaming, YouTube as a whole is now finally introducing a Spotify Wrapped-style annual recap. Simply called YouTube Recap, this feature will break down your watching habits across all categories in 2025.According to YouTube, YouTube Recap will show \"a set of up to 12 different cards,\" with spotlights on \"your top channels, interests, and even the evolution of your viewing habits.\" It'll draw its data from both long-form and short-form videos as well as downloaded videos, but it'll only track videos you watched while signed in to your account.The company is also dividing its viewers into \"personality types\" based on what they watch, such as \"the Trailblazer\" or \"the Skill Builder.\" There's a whole breakdown of what these mean over on a support page, but as an example, if you're a \"Sunshiner,\" that means \"You're drawn to content that spreads positivity and good vibes.\" Google says that the most common personality types this year were \"the Sunshiner,\" \"the Wonder Seeker,\" and \"the Connector,\" and that personalities like \"the Philosopher\" and \"the Dreamer\" were more rare. So I guess you can brag about that if you get one of those.\nIf you listen to a lot of music on YouTube, meanwhile, YouTube Recap will also pull some data from YouTube Music, and can show you your top artists and songs of the year. For more detail, you'll need to visit the YouTube Music app and look at your YouTube Music recap proper.YouTube Recap should be available in North America starting today, although it might take some time until you see it—I can't seem to access mine yet. For global viewers, YouTube says it will \"roll out to the rest of the world this week.\" You'll be able to view it in 17 languages, with a full list available here.I'll keep checking for mine throughout the day, but for now, here's how to find your YouTube Recap once it goes live.How to view your YouTube RecapAccording to YouTube's instructions, YouTube Recap is available on both desktop and in the mobile app, and will show up as a banner either on your homepage or in your \"You\" tab. \nOn mobile, you can get to your \"You\" tab by tapping the button in the bottom-right corner with your profile picture on it, while on desktop, you'll need to click the \"You\" subheading in the pane on the left-hand side of your screen. Or, you can just navigate to youtube.com/recap and let your browser do the work for you (if on mobile, it'll direct you to the appropriate section of the app). \n            \n                What do you think so far?\n            \n        \nNote that you'll need to be signed in for any of this to work. You might also need to update your YouTube app if you're still having trouble. Google says you need version 18.43 or newer to see your Recap.Once you've viewed your recap, you'll also be able to share it, by tapping or clicking the Share button in any of your recap cards. Or, you can save it by tapping the download button to the left of the Share button.YouTube's most popular topics and creators in 2025\n    \n            \n            \n                                        Credit: YouTube\n                    \n    \nAlongside YouTube Recap, YouTube has also released a more general look at trending topics, creators, and songs in 2025. The most popular topic in 2025 was apparently Squid Game, while MrBeast was the top creator (I have a feeling those might be connected). The Joe Rogan Experience is at the top of the podcast list, and interestingly, there are separate trending lists for shorts and full-length videos, with Forrest Frank's YOUR WAY'S BETTER topping Shorts and Bruno Mars and Lady Gaga's Die With a Smile taking the crown for full-length videos. KPop Demon Hunters is the only topic where you'll see overlap between the Shorts and full-length lists, with Soda Pop appearing on both.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube Has a New Annual Recap",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBFTH1GHZ9H6P0HEEM55KYJ8/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-02T17:00:00.000Z",
      "dateModified": "2025-12-02T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What People Are Getting Wrong This Week: When Was Jesus Actually Born?",
    "url": "https://lifehacker.com/entertainment/when-was-jesus-actually-born?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBG8E4ZHG6ND650JE7N9RCQV/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-02T21:00:58.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Volodymyr TVERDOKHLIB - Sh",
    "body": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Volodymyr TVERDOKHLIB - Shutterstock\n                            \n    \n            \n            \n        \n            The internet is full is misinformation, conspiracies, and lies. Each week, we tackle the misunderstandings that are going viral.\n        \n    \n    Table of Contents\n    \n        \n        It's Christmas time, and people believe a lot of inaccurate things about the holiday, so for the next few weeks, I'm going to take a look at the truth behind Christmas mythology, starting with the biggest misconception of them all: Not \"how can the North Pole support an industrial infrastructure large enough to build toys for all the world's children,\" but whether Jesus was really born on Dec. 25.  Was Jesus born on Dec. 25?Most Christians celebrate the Baby J's birthday on Dec. 25, but he probably wasn't born on that day. The Bible doesn't provide a specific date, neither does any historical document, and early Christians didn't even celebrate Christmas. So Jesus could have been born on Dec. 25, but he could have been born on March 7, or any other date. Here are some popular alternatives for Jesus' birthday:January 6 or 7—favored by  Orthodox ChristiansNovember 18—according to Clement of AlexandriaMarch or April—based on Biblical passages describing shepherds watching their flocks.September or October—based on John the Baptist's father's membership in \"The Order of Abijah.\" This theory is too complex to explain here, but it's fascinating, and I urge you to fall into the priestly division of Abijah rabbit hole like I did. If Jesus wasn't born on Dec. 25, why is it Christmas?No one knows for sure why we have mostly landed on Dec. 25 as Jesus' birthday, but there are theories. Here are two of the most common:\nSolar Theory: The first solid reference to Jesus being born on Dec. 25 was in the Calendar of Filocalus, a Roman almanac written in 354. The calendar denotes Dec. 25 as both Christ's birth date and the date of an older holiday, \"The Birthday of the Unconquered Sun,\" suggesting both holidays were celebrated on the same day in Rome (or were at least listed that way by the 4th century). The theory is that Romans were like \"we celebrate the day anyway\" and early Christians were all \"we got your unconquered sun right here\" and accepted the 25th to celebrate, eventually outlasting the Romans and leaving the pagan holiday a footnote that no one celebrates besides my friend Gary.Calculation Theory: Early Christians believed that prophets and martyrs died on the same day they were conceived—I assume a second-century skeptic carved a scathing tablet debunking this, but it's what many early Christians believed. Jesus' martyrdom/conception was said to have happened on March 25, so his birth would be on Dec. 25 (assuming he was punctual.) \n            \n                What do you think so far?\n            \n        \nThere are other theories—the date was chosen to coincide with Hannukah, Saturnalia, the re-dedication of the Second Temple in Jerusalem, or the Eagles/Bears game in 2006. The point is we don't actually know, but it's probably a \"little from column A, a little from column B\" situation. The Calculation Theory provided a theological justification for the date, and the Solar symbolism provided cultural relevance; both Jesus and Santa like when we work together, after all. What is the true meaning of Christmas?Ultimately, the murkiness around Jesus' exact birthday isn't important. Christmas doesn't exist because a Roman bureaucrat wrote it on a calendar or some pagans wanted to blow off steam. Whether you celebrate Christmas as the birthday of Christ or a mid-winter celebration of light, the holiday's meaning was been built collectively over centuries, and is molded and changed constantly to fit the needs and desires of the people who celebrate it. Whether that celebration is a somber religious expression or listening to Mariah Carey while drinking eggnog, it's all good. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What People Are Getting Wrong This Week: When Was Jesus Actually Born?",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBG8E4ZHG6ND650JE7N9RCQV/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-02T21:00:58.000Z",
      "dateModified": "2025-12-02T21:00:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google's New 'Call Reason' Feature Lets You Mark Outgoing Calls As Urgent",
    "url": "https://lifehacker.com/tech/try-google-call-reason-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBJYRR2BFD3PR5CE87QNGRP4/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-03T21:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n            Credit: Tada Images/Shutterstock\n ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is rolling out a new feature for its Phone app that lets you mark a call as urgent.\n                                            \"Call Reason\" will tell your friends and family a call is urgent, possibly improving the odds they pick up the phone.\n                                            The feature is rolling out in beta in Google's Phone app for Android.\n                                    \n            \n    Table of Contents\n    \n        \n        It's tough to get people to answer the phone—though I'm not really blaming those who don't pick up. We are so inundated with spam calls these days that refusing to answer incoming calls en masse isn't actually a bad strategy. When that call could be someone trying to break into your bank account, or alerting you to fraudulent credit card charges that never happened, perhaps it's best to just wait for friends and family to text instead. But let's say the call is from you to someone you know and trust, and let's assume they see it's you who's calling. Even though they know the call isn't spam, there are still plenty of reasons someone won't pick up the phone—including, of course, because they don't actually want to talk right now. But if you really need to get a hold of someone and don't want meetings, commutes, or the lack of desire for a phone call to get in the way, Google is currently working on a solution you can try right now. The new feature, named \"Call Reason,\" is designed to separate important phone calls from the rest. When you start dialing a number, Google will give you the option to mark the call as urgent. If you choose to do so, the person you're calling will see a pop-up reading \"It's urgent!\" on the call screen. Hopefully, that pop-up will encourage them to answer; however, I imagine they'll stop picking up if you start using it too often. \nThat said, not everyone ignores calls on purpose. If you aren't by your phone when it goes off, or if it's on silent in your pocket or bag, you obviously won't catch the urgent tag on the call screen. In that case, Android adds the urgent tag to the missed call in their recipient's call history. As long as the person you're trying to reach checks out their missed calls, they should see that this one was marked urgent—though if it's a real emergency, they might've received extra calls and messages from you in the interim anyway. It seems Google has been working on this feature for some time. Android Authority previously spotted something called Expressive Calling in the Phone app's APK, which would let the caller add animations and emojis to calls. In addition to that functionality, however, was the ability to flag the reason for a call when dialing. \n            \n                What do you think so far?\n            \n        \nHow to try Call Reason Google is still testing the Call Reason feature, but anyone using the current version of the Google Phone app will be able to try it out. (It's still rolling out, though, so you may not see it yet.) The feature also only works with saved contacts, and when calling Android users who have Google's Phone app set as the primary calling app.  When Call Reason does show up on your phone, you'll see it appear after placing your call. The UI says \"Mark call as urgent?,\" with a prompt letting you know that the call will ring through and show the call is urgent. Tap \"Notify,\" and you're set. Once the recipient sees the call, they'll see the \"Incoming call\" banner replaced by an animated \"It's urgent!\" pop-up. It's a fun design, but perhaps a bit too fun, when you're likely using this in important situations.  \n    \n            \n            \n                                        Credit: Google\n                    \n    \nAlongside Call Reason, Google announced a number of new features for Android 16. There are now improved parental controls locked behind a PIN of the parents' choosing; new UI customization options, like expanded dark mode support and new custom shapes for home screen icons; and the continued roll out of Google's AI notification summaries, which Lifehacker writer David Nield hasn't found all that useful yet.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google's New 'Call Reason' Feature Lets You Mark Outgoing Calls As Urgent",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBJYRR2BFD3PR5CE87QNGRP4/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-03T21:30:00.000Z",
      "dateModified": "2025-12-03T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Black Friday Deal Cuts the Price of AdGuard's Family Plan to Just $16",
    "url": "https://lifehacker.com/tech/adguard-family-plan-stacksocial-sale-black-friday-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K6FZHCGFJRJ42A8QBC540QX6/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-11-28T21:31:49.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        November 28, 2025\n    \n    We may earn a commission from links on th",
    "body": "\n        \n    \n                                        \n        \n        \n        November 28, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: AdGuard / StackSocial\n                            \n    Table of Contents\n    \n        \n        Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over. Follow our live blog to stay up-to-date on the best sales we find.Browse our editors’ picks for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.Subscribe to our shopping newsletter, Add to Cart, for the best sales sent to your inbox.Sales are accurate at the time of publication, but prices and inventory are always subject to change. If you’re tired of websites bombarding you with banners, pop-ups, trackers, and ads, this AdGuard family plan is worth a look: It's a lifetime subscription currently on sale for just $15.97 for Black Friday by applying the promo code FAMPLAN. The sale runs through Cyber Monday. It's a lifetime of ad-blocking for less than what some services charge per month, but it's only available to new users, and you’ll need to redeem your code within 30 days of buying it.You can access and utilize this plan across nine devices, making it a solid pick for families or anyone juggling multiple gadgets. It works on Windows (7 and later), macOS (10.15 and later), iOS (12 and later), and Android (7 and later), covering most modern setups. AdGuard goes beyond standard ad-blocking by filtering out annoying pop-ups, stopping autoplay videos, and blocking phishing attempts. It also reduces trackers that follow you around the internet, which means less targeted advertising and a little more privacy. Unlike browser-based ad blockers, AdGuard operates at the network level, allowing it to block ads in apps and games as well. Setup is straightforward—you’ll receive your redemption code via email immediately after purchase, allowing you to start using it right away.\n            \n                What do you think so far?\n            \n        \nIf you’re already an AdGuard user, this deal won’t apply to you, but for new users looking for a one-time payment solution to dodge ads and boost privacy across multiple devices, this might be one of the best Black Friday deals out there right now.\n            \n                    Our Best Editor-Vetted Cyber Monday Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Black Friday Deal Cuts the Price of AdGuard's Family Plan to Just $16",
      "image": [
        "https://lifehacker.com/imagery/articles/01K6FZHCGFJRJ42A8QBC540QX6/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-11-28T21:31:49.000Z",
      "dateModified": "2025-11-28T21:31:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Four-Pack of Tile Trackers Is Nearly Half Off Right Now",
    "url": "https://lifehacker.com/tech/tile-mate-tracker-deal-december-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBJRVPVF327X935CFBZ51P0G/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-03T20:06:10.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n    We may earn a commission from links on thi",
    "body": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Even though Black Friday is over, there are still several deals still available. One of them is this Tile Mate Tracker 4-Pack, which just dropped to its lowest price ever at $47.99 (originally $83.99). A must for anyone prone to misplacing their essentials, these trackers also make a compact and low-cost stocking stuffer for the forgetful. \nThese lightweight trackers make losing items like your keys, wallet, and bag a lot less stressful—they attach to your essentials and locate them from your phone via Bluetooth or a ringing function in the companion app. They work with both iOS and Android and have an easy setup process.There’s also a helpful SOS button feature that sends a discreet alert to your Life360 Circle (a private group of friends and/or family members) if you’re ever in an unsafe situation. Another popular feature is Tile’s Community Find, which uses other phones that have the Tile app installed to update the tracker's location anonymously. If you want a more advanced tracker with GPS-level tracking, keep in mind that the Tile tracker relies on Bluetooth and only has a range of 350 feet. Its sealed battery also isn’t replaceable, unlike those in AirTags. For these reasons, it’s not ideal for tracking pets or luggage that might be far away. \n            \n                What do you think so far?\n            \n        \nUltimately, this Tile Mate Tracker 4-Pack makes for a compact, affordable solution that performs well for those who tend to misplace everyday items around the house, car, or office, but those who want more advanced features may want to check out a higher-end model. Still, at 47% off, this bundle makes it a feature-loaded option at a low price point. \n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Four-Pack of Tile Trackers Is Nearly Half Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBJRVPVF327X935CFBZ51P0G/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-03T20:06:10.000Z",
      "dateModified": "2025-12-03T20:06:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]