[
  {
    "title": "ChatGPT's AI Browser Has a Nasty Security Vulnerability",
    "url": "https://lifehacker.com/tech/chatgpt-atlas-clipboard-injection-vulnerability?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BQ233DESR1BWZPBF4ZZWHN/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T20:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            What you're pasting might not be what you copied.\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n                    \n            Credit: Bangla press / Shutterstock\n                            \n            \n                Key Takeaways\n                                            An ethical hacker demonstrated that ChatGPT Atlas is vulnerable to clipboard injection attacks.\n                                            Atlas' agent mode might click on a malicious link that hijacks your clipboard without you knowing it, leading you to paste a malicious link in your browser.\n                                            Agentic browsers like Atlas are susceptible to security vulnerabilities.\n                                    \n            \n    Table of Contents\n    \n        \n        This week, OpenAI released ChatGPT Atlas, the company's first AI web browser. Atlas lets you surf the web like any other browser, but, as you might expect, comes with ChatGPT integration. You can log into your account and tap into the assistant via the sidebar menu, which will remember not only past conversations, but your browsing history as well. Like other AI browsers—namely Perplexity Comet—the browser has an \"agent mode,\" which can take actions on your behalf. You can ask it to order you food through DoorDash or buy you plane tickets on Kayak instead of doing those things yourself.While that might sound useful to ChatGPT fans, I had trouble recommending the browser to people, considering the security vulnerabilities AI browsers are currently facing. Any browser that has agentic features is vulnerable to prompt injection attacks: Bad actors can lace websites with hidden malicious prompts that the AI accepts as if they were written by the user. It might therefore take actions on behalf of the hacker, like opening a financial site or rooting through your email. Seems like a large risk just to outsource some basic internet tasks to an AI bot.But prompt injections aren't the only vulnerability Atlas currently faces. According to a new discovery, the browser may put the user's clipboard at risk as well. \n        \n            You May Also Like\n        \n    \nHow Atlas's clipboard injection vulnerability worksAndroid Authority spotted a post on X by the ethical hacker known as Pliny the Liberator. According to Pliny, ChatGPT Atlas is vulnerable to clipboard injection, a type of attack that allows a bad actor to access your computer's clipboard. The idea is this: A bad actor can add a \"copy to clipboard\" feature to a button on their website. When you click the button, a malicious script runs in the background, which allows the bad actor to access your clipboard and add whatever they want to it. Maybe it's a URL to a website designed to install malware on your devices; maybe it's a URL to a site impersonating a financial site. Whatever the case, you don't know your clipboard has been hacked, so you might open a new tab and paste what you think was the last thing you copied, falling into the trap. The particular risk with ChatGPT Atlas is its agentic features: When in agent mode, Atlas might click a malicious button like this on its own, without you even knowing it. One moment, you've asked Atlas to order you lunch; the next moment, the browser accidentally set you up to be hacked.Pliny says that OpenAI has evidently trained Atlas to recognize prompt injections, but the core \"copy clipboard\" function is hidden away from the AI's sights. It's a clever trick: The bot can hover over the button without knowing anything is wrong with it, so it \"clicks\" it without triggering any red flags. For anyone that copies and pastes items frequently throughout the day, this could be quite dangerous. You might copy something in one app, then ask ChatGPT Atlas to do something on your behalf. But without knowing it, the browser clicks a malicious link that adds something to your clipboard. You then paste in your browser window, thinking you still have the original item copied, but you're taken instead to a website that claims your banking session has expired, and you need to log in. If you're multitasking quickly, you might \"sign in\" without thinking, handing over your bank credentials and 2FA codes without realizing it. These are hypotheticals. At this time, there haven't been documented cases of this type of malicious activity affecting ChatGPT Atlas. At the same time, ChatGPT Atlas is two days old. To me, the risk here doesn't seem worth the execution—especially since I have no issue using the internet on my own.   \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ChatGPT's AI Browser Has a Nasty Security Vulnerability",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BQ233DESR1BWZPBF4ZZWHN/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T20:30:00.000Z",
      "dateModified": "2025-10-24T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube Has a New Look on Mobile",
    "url": "https://lifehacker.com/tech/youtube-has-a-new-look-on-mobile?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BHERH2G90G7G5XZK8Z480G/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T19:30:05.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            And there's not a lot you can do about it.\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n    \n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            YouTube has a new UI on mobile.\n                                            Buttons are bigger and chunkier, and there are some new animations.\n                                            There are extensions for desktop to reverse some of these changes, but not much you can do on mobile.\n                                    \n            \n    Table of Contents\n    \n        \n        Last week, YouTube started rolling out a new look across both the web and its various apps, promising a \"more expressive and intuitive interface.\" In reality, the reaction has been mixed. The TV app, for instance, no longer automatically rewinds or fast forwards when you press back or forward, instead navigating between buttons including \"like\" or \"subscribe.\" More than once while on TV, I've accidentally subscribed to a channel without meaning to, before realizing that I now need to press up first to get to the progress bar.Now, the changes have reached the YouTube mobile app, as first spotted by 9to5Google. While they're a bit more mild than you'll see on TV, there's still a few changes to get used to.Bigger, chunkier icons\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nBy far, the most noticeable new change is YouTube's new suite of icons, which all look like they've been hit with a \"Ctrl + B.\" Compared to the old look, the play, fast forward, and other buttons all look larger and bolder, with the idea being to make them more prominent.\n        \n            You May Also Like\n        \n    \nSome of the buttons have also been consolidated. When watching a video in landscape, buttons that don't affect playback (like, dislike, comment, etc.) all now appear together in a pill in the bottom-left corner, rather than as separate elements.New animationsNew buttons aren't the only change YouTube has in store for you. Seeking videos also has a new animation now, and on some videos, liking now comes with a bit of extra personality.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nThe first is a pretty minor change. Now, when you double tap the screen to either go forward or back 10 seconds, the video will just automatically jump to the new spot and display a big \"-10\" or \"+10,\" rather than showing a quick animation of three arrows disappearing into each other with a smaller \"-10 seconds\" or \"+10 seconds\" below them.\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nThe second is a bit cuter. On certain videos, tapping the \"like\" button will now play a custom animation, rather than simply putting some sparkles around a thumbs up. For instance, on a music video, you'll now briefly see a musical note replacing the thumbs up.Pausing no longer darkens your backgroundIt used to be that pausing a video would darken the background until you unpaused it, kind of like lights being lowered on a stage. That's no longer the case. While you'll still see the lights go slightly down while you have controls open, a paused video will now display as normal if you tap again to dismiss the controls. It's a small tweak, but could prove useful for taking screenshots. At the same time, though, I do worry that it might make it easy to think a video has frozen, if you're not paying attention.Nested comments and easier bookmarksFinally, Google has removed a few steps to saving and commenting on videos. Now, hitting the bookmark icon to save a video to a playlist has fewer steps, no longer requiring you to navigate multiple pages. Instead, it'll just pause the video and open a list of your playlists for you, where you can quickly tap the playlist you want to save your video to.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nAdditionally, comments are threaded now, easily showing who is replying to which comment. It's a great way to keep track of the flow of the conversation, although it does make each comment take up a bit of extra space.Can you get rid of the new YouTube UI?Ultimately, I'm a little torn on the new YouTube app. Certain new features, like threaded comments, just make sense to me. But the chunkier buttons do feel like they get in the way a bit to me, and I can't help but think of Fisher-Price when I see them.Unfortunately, there's not a lot you can do if you don't like the new YouTube mobile interface. It's still rolling out, so it's possible you might not see every change yet. But because it's server-side, once it hits you, that's it. Even the web player is getting these changes, so leaving the app behind isn't a viable option.That said, if you're on desktop, users on both Reddit and YouTube itself are putting together extension lists that you can mix and match to customize your experience. Technically, there are browsers for mobile that will allow you to play with these as well, with Firefox being the big one these days. However, I found that most of the suggested extensions no longer worked for me or weren't available for mobile. In that case, if you're sick of how YouTube looks now, you might want to consider an alternate player app instead, like Play. It still relies on embedded videos, so it won't save you from every change, but its overall minimalist style could offer welcome relief from YouTube's increasingly busy design language.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube Has a New Look on Mobile",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BHERH2G90G7G5XZK8Z480G/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T19:30:05.000Z",
      "dateModified": "2025-10-24T19:30:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Pixels Are Still Having Problems Calling 911",
    "url": "https://lifehacker.com/tech/google-pixels-are-still-getting-911-bugs?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BSWKQV1QJ9ZV3XA00PVQVM/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T21:00:19.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            The problems has persisted since 2021.\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n    \n            Credit: omar hesham2qwe / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            Multiple Google Pixel users yesterday reported that they couldn't call 911.\n                                            The issue has persisted since 2021, in one form or another.\n                                            A Canadian carrier also posted about similar problems, but says they have since been fixed.\n                                    \n            \n    Table of Contents\n    \n        \n        For the past few years, Google's Pixel phones have had recurring problems with calling 911, and the issue has once again reared its ugly head. Over the past 24 hours, multiple users on Reddit have complained about being unable to call 911, while the Bell carrier in Canada issued a warning that the Pixel 6 and up was also having problems contacting emergency services on its network.According to user Fabulous_Disaster730, who posted yesterday about difficulties contacting emergency services during a gas leak, her Pixel 9 Pro repeatedly prompted her to turn on wifi calling or turn off airplane mode before she could call 911, despite her having full signal on both 5G and wifi. The phone would then freeze and restart. After multiple attempts, she resorted to asking a friend to place the call for her instead.Multiple replies mentioned facing similar problems yesterday as well, across multiple networks and models of Pixel. Bell, however, was the only carrier to issue an official notice.\n        \n            You May Also Like\n        \n    \nAside from the obvious danger, the problem with this bug is that it's not consistent. Despite seemingly having had a surge yesterday, it's been a known issue as far back as 2021. However, it doesn't affect all users, nor is it entirely predictable when or how it will pop up. While recent reports are of calls simply not going through, one user posted two months ago that their call did go through, but they only heard screeching and static on the other end of the line. These recent reports are only the latest in an ever-evolving concern.It's also not clear what's causing the problem. In 2021, the problem was attributed to Microsoft Teams, but even with that error patched up, users are still facing problems. To Google's credit, Bell said it reached out to the company shortly after it learned about yesterday's uptick in cases, and afterwards said that a fix had been issued. However, no other carriers have issued similar notices, and I wouldn't be surprised to see other users making their own complaints in the future.It's worth noting that Bell mentioned that Pixel 6 users and up were the ones affected this time around, and that the Pixel 6 also happened to release in 2021, which is when the bug first started making news. Whatever is at the core of the problem here, I wouldn't be surprised if it worked its way in on the Pixel 6 and just hasn't yet been addressed.However, given the severity of the issue, it's something that needs looking at sooner rather than later. I've reached out to Google for comment on this issue, and will update if I hear back. In the meantime, it's best to be prepared in case the worst happens. If you're on a Pixel phone, here's what you can do to contact 911 in an emergency:\n            \n                What do you think so far?\n            \n        \nFirst, try to place a 911 callIf you have time and the danger is not immediate, it's worth trying to call 911 on your Pixel despite the issues. While users reporting problems have increased as of late, it's still not an everyone or every time problem. It's possible your call will still go through without issue.You can also text 911If, however, you are unable to call 911, it's worth remembering that in certain jurisdictions (check this regularly updated list to see if where you live is supported), you can also contact 911 via text. This is a slower method of reaching out for help, but is still better than nothing. To text 911, open your texting app, put in 911 as the recipient, and write a concise message with your issue, your location, and any necessary specifics, like cross streets, landmarks, a specific hiding location, or whether you're able to talk.Use a backup phoneWhile I don't expect someone who isn't constantly reviewing tech to have multiple phones on hand, the surest method to ensure you'll be able to call 911 if you're on a Pixel is to keep a backup phone that isn't a Pixel handy. This could be a landline or another cell phone. Crucially, it can be an old cell phone, even one that isn't actively attached to a phone plan. So long as your phone is able to connect to a network, it's legally required to be able to call 911, so if you have an old phone you've upgraded from and haven't traded in laying around, it may be smart to keep it charged up in case you need it in an emergency.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Pixels Are Still Having Problems Calling 911",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BSWKQV1QJ9ZV3XA00PVQVM/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T21:00:19.000Z",
      "dateModified": "2025-10-24T21:00:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Check This Database to See If Your Email Credentials Have Been Leaked",
    "url": "https://lifehacker.com/tech/leaked-email-credentials-in-database?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K88R3FXB3Z4XKH73YQ5B9HV5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-23T15:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Check This Database to See If Your Email Credentials Have Been Leaked",
      "image": [
        "https://lifehacker.com/imagery/articles/01K88R3FXB3Z4XKH73YQ5B9HV5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-23T15:00:00.000Z",
      "dateModified": "2025-10-23T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here’s When You’ll Be Able to Buy the M5 MacBook Air",
    "url": "https://lifehacker.com/tech/heres-when-you-can-expect-an-m5-macbook-air?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7SDN2HBG96655HCVKQA31H0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-17T17:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Apple may also be working on a MacBook Pro with a touchscreen.\n    \n        \n    \n                                        \n        \n        \n        October 17, 2025\n                    \n            Credit: aapsky/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Bloomberg's Mark Gurman has the scoop on Apple's upcoming Macs, including the M5 MacBook Air and a MacBook Pro with a touchscreen.\n                                            The M5 MacBook Air will likely arrive next spring, alongside other M5 Macs and Mac accessories.\n                                            Apple is also reportedly working on a MacBook Pro with a touchscreen, due out late 2026 or early 2027.\n                                    \n            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.Apple officially entered its M5 era on Wednesday. The company not only announced the new M5 chip, placing a major emphasis on its AI processing power, but also the first batch of new devices that will ship alongside it. If you're interested in buying an Apple device with the company's latest and greatest hardware, it's all just around the corner. That said, the list of product announcements was limited. While Apple revealed M5 versions of the iPad Pro and Vision Pro will be available starting on Oct. 22, it only showed off one M5 Mac: the 14-inch MacBook Pro. The 13- and 15-inch MacBook Airs are still stuck on M4 for now, as are the Pro and Max versions of the 14-inch and 16-inch MacBook Pros. But a few days later, we know when that might change.\n        \n            You May Also Like\n        \n    \nMore M5 Macs are on the horizon If you're holding out on buying one of the current M4 laptops in the hope that Apple will soon upgrade them with M5 chips, you're going to be waiting a little while longer. As Bloomberg's typically reliabe Mark Gurman reports, Apple doesn't plan to refresh its MacBook Air line until next spring. That goes for a host of other Mac products as well, including M5 versions of the Mac Studio and Mac mini, in addition to new Mac monitors. It's a similar story for the M5 Pro and M5 Max MacBook Pros. While Gurman doesn't specify whether these laptops are also coming in the spring, he does report Apple is planning on refreshing the 14- and 16-inch MacBook Pros with the new chips in \"early 2026.\" Gurman says the new MacBook Pros will recycle Apple's current design, and I'd imagine the same will hold true for the M5 MacBook Airs. The M5 14-inch MacBook Pro looks identical to its M4 counterpart, after all, with the only notable changes (other than the M5 chip) being a boosted 24 hour battery life and faster SSD.  If you're currently holding out on buying a new MacBook, I don't think there's much reason to wait for the M5, unless you just really want the newest hardware Apple has to offer. The current M4 machines are excellent, and, in the case of the MacBook Air, can be bought for a very reasonable price—especially when they go on sale. During October Prime Day, stores offered the 13-inch M4 MacBook Air for only $799, which is an excellent value. Apple is also working on a touchscreen MacBook ProIn this same report, Gurman discusses Apple's current plans for a MacBook Pro with a touchscreen, which would be a dramatic refresh—no Mac has ever shipped with a touchscreen, unless you count the controversial Touch Bar (RIP), which only added a touch-based strip to the top of the keyboard. According to Gurman, these touchscreens will be OLED, which the company already uses in its iPad Pros and iPhones. You'll still have the standard keyboard and trackpad, so you could ignore the touchscreen entirely, though Apple is considering replacing Touch ID with Face ID, again mirroring its iPads and iPhones. To that point, the \"notch\" (the large camera cutout at the top of the screen) may be replaced by a smaller hole-punch design, reminiscent of the iPhone's Dynamic Island. Alongside the touchscreen, Apple may update the design of these MacBook Pros to be thinner and lighter, and they may run on the M6 chip, rather than a version of the M5. They may also include a new hinge and lid design to compensate for the force of touching the display. Remember, this would be a new design challenge for the MacBook line, which has never had to deal with users purposely touching the display before.Gurman says the touchscreen MacBook Pro won't debut until late 2026 or even early 2027. When it does arrive, it will likely come with an increased price tag of at least \"a few hundreds dollars more than current versions.\" Right now, the M4 Pro MacBook Pros start at $1,999 for the 14-inch model, and $2,499 for the 16-inch model. Apple would be upgrading the hardware here considerably, so the increased price tag isn't without merit. But if you're looking for the best value Mac possible, it's challenging to beat the current M4 MacBook Air—especially when it's on sale.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here’s When You’ll Be Able to Buy the M5 MacBook Air",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7SDN2HBG96655HCVKQA31H0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-17T17:00:00.000Z",
      "dateModified": "2025-10-17T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Global AWS Outage Is Over, but There's Still Cause for Concern",
    "url": "https://lifehacker.com/tech/global-aws-outage-fixed?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K80W0C7NFQRAP9GYQ5X4ACWK/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-20T14:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global AWS Outage Is Over, but There's Still Cause for Concern",
      "image": [
        "https://lifehacker.com/imagery/articles/01K80W0C7NFQRAP9GYQ5X4ACWK/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-20T14:00:00.000Z",
      "dateModified": "2025-10-20T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft Teams Will Soon Tell Your Boss When You're Not in the Office",
    "url": "https://lifehacker.com/tech/microsoft-teams-will-let-your-boss-know-when-youre-not-in-the-office?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BDF03ZQK8WBMVP6C7F66FK/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-24T16:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft Teams Will Soon Tell Your Boss When You're Not in the Office",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BDF03ZQK8WBMVP6C7F66FK/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-24T16:30:00.000Z",
      "dateModified": "2025-10-24T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube Is Trying to Eradicate Deepfakes With This New Program",
    "url": "https://lifehacker.com/tech/youtube-likeness-detection-program-deepfake?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K848RQZ2AG1NFWNFWDQR4VPB/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-22T14:00:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube Is Trying to Eradicate Deepfakes With This New Program",
      "image": [
        "https://lifehacker.com/imagery/articles/01K848RQZ2AG1NFWNFWDQR4VPB/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-22T14:00:00.000Z",
      "dateModified": "2025-10-22T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How I Used Smart Glasses to Trick a Bartender Into Giving Me a Free Drink",
    "url": "https://lifehacker.com/tech/used-smart-glasses-to-trick-a-bartender?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BY594J33K2J5Q3D41GQHPD/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-24T21:30:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            I can use my glasses to do crime! Who's the nerd now?\n    \n        \n    \n                                        \n        \n        \n        October 24, 2025\n                    \n            Credit: Stephen Johnson\n                            \n    Table of Contents\n    \n        \n        I recently reviewed Even Realities G1 smart glasses (they're very cool) and the first real-world thing I used them for was scamming someone. I told a local bartender I had an encyclopedic knowledge of film, and I would answer the hardest movie trivia question he could come up with in exchange for a drink. After a short consultation with Google, dude came back with \"Who directed 1922's Cabinet of Dr. Caligari?\"I tilted my head thoughtfully and repeated the question as if verifying I heard him right. The AI agent silently did its thing, and in about three seconds, the answer was floating before my eyes, totally invisible to everyone around me. \n    \n            \n            \n                                        Credit: Stephen Johnson\n                    \n    \n\"Robert Wiene?\" I asked, feigning uncertainty. Boom! Free drink. It's not the hardest trivia question, but I could have answered literally anything: the date Dr. Caligari was released, the day of the week it was, or the weather that day—all short work.  \n        \n            You May Also Like\n        \n    \nBartenders know to be wary of bar bets, so this one was watching me like a hawk to make sure I wasn't looking up the answer on my phone or something. He didn't seem to suspect my glasses, and even if he had, it wouldn't have mattered. Even inspected up close, G1s offer no indication of electronics of any kind: No USB port, no flashing light, no visible controls. The AI agent is activated with a subtle tap behind the ear. Repeating the question sends the AI off for the answer, presented in a display that's invisible to everyone but the wearer. You could do the same trick with a pair of Meta Ray-Ban Display glasses or audio-only smart glasses with AI.I don't like deceiving people, so I ended up telling the bartender what was up to and not accepting the drink, but it got me thinking about what more nefarious people than I could do (and probably already are) with AI smart glasses.Just imagine what I did on a bigger level: a team of hustlers at bar trivia silently tapping their temples whenever “which actor played…?” was asked would never lose. It's pretty small stakes, but not hard to imagine. Hypothetically, a hacked pair of smart glasses could be programmed to read the cards in your poker hand and give you the probability of winning in real time, either through the display or whispered in your ear. They could, hypothetically, make counting cards in blackjack effortless and undetectable. Stretching it out further, hypothetically, glasses could scan others players for \"tells\" that they're bluffing, or read micro-expressions to give a constantly updated read on opponents. Along the same lines, imagine attending a self-help meeting, and the leader, who you have never met, says, \"I've had a vision about you\" and begins to describe something that happened in your life exactly. All it would take would be glasses that recognize your face (supposedly coming to Meta Displays) connecting to a social media feed, which is then displayed in real time to the leader. Or you could go more subtle and engineer small \"serendipities\" like mentioning a movie someone recently saw and having exactly their opinion. It would only take a few of these and maybe some mystical patter to convince people you are divine being they should definitely donate to.How to spot tricky smart glassesI could go on, but you get the idea. Luckily, there are some indications when someone is using tech hidden in their eyeglasses. The most important is a general understanding of the possibilities of this technology. If someone seems to know something they shouldn't, ask yourself if their glasses could be the source of their power. Here are some more specific giveaways.Look for identifiable kinds of smart glasses\n    \n            \n            \n                                        Credit: Meta\n                    \n    \nThe most popular display style glasses, Meta Ray-Ban Displays, are distinctive looking, with a fairly obvious camera in one of the corners and a specific look and branding. But other kinds of smart glasses, like the Even Realities G1s mentioned above, are obscure enough that most won't recognize them, and so \"normal\" looking that most people wouldn't pick them out of lineup.Look for where the tech is hiddenMost smart glasses are still fairly bulky, so look for thick arms or frames where the wires are hidden. But again, that's only most smart glasses; some are totally sleek, with imperceptible tech.Look for a small glint In most situations, the display in display glasses is not visible to anyone but the glasses wearer, but there's still light being projected. In a dark room, you can see a green glow, and even if it's not dark, the display windows are visible if the light hits it just right, as you can see here:\n    \n            \n            \n                                        Credit: Stephen Johnson\n                    \n    \nBut honestly, it's subtle and hard to spot. Listen for the soundsOlder styles of audio-only smart glasses can feed information to wearers, but the open-air speakers mean some sound is bleeding into the atmosphere. You can definitely hear smart glasses if you're in a quiet room and you're trying to. If it's loud, operating glasses becomes problematic for the wearer.Look for the source of controlSmart glasses have to be controlled somehow. Meta Display glasses are operated with a wrist band. G1 glasses' AI agent is powered on by tapping on the frames behind your ear. Anyone who practices for a few hours could make these movements seem natural, but they're there if you know what to look for. Odd movements and speechIt doesn't take advanced stagecraft to operate these kinds of glasses imperceptibly, but it does take something. Tells might include small glances upward to see the display, tapping on glasses, stilted speech while waiting for information to come in, and a reading-a-teleprompter style of talking. Watch for people repeating questions back. But understand, it's hard to spot. When I was conning my bartender, I thought how I repeated the question back was obvious, but my wife said I just seemed a little odd, which suits the personality of a trivia whizz anyway. Smart glasses are powerful tools, like a hammer or a calculator. Like any innocent tool, they can be used for nefarious things, so until manufacturers or regulators require obvious indicators, like flashing lights or visible controls, we have to protect ourselves by paying attention to these small cues and staying skeptical when someone seems to know more than they reasonably should.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How I Used Smart Glasses to Trick a Bartender Into Giving Me a Free Drink",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BY594J33K2J5Q3D41GQHPD/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-24T21:30:00.000Z",
      "dateModified": "2025-10-24T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "15 Google Docs Hacks Everyone Should Know",
    "url": "https://lifehacker.com/tech/google-docs-hacks?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HFQEQZEX90CXAG91SB3MMBFW/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-23T12:00:00.000Z",
    "description": "\n        \n        Throughout my academic and professional journeys, one thing has remained my constant ally: Google Docs. Not only is having all your ",
    "body": "\n        \n        Throughout my academic and professional journeys, one thing has remained my constant ally: Google Docs. Not only is having all your documents available no matter where you are helpful, but the software itself is surprisingly versatile and intricate. I have used it for over 15 years to manage basically my entire life.I have never encountered anything I couldn’t do with Google Docs, from signing a contract to seamlessly working with huge groups of collaborators. There are other, smaller hacks for the word processor that you may not even know about, though, whether you're a student or not. Google Docs hacks for essays and notesSo much of schoolwork centers on writing, from essays to memos to notes, so here are the hacks that will serve you best when you’re in the zone on a paper or taking down information in class.\nChange capitalization formattingEasily change the capitalization formatting of anything in the doc by highlighting it and choosing Format, then Text. At the bottom of the menu, you’ll see Capitalization, and hovering over it gives you three options: lowercase, UPPERCASE, and Title Case. When you accidentally type in all-caps or need to make a title but don’t want to rewrite what you already have, this is a little-known quick fix that will save so much time. Paste without formattingIf I have one pet peeve with Google Docs, it's that pasting without formatting isn't standard. When I'm copying something into my document, the last thing I want is for it to be in another font or a giant size. If you've used Google Docs at all, you know it aggressively pushes keyboard shortcuts for some reason, so you can't always right click (or however you have your trackpad set up to \"right click\" or pull up a menu) and hit Paste without formatting. You just have to learn another shortcut: Cd + Shift + V on a Mac and Ctrl + Shift + V on a PC. It just means adding the shift key to the two buttons you're already pressing to paste, and it removes a ton of frustration. Use Voice Typing for note-takingMake note-taking in class easier by selecting Voice Typing from the Tools menu. Once you click the little microphone icon that appears, anything your computer mic pics up will be put into the doc. It won’t be perfect, but it will be editable, so let it jot down everything your professor says, then revise it later for notes that match up with your lecture. Revise your notes strategically, which you can do right in Docs, too. Here are my favorite note-taking formats. If you took notes by hand in class, don't forget to digitize those and add them into the master Google Doc, either. Use an integrated dictionary for papersYou can use Google Docs' built-in dictionary within your doc by going to Tools in the top menu, then hitting Dictionary. You can even highlight a word in the doc and hit Command + Shift + Y to look it up right away. The dictionary appears in the sidebar of the screen, so you don’t need to leave the doc to Google your word. Perhaps best of all, the bottom of the panel shows synonyms that you can swap into your doc to take your vocab up a notch, which is helpful for when you’re writing an essay. (Another dictionary tip: Add any technical terms to your “personal dictionary” so the spell-checker stops flagging them by right-clicking the word and adding it. This works great for those of us with weird last names, too.)Use Find and Replace to quickly edit essaysYou can find and replace text in Google Docs by hitting Command + F. The usual search bar will appear in the top-right of the window, but if you click the three-dot menu, you’ll see not only Find, but Replace. If you’ve been misspelling someone’s name over and over throughout an essay, or using a word too many times, you can replace it quickly. You even have the option to do a full “Replace All,” or jump from instance to instance to decide if you only want to replace a few of them. Make a table of contents with little effortInsert a table of contents from the Insert menu if you need to keep a long doc organized. This only works if you format the headings on your sections by highlighting them, selecting the Format button in the menu, hovering over Paragraph styles, then selecting a header option, but it creates a great table of contents that automatically updates. If information you had on page two ends up on page three after you insert a paragraph of text above it, the table of contents will update on its own, so you don’t have to do it manually. You can also click the headers within the table of contents to quickly navigate to that section of the doc. Google Docs hacks for group projectsVersion History will save lost drafts of papers and deleted notesYou can find older versions of your doc by hitting “Version history” in the “File” menu. I didn’t know about this for a long time, and thought that since Google Docs updates automatically, any revisions I made were permanent. Not so! I’m writing this in Google Docs right now, and the software has saved two different versions in the 45 minutes I’ve been at it. This comes in handy if someone deletes something important or makes a major structural change. Compare documents, tooA similar feature is called Compare Documents and it's best if you're trying to combine input from multiple people or you're working on different drafts. Click Tools and then select Compare documents. A pop-up window will prompt you to upload the document you want to compare (like an older draft or someone else's version of the work) and fill in your name so the changes it finds can be attributable to you. If you're uploading a partner's work to compare to yours, enter their name. Once you've uploaded your document, Google Docs will highlight all the differences and attribute changes to whoever made them. Enable line numbers for long documents or group projectsIf you are working with a bunch of people in a collaborative Google Doc, enable line numbers so you can all quickly reference portions of the work among yourself. The feature simply adds little numbers down the left side of the document. This is particularly helpful if you're editing something massive, like a thesis, because it helps you keep track of exactly where information appears within your document. It's so much easier to tell your project partner they need to address an issue on page two, line seven, than to try to describe which sentence needs attention. Toggle these numbers on by hitting Tools, then Line numbers. In the line numbers sidebar, select Show line numbers.Force collaborators to work on copies, not the actual Google DocI've run across this a few times when working on assignments from professors: I'll open a Google Docs link, usually containing instructions for a project, and find their doc is not editable. So, I have to \"Make a copy\" that generates the document a second time in my Docs. Teachers do this so they can easily distribute a worksheet and all the students can fill it in without affecting the original version everyone has access to. It works well in that scenario, but could also be helpful if you need group members to do some independent work and don't want everyone typing into the primary document at the same time. Click \"Share\" on the top right of the document, change the link settings to \"Anyone with the link,\" and choose \"Editor\" from the dropdown next to it. Next, copy the link and paste it into whatever you're using to share it. Before hitting send, edit the end of the link by replacing the word \"edit\" and everything after it with \"template/preview.\"Use Smart Chips and Building BlocksThere's a newer feature called Smart Chips available that lets you stick interactive elements like dates, tags, files, and calendar events right into your doc. You type \"@,\" like you would if you wanted to tag someone on Instagram, and a list of taggable options comes up. You can use it to tag group members so they are directed to a particular part of the document, link out to source material, or add in deadlines everyone can see at a glance. A complementary feature, Building Blocks, lets you add in pre-made templates using Smart Chips. You can find meeting notes or project trackers, for instance. Try typing \"@project roadmap\" or \"@meeting notes.\"Google Docs hacks for everything elseYou can (and definitely do) use Google Docs for more than just writing essays. Here are some of the most convenient things I’ve been able to do with Google Docs, which usually require multiple programs when using other software. Take advantage of Google KeepFinally, don't forget about Google Keep, the note-taking app that integrates perfectly with Google Docs. I use Google Keep for all kinds of things, like shopping lists and sudden brilliant ideas, but it's excellent for jotting down notes in class, too. Tap the yellow lightbulb icon on the top right while you're in a doc to reveal the Keep sidebar menu, which will allow you to drag and drop notes and ideas straight into your document. There are plenty of note-taking apps out there, but if you're a frequent Google Docs user, I'd highly recommend trying Keep for the Docs integration here. Make editable PDFs with Google Docs (for free)You can turn your PDFs into editable text documents by uploading them to your Google Drive, then hitting “Google Docs” in the “Open With…” menu. I didn’t know you could do this until a few months ago, when my Adobe subscription lapsed and I was refusing to pay for it again on principle, since I only needed to edit one document. There can be some formatting issues when doing this, but for the most part, I’ve found that Google Docs seamlessly turns the PDF into editable text, so it's easy to make changes before saving, again, as a PDF. Sign documents for free, tooSign your documents by adding a “scribble” in Google Docs. I find the extensions for Word too complicated and the online doc editors too expensive, so before I realized you could do this right in Google Docs for free, I was printing out all these documents, signing them with a pen, and uploading pictures of them wherever they needed to go. Humiliating. Famously, I once used the doodle tool in the Instagram Story editor to sign a contract. Beyond humiliating, if innovative. To sign within Google Docs, go to Insert, then Drawing, then New. A box will appear for you to draw in. Just go to the menu option that says Select Line and hit Scribble. Now, scribble your signature in the box, hit save, and you’ll be able to insert it right in the document. Create Google Docs tasks to keep yourself focused You can also add in-text “tasks” to stay on track. This is helpful if you’re working collaboratively with a group or just need to get a massive assignment done on a particular timeline. By typing @task into the doc, you’ll prompt a dialog box that allows you to name the task, delegate it to someone (even yourself), and set a date that it needs to be completed by, so you’ll get reminders. It’s helpful to put a blank page at the beginning or end of your full doc and add all the tasks there. Google Docs puts a little checkbox next to all the tasks, too, so you can tick them off as you go. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "15 Google Docs Hacks Everyone Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01HFQEQZEX90CXAG91SB3MMBFW/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-23T12:00:00.000Z",
      "dateModified": "2025-10-23T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I Put Over 1,000 Miles on a Pair of Cheap Running Shoes, and Here's What I Learned",
    "url": "https://lifehacker.com/health/can-running-shoes-last-for-a-thousand-miles?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K8BE1XP2YAR5CNTGBC9JDX6F/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-24T17:00:17.000Z",
    "description": "We may earn a commission from links on this page.\n    \n        \n        I broke one of the biggest rules in the running book and lived to tell about i",
    "body": "We may earn a commission from links on this page.\n    \n        \n        I broke one of the biggest rules in the running book and lived to tell about it. Everybody knows you need to replace your running shoes after 300 to 500 miles to avoid injury (or 200 to 400, or whatever running companies are saying these days). Well, I put over 1,000 miles on mine, and I’m not sorry. I know it’s been over 1,000 miles because I’ve been tracking my shoes’ mileage in the Garmin Connect app. My watch logs the mileage, and I make sure the credit goes to the appropriate shoe in the app. I carefully ported my shoe miles to and from the Coros app when I switched ecosystems for a bit this past summer. Some of my runs are in a trail shoe, some in a water-resistant shoe, and the rest are in my Nike Downshifters. That four-digit number in the app is real, and I’m sure of it. What are these magic shoes? \n    \n            \n            Some rips in the upper, but honestly looking pretty good for their age.\n                                        Credit: Beth Skwarecki\n                    \n    \nMeet the honored pair. These are the Nike Downshifter 12, in a women’s U.S. size 8.5. I bought them from Amazon in 2024 and paid $66.94 including tax. As I’m writing this, my records show I’ve worn them for 294 activities since June 25 of last year, and they’ve logged a total of 1,024 miles in running workouts. (That’s 6.5 cents per mile, surely a personal record.) For context I run about 20-30 miles most weeks, often but not always in these shoes. \nThe Downshifter is a beginner-level running shoe from Nike, but I’m a lifelong runner, not a beginner. I bought my first pair of them out of frustration with other shoes. See, I always bought Nike Frees, but Nike kept changing the Free from year to year. Some I liked, some I didn’t. Over time, it seemed like the Frees were getting more expensive every year, and wearing out sooner. Often within a few months of purchase, the foam underfoot would wear unevenly and I’d be running on uncomfortable lumps.So one day in 2023, I decided I needed to find a shoe that would either last longer, or would be cheap enough that I wouldn’t care. (I ended up with a shoe that checked both boxes.) I browsed sales and bought two pairs, including a purple pair of Downshifter 12’s. I didn’t love them right out of the box, but over the season, they became my favorites. I ran in them all spring and summer, and then ran a half-marathon in them that fall. Afterward, I looked up some reviews of the Downshifters, just for fun. One said that the Downshifter is “not the shoe for runners regularly going over four miles.” I laughed. I replaced those purple Downshifters with a new (black) pair in 2024, just because it had been a while and they were probably close to the oft-advised 500-mile limit. That’s what you’re supposed to do, right? Why did I put 1,000 miles on these shoes? Fate had something different in mind for these new Downshifters. I was curious how long they would last, so I entered them into the gear logging section of my Garmin app. When you add a new shoe, Garmin asks you to set a mileage target so it can let you know when to replace them. I put 500. After every run, Garmin would automatically add up my miles. (If I ran in a different pair of shoes, I’d make sure to note that—I’ve put about 200 miles each on two other pairs of shoes within this timeframe.) When I had over 400 miles on the black Downshifters, I ordered a new pair, which still sits untouched in its shoebox to this day. At 500, I ignored the notification to replace my shoes. At 600, “I wonder if I can get these to 1,000” was a dumb thought that entered my head and did not leave. For comparison, here is how they looked at 500 miles: \n    \n            \n            How they looked at 500 miles. There's still some tread on the heel, and the upper is in OK shape.\n                                        Credit: Beth Skwarecki\n                    \n    \nI kept tracking my shoe mileage carefully. This dumb thought is why I was so particular about keeping the miles-per-shoe numbers accurate even when I switched apps. The day I hit 1,000 was an anti-climax. I remember them being at 998 miles before joining my husband for an early morning run a few weeks ago. I mentioned to him during the run that the shoes were probably crossing 1,000 miles at that exact moment. “Nice!” he said, and we jogged on. I’ve kept running in them since then. I ran in them today. They feel fine. Why I think these shoes lasted so longI’m no shoe-construction expert, but judging from the feel, it seems there’s just a simple slab of foam under my foot. My previous pairs, the less-durable ones, may have had lighter foams and they usually had more complicated shapes, with cutouts and grooves and such. The running shoes on the market are all so different that I don’t think it’s fair to come up with a blanket mileage recommendation that applies to everything. I’ve had running shoes that felt awful to run in after probably less than 100 miles. And then there are others that can go, apparently, 10 times as long. These Downshifters are the first pair where I confirmed the exact mileage, but I can think of two other pairs that seemed to last forever: an original 2004 Free 5.0, and a “Free RN Distance” from sometime in the 2010s. I replaced the 2004s when I realized I needed to go a half size bigger to avoid black toenails during marathon training. (No idea of the mileage, but I’d been using them off-and-on for eight years at that point.) I got rid of the RN Distance shoes during a decluttering binge because I hated the color. I soon regretted that decision. Neither pair actually wore out. My unscientific opinion is that these shoes lasted so long because they were simple. Just a slab of foam, no fancy shaping, and certainly no high-performance foam technology that might give better dynamics at the cost of longevity. Or maybe I was just lucky. Who knows.What I think of shoe mileage rules in generalThe advice to replace your shoes after 300 to 500 miles originated with a 1985 study that only tested shoes up to 500 miles, no further. It used a machine to simulate the effects of running. After 50 miles, shoes from several manufacturers only had 75% of their initial shock absorption capability. Between 250 and 500 miles, they were down to 60%. (The machine was harder on the shoes than actual runners; after 500 miles, human-worn shoes still had 70% of their initial shock absorption.) Surely shoe foams in 2025 are not the same as in 1984. And surely the various shoe models on the market are all different from each other in construction and foam type. But still the 300 to 500 mile rule has persisted, and I have to wonder if shoe makers are designing their shoes to meet the expectation of a 300 to 500 mile lifespan. A fascinating article at Runner’s World gets into detail about the different foams that are used these days and what we know about how long they last. Some “super shoes” lose their peak performance after just 100 miles, but even a worn-out super shoe may still perform better than a brand new budget shoe. The article doesn’t make any mileage recommendations, instead landing on advice to “listen to your body, rather than relying on arbitrary yardsticks.” I’ve also collected some advice from experienced runners on Reddit on how often they actually switch out their shoes, and as you might expect, the answers are all over the place. There are people who set a hard cap on the mileage they’ll allow a shoe to accrue, and others who go based on vibes. Some people only get 300 miles out of each pair; others say they routinely take theirs into the quadruple digits. Ultimately I don’t think much of any rule, and I’m skeptical of the idea that worn-out shoes are a recipe for injury. Running itself is a recipe for injury—I dare you to find an experienced runner who hasn’t dealt with some type of overuse injury, even if they follow every rule in the book. I think some runners use a shoe mileage cap as sort of a good-luck talisman. But injury isn’t that predictable, and neither our bodies nor our shoes will always behave in a predictable way over the years. Some shoes agree with our bodies better than others, and some last longer than others. When you find a pair that works for you, you might as well stick with it. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I Put Over 1,000 Miles on a Pair of Cheap Running Shoes, and Here's What I Learned",
      "image": [
        "https://lifehacker.com/imagery/articles/01K8BE1XP2YAR5CNTGBC9JDX6F/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-24T17:00:17.000Z",
      "dateModified": "2025-10-24T17:00:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here's What's New With Veo 3.1, Google's Latest AI Video Model",
    "url": "https://lifehacker.com/tech/google-ai-video-veo-31?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K7SQB76SEB0CT85NT4HVPYJ7/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-17T20:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n",
    "body": "\n    \n        \n            \n                \n            \n                \n                    \n                        \n                            \n                            \n                            View our Bluesky Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Instagram Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View on Facebook Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Youtube Page (Opens in a new tab)\n                        \n                    \n                    \n                        \n                            \n                            \n                            View our Twitter Page (Opens in a new tab)\n                        \n                    \n                \n                \n                    \n                    \n                \n                \n        \n            \n                Latest\n                Tech\n                Best Picks\n                Entertainment\n                Health\n                Reviews\n                Home & Garden\n                Deals\n                Comparisons\n                Hacks\n                                    # The Difference Between the Dark Web and Deep Web\n            \n    \n            \n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            Even more ways to make AI-generated videos.\n    \n        \n    \n                                        \n        \n        \n        October 17, 2025\n                    \n            Credit: Google DeepMind/YouTube\n                            \n            \n                Key Takeaways\n                                            Google announced its latest AI video model this week, Veo 3.1.\n                                            The new model is capable of generating convincing clips, with features like the ability to add any element into a scene, or extend a clip.\n                                            Is it really a good thing that companies like Google are making it easy to generate hyper-realistic scenes?\n                                    \n            \n    Table of Contents\n    \n        \n        Did you know you can customize Google to filter out garbage? Take these steps for better search results, including adding my work at Lifehacker as a preferred source.OpenAI's new Sora app has been the main focus concerning hyper-realistic AI slop over the past few weeks. Sora makes it all too easy for users to generate short-form videos that seem real enough to most people, including videos that showcase real people's likenesses.But before Sora dropped, it was Google that was stirring fears about these realistic AI videos. With Veo 3, Google launched an AI model that not only produced lifelike videos, it also generated realistic audio synced to the action. Sound effects, environments, even dialog could all generate alongside the video itself, selling the effect entirely from one simple prompt. \n        \n            You May Also Like\n        \n    \nVeo 3.1Now, Google is back with an upgrade to Veo, appropriately named Veo 3.1, which the company announced in a blog post on Wednesday. This isn't necessarily an overhaul or a revolutionary new video model. Instead, Veo 3.1 builds on top of Veo 3, adding \"richer audio\" and \"enhanced realism\" that Google says generates \"true-to-life\" textures. The new model also reportedly supports new narrative controls tools, which pairs with new upgrades to Flow, Google's AI video editor. Flow users now have more granular controls when editing, and can add audio to existing features like \"Ingredients to Video,\" \"Frames to Video,\" and \"Extend.\" What does that mean in practice? According to Google, Ingredients to Video with Veo 3.1 lets users add references images to their scenes, such as a specific person, clothing items, or an environment. The new Flow editor can then insert those elements into the finished product, as you can see in the demo video below: \nBuilding off of this new feature, Flow now lets you add new elements to an existing scene as well. With \"Insert,\" you can tell Veo 3.1 to add new characters, details, lighting effects, and more to the clip. Google says it is also working on the opposite as well, to allow users to remove any elements they don't like from a generation.\nGoogle also now has a new way for users to dictate how they'd like a scene to generate, called \"First and last frame.\" Users can choose reference frames for the beginning and ending of a scene. Flow with Veo 3.1 will then fill in the gap, and generate a scene that starts and ends based on those images. \nThere's also now a way to create videos that are longer than previous iterations of Flow would generate. The new \"Extend\" feature lets you either continue the action of the current clip, or cut to a new scene that follows it, though Google says the feature is most useful for generating a longer establishing shot. According to the company, Extend can create videos that last over a minute.\nVeo 3.1 is available for users in the Gemini app as well as Vertex AI, as long as you have a Google AI Pro subscription. Developers can access it via the Gemini API. Google says Ingredients to Video, First and last frame, and Extend are coming to Gemini API, but \"Add object\" and \"Remove object\" are not available. \"Extend\" is also not yet available in the Vertex AI API. Is this really a good thing?Google sees all of these advancements as a boon for creatives and creativity, but I'm highly skeptical. I could see Veo 3.1 and Flow as a good tool for envisioning shots before filming or animating them (i.e. a storyboarding tool), or even a way for new and budding filmmakers to learn editing by seeing their ideas in a more realized form. However, as a whole, I don't think AI-generated content is the future—or, at least, not a future most of us want. Sure, there's humor or novelty in some of these AI-generated videos, but I'd wager most of the people who enjoy them do so ironically, or exclusively to social media. The idea of replacing human filmmakers and actors with AI generations seems absurd, especially when it puts all of us at risk of disinformation. Is it really so important for companies like Google and OpenAI to make it easy to generate hyper-realistic fully-rendered scenes, when those videos could so easily be used to trick the masses? This could be the ramblings of someone resistant to change, but I don't think most of us would like to see our favorite shows and movies made with passion and emotion, replaced by realistic-looking people delivering muted and robotic performances.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's What's New With Veo 3.1, Google's Latest AI Video Model",
      "image": [
        "https://lifehacker.com/imagery/articles/01K7SQB76SEB0CT85NT4HVPYJ7/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-17T20:00:00.000Z",
      "dateModified": "2025-10-17T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why You Should ‘Eat the Frog’ First Thing in the Morning",
    "url": "https://lifehacker.com/eat-the-frog-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GNJPPQER0BNX0MMSX8XCE/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-24T12:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why You Should ‘Eat the Frog’ First Thing in the Morning",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GNJPPQER0BNX0MMSX8XCE/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-24T12:30:00.000Z",
      "dateModified": "2025-10-24T12:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What's New on Netflix in November 2025",
    "url": "https://lifehacker.com/entertainment/whats-new-on-netflix-in-november-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K866E5SKWSJTSM0ZZ6HVDH2N/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-10-22T15:30:00.000Z",
    "description": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our missio",
    "body": "\n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What's New on Netflix in November 2025",
      "image": [
        "https://lifehacker.com/imagery/articles/01K866E5SKWSJTSM0ZZ6HVDH2N/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-10-22T15:30:00.000Z",
      "dateModified": "2025-10-22T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AWS Isn't the Only Company Holding Up the Internet",
    "url": "https://lifehacker.com/tech/aws-isnt-the-only-company-holding-up-the-internet?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01K83RN0KFSZ6FCFSSRE3GZ7T4/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-10-21T19:30:00.000Z",
    "description": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n           ",
    "body": "\n            \n        \n    \n        \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                \n                    \n                    \n                \n            \n            \n                Copied\n            \n        \n    \n            A lot of companies rely on cloud-based computing, but Amazon isn't the only provider.\n    \n        \n    \n                                        \n        \n        \n        October 21, 2025\n    \n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Monday's AWS outage took down a lot of sites and services, but it's not the only such company out there.\n                                            Microsoft Azure and Google Cloud are its main competitors, but other companies are also popular.\n                                            While the market isn't totally centralized, three companies have the majority of the market share.\n                                    \n            \n    Table of Contents\n    \n        \n        For many of us, Monday was a workday defined by the AWS outage. Amazon Web Services experienced intermittent issues, throwing a huge fraction of the internet into chaos, as the sites and services built on it faltered or stopped working altogether. It was a sobering reminder that a lot of the world relies on AWS for networking, computing, and data storage. Truth be told, I was surprised to learn just how owned we really are, especially after a number of my work apps experienced issues. In fact, over four million business with a physical address use AWS for cloud-computing needs. It is the largest cloud infrastructure servicer in the world, with a whopping 30% of the market share. That's why when a global outage like this occurs, it's impossible to ignore: So many companies and products are affected, from streaming platforms like Prime Video, to social media sites like Facebook, that almost everyone who goes online will experience the disruption.But 30% is not 100%. AWS might be the market leader, but it is not the entire market. There are plenty of other cloud infrastructure companies out there offering similar services—and posing similar risks should they experience outages. \n        \n            You May Also Like\n        \n    \nWhy use a cloud infrastructure company?It's not necessarily a bad thing for companies turn to an AWS for their computing needs. It's simply much more cost efficient to outsource the resources necessary for running programs, storing data, and hosting traffic, especially as businesses rapidly grow and change. Rather than spend the time and money constantly purchasing and upgrading on-site hardware, companies can pay for servers as they go. Companies like AWS will scale up or down as needed, without interruption to service—until, of course, there is an interruption to services.These companies can offer a host of cloud-based services and tools, including compute, databases, machine learning, networking, security, and storage. AWS just so happens to be the biggest of the bunch, but plenty of companies choose other cloud infrastructure options for their needs.\n            \n                What do you think so far?\n            \n        \nAWS alternativesThere are many other companies offering the same services as AWS, but for our purposes, I'm going to list seven of the most popular, starting with AWS' main competitors: Microsoft Azure: Microsoft's cloud computing services is only second to AWS in terms of global market share. Microsoft obviously uses its own cloud infrastructure, but plenty of other companies do too, including Ralph Laruen, Best Buy, Procter & Gamble, Coca Cola, Abercrombie & Fitch, and even local, state, and federal governments.Google Cloud: Google Cloud is the third largest player in this space, with companies like Lowe's, Wendy's, EA, Fox Sports, Bayer, and McLaren all using its services. Alibaba Cloud: Alibaba Cloud has a large cloud computing market share, and is used by companies like Air Asia, Zara, Lenovo Group, and JNE Express. Oracle Cloud: Oracle Cloud includes customers like Quest Diagnostics, Baylor University, Smeg, Northwell Health, DHL, and MEO.Salesforce: Companies like Pacers Sports, Indeed, F1, and The Adecco Group use Salesforce's data cloud services.   IBM Cloud: Deloitte, Pfizer, Harvard, Vodafone, and even the US Open purchase cloud products from IBM Cloud.Tencent Cloud: You might know Tencent particularly from its massive games division, but its cloud services are also wide reaching. They include services for companies like L'Oréal Paris, Tim Hortons, and Dell, as well as its own subsidiaries like Supercell and DouYu. If there's a silver lining here, it's that there are more than just two or three companies powering sites and services around the globe, and we're not quite at the point where every company connected to the internet relies on AWS, Azure, and Google Cloud. That level of centralization would pose even larger risks than the ones we're currently living with.Still, present circumstance are, still pretty risky. AWS has 30% of the market share, Azure has 20%, and Google Cloud has 12%. Taken together, these three companies make up 62% of all cloud infrastructure companies around the globe. Yes, it's good the other 38% is spread out amongst a collection of other players, but the risk of another AWS-like outage is high. Hopefully, following Monday's debacle, there is work currently being done to prevent such a thing from happening again, but that's being optimistic.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n            Senior tech editor\n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n            \n                \n                        Keep Scrolling for Next Article\n                    \n                \n            \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AWS Isn't the Only Company Holding Up the Internet",
      "image": [
        "https://lifehacker.com/imagery/articles/01K83RN0KFSZ6FCFSSRE3GZ7T4/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-10-21T19:30:00.000Z",
      "dateModified": "2025-10-21T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]